{
  "date": "2016-02-08T11:55:08+00:00",
  "directions": [
    "If using dried mushrooms: Cover the mushrooms with boiling water in a small bowl, and let stand until softened, about 30 minutes. Drain and coarsely chop the mushrooms.",
    "In a large saucepan, heat the canola oil.  Add the pork, garlic, ginger and 1/2 cup scallions and cook over moderately high heat, stirring occasionally, until the pork is golden brown, about 3 minutes. Stir in the stock and add the bamboo shoots (if using), tofu, 1/3 cup of vinegar, the soy sauce, sugar, pepper, sesame oil, mushrooms and 1 tablespoon Sriracha. Bring the soup to a simmer and season with salt. While stirring constantly, drizzle in the eggs and cook until strands form, about 1 minute. Serve hot, garnished with extra scallions if desired, passing rice vinegar and Sriracha at the table."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/hot-and-sour-soup11.jpg?w=640",
  "ingredient_list": [
    "1 ounce (1/2 cup) dried wood ear mushrooms or 5 fresh button or shiitake mushrooms, wiped clean and thinly sliced",
    "2 tablespoons canola oil or other neutral cooking oil",
    "1/2 pound lean pork shoulder, sliced 1/8 inch thick and cut into 1-by-1/4-inch strips, or 1/2 pound ground pork",
    "1 tablespoon finely chopped garlic",
    "1 tablespoon finely chopped peeled fresh ginger",
    "1/2 cup chopped scallions, plus more for garnish, if desired",
    "4 cups chicken stock or low-sodium broth",
    "1/3 cup (about 2 ounces) bamboo shoots, drained",
    "1/2 pound soft tofu, cut into 1/2-inch dice",
    "1/3 cup unseasoned rice vinegar, plus more for serving",
    "3 tablespoons soy sauce",
    "1 teaspoon sugar (I skipped this)",
    "1 teaspoon black or white pepper",
    "1 teaspoon toasted sesame oil",
    "1 tablespoon Sriracha, plus more for serving",
    "Kosher salt",
    "2 large eggs, beaten"
  ],
  "tags": [
    "Chinese",
    "Gluten-Free",
    "Meat",
    "Mushrooms",
    "Photo",
    "Quick",
    "Soup",
    "Weeknight Favorite"
  ],
  "title": "hot and sour soup",
  "url": "https://smittenkitchen.com/2016/02/hot-and-sour-soup/"
}