[
    {
        "ingredient_list": [
            "2 large onions, chopped (about 3 cups)", 
            "1/4 cup vegetable oil", 
            "1 tablespoon minced garlic", 
            "2 carrots, sliced thin (suggested by Gourmet) or in a small dice, as I’d chop them next time", 
            "3 pounds boneless beef chuck, ground coarse or 3 pounds ground beef", 
            "1/4 cup chili powder", 
            "1 tablespoon ground cumin", 
            "2 tablespoons paprika", 
            "1 tablespoon crumbled dry oregano", 
            "Dried red pepper flakes, to taste (Gourmet suggests 1 tablespoon; I used 1 teaspoon knowing that my flakes are very hot)", 
            "2 8-ounce cans tomato sauce or 2 cups fresh tomato sauce or tomato puree", 
            "1 1/4 cups beef broth", 
            "3 tablespoons cider vinegar", 
            "1 3/4 cups or 1 19-ounce can kidney beans, rinsed and drained", 
            "2 green bell peppers, chopped", 
            "Sour Cream and Cheddar Biscuits, below", 
            "Sour cream and pickled jalapeños (optional, to finish)", 
            "1 1/2 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "2 tablespoons cold unsalted butter, cut into bits", 
            "1/4 pound sharp Cheddar cheese, coarsely grated (about 1 1/2 cups)", 
            "Drained and chopped pickled jalapeños, to taste (I used about 2 tablespoons)", 
            "1 cup sour cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/beef-chili-sour-cream-and-cheddar-biscuits1.jpg?w=500", 
        "tags": [
            "Beef", 
            "Freezer Friendly", 
            "Photo", 
            "Scones/Biscuits", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2010/09/beef-chili-sour-cream-and-cheddar-biscuits/", 
        "title": "beef chili + sour cream and cheddar biscuits", 
        "directions": [
            "Preheat oven to 425°F. Whisk together the flour, baking powder, baking soda and salt in a large bowl. Either cut the butter pieces into the flour mixture with a pastry blender or rub them in with your fingertips until well-combined. Stir in the cheddar, jalapeños and sour cream until the mixture forms a sticky dough. Pat it out to a 1/2-inch thickness on a very well-floured counter and use a 3 1/2-inch biscuit cutter to cut six rounds. Bake on an ungreased (or parchment-lined, if your baking sheets are as “weathered” as mine are) for 15 to 17 minutes, until golden on top.", 
            "Do ahead: If you’d like to serve them over a couple days, I recommend freezing already formed but unbaked biscuits until you are ready to bake them — you can bake them directly from the freezer, adding just a minute or two to the baking time."
        ], 
        "date": "2010-09-27T14:35:19+00:00"
    }, 
    {
        "ingredient_list": [
            "2 hard-boiled large eggs, chopped into bits", 
            "1/2 medium onion, finely chopped", 
            "1 tablespoon olive oil", 
            "1 garlic clove, finely chopped", 
            "1 teaspoon ground cumin", 
            "3/4 teaspoon dried oregano", 
            "3/4 pound ground beef chuck", 
            "2 tablespoons raisins (optional)", 
            "1 1/2 tablespoons chopped pimiento-stuffed olives", 
            "1 (14-ounce) can whole tomatoes in juice, drained, reserving 2 tablespoons juice, and chopped", 
            "1 package frozen empanada pastry disks, thawed (or homemade, recipe follows)", 
            "4 1/2 cups unbleached all-purpose flour (I used 1 1/2 cups whole wheat flour + 3 cups all-purpose)", 
            "3 teaspoons salt", 
            "2 sticks (1 cup or 8 ounces) cold unsalted butter, cut into 1/2-inch cubes", 
            "2 large eggs", 
            "2/3 cup ice water", 
            "2 tablespoons distilled white vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/beef-empanadas1.jpg?w=500", 
        "tags": [
            "Beef", 
            "Freezer Friendly", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/03/beef-empanadas/", 
        "title": "beef empanadas", 
        "directions": [
            "Sift flour with salt into a large bowl and blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal with some (roughly pea-size) butter lumps. Beat together egg, water, and vinegar in a small bowl with a fork. Add to flour mixture, stirring with fork until just incorporated. (Mixture will look shaggy.) Turn out mixture onto a lightly floured surface and gather together, then knead gently with heel of your hand once or twice, just enough to bring dough together. Form dough into two flat rectangles and chill them, each wrapped in plastic wrap, at least 1 hour. Dough can be chilled up to 6 hours total."
        ], 
        "date": "2009-03-23T16:45:52+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 pound ground chicken", 
            "1 teaspoon soy sauce", 
            "3/4 teaspoon kosher salt", 
            "1 1/2 teaspoons toasted sesame oil", 
            "1 1/2 teaspoons grated fresh ginger", 
            "3 tablespoons minced garlic chives, regular chives or scallions", 
            "Ground white pepper, to taste", 
            "50 wonton wrappers (about 12 ounces), thawed if frozen, thinnest ones you can find", 
            "Cornstarch, to prevent sticking", 
            null, 
            "A 3-inch piece of ginger, peeled and sliced", 
            "2 large garlic cloves, crushed", 
            "1 bundle scallions, to be used here and to finish", 
            "Soy sauce or salt, to taste", 
            "3 ounces baby spinach leaves (a few handfuls)", 
            "Toasted sesame oil and soy sauce, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/01/chicken-wonton-soup.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Chinese", 
            "Photo", 
            "Soup", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2017/01/chicken-wonton-soup/", 
        "title": "chicken wonton soup", 
        "directions": [
            "Make your filling: Combine chicken, soy sauce, salt, sesame oil, ginger, chives and pepper in a bowl with a fork. If you’d like to test for seasoning, put a tiny dab in a microwave-safe bowl or plate and cook for 10 very splattery seconds. Adjust flavors as desired.\nForm your wontons: Place a few wontons wrappers on your counter. Cover the remaining ones with a piece of plastic wrap. Place 1 heaped teaspoon (from a measuring spoon set) in the center. Use your fingers dipped in water to dampen the edges. Fold one corner diagonally across to the other, pressing air out as you seal it shut. Then, bring the two corners on the wide side of the triangle down below it and use a dab of water to seal them shut. You’re not trying to pull the corners across the belly, but pointing downward. Lightly sprinkle a big plate with cornstarch and place form wontons on it. Repeat with remaining wontons. I found that after I’d made a couple and got the hang of it, I could lay out 6 at a time and get each batch of 6 done in 2 minutes, meaning that this process took me about 20 minutes total.\nFix up your stock (optional): While you’re forming wontons, should you want to enhance your stock (see note up top first), chop the white and light green parts of your scallions into 1/2- to 1-inch segments. Cut dark green tops into thin slivers and save for garnish later. Place stock in 3 to 4-quart pot with sliced ginger, the white and light green scallions you’ve just chopped, garlic and soy sauce or salt, as needed, to season. Simmer them together for 20 minutes while you make the wontons, then strain out the ginger, scallions and garlic.", 
            "Cook the wontons: Once your wontons are formed, you can cook them right in the simmering broth or you can do so in simmering water — the latter is better so that the cornstarch on the wrappers doesn’t make the soup cloudy. Boil wontons for 3 minutes to cook them inside; this is really all it takes, but if you’re nervous, cut one in half to make sure.\nTo finish soup: Add spinach to simmering broth and let cook for one minute, until softened. Add cooked wontons to broth and let them warm through again for 30 seconds. Ladle wontons and soup into bowls. I used about 1 1/4 cups broth and 6 wontons per serving. Drizzle each dish with a little toasted sesame oil, a bit of soy sauce (if desired) and scatter with reserved dark green scallion tops. Dig in.\nDo ahead: Wontons can be formed and refrigerated for a day, or frozen for a month or longer."
        ], 
        "date": "2017-01-06T13:17:38+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound salt pork, pancetta or bacon, diced", 
            "1 large onion, finely diced", 
            "3 shallots, chopped", 
            "4 tablespoons butter, as needed", 
            "2 pounds beef chuck, in 1-inch cubes", 
            "2 tablespoons flour", 
            "Salt and freshly ground black pepper", 
            "1/2 cup Cognac (see Note)", 
            "2 cups unsalted beef stock", 
            "1/2 cup smooth Dijon mustard", 
            "4 tablespoons coarse Dijon or Pommery mustard (see Note)", 
            "4 medium carrots, peeled and cut into half-moon slices", 
            "1/2 pound mushrooms, stemmed, cleaned and quartered", 
            "1/4 cup red wine (see Note)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/dijon-and-cognac-beef-stew.jpg?w=750", 
        "tags": [
            "Beef", 
            "Date Night", 
            "French", 
            "Photo", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/02/dijon-and-cognac-beef-stew/", 
        "title": "dijon and cognac beef stew", 
        "directions": [
            "Place salt pork in a Dutch oven or a large heavy kettle over low heat, and cook until fat is rendered. Remove solid pieces with a slotted spoon, and save for another use, like your salad, vegetables or, uh, snacking. Raise heat to medium-low, and add onion and shallots. Cook until softened but not browned, about 10 to 15 minutes. Use a slotted spoon to transfer to a large bowl.", 
            "If necessary, add 2 tablespoons butter to the pan to augment fat. Dust beef cubes with flour, and season lightly with salt and more generously with pepper. Shake off excess flour, and place half the cubes in the pan. Cook over medium-high heat until well browned, almost crusty, on all sides, then transfer to a bowl with onions. Repeat with remaining beef.", 
            "Add Cognac to the empty pan, and cook, stirring, until the bottom is deglazed and any crusted-on bits come loose. Add stock, smooth Dijon mustard and 1 tablespoon coarse or Pommery mustard. Whisk to blend, then return meat and onion mixture to pan. Lower heat, cover pan partway, and simmer gently until meat is very tender, about 1 1/4 hours.", 
            "Add carrots, and continue simmering for 40 minutes, or until slices are tender. As they cook, heat 2 tablespoons butter in medium skillet over medium-high heat, and sauté mushrooms until browned and tender. Stir mushrooms into stew along with remaining mustard and red wine. Simmer 5 minutes, then taste, and adjust seasoning. Serve hot."
        ], 
        "date": "2014-02-24T12:16:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup peanut oil", 
            "2 tablespoons minced garlic", 
            "2 tablespoons minced ginger", 
            "Salt", 
            "2 cups thinly sliced leeks, white and light green parts only, rinsed and dried", 
            "4 cups day-old cooked rice; Vongerichten recommends jasmine (I used brown jasmine) but this is the perfect way to use up any leftover rice you have, especially from Chinese delivery", 
            "4 large eggs", 
            "2 teaspoons sesame oil (for some heat but the same awesome flavor, use hot sesame oil)", 
            "4 teaspoons soy sauce"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/02/ginger-fried-rice.jpg?w=752", 
        "tags": [
            "Budget", 
            "Chinese", 
            "Eggs", 
            "Grain/Rice", 
            "Leeks", 
            "Photo", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/02/ginger-fried-rice/", 
        "title": "ginger fried rice", 
        "directions": [
            "In a large skillet, heat 1/4 cup oil over medium heat. Add garlic and ginger and cook, stirring occasionally, until crisp and brown. With a slotted spoon, transfer to paper towels and salt lightly.", 
            "[It hadn’t been clear to me whether I was supposed to remove the old oil and bits of garlic I didn’t get out and wipe out the pan before proceeding. I didn’t. Everything worked out fine.] Reduce heat under skillet to medium-low and add 2 tablespoons oil and leeks. Cook about 10 minutes, stirring occasionally, until very tender but not browned. Season lightly with salt.", 
            "Raise heat to medium and add rice. Cook, stirring well, until heated through. [I cooked this slightly longer because I wanted my rice to pick up a little more color and crunch.] Season to taste with salt.", 
            "In a nonstick skillet (it just makes it easier) fry eggs in remaining oil, sunny-side-up, until edges are set but yolk is still runny.", 
            "Divide rice among four dishes. Top each with an egg and drizzle with 1/2 teaspoon sesame oil and 1 teaspoon soy sauce. Sprinkle crisped garlic and ginger over everything and serve. "
        ], 
        "date": "2010-02-05T16:38:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1 ounce (1/2 cup) dried wood ear mushrooms or 5 fresh button or shiitake mushrooms, wiped clean and thinly sliced", 
            "2 tablespoons canola oil or other neutral cooking oil", 
            "1/2 pound lean pork shoulder, sliced 1/8 inch thick and cut into 1-by-1/4-inch strips, or 1/2 pound ground pork", 
            "1 tablespoon finely chopped garlic", 
            "1 tablespoon finely chopped peeled fresh ginger", 
            "1/2 cup chopped scallions, plus more for garnish, if desired", 
            "4 cups chicken stock or low-sodium broth", 
            "1/3 cup (about 2 ounces) bamboo shoots, drained", 
            "1/2 pound soft tofu, cut into 1/2-inch dice", 
            "1/3 cup unseasoned rice vinegar, plus more for serving", 
            "3 tablespoons soy sauce", 
            "1 teaspoon sugar (I skipped this)", 
            "1 teaspoon black or white pepper", 
            "1 teaspoon toasted sesame oil", 
            "1 tablespoon Sriracha, plus more for serving", 
            "Kosher salt", 
            "2 large eggs, beaten"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/hot-and-sour-soup11.jpg?w=640", 
        "tags": [
            "Chinese", 
            "Gluten-Free", 
            "Meat", 
            "Mushrooms", 
            "Photo", 
            "Quick", 
            "Soup", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/02/hot-and-sour-soup/", 
        "title": "hot and sour soup", 
        "directions": [
            "If using dried mushrooms: Cover the mushrooms with boiling water in a small bowl, and let stand until softened, about 30 minutes. Drain and coarsely chop the mushrooms.", 
            "In a large saucepan, heat the canola oil.  Add the pork, garlic, ginger and 1/2 cup scallions and cook over moderately high heat, stirring occasionally, until the pork is golden brown, about 3 minutes. Stir in the stock and add the bamboo shoots (if using), tofu, 1/3 cup of vinegar, the soy sauce, sugar, pepper, sesame oil, mushrooms and 1 tablespoon Sriracha. Bring the soup to a simmer and season with salt. While stirring constantly, drizzle in the eggs and cook until strands form, about 1 minute. Serve hot, garnished with extra scallions if desired, passing rice vinegar and Sriracha at the table."
        ], 
        "date": "2016-02-08T11:55:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound firm tofu", 
            "1/2 cup coarsely grated carrots", 
            "1/2 cup shredded Napa cabbage", 
            "2 tablespoons finely chopped red pepper", 
            "2 tablespoons finely chopped scallions", 
            "2 teaspoons finely minced fresh ginger", 
            "1 tablespoon chopped cilantro leaves", 
            "2 minced cloves garlic (Deb addition)", 
            "1 tablespoon soy sauce", 
            "1 tablespoon hoisin sauce", 
            "2 teaspoons toasted sesame oil (I replace 1 teaspoon with hot sesame oil — delicious)", 
            "1 egg, lightly beaten", 
            "1 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "35 to 40 small wonton wrappers", 
            "1/3 cup chicken stock or water", 
            "1/4 cup soy sauce", 
            "1 tablespoon rice vinegar", 
            "1 tablespoon dark sesame oil or 1/2 tablespoon dark, 1/2 tablespoon hot sesame oil", 
            "1 small clove garlic, minced (optional)", 
            "1 (1/2-inch-thick) slice peeled fresh ginger", 
            "1/4 cup Asian sesame paste or smooth peanut butter", 
            "3 tablespoons Asian sesame oil", 
            "1/4 cup rice vinegar (not seasoned)", 
            "1 1/2 tablespoons sugar", 
            "2 tablespoons water", 
            "1 teaspoon Asian chile paste with garlic*", 
            "1/2 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/on-obsessiveness-and-ollies1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Chinese", 
            "Dumplings", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2007/02/on-obsessiveness-and-ollies/", 
        "title": "vegetable dumplings", 
        "directions": [
            "Blend all dressing ingredients in a blender until smooth. Dressing keeps, covered tightly and chilled, 1 week. "
        ], 
        "date": "2007-02-19T21:04:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 28-ounce can whole tomatoes", 
            "1 (3 to 3 1/2 pound) boneless beef chuck roast, tied with a string", 
            "1 head garlic, separated into cloves, left unpeeled"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic1.jpg?w=750", 
        "tags": [
            "Beef", 
            "Budget", 
            "Date Night", 
            "Gluten-Free", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic/", 
        "title": "oven-braised beef with tomatoes and garlic", 
        "directions": [
            "Heat oven to 300°F (150°C). Coarsely chop tomatoes with their juice in a food processor (Gourmet’s suggestion) or go at them in their can with kitchen shears (my lazy preference) to break them up. Put roast in an ovenproof 4- to 5-quart heavy pot or a casserole dish with a lid — a tight fit is just fine, as it will shrink very soon. Pour tomatoes over roast and scatter garlic around it. Season generously with salt and pepper. Braise in middle of oven, covered, until very tender, 3 to 4 hours. Cut roast into 1/4-inch-thick slices and serve with sauce, garlic, squeezed from its peels (or you can leave others to do this) and orzo (Gourmet’s suggestion, of course not gluten-free), mashed potatoes (recipe at the end) or crusty bread. Leftovers shredded over egg noodles sound wonderful as well.", 
            "Do ahead: Like almost all braises, this is even better on the second day, which means it’s a dream of a dinner party dish. Let it cool to room temperature, then chill it in the fridge until needed. Defat the sauce before warming (it will be a cinch once solidified on top) and rewarm at 300 for 30 to 45 minutes. ", 
            "Notes:"
        ], 
        "date": "2015-02-09T11:59:10+00:00"
    }, 
    {
        "ingredient_list": [
            "3 1/2 pounds pork of spareribs, halved crosswise, preferably by a butcher, and cut into individual ribs", 
            "1/3 cup honey", 
            "1/4 cup soy sauce", 
            "1 large garlic clove, minced and mashed to a paste with 1/4 teaspoon salt", 
            "1/3 cup hoisin sauce", 
            "1/2 teaspoon English-style dry mustard", 
            "1/4 cup distilled white vinegar ", 
            "1/4 cup peanut or neutral oil, like grapeseed or corn", 
            "1/4 cup rice vinegar", 
            "3 tablespoons white miso, sold at Asian markets and specialty stores", 
            "1 tablespoon dark sesame oil", 
            "2 medium carrots, peeled and cut into big pieces", 
            "1 inch-long piece fresh ginger, peeled and cut into coins", 
            "Salt and freshly ground black pepper. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/party-of-five1.jpg?w=500", 
        "tags": [
            "Chinese", 
            "Meat", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2006/11/party-of-five/", 
        "title": "hoisin-honey pork riblets", 
        "directions": [
            "1. Put all ingredients except salt and pepper into food processor and pulse a few times to mince carrots. Then let machine run for a minute or so until mixture is chunky-smooth.", 
            "2. Taste and add salt and pepper to taste. Serve immediately or cover tightly and refrigerate for up to several days."
        ], 
        "date": "2006-11-19T22:47:28+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peanut-sesame-noodles11.jpg?w=640", 
        "tags": [
            "Chinese", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/04/peanut-sesame-noodles/", 
        "title": "peanut sesame noodles", 
        "directions": [
            "Puree dressing ingredients in a blender until smooth, about 2 minutes, then transfer to a large bowl.", 
            "Cook pasta in a 6- to 8-quart pot of boiling salted water until tender. Drain in a colander, then rinse well under cold water.", 
            "Add pasta, scallions, bell peppers, cucumber and tofu to dressing, tossing to combine. Garnish with toasted sesame seeds and serve immediately."
        ], 
        "date": "2008-04-18T16:21:05+00:00"
    }, 
    {
        "ingredient_list": [
            "Sauce", 
            "1/2 cup dark brown sugar", 
            "1/2 cup water", 
            "1/2 cup soy sauce, preferably Japanese or reduced sodium", 
            "1/2 cup mirin (sweet rice wine), or 1/2 cup sake with 1/4 cup sugar", 
            "1/4 cup peeled, chopped ginger (I used half and it tasted like plenty to me; adjust to your preference)", 
            "1 teaspoon ground coriander", 
            "4 whole black peppercorns (no, I did not count how many I put in there)", 
            "Meatballs", 
            "1 pound ground turkey", 
            "4 large or 6 small scallions, finely chopped", 
            "Half bunch cilantro, finely chopped (about 1/2 cup) (the cilantro-averse can use flat-leaf parsley)", 
            "1 large egg", 
            "2 tablespoons sesame oil, toasted if you can find it", 
            "2 tablespoons soy sauce", 
            "Freshly ground black pepper", 
            "Vegetable oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/scallion-meatballs-with-soy-ginger-glaze.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Chinese", 
            "Gluten-Free", 
            "Meat", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/12/scallion-meatballs-with-soy-ginger-glaze/", 
        "title": "scallion meatballs with soy-ginger glaze", 
        "directions": [
            "Make sauce: Bring sugar and water to a boil in a small saucepan over medium-high heat, stirring until sugar melts completely. Reduce heat to a medium-low and add soy sauce, mirin, ginger, coriander and peppercorns. Simmer, stirring occasionally, until reduced by half, about 30 minutes, though this took me a bit longer to reduce it until it was syrupy enough that I thought it would coat, and not just dribble off the meatballs. You can keep it on a back burner, stirring it frequently, while browning the meatballs in the next step. Once it has reduced to your satisfaction, strain through a sieve.", 
            "Make meatballs: Mix turkey, scallions, cilantro, egg, sesame oil, soy sauce and several grindings of black pepper in a bowl. I like mixing meatballs with a fork; it seems to work the ingredients into each other well. Roll tablespoon-sized knobs of the mixture into balls. The mixture is pretty soft; I find it easiest to roll — eh, more like toss the meatballs from palm to palm until they’re roundish — meatballs with damp hands.", 
            "In a skillet over medium-high heat, generously cover bottom of pan with vegetable oil. Working in batches to avoid crowding, place meatballs in pan and cook, turning, until browned all over and cooked inside, about 8 minutes per batch. Arrange on a platter (a heated one will keep them warm longer), spoon a little sauce over each meatball, and serve with toothpicks. Alternatively, you can serve the glaze on the side, to dip the meatballs. ", 
            "Do ahead: The sauce can be made up to 2 days in advance and refrigerated until needed. If needed, you can rewarm or keep the meatballs warm in a 200-degree oven until ready to serve. I’m storing mine in the fridge overnight and crossing my fingers they’ll taste fresh tomorrow."
        ], 
        "date": "2011-12-30T21:43:13+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds chicken wingettes or chicken wings (see note up top)", 
            "1 large garlic clove, minced", 
            "1 teaspoon coarse or kosher salt, plus more to taste", 
            "2 tablespoons soy sauce", 
            "2 tablespoons hoisin sauce", 
            "2 tablespoons mild honey (I often halved this)", 
            "1 teaspoon Asian sesame oil", 
            "Pinch of cayenne or dash of Sriracha", 
            "1 1/2 tablespoons sesame seeds, lightly toasted", 
            "1 scallion, finely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/sticky-sesame-chicken-wings1.jpg?w=640", 
        "tags": [
            "Chicken", 
            "Chinese", 
            "Photo", 
            "Quick", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/07/sticky-sesame-chicken-wings/", 
        "title": "sticky sesame chicken wings", 
        "directions": [
            "Heat oven to 425°F. Line a large shallow baking pan with foil and lightly oil it. ", 
            "Stir wings together with garlic, salt, soy, hoisin, honey, sesame oil and cayenne or Sriracha until coated. Spread wings and any sauce that fell to the bottom of the bowl out on the prepared baking pan in one layer. Roast, turning over once, until cooked through, about 35 minutes. Transfer wingettes to a large serving bowl* and toss with sesame seeds and scallion.", 
            "* If you end up with a puddle of sauce in the bottom of your baking pan (I did the one time they were more tightly packed in a dish), after removing the wings, you can pour the extra sauce into a saucepan and reduced it until thick, then stir it over the roasted wings before adding the sesame seeds and scallion."
        ], 
        "date": "2014-07-07T11:39:36+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 pound dried rice noodles (see notes up top)", 
            "2 tablespoons toasted sesame oil, plus a splash to loosen noodles", 
            "2 tablespoons Chinese sesame paste or tahini (see note up top)", 
            "1 tablespoon smooth peanut butter", 
            "3 1/2 tablespoons soy sauce", 
            "2 tablespoons Chinese rice vinegar", 
            "1 tablespoon granulated or brown sugar", 
            "1 tablespoon finely grated ginger", 
            "2 teaspoons minced garlic (from 1 medium-large clove)", 
            "Chili-garlic paste, to taste", 
            "1/2 pound cucumber, very thinly sliced", 
            "1/2 cup roasted salted peanuts, roughly chopped", 
            "A handful of chopped fresh herbs, such as mint and cilantro, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/08/takeout-style-sesame-noodles-with-cucumber1.jpg?w=640", 
        "tags": [
            "Chinese", 
            "Cucumber", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/08/takeout-style-sesame-noodles-with-cucumber/", 
        "title": "takeout-style sesame noodles with cucumber", 
        "directions": [
            "Cook noodles according to package directions and rinse with cold water to cool. Drain well. Drizzle with a tiny splash of toasted sesame oil to keep them from sticking until dressed.", 
            "Meanwhile, whisk sesame paste and peanut butter in the bottom of a small bowl, then whisk in soy sauce, rice vinegar, remaining 2 tablespoons sesame oil, sugar, ginger, garlic and chile-garlic paste to taste until smooth. Adjust flavors to taste. It might seem a bit salty from the bowl, but should be just right when tossed with noodles.", 
            "Toss sauce with cold noodles. ", 
            "Place a medium-sized knot of dressed noodles in each bowl, followed by a pile of cucumber. Garnish generously with peanuts and herbs. Serve with extra chile-garlic paste on the side. "
        ], 
        "date": "2015-08-04T11:09:20+00:00"
    }, 
    {
        "ingredient_list": [
            "4 teaspoons vegetable oil", 
            "1/4 cup (60 grams) tomato paste", 
            "2 tablespoons cider vinegar", 
            "2 teaspoons honey", 
            "2 teaspoons Worcestershire sauce", 
            "2 teaspoons smooth dijon mustard", 
            "1/4 teaspoon table salt", 
            "2 slices sandwich bread", 
            "1/2 medium onion, roughly chopped", 
            "1 garlic clove, chopped", 
            "1 medium stalk celery, roughly chopped", 
            "1 medium carrot, roughly chopped", 
            "Olive oil, for cooking", 
            "1 teaspoon fine sea or table table salt, plus more for vegetables", 
            "Freshly ground black pepper", 
            "2 pounds ground beef", 
            "2 large eggs", 
            "1 tablespoon tomato paste", 
            "1 teaspoon dijon mustard", 
            "1 teaspoon smoked paprika", 
            "2 tablespoons Worcestershire sauce", 
            "1/4 cup chopped fresh flat-leaf parsley", 
            "1/2 cup (120 grams) milk", 
            "2 pounds (905 grams) yukon gold potatoes (about 6)", 
            "8 tablespoons (4 ounces or 115 grams) unsalted butter", 
            "1 cup (235 ml) buttermilk", 
            "1 teaspoon fine sea or table salt", 
            "Finely ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/tomato-glazed-meatloaves-with-brown-butter-mashed-potatoes.jpg?w=750", 
        "tags": [
            "Beef", 
            "Freezer Friendly", 
            "Meat", 
            "Photo", 
            "Potatoes", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2017/02/tomato-glazed-meatloaves-with-brown-butter-mashed-potatoes/", 
        "title": "tomato-glazed meatloaves with brown butter mashed potatoes", 
        "directions": [
            "Make the glaze: Combine glaze ingredients in a small saucepan, and simmer, whisking constantly, for 2 minutes until and glaze is satiny smooth. Set aside.\nPrepare the meatloaves: Heat your oven to 350 degrees F. Lightly coat 2 9×13-inch baking dishes with nonstick spray or oil. Tear the bread into chunks and then blend it, in a food processor, into breadcrumbs. Place the breadcrumbs in a large bowl. You should have about 1 cup.\nAdd the onion, garlic, celery, and carrot to the food processor, and pulse it until they are finely chopped. Heat a large skillet over medium heat. Once the skillet is hot, coat the bottom with olive oil, and heat the oil for a minute; add the finely chopped vegetables. Season with salt and pepper, and cook, stirring frequently, until they begin to brown, about 10 minutes.\nAdd the vegetables to the large bowl with breadcrumbs, then add the remaining ingredients. Stir the ingredients together with a fork or your hands until evenly blended.\nPause for a moment to start mashed potatoes: Place the potatoes in a medium pot, and cover with a couple inches of cold water. Bring to a boil over high heat, and once it’s boiling, reduce the heat to a simmer. Cook for about 20 minutes once the simmering begins; the potatoes are ready when a paring knife or fork can be inserted into the center with little resistance. Drain potatoes, then wipe the pot dry.", 
            "Resume your meatloaves while the potatoes boil: Form the meatloaf mixture into twelve 3-inch meatballs; each will weigh about 4 ounces. Arrange 6 in each prepared baking pan, evenly. Drizzle or brush each meatball with a teaspoon or so of the tomato glaze you made earlier, and bake until cooked through, about 20 to 25 minutes (an instant-read thermometer inserted into the center of a cooked meatball will register 160 to 165F).\nFinish mashed potatoes: As soon as you can hold them (I use potholders), peel your potatoes. The skins should come right off with a paring knife. Run the potatoes through a potato ricer or mash them with a masher until smooth. In your empty potato pot, melt butter over medium heat and continue cooking once it has melted, stirring almost constantly, until brown bits form around edge and bottom and it smells nutty. Pour the hot butter and any browned bits over the potatoes. Add buttermilk to pot and warm it gently (so it doesn’t cool down your potatoes when you add it). Pour this over the potatoes too. Add salt and pepper and stir to combine.\nTo serve: Place a dollop of potatoes in the bottom of a plate or shallow bowl. Top with a meatloaf. Garnish with extra chopped parsley, if desired.\n"
        ], 
        "date": "2017-02-16T13:08:33+00:00"
    }
]