{
  "date": "2016-04-07T12:01:19+00:00",
  "directions": [
    "Heat oven to 425 degrees F. Whisk olive oil, tahini and brown sugar together in the bottom of a large bowl. Whisk in eggs, then buttermilk and vanilla. Whisk in baking powder, baking soda and salt, then switch to a spoon or flexible spatula and stir in flour, then carrots, mixing just until combined. ",
    "Either line a 12-cup standard muffin pan with paper liners or coat them with a nonstick spray. Fill each about 3/4 of the way with batter. You’ll probably have enough for 2 more after this, so you can hold some back if needed. Bake muffins for 14 to 16 minutes, or until a tester inserted into the center of each comes out batter-free. Muffins should be domed and lightly golden on top. Let them cool in pan for 5 minutes on a rack before transferring them to the cooling rack to cool completely.",
    "If you’d like to glaze your muffins, whisk powdered sugar, tahini and water together in a medium dish. Either drizzle this over the cooled muffins or dunk them into the puddle. Sprinkle with sesame seeds, if desired. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/carrot-tahini-muffins1.jpg?w=640",
  "ingredient_list": [
    "Muffins",
    "1/4 cup (60 ml) olive oil",
    "1/4 cup (30 grams) well-stirred tahini",
    "1/2 cup (80 grams) firmly packed light brown sugar",
    "2 large eggs",
    "3/4 cup (175 ml) buttermilk, almond milk or (nonalcoholic) apple cider",
    "1 teaspoon (5 ml) vanilla extract",
    "2 teaspoons baking powder",
    "1/2 teaspoon baking soda",
    "1/4 teaspoon fine sea salt",
    "2 cups (260 grams) all-purpose flour (see Note)",
    "2 cup packed coarsely grated carrots (from about 9 ounces or 5 slim carrots)",
    "Glaze (optional)",
    "1/2 cup (60 grams) powdered sugar",
    "3 tablespoons (25 grams) tahini",
    "2 tablespoons (30 ml) water",
    "Toasted sesame seeds for garnish"
  ],
  "tags": [
    "Breakfast",
    "Carrots",
    "Muffin/Quick Bread",
    "Photo"
  ],
  "title": "carrot tahini muffins",
  "url": "https://smittenkitchen.com/2016/04/carrot-tahini-muffins/"
}