{
  "date": "2013-08-30T08:47:00+00:00",
  "directions": [
    "No popsicle molds? You could any kind of tiny cup to mold them instead, but my favorite is a champagne flute for shape; you could even use those disposable plastic ones. When the mixture is halfway frozen, insert a popsicle stick and now no retro popsicle mold needs to come between you and Popsicle Week.",
    "To unmold: To unmold popsicles, dip the frozen molds in a warm bowl of water. I give them a tug every couple seconds to see if they’re loose yet because I don’t want to soften them any more thn absolutely necessary. If the stick comes out before the popsicle (boo!), they just weren’t frozen enough. You’ll want to freeze most popsicles for 5 to 6 hours, just to be certain they’re hard enough to unmold.",
    "To store popsicles: Here’s how I do it: I put a tray in the freezer and cover it with waxed or parchment paper, just long enough for it to get cold. I unmold all of the popsicles and place them on the tray, and refreeze them for 10 minutes out of their molds before putting them in a freezer bag. This extra step ensures that any melting/softening that happens when you unmold them doesn’t mess up their shapes or cause them to stick to one another. You can also separate them in their freezer bags by extra strips of waxed or parchment paper. Then you can wash the molds and use them again for everything you may have missed this week."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/9625541640_9753729a31_o.jpg?w=750",
  "ingredient_list": [
    "3/4 cup granulated sugar",
    "1 3/4 cups water (1 cup can be very cold)",
    "1 cup (about 5 ounces or 140 grams) fresh or frozen raspberries",
    "1 cup lemon juice (from approximately 7 to 8 lemons)"
  ],
  "tags": [
    "Citrus",
    "Lemon",
    "Photo",
    "Popsicles",
    "Raspberries",
    "Summer"
  ],
  "title": "pink lemonade popsicles",
  "url": "https://smittenkitchen.com/2013/08/pink-lemonade-popsicles/"
}