[
    {
        "ingredient_list": [
            "1 3-ounce package cream cheese, room temperature", 
            "1/3 cup half and half", 
            "3 eggs", 
            "1 10-ounce package frozen chopped spinach, thawed and drained", 
            "1/2 cup grated cheddar", 
            "1/4 cup grated Parmesan", 
            "4 to 6 green onions, sliced", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon pepper ", 
            "2 (14- to 15-oz.) cans pink or pinto beans, drained and rinsed", 
            "4 cups water", 
            "1 2-oz bunch cilantro (without roots)", 
            "1 large onion, chopped", 
            "2 large garlic gloves, chopped", 
            "2 tablespoons olive oil", 
            "3 tablespoons tomato paste", 
            "1 tablespoon distilled white vinegar", 
            "1 Cubanelle or Italian frying pepper (not spicy; 4 oz) halved lengthwise, steam and seeds discarded", 
            "2 Turkish bay leaves or 1 California", 
            "1 teaspoon salt", 
            "1/2 teaspoon dried oregano, crumbled", 
            "1/2 teaspoon black pepper", 
            "3 cups old-fashioned rolled oats", 
            "1 cup sweetened flaked coconut", 
            "1/2 cup vegetable oil*", 
            "1/3 cup sliced almonds (1 oz)", 
            "1/2 cup chopped walnuts", 
            "1/3 cup green (hulled) pumpkin seeds, sometimes called pepitas (1 1/2 oz; not roasted) **", 
            "1/3 cup packed dark brown sugar", 
            "1/4 cup mild honey", 
            "Pinch cinnamon", 
            "Pinch salt", 
            "1 cup tart dried cherries ***", 
            "1/2 cup dried blueberries", 
            "1/2 cup dried pears (1/4-inch dice)", 
            "1/2 cup diced dried apricots (1/4 inch dice)", 
            "1/3 cup golden raisins"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/ah-ha-ha-come-and-take-my-hand1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Photo", 
            "Spinach", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2006/10/ah-ha-ha-come-and-take-my-hand/", 
        "title": "spinach quiche", 
        "directions": [], 
        "date": "2006-10-23T09:33:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 ounce walnuts (about 1/3 cup)", 
            "1 1/2 pounds fingerling potatoes, cut crosswise into 1/2-inch-thick rounds", 
            "6 ounces haricots, verts, or other green beans, trimmed and cut into 2-inch segments", 
            "2 tablespoons white wine or other mild vinegar", 
            "2 tablespoons plain yogurt", 
            "1 teaspoon Dijon mustard", 
            "1 teaspoon coarse salt", 
            "Freshly ground pepper", 
            "2 tablespoons walnut oil", 
            "3 ounces baby arugula"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/arugula-potato-and-green-bean-salad1.jpg?w=500", 
        "tags": [
            "Arugula", 
            "Green Beans", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/07/arugula-potato-and-green-bean-salad/", 
        "title": "arugula, potato and green bean salad", 
        "directions": [
            "Preheat oven to 375°. Place walnuts on a rimmed baking sheet and toast in oven until fragrant, about 8 minutes. Let cool slightly, then coarsely chop and set aside.", 
            "Bring a medium saucepan of water to a boil. Add potatoes, and cook until tender, about 10 minutes. Using a slotted spoon, transfer potatoes to a colander to drain and cool. Set aside.", 
            "Prepare an ice-water bath; set aside. Return pan of water to a boil. Add green beans, and cook until tender and bright green, about 3 to 4 minutes. Using a slotted spoon, transfer to ice-water bath to stop the cooking. Drain.", 
            "Whisk together vinegar, yogurt, mustard and 1/2 teaspoon salt in a small bowl; season with pepper. Add oil in a slow, steady stream, whisking until emulsified. Set dressing aside.", 
            "Arrange arugula, potatoes, and green beans on a platter. Season with remaining 1/2 teaspoon salt and 1/4 teaspoon pepper. Drizzle with dressing and sprinkle with toasted walnuts; toss to coat."
        ], 
        "date": "2009-07-16T15:31:03+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds (32 ounces) ounces fresh baby spinach or regular spinach leaves", 
            "1 small yellow onion, finely chopped", 
            "3 small garlic cloves, minced", 
            "4 tablespoons unsalted butter", 
            "1 pound mushrooms, thinly sliced (I use creminis)", 
            "1 cup heavy cream", 
            "3/4 teaspoon table salt", 
            "Freshly ground black pepper", 
            "1/4 teaspoon freshly grated nutmeg (optional; I skip this)", 
            "12 large eggs", 
            "6 tablespoons finely grated Parmesan cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/baked-eggs-with-spinach-and-mushrooms.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Mushrooms", 
            "Spinach", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/04/baked-eggs-with-spinach-and-mushrooms/", 
        "title": "baked eggs with spinach and mushrooms", 
        "directions": [
            "If you’ve just washed your spinach, no need to dry it before wilting it in the pan. If it’s already dry, bring 1/2 inch water to a boil in a very large ovenproof heavy skillet, then add half of spinach and cook, turning with tongs, until wilted, about 30 seconds. Add remaining spinach and wilt in same manner, then cook, covered, over moderately high heat until spinach is tender, about 1 to 2 minutes. Drain in a colander and cool under cold running water. Gently squeeze handfuls of spinach to remove as much liquid as possible, then coarsely chop. You will have about 2 cups fairly tightly packed cooked spinach.", 
            "Wipe skillet dry, then melt butter over medium-low heat. Cook onion and garlic until softened, 2 to 3 minutes. Add mushrooms and increase heat to medium-high, then cook, stirring, until mushrooms have softened, exuded liquid and that liquid has cooked off, about 5 minutes. Stir in cream, salt, pepper, nutmeg (if using), and chopped spinach and bring back a simmer. Remove skillet from heat.", 
            "If baking eggs in this skillet, make 12 large indentations in mixture, each large enough to fit an egg. Otherwise, you can transfer this mixture to a 9×13-inch baking dish and do the same there. I like to use 2 teaspoons to make the wells; I press the backs of them together to “pinch” up the spinach mixture to form taller walls so that the eggs will not merge together. ", 
            "Do ahead: You can then set this aside for a few hours or up to one day in the fridge, covered.", 
            "When you’re ready to bake the dish, or about 30 minutes before serving, put oven rack in upper third of oven and heat oven to 450°F. Crack an egg into each well. Bake until whites are firm and yolks are still runny. You can check this by inserting a toothpick into various parts of the eggs and seeing whether they’re runny or set, which takes anywhere from 15 to 30 minutes. The range is long due to different ovens and baking vessels. It’s better to have to check more often than to let them overcook.", 
            "[Cooking note: It is nearly impossible to get all 12 eggs to cook evenly. The ones in the center will be more runny; at the edges, they’ll be more firm. But don’t fret. I’ve found that almost all people have an egg preference (more runny vs. more firm) and each egg manages to find the right home. Just ask people their preference as you serve them.]", 
            "Remove dish from oven, sprinkle with additional salt and pepper, plus grated Parmesan. Serve immediately."
        ], 
        "date": "2014-04-16T12:31:29+00:00"
    }, 
    {
        "ingredient_list": [
            "1 bunch (about 6 ounces) kale (I used Lacinato or “Dinosaur” Kale but I understand that the curlier stuff works, too, possibly even better)", 
            "1 tablespoon olive oil", 
            "Sea salt, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/baked-kale-chips1.jpg?w=500", 
        "tags": [
            "Kale", 
            "Photo", 
            "Snack", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/03/baked-kale-chips/", 
        "title": "baked kale chips", 
        "directions": [
            "Preheat oven to 300°F. Rinse and dry the kale, then remove the stems and tough center ribs. Cut into large pieces, toss with olive oil in a bowl then sprinkle with salt. Arrange leaves in a single layer on a large baking sheet (I needed two because mine are tiny; I also lined mine with parchment for easy clean-up but there’s no reason that you must). Bake for 20 minutes, or until crisp. Place baking sheet on a rack to cool.", 
            "Kale-Dusted Popcorn If you’re making the chips with the intention to grind them up for popcorn, I’d use less oil — perhaps half — so they grind without the “powder” clumping. I ground a handful of my chips (about half) in a mortar and pestle (well, actually the “pestle” was MIA so I used the handle of an OXO reamer, not that anyone asked) and sprinkled it over popcorn (1/4 cup popcorn kernels I’d cooked in a covered pot with 1 1/2 tablespoons oil over medium heat, shaking it about with potholders frequently). I seasoned the popcorn with salt. I liked this snack, but I think Parmesan and Kale-Dusted Popcorn would be even more delicious. Next time!"
        ], 
        "date": "2010-03-26T11:56:50+00:00"
    }, 
    {
        "ingredient_list": [
            "Pasta and assembly", 
            "1 pound chunky pasta of your choice (I love bell shapes; see above for details)", 
            "1 bundle broccoli rabe (see above for options), stems and leaves cut into 1-inch segments", 
            "1 pound Italian sausage (sweet or spicy pork or chicken), casings removed", 
            "2/3 cup grated parmesan or pecorino romano cheese", 
            "6 ounces mozzarella, cut into small cubes", 
            "Bechamel", 
            "2 cups milk, full fat is ideal", 
            "4 tablespoons unsalted butter", 
            "1/4 cup all-purpose flour", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "2 cloves garlic, minced", 
            "Few gratings fresh nutmeg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/09/baked-pasta-with-broccoli-rabe-and-sausage.jpg?w=750", 
        "tags": [
            "Broccoli Rabe", 
            "Casserole", 
            "Fall", 
            "Freezer Friendly", 
            "Meat", 
            "Pasta", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/09/baked-pasta-with-broccoli-rabe-and-sausage/", 
        "title": "baked pasta with broccoli rabe and sausage", 
        "directions": [
            "Cook the pasta and rabe: Bring a large pot of well-salted water to a boil. Add pasta and five minutes before its cooking time is up, add the broccoli rabe. It will seem like too much for the water, but with a stir or two, the rabe should wilt and cook alongside the pasta. Drain the broccoli rabe and pasta together and place in a large bowl.", 
            "Cook your sausage: Meanwhile, heat 1 to 2 tablespoons olive oil in a large, wide saucepan (you will use this for the bechamel in a few minutes; you could also use your pasta pot, once it is drained) over medium heat. When hot, add the sausage, breaking it up with a wooden spoon until it starts to brown, about five minutes. Remove with slotted spoon or spatula, leaving any fat behind. Eyeball the drippings (pork sausage will leave some; chicken usually does not) — use one tablespoon less butter next if it looks like there’s a tablespoon there. Any less, don’t worry about adjusting the butter.", 
            "Heat oven to 400 degrees.", 
            "Make the bechamel: Melt your butter in same saucepan over medium heat. Once melted, add your flour and stir it into the butter until smooth. Cook the mixture together for a minute, stirring constantly. Pour in a small drizzle of your milk, whisking constantly into the butter-flour mixture until smooth. Continue to drizzle a very small amount at a time, whisking constantly. Once you’ve added a little over half of your milk, you’ll find that you have more of a thick sauce or batter, and you can start adding the milk in larger splashes, being sure to keep mixing. Once all of the milk is added, add the salt, garlic, nutmeg, and few grinds of black pepper, and bring the mixture to a lower simmer and cook it, stirring frequently, for 10 minutes. Taste and adjust seasonings if needed.", 
            "Assemble and bake: Add the sausage and bechamel to the bowl with the pasta and broccoli rabe. Stir in mozzarella and half of grated parmesan or pecorino until combined. Pour into a lasagna pan, deep 9×13-inch baking dish* or 3-quart casserole dish and coat with remaining parmesan or pecorino. Bake for 20 to 30 minutes, until the edges and craggy points are nicely bronzed.", 
            "Eat warm. Reheat as needed.", 
            "* I love this so much, I’ve bought two, and it’s usually crazy inexpensive."
        ], 
        "date": "2013-09-11T11:36:34+00:00"
    }, 
    {
        "ingredient_list": [
            "5 cups low-sodium vegetable or chicken stock", 
            "2 tablespoons extra-virgin olive oil", 
            "1 medium onion, cut into 1/4-inch dice", 
            "1/4 teaspoon thyme", 
            "1/2 cup white wine (optional)", 
            "1 cup pearled barley (7 ounces)", 
            "1 cup beans, canned or precooked (white would be great; I used some Red Nightfall Beans mostly because they were languishing in my cabinet)", 
            "3 cups chopped escarole", 
            "1/2 cup freshly grated Parmigiano-Reggiano cheese, plus more for serving", 
            "2 tablespoons unsalted butter, softened", 
            "Salt and freshly ground pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/barley-risotto-with-beans-and-greens1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Escarole", 
            "Grain/Rice", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/01/barley-risotto-with-beans-and-greens/", 
        "title": "barley risotto with beans and greens", 
        "directions": [
            "In a medium saucepan, bring the chicken stock to a simmer over moderately high heat. Reduce the heat to low and keep warm.", 
            "In a large, deep skillet, heat the olive oil. Add the onion and thyme and cook over moderate heat, stirring occasionally, until the onion is softened, about 6 minutes. Add the barley and cook, stirring, for 2 minutes. Add the wine if using and cook, stirring until absorbed, about one minute. Add 1 cup of the warm stock and cook, stirring, until nearly absorbed. Continue adding the stock 1/2 cup at a time in six additions — you’ll have a cup of stock left in the pot — stirring until it is nearly absorbed between additions. Most barley risottos are done when the barley is al dente and suspended in a thick, creamy sauce, about 35 minutes, however, I like to take this one a little “soupier” adding another half to one cup of stock. (This gives the beans something to drink up, and you a margin of error if you grains continue to absorb the stock once you think they are done.)  Stir it in until the risotto is on the loose side, then add the beans and let them cook for a minute. Add the escarole and let it wilt and then cook for an additional minute. Stir in the 1/2 cup of Parmigiano-Reggiano and the butter and season with salt and pepper. Serve at once, passing more cheese at the table.", 
            "Do ahead: Although it’s not generally ideal to reheat rice risottos, I actually enjoyed this barley one reheated. Keep the flame low, splash in some more broth if it seems thick and slowly warm the dish, stirring. Top with extra cheese. ", 
            "Bean cooking wonder! Cooked my beans in the slow-cooker — they were perfect. No presoaking, just put them in covered with 2 to 3 inches of water for 3 hours on high. (You may need up to 4 hours with larger beans.) I let them cool in their cooking water, which was by then quite flavorful. They were dreamy. "
        ], 
        "date": "2010-01-07T19:18:26+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "3 3/4 (470 grams) cups all-purpose flour (feel free to replace up to half with whole-wheat)", 
            "1 1/2 teaspoons table salt", 
            "3 sticks (340 grams) unsalted butter, very cold", 
            "3/4 cup very cold water", 
            "Filling", 
            "1 pound yukon gold potatoes, peeled if desired, cut into 1/2-inch slices", 
            "10 ounces spinach (baby, “grown-up,” or frozen)", 
            "1 cup coarsely grated sharp cheddar cheese", 
            "4 scallions, thinly sliced", 
            "11 large eggs + 1 large egg white (you’ll use the yolk in a minute)", 
            "1 teaspoon kosher or coarse sea salt, plus more to taste", 
            "Freshly ground black pepper", 
            "To finish", 
            "1 large egg yolk (leftover from filling)", 
            "1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/breakfast-slab-pie1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Potatoes", 
            "Spinach", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/12/breakfast-slab-pie/", 
        "title": "breakfast slab pie", 
        "directions": [
            "Make pie crust: Whisk together flour, and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in the water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough roughly in half (it’s okay if one is slightly larger). Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day. [Still freaked out about making your own pie dough? Read this for a ton of additional tips and details.]", 
            "Heat oven  oven to 375 degrees F. Line bottom of 10x15x1-inch baking sheet or jellyroll pan with parchment paper.", 
            "Prepare filling: Place potatoes in a medium saucepan and cover with cold water. Bring to a boil, then reduce to a simmer, cooking for 7 to 10 minutes, until potatoes are tender but not falling apart. Drain. ", 
            "Wash spinach but no need to dry it. Place wet spinach in hot skillet and cook until it just wilts. Drain in a colander, pressing or squeezing out as much liquid as possible. You should have about 1 cup of spinach one wilted and squeezed. If spinach leaves were large, you might want to roughly chop the squeezed-out piles of spinach before adding it to the filling. ", 
            "Assemble pie: On a lightly floured surface, roll one of your dough halves (the larger one, if you have two different sizes) into an 18-by-13-inch rectangle. This can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible and using enough flour that it doesn’t stick to the counter. Transfer to your prepared baking sheet and gently drape some of the overhang in so that the dough fills out the inner edges and corners. Some pastry will still hang over the sides of the pan; trim this to 3/4-inch overhang.", 
            "Layer vegetables evenly over bottom pie crust. [You don’t want your pie to look like this, after all. NSFW language there, btw.] If using the fillings that I did, beat 11 whole eggs and 1 egg white lightly and pour over vegetables. If you’ve used other fillings, you might find that you need more or fewer eggs to mostly fill (I did not want to fill the crust to the top with eggs, as it would have been more difficult to bake without filling) the bottom crust; if you’re nervous, just beat a few eggs at a time and pour them in until your filling reaches the desired level. Sprinkle with salt and many grinds of black pepper.", 
            "Roll the second of your dough halves (the smaller one, if they were different sizes) into a 16-by-11-inch rectangle. Drape over filling and fold the bottom crust’s overhang over the edges sealing them together. Cut only a couple tiny slits in the lid to act as vents — too many or too big, and the filling will want to leak out before the eggs set. Beat remaining egg yolk with 1 teaspoon water and brush over lid. ", 
            "Bake pie: Until crust is golden and filling is set, about 40 to 45 minutes. Transfer to a wire rack and cool a bit before cutting into squares.", 
            "Do ahead: I haven’t frozen this pie, but suspect that it will freeze well already baked. Or, you could make the pie doughs up to one month in advance (storing them in the freezer), four days in advance (to store in the fridge) and roll them out when you’re ready to bake the pie. Baked slab pie will keep in the fridge for 3 to 4 days. Squares can be reheated as needed. Vegetables can be prepped (spinach wilted, potato par-boiled) and stored in the fridge for 2 days before using."
        ], 
        "date": "2013-12-20T12:29:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 bone-in pork shoulder, about 4 pounds", 
            "Kosher salt", 
            "2 tablespoons olive oil", 
            "1 medium white or yellow onion, peeled and cut into large pieces", 
            "1 large rib celery, cut into large pieces", 
            "1 small fennel bulb, trimmed and cut into large pieces", 
            "1 quart chicken stock, plus a splash or two more, if needed", 
            "3 sprigs fresh thyme", 
            "Freshly ground black pepper", 
            "4 tablespoons unsalted butter", 
            "2 9-ounce boxes dry lasagna, broken into 3-inch shards", 
            "2 tablespoons fresh lemon juice, or more to taste", 
            "2 tablespoons (although I use more) grated or shaved parmesan or grana padano cheese", 
            "1 tablespoon chopped parsley (optional)", 
            "Large handful arugula leaves, cleaned"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/broken-pasta-with-pork-ragu.jpg?w=750", 
        "tags": [
            "Arugula", 
            "Date Night", 
            "Fall", 
            "Freezer Friendly", 
            "Italian", 
            "Meat", 
            "Pasta", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/10/broken-pasta-with-pork-ragu/", 
        "title": "broken pasta with pork ragu", 
        "directions": [
            "Prepare pork: Use a sharp knife to remove the thick skin from the pork, but not trimming off all the fat — leave a thin sheen. Season generously with salt and place in fridge until ready to use — overnight is ideal but a few hours will cut it as well.\nBraise the pork: Heat your oven to 350 degrees. Heat a deep saucepan or Dutch oven over medium-high and add 2 tablespoons of the olive oil. When it shimmers, gently cook the onion, celery and fennel until they begin to soften, about 10 minutes. Add the stock and thyme and bring to a simmer, then season well with salt and pepper.", 
            "Rinse pork to remove excess salt, dry with a paper towel and add to seasoned broth. Cover and place in the oven for 90 minutes or more, until the meat just begins to pull away from the bone.\nAllow both meat and broth to cool in the braise out of the oven for 30 minutes, or until you can touch the meat with your hands. Remove the pork and gently pull the meat from the bone, then tear the chunks into bite-size shreds. Place these in a large bowl.\nStrain the braising liquid, pouring enough of it over the pork to barely cover it and keep it from drying out.", 
            "Pour the rest back into the pot, simmering it until it is reduced by half. Add pork and cooking liquid that has covered it, and warm it back to a simmer. Taste and adjust seasonings, adding more salt and pepper if needed. Add the butter and stir to emulsify.\nBring large pot of well-salted water to boil. Cook pasta until al dente, or usually a minute shy of package directions. Drain and add to the pork ragu, simmering for 1 minute.  Add the lemon juice, half the cheese and parsley, if using. Ladle into wide pasta bowls with and top with arugula and remaining cheese. We enjoyed this with an extra lemon wedge on the side.’\nDo ahead: Should you wish to freeze this — we froze half and I was overjoyed to find it again last month — shred the pork and return it to the reduced cooking liquid, stopping short of the butter; freeze them together in a bag. Once defrosted, rewarm to a simmer, add a splash or two of pasta cooking water if needed to loosen it, and then the butter (this ensures you get the most flavor from it). Add freshly cooked pasta, lemon and parmesan from here."
        ], 
        "date": "2016-10-24T12:26:38+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 small red cabbage, trimmed, cored, and shredded (about 6 cups)", 
            "1/2 small green cabbage, trimmed, cored, and shredded (about 6 cups)", 
            "1 tablespoon kosher salt, plus more to taste", 
            "1 bunch fresh baby spinach, stemmed and cut into 1/2-inch wide ribbons (about 4 cups loosely packed)", 
            "1/4 cup fresh lime juice (from about 2 small limes)", 
            "1 tablespoon Dijon or other salty prepared mustard", 
            "1/2 teaspoon ground cumin", 
            "1/4 cup peanut oil", 
            "1/2 cup roasted unsalted peanuts, coarsely chopped", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-and-lime-salad-with-roasted-peanuts1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Citrus", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spinach", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/04/cabbage-and-lime-salad-with-roasted-peanuts/", 
        "title": "cabbage and lime salad with roasted peanuts", 
        "directions": [
            "In a large bowl, toss the shredded red and green cabbage with the salt. Transfer the cabbage to a colander and let it drain for two hours. (I was in a rush and did this in one. It was still nicely wilted, but of course could have been even softer.)", 
            "If you’re worried about the cabbage being too salty when you’re done with the salting process, taste a piece of cabbage and if it concerns you, rinse and drain the cabbage well. This is not a suggestion in the original recipe, but something I suspect might bother some people.", 
            "Put the salted, drained cabbage back into your (rinsed and dried) large bowl and add the spinach. In a medium bowl, whisk the lime juice, mustard and cumin together. Add the peanut oil in a thin stream, whisking constantly until the ingredients are thoroughly emulsified. Toss the salad with the dressing and add the roasted peanuts. Season to taste with salt and pepper.", 
            "This salad is best served immediately, but it does keep surprisingly well in the fridge for a day or two. "
        ], 
        "date": "2010-04-28T22:35:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound Swiss chard (can also swap kale, spinach or another green), ribs and stems removed and cleaned", 
            "3 tablespoons olive oil", 
            "1 cup (5 1/4 ounces) chopped carrots", 
            "1 cup (5 ounces) chopped celery", 
            "1 cup (4 1/4 ounces) chopped shallots, about 4 medium", 
            "2 garlic cloves, finely chopped", 
            "1 cup dry white wine", 
            "2 15-ounce cans (or about 3 3/4 cups) white beans, drained and rinsed", 
            "2 cups (or more to taste) vegetable broth", 
            "1 cup pureed tomatoes (from a can/carton/your jarred summer supply)", 
            "Salt and freshly ground black pepper", 
            "3 fresh thyme sprigs", 
            "1 bay leaf", 
            "1 tablespoon sherry vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/01/chard-and-white-bean-stew.jpg?w=750", 
        "tags": [
            "Beans", 
            "Budget", 
            "Freezer Friendly", 
            "Gluten-Free", 
            "Photo", 
            "Put An Egg On It", 
            "Stew", 
            "Swiss Chard", 
            "Vegan", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/01/chard-and-white-bean-stew/", 
        "title": "chard and white bean stew", 
        "directions": [
            "Toasted bread slices, poached eggs (tutorial), chopped herbs such as tarragon, parsley or chives or grated Parmesan or Romano to serve (optional)", 
            "Bring medium pot of salted water to boil. Cook chard (or any heavier green; no need to precook baby spinach) for one minute, then drain and squeeze out as much extra water as possible. Coarsely chop chard.", 
            "Wipe out medium pot to dry it, and heat olive oil over medium. Add carrots, celery, shallots and garlic and saute for 15 minutes. Barber warns not to brown them but I didn’t mind a light golden color on them. Add wine (scraping up any bits that have stuck to the pot) and cook it until it reduced by three-fourths. Add beans, broth, tomatoes, a few pinches of salt, freshly ground black pepper, thyme and bay leaf and bring to a boil. Reduce heat to medium-low and simmer for 20 minutes. Add chard and cook for 5 minutes more. Remove thyme and bay leaf. Add more broth if you’d like a thinner stew and adjust salt and pepper to taste.", 
            "Serve as is drizzled with sherry vinegar. Or you can ladle the stew over thick piece of toasted country bread or baguette that has been rubbed lightly with half a clove of garlic, top that with a poached egg and a few drops of sherry vinegar and/or some grated cheese. "
        ], 
        "date": "2011-01-04T09:55:42+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            "Zest and juice of 1 lemon", 
            "3 cloves garlic, minced", 
            "1 1/2 teaspoon kosher salt", 
            "3/4 teaspoon paprika", 
            "1/4 teaspoon hot smoked paprika, plus more to taste", 
            "1 1/2 teaspoons dried oregano, crumbled", 
            "Freshly ground black pepper", 
            "10 boneless, skinless chicken thighs (about 3 pounds)", 
            "2 cups (554 grams) plain, unsweetened Greek yogurt", 
            "1 hothouse, English or seedless cucumber, unpeeled (about 1 pound)", 
            "2 tablespoons freshly squeezed lemon juice", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon minced fresh dill", 
            "2 medium cloves garlic, minced", 
            "1 1/2 teaspoons kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "1 head romaine lettuce, chopped", 
            "1 red onion, thinly sliced", 
            "About 1 pound small-medium tomatoes, chopped", 
            "1 hothouse, English or seedless cucumber, chopped", 
            "4 large pitas (intending 1/2 per person) or more as needed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/chicken-gyro-salad1.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Cucumber", 
            "Greek", 
            "Greens", 
            "Grilling", 
            "Onions", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/05/chicken-gyro-salad/", 
        "title": "chicken gyro salad", 
        "directions": [
            "Prepare the chicken: Combine all ingredients in a large freezer bag. Rub all around, coating chicken as evenly as possible. Let marinate for 20 minutes or up to 24 hours, whatever time you have.\nMake tzatziki: Place the yogurt in a medium bowl. Quarter your cucumber lengthwise and cut out the seeded area. Coarsely grate your cucumber onto a clean dishcloth and wring it out as well as you can. All of that liquid makes for a soggy sauce. Add wrung-out cucumber to yogurt bowl along with lemon, vinegar, dill, garlic, salt and pepper and stir to combine. Taste and adjust seasonings. Chill until needed.\nPrepare salad components: Arrange lettuce, onion, tomatoes and cucumbers on a platter. If desired, toss onion with a squeeze of lemon and/or dash or two of vinegar and salt so that it mellows/lightly pickles while it rests.\nCook chicken: Heat your grill to high heat or a grill pan to medium-high. Remove chicken from marinade and grill on first side until dark lines appear, about 5 minutes, then flip and grill for 3 minutes more on second side. Cooking times will vastly range by the thickness and coldness of your chicken, as well as variations between grills. Transfer cooked chicken to a cutting board, let rest for a couple minutes while you quickly heat/toast your pitas on the grill.\nCut chicken into thin strips. Cut pitas into wedges. Add to platter with vegetables and let everyone dig in. Repeat all summer."
        ], 
        "date": "2016-05-31T12:01:10+00:00"
    }, 
    {
        "ingredient_list": [
            "For the Pickled Onions: ", 
            "1/2 cup red wine vinegar (I swapped half with white vinegar; I was feeling stingy with my fancy red wine stuff)", 
            "1/2 cup cold water", 
            "2 tablespoons kosher salt (updated: 1 heaped tablespoon is a better amount here)", 
            "1 tablespoon sugar", 
            "2 to 3 really good shots hot sauce", 
            "1 red onion, sliced into very thin rings", 
            "For the Chicken Milanese: ", 
            "1 cup all-purpose flour", 
            "2 eggs, beaten with 1 tablespoon of water", 
            "1 1/2 cups panko bread crumbs", 
            "1/2 cup grated pamesan", 
            "4 small boneless, skinless chicken breasts, butterflied and lightly pounded/flattened (no need to tenderize; a good organic chicken breast will already be tender, says Burrell) to 1/4-inch thick*", 
            "Kosher salt and pepper", 
            "Extra-virgin olive oil, for frying", 
            "For the Escarole Salad:", 
            "1/2 cup grated pecorino romano", 
            "1/2 cup toasted hazelnuts", 
            "2 tablespoons freshly chopped parsley leaves", 
            "1 head escarole, washed, spun dry, cut into bite size pieces", 
            "High-quality extra-virgin olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/chicken-milanese-and-a-escarole-salad.jpg?w=753", 
        "tags": [
            "Chicken", 
            "Escarole", 
            "Greens", 
            "Italian", 
            "Photo", 
            "Pickled", 
            "Salad", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2009/01/chicken-milanese-an-escarole-salad/", 
        "title": "chicken milanese + an escarole salad", 
        "directions": [
            "Make the pickled red onions: In a small bowl, combine red wine vinegar with 1/2 cup of cold tap water. Stir in salt, the sugar and the hot sauce. Add the sliced onions and let sit for at least one hour. [Do ahead: We made these the night before to save time; they were even better pickled overnight.]", 
            "Make the chicken milanese: Set up a standard breading procedure in three wide deep plates. Fill one with flour, one with the beaten eggs, and one with the panko and grated cheese. Season the chicken breasts with salt and pepper. Using one hand for dry things and one hand for wet things, take each piece of chicken through the breading procedure: dredge lightly in the flour, then the egg wash and then through the bread crumbs. Lay the breaded chicken on a sheet tray and refrigerate for at least one hour. [Do ahead: You could even prep these the night before, to save time. Cover them loosely with plastic wrap in the fridge.]", 
            "Pour olive oil into a large saute pan until it reaches a thickness of about a half an inch – better a little more rather than a little less. Bring to a medium-high heat. Test the oil by flicking flour or bread crumbs into the oil. If it doesn’t sizzle, wait! When the oil is hot, test it again by dipping the edge of a piece of chicken into the oil, the oil should gently sizzle. Cook the chicken in the oil in batches on both sides until it is a lovely golden brown color and is crispy, about four to five minutes on the first side and three to four minutes on the second. Do not crowd the pan or the chicken will become very greasy and soggy. When the chicken comes out of the oil lay it on paper towels to drain off the excess oil and sprinkle with salt. [Do ahead: You can keep the chicken in a low oven to keep it warm while the rest of the chicken is cooking. I did this to hold it until we were ready to eat.]", 
            "Make the escarole salad: Combine the romano, hazelnuts and parsley in the food processor and pulse until they are coarsely chopped. Toss together the escarole, hazelnut mixture and some of the pickled red onions and dress with some of the pickling liquid and olive oil. Season with salt and pepper.", 
            "Place chicken on each serving plate and top with the escarole salad.", 
            "* Tiny kitchen tip! My makeshift setup since I don’t have one of those mallet things was to lay the breasts out on a cutting board, cover them with plastic and thwack away at them with a small, heavy saucepan. It worked great! And I had one less gadget to buy."
        ], 
        "date": "2009-01-24T19:16:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1 recipe Crispy Corn Bread (below) or 3 cups of 1-inch cornbread cubes", 
            "1 1/2 pounds ripe tomatoes (4 to 6 medium)", 
            "6 cups roughly torn sturdy fresh lettuce, such as Bibb, butter or Boston", 
            "2 cups bitter greens, such as arugula or dandelion greens", 
            "1 large Vidalia onion, trimmed, peeled, sliced crosswise as thinly as possible and separated into rings", 
            "1 recipe Buttermilk-Lime Dressing (below)", 
            "3/4 cups whole or lowfat buttermilk (whole preferred)", 
            "5 tabespoons freshly squeezed lime juice (they say from 3 to 4 limes; I only needed 1 1/2)", 
            "2 tablespoons olive oil", 
            "1 tablespoon apple cider vinegar (optional, this was my addition to give it more zing)", 
            "1 tablespoon honey", 
            "1/4 cup finely minced fresh basil", 
            "1/4 cup finely minced fresh flat-leaf parsley", 
            "1/4 cup finely minced green onios", 
            "1/2 teaspoon salt, plus more to taste", 
            "1 tablespoon lard or unsalted butter", 
            "1 1/2 cups stone-ground cornmeal", 
            "1 teaspoon baking powder", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "1 teaspoon sugar", 
            "1 large egg", 
            "1 1/2 cups whole or lowfat buttermilk (whole is preferred, here’s how you can make your own)", 
            "2 tablespoons unsalted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/corn-bread-salad1.jpg?w=500", 
        "tags": [
            "Arugula", 
            "Herbs", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2009/09/corn-bread-salad/", 
        "title": "corn bread salad", 
        "directions": [
            "Preheat the oven to 450°F. Grease a 12-inch skillet with one tablespoon of the lard or butter, leaving any excess in the pan, and place it in the oven.", 
            "In a large bowl, whisk the dry ingredients together. In a medium bowl, whisk the egg until frothy and then whisk in the buttermilk. Add the wet ingredients to the dry ones and mix thoroughly. Melt the remaining butter in a small skill (or your microwave) and whisk the butter into your batter.", 
            "While the fat in the large skillet is smoking, carefully remove the skillet from the oven and swirl the fat around to coat the bottom and sides evenly. Pour the batter into the skillet; it should “sizzle alluringly”, says the Lee Brothers. Bake for 15 minutes, or until the top of the bread is golden brown and the edge has pulled away from the side of the skillet. Remove from the oven and either serve hot, in six wedges, or let cool and reserve for Corn Bread Salad (above)."
        ], 
        "date": "2009-09-04T11:15:52+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1-pound bunch Swiss chard, thick stems removed and leaves sliced into ribbons", 
            "3 spring onions, ends trimmed, white and some green parts sliced into thin coins", 
            "3 tablespoons butter", 
            "3 tablespoons all-purpose flour", 
            "1 1/4 cups milk", 
            "Salt and pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creamed-chard-and-spring-onions1.jpg?w=500", 
        "tags": [
            "Onions", 
            "Pasta", 
            "Photo", 
            "Side Dish", 
            "Spring", 
            "Swiss Chard", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/04/creamed-chard-and-spring-onions/", 
        "title": "creamed chard and spring onions", 
        "directions": [
            "Wash your chard, but no need to dry it, just place it in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 6 minutes.", 
            "Press or squeeze out the excess liquid any number of ways, either by wringing it out in cheesecloth (my favorite method), putting it in a mesh strainer and pressing the moisture out with a spatula or large spoon or letting it cool long enough to grab small handfuls and squeezing them to remove as much water as possible.", 
            "Wipe out the large pot so you can use it again. Heat milk or cream in a small saucepan over moderate heat, stirring, until warm. Keep warm. Meanwhile, cook onion and garlic, if using, in butter in your wiped-out large pot over moderately low heat, stirring occasionally, until softened, about six minutes. Whisk in flour and cook roux, whisking, about three minutes. Add warm milk or cream in a slow stream, whisking constantly to prevent lumps, and simmer, whisking, until thickened, three to four minutes. Stir in chard, then salt and pepper to taste and cook, stirring, until heated through.", 
            "To make Creamed Chard and Spring Onion Pasta: Use 1 3/4 cups of milk instead of 1 1/4 cups. Stir 1/4 cup finely grated parmesan into the sauce while cooking, and keep extra on hand for serving. This should be enough to toss with about half a pound of pasta (more or less depending on how saucy you like yours)."
        ], 
        "date": "2010-04-25T13:25:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound cremini mushrooms, or a mix of wild mushrooms such as morels, shiitakes, oysters or chanterellas", 
            "2 tablespoons unsalted butter, more for toast", 
            "1 large or 2 small shallots, chopped", 
            "2 tablespoons dry white wine or white vermouth", 
            "1/4 cup heavy cream", 
            "Kosher salt and freshly ground black pepper", 
            "Slices brioche or good white bread, crusts cut off if desired", 
            "1 tablespoon fresh chopped chives", 
            "Coarse sea salt such as fleur de sel or Maldon, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/12/creamed-mushrooms-on-butter-chive-toast.jpg?w=753", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Herbs", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/12/creamed-mushrooms-on-chive-butter-toast/", 
        "title": "creamed mushrooms on chive butter toast", 
        "directions": [
            "Clean excess dirt from mushrooms. Slice mushrooms in half lengthwise and brush away any grit; chop into 1/4-inch pieces.", 
            "Melt butter in a large skillet over medium-high heat. Add shallots and sauté until very limp, about three minutes. Add mushrooms and cook, stirring, for about five minutes. Add wine, reduce heat to medium, cover, and cook for about five minutes more. (There are a lot of “abouts” on the cooking times because I found that mine took less time at each step; however, I also may have chopped my mushrooms and shallots smaller than the recommended size.)", 
            "Uncover pot and continue cooking, stirring occasionally, until most of the liquid has evaporated, about two minutes. Stir in cream; simmer until slightly thickened, two minutes longer. Season with salt and pepper to taste. ", 
            "Toast bread and spread with butter. (Clark recommended four slices of brioche, to make eight toasts, but I had enough mushrooms for almost triple that.) Cut each slice in half diagonally and sprinkle lightly with chives. Top each toast triangle with some mushroom mixture. Sprinkle with additional chives, garnish with sea salt, and serve.", 
            "Other uses for these mushrooms: I’d imagine they’d make a wonderful simple pasta sauce or, of course, something delicious to prop a poached egg upon, toast and all.", 
            "[Update: Thanks to the six (!) people who have noted that the theory that mushrooms absorb too much water to be washed has been rejected over time. They do absorb water, but not enough that they should throw off a dish. Wash away!]"
        ], 
        "date": "2009-12-13T10:39:57+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds baby spinach or 2 1/2 pounds fresh spinach, tough stems discarded", 
            "1 3/4 cups heavy cream or whole milk, or a mix thereof", 
            "1 small onion, finely chopped", 
            "1 small clove garlic, minced (optional)", 
            "3 tablespoons unsalted butter", 
            "3 tablespoons all-purpose flour", 
            "Pinch of freshly grated nutmeg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/creamed-spinach.jpg?w=753", 
        "tags": [
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Spinach", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/11/creamed-spinach/", 
        "title": "creamed spinach", 
        "directions": [
            "Wash your spinach well but no need to spin or pat it dry. Place spinach in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 2 to 4 minutes for baby spinach and 4 to 6 minutes for regular spinach.", 
            "Press or squeeze out the excess liquid any number of ways, either by wringing it out in cheesecloth (my favorite method), putting it in a mesh strainer and pressing the moisture out with a spatula or large spoon or letting it cool long enough to grab small handfuls and squeezing them to remove as much water as possible. Coarsely chop the wrung-out spinach.", 
            "Wipe out large pot so you can use it again.", 
            "Heat milk or cream in a small saucepan over moderate heat, stirring, until warm. Keep warm. Meanwhile, cook onion and garlic, if using, in butter in your wiped-out large pot over moderately low heat, stirring occasionally, until softened, about six minutes. Whisk in flour and cook roux, whisking, about three minutes. Add warm milk or cream in a slow stream, whisking constantly to prevent lumps, and simmer, whisking, until thickened, three to four minutes. Stir in nutmeg, spinach, and salt and pepper to taste and cook, stirring, until heated through.", 
            "Do ahead: Creamed spinach can be made one day ahead and chilled, covered then reheated over moderately low heat until hot. However, it really tastes best eaten immediately."
        ], 
        "date": "2009-11-19T11:26:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon vegetable oil", 
            "1/2 pound ground lamb", 
            "Kosher salt and freshly ground black pepper", 
            "2 garlic cloves, minced", 
            "Red pepper flakes, to taste", 
            "1/2 teaspoon cumin seeds or a heaped 1/2 teaspoon ground", 
            "1/2 teaspoon ground coriander", 
            "1 1/2 cups cooked brown or green lentils (from a scant 1 cup dried)", 
            "8 to 10 cup-shaped leaves from 1 medium head bibb or butter lettuce", 
            "Tomato-cucumber “relish” salad", 
            "Lemon-tahini dressing, with or without yogurt, or 1 cup plain yogurt, seasoned with salt and pepper", 
            "A couple tablespoons chopped fresh herbs such as parsley, cilantro, and mint, or a mixture thereof"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/crispy-spiced-lamb-and-lentil.jpg?w=750", 
        "tags": [
            "Gluten-Free", 
            "Greens", 
            "Meat", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2017/06/crispy-spiced-lamb-and-lentils/", 
        "title": "crispy spiced lamb and lentils", 
        "directions": [
            "Make crispy lamb and lentils: Heat a large skillet over medium-high heat. Once hot, add oil, and once oil is hot, arrange lamb in a large even patty about 1/4-inch thick. Season with salt and pepper. Cook until underside and browned and very crisp, about 5 minutes. Carefully pour off most of excess fat and discard. Flip meat in spatula-sized parts, sprinkle top with garlic, a good pinch of red pepper flakes (up to 1 teaspoon for real heat; I used 1/4 teaspoon), cumin and coriander, plus more salt and pepper, and cook until underside is browned, which should only take 2 to 3 more minutes. Use spatula to break lamb into smaller chunks and add lentils. Cook, stirring occasionally, until lamb is cooked through, about 2 minutes more. Transfer lamb-lentil mixture to a bowl.\nTo assemble: Arrange lettuce leaves on a platter and divide lamb-lentil mixture between them. Top with yogurt, tahini, or yogurt-tahini sauce, tomato-cucumber relish and herbs. Serve with hot sauce, if desired.", 
            "Extras:\nTo make a tomato-cucumber “relish” salad: Chop a handful of tomatoes and 1 large or a few smaller cucumbers into very small pieces. Finely chop 1/4 a medium red onion. Mix vegetables and onion in a bowl and dress to taste with olive oil, fresh lemon juice, salt and pepper. No matter how much it looks like, I promise it will be gone before the end of the meal.\nTo make a lemony-tahini yogurt dressing: Whisk 4 tablespoons well-stirred tahini in the bottom of a bowl. Whisk in the juice of 3/4 of a lemon, 1 minced garlic clove and 3 tablespoons water until smooth. Whisk in 2/3 cup plain yogurt, about 1/4 at a time, until smooth. Season with salt. Adjust everything to taste.\nTo make a lemony-tahini no-yogurt (so not thick and creamy, but still full of flavor) dressing: Combine 1/2 cup well-stirred tahini, 1 minced garlic clove, juice of 1 lemon, and 2 tablespoons olive oil in a bowl. Whisk in water as needed to loosen, you’ll likely need a few tablespoons. Season well with salt and pepper."
        ], 
        "date": "2017-06-07T12:03:49+00:00"
    }, 
    {
        "ingredient_list": [
            "2 teaspoons fennel seeds, toasted", 
            "1/4 cup olive oil", 
            "3 tablespoons fresh lemon juice", 
            "3 tablespoons finely chopped shallot (1 large)", 
            "1 teaspoon salt", 
            "1/2 teaspoon sugar", 
            "1/2 pound frisée (French curly endive), torn into bite-size pieces (10 cups) [we swapped butter lettuce]", 
            "3 Belgian endives, cut crosswise into 1/2-inch-wide slices [we swapped regular green endives]", 
            "1 bunch of celery ribs, thinly sliced crosswise (1 to 2 cups, depending on the size of your bundle)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/endive-and-celery-salad-with-fennel-vinaigrette1.jpg?w=500", 
        "tags": [
            "Celery", 
            "Endive", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/05/endive-and-celery-salad-with-fennel-vinaigrette/", 
        "title": "endive and celery salad with fennel vinaigrette", 
        "directions": [
            "In addition: Either an electric coffee/spice grinder or exceptional skill crushing spices in a mortar and pestle", 
            "Grind fennel seeds in grinder until ground but not powdery. Transfer to a small bowl or cup, then stir in oil until combined. Let stand 15 minutes.", 
            "Whisk together lemon juice, shallot, salt, and sugar in another small bowl or cup until salt and sugar are dissolved. Stir fennel oil, then add to shallot mixture in a slow stream, whisking until combined.", 
            "Toss lettuces and celery in a large bowl with just enough vinaigrette to coat. Season with black pepper to taste.", 
            "Pairing: I think this salad would be fantastic with maybe some shards of your favorite hard cheese and a poached egg on top, should those of you out there not be at a point in your lives when runny yolks are verboten. (Sniffle.)"
        ], 
        "date": "2009-05-06T15:58:59+00:00"
    }, 
    {
        "ingredient_list": [
            "3 oranges (I used 2 navel and one cara cara orange)", 
            "2 heads of endive", 
            "2 ounces soft goat cheese or chevre, crumbled", 
            "1/3 cup sliced almonds or chopped marcona almonds, well-toasted", 
            "Freshly ground black pepper", 
            "Olive oil for drizzling", 
            "Sherry vinegar", 
            "1 tablespoon minced chives", 
            "Flaky or other sea salt, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/endives-with-oranges-and-almonds1.jpg?w=750", 
        "tags": [
            "Citrus", 
            "Endive", 
            "Gluten-Free", 
            "Orange", 
            "Photo", 
            "Salad", 
            "Spanish", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/endives-with-oranges-and-almonds/", 
        "title": "endives with oranges and almonds", 
        "directions": [
            "Cut the top and bottom off your oranges, exposing the citrus flesh inside. Then, resting on either end, cut the peels, including the white pith, off the oranges. [Set aside for orangettes!] Use your knife to cut between each membrane and orange segment, cutting only so far as the center, which should release the orange segments. You can chop them once or twice more, so the pieces are not too large. ", 
            "Trim end off endives and arrange individual leaves on a medium platter. Add a few orange chunks to each, then goat cheese crumbles and almonds. Season with black pepper, then drizzle with a very thin stream of olive oil. Add a few droplets of sherry vinegar to each “boat.” Scatter chives over and finish each with sea salt. ", 
            "Dig in. No forks needed, unless you’re classy."
        ], 
        "date": "2014-12-15T11:50:02+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large egg", 
            "2 tablespoons water", 
            "1/4 cup plain dried breadcrumbs", 
            "12 ounces lean ground turkey", 
            "1/4 cup freshly grated Parmesan cheese", 
            "2 tablespoons chopped fresh Italian parsley", 
            "2 garlic cloves, minced", 
            "3/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "8 cups (or more) low-salt chicken broth", 
            "1 cup chopped peeled carrots", 
            "3/4 cup orzo (rice-shaped pasta)", 
            "4 cups coarsely chopped escarole (about 1/2 medium head)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/escarole-and-orzo-soup-with-meatballs1.jpg?w=500", 
        "tags": [
            "Escarole", 
            "Greens", 
            "Photo", 
            "Soup", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/02/escarole-and-orzo-soup-with-meatballs/", 
        "title": "escarole and orzo soup with meatballs", 
        "directions": [
            "Whisk egg and 2 tablespoons water in medium bowl to blend. Mix in breadcrumbs; let stand 5 minutes. Add turkey, Parmesan cheese, parsley, garlic, salt, and pepper; gently stir to blend. Using wet hands, shape turkey mixture into 1 1/4-inch-diameter meatballs. Place on baking sheet; cover and chill 30 minutes.", 
            "Bring 8 cups chicken broth to boil in large pot. Add carrots and orzo; reduce heat to medium and simmer uncovered 8 minutes. Add turkey meatballs and simmer 10 minutes. Stir in chopped escarole and simmer until turkey meatballs, orzo, and escarole are tender, about 5 minutes longer. Season soup to taste with salt and pepper. (Can be made 2 hours ahead. Rewarm over medium heat, thinning with more broth if desired.)", 
            "Ladle soup into bowls and serve."
        ], 
        "date": "2008-02-22T13:01:07+00:00"
    }, 
    {
        "ingredient_list": [
            "5 ounces baby spinach leaves", 
            "2 3/4 to 3 cups all-purpose flour, preferably unbleached", 
            "1/2 teaspoon sea salt or kosher salt", 
            "3 large eggs", 
            "3 large egg yolks", 
            "Water (only if absolutely needed)", 
            "Additional flour for rolling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/fresh-spinach-pasta1.jpg?w=640", 
        "tags": [
            "Italian", 
            "Pasta", 
            "Photo", 
            "Spinach", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/05/fresh-spinach-pasta/", 
        "title": "fresh spinach pasta", 
        "directions": [
            "Wash spinach but no need to dry. With water droplets still clinging to the leaves, wilt spinach in a hot skillet until completely soft, about 4 minutes. Let cool and wring all the water — seriously, every drop you can get out — out of the spinach in small fistfuls, and then pressing these little bundles out against a fine-mesh strainer. Rest spinach on paper towels to remove even more water, then mince spinach on a cutting board.", 
            "Dump spinach, smaller amount of flour and salt on countertop and mix with your fingers, then form into a pile. Make a deep well in the center and add the whole eggs and yolks to it. Use your fingertips to break up the eggs and begin moving your fingers in a circular motion, keeping the eggs within the well (or you’ll have egg lava running everywhere and be in a very bad mood). Each circular movement pulls in a little bit of flour from the sides. In a few minutes, the mixture will become thicker and thicker, finally becoming too tight to move easily with your fingers. At this point, you can use a bench scraper (a perfect tool here) or spatula to start adding the remaining, a little pile at a time. Once a shaggy dough has formed, begin kneading the mixture, scraping it up when it sticks, until a ball is formed. It will look flaky but will hold together.", 
            "Knead the dough, pressing it away with the heels of your hands then forming it back into a blob, for 1 to 2 minutes, until the dough is moist but not sticky. Add remaining flour, a spoonful at a time, only if dough is too sticky. Add a drop or two of water only if it’s cracking when you knead it. In almost all cases, I find that erring on the side of firmer pasta is safer than softer pasta, which doesn’t hold shapes well and will want to stick a pasta roller. Let it rest for 5 minutes, then knead it again for 5 to 8 minutes. Wrap dough in plastic and let rest at room temperature for an hour.", 
            "Divide dough into sixths. On a floured surface, roll the pasta as thin as you can; as thin as a credit card and translucent is ideal. Letting rolled-out pasta rest for 10 minutes before cutting it into your desired shape helps yield cleaner, easier cuts. ", 
            "Cook pasta in a large pot of boiling, well-salted water for anywhere from 2 to 6 minutes (depending on thickness), until al dente. Drain and toss with fixings of your choice — garlic-sizzled olive oil or melted butter, parmesan or pecorino, dollops of ricotta or mascarpone. Eat immediately.", 
            "Many notes:"
        ], 
        "date": "2014-05-06T12:28:39+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces arugula", 
            "8 ounces of thick-cut bacon", 
            "Handful of grape tomatoes, halved or quartered (optional)", 
            "Small amount of parmesan cheese, shaved with a vegetable peeler (optional)", 
            "Aged balsamic vinegar", 
            "Drizzle of olive oil", 
            "Sea salt", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/grilled-bacon-salad-with-arugula-and-balsamic1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Arugula", 
            "Grilling", 
            "Meat", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/07/grilled-bacon-salad-with-arugula-and-balsamic/", 
        "title": "grilled bacon salad with arugula and balsamic", 
        "directions": [
            "Arugula is grown in dark, sandy soil and almost always arrives gritty. Don’t skimp on washing it. I like to fill a large bowl or basin with very cold water and drop the arugula into it, pumping it up and down a few times with your hands to allow any dirt and grit to fall to the bottom. Pull it out of the water, being careful not to drag any grit from the bottom of the bowl with it. Spread out on towels to dry it.", 
            "Meanwhile, get you grill very hot. Lay out all of your bacon slices and grill them* until browned underneath, which will take all of two minutes. Flip them with tongs; another minute should finish them on the second side. Transfer them to a platter. Tear your arugula into bite-sized pieces over it. Scatter with tomatoes and peels of parmesan, if using. Drizzle very thinly with olive oil and sprinkle with a few, spare droplets of balsamic vinegar. Season with salt and black pepper. Serve immediately, just as some of the arugula begins to sigh over the hot bacon.", 
            "* As I’ve already received a few comments about flare-ups on the grill from bacon grease, I want to add before you start that you should definitely use your judgement here; the recipe is not the law. Ours flared a little, but not so much that it worried me. If it’s flaring too much on a high heat, lower it or move it to a cooler part of the grill. You can also close the lid for a minute, or do fewer strips at a time. You know your grill best. Be safe."
        ], 
        "date": "2013-07-11T12:03:54+00:00"
    }, 
    {
        "ingredient_list": [
            "2 of the largest, most globe-like artichokes you can find", 
            "2 lemons", 
            "A few cloves of garlic, smashed but left in their skins", 
            "One can of cranberry beans, rinsed and drained", 
            "A bundle of fresh arugula, washed and dried", 
            "2 to 3 tablespoons mayonnaise", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/gulping-beanfuls1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Arugula", 
            "Beans", 
            "Photo", 
            "Salad", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/04/gulping-beanfuls/", 
        "title": "artichoke, cranberry bean and arugula salad", 
        "directions": [
            "Prepare your artichokes: Peel the toughest, smallest and greenest outer leaves off and discard them. Once you reach the first of the yellow leaves, of moderate thickness, you’re good. Leaving half to one full inch of the yellow leaves attached to the stem, cut the remainder off in one clean cut. Now, start scooping, with a small paring knife and a small spoon (a grapefruit one works great here). You want to remove all of the spindly inner leaves as well as all off the furry choke, while creating a bowl shape, using those truncated yellow leaves as sides. Rub half a lemon over every cut surface, so it doesn’t brown. Be generous. Now, as carefully as you can, peel all of the dark green skin from the stem, again rubbing each cut surface with the halved lemon. Trim the stem down to one inch or less, making sure that it is flat and that when turned upside-down, the artichoke can balance on the surface, again coating the surface with lemon. Repeat this process for the second artichoke.", 
            "Bring a large pot of water to boil, adding a few glugs of plain vinegar, those garlic cloves and the lemons you’d used to coat the artichokes, first squeezing any remaining juice into the pot. If you have any old white wine, this is also an excellent flavor to impart in the artichokes. Boil the bowl-shaped artichoke hearts for about 25 to 35 minutes, or until they can be pierced easily with a fork. Drain them and set them aside. (These can be cooked a day or even two in advance, and reheated when you’re ready to make the salad.)", 
            "Make your dressing: Whisk your mayonnaise with the juice of one lemon. You want a thin dressing. Season it with salt and pepper.", 
            "Assemble your salad: Turn each artichoke upside-down on a plate so it stands on it’s truncated stem. Toss about 1/2 to 2/3 of a cup of beans with a spoonful or two of the dressing, and fill the artichoke cavity with them. Toss the arugula with more dressing, and arrange it over and around the artichoke. Season with more salt and pepper. Leave the extra dressing near you as you’ll probably want more for your artichoke heart. Eat with vigor."
        ], 
        "date": "2007-04-05T14:44:47+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1/2 small head cabbage, very thinly sliced (1 pound or 5 to 6 cups shreds) which will be easiest on a mandoline if you have one", 
            "4 medium carrots, peeled into ribbons with a vegetable peeler", 
            "5 lacinato kale leaves, ribs removed, leaves cut into thin ribbons", 
            "4 scallions, thinly sliced on an angle", 
            "1 teaspoon kosher salt", 
            "1/2 cup all-purpose flour", 
            "6 large eggs, lightly beaten", 
            "Canola, safflower or peanut oil for frying", 
            "Tangy Sauce", 
            "1/4 cup ketchup", 
            "1 1/2 tablespoons Worcestershire sauce (note: this is not vegetarian)", 
            "1/4 teaspoon dijon mustard", 
            "1 tablespoon rice cooking wine or sake", 
            "1 teaspoon soy sauce", 
            "1 tablespoon honey (use 2 if you like a sweeter sauce)", 
            "1/8 teaspoon ground ginger"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/japanese-vegetable-pancakes.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cabbage", 
            "Carrots", 
            "Japanese", 
            "Kale", 
            "Lunch", 
            "Pancakes", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/05/japanese-cabbage-and-vegetable-pancakes/", 
        "title": "japanese vegetable pancakes", 
        "directions": [
            "Make the pancakes: Toss cabbage, carrot, kale, scallions and salt together in a large bowl. Toss mixture with flour so it coats all of the vegetables. Stir in the eggs. Heat a large heavy skillet on medium-high heat. Coat the bottom with oil and heat that too. ", 
            "To make a large pancake, add 1/4 of the vegetable mixture to the skillet, pressing it out into a 1/2- to 3/4-inch pancake. Gently press the pancake down flat. Cook until the edges beging to brown, about 3 minutes. 30 seconds to 1 minute later, flip the pancake with a large spatula. (If this is terrifying, you can first slide the pancake onto a plate, and, using potholders, reverse it back into the hot skillet.) Cook on the other side until the edges brown, and then again up to a minute more (you can peek to make sure the color is right underneath).", 
            "To make small pancakes, you can use tongs but I seriously find using my fingers and grabbing little piles, letting a little batter drip back into the bowl, and depositing them in piles on the skillet easier, to form 3 to 4 pancakes. Press down gently with a spatula to they flatten slightly, but no need to spread them much. Cook for 3 minutes, or until the edges brown. Flip the pancakes and cook them again until brown underneath. ", 
            "Regardless of pancake size, you can keep them warm on a tray in the oven at 200 to 250 degrees until needed. ", 
            "If desired, make okonomiyaki sauce: Combine all sauce ingredients in a small saucepan and let simmer for 3 to 5 minutes, until smooth and thick. ", 
            "Serve pancakes with sauce and any of the other fixings listed above, from Japanese mayo to scallions and toasted sesame seeds. ", 
            "Do ahead: Extra pancakes will keep in the fridge for a couple days, or can be spread on a tray in the freezer until frozen, then combined in a freezer bag to be stored until needed. Reheat on a baking sheet in a hot oven until crisp again."
        ], 
        "date": "2013-05-15T11:01:47+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/4-pound (20 ounce) round of sourdough or dense country-style white bread", 
            "1/2 cup olive oil, divided", 
            "3 tablespoons unsalted butter, divided", 
            "3 medium yellow onions, thinly sliced in half-moons", 
            "Kosher salt", 
            "1/2 teaspoon sugar or honey", 
            "2 tablespoons sherry vinegar", 
            "1 pound (large bundle) curly kale, center ribs and stems removed, chopped or torn into large chunks", 
            "2 garlic cloves, minced", 
            "2 cups vegetable, chicken or turkey broth, divided", 
            "Red pepper flakes, to taste", 
            "2 tablespoons sherry"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/kale-and-caramelized-onion-stuffing1.jpg?w=750", 
        "tags": [
            "Kale", 
            "Onions", 
            "Photo", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/11/kale-and-caramelized-onion-stuffing/", 
        "title": "kale and caramelized onion stuffing", 
        "directions": [
            "Heat oven to 400°F. Slice crusts off bread (you can save them for breadcrumbs) and tear loaf into rough 1-ish-inch pieces. Place in a large bowl and drizzle with 4 tablespoons olive oil and toss well. Spread on a large rimmed baking sheet and toast in oven, tossing once or twice for even color, until golden brown and crisp on the outside but still a little tender inside, about 20 minutes. Let cool on sheet, then tip back into that large bowl.", 
            "Meanwhile, melt 1 tablespoon butter in 2 tablespoons oil in the bottom of a large saute pan over low heat. Add the onions, toss to coat them in oil and cover the pan and with the stove on the lowest heat possible, let them cook undisturbed for 15 minutes. (The steaming and wilting will help them caramelize much faster, yay.) Remove lid, raise heat to medium/medium-high, add sugar and 1 teaspoon salt and cook onions, stirring frequently, for another 15 to 20 minutes, until they’re a deep golden brown. Add 1 tablespoon sherry vinegar and use to scrape any stuck bits off bottom of pan, then cook off. Taste onions. If desired, add a second tablespoon of sherry vinegar and cook off in the same method. (I prefer them with 2 tablespoons.) Add onions to bowl with croutons.", 
            "Add 2 more tablespoons olive oil to pan and heat garlic for half a minute, before adding kale. Get kale coated with garlicky oil, then add 2 tablespoons broth. Cook kale until wilted and somewhat tender, seasoning well with salt and pepper, about 6 minutes. Add sherry to pan and cook until it almost disappears. Add remaining broth and last two tablespoons of butter and bring mixture to a simmer. ", 
            "Pour kale-broth mixture over croutons and caramelized onions. Toss well to combine. Pour mixture into a 3-quart casserole dish and cover with foil. Bake for 15 minutes, then remove foil, and bake for another 15 to 20, until golden and crisp on top.", 
            "Do ahead: Each part of this (the croutons, the onions and the kale) can prepared up to 3 days in advance, and assembled and baked when needed. Keep the croutons at room tempearture in a container or bag. Keep the onions in the fridge, as well as the kale and broth mixture. "
        ], 
        "date": "2015-11-04T11:59:12+00:00"
    }, 
    {
        "ingredient_list": [
            "Salad", 
            "1/2 cup uncooked quinoa (or 1 1/2 cups cooked)", 
            "8 ounces Black Kale, also known as Cavolo Nero, or Lacinato, Dinosaur, or Tuscan Kale", 
            "1/2 cup slivered almonds, very well toasted and cooled", 
            "1/3 cup dried cherries, chopped a bit", 
            "2 to 3 scallions, thinly sliced", 
            "2 teaspoons chopped fresh dill", 
            "2 ounces ricotta salata, crumbled or finely grated", 
            "Few gratings of fresh lemon zest", 
            "Dressing", 
            "3 tablespoons olive oil", 
            "1 1/2 tablespoons white wine vinegar", 
            "2 teaspoons smooth Dijon mustard", 
            "1 teaspoon coarse Dijon mustard", 
            "Just shy of 1 teaspoon honey", 
            "Salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/03/kale-and-quinoa-salad-with-ricotta-salata.jpg?w=750", 
        "tags": [
            "Grain/Rice", 
            "Kale", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/03/kale-and-quinoa-salad-with-ricotta-salata/", 
        "title": "kale and quinoa salad with ricotta salata", 
        "directions": [
            "Rinse quinoa well in a small colander. This is essential to remove bitterness. Place quinoa and 1 1/2 cups water in a small saucepan and bring to a simmer with a couple pinches of salt. Simmer at a very low temperature for 15 to 20 minutes, until tender. Drain any un-absorbed liquid from cooked quinoa. Spread quinoa on a plate to cool quickly.", 
            "Wash your kale and dry it well. Then, with a knife, remove the rib from each stalk, leaving long strips of kale leaves. Stack the leaves in small batches, roll them tightly the long way, and cut the roll crosswise into thin ribbons. Add the kale ribbons to a large salad bowl. Add remaining salad ingredients to kale and toss to mix.", 
            "Whisk dressing ingredients together in a small dish, and pour the dressing over the salad. Season with salt and pepper to taste, then dig in."
        ], 
        "date": "2014-03-06T11:56:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (105 grams or 3 3/4 ounces) walnut halves or pieces", 
            "1/4 cup (45 grams or 1 1/2 ounces) golden raisins", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon water", 
            "1/4 cup panko (15 grams or 1/2 ounce) or slightly coarse homemade breadcrumbs (from a thin slice of hearty bread)", 
            "1 tiny clove garlic, minced or pressed", 
            "Coarse or kosher salt", 
            "3 tablespoons olive oil", 
            "1 bunch (about 14 ounces or 400 grams) tuscan kale (also known as black or lacinato kale; this is the thinner, flatter leaf variety), washed and patted dry", 
            "2 ounces (55 grams) pecorino cheese, grated or ground in a food processor, which makes it delightfully rubbly (1/2 cup total)", 
            "Juice of half a lemon", 
            "Freshly ground black pepper or red pepper flakes, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/kale-salad-with-pecorino-and-walnuts.jpg?w=750", 
        "tags": [
            "Kale", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/08/kale-salad-with-pecorino-and-walnuts/", 
        "title": "kale salad with pecorino and walnuts", 
        "directions": [
            "Prepare walnuts: Heat oven to 350. Toast walnuts on a baking sheet for 10 minutes, tossing once. Let cool and coarsely chop. ", 
            "Prepare raisins: In a small saucepan over low heat, simmer white wine vinegar, water and raisins for 5 minutes, until plump and soft. Set aside in liquid. ", 
            "Prepare crumbs: Toast bread crumbs, garlic and 2 teaspoons of the olive oil in a skillet together with a pinch of salt until golden. Set aside.", 
            "Prepare kale: Trim heavy stems off kale and remove ribs. I always find removing the ribs annoying with a knife, because the leaves want to roll in on the knife and make it hard to get a clean cut. Instead, I’ve taken to tearing the ribs off with my fingers, which is much easier for me. Stack sections of leaves and roll them into a tube, then cut them into very thin ribbons crosswise. ", 
            "Assemble salad: Put kale in a large bowl. Add pecorino, walnuts and raisins (leaving any leftover vinegar mixture in dish), remaining 2 tablespoons olive oil and lemon juice and toss until all the kale ribbons are coated. Taste and adjust seasonings with salt, pepper and some of the reserved vinegar mixture from the raisins, if needed. Let sit for 10 minutes before serving, if you can, as it helps the ingredients come together. Just before serving, toss with breadcrumbs and, if needed, a final 1 teaspoon drizzle of olive oil. "
        ], 
        "date": "2013-08-13T11:50:38+00:00"
    }, 
    {
        "ingredient_list": [
            "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed (I used a basic tartdough instead)", 
            "2 tablespoons (1/4 stick) butter", 
            "3 large leeks (white and pale green parts only), coarsely chopped", 
            "1 teaspoon dried thyme", 
            "1/2 bunch Swiss chard, ribs removed, leaves chopped (about 2 1/2 cups)", 
            "1 1/4 cups whipping cream (I used whole milk)", 
            "3 large eggs", 
            "2 large egg yolks", 
            "1 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "Pinch of ground nutmeg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/leek-and-swiss-chard-tart1.jpg?w=500", 
        "tags": [
            "Leeks", 
            "Photo", 
            "Spring", 
            "Swiss Chard", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/01/leek-and-swiss-chard-tart/", 
        "title": "leek and swiss chard tart", 
        "directions": [
            "Roll out pastry on floured work surface to 12-inch square. Transfer to 9-inch-diameter glass pie dish. Trim overhang to 1 inch. Fold under; crimp edges. Cover; chill.", 
            "Melt butter in large nonstick skillet over medium-low heat. Add leeks and thyme. Sprinkle with salt and pepper. Cover; cook until leeks are very tender but not brown, stirring often, about 10 minutes. Add chard; saute until wilted, about 2 minutes. Remove from heat; cool.", 
            "Position rack in bottom third of oven; preheat to 425°F. Whisk cream and next 5 ingredients in large bowl. Mix in cooled leek mixture. Pour filling into crust.", 
            "Bake tart 15 minutes. Reduce heat to 350°F and bake until filling is puffed and just set in center, about 15 minutes longer (this took my oven about 10 minutes longer). Transfer to rack; cool 10 minutes. "
        ], 
        "date": "2008-01-24T19:22:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon vegetable or olive oil", 
            "1 tablespoon unsalted butter", 
            "3 large leeks (about 1 1/2 pounds)", 
            "1 12-ounce bundle chard or about 6 cups (6 ounces) of leaves, cut into 1/2-inch ribbons", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "1 cup fresh corn kernels (cut from 1 to 2 medium ears corn)", 
            "Cornmeal, for sprinkling baking surface", 
            "4-ounce goat cheese log, cold"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/08/leek-chard-and-corn-flatbread.jpg?w=750", 
        "tags": [
            "Corn", 
            "Leeks", 
            "Photo", 
            "Picnics", 
            "Pizza", 
            "Summer", 
            "Swiss Chard", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/08/leek-chard-and-corn-flatbread/", 
        "title": "leek, chard and corn flatbread", 
        "directions": [
            "Trim the ends off your leeks and halve them lengthwise. Cut them crosswise into 1/2-inch half-rings. Fill a medium bowl with very cold water and drop in sliced leeks. Swish them around with your fingers, letting any sandy dirt fall to the bottom. Scoop out the leeks and drain them briefly on a towel, but no need to get them fully dry. Do the same with your chard ribbons, but you can leave the leaves on towels until they’re nearly fully dry, while you cook the leeks.", 
            "Heat your oven to 450 degrees. ", 
            "Heat a large, heavy skillet over medium heat. Once hot, add butter and oil and once they’re fully melted and a bit sizzly, add the leek slices. Reduce heat to low, cover with a lid and cook leek for 10 to 13  minutes, stirring occasionally. Raise heat back to medium, add the chard ribbons and cook until they wilt, about 4 minutes. Season mixture with salt and freshly ground black pepper, adding more if needed. Finally, add your corn kernels, cooking them with the leeks and chard for just another minute.", 
            "Sprinkle two baking sheets with cornmeal. If you have pesky old baking trays like I do, and your breads really like to stick to them, I find things will release more reliably if you first lightly spray them with an oil before sprinkling on the cornmeal. Roll or stretch half your dough into a rectangular-ish shape (flatbreads are prettiest when they’re irregularly shaped, in my humble opinion) and arrange it on the prepared sheet. Spread half the leek-corn-chard mixture on it. Sprinkle it with half the log of goat cheese, crumbled into small bits. ", 
            "Bake flatbread in oven for 10 to 15 minutes, until the edges of the bread begin to brown slightly (they might brown more deeply in a better oven than they did in my lousy one). Repeat with remaining dough, filling and goat cheese. ", 
            "To serve, slide each flatbread onto a cutting board and cut into 8 rectangles. Serve immediately. "
        ], 
        "date": "2012-08-28T14:58:56+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive oil", 
            "2 large shallots, finely chopped", 
            "2 garlic cloves, minced", 
            "8 ounces arugula, washed, dried, coarse stems removed and coarsely chopped", 
            "3 tablespoons breadcrumbs measured from 2 slices or one half of a roll, pulsed in the food processor until reduced to soft crumbs", 
            "1/3 cup finely grated Romano cheese", 
            "Salt and pepper to taste", 
            "1 egg yolk (reserve egg white for sealing)", 
            "1 half-batch of fresh pasta–or–1 package of wonton wrappers", 
            "1 egg white beaten with two tablespoons of water to seal ravioli"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/little-wraps1.jpg?w=500", 
        "tags": [
            "Arugula", 
            "Italian", 
            "Pasta", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/03/little-wraps/", 
        "title": "arugula ravioli", 
        "directions": [
            "Make Filling: Heat olive oil in a large pan at medium heat. Saute shallots and garlic for 7 to 10 minutes, until they are soft and translucent, but not brown. Add arugula, turning and stirring it frequently, until it has cooked down, its water has largely evaporated but it hasn’t lost it’s color — about 3 to 5 minutes. Let mixture cool, then add bread crumbs and Romano cheese. Taste filling and season it as needed with salt and pepper. Add the egg yolk, stirring mixture until combined. Set aside.", 
            "To Make Ravioli Without a Ravioli Mold: Cut your pasta dough into 4 pieces, then flatten each piece into a rough rectangle and cover rectangles with an inverted large bowl. Set rollers of pasta machine on widest setting.", 
            "Lightly dust 1 rectangle with flour and feed through rollers. (Keep remaining rectangles under bowl.) Fold rectangle in half and feed it, folded end first, through rollers 7 or 8 more times, folding it in half each time and feeding folded end through. Dust with flour if necessary to prevent sticking. Turn dial to next (narrower) setting and feed dough through rollers without folding. Continue to feed dough through rollers once at each setting, without folding, until you reach narrowest setting. Dough will be a smooth sheet (about 24 inches long and 4 inches wide). ", 
            "Put sheet of dough on a floured work surface and drop 6 (1 1/2 teaspoon) mounds of filling 1 1/2  inches apart in a row down center of one half of sheet. Brush egg wash around each mound, then fold other half of sheet over filling. Press down firmly around each mound, forcing out air. (Air pockets increase the chance that ravioli will break during cooking.) Cut pasta (between mounds) with cutter into 3-inch rounds. Line a large shallow baking pan with a clean kitchen towel (not terry cloth) and dust towel with flour, then arrange ravioli in 1 layer in it. Make more ravioli with remaining pasta dough, 1 sheet at a time, and remaining filling, transferring ravioli to lined pan.", 
            "To Make Ravioli From Wonton Wrappers: Line 2 baking sheets with heavy-duty foil; spray foil with nonstick spray. Place 4 wonton wrappers on work surface; cover remaining wrappers with plastic to prevent drying. Lightly brush entire surface of each wrapper with egg white. Spoon 1 generous teaspoon filling into center of each wrapper. Fold wrappers diagonally in half, forming triangles. Press edges firmly to seal. Arrange ravioli on prepared sheets. Repeat with remaining wrappers and filling.", 
            "Cooking time will vary, depending on the thickness of your dough. "
        ], 
        "date": "2007-03-29T12:01:41+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 tablespoons red onion, cut into tiny bits", 
            "4 pieces of citrus, preferably a mix of grapefruits and oranges but use what you can get, and what you like to eat (spoiled by the spread at the store, I used 1 pink grapefruit, 1 cara cara and 1 blood orange, and 1 mineola)", 
            "1 tablespoon red wine vinegar or lemon juice", 
            "1 teaspoon smooth Dijon mustard", 
            "1 tablespoon olive oil", 
            "Salt and freshly ground pepper, to taste", 
            "3 to 4 tablespoons (1.5 ounces) feta cheese, chopped or crumbled", 
            "1 tablespoon fresh mint, chopped or cut into tiny slivers"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mixed-citrus-salad-with-feta-and-mint1.jpg?w=500", 
        "tags": [
            "Fruit", 
            "Grapefruit", 
            "Herbs", 
            "Orange", 
            "Photo", 
            "Salad", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2010/01/mixed-citrus-salad-with-feta-and-mint/", 
        "title": "mixed citrus salad with feta and mint", 
        "directions": [
            "Place your red onion in the bottom of a medium bowl. Nest a strainer over the bowl.", 
            "Prepare your citrus fruits by beveling the stem end of one, cutting enough off that you reveal the pith-free flesh of the fruit. Repeat on the other end. Rest your fruit on one of its now-flat surface and begin cutting the peel and pith off in large, vertical pieces. You want the fruit’s exterior to be “white”-free.", 
            "Turn the fruit back on its side and cut it into 1/4-inch thick wheels, removing any seeds and thick white stem as you do. Place the wheels and any collected juices from the cutting board in the strainer over the bowl with onion. Repeat with remaining citrus fruits. (As the extra juices drip over the bowl, it will soften the raw onion bite.)", 
            "Spread the fruit slices out on a platter. Scoop out the onion bits (a slotted spoon or fork does the trick) and sprinkle them over, leaving the juice in the bowl. Whisk one tablespoon of juice (this is all I had accumulated) with red wine vinegar or lemon juice, Dijon and olive oil. Season with salt and freshly cracked black pepper. Drizzle the dressing over the citrus, sprinkle with feta and mint, adjust salt and pepper to taste, serve immediately and daydream of warmer places."
        ], 
        "date": "2010-01-22T15:44:57+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons unsalted butter, divided", 
            "1 tablespoon olive oil", 
            "1 1/2 pounds mixed mushrooms, cleaned, trimmed and torn into bite size pieces (see suggestions above)", 
            "2 thick slices bread from a large, crusty loaf (I’d use 4 from a smaller loaf)", 
            "2 cloves garlic or 1 shallot, minced", 
            "1 tablespoon white wine vinegar, or more to taste (I used 2)", 
            "1 fresh red chile, stemmed, seeded and minced or red pepper flakes, to taste", 
            "Coarse salt and freshly ground black pepper", 
            "6 ounces chopped fresh greens (see suggestions above)", 
            "8 ounces of a good melting cheese, thickly sliced (suggestions above)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroooms-and-greens-with-toast1.jpg?w=640", 
        "tags": [
            "Casserole", 
            "Greens", 
            "Kale", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/05/mushrooms-and-greens-with-toast/", 
        "title": "mushrooms and greens with toast", 
        "directions": [
            "Melt 2 tablespoons butter and olive oil together in a large, heavy skillet over medium-high heat. One fully hot, add mushrooms to pan and cook, stirring regularly, until they’ve released their water and started to turn golden brown, about 8 minutes. ", 
            "Meanwhile, grill or toast your bread.", 
            "One the mushrooms have a nice color on them, add the garlic or shallots and cook, stirring constantly, for 1 minute. Drizzle with vinegar, most of the chile or chile flakes, salt and pepper and stir to combine. Add the greens; pretty much any kind aside from baby spinach will benefit from about 5 to 8 minutes cooking time, just until collapsed. If you’re me, you’ll add 1 more tablespoon vinegar for brightness at this point. Stir in remaining tablespoon butter and adjust seasonings to taste. Rip bread into irregular croutons and push them into the sauteed vegetables. Lay pieces of cheese atop everything. Turn the heat down to medium low, place a lid on the pan and let the cheese melt, which will take 5 to 10 minutes, depending on the pan and the kind of cheese you used. ", 
            "Sprinkle with remaining chile, “hand out forks, then bring the the pan to the table.” "
        ], 
        "date": "2015-05-12T12:04:17+00:00"
    }, 
    {
        "ingredient_list": [
            "5 ounces tomato juice", 
            "1 1/2 ounces vodka", 
            "Juice of 2 lime wedges", 
            "1/2 teaspoon finely grated", 
            "fresh horseradish", 
            "2 or 3 dashes of Worcestershire sauce", 
            "3 or 4 drops of Tabasco sauce", 
            "Pinch of salt", 
            "Pinch of celery salt", 
            "Small pinch of cayenne pepper", 
            "Ice ", 
            "10 oz baby spinach leaves", 
            "1/4 cup finely chopped onion", 
            "1 garlic clove, finely chopped", 
            "2 tablespoons unsalted butter", 
            "5 oz mushrooms, thinly sliced (2 cups)", 
            "1/3 cup heavy cream", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "1/8 teaspoon freshly grated nutmeg", 
            "4 large eggs", 
            "2 tablespoons finely grated parmesan", 
            "3 cups all purpose flour", 
            "1 teaspoon sugar (originally recipe calls for 2 tablespoons)", 
            "4 teaspoons baking powder", 
            "1 teaspoon salt", 
            "1 teaspoon baking soda", 
            "3/4 cup (1 1/2sticks) chilled unsalted butter, cut into 1/4-inch pieces", 
            "1/4 cup minced fresh chives", 
            "1 cup buttermilk "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/my-bacon-is-always-crisp1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Drinks", 
            "Eggs", 
            "Mushrooms", 
            "Photo", 
            "Scones/Biscuits", 
            "Spinach"
        ], 
        "url": "https://smittenkitchen.com/2007/05/my-bacon-is-always-crisp/", 
        "title": "baked eggs + chive biscuits + bloody marys", 
        "directions": [
            "Preheat oven to 425°F. Whisk flour, sugar, baking powder, salt and baking soda in large bowl to blend. Using fingertips, rub 3/4 cup chilled butter into dry ingredients until mixture resembles coarse meal. Stir in chives. Add buttermilk and stir until evenly moistened. Using 1/4 cup dough for each biscuit, drop biscuits onto baking sheet, spacing 2 inches apart.* Bake until biscuits are golden brown on top, about 15 minutes. Cool slightly. Serve warm. ", 
            "* I’m a sucker for the round, bumpy-edged biscuit shape so I rolled it out on well-floured counter and cut them with a 3″ biscuit-cutter. Take care to handle the dough as little as humanly possible, so not to warm or soften it too much. "
        ], 
        "date": "2007-05-13T20:49:56+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/my-old-school-baked-ziti1.jpg?w=750", 
        "tags": [
            "Freezer Friendly", 
            "Greens", 
            "Italian", 
            "Meat", 
            "Pasta", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/10/my-old-school-baked-ziti/", 
        "title": "my old-school baked ziti", 
        "directions": [
            "Heat oven to 400 degrees F.", 
            "Cook pasta until quite al dente, or 2 minutes less than the suggested cooking time. (Please. It will keep cooking in the sauce, then in the oven and mushy pasta makes me sad.) Reserve 1/2 cup cooking water, then drain pasta.", 
            "Heat large sauté pan — if yours is ovenproof, you can even use it as you final baking vessel — over medium heat. Coat with glug of olive oil, and heat oil. Add meat and cook with onion, garlic, oregano, pepper flakes, and salt over medium-high heat for 6 to 8 minutes or until meat is browned; stirring frequently. If you’re using plain ground beef versus sausage meat, you’re going to really want to season this well. Don’t be shy with the salt and pepper.", 
            "Add crushed tomatoes and stir to combine. Reduce heat to medium-low and simmer for 5 minutes. Adjust seasonings to taste. If it’s become quite thick, stir in reserved pasta water. Add spinach and cook until wilted, just another minute. Stir in drained pasta and heat together for one minute.", 
            "Pour half of pasta mixture into a 9×13-inch baking dish, lasagna pan, or other 3-quart baking vessel (or divide among smaller ones, if you’d like to freeze some off). Sprinkle with half of each cheese. Pour remaining pasta and sauce over, and finish with remaining cheese. Bake in heated oven for 30 minutes. ", 
            "If you wish, you can run the dish under your broiler for a minute or two for an extra-bronzed lid right before serving."
        ], 
        "date": "2015-10-05T12:09:43+00:00"
    }, 
    {
        "ingredient_list": [
            "Oregano dressing", 
            "4 cloves garlic", 
            "1 to 2 tablespoons dried oregano (Nancy recommends 2; I got nervous and used 1, but might not have minded more)", 
            "2 teaspoons kosher salt", 
            "Freshly ground black pepper", 
            "2 tablespoons lemon juice, or juice of 1 lemon", 
            "1/4 cup red wine vinegar", 
            "1/4 cup olive oil, ideally extra-virgin", 
            "Salad and assembly", 
            "1 (15-ounce) can chickpeas or 1 3/4 cups cooked chickpeas, drained", 
            "1 small red onion, peeled and sliced into paper-thin rings", 
            "1/2 pound provolone (see Note about varieties), sliced 1/8-inch thick then cut into 1/4-inch ribbons", 
            "1/2 pound salami, peeled, sliced 1/8-inch thick then cut into 1/4-inch ribbons", 
            "4 medium or 8 small pickled pepperoncini, sliced into rings", 
            "3/4 pound cherry tomatoes", 
            "Sea salt", 
            "1 head iceberg lettuce (see Note about size), halved, cored, and cut in 1/2-inch ribbons", 
            "1 head radicchio, halved, cored and cut in 1/4-inch ribbons", 
            "2 tablespoons dried oregano for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/nancys-chopped-salad1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Gluten-Free", 
            "Italian", 
            "Lunch", 
            "Photo", 
            "Radicchio", 
            "Salad", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/06/nancys-chopped-salad/", 
        "title": "nancy’s chopped salad", 
        "directions": [
            "Make dressing: Roughly chop the garlic and then add the oregano, salt and up to 1/2 teaspoon ground pepper. Chop the mixture together and use the side of a knife or a mortar and pestle to make a grainy herb paste. Transfer the paste to a large salad bowl, and add the lemon juice and vinegar. Mix with a fork allowing the salt to dissolve, then add the oil and whisk with a fork until well combined. The dressing should be thick with garlic and oregano. If you’re using a small head of iceberg, transfer 1/3 the dressing into a small bowl to be used only if needed. For a larger head of iceberg, you’ll want it all.", 
            "Assemble salad: Gently fold the chickpeas, red onion, provolone, salami, pepperoncini (including seeds and juice) into the dressing, one at a time. Halve the tomatoes lengthwise and season with 1 1/2 teaspoons sea salt. Set aside until ready to serve.", 
            "To serve: When ready to serve, gently add the tomatoes, lettuce and radicchio to the salad bowl, along with a couple of generous pinches of oregano, and toss to combine with the dressing. Adjust seasonings to taste, adding any reserved dressing if needed. Serve immediately.", 
            "Sicilian Oregano Sources: It’s definitely available online here and here. If you’re in NYC, I bought the jar you see here at Brooklyn Larder a year or two ago for about $7. However, I was over at Buon Italia in Chelsea Market today (6/5) and they sell, well, almost a tree of the stuff, easily 10 times what was in that jar, for all of $4.50. Buy it and share it with all of your friends! "
        ], 
        "date": "2014-06-02T12:24:46+00:00"
    }, 
    {
        "ingredient_list": [
            "Lid", 
            "2 cups (250 grams) all- purpose flour", 
            "1/2 teaspoon table salt", 
            "13 tablespoons (185 grams or 1 stick plus 5 tablespoons) cold unsalted butter, diced", 
            "6 tablespoons (90 grams) sour cream or whole Greek yogurt (i.e., a strained", 
            "yogurt)", 
            "1 tablespoon (15 ml) white wine vinegar", 
            "1/4 cup (60 ml) ice water", 
            "1 egg, beaten with 1 tablespoon water, for egg wash", 
            "Filling", 
            "2 tablespoons (30 ml) olive oil", 
            "4 ounces (115 grams or 3/4 to 1 cup) 1/4-inch-diced pancetta", 
            "1 large or 2 small onions, finely chopped", 
            "1 large carrot, finely chopped", 
            "1 large stalk celery, finely chopped", 
            "Pinch of red pepper flakes", 
            "Salt and freshly ground black pepper", 
            "2 garlic cloves, minced", 
            "Thinly sliced Swiss chard leaves from an 8- to 10-ounce (225- to 285-gram)", 
            "bundle (4 cups); if leaves are very wide, you can halve them lengthwise", 
            "3 1/2 tablespoons (50 grams) butter", 
            "3 1/2 tablespoons (25 grams) all- purpose flour", 
            "3 1/2 cups (765 ml) sodium- free or low- sodium chicken or vegetable broth", 
            "2 cups white beans, cooked and drained, or from one and a third 15.5- ounce", 
            "(440-gram) cans"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/10/pancetta-swiss-chard-and-white-bean-pot-pies.jpg?w=750", 
        "tags": [
            "Beans", 
            "Cookbooks", 
            "Fall", 
            "Photo", 
            "Swiss Chard", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2012/10/pancetta-white-bean-and-swiss-chard-pot-pies/", 
        "title": "pancetta, white bean and chard pot pies", 
        "directions": [
            "Make lids: In a large, wide bowl (preferably one that you can get your hands into), combine the fl our and salt. Add the butter and, using a pastry blender or your fingertips, cut them up and into the flour mixture until it resembles little pebbles. Keep breaking up the bits of butter until the texture is like uncooked couscous. In a small dish, whisk together the sour cream, vinegar, and water, and combine it with the butter-flour mixture. Using a flexible spatula, stir the wet and the dry together until a craggy dough forms. If needed, get your hands into the bowl to knead it a few times into one big ball. Pat it into a flattish ball, wrap it in plastic wrap, and chill it in the fridge for 1 hour or up to 2 days.", 
            "Make filling: Heat 1 tablespoon olive oil over medium- high heat in a large, wide saucepan, and then add the pancetta. Brown the pancetta, turning it frequently, so that it colors and crisps on all sides; this takes about 10 minutes. Remove it with a slotted spoon, and drain it on paper towels before transferring to a medium bowl. Leave the heat on and the renderings in the pan. Add an additional tablespoon of olive oil if needed and heat it until it is shimmering. Add onions, carrot, celery, red pepper flakes, and a few pinches of salt, and cook over medium heat until the vegetables are softened and begin to take on color, about 7 to 8 minutes. Add the garlic, and cook for 1 minute more. Add the greens and cook until wilted, about 2 to 3 minutes. Season with the additional salt and freshly ground black pepper to taste. Transfer all of the cooked vegetables to the bowl with the pancetta, and set aside.", 
            "Make sauce: Wipe out the large saucepan; don’t worry if any bits remain stuck to the bottom. Then melt the butter in the saucepan over medium- low heat. Add the flour, and stir with a whisk until combined. Continue cooking for 2 minutes, stirring the whole time, until it begins to take on a little color. Whisk in the broth, one ladleful at a time, mixing completely between additions. Once you’ve added one- third of the broth, you can begin to add the rest more quickly, two to three ladlefuls at a time; at this point you can scrape up any bits that were stuck to the bottom — they’ll add great flavor.", 
            "Once all of the broth is added, stirring the whole time, bring the mixture to a boil and reduce it to a simmer. Cook the sauce until it is thickened and gravylike, about 10 minutes. Season with salt and pepper. Stir the white beans and reserved vegetables into the sauce. ", 
            "Preheat your oven to 375 degrees.", 
            "Assemble and cook pot pies: Divide the filling between four ovenproof 2-cup bowls. (You’ll have about 1 1/2 cups filling in each.) Set the bowls on a baking pan. Divide the dough into four pieces, and roll it out into rounds that will cover your bowls with an overhang, or about 1 inch wider in diameter than your bowls. Whisk the egg wash and brush it lightly around the top rim of your bowls (to keep the lid glued on; nobody likes losing their lid!) and drape the pastry over each, pressing gently to adhere it. Brush the lids with egg wash, then cut decorative vents (smaller than mine, please, as they led to lots of draping) in each to help steam escape. Bake until crust is lightly bronzed and filling is bubbling, about 30 to 35 minutes.", 
            "Do ahead: The dough, wrapped twice in plastic wrap and slipped into a freezer bag, will keep for up to 2 days in the fridge, and for a couple months in the freezer. The filling can be made up to a day in advance and stored in a covered container in the fridge."
        ], 
        "date": "2012-10-16T11:18:35+00:00"
    }, 
    {
        "ingredient_list": [
            "Broth", 
            "8 ounces cheese rinds, any paper at the ends removed", 
            "6 cups water", 
            "1 large onion, peeled and quartered", 
            "3 cloves garlic, peeled and smashed", 
            "1/2 teaspoon whole peppercorns", 
            "Handful of flat-leaf parsley", 
            "Salt, to taste", 
            "To serve", 
            "2 to 3 ounces tuscan kale (also known as black or lacinato kale; this is the thinner, flatter leaf variety), washed and patted dry (updated measurement)", 
            "1 1/4 cups cooked white beans (from about 1/4 pound dried), with their cooking liquid if fresh (usually about 1 1/2 cups) (updated measurement)", 
            "Thin slices of baguette, toasted", 
            "Olive oil and parmesan for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/parmesan-broth-with-kale-and-white-beans1.jpg?w=500", 
        "tags": [
            "Announcements", 
            "Appetizers + Party Snacks", 
            "Beans", 
            "Italian", 
            "Kale", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2014/01/parmesan-broth-with-kale-and-white-beans/", 
        "title": "parmesan broth with kale and white beans", 
        "directions": [
            "Beans: I used cannelini beans for this the first time, but I spied some of Rancho Gordo’s Yellow-Eye beans in my cabinet (which are a great swap for white beans, wherever you use them) and had to use them instead, as it was just a day or two after New Years and I hadn’t gotten my black-eyed pea fix. The only downside of using a non-white bean such as this is that if you want to add the bean broth to your soup, it will change the color to something even less pretty.", 
            "How to cook dried beans: I promise, a separate post is coming on this. In the meanwhile, if you have time to soak your beans (cover them with way more water in a bigger bowl than you think you’ll need and leave them to soak for 8 hours or up to 24), do it, I find that it cuts stovetop time in half, or at least down by 1 hour. I dump it, soaking liquid and all, into a heavy pot, add more water (plus any aromatics you’d want, herbs, bay leaves, spice, onions, or garlic, but hold off on the salt for now) and bring the pot to a full boil. Boil it for one full minute, skimming any foam or, ahem, “scum” that floats, then reduce the heat to the lowest simmer possible, checking it from time to time and adding more liquid if needed. Your beans, depending on variety/age/if you soaked them, will take 1 to 3 hours to cook from here. My soaked-overnight white beans took just 1 hour. Once they are mostly softened, you can add salt to taste. Store them in their cooking liquid, which you should seriously consider adding to any/all soups as extra broth. Don’t dump all the flavor down the drain. I’ve also cooked beans many times, usually without bothering to soak, in a slow-cooker, for anywhere from 2 1/2 to 5 hours on HIGH (or longer on LOW). Yes, it takes longer, but the beauty of the slow-cooker is that it’s hands-off, while a stovetop needs to be somewhat monitored.", 
            "Not technically vegetarian: Strict vegetarians do not eat Parmesan as calf rennet is used in production. (More here.)"
        ], 
        "date": "2014-01-06T12:15:51+00:00"
    }, 
    {
        "ingredient_list": [
            "3 ounces (6 tablespoons) unsalted butter", 
            "8 small-medium baking potatoes (about 4 pounds), scrubbed", 
            "16 fresh flat-leaf parsley leaves", 
            "Coarse salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/parsley-leaf-potatoes1.jpg?w=640", 
        "tags": [
            "Budget", 
            "Herbs", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/parsley-leaf-potatoes/", 
        "title": "parsley leaf potatoes", 
        "directions": [
            "Heat oven to 450 degrees F. Place roasting pan in oven with butter; once butter has melted, just a minute or two later, remove pan from oven. Halve each potato lengthwise. Place one parsley leaf in the center of each cut half, then sprinkle cut sides generously with salt. Arrange face-down in pan with melted butter; try not to nudge them around or the leaves will move (as mine did) off-center. Roast potatoes for 35 to 45 minutes (depending on size) until tender. There’s no need to turn the potatoes over unless they get so dark underneath (this can happen with a thinner roasting pan or oven than runs hotter) that they risk overcooking before becoming fully tender; if so, just flip the potatoes for the remaining roasting time.", 
            "Serve immediately; cut sides up."
        ], 
        "date": "2013-11-22T14:14:13+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups all-purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "3/4 teaspoon baking soda", 
            "1/2 teaspoon fine sea salt", 
            "6 tablespoons cold unsalted butter, diced", 
            "1 1/4 cups (2 7/8 ounces) finely grated aged pecorino or parmesan cheese", 
            "2 slim scallions, minced (optional)", 
            "2 tablespoons flat-leaf parsley, chopped small plus 16 extra leaves for garnish", 
            "1 cup well-shaken buttermilk", 
            "1 large egg, lightly beaten with 1 teaspoon water for wash"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/parsley-pecorino-biscuits1.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Breakfast", 
            "Brunch", 
            "Herbs", 
            "Photo", 
            "Put An Egg On It", 
            "Scones/Biscuits", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2015/11/parsley-pecorino-biscuits/", 
        "title": "parsley pecorino biscuits", 
        "directions": [
            "Heat oven to 425 degrees F. Stir together flour, baking powder, baking soda, and salt in the bottom of a large bowl, then use your fingertips or a pastry blender to work the butter into the dry mixture, until the largest chunks are the size of tiny peas. Stir in cheese, scallions and chopped parsley, then buttermilk, stirring just until combined. Knead once or twice right inside the bowl to form into a rough dough.", 
            "Pat or roll it out to a 1/2-inch thickness on a floured counter. Cut into 2-inch rounds, pressing straight down and not twisting the cutter. Place on an parchment-lined baking sheet. Brush the tops of each with egg wash, then place one leaf at the center of each biscuit top. Use brush to dab leaf with egg wash.", 
            "Bake biscuits for 11 to 13 minutes, until golden brown. Eat right away, or at least before the day is out. ", 
            "Because biscuits are best on the first day, if planning ahead, I like to make the dough, cut in into rounds and freeze it until needed. Biscuits can be baked right from the freezer and will only require about 2 minutes extra. Brush egg wash and leaf on right before baking. "
        ], 
        "date": "2015-11-24T12:08:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound pasta, whatever shape you like (but chunky ones will match up better with the rabe)", 
            "1 pound broccoli rabe, heavy stems removed, remaining stems and leaves cut into 1- to 2-inch sections (I attempt to match my pasta in length)", 
            "1/2 cup olive oil", 
            "5 garlic cloves, peeled and minced or pressed", 
            "1/2 teaspoon red pepper flakes, or more or less to taste", 
            "About 1 heaping teaspoon Kosher salt (or more to taste)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/pasta-with-garlicky-broccoli-rabe1.jpg?w=640", 
        "tags": [
            "Broccoli Rabe", 
            "Budget", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2012/04/pasta-with-garlicky-broccoli-rabe/", 
        "title": "pasta with garlicky broccoli rabe", 
        "directions": [
            "To serve: Grated Parmesan or Romano cheese", 
            "Bring a huge pot of salted water to a boil. Add pasta and five minutes before its cooking time is up, add the broccoli rabe. It will seem like too much for the water, but with a stir or two, the rabe should wilt and cook alongside the pasta. Drain rabe and pasta together and pour into serving bowl. In the same pot or a tiny one, heat the olive oil with the garlic, pepper flakes and Kosher salt over moderate heat, stirring frequently for 3 to 4 minutes, or until the garlic becomes lightly golden. Pour mixture over pasta and toss to evenly coat. Shower with freshly grated cheese and eat at once."
        ], 
        "date": "2012-04-19T15:59:04+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/penne-with-potatoes-and-rocket1.jpg?w=500", 
        "tags": [
            "Arugula", 
            "Pasta", 
            "Photo", 
            "Potatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/03/penne-with-potatoes-and-rocket/", 
        "title": "penne with potatoes and rocket", 
        "directions": [
            "Meanwhile, wash the rocket* (older, larger leaves are preferable to the tender sprouts), drain, and set aside. Slice the red onion thin. Peel and chop fine the garlic cloves and the rosemary leaves. Put a large pot of salter water on to boil for the pasta.", 
            "When the potatoes are done, remove them from teh oven and put the pasta on to boil. Heat a saute pan, add some of olive oil, and saute the sliced onion until it is soft and translucent and starting to brown, about 5 minutes. Add the rocket and garlic, and saute both until they just begin to wilt and soften. Lower the heat, add the potato slices and rosemary and toss together for a minutre or two. When the noodles are done, drain them and add them to the potatoes and onion. Add a squeeze of lemon juice and toss everything together. Drizzle with a little olive oil and serve.", 
            "* I’m kind of a nut about arugula-washing techniques, so here is my tried-and-true method: Get a very big bowl. Fill it with cold, cold water. Cut the attached part of the arugula bundle off (so they’re in individual sprigs) and drop the bundle in the water. Have a colander nearby. Swish, swish, swish the arugula around with your hand and then scoop it up and dump it in the colander, being careful not to pick up the sandy dirt you’ve just dropped to the bottom of the water. (That’s the genius, by the way, the dirt always drops off.) If the water is still foggy/beige, rinse the bowl out and repeat this process until it is clear, and the sand at the bottom is at a minimum. Shake out the lettuce in the colander and either spin it in a salad spinner or spread it out on a big dish towel until it is dry. I actually wash all lettuces this way, but arugula, being particularly dirt-crusted, is particularly made for this technique."
        ], 
        "date": "2009-03-16T15:57:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium yellow onion", 
            "Salt and pepper", 
            "Olive oil", 
            "2 sprig thyme (optional)", 
            "1 bunch broccoli raab (aka broccoli rabe or rapini)", 
            "1 clove garlic", 
            "1 pinch hot pepper flakes", 
            "Pizza dough for one recipes (super-simple recipe here and an almost as simple recipe here)", 
            "1/2 cup grated mozzarella cheese", 
            "16 niçoise olives, pitted", 
            "1 lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pizza-with-broccoli-rabe-and-roasted-onions1.jpg?w=500", 
        "tags": [
            "Broccoli Rabe", 
            "Onions", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/12/pizza-with-broccoli-rabe-and-roasted-onions/", 
        "title": "pizza with broccoli rabe and roasted onions", 
        "directions": [
            "Preheat the oven to 375°F.", 
            "Dice the onion and toss it in a small ovenproof sauté pan with a pinch of salt and enough olive oil to coat lightly, and the leaves of the thyme. Put the pan in the oven to roast, stirring occasionally, until the onion is cooked and golden, about 30 minutes.", 
            "While the onion is roasting, wash and drain the broccoli raab, remove the heavy stems, and roughly chop the leaves and sprouts into coarse chiffonade. There should be enough to make about 2 cups. Peel and finely chop the garlic. Heat a large sauté pan and coat it with olive oil. Ad the broccoli raab, season with salt, pepper, and the hot pepper flakes, and fry over high heat until the broccoli raab is tender. Add the garlic and fry, tossing, for a few seconds.", 
            "When the onions are done, take them out of the oven and turn the heat up to 450° to 500°F. Put a pizza stone in the oven. Roll out of shape a 12- to 14-inch disk of pizza dough and slide it onto a floured pizza peel or the back of a baking sheet. Lightly brush the dough with olive oil, leave a 1/2-inch boarder dry. Evenly sprinkle the cheese on the oiled surface,spread the onions over, and top with the broccoli raab and the olives. Drizzle about 1 tablespoon olive oil over the pizza. Slide the pizza onto the preheated stone in the oven and bake from 5 to 10 minutes, until the crust is brown and crisp. Remove the pizza from the oven, sprinkle a few drops of lemon juice on it, slice and serve."
        ], 
        "date": "2008-12-28T15:25:53+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "2 1/2 cups all-purpose flour", 
            "1 teaspoon baking powder", 
            "1/2 teaspoon table salt", 
            "1 large egg", 
            "1/2 cup vegetable oil (Joe also recommends schmaltz, or rendered chicken fat, if you’ve got some)", 
            "1 teaspoon white vinegar", 
            "1/2 cup water (see Update, above)", 
            "Filling", 
            "1 1/2 pounds (about 3 medium) russet potatoes, peeled and quartered", 
            "1 small yellow onion, peeled and diced small", 
            "1 tablespoon vegetable or olive oil", 
            "1 tablespoon unsalted butter", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "To finish", 
            "1 large egg yolk", 
            "1 teaspoon water", 
            "1 1/2 pounds medium red potato (about 3 to 4), peeled and quartered", 
            "1 big leek (about 1/2 pound), white and light-green parts only, halved lengthwise, and thinly sliced (you’ll clean the grit out in a moment)", 
            "1 tablespoon vegetable or olive oil", 
            "1 tablespoon unsalted butter", 
            "1 generous cup lacinato kale ribbons (about 3 ounces or 1/4 to 1/3 bundle), tough stems and ribs removed and leaves cut into strips  (you’ll wash it in a moment)", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "3 ounces cream cheese, at room temperature "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/potato-knish-two-ways1.jpg?w=500", 
        "tags": [
            "Jewish", 
            "Kale", 
            "Leeks", 
            "Photo", 
            "Potatoes", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2012/03/potato-knish-two-ways/", 
        "title": "potato knish, two ways", 
        "directions": [
            "Cook potatoes: Put potatoes into a large pot, cover with cold water, and bring to a boil over high heat. Reduce heat to medium and cook until soft, about 20 to 25 minutes. Drain, then transfer to a large bowl to cool. ", 
            "Meanwhile, prepare leeks and kale: Fill a medium bowl with very cold water and drop in leek rings. Swish them around with your fingers, letting any sandy dirt fall to the bottom. Scoop out the leeks and drain them briefly on a towel, but no need to get them fully dry. Do the same with the kale, but you can leave the leaves to nearly fully dry, patting them if necessary, on the towels while you cook the leeks.", 
            "Heat a large, heavy skillet over medium heat. Once hot, add butter and oil and once they’re fully melted and a bit sizzly, add the leek slices. Reduce heat to low, cover with a lid and cook leek for 20 minutes, stirring occasionally. Raise heat back to medium, add the kale ribbons and cook until they wilt, about 5 minutes.", 
            "Transfer mixture to bowl with potatoes, add the cream cheese and mash together until combined. Stir in salt and many grinds of black pepper and set filling aside. "
        ], 
        "date": "2012-03-15T13:01:15+00:00"
    }, 
    {
        "ingredient_list": [
            "12 scallions (mine were very thin; I’d use fewer if yours are on the thick side)", 
            "1 handful kale leaves, rolled in a stack and sliced into very thin ribbons", 
            "2 eggs, lightly beaten", 
            "1/4 teaspoon freshly ground nutmeg (I totally skipped this)", 
            "1/2 teaspoon coarse or kosher salt (use less if your mashed potatoes are already seasoned)", 
            "Freshly ground pepper", 
            "1/3 cup fresh bread crumbs or panko (plain and lightweight)", 
            "1 1/2 cups cold leftover mashed potatoes", 
            "1 tablespoon olive oil", 
            "2 tablespoons vegetable oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/potato-scallion-and-kale-cakes1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Kale", 
            "Pancakes", 
            "Photo", 
            "Potatoes", 
            "Spring", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/04/potato-scallion-and-kale-cakes/", 
        "title": "potato scallion and kale cakes", 
        "directions": [
            "Clean and trim the scallions, leaving about 2 inches of green stems; I reserved the darker green tops for garnish and salad additions. Cook in boiling water until tender, about 5 minutes. Drain, wring out well, and chop finely. Place the scallions in a medium-sized bowl, add the kale, eggs, nutmeg (if using), salt, pepper, bread crumbs and potatoes and stir to combine. The batter will be loose and wet; this is just fine.", 
            "Heat the oils in a large skillet over medium-high heat until very hot but not smoking. Use about 2 tablespoons batter (I used a cookie scoop that holds slightly less) per pancake, flattening them as they hit the pan. Cook until golden brown underneath, just a couple minutes, before flipping them and cooking them on the reverse side until golden and crisp as well. Drain on paper towels, but be gentle as they are still fragile. You can keep them warm in a 200 degree oven while cooking off the rest of the batter, adding more oil as needed and letting pan cool between batches if it gets too hot.", 
            "Serve scattered with reserved scallion stems, if desired, topped with a crispy egg or alongside a dollop of sour cream or plain yogurt. They also make a wonderful meal with a big salad. Leftovers keep well in the fridge for a few days"
        ], 
        "date": "2015-04-21T11:58:49+00:00"
    }, 
    {
        "ingredient_list": [
            "1 extra-large egg yolk (I used one large and a smidgen of another)", 
            "1/2 cup plus 2 tablespoons grapeseed oil (suggested for its neutrality; I used half olive oil but suggest you do so sparingly as the olive flavor becomes very pronounced)", 
            "2 tablespoons finely diced shallot", 
            "1 to 2 lemons, for juicing", 
            "1/4 cup crème fraîche (did you know you can make your own?)", 
            "1/4 cup buttermilk (did you know you can make your own?)", 
            "2 apples, firm, crisp and juicy", 
            "2 pears, Asian or your favorite variety", 
            "2 heads radicchio", 
            "2 tablespoons sliced mint", 
            "1 tablespoon chopped flat-leaf parsley", 
            "Kosher salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/radicchio-apple-and-pear-salad1.jpg?w=500", 
        "tags": [
            "Apple", 
            "Pear", 
            "Photo", 
            "Radicchio", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2010/04/radicchio-apple-and-pear-salad/", 
        "title": "radicchio, apple and pear salad", 
        "directions": [
            "Place the egg yolk in a stainless steel bowl. Begin whisking in the grapeseed oli drop by drop, as slowly as you can bear. (I find having a second person dripping it in makes it easier.) Continue in this manner until the mixture begins to thicken.Once the mayo has emulsified, you can add the rest of the oil in a slow, steady stream (however, as a beginner, I still take it very slowly), whisking all the time. Arm getting tired? Try to murmur “jiggle-free upper arms… sleeveless sundresses…” to yourself. I find it helps.", 
            "Combine the shallot, 1 tablespoon lemon juice and 1/2 teaspoon salt in a small bowl and let it sit for 5 minutes. Whisk in the crème fraîche and buttermilk. Gently whisk this mixture into the mayonnaise, and taste for balance and seasoning.", 
            "Slice the apples and pears away from the core. Cut into 1/8-inch thick slices (I went even thinner, using a mandoline) and place them in a large salad bowl. Tear the radicchio into bite-sized pieces and add to the salad bowl. Toss salad with half of dressing (Goin suggests three-fourths but I found this to make an overly-creamy salad; you can always add more) and season with salt and pepper. Add a squeeze of lemon juice and a little more dressing if necessary.", 
            "Transfer to a platter (chilled, if you’re being fancy) and scatter the mint and parsley on top."
        ], 
        "date": "2010-04-04T12:16:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound cipollini onions", 
            "1 pound small Roma or large cherry tomatoes", 
            "1/4 cup olive oil", 
            "Coarse salt", 
            "4 slices of country or ciabatta bread, one-inch thick", 
            "1 15-ounce can of white beans, drained and rinsed or 1 1/2 cups cooked beans of your choice", 
            "Garlic clove (optional)", 
            "Few fresh basil leaves, slivered"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-tomatoes-and-cipollini1.jpg?w=500", 
        "tags": [
            "Herbs", 
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/09/roasted-tomatoes-and-cipollini/", 
        "title": "roasted tomatoes and cipollini", 
        "directions": [
            "Preheat oven to 375°F. Boil a small pot of water and blanche the cipollini for 10 seconds, then plunging them into cold water. Use a paring knife to make a small slit in each, and slide them out of their skins and outer layer.", 
            "Spread peeled onions and tomatoes in a roasting pan. Drizzle with olive oil and a few good pinches of coarse salt. Toss everything together until well-coated and roast in preheated oven for about 45 minutes, reaching in every 15 minutes with a spatula to roll the tomatoes and onions around to ensure all sides get blistered.", 
            "Just before you take the tomatoes and onions out, place your bread slices on the oven rack (or a tray, if you’re more refined than us) and let them toast lightly. You can rub the toasts with a halved garlic clove, if you like, while still hot. Use tongs to arrange toasts in one layer on a serving platter. Dump the white beans over the bread, and using a pot holder, scrape the entire contents of the tomato-and-onion roasting pan, still hot, over the white beans. Do not skimp on the juices that have collected, all of them — don’t leave any in the pan. They could make a religious person out of you.", 
            "Sprinkle the dish with the basil and eat at once. "
        ], 
        "date": "2009-09-09T12:02:01+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large russet (baking) potatoes (preferably organic; 3/4 pound each, scrubbed", 
            "3 tablespoons mayonnaise", 
            "1 tablespoon plus 1/2 teaspoon water, divided", 
            "3/4 teaspoon tomato paste", 
            "1/2 teaspoon anchovy paste", 
            "2 tablespoons Dijon mustard, divided", 
            "1/2 medium onion, finely chopped", 
            "1 tablespoon olive oil plus additional for coating potatoes", 
            "1/2 slice firm white sandwich bread", 
            "1 tablespoon milk", 
            "1/2 pound bulk breakfast sausage (1 cup) or 1/2 pound of breakfast sausage, casings removed", 
            "1 tablespoon chopped parsley", 
            "1/2 teaspoon fresh lemon juice", 
            "5 cups salad greens (2 ounces)(we used arugula, which paired with the dijon sauce was deliciously kicky)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sausage-stuffed-potatoes-a-green-salad1.jpg?w=500", 
        "tags": [
            "Budget", 
            "Greens", 
            "Meat", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/12/sausage-stuffed-potatoes-a-green-salad/", 
        "title": "sausage-stuffed potatoes + a green salad", 
        "directions": [
            "Prick potatoes with a fork. Microwave, covered with a paper towel, on high power until tender, 10 to 12 minutes.", 
            "Cutting lengthwise, remove top fourth of each potato and scoop out centers (reserve for another use), leaving 1/2-inch-thick walls.", 
            "Whisk together mayonnaise, 1 tablespoon water, tomato paste, anchovy paste, and 1 1/2 tablespoons mustard.", 
            "Preheat oven to 350°F with rack in middle.", 
            "Cook onion in oil with a pinch of salt in a small heavy skillet over medium heat, stirring occasionally, until golden, about 10 minutes.", 
            "Meanwhile, tear bread into small pieces, then soak in milk in a medium bowl until very soft. Mix in sausage, parsley, onion, and 2 tablespoons mayonnaise sauce with your hands.", 
            "Divide filling between potatoes, then coat skins lightly with oil. Bake in a 4-sided sheet pan until sausage is cooked through, about 30 minutes.", 
            "While potatoes bake, whisk 1 tablespoon mayonnaise sauce with lemon juice, remaining 1 1/2 teaspoon mustard and 1/2 teaspoon water, and salt and pepper to taste.", 
            "Remove potatoes from oven and turn on broiler. Spoon remaining mayonnaise sauce over filling and broil 3 to 4 inches from heat until charred in spots, 3 to 5 minutes. Cool slightly.", 
            "Toss greens with dressing and serve with potatoes."
        ], 
        "date": "2008-12-15T16:13:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup extra-virgin olive oil", 
            "1 head garlic, cloves peeled and thinly sliced lengthwise though I am sure crosswise would work as well", 
            "1 medium onion, finely chopped", 
            "1/2 cup dried currants (we skipped this)", 
            "2 pounds green Swiss chard, stems and center ribs finely chopped and leaves coarsely chopped separately", 
            "1/2 cup water", 
            "1 pound spaghetti", 
            "1/2 cup Kalamata olives, cut into slivers", 
            "6 ounces feta, crumbled (1 1/2 cups)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaghetti-with-swiss-chard-and-garlic-chips1.jpg?w=500", 
        "tags": [
            "Pasta", 
            "Photo", 
            "Swiss Chard", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/10/spaghetti-with-swiss-chard-and-garlic-chips/", 
        "title": "spaghetti with swiss chard and garlic chips", 
        "directions": [
            "Heat oil in a 12-inch heavy skillet over medium heat until it shimmers, then cook garlic, stirring, until golden, about 3 minutes. Transfer garlic with a slotted spoon to paper towels to drain.", 
            "Cook onion in oil remaining in skillet over medium heat, stirring occasionally, until softened, 3 to 5 minutes. Add currants and cook, stirring, until plumped, about 1 minute.", 
            "Stir chard stems into onion mixture with water and 3/4 teaspoon each of salt and pepper. Cook, covered, over medium-high heat until almost tender, about 5 minutes. Stir in chard leaves and cook, covered, until stems and leaves are tender, about 5 minutes.", 
            "Meanwhile, cook spaghetti in a pasta pot of boiling salted water (2 tablespoons salt for 5 quarts water) until al dente. Reserve 1 cup pasta-cooking water and drain spaghetti.", 
            "Toss spaghetti with chard, olives, and 1/2 cup cooking water, adding more cooking water if necessary. Season with salt and pepper. Serve sprinkled with feta and garlic chips."
        ], 
        "date": "2008-10-31T13:16:30+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon unsalted butter", 
            "1/2 cup sliced green onions", 
            "1 clove garlic, minced", 
            "1 pound fresh spinach (coarse stems removed if ‘grown-up’ spinach; baby spinach can be used in full)", 
            "3/4 pound feta, crumbled", 
            "1 tablespoon lemon juice", 
            "Salt and pepper to taste", 
            "1/4 ounce dried wild mushrooms, such as chanterelles, porcini or shiitakes", 
            "1 cup boiling water", 
            "2 tablespoons unsalted butter", 
            "3/4 cup sliced green onions", 
            "1 garlic clove, minced", 
            "1/2 teaspoon chopped fresh rosemary", 
            "1/2 teaspoon chopped fresh thyme", 
            "1/2 pound assorted fresh wild mushrooms, such as chanterelles, porcini and shiitakes, brushed clean and chopped small", 
            "1/2 pound fresh button mushrooms, brushed clean and chopped small", 
            "5 ounces blue cheese crumbles", 
            "Salt and pepper to taste", 
            "3 tablespoons olive oil", 
            "1 teaspoon fennel seeds", 
            "2 large yellow onions, chopped small", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper", 
            "1 heaping tablespoon Dijon mustard", 
            "4 ounces goat cheese, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/spanikopita-triangles.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/06/spanakopita-triangles-then-some/", 
        "title": "spanakopita triangles + then some", 
        "directions": [
            "Preheat oven to 375°F. Melt butter in a small saucepan, then cool. Cover phyllo stack with 2 overlapping sheets of plastic wrap and then a dampened kitchen towel. [I won’t lie, as I got more confident with the phyllo I sorta skipped this part, opting instead to work quickly. Proceed at your own risk, however!]", 
            "Take one phyllo sheet from stack and arrange on a work surface with a long side nearest you (keeping remaining sheets covered) and brush with some butter. Top with another phyllo sheet and brush with more butter. Cut buttered phyllo stack crosswise into 6 (roughly 12- by 2 3/4-inch) strips.", 
            "Put a heaping teaspoon of filling near one corner of a strip on end nearest you, then fold corner of phyllo over to enclose filling and form a triangle. Continue folding strip (like a flag), maintaining triangle shape. Put triangle, seam side down, on a large baking sheet and brush top with butter. Make more triangles in same manner, using all of phyllo.", 
            "Bake triangles in middle of oven until golden brown, 20 to 25 minutes, then transfer to a rack to cool slightly.", 
            "Do ahead: Pastry triangles can be formed, but not baked, three days ahead. Arrange in one layer in heavy-duty sealed plastic bags, then freeze. Bake frozen pastries (do not thaw) in same manner as above."
        ], 
        "date": "2009-06-10T08:43:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (10 ounce) package frozen spinach, thawed, squeeze of all excess liquid, and chopped", 
            "1 1/2 cups finely chopped onion (1 large)", 
            "3 tablespoons unsalted butter", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper", 
            "1/4 teaspoon freshly grated nutmeg", 
            "8 cups cubed French or Italian bread in 1-inch cubes (1/2 lb)", 
            "6 ounces coarsely grated Gruyère (2 cups)", 
            "2 ounces finely grated parmesan (1 cup)", 
            "2 3/4 cups milk", 
            "9 large eggs", 
            "2 tablespoons Dijon mustard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spinach-and-cheese-strata1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/12/spinach-and-cheese-strata/", 
        "title": "spinach and cheese strata", 
        "directions": [
            "Sauté onion in butter in a large, heavy skillet over medium heat until soft, about 5 minutes. Add 1/2 teaspoon salt, 1/4 teaspoon pepper and nutmeg and continue cooking for one minute. Stir in spinach, remove from heat and set aside.", 
            "Spread one third of the bread cubes in a well-buttered 3-quart gratin dish or other ceramic baking dish. Top with one-third of spinach mixture and one-third of each cheese. Repeat layering twice with remaining bread, spinach and cheese.", 
            "Whisk eggs, milk, mustard and remaining 1/2 teaspoon salt and 1/4 teaspoon pepper together in a large bowl and pour evenly over strata. Cover with plastic wrap and chill strata for eat least 8 hours or up to a day.", 
            "The next day, let it stand at room temperature for 30 minutes while preheating the oven to 350°F. Bake strata, uncovered, in middle of oven until puffed, golden brown, and cooked through, 45 to 55 minutes. Let stand 5 minutes before serving."
        ], 
        "date": "2009-12-22T12:27:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound (230 grams) dried chickpeas, cooked until soft and tender* or two 15-ounce cans of chickpeas, drained and rinsed", 
            "6 tablespoon olive oil", 
            "1 pound (450 grams) spinach, washed", 
            "A hefty 1-inch slice from a country loaf or about 2 slices from sandwich loaf bread (2.5 ounces or 75 grams), crusts removed and cut inset small cubes", 
            "1/2 cup (4 ounces) tomato sauce (I used canned stuff I keep around)", 
            "3 garlic cloves, thinly sliced", 
            "1/2 teaspoon ground cumin", 
            "Pinch of red pepper flakes", 
            "1 1/2 tablespoons red wine vinegar", 
            "1/2 teaspoon smoked paprika**", 
            "Salt and freshly ground black pepper", 
            "Lemon juice, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/03/spinach-and-chickpeas.jpg?w=752", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Beans", 
            "Photo", 
            "Put An Egg On It", 
            "Spanish", 
            "Spinach", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/03/spinach-and-chickpeas/", 
        "title": "spinach and chickpeas", 
        "directions": [
            "Place a large saucepan over medium heat and add half the olive oil. When it is hot, add the spinach with a pinch of salt (in batches, if necessary) and stir well. Remove when the leaves are just tender, drain in a colander and set aside.", 
            "Heat 2 more tablespoons olive oil in a frying pan over medium heat. Fry the bread for about 5 minutes or until golden brown all over, then the remaining tablespoon of oil and the garlic, cumin and pepper. Cook for 1 minute more or until the garlic is nutty brown.", 
            "Transfer to a food processor, blender or mortar and pestle along with the vinegar, and mash to a paste. Return the mixture to the pan and add the drained chickpeas and tomato sauce. Stir until the chickpeas have absorbed the flavors and are hot. Season with salt and pepper.", 
            "If the consistency is a little thick, add some water. Add the spinach and cook until it is hot. Check for seasoning and serve with paprika on top, or on fried bread toasts (as the Spanish do).", 
            "* I make all of my dried beans in the slow-cooker these days. They are perfect every time, and the flavor of fresh beans — even the sad-looking ones from grocery store bins I used — is incomparable. No presoaking, just cover them 2 to 3 inches of water and cook them 3 hours on high. (I have learned that cooking time can vary widely in slow-cookers so allot more time than you might need. I often make mine in the day or days before and let them cool in their cooking water, which is then by then very flavorful.)", 
            "** This might be my favorite ingredient on earth — it’s amazing on eggs and potatoes, too. If you can’t find it locally, Amazon and Penzeys are among a bunch of places that sell it online."
        ], 
        "date": "2010-03-17T11:26:41+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/spinach-and-egg-pizzettes1.jpg?w=640", 
        "tags": [
            "Brunch", 
            "Eggs", 
            "Italian", 
            "Photo", 
            "Pizza", 
            "Put An Egg On It", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/spinach-and-egg-pizzettes/", 
        "title": "spinach and egg pizzette", 
        "directions": [
            "Heat oven to 500 degrees. Place parchment paper* on tray and sprinkle with cornmeal. Stretch pieces of dough into 6 to 7-inch thin, round-ish shapes.", 
            "If using grown-up spinach, remove coarse stems. No need to remove stems from baby spinach. Wash and drain spinach leaves but no need to fully dry. In a large skillet, cook spinach with water droplets still clinging to the leaves (if it seems too dry, add another tablespoon or two of water to the pan) until spinach just wilts. Plunge spinach in cold water, then transfer it to a colander. Press out as much liquid as you can, then squeeze the rest in small fisfuls.", 
            "Transfer to cutting board and chop spinach into small bits. In a bowl, combine it with creme fraiche, garlic, parmesan, salt and pepper. ", 
            "Divide spinach mixture over each dough round, spreading almost to the edges, thinning it slightly in the center with a spoon to make an indentation to help hold the egg in place. If using small eggs, crack one into the center of each pizzette. If using larger eggs, separate the egg. Add yolk to center of spinach, then pour in egg white carefully, so not to add so much that it floods the pizza. However, if it does spill over, don’t sweat it, that’s what the parchment is for. ", 
            "Either bake pizza directly on parchment covered trays or slide parchment onto pizza stones for anywhere from 6 to 8 minutes (in a very robust oven), to 10 to 13 minutes (in a regular one)**, until egg white is set and the yolk is still loose. As soon as you remove the pizzette from the oven, add a grind of black pepper, very thin drizzle of olive oil and scatter some extra parmesan over it. Eat immediately.", 
            "* Technically speaking, parchment paper should not go in an oven hotter than 450 degrees, but I’ve found that nothing bad happens, it only gets a little brown at the edges. Without the parchment, any egg run-off tends to cement the pizzette to the pan, no fun at all.", 
            "** The baking times are especially finicky here. These will work for most people, however, if your egg becomes too cooked before the pizza is remotely golden at the edges, you might want to add it later in the cooking time. Be especially cautious of this if using small eggs."
        ], 
        "date": "2013-11-04T12:05:18+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large egg", 
            "1 slice of your favorite hearty bread", 
            "2 ounces baby spinach", 
            "1 pat butter", 
            "1 tablespoon minced shallot or white onion", 
            "1 tablespoon heavy cream", 
            "Sea salt and freshly ground black pepper", 
            "1 teaspoon smooth Dijon mustard", 
            "1 tablespoon crumbled cheese, such as goat cheese or feta"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/spinach-and-smashed-egg-toast.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Eggs", 
            "Photo", 
            "Put An Egg On It", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/04/spinach-and-smashed-egg-toast/", 
        "title": "spinach and smashed egg toast", 
        "directions": [
            "Bring small pot of water to boil. Lower egg into it and boil for five (for a runnier egg, as seen in top photo) to six (for a less-runny but still loose egg, as seen in bottom two photos) minutes.* Rinse egg briefly under cool water and set aside.", 
            "Wash your spinach but no need to dry it. Put a small puddle of water in the bottom of a skillet and heat it over medium-high. Once the water is simmering, add the spinach and cook it until it is just wilted, and not a moment longer. Transfer it to a colander and press as much of the excess water out with the back of a fork as possible. No need to wring it out here; we’re hoping to those lovely wilted leaves intact. Keep that fork; you’ll use it again in a moment.", 
            "Put your bread in to toast.", 
            "Dry your skillet if it is still wet. Heat a pat of butter in it over medium-low heat. Add shallots and cook them for a few minutes, until translucent and a little sweet. Return spinach to skillet and add cream. Simmer them together for one minute, then season with salt and freshly ground black pepper.", 
            "Put your toast on your plate and spread it thinly with Dijon mustard. Heap the spinach-and-shallot mixture on top, then add the crumbled cheese. Peel your egg; doing so under running water can make this easier. Once peeled, place it on your spinach toast, smash it open with the back of that fork you used a minute ago, and sprinkle it with salt and freshly ground black pepper. Eat immediately.", 
            "* When you’re eating a soft-boiled egg right away, six minutes is the way to go. But here, since we boil the egg and then prepare the rest of the toast, it continues to cook and firm up a bit in its shell, so I’ve found that a 5 to 5 1/2 minute egg will give you the equivalent in the end."
        ], 
        "date": "2013-04-09T11:41:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3-ounce package cream cheese, room temperature", 
            "1/3 cup half and half (or milk)", 
            "3 eggs", 
            "1 10-ounce package frozen chopped spinach, thawed and drained", 
            "1/2 cup grated cheddar (gruyere works well, too)", 
            "1/4 cup grated Parmesan", 
            "4 to 6 green onions, thinly sliced (1/2 cup finely diced red or white onion or shallots work as well)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spinach-quiche-revisited1.jpg?w=640", 
        "tags": [
            "Easter", 
            "Freezer Friendly", 
            "Photo", 
            "Picnics", 
            "Spinach", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2008/09/spinach-quiche-revisited/", 
        "title": "spinach quiche, revisited", 
        "directions": [
            "Preheat oven to 425°. Beat cream cheese in medium bowl until smooth. Gradually beat in half and half and eggs. Mix in remaining ingredients. Pour mixture into prepared crust. Bake until crust is golden brown and filling is set, about 25 minutes. Cool 10 minutes before serving."
        ], 
        "date": "2008-09-14T12:58:55+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces baby spinach", 
            "2 large white mushrooms, thinly sliced", 
            "1/4 small or medium red onion, very thinly sliced", 
            "1 large egg, hard-boiled (see above), chilled, peeled and thinly sliced", 
            "4 pieces thick-sliced bacon (about 4 ounces), finely diced", 
            "2 tablespoons red wine vinegar", 
            "1/2 teaspoon honey or sugar", 
            "1/2 teaspoon smooth Dijon mustard", 
            "Coarse salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/spinach-salad-with-warm-bacon-vinaigrette1.jpg?w=750", 
        "tags": [
            "Mushrooms", 
            "Photo", 
            "Salad", 
            "Spinach"
        ], 
        "url": "https://smittenkitchen.com/2012/11/spinach-salad-with-warm-bacon-vinaigrette/", 
        "title": "spinach salad with warm bacon vinaigrette", 
        "directions": [
            "Place spinach in a large, wide salad serving bowl. Scatter with mushrooms, red onion (see above for a different, mellower way to add the onions) and coins of hard-boiled egg. In a large skillet, fry bacon bits over medium-high heat until they’re brown and crisp and have rendered their fat. Use a slotted spoon to scoop them out of the skillet and spread them on a piece of paper towel briefly before sprinkling them over the salad. Pour out all but two tablespoons of hot bacon fat from the skillet. Reheat over medium and quickly whisk in the red wine vinegar, honey and Dijon. Pour over entire salad and season salt and pepper. Toss gently and serve hot. Repeat tomorrow night."
        ], 
        "date": "2012-11-23T13:27:45+00:00"
    }, 
    {
        "ingredient_list": [
            "1 2/3 cups (215 grams) all-purpose flour", 
            "3/4 teaspoon kosher salt", 
            "12 tablespoons (170 grams) cold unsalted butter, diced", 
            "3 tablespoons (45 grams) very cold water", 
            "Nonstick spray oil, for coating pan", 
            "3/4 cup (176 grams, 6 ounces, or 3/4 of an 8-ounce brick) cream cheese, soft at room temperature", 
            "2/3 cup (155 ml) half-and-half or 1/3 cup each whole milk and heavy cream", 
            "6 large eggs", 
            "2 10-ounce (283-gram) packages frozen chopped spinach, thawed", 
            "1 cup (115 grams or 4 ounces) grated cheddar or gruyere", 
            "1/2 cup (50 grams) finely grated Parmesan", 
            "1 small bundle (2 to 3 ounces or about 8 thin green onions) thinly sliced", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/spinach-sheet-pan-quiche.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Casserole", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Spinach", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/11/spinach-sheet-pan-quiche/", 
        "title": "spinach sheet pan quiche", 
        "directions": [
            "Make crust: In a food processor, blend flour and salt together. Add butter and pulse machine until butter is reduced to a fine meal, or couscous-sized bits. While running machine, drizzle in water; stop when dough has balled, a few seconds later.\nWrap dough in plastic or waxed paper and set in freezer to quick-chill until firm but not rock-hard, about 15 to 20 minutes. You can also chill it in the fridge for 2 hours or up to 1 week until needed.\nLightly coat a 9×13-inch (quarter-sheet) pan with oil. Line bottom with parchment paper.\nTo roll out crust (trickier, but go for it if you’re up for the challenge): Flour your counter well. Remove crust from freezer or fridge, unwrap and flour the top of it. Even if it’s very hard, begin rolling it very gently, in light motions, so it doesn’t crack too much as you stretch it out, to about a 12×16-inch rectangle. Keep flouring top and counter underneath dough as it is prone to sticking. Work as quickly as possible because this dough softens even more than regular pie dough as it warms.\nTransfer dough to prepared pan. Lift overhang to let dough slack/droop into corners so you’re not stretching it a lot to shape it to the pan. Trim overhang to 1/2- to 1-inch, then fold overhang onto sides of dough, pressing all around and letting the dough extend slightly over the edge of the pan.\nTo press in crust (less tricky, and what I always wish I’d done): Press dough in an even layer across bottom of pan; leave it thicker as it goes up the sides; pressing all around and letting the dough extend slightly over the edge of the pan.\nBoth methods: Freeze shaped dough until solid, about 20 minutes. Save your scraps! You can use them to patch any holes or cracks formed when baking.\nMeanwhile, heat oven to 425 degrees F. Coat a large sheet of foil lightly with spray oil. Once crust is solid, prick it all over with a fork and press foil, oiled side down, tightly against dough. Fill foiled crust to the top with pie weights, dried beans or rice (that you don’t plan to eat at any time) or even pennies. Bake for 20 minutes then gently, carefully remove foil and weights and bake for 5 more minutes, unfilled.\nWhile crust par-bakes, make filling: Use an electric mixer or your best whisking skills to beat cream cheese in the bottom of a large bowl until smooth and fluffy. Gradually drizzle in half-and-half, whisking the whole time so that the mixture incorporates smoothly. Whisk in eggs, two at a time, until combined. Squeeze out spinach in handfuls, removing as much extra moisture as possible. Stir in spinach, cheddar, parmesan, scallions, salt and pepper.\nWhen crust has finished parbaking, leave oven on. Inspect crust for cracks or holes and use reserved dough to patch them if necessary. Pour in filling just to the top of the crust. You will probably have about 3/4 cup more filling than you can fit in the crust (not an issue if going crust-less or if you didn’t parbake the crust); you can bake this off in a separate oiled dish for an excellent breakfast on toast tomorrow.\nBake quiche until crust is golden brown and filling is set, about 25 minutes. Cool at least 10 minutes before serving. Quiche keeps in fridge for 4 to 5 days."
        ], 
        "date": "2016-11-28T13:12:54+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound fresh shell beans in pod or 1 cup frozen baby lima beans (I used 1/2 pound fresh cranberry beans, 1/2 pound fresh lima beans)", 
            "1/4 pound bacon (about 4 slices)", 
            "1 1/2 tablespoons olive oil", 
            "1 small Vidalia onion or other sweet onion, chopped", 
            "1 large garlic clove, minced", 
            "3/4 pound cherry tomatoes (about 1 1/2 pints), halved", 
            "Fresh kernels from 4 ears corn", 
            "1 tablespoon sherry vinegar, plus more to taste", 
            "1/4 cup packed small fresh basil leaves (I used less)", 
            "1/4 cup packed small fresh arugula leaves (I used more)", 
            "1 garlic clove, peeled and halved", 
            "1 round loaf crusty bread", 
            "2 tablespoons extra-virgin olive oil", 
            "Salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/4819859550_857986cd86_o.jpg?w=748", 
        "tags": [
            "Arugula", 
            "Beans", 
            "Corn", 
            "Photo", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2010/07/summer-succotash-with-bacon-and-croutons/", 
        "title": "summer succotash with bacon and croutons", 
        "directions": [
            "Cut three 1-inch-thick slices from middle of loaf and brush bread with oil. Lightly oil a well-seasoned ridged grill pan and heat over moderately high heat until hot but not smoking. Grill bread until golden brown on both sides. Alternately, you can run toasts under the broiler for a minute. Remove from heat and immediately rub bread both sides with cut side of garlic and sprinkle with salt. Cut into cubes and toss into succotash."
        ], 
        "date": "2010-07-25T08:17:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (1/2 stick or 2 ounces) butter", 
            "1 small onion, finely chopped", 
            "3 pounds Swiss chard, leaves and stems separated and both cut into 1-inch pieces", 
            "Pinch of freshly grated nutmeg", 
            "2 cups heavy cream or whole milk", 
            "2 garlic cloves, minced", 
            "2 tablespoons flour", 
            "2 pounds medium red-skinned sweet potatoes (yams), peeled and cut into 1/8-inch thick rounds", 
            "1 tablespoon minced fresh Italian parsley", 
            "1 tablespoon minced fresh thyme", 
            "Fine sea salt", 
            "Freshly ground black pepper", 
            "1 1/4 cups (about 5 ounces) coarsely grated Gruyére cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/swiss-chard-and-sweet-potato-gratin.jpg?w=753", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Freezer Friendly", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Swiss Chard", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/11/swiss-chard-and-sweet-potato-gratin/", 
        "title": "swiss chard and sweet potato gratin", 
        "directions": [
            "Prep greens: Cook onion in 2 tablespoons butter in a wide 8-quart heavy pot over moderately low heat, stirring, until softened. Add chard stems, pinch of nutmeg, and salt and pepper to taste and cook, stirring, until vegetables are tender but not browned, about 8 minutes. Increase heat to moderately high and add chard leaves by large handfuls, stirring, until all greens are wilted. Season with salt and pepper then transfer greens to a colander to drain well and press out liquid with back of a large spoon.", 
            "Make sauce: Combine cream or milk and garlic in small saucepan; bring to simmer; keep warm. Melt two tablespoons butter in a medium heavy saucepan over moderate heat and stir in flour. Cook roux, whisking, one minute, then slowly whisk in warm cream/milk and boil, whisking, one minute. Season sauce with salt and pepper.", 
            "Assemble gratin: Preheat oven to 400°F. Butter deep 9×13 baking dish. Spread half of sweet potatoes in the prepared baking dish. Sprinkle with salt, pepper, a quarter of the herbs and a 1/4 cup of the cheese. Distribute half of the greens mixture over the cheese, then sprinkle salt, pepper, a quarter of the herbs and 1/4 cup of the cheese over it. Pour half of bechamel sauce over the first two layers then continue with the remaining sweet potatoes, more salt, pepper, herbs and cheese and then the remaining greens, salt, pepper and herbs. Pour the remaining sauce over the top of the gratin, pressing the vegetables slightly to ensure that they are as submerged as possible. Sprinkle with the last 1/4 cup of cheese.", 
            "Bake gratin for about 1 hour until golden and bubbly, and most of the liquid is absorbed. Let stand 10 minutes before serving. ", 
            "Do ahead: You can make the entire gratin but not bake it up to a day in advance and keep it in the fridge. You can also make and bake the gratin and reheat it. Gratins reheat well, but they take almost as much time to gently heat through as they do to bake in the first place, especially deep ones like this. As for reheating, already baked and frozen, I will find out very soon! But I am near-positive it will be fine."
        ], 
        "date": "2009-11-12T17:08:23+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/swiss-chard-pancakes-farcous1.jpg?w=640", 
        "tags": [
            "Freezer Friendly", 
            "French", 
            "Pancakes", 
            "Photo", 
            "Swiss Chard", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/01/swiss-chard-pancakes/", 
        "title": "swiss chard pancakes", 
        "directions": [
            "To serve: Plain, thick yogurt mixed with a little lemon zest, lemon juice and salt, to taste", 
            "If you’d like to keep your finished pancakes warm while you cook them: Heat oven to 250 degrees F and line a baking sheet with foil. ", 
            "Make the batter: Put everything except the Swiss chard and oil in a blender or food processor and whirl until the batter is smooth. Scrape down sides. Add chard leaves and pulse machine until they’re chopped to your desired consistency. ", 
            "Cook the pancakes: Heat a large skillet over medium-high heat and pour in a good puddle (1/4-inch deep) of oil. Once oil is hot enough that a droplet of batter hisses and sputters, spoon about 3 tablespoons batter in per pancake. It will spread quickly. Cook until browned underneath and (the edges will scallop, adorably), then flip, cooking on the other side until browned again. Transfer to a paper towel-lined plate, and then, if you’d like to keep them warm, to the foil-lined tray in the oven. ", 
            "Repeat with remaining batter. Serve with lemony yogurt or another sauce of your choice. ", 
            "Do ahead: Unused batter keeps in fridge for 3 days. Finished pancakes keep in fridge for a couple days, and will freeze much longer. Separate pancakes with pieces of waxed or parchment paper so they don’t glue together."
        ], 
        "date": "2016-01-11T12:02:29+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds fresh spinach", 
            "3 1/2 to 4 1/2 tablespoons unsalted butter", 
            "Salt and pepper", 
            "1 1/2 tablespoons flour", 
            "1 cup stock (your choice; Julia recommends beef) or cream (I used stock; it doesn’t *need* cream)", 
            "3/4 cup grated Swiss cheese", 
            "2 tablespoons fine, dry breadcrumbs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/03/best-baked-spinach.jpg?w=751", 
        "tags": [
            "French", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Spinach", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/03/the-best-baked-spinach/", 
        "title": "the best baked spinach", 
        "directions": [
            "Stem and wash your spinach (see Tips below) well but no need to spin or pat it dry. Place spinach in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 2 to 4 minutes for baby spinach and 4 to 6 minutes for regular spinach. Transfer to a colander, immediately fill pot with cold water, transfer it back to the pot of cold water to shock it (stop the cooking) and drain again. Squeeze a small amount of the spinach at a time in your hands to extract as much water as possible. Chop the spinach coarsely. You should have about 3 cups of chopped spinach, or about 1 cup per pound.", 
            "Wipe out pot then melt 2 tablespoons butter over moderately high heat and stir in the spinach. Cook for 2 to 3 minutes or until all of the moisture from the spinach has boiled off — you’ll know you’re done when the spinach begins to stick to the pan.", 
            "Lower the heat and sprinkle with flour and stir for 2 minutes to cook the flour. Add 2/3 of your stock or cream, a tiny bit at a time, scraping up any stuck spinach as you do. Once the liquid is added, simmer for another minute or two, stirring frequently to prevent sticking. If you’re feeling especially indulgent, stir in one more tablespoon of butter. If needed, add all or part of remaining liquid. Season with salt (I found 1/2 teaspoon table salt about right) and pepper.  ", 
            "Preheat oven to 375 degrees. Lightly butter a shallow 1-quart baking dish. Stir 1/2 cup cheese into the spinach and pour it into the baking dish. Mix the remaining cheese with breadcrumbs and sprinkle on spinach. Melt 1 1/2 tablespoons remaining butter and pour it over the top. Bake until heated through and slightly brown on the top, about 30 minutes.", 
            "Serve with steaks, chops, veal, chicken, broiled fish or, if you’re us, eggs, glorious eggs.", 
            "Do ahead: Spinach can be blanched and chopped several hours or a day in advance. Cover and refrigerate until needed. Gratin can be fully assembled and 30 minutes before needed, placed in a preheated 375 degree oven to bake, then served.", 
            "To stem spinach, as per Julia: If spinach is young and tender, remove the stems at the base of the leaf. If more mature, fold the leaf vertically with its underside up, grasp the leaf in one hand and the stem in the other and and rip it off toward the tip of the leaf, removing the stem and the tough tendrils. Discard any wilted or yellow leaves.", 
            "How I wash greens: Fill a large bowl or basin with cold water. Drop in the spinach and swish it around a few times so it deposits any sand and grit before lifting it out of the bowl (leaving any grit/dirt at the bottom of the bowl and not dragging the clean leaves through it) and drop it in a colander. No need to dry it for this recipe, but in others, I either spread it out on towels or run it through a salad spinner."
        ], 
        "date": "2011-03-08T19:45:59+00:00"
    }, 
    {
        "ingredient_list": [
            "3 russet potatoes (mine were 9 to 10 ounces each)", 
            "1 bundle lacinato kale (aka dinosaur, tuscan or black kale), swiss chard or spinach (10 ounces)", 
            "Coarse salt", 
            "1 tablespoon olive oil", 
            "1 tablespoon butter", 
            "1 large leek", 
            "1 cup coarsely grated cheddar, gruyere or comté, 2/3 cup finely grated parmesan or pecorino, or 1/2 to 2/3 cup cream cheese or goat cheese, softened", 
            "3/4 cup sour cream", 
            "Freshly ground black pepper or red pepper flakes to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/twice-baked-potatoes-with-kale1.jpg?w=640", 
        "tags": [
            "Budget", 
            "Gluten-Free", 
            "Kale", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/12/twice-baked-potatoes-with-kale/", 
        "title": "twice-baked potatoes with kale", 
        "directions": [
            "Heat oven to 400°F (205°C).", 
            "Cook potatoes the first time: Gently scrub potatoes but do not peel. Pierce all over with a fork so that steam escapes [raise your hand if you’ve forgotten to do this and had the pleasure of jumping three inches off the sofa due to an oven ka-pow!] Bake 1 hour to 1 hour 15 minutes or until potatoes are tender when pierced in center with a skewer. Leave oven on.", 
            "Alternatively, you could microwave fork-pierced potatoes for 10, turning them over halfway through to ensure even cooking. You could also boil the whole potato for 15 minutes.", 
            "While potatoes cook, prepare your filling: Tear kale, chard or spinach leaves from stems (you can save the stems for another use, such as a vegetable stock or juicing) and plunge leaves in cold water to remove any residual dirt or grit. No need to dry them when you’re done. Tear leaves into large chunks. Heat a skillet over medium-high and add greens and a pinch of salt. Cook them in the pan with just the water clinging to the leaves until they wilt and collapse. Transfer to a colander and when cool enough to handle, wring out any extra moisture in small fistfuls. On a cutting board, finely chop greens. You should have about a cup of wrung-out, well-chopped greens; don’t worry if you have a little more or less.", 
            "Trim leek down to just yellow and pale green part. Halve lengthwise — if it’s gritty inside, plunge it in cold water to remove grit, then pat dry. Cut leek halves lengthwise again, so that they’re in quarter-stalks, and thinly slice.  ", 
            "Heat a large skillet over medium heat; add butter and oil. Once both are warm, add leek and reduce heat to medium-low. Cook until mostly tender and sweet, about 10 to 15 minutes, stirring occasionally. Try to avoid letting it brown. Add chopped greens back to skillet and warm with leeks, 1 minute. Transfer mixture to a bowl.", 
            "Prepare potatoes: When potatoes are cool enough to handle, halve lengthwise and scoop out all but the last 1/4-inch thickness of skin and potato (essentially, you want to leave a shell inside for stability) and add potato filling to bowl with leeks and greens. Arrange the potato shells on a baking sheet. Mash potatoes, leeks and greens together until smooth. Stir in the sour cream, 3/4 of cheese and more salt and pepper than you think you’ll need. Heap filling in prepared potato skins. Sprinkle with remaining 1/4 of cheese. ", 
            "Bake potatoes a second time: For 20 to 30 minutes, until bronzed and crisp on top. "
        ], 
        "date": "2014-12-01T12:07:44+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups all-purpose flour, chilled in the freezer for 30 minutes", 
            "1/4 teaspoon salt", 
            "8 tablespoons (1 stick) cold unsalted butter, cut into pieces and chill again", 
            "1/4 cup sour cream", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup ice water", 
            "Filling:", 
            "1 large or 2 small zucchinis, sliced into 1/4 inch thick rounds", 
            "1 tablespoon plus 1 teaspoon olive oil", 
            "1 medium garlic clove, minced (about 1 teaspoon)", 
            "1/2 cup ricotta cheese", 
            "1/2 cup (about 1 ounce) grated Parmesan cheese", 
            "1/4 cup (1 ounce) shredded mozzarella", 
            "1 tablespoon slivered basil leaves", 
            "Glaze:", 
            "1 egg yolk beaten with 1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/4744441126_6c461103dd_o.jpg?w=750", 
        "tags": [
            "Herbs", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2010/06/zucchini-and-ricotta-galette/", 
        "title": "zucchini and ricotta galette", 
        "directions": [
            "Make dough: Whisk together the flour and salt in a large bowl. Sprinkle bits of butter over dough and using a pastry blender, cut it in until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, whisk together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour.", 
            "Make filling: Spread the zucchini out over several layers of paper towels. Sprinkle with 1/2 teaspoon salt and let drain for 30 minutes; gently blot the tops of the zucchini dry with paper towels before using. In a small bowl, whisk the olive oil and the garlic together; set aside. In a separate bowl, mix the ricotta, Parmesan, mozzarella, and 1 teaspoon of the garlicky olive oil together and season with salt and pepper to taste.", 
            "Prepare galette: Preheat oven to 400 degrees. On a floured work surface, roll the dough out into a 12-inch round. Transfer to an ungreased baking sheet (though if you line it with parchment paper, it will be easier to transfer it to a plate later).  Spread the ricotta mixture evenly over the bottom of the galette dough, leaving a 2-inch border. Shingle the zucchini attractively on top of the ricotta in concentric circles, starting at the outside edge. Drizzle the remaining tablespoon of the garlic and olive oil mixture evenly over the zucchini. Fold the border over the filling, pleating the edge to make it fit. The center will be open. Brush crust with egg yolk glaze.", 
            "Bake the galette until the cheese is puffed, the zucchini is slightly wilted and the galette is golden brown, 30 to 40 minutes. Remove from the oven, sprinkle with basil, let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature. "
        ], 
        "date": "2010-06-29T09:51:02+00:00"
    }
]