{
  "date": "2009-05-19T15:40:42+00:00",
  "directions": [
    "Preheat oven to 400°F with rack in middle. Butter and flour a 9-inch round cake pan.",
    "Whisk together flour, baking powder, baking soda, and salt and set aside. In a larger bowl, beat butter and 2/3 cup (146 grams) sugar with an electric mixer at medium-high speed until pale and fluffy, then beat in vanilla and zest, if using. Add egg and beat well.",
    "At low speed, mix in flour mixture in three batches, alternating with buttermilk, beginning and ending with flour, and mixing until just combined.Spoon batter into cake pan, smoothing top. Scatter (see Note) raspberries evenly over top and sprinkle with remaining 1 1/2 tablespoons (22 grams) sugar.",
    "Bake until cake is golden and a wooden pick inserted into center comes out clean, 20 to 25 minutes.  Cool in pan 10 minutes, then turn out onto a rack and cool to warm, 10 to 15 minutes more. Invert onto a plate.",
    "[Baking time updated, shortened, after so many of you concurred that this cake bakes crazy quickly.]",
    "Note: Directions like “scatter” always scare me. Where’s the science? Here’s what my neuroses taught us: the ones that were downward were almost all swallowed by the batter. The \"o\" ones stayed empty, like cups. Both were delicious.",
    "Make your own almost-buttermilk: No need to buy buttermilk especially for this or any recipe. Add one teaspoon tablespoon [updated, as an astute reader pointed out that the larger amount is more common] of vinegar or lemon juice to one cup of milk and let it sit until it clabbers, about 10 minutes. Voila, buttermilk!"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/raspberry-buttermilk-cake.jpg?w=753",
  "ingredient_list": [
    "1 cup (130 grams) all-purpose flour",
    "1/2 teaspoon (2 grams) baking powder",
    "1/2 teaspoon (2 grams) baking soda",
    "1/4 teaspoon salt",
    "1/2 stick (56 grams) unsalted butter, softened",
    "2/3 cup (146 grams) plus 1 1/2 tablespoons (22 grams) sugar, divided",
    "1/2 teaspoon pure vanilla extract",
    "1/2 teaspoon finely grated lemon zest (optional)",
    "1 large (57 grams) egg",
    "1/2 cup (118 ml) well-shaken buttermilk",
    "1 cup (5 ounces or 140 grams) fresh raspberries "
  ],
  "tags": [
    "Cake",
    "Everyday Cakes",
    "Fruit",
    "Photo",
    "Raspberries",
    "Summer"
  ],
  "title": "raspberry buttermilk cake",
  "url": "https://smittenkitchen.com/2009/05/raspberry-buttermilk-cake/"
}