{
  "date": "2011-07-16T12:48:58+00:00",
  "directions": [
    "Preheat oven to 425 degrees. Line a large baking sheet with parchment paper. In the bottom of a large, wide-ish bowl, whisk flours, baking powder, sugar and salt together.",
    "With a pastry blender: Add the butter (no need to chop it first) and use the blender to both cut the butter into the flour mixture until the biggest pieces are the size of small peas. Toss in raspberries and use the blender again to break them into halves and quarter berry sized chunks.",
    "Without a pastry blender: Cut the butter into small pieces with a knife and work the butter into the flour mixture with your fingertips until the mixture resembles a coarse meal. Roughly chop the raspberries on a cutting board and stir them into the butter-flour mixture.",
    "Both methods: Add the ricotta and heavy cream together and stir them in to form a dough with a flexible spatula.Using your hands, gently knead dough into an even mass, right in the bottom of the bowl. Don’t fret if the raspberries get muddled and smudge up the dough. This is a pretty thing.",
    "With as few movements as possible, transfer the dough to a well-floured counter, flour the top of the dough and pat it into a 7-inch square about 1-inch tall. With a large knife, divide the dough into 9 even squares. Transfer the scones to prepared baking sheet with a spatula. Bake the scones for about 15 minutes, until lightly golden at the edges. Cool in pan for a minute, then transfer to a cooling rack. It’s best to cool them about halfway before eating them, so they can set a bit more. I know, way to be a big meanie, right?",
    "Do ahead: Scones are always best the day they are baked. However, if you wish to get a lead on them, you can make them, arrange them on your parchment-lined sheet and freeze them. If you’re prepping just one day in advance, cover the tray with plastic wrap and bake them the day you need them. If you’re preparing them more than one day in advance, once they are frozen, transfer them to a freezer bag or container. Bring them back to a parchment-lined sheet when you’re ready to bake them. No need to defrost the froze, unbaked scones, just add 2 to 3 minutes to your baking time."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/07/whole-wheat-raspberry-ricotta-scones.jpg?w=734",
  "ingredient_list": [
    "1 cup (120 grams) whole wheat flour",
    "1 cup (125 grams) all-purpose flour",
    "1 tablespoon baking powder, preferably aluminum-free",
    "1/4 cup (50 grams) granulated sugar",
    "1/2 teaspoon table salt",
    "6 tablespoons (85 grams) cold unsalted butter",
    "1 cup  (136 grams or 4 3/4 ounces) fresh raspberries",
    "3/4 cup (189 grams) whole milk ricotta",
    "1/3 cup (79 ml) heavy cream"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Photo",
    "Raspberries",
    "Scones/Biscuits"
  ],
  "title": "whole wheat raspberry ricotta scones",
  "url": "https://smittenkitchen.com/2011/07/whole-wheat-raspberry-ricotta-scones/"
}