{
  "date": "2009-06-23T12:55:38+00:00",
  "directions": [
    "1. Preheat the oven to 350°F (180°C). Line a 12-cup muffin tin with paper cupcake liners or lightly butter the pan. Or, if you’re Deb and have to be fancy dust off that much-neglected mini-springform pan and coat it with a nonstick spray.",
    "2. In a heatproof bowl set over simmering water, melt the chocolate with 1/4 cup of the oil.  Once melted and smooth, remove from the heat. (Alternately, you can do this in the microwave on high for 30 seconds, then in 15 second increments, stirring well between each until smooth.)",
    "3. In another bowl, mix the remaining 1/4 cup oil with yogurt, sugar, eggs and vanilla and almond extracts.",
    "4. In a large bowl, whisk the flour, baking powder, and salt. Make a well in the center of the flour mixture and pour in the yogurt mixture. Stir lightly a couple times, then add the melted chocolate and stir until just smooth.",
    "5. Divide the batter among the muffin or springform cups and bake for 20 to 25 minutes (less for mini-springforms, more for muffins, though your oven may vary) or until they feel barely set in the middle and a tester or toothpick comes out clean.",
    "6. Remove from the oven and cool on a wire rack before serving with coffee and a nice dollop of lightly sweetened whipped cream and any berries you can scrounge up in your fridge. Or, you know, as is.",
    "Do ahead: These cakes can be stored in an airtight container at room temperature for four days. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/chocolate-yogurt-snack-cakes.jpg?w=753",
  "ingredient_list": [
    "7 ounces (200 grams) bittersweet or semisweet chocolate, coarsely chopped",
    "1/2 cup (125 ml) vegetable oil",
    "1/2 cup (125 ml) plain, whole-milk yogurt",
    "1 cup (200 grams) sugar",
    "3 large eggs, at room temperature",
    "1 teaspoon vanilla extract",
    "1/2 teaspoon almond extract",
    "1 1/2 cups (200 grams) flour",
    "1 1/2 teaspoons baking powder (David recommends aluminum-free baking powders, such as Rumford or Bob’s Red Mill, as do I)",
    "1/2 teaspoon coarse salt"
  ],
  "tags": [
    "Cake",
    "Chocolate",
    "Everyday Cakes",
    "Photo"
  ],
  "title": "chocolate yogurt snack cakes",
  "url": "https://smittenkitchen.com/2009/06/chocolate-yogurt-snack-cakes/"
}