{
  "date": "2008-12-12T19:51:51+00:00",
  "directions": [
    "Preheat oven to 375°F with rack in middle. Generously butter a 9- by 2-inch round cake pan. Line bottom with a round of parchment paper and butter parchment.",
    "Scrape seeds from vanilla bean into a food processor with tip of a paring knife (reserve pod for another use if desired). Add sugar and pulse to combine. Transfer to a bowl.",
    "Pulse cranberries with 1/2 cup vanilla sugar in processor until finely chopped (do not purée).",
    "Whisk together 2 cups flour, baking powder, and salt. Beat together 1 stick butter and 1 cup vanilla sugar in a bowl with an electric mixer at medium-high speed until pale and fluffy. Add eggs 1 at a time, beating well after each addition. Scrape down side and bottom of bowl. Reduce speed to low and mix in flour mixture and milk alternately in batches, beginning and ending with flour, until just combined.",
    "Spread half of batter in pan, then spoon cranberries over it, leaving a 1/2-inch border around edge. Spoon small bits of the remaining batter over the top of the cranberries and smooth them with as gentle of a hand as possible.",
    "Blend remaining 1/4 cup vanilla sugar with remaining tablespoon each of butter and flour using your fingertips. Crumble over top of cake.",
    "Bake until a wooden pick inserted into cake (not into cranberry filling) comes out clean and side begins to pull away from pan, 45 to 50 minutes. Cool in pan 30 minutes, then remove from pan and cool completely, crumb side up.",
    "Do ahead: Coffee cake can be made 1 day ahead and kept, tightly wrapped, at room temperature."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cranberry-vanilla-coffee-cake1.jpg?w=500",
  "ingredient_list": [
    "1/2 vanilla bean, split lengthwise",
    "1 3/4 cups sugar",
    "2 cups fresh or thawed frozen cranberries (6 ounces)",
    "2 cups plus 1 tablespoon all-purpose flour, divided",
    "2 teaspoons baking powder",
    "3/4 teaspoon salt",
    "1 stick plus 1 tablespoon unsalted butter, softened, divided",
    "2 large eggs",
    "1/2 cup whole milk",
    "Confectioners sugar, for dusting"
  ],
  "tags": [
    "Cake",
    "Cranberries",
    "Everyday Cakes",
    "Fall",
    "Fruit",
    "Photo"
  ],
  "title": "cranberry vanilla coffee cake",
  "url": "https://smittenkitchen.com/2008/12/cranberry-vanilla-coffee-cake/"
}