{
  "date": "2014-03-17T12:33:32+00:00",
  "directions": [
    "Heat your oven to 350°F. Butter a 9×5-inch loaf pan, or spray it with a nonstick baking spray.",
    "Mash bananas in the bottom of a large bowl. (You’ll have a little over 1 cup mashed banana total.) Whisk in melted butter, then brown sugar, egg, and vanilla. Place baking soda, salt, cinnamon (if using), flour and cocoa powder in a sifter or fine-mesh strainer and sift over wet ingredients. (My cocoa is almost always lumpy, so this is essential for me.) Stir dry and wet ingredients with a spoon until just combined. Stir in chocolate chunks or chips.",
    "Pour into prepared pan and bake 55 to 65 minutes, until a tester or toothpick inserted into the center of the cake comes out batter-free. (A melted chocolate chip smear is expected, however.) Cool in pan for 10 to 15 minutes, then run a knife around the edge and invert it out onto a cooling rack. Serve warm or at room temperature. ",
    "The banana bread will keep for up to 4 days at room temperature. I keep mine wrapped in foil. It goes without saying that it has never actually lasted that long."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/double-chocolate-banana-bread1.jpg?w=640",
  "ingredient_list": [
    "3 medium-to-large very ripe bananas",
    "1/2 cup (115 grams) butter, melted",
    "3/4 cup (145 grams) brown sugar (I use dark here; either light or dark work)",
    "1 large egg",
    "1 teaspoon pure vanilla extract",
    "1 teaspoon baking soda",
    "1/4 teaspoon table salt",
    "1/2 teaspoon ground cinnamon (optional; I skip it)",
    "1 cup (125 grams) all-purpose flour",
    "1/2 cup Dutch-process cocoa powder",
    "1 cup (about 6 ounces or 170 grams) semisweet or bittersweet chocolate chunks or chips"
  ],
  "tags": [
    "Bananas",
    "Chocolate",
    "Everyday Cakes",
    "Photo"
  ],
  "title": "double chocolate banana bread",
  "url": "https://smittenkitchen.com/2014/03/double-chocolate-banana-bread/"
}