{
  "date": "2009-02-27T00:23:10+00:00",
  "directions": [
    "Preheat oven to 350°F with rack in middle. Generously butter an 8- by 8-inch square or 9- by 2-inch round cake pan and line bottom with a round of parchment paper.",
    "Toast coconut in a small baking pan in oven, stirring once or twice, until golden, 8 to 12 minutes. Cool. Leave oven on.",
    "Beat together butter, granulated sugar, and zest with an electric mixer until fluffy. Beat in eggs one at a time. Stir together flour and 1/2 cup coconut (reserve remainder for topping). Stir together milk and 2 tablespoons lime juice. At low speed, mix flour and milk mixtures into egg mixture alternately in batches, beginning and ending with flour.",
    "Spoon batter into pan and smooth top. Bake until golden and a wooden pick inserted into center comes out clean, 40 to 45 minutes. Cool to warm, then turn out of pan and discard parchment.",
    "Whisk together confectioners sugar, remaining 2 tablespoons lime juice, and rum (if using) and pour over cake. Sprinkle with remaining coconut.",
    "* Make your own: You can make your own self-rising flour — I did, when I realized I had self-rising flour in the pantry but my last known use of it was nearly three years ago. Unfortunately, there are many recipes out there and they don’t all agree. The most common one has you add for each cup of flour 1/2 teaspoon of salt and 1 1/2 teaspoons baking powder but some also suggest 1 teaspoon baking powder instead. I’m going to suggest that you use the 1 teaspoon level because I used the higher one and my cake sunk ever so slightly in the center, a suggestion that it had too much leavening in it. So: For every cup of flour, add a 1/2 teaspoon of salt and 1 teaspoon of baking powder, whisk together very well and sift the mixture. Measure your self-rising flour from there."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/02/key-lime-coconut-cake.jpg?w=751",
  "ingredient_list": [
    "1 cup sweetened flaked coconut",
    "1 stick unsalted butter, softened",
    "1 1/4 cups granulated sugar",
    "1 tablespoon grated Key lime zest",
    "2 large eggs",
    "1 3/4 cups self-rising flour*",
    "3/4 cup whole milk",
    "1/4 cup fresh Key lime juice, divided",
    "1 cup confectioners sugar",
    "1 tablespoon rum (optional)"
  ],
  "tags": [
    "Cake",
    "Citrus",
    "Coconut",
    "Everyday Cakes",
    "Lime",
    "Photo"
  ],
  "title": "key lime coconut cake",
  "url": "https://smittenkitchen.com/2009/02/key-lime-coconut-cake/"
}