{
  "date": "2009-12-25T19:59:19+00:00",
  "directions": [
    "Heat your oven to 350°F (175°C) and lightly grease and flour a 10-inch tube pan or two 9-by-5-inch loaf pans.",
    "Combine the flour, baking soda, baking powder, salt, and cinnamon in a large mixing bowl, and stir with a fork to mix everything well. If you’re using nuts, scoop out about 1/4 cup of the flour mixture and combine it in a small bowl with the chopped walnuts, stirring and tossing to coat the nuts with the flour.",
    "Peel and core pears, then grate them. You’ll want two grated cups total; set them briefly aside. In a medium bowl, combine the butter or oil, eggs, sugar, grated pear, nuts (if using), and vanilla, and stir to mix everything well. Scrape the pear mixture into the flour mixture and stir just until the flour disappears and the batter is evenly moistened.",
    "Quickly scrape the batter into the prepared pans and bake at 350°F (175°C) for 60 to 70 minutes, or until the bread is handsomely browned and firm on top and a wooden skewer inserted in the center comes out clean.",
    "Cool the bread in the pan on a wire rack or folded kitchen towel for about 10 minutes. Then turn it out onto a plate or a wire rack to cool completely, top side up. Serve it as is, sprinkle it with confectioners sugar or drizzle it with a simple glaze made from whisking 3 tablespoons buttermilk, a dash of vanilla and 2 cups of confectioners’ sugar together."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pear-bread1.jpg?w=500",
  "ingredient_list": [
    "3 cups all-purpose flour",
    "1 teaspoon baking soda",
    "1/4 teaspoon baking powder",
    "1 teaspoon salt",
    "1 tablespoon ground cinnamon",
    "1 cup chopped walnuts (optional)",
    "3/4 cup butter, softened, or 3/4 cup vegetable oil",
    "3 eggs, lightly beaten",
    "2 cups sugar",
    "2 to 4 pears firm, ripe pears, depending on size (you’ll need 2 grated cups total, but I don’t recommend you grate them until you are about to use them, so they don’t brown)",
    "2 teaspoons vanilla extract"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Cake",
    "Everyday Cakes",
    "Pear",
    "Photo"
  ],
  "title": "pear bread",
  "url": "https://smittenkitchen.com/2009/12/pear-bread/"
}