{
  "date": "2016-10-13T12:01:34+00:00",
  "directions": [
    "Heat oven to 350 degrees F. Butter a 6-cup loaf pan or coat it with nonstick spray.\nIn a large bowl, whisk together pumpkin, oil, eggs and sugar until smooth. Sprinkle baking powder, baking soda, salt, cinanmon, nutmeg, ginger and cloves over batter and whisk until well-combined. Add flour and stir with a spoon, just until mixed. Scrape into prepared pan and smooth the top. In a small dish, or empty measuring cup, stir sugar and cinnamon together. Sprinkle over top of batter.\nBake bread for 65 to 75 minutes until a tester poked into all parts of cake (both the top and center will want to hide pockets of uncooked batter) come out batter-free, turning the cake once during the baking time for even coloring.\nYou can cool it in the pan for 10 minutes and then remove it, or cool it completely in there. The latter provides the advantage of letting more of the loose cinnamon sugar on top adhere before being knocked off.",
    "Cake keeps at room temperature as long as you can hide it. I like to keep mine in the tin with a piece of foil or plastic just over the cut end and the top exposed to best keep the lid crisp as long as possible."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/pumpkin-bread.jpg?w=750",
  "ingredient_list": [
    "1 15-ounce can (1 3/4 cups) pumpkin puree",
    "1/2 cup (120 ml) vegetable or another neutral cooking oil or melted butter (115 grams)",
    "3 large eggs",
    "1 2/3 (330 grams) cups granulated sugar",
    "1 1/2 teaspoons baking powder",
    "3/4 teaspoon baking soda",
    "3/4 teaspoon fine sea or table salt",
    "3/4 teaspoon ground cinnamon",
    "Heaped 1/4 teaspoon fresh grated nutmeg",
    "Heaped 1/4 teaspoon ground ginger",
    "Two pinches of ground cloves",
    "2 1/4 cups (295 grams) all-purpose flour",
    "1 tablespoon (12 grams) granulated sugar",
    "1 teaspoon ground cinnamon"
  ],
  "tags": [
    "Cake",
    "Everyday Cakes",
    "Fall",
    "Photo",
    "Pumpkin",
    "Winter Squash"
  ],
  "title": "pumpkin bread",
  "url": "https://smittenkitchen.com/2016/10/pumpkin-bread/"
}