{
  "date": "2016-01-28T12:00:36+00:00",
  "directions": [
    "Make the custard: Whisk sugar, cornstarch, salt and yolks together in the bottom of a large saucepan, ideally 4-quarts to protect against splattering as it simmers. Drizzle in milk, whisking the whole time so that no lumps form. Place over medium heat on the stove and bring up to a simmer, stirring. Once simmering, stirring, until custard thickens, 4 to 7 minutes. Remove from heat; whisk in butter, vanilla, and rum. Let chill in fridge for several hours or overnight to finish thickening. You’ll have 4 cups custard.",
    "Make the wafers: Heat oven to 350°F. In the bottom of a large bowl, combine sugar and vanilla been seeds, rubbing them together so that the abrasion from the sugar granules helps release the maximum vanilla flavor. Add the butter and beat with an electric mixer until light and fluffy. Add egg and vanilla, beat to combine. Sprinkle baking powder and salt over batter, beat to combine. Add flour and once again, beat just to combine.",
    "Line two large baking sheets with parchment paper or nonstick baking mats. Using your tiniest scoop (yes, I actually have one that holds about 1 teaspoon), spoon or even a 1-teaspoon measuring spoon, scoop the dough (you can then roll it in your palms for a more perfect final round shape) and space at least 2 inches apart on prepared sheets. Bake 10 to 11 minutes, keeping a close eye on them. You’ll want them to be nicely golden at the edges before you take them out. Let cool on racks. Yield: About 80 1 3/4-inch cookies.",
    "Assembly: Beat heavy cream with 2 teaspoons sugar until soft peaks form. Line the bottom of 8 1-cup dishes with a wafer cookie. Add custard (you’re looking to use about 1/3 of it total right now). Top with a layer of bananas. Repeat twice with more cookies (you can break them up to get them to fit better in small cups), custard and bananas. Dollop each pudding with whipped cream; chill (I prefer to do so with lids on so the whipped cream doesn’t dry out) for a few hours and up to a few days.",
    "Jars Are Weck Tulip Jelly Jars (which I’d bought to keep baby food organized then, predictably, co-opted). I urge everyone to buy “keep fresh covers” for Weck jars. Clamps are adorable and photogenic but definitely annoying in the long run. I order them from Weck directly and save the gaskets and clamps for future canning projects."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/banana-puddings-with-vanilla-bean-wafers1.jpg?w=750",
  "ingredient_list": [
    "Custard",
    "3⁄4 cup (150 grams) granulated sugar",
    "1⁄4 cup (35 grams) cornstarch",
    "1/4 teaspoon fine salt",
    "6 large egg yolks",
    "3 1⁄2 cups (830 ml) milk, preferably whole",
    "2 tablespoons (30 grams) butter, cut into a few bits",
    "1 tablespoon (15 ml) vanilla",
    "1 tablespoon (15 ml) dark rum (optional, but think it has an amazing impact here)",
    "Wafers",
    "1 cup (200 grams) granulated sugar",
    "Seeds from 1/2 of a fresh vanilla bean",
    "1/2 cup (115 grams) unsalted butter, softened",
    "1 large egg",
    "1 tablespoon (15 ml) vanilla extract",
    "3/4 teaspoon baking powder",
    "1/4 teaspoon fine sea salt",
    "1 1/3 cups (176 grams) all-purpose flour",
    "Assembly",
    "1/2 cup heavy cream",
    "2 teaspoons granulated sugar",
    "4 large firm-ripe bananas, thinly slices"
  ],
  "tags": [
    "Bananas",
    "Cookie",
    "Photo",
    "Pudding"
  ],
  "title": "banana puddings with vanilla bean wafers",
  "url": "https://smittenkitchen.com/2016/01/banana-pudding-with-vanilla-bean-wafers/"
}