{
  "date": "2013-12-09T12:00:50+00:00",
  "directions": [
    "Heat oven to 350°F. Line two baking sheets with parchment paper or silicone baking mats. Grab a bunch of pencils or chopsticks.",
    "In a medium bowl, combine all ingredients with a whisk. Working in small batches to begin (I’d just make 2 on the first tray, so you can get the hang of it; add more to ensuing batches as you do), drop 1 level teaspoon of batter for each cookie at least 3 inches apart on your prepared sheet. Using a small offset spatula or spoon, spread each into a thin 3-inch/7.5-cm circle (circles don’t need to be perfect, nobody will care). ",
    "Bake cookie sheets, one at a time, until edges are golden, about 6 to 8 minutes, but you should closely watch your first batch in case your oven bakes things more quickly and adjust the baking time for remaining batches if necessary. Slide a small offset spatula under the first cookie and quickly roll the loosened cookie around a pencil, chopstick or other thin rod into a tight cylinder. Transfer cookie-wrapped pencil to cooling rack. Repeat with remaining cookies and additional pencils. If they start cracking at the edges or become too brittle because they’ve cooled too much (this will probably happen after every two to three cookies), return the cookie sheet to the oven for 20 to 30 seconds to soften them again. Do this as many times as needed. Cookies can be slid off their pencils almost immediately, but it’s even easier if you give them a full minute or more to cool. Leave cookies to fully cool on rack; repeat process with remaining batter.",
    "Melt chocolate in a small saucepan or microwave until half-melted. Stir until remaining chunks melt. When cookies are cool, working with 1 cookie at a time, dip 1/4 inch of tip of one or both ends into melted chocolate, letting excess drip off, then rolling them in sprinkles (if desired) and place on a parchment- or wax-paper-lined baking sheet. Let stand at room temperature until chocolate sets.",
    "Do ahead: Cookies can be made 2 days ahead and kept in an airtight container. They will keep even longer in the freezer with layers of waxed paper between them.",
    "More tips: "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cigarettes-russes-cookies1.jpg?w=640",
  "ingredient_list": [
    "3 large egg whites",
    "3/4 cup (90 grams) confectioners sugar",
    "1/2 cup (65 grams) all-purpose flour",
    "1/3 cup (5 1/3 tablespoons or 75 grams) unsalted butter, melted",
    "1/4 teaspoon table salt",
    "Seeds from a 2-inch segment of vanilla bean, or 1/2 teaspoon vanilla extract or paste",
    "4 ounces (115 grams) bittersweet chocolate, finely chopped",
    "Sprinkles or other decorations (optional)"
  ],
  "tags": [
    "Cookie",
    "Photo"
  ],
  "title": "cigarettes russes cookies",
  "url": "https://smittenkitchen.com/2013/12/cigarettes-russes-cookies/"
}