{
  "date": "2013-12-11T12:30:07+00:00",
  "directions": [
    "Make the florentines: Heat oven to 350°F. In a food processor, combine the flour, pecans, cinnamon and salt and pulse until the nuts are very finely chopped, about 1 minute. Turn the nut mixture out into a large bowl. ",
    "In a small-medium saucepan set over high heat, combine the butter, sugar, heavy cream and syrup and bring it to a boil. Boil the mixture for one full minute, then turn off the heat and add the vanilla. Pour this caramel mixture over the nut mixture and stir to combine them. Set aside for at least 30 minutes, until it has cooled. Mixture will firm up and seem worrisome, but you should not be worried.",
    "Line baking sheets with parchment paper. Using a 1/2 or 1 teaspoon measure (the original recipe recommends a 1/2 teaspoon measure to scoop the cookies but I misread this and used a full teaspoon scoop — mine became 2 1/2 inches in diameter on average, which felt like a good size), scoop the dough into small balls and place them 3 inches apart on prepared baking sheets. Bake until the cookies are thin and golden brown, 7 to 9 minutes. They will not crisp until they are cool, so don’t worry if they’re soft.",
    "Let cool on baking sheets for 5 or so minutes (so they’ll set up a little) before using a thin metal spatula to carefully transfer the cookies to paper towels to blot excess oil for a couple minutes. After they’ve been blotted, transfer cookies to a cooling rack, though they should be pretty cool by now. If any butter is left puddled on the parchment, wipe that off too before repeating the process with the remaining cookie dough.",
    "Make the eggnog filling: Peel the eggs and separate the yolks from the whites. Save the whites for another use. Press the egg yolks through a fine-mesh strainer so that they become mashed and powdery. Place in a large bowl with butter, confectioners’ sugar, milk, vanilla, nutmeg, cloves and salt. Beat together until smooth, then raise mixer speed and beat until mixture is thick and frosting-like, about three minutes. Stir in the rum by hand, if using.",
    "Spread a dollop of eggnog filling on one cookie, then gently press a second one on top of it. Repeat with remaining cookies and filling. Place them in the fridge for 10 minutes before serving, to firm up the filling.",
    "Do ahead: The dough and the icing can be refrigerated in an airtight container or up to 3 days before baking. The baked, unfilled florentines can be stored in a loosely covered container at room temperature for up to two (though I had them longer) before filling them. Humidity is their enemy, makes them stick together. The original recipe says that once filled, the florentines need to be eaten immediately but our held up crisp in the fridge in a loosely covered container (not airtight) for a couple days. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/eggnog-florentines1.jpg?w=640",
  "ingredient_list": [
    "Pecan florentines",
    "1/4 cup plus 2 tablespoons (6 tablespoons or 45 grams) all-purpose flour",
    "1/2 cup (about 55 grams) pecan halves",
    "1/4 teaspoon ground cinnamon (I halved this, found it to be just-enough)",
    "1/8 teaspoon kosher salt (I recommend doubling this)",
    "1/2 cup (115 grams) unsalted butter, cold is fine",
    "2/3 cup (65, oops, sorry, it is 130 grams) granulated sugar (I would drop this by a tablespoon or two next time)",
    "2 tablespoons heavy cream",
    "1 tablespoon corn syrup, honey, or golden syrup",
    "1/4 teaspoon vanilla extract",
    "Eggnog filling",
    "4 large eggs, hard-boiled",
    "4 tablespoons (55 grams) unsalted butter, at room temperature",
    "2 1/2 cups (300 grams) confectioners’ sugar",
    "1 tablespoon whole milk",
    "1/2 teaspoon vanilla extract",
    "3/4 teaspoon freshly grated nutmeg (I halved this because I’m a spice wimp)",
    "1/4 teaspoon ground cloves (I halved this too)",
    "1/8 teaspoon kosher salt",
    "2 tablespoons dark rum (can be skipped or reduced)"
  ],
  "tags": [
    "Christmas",
    "Cookie",
    "Photo"
  ],
  "title": "eggnog florentines",
  "url": "https://smittenkitchen.com/2013/12/eggnog-florentines/"
}