{
  "date": "2010-03-24T11:52:30+00:00",
  "directions": [
    "Pulse hazelnuts, sugar, matzo cake meal or flour, and salt in a food processor until finely ground. (Be careful not to grind to a paste.) Transfer to a bowl and stir in butter, egg, and extract until combined well. Chill dough, covered, until firm, about 30 minutes.",
    "Put oven rack in middle position and preheat oven to 350°F.",
    "Drop level tablespoons of dough 1 inch apart onto 2 ungreased baking sheets (though I lined mine with parchment paper, for an easier lazier clean-up). Roll dough into balls, then chill until slightly firm, about 10 minutes. ",
    "Press one piece of chocolate firmly into the top of each ball of cookie dough and bake, 1 sheet at a time, until tops are pale golden and undersides are golden, 10 to 12 minutes. Be careful not to overbake. Transfer cookies to a rack and cool completely.",
    "To fill with jam instead: After balls of cookie dough have been chilled for an additional 10 minutes, make a 1/2-inch-wide (1/3-inch-deep) indentation in center of each ball using your thumb, index finger, or the rounded end of a wooden spoon. Fill each indentation with 1/4 teaspoon jam.",
    "Almond variation: The hazelnuts can also be swapped with 3/4 cup sliced almonds. ",
    "Do ahead: Cookies keep in an airtight container at room temperature 3 days."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/hazelnut-chocolate-thumbprint-cookies1.jpg?w=500",
  "ingredient_list": [
    "1 almost-full cup (4 ounces) hazelnuts, toasted, skinned and cooled",
    "2/3 cup sugar",
    "2/3 cup matzo cake meal or 1 cup plus 1 tablespoon flour",
    "1/4 teaspoon salt",
    "1 stick (1/2 cup) unsalted butter, melted and cooled slightly",
    "1 large egg, lightly beaten",
    "1 teaspoon vanilla extract",
    "Chocolate (I used chocolate baking discs or “wafers”; 2 or 3 chocolate chips would also work) "
  ],
  "tags": [
    "Chocolate",
    "Cookie",
    "Passover",
    "Photo"
  ],
  "title": "hazelnut chocolate thumbprint cookies",
  "url": "https://smittenkitchen.com/2010/03/hazelnut-chocolate-thumbprint-cookies/"
}