[
    {
        "ingredient_list": [
            "2 sticks (8 ounces; 230 grams) unsalted butter, at room temperature", 
            "2/3 cup (80 grams) confectioners’ sugar, sifted", 
            "2 large egg yolks, at room temperature", 
            "Pinch of salt", 
            "1 teaspoon (5 ml) vanilla or almond extract", 
            "2 cups (280 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/12/slice-and-bake-cookie-palette.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/a-slice-and-bake-cookie-palette/", 
        "title": "a slice-and-bake cookie palette", 
        "directions": [
            "1. Put the butter in the bowl of a mixer fitted with the paddle attachment and beat at medium speed until it is smooth. Add the sifted confectioners’ sugar and beat again until the mixture is smooth and silky. Beat in the egg yolks and vanilla or almond, followed by the salt and any dried fruits, zest, nuts or seeds. Reduce the mixer speed to low and add the flour, beating just until it disappears. It is better to underbeat than overbeat at this point; if the flour isn’t fully incorporated, that’s okay just blend in whatever remaining flour needs blending with a rubber spatula. Turn the dough out onto a counter, gather it into a ball, and divide it in half. Wrap each piece of dough in plastic wrap and refrigerate for about 30 minutes.", 
            "2. Working on a smooth surface, form each piece of dough into a log that is about 1 to 1 1/4 inches (2.5 to 3.2 cm) thick. (Get the thickness right, and the length you end up with will be fine.) Wrap the logs in plastic and chill for 2 hours. (The dough can be wrapped airtight and kept refrigerated for up to 3 days or stored in the freezer for up to 1 month.)", 
            "3. Position the racks to divide the oven into thirds and preheat the oven to 350°F (180°C). Line two baking sheets with parchment paper.", 
            "4. While the oven is preheating, roll cookie logs in any coatings of your choice. Then, using a sharp slender knife, slice each log into cookies about 1/3 inch (10 mm) thick. (You can make the cookies thicker if you’d like; just bake them longer.) Place the cookies on the lined baking sheets, leaving about 1/2 inch (1.5 cm) space between them.", 
            "5. Bake the cookies for 12 to 14 minutes, or until they are set but not browned. Transfer the cookies to cooling racks to cool to room temperature.", 
            "Do ahead: Packed airtight, the cookies will keep for about 5 days at room temperature, or in the freezer for a month. Unbaked logs can be frozen for longer. "
        ], 
        "date": "2007-12-21T09:00:33+00:00"
    }, 
    {
        "ingredient_list": [
            "3 1/4 cups all purpose flour", 
            "1 tablespoon baking powder", 
            "1/3 teaspoon salt", 
            "1 1/2 cups sugar", 
            "10 tablespoons (1 1/4 sticks) unsalted butter, melted", 
            "3 large eggs", 
            "1 tablespoon vanilla extract", 
            "1 tablespoon orange liqueur", 
            "1 tablespoon orange zest", 
            "1 cup whole almonds, toasted, coarsely chopped or sliced almonds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/03/almond-biscotti.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Italian", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/03/almond-biscotti/", 
        "title": "almond biscotti", 
        "directions": [
            "1 large egg white", 
            "Position rack in center of oven and preheat to 350°F. Line baking sheet with parchment paper. Sift flour, baking powder and salt into medium bowl. Mix sugar, melted butter, 3 eggs, vanilla extract, orange liquer and zest in large bowl. Add flour mixture to egg mixture and stir with wooden spoon until well blended. Mix in almonds.", 
            "Divide dough in half. Using floured hands, shape each dough half into 13 1/2-inch-long, 2 1/2-inch-wide log. Transfer both logs to prepared baking sheet, spacing apart. Whisk egg white in small bowl until foamy; brush over top and sides of each dough log.", 
            "Bake logs until golden brown (logs will spread), about 30 minutes. Cool logs completely on sheet on rack, about 25 minutes. Maintain oven temperature.", 
            "Transfer logs to work surface; discard parchment paper. Using serrated knife, cut logs on diagonal into 1/2-inch-wide slices. Arrange slices, cut side down, on same baking sheet. Bake 12 minutes. Turn biscotti over; bake until just beginning to color, about 8 minutes. Transfer to rack and cool.", 
            "Do ahead: Can be prepared one week ahead, though mine have kept even longer. Store in airtight container at room temperature. "
        ], 
        "date": "2008-03-05T13:30:02+00:00"
    }, 
    {
        "ingredient_list": [
            "7 ounces (198 grams) almond paste", 
            "1/4 cup (50 grams) granulated sugar", 
            "1 large egg white", 
            "Two pinches of sea salt", 
            "1 1/4 cup (130 grams) sliced almonds, blanched are more traditional", 
            "6 ounces semi- or bittersweet chocolate, chopped or in chips (about 1 cup)", 
            "Colored sprinkles (optional, but not really)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/04/almond-horns-mandelhoernchen.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Gluten-Free", 
            "Passover", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2017/04/almond-horn-cookies/", 
        "title": "almond horn cookies", 
        "directions": [
            "Heat oven to 350 degrees F. Line a large baking sheet with parchment paper.\nMake cookie dough: Cut, tear or grate paste and place in bowl with the paddle attachment of a stand mixer. (Mine was quite soft, so I just dropped it in in hand-torn chunks.) Add sugar and beat, covering lip of bowl with dishtowel to get bits from flying out, until almond paste cannot be broken up any further, approximately 3 to 5 minutes at a medium-high speed. Add egg white and salt and beat until uniform and creamy. Place sliced almonds in a wide-shallow bowl or plate. Have another bowl with water to get your hands wet.", 
            "Form cookies: Wet hands and scoop 1 tablespoon of dough (can use a measuring spoon, a little overfilled is fine) into your palms. It’s going to be very soft and you’re going to think something has gone very wrong; it it has not. Just keep your hands wet and roll it into a 4-ish inch log (I just stretched it across my hand, as you can see in the photo above) and drop it into the bowl of almonds. Wipe your hands dry on a towel (or the almonds stick to your hands, pulling them off the cookie) and roll log through it. Again, it’s quite soft and will seem weird at first but do you best and transfer the soft almond-covered log to the prepared tray and arc it into a horn shape. Press any loose almonds back on. Repeat with remaining dough. ", 
            "Bake cookies: For 15 minutes, or until almonds on cookies are gently toasted and horns are puffed. Let cool completely.\nTo finish: Melt chocolate in a small bowl and dip ends of cookies into it, then return to parchment-lined tray to set. Add sprinkles (optional, but of course you want to).\nDo ahead: Once chocolate is set, these keep in a tin for a week.\n"
        ], 
        "date": "2017-04-07T11:54:53+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "3/4 cup (75 grams or 2 1/2 to 2 3/4 ounces) sliced almonds, ideally toasted and cooled", 
            "1 tablespoon (10 grams) all purpose flour", 
            "A few pinches of sea salt", 
            "6 tablespoons (75 grams) plus 1 teaspoon (5 grams) granulated sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/2 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1/2 pound rhubarb", 
            "To finish", 
            "Powdered sugar or 1/4 cup jam of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/almond-rhubarb-picnic-bars-e14640188536441.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2016/05/almond-rhubarb-picnic-bars/", 
        "title": "almond rhubarb picnic bars", 
        "directions": [
            "Heat oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] ", 
            "Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind almonds, 6 tablespoons sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. ", 
            "Arrange the fruit: Trim rhubarb and cut it half horizontally top to bottom, i.e. like splitting a hamburger bun, with the flatter part on the bottom. [Update: Does this diagram help?] Keep tops and bottoms matched/stacked and cut stalks on the diagonal into about 1 1/4-inch lengths. The top and bottom of each segment should nicely “V” together, color side up, in a chevron pattern. If you mostly reach for the more green segments first and the pink-er segments second, you’ll end up with an ombré look on top. Sprinkle fruit with 1 teaspoon granulated sugar.", 
            "Bake the bars: For 45 to 55 minutes, until they’re golden on top and a toothpick inserted into the almond cream underneath comes out cream-free. The rhubarb pieces are going to move around a little as it bakes so don’t be surprised if the pattern looks a little different when it’s done. ", 
            "Let cool in pan on a rack, or in the fridge, or even in the freezer. You can decorate the bars with a little powdered sugar, or warm some jam and brush it over for a glossier finish. I find it easiest to get very clean cuts when the bars are very cold. A serrated knife, used gently, can ensure the rhubarb stays perfectly put if it’s not cold enough. While bars do not need to be refrigerated if it will just be a day or so, they keep longer and (I think) more nicely chilled."
        ], 
        "date": "2016-05-23T11:56:10+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "2 1/2 cups (313 grams) all-purpose flour, plus more for dusting surfaces, dipping fork", 
            "2 tablespoons (25 grams) granulated sugar (doubled from my standard pie dough to make this more cookie-like)", 
            "1 teaspoon (4 grams) table salt", 
            "2 sticks (225 grams, 8 ounces, 16 tablespoons or 1 cup) unsalted butter, very cold", 
            "1/2 cup (118 ml) water, very cold (I pour 1 cup and add ice while I work, then measure 1/2 cup from it when I need it)", 
            "Filling", 
            "3 medium apples, whatever you like to bake with", 
            "Squeeze of lemon juice (optional)", 
            "1/3 cup (67 grams) granulated sugar", 
            "1 teaspoon (2 grams) ground cinnamon", 
            "Few gratings fresh nutmeg", 
            "A pinch of any other spices you like in your apple pie", 
            "To finish", 
            "1 large egg", 
            "Coarse or granulated sugar for garnish", 
            "Additional stuff", 
            "A couple baking sheets covered with parchment paper", 
            "Rolling pin, pastry brush (for egg wash), fork (for crimping and dipping) and sharp knife (to make slits)", 
            "Two round cookie cutters of different sizes. I used 2 1/2-inch and 1 1/2 to 1 3/4-inch rounds. You’ll want to make sure there’s at least a 3/4-inch different in the sizes, as you’ll need the extra margin to crimp your dough. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/10/apple-pie-cookies2.jpg?w=751", 
        "tags": [
            "Apple", 
            "Cookie", 
            "Fall", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2011/10/apple-pie-cookies/", 
        "title": "apple pie cookies", 
        "directions": [
            "Make your pie dough: Whisk together flour, sugar and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of small peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I did.) Gently stir in the ice water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough in half. Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days. [Even more detailed pie dough instructions in this post, check it out!]", 
            "Meanwhile, get everything else together: Line up six small dishes. In the first one, pour some water. Leave the second one empty; you’ll use it for your apples in a bit. In the third one, mix the sugar, cinnamon, nutmeg and any other spices you like in your pie, such as a pinch of cloves. In the fourth one, place a little bit of flour to dust your surface and dip your fork for crimping. In the fifth one, whisk an egg with one teaspoon of water until smooth. In the last one, or in whatever container you keep it in, add some coarse or regular sugar for decorating the tops of the pies. You are very likely thinking I’ve lost my mind by now and you may not be terribly far off.  ", 
            "On a well-floured counter, roll out your pie dough pretty thin, a little shy of 1/8-inch thick. Lift and rotate your dough as you roll it, to ensure that it rolls out evenly and so you can be sure it’s not sticking in any place. [More rolling tips here!] Use the larger of your two cookie cutters [mine was 2 1/2-inch) to cut as many rounds as you can from the dough. Transfer them to parchment-lined baking sheets and keep them in the fridge until you need them. Once you’ve finished the first packet, repeat the process with the second packet of dough", 
            "Prepare your apples: Peel your apples. Cut thin (1/8-inch thick) slices from one side of whole apple, stopping when you hit the core. Repeat on opposite side. I got about 10 usable slices from each side of my small-medium-ish apples. Use the smaller of your two cookie cutters (mine was about 1 2/3 inches) to cut the apples into cute little discs that will fit inside your pie cookies. Place them in your second bowl, covering them with a few drops of lemon juice if you find that they’re browning quickly.", 
            "Preheat oven to 350 degrees.", 
            "And now, assemble away! Grab your first disc of chilled dough and lightly dampen it on one side with the water. This is to help it seal. Take your first disc of apple and toss it in the cinnamon spice sugar. Place it on the damp side of the bottom disk. Place a second disc of dough on top; I found it easiest to seal it by picking the whole thing up (this is when you’ll be glad that your dough is cold and semi-firm; if it’s soft and getting sticky, chill it until it’s easy to pick up) and press the tops and bottoms around the apple with your fingers. Back on the floured counter, cut decorative slits in your “pies”. Dip your fork in the flour and use it to create a decorative crimp on the sealed edges. Brush your cookie with egg wash and sprinkle with coarse sugar. Replace on baking sheet and chill while you prepare the others. About now, you’ll curse your friendly food blogger for getting you into such an exacting cookie making process but I promise, the first couple are slow and the rest come together very quickly.", 
            "Bake your apple pie cookies for 25 minutes, or until puffed and bronzed and very pie-like. (If this is your first batch, peer in at them at 20 minutes, to make sure your oven doesn’t run hot.) Transfer to a cooling rack to cool before eating them… oh haha. I forgot who I was talking to.", 
            "Do ahead: These will keep for a few days at room temperature, though not in my apartment. You could also make a larger batch of these, doing everything but brushing them with egg and sprinkling them with sugar, and keep them frozen until needed. Bake them directly from the freezer, just adding a couple minutes to the baking time."
        ], 
        "date": "2011-10-13T09:37:45+00:00"
    }, 
    {
        "ingredient_list": [
            "Brown butter", 
            "9 tablespoons unsalted butter, cold is fine", 
            "Dough", 
            "1/4 cup browned butter, from above", 
            "2/3 cup granulated sugar", 
            "1 teaspoon vanilla extract", 
            "Seeds from half a fresh vanilla bean (optional)", 
            "2 large eggs", 
            "1 teaspoon baking powder", 
            "1/4 teaspoon kosher salt", 
            "2 1/4 cups plus 2 tablespoons cups all-purpose flour ", 
            "Filling", 
            "3/4 cup (3.6 ounces) toasted hazelnuts, skins rubbed off", 
            "1 tablespoon all purpose flour", 
            "Few pinches of sea salt", 
            "1/3 cup granulated sugar", 
            "4 to 5 tablespoons browned butter, cold, from above", 
            "1 large egg", 
            "1/4 teaspoon vanilla extract, 1 teaspoon brandy, or another flavoring of your choice (totally optional)", 
            "1/2 cup (rough estimate) apricot jam"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/apricot-hazelnut-brown-butter-hamantaschen1.jpg?w=640", 
        "tags": [
            "Cookie", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/03/apricot-hazelnut-brown-butter-hamantaschen/", 
        "title": "apricot hazelnut brown butter hamantaschen", 
        "directions": [
            "Brown your butter: You’re going to use this in two places. In a medium saucepan, melt the butter over medium heat. Keep cooking it after it has melted, stirring frequently, until it begins to smell nutty and pale brown flecks appear at the edge of the pan, which takes a few minutes. Once these reach a dark beige/medium brown color (you’ll want to watch this like a hawk, this happens quickly once it begins to toast) remove from heat. Pour 1/4 cup exactly of this browned butter mixture into the bottom of the large bowl you’re going to make your cookie dough with. Place the rest (this will be 4 to 5 tablespoons) in a small-medium dish and freeze it until you need it for the filling, which uses a more flexible amount of butter.", 
            "Make your dough:  Let the 1/4 cup browned butter cool slightly in the bottom of a large bowl, then whisk in sugar, vanilla extract, scraped vanilla bean seeds (if using). Whisk in eggs, one at a time, followed by salt and baking powder. Switch to a spoon and add first cup flour, stirring to combine. Repeat with second cup of flour, then 1/4 cup. Dough is going to become stiff, just do you best. Add the last 2 tablespoons flour and if it’s too stiff to stir with a spoon, knead it in with your hands. ", 
            "Divide dough into two parts and wrap each in a flattish disc in plastic in the fridge for 2 hours, or up to a few days. Impatient? So am I? Place discs in freezer until firm but not frozen, 20 to 30 minutes.", 
            "Make your filling: Place nuts, flour, salt and sugar in the workbowl of a food processor and run the machine until the nuts are finely ground but not yet forming a paste. Remember that browned butter you froze? Scrape it into the machine and run it until combined. Add egg and any flavorings and run the machine until a smooth paste forms. Scrape hazelnut paste back into that browned butter dish (fewer dishes) and place it in the fridge until needed. It doesn’t have to be cold to work, but it is easier to scoop.", 
            "Assemble and bake cookies: Heat oven to 350 degrees and line two large baking sheets with parchment paper or a nonstick baking mat.", 
            "Roll chilled dough, one packet at a time, out on a floured counter until 1/8-inch thick. These cookies puff in the oven, so err on the thin side. Cut into 3-inch circles. In the center of each circle, dollop the tiniest amount (a scant teaspoon, this expands in the oven so use less that it seems you’d need) of the hazelnut paste and a little (1/2 teaspoon, tops) dab of apricot jam. Fold sides up, forming a triangular shape and pinching the corners closed well. ", 
            "Arrange on baking sheet with an inch or so between cookies. Reroll scraps as needed. Repeat with remaining packet of dough.", 
            "Bake cookies for 11 minutes to start, then check the color and return them to the oven, a minute at a time, until they’re nice and golden at the edges. For me, this usually takes a couple more minutes. ", 
            "Let cool on racks. Cookies keep in an airtight container at room temperature for up to a week, and longer in the freezer."
        ], 
        "date": "2016-03-18T11:59:35+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (4 sticks) unsalted butter, slightly softened", 
            "4 egg yolks", 
            "2 cups granulated sugar", 
            "4 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/4 teaspoon salt", 
            "Optional additions: 1 teaspoon vanilla extract or 1 teaspoon lemon zest", 
            "1 cup raspberry jam, at room temperature", 
            "1/4 cup confectioners’ sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/12/austrian-raspberry-shortbread.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/austrian-raspberry-shortbread/", 
        "title": "austrian raspberry shortbread", 
        "directions": [
            "Cream the butter in a mixer fitted with a paddle attachment (or using a hand mixer) until soft and fluffy. Add the egg yolks and mix well.", 
            "Mix the granulated sugar, flour, baking powder, and salt together. Add to the butter and egg yolk mixture and mix just until incorporated and the dough starts to come together. Turn the dough out onto a floured work surface and form into two balls. Wrap each ball in plastic wrap and freeze at least 2 hours or overnight (or as long as a month, if you like).", 
            "Heat the oven to 350 degrees.", 
            "Remove one ball of dough from the freezer and coarsely grate it by hand or with the grating disk in a food processor into the bottom of a 9×13-inch baking pan or a 10-inch tart pan with a removable bottom (oops, sorry, no). Make sure the surface is covered evenly with shreds of dough.", 
            "With a piping bag with a wide tip or a zip-lock bag with the corner cut off, squeeze the jam over the surface as evenly as possible, to within 1/2 inch of the edge all the way around. Remove the remaining dough from the freezer and coarsely grate it over the entire surface.", 
            "Bake until lightly golden brown and the center no longer wiggles, 50 to 60 minutes. As soon as the shortbread comes out of the oven, dust with confectioners’ sugar. ", 
            "Cool on a wire rack, then cut in the pan with a serrated knife. I find that for this an all bar cookies, chilling the pan in the fridge makes it a lot easier to get clean cuts. "
        ], 
        "date": "2007-12-19T09:00:32+00:00"
    }, 
    {
        "ingredient_list": [
            "Custard", 
            "3⁄4 cup (150 grams) granulated sugar", 
            "1⁄4 cup (35 grams) cornstarch", 
            "1/4 teaspoon fine salt", 
            "6 large egg yolks", 
            "3 1⁄2 cups (830 ml) milk, preferably whole", 
            "2 tablespoons (30 grams) butter, cut into a few bits", 
            "1 tablespoon (15 ml) vanilla", 
            "1 tablespoon (15 ml) dark rum (optional, but think it has an amazing impact here)", 
            "Wafers", 
            "1 cup (200 grams) granulated sugar", 
            "Seeds from 1/2 of a fresh vanilla bean", 
            "1/2 cup (115 grams) unsalted butter, softened", 
            "1 large egg", 
            "1 tablespoon (15 ml) vanilla extract", 
            "3/4 teaspoon baking powder", 
            "1/4 teaspoon fine sea salt", 
            "1 1/3 cups (176 grams) all-purpose flour", 
            "Assembly", 
            "1/2 cup heavy cream", 
            "2 teaspoons granulated sugar", 
            "4 large firm-ripe bananas, thinly slices"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/banana-puddings-with-vanilla-bean-wafers1.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Cookie", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2016/01/banana-pudding-with-vanilla-bean-wafers/", 
        "title": "banana puddings with vanilla bean wafers", 
        "directions": [
            "Make the custard: Whisk sugar, cornstarch, salt and yolks together in the bottom of a large saucepan, ideally 4-quarts to protect against splattering as it simmers. Drizzle in milk, whisking the whole time so that no lumps form. Place over medium heat on the stove and bring up to a simmer, stirring. Once simmering, stirring, until custard thickens, 4 to 7 minutes. Remove from heat; whisk in butter, vanilla, and rum. Let chill in fridge for several hours or overnight to finish thickening. You’ll have 4 cups custard.", 
            "Make the wafers: Heat oven to 350°F. In the bottom of a large bowl, combine sugar and vanilla been seeds, rubbing them together so that the abrasion from the sugar granules helps release the maximum vanilla flavor. Add the butter and beat with an electric mixer until light and fluffy. Add egg and vanilla, beat to combine. Sprinkle baking powder and salt over batter, beat to combine. Add flour and once again, beat just to combine.", 
            "Line two large baking sheets with parchment paper or nonstick baking mats. Using your tiniest scoop (yes, I actually have one that holds about 1 teaspoon), spoon or even a 1-teaspoon measuring spoon, scoop the dough (you can then roll it in your palms for a more perfect final round shape) and space at least 2 inches apart on prepared sheets. Bake 10 to 11 minutes, keeping a close eye on them. You’ll want them to be nicely golden at the edges before you take them out. Let cool on racks. Yield: About 80 1 3/4-inch cookies.", 
            "Assembly: Beat heavy cream with 2 teaspoons sugar until soft peaks form. Line the bottom of 8 1-cup dishes with a wafer cookie. Add custard (you’re looking to use about 1/3 of it total right now). Top with a layer of bananas. Repeat twice with more cookies (you can break them up to get them to fit better in small cups), custard and bananas. Dollop each pudding with whipped cream; chill (I prefer to do so with lids on so the whipped cream doesn’t dry out) for a few hours and up to a few days.", 
            "Jars Are Weck Tulip Jelly Jars (which I’d bought to keep baby food organized then, predictably, co-opted). I urge everyone to buy “keep fresh covers” for Weck jars. Clamps are adorable and photogenic but definitely annoying in the long run. I order them from Weck directly and save the gaskets and clamps for future canning projects."
        ], 
        "date": "2016-01-28T12:00:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups granulated sugar", 
            "1 cup unsalted butter (2 sticks), at room temperature", 
            "4 large eggs, at room temperature", 
            "1 1/2 cups milk", 
            "1/2 teaspoon vanilla extract", 
            "1/4 teaspoon lemon extract", 
            "2 1/2 cups cake flour", 
            "2 1/2 cups all-purpose flour", 
            "1/2 teaspoon baking powder", 
            "1/2 teaspoon salt", 
            "4 cups confectioners’ sugar", 
            "1/3 to 1/2 cup water", 
            "3 ounces very bitter or unsweetened chocolate", 
            "1 teaspoon light corn syrup", 
            "1 to 2 tablespoons unsweetened cocoa (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/black-and-white-cookies.jpg?w=753", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/09/black-and-white-cookies/", 
        "title": "black and white cookies", 
        "directions": [
            "1. Preheat oven to 375 degrees. Spray 2 baking sheets with nonstick spray, or line with parchment paper.", 
            "2. In large mixing bowl, combine sugar and butter. Mix by machine or hand until fluffy. Add eggs, one at a time, then milk and vanilla and lemon extracts, and mix until smooth. Scrape down bowl.", 
            "3. In medium bowl, combine cake flour, all-purpose flour, baking powder and salt. Stir until mixed. Add dry mixture to the wet in batches, stirring well after each addition. Using a soup spoon, place heaping spoonfuls of the dough 2 inches apart on the baking sheets. Bake until edges begin to brown, 18 to 20 minutes. Cool completely.", 
            "4. Boil a cup or so of water in a small pot. Place confectioners’ sugar in large, heat-safe mixing bowl. Gradually stir in enough boiling water to the sugar to make a thick, spreadable mixture. Err on the side of caution because a too-thin frosting is hard to undo. Leave remaining boiling water on the stove.", 
            "5. Spread frosting on half of the flat side of each cookie. Once all cookie halves have been frosted, place the bowl of the remaining frosting over the hot water and bring it back to a simmer (creating a double-boiler). Stir in the bitter or unsweetened chocolate until melted, as well as the light corn syrup. At this point, depending on the chocolate you used and your preferences, you might find the chocolate color to be a little lighter than the “black” of a black-and-white cookie. If so, I find that a tablespoon or so of cocoa mixed in darkens the color nicely.", 
            "6. Ice the remaining half of the cookies with the chocolate frosting. I find that the chocolate–especially with cocoa in it–is especially prone to getting too dry, so don’t worry about whisking in an extra teaspoon of that hot water from time to smooth it back into a shiny frosting.", 
            "7. Let the frosting set. Store in an airtight container. These cookies keep for a few days, but I think they’re best on the first or second. Because of the cake nature of the bases, they can get stale quickly. However, this is really a non-issue as I have yet to make a batch that didn’t get polished off in no time."
        ], 
        "date": "2008-09-18T14:03:35+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick, 4 ounces or 113 grams) butter, melted", 
            "1 cup (218 grams or 7 3/4 ounces for light; 238 grams or 8 3/8 ounces for dark) brown sugar", 
            "1 large egg", 
            "1 teaspoon vanilla or 1/2 teaspoon almond extract", 
            "Pinch salt", 
            "1 cup (4 3/8 ounces or 125 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/blondies.jpg?w=749", 
        "tags": [
            "Bourbon", 
            "Brown Butter", 
            "Brownies/Blondies", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/blondies/", 
        "title": "blondies, infinitely adaptable", 
        "directions": [
            "Further additions, use one or a combination of: ", 
            "New favorite combination of late (added 5/24/14): We’ve gotten on a kick making these again, but I’ve really wanted to increase the toasty butterscotch flavor and have done so by: browning the butter, using dark brown sugar but only 3/4 cup (I prefer these less sweet these days), increasing the vanilla to 1 1/2 teaspoons and the salt to 1/4 teaspoon fleur de sel or flaky sea salt, plus a few flakes crumbled on top. I use 1 cup chopped bittersweet chocolate and 1/2 cup chopped walnuts or pecans as the mix-ins. Hope this provides some inspiration!"
        ], 
        "date": "2006-11-25T19:37:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 sticks unsalted butter", 
            "1/2 cup packed brown sugar (preferably dark)", 
            "1 teaspoon pure vanilla extract", 
            "1 1/3 cups all-purpose flour", 
            "1/4 teaspoon salt (flaky salt would be great in these)", 
            "Demerara sugar (Sugar in the Raw) or sanding sugar for rolling (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/brown-butter-brown-sugar-shorties1.jpg?w=500", 
        "tags": [
            "Brown Butter", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/12/brown-butter-brown-sugar-shorties/", 
        "title": "brown butter brown sugar shorties", 
        "directions": [
            "Cut butter into four or five pieces and cook butter in a small heavy saucepan over medium heat, stirring frequently, until it has a nutty fragrance and flecks on bottom of pan turn a light brown, anywhere from 4 to 7 minutes. It helps to frequently scrape the solids off the bottom of the pan in the last couple minutes to ensure even browning. Transfer butter to a bowl and chill until just firm, about 1 hour.", 
            "Beat together butter and brown sugar with an electric mixer until pale and fluffy. Beat in vanilla, then mix in flour and salt at low speed until just combined. Transfer dough to a sheet of wax paper or parchment and form into a 12-inch log, 1 1/2 inches in diameter. Chill, wrapped in wax paper, until firm, about 1 hour.", 
            "Preheat oven to 350°F with rack in middle. Unwrap dough and roll it in coarse sugar, if using, and press the granules in with the paper you’d be using to wrap it. Slice dough into 1/4-inch-thick rounds, arranging 1 1/2 inches apart on an ungreased baking sheet. Bake until surface is dry and edges are slightly darker, 10 to 12 minutes. Let sit on sheet for a minute before transferring to a rack to cool. (Cookies will quite fragile at first, but will firm up as they cool.)", 
            "Dough keeps, chilled, up to 1 week, or in the freezer, up to one month. Cookies keep in an airtight container at room temperature 1 week.", 
            "Update 12/8/08: I am going to go ahead and put a yellow/yield light on this recipe. Although I have tested it twice, and had dreamy results both times, as have the majority of respondents, enough commenters are speaking of “spreading” or “falling apart” cookies that I want to warn you to approach this recipe more cautiously. "
        ], 
        "date": "2008-12-02T13:03:17+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups (375 grams) all-purpose flour", 
            "1/2 teaspoon (3 grams) salt", 
            "1/2 teaspoon baking powder", 
            "1 cup (225 grams) lightly salted butter, softened (Deb note: I don’t really see “lightly salted” much these days, so I used one stick salted, one stick unsalted)", 
            "1 1/2 (300 grams) cups sugar", 
            "2 large eggs", 
            "1 teaspoon (5 ml) vanilla extract", 
            "2/3 cup unsweetened cocoa (approximately 60 grams — weights can vary a bit depending on brand. I use the “good” stuff–Droste, Galler or Valrhona –but I can assure you that my mother only used Hershey’s growing up, so your choice)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/brownie-roll-out-cookies1.jpg?w=500", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/04/brownie-roll-out-cookies/", 
        "title": "brownie roll-out cookies", 
        "directions": [
            "Preheat oven at 350 degrees. Whisk dry flour, salt and baking powder in bowl and set aside. Mix butter, sugar, eggs, vanilla and cocoa in mixer. Gradually add flour mixture, and mix until smooth. Wrap in plastic and chill for at least one hour.", 
            "Roll out cookie dough on floured counter. Cut into desired shapes, brushing extra deposits of flour off the top. (It does disappear once baked, though, so don’t overly fret if they go into the oven looking white.) Bake on a parchment-lined baking sheet for 8 to 11 minutes (the former for 1/8-inch thick cookies, the latter for 1/4-inch cookies) until the edges are firm and the centers are slightly soft and puffed.", 
            "Transfer to a wire rack to cool.", 
            "* According to my mother’s recipe, they’re called chocolate sugar cookies but I do not feel that it does them justice."
        ], 
        "date": "2008-04-29T12:26:04+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (145 grams) raw cashews", 
            "2 cups (250 grams) all-purpose flour", 
            "1/4 teaspoon table salt, or a heaped 1/4 teaspoon sea salt flakes", 
            "1 cup (2 sticks or 230 grams) unsalted butter, softened slightly, cut into chunks", 
            "2 cups (240 grams) powdered sugar", 
            "1/2 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cashew-butter-balls1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/12/cashew-butter-balls/", 
        "title": "cashew butter balls", 
        "directions": [
            "Heat oven to 350°F and toast cashews in a single layer until a shade darker, about 10 to 12 minutes. About halfway through the toasting time, toss the nuts around to redistribute them for even coloring. Let cool completely. You can hasten this along by transferring them to the freezer for a few minutes. ", 
            "Place cooled cashews, flour and salt in the workbowl of a food processor. Clear the kitchen of toddlers and others sensitive to loud noises, then grind the mixture to a fine powder. Pour mixture into a bowl and set aside briefly.", 
            "Add butter and *only* 1/2 cup of the powdered sugar to the empty food processor and run the machine until the mixture is creamy and combined. Add the vanilla and mix. Add the nut-flour mixture and pulse the machine until it is just combined. Scrape the soft cookie dough back into the bowl that held the nut-flour mixture, cover it with plastic wrap, and refrigerate it until firm, about an hour. ", 
            "[Do ahead: You can chill it in the fridge for up to 2 days, or in the freezer for longer.] ", 
            "Heat your oven back to 300°F. Place remaining 1 1/2 cups powdered sugar in a wide bowl. Using your hands, scoop tablespoon-sized (about 1-inch round) balls of the chilled cookie dough into your palms and quickly roll them into little balls. Place them evenly on a parchment-lined baking sheet an inch apart. Bake 20 to 25 minutes, until they feel dry on the outside, but still quite soft. (Don’t fret!) ", 
            "Let cool on sheets for a few minutes, then gently roll the hot cookies in the powdered sugar before transferring them to racks to cool completely.", 
            "Cookies keep in an airtight container for at least a week, probably two, though never at my place. They can be frozen for as long as you trust your freezer. They occasionally benefit from a fresh coating of powdered sugar before serving."
        ], 
        "date": "2012-12-21T11:03:03+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (7-ounce) tube pure almond paste (not marzipan; 3/4 cup)", 
            "1 cup sugar", 
            "Pinch of Kosher salt", 
            "2 large egg whites at room temperature for at least 30 minutes"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chewy-amaretti-cookies1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "Gluten-Free", 
            "Passover", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/04/chewy-amaretti-cookies/", 
        "title": "chewy amaretti cookies", 
        "directions": [
            "Preheat oven to 300°F and place racks in the upper and lower thirds of your oven. Line two large sheet pans with parchment paper.", 
            "Pulse almond paste, sugar and salt in a food processor until broken up, then add egg whites and puree until smooth. Transfer batter to pastry bag fitted with a 3/8-inch tip and pipe 3/4-inch rounds (1/3 inch high) about 1-inch apart in pans. Dip a fingertip in water and gently tamp down any peaks.", 
            "Bake, rotating and switching position of pans halfway through, until golden and puffed, 15 to 18 minutes.", 
            "[When you rotate the pan midway through baking, you’ll wonder why you left so much space between the cookies. Suddenly, at 15 minutes they’ll puff up and you’ll be happy you left that space!]", 
            "Let cookies cool almost completely in their pans. Once cool, they’re much easier to cleanly remove from the parchment. You can make them into sandwich cookies but spreading some jam (I used raspberry) between them or ganache (3 ounces of semi-sweet chips melted with 1 to 2 tablespoons of cream, then left to thicken a bit would be enough to sandwich the whole batch).", 
            "Cookies can be kept in an airtight container at room temperature for a day or two or frozen up to one month."
        ], 
        "date": "2009-04-02T14:35:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup whole hazelnuts, preferably blanched", 
            "2 1/2 cups flour, plus flour for work surface", 
            "1/2 cup Dutch-style cocoa powder", 
            "1 tablespoon espresso powder", 
            "Pinch of salt", 
            "1/2 teaspoon baking soda", 
            "3/4 teaspoon baking powder", 
            "4 large eggs", 
            "1 1/3 cups sugar."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chocolate-hazelnut-biscotti1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "Italian", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/07/chocolate-hazelnut-biscotti/", 
        "title": "chocolate hazelnut biscotti", 
        "directions": [
            "1. Preheat oven to 350 degrees. Spread hazelnuts on baking sheet and toast about 10 minutes, until lightly browned. If hazelnuts are not blanched, toast them until the skins begin to crack, then remove them from oven and wrap them in clean linen or cotton towel (not terrycloth). Rub hot nuts to remove most of the skin. Set toasted nuts aside.", 
            "2. Sift the flour, cocoa, espresso powder, salt, baking soda and baking powder together and set aside.", 
            "3. Beat eggs lightly, just until blended, in mixing bowl with whisk or in electric mixer. Remove two tablespoons of egg mixture to small dish and set aside. Beat sugar into remaining eggs until blended. Stir in flour mixture to form soft dough.", 
            "4. Divide the dough in half and place one portion on a well-floured work surface. (She is not kidding about this.) With floured hands, pat it into a six-inch square. Scatter half the hazelnuts on the dough and press them into the surface. Roll the dough into a cylinder about 2 inches in diameter and 12 to 15 inches long. Line the baking sheet with parchment paper and place the roll of dough on the baking sheet. Repeat with the remaining dough. Brush the tops of both rolls with the reserved egg.", 
            "5. Place in the oven and bake about 15 minutes, until firm to the touch. (This took me until 20 to 25 minutes.) Transfer to a cutting board and cut on an angle into slices one-half-inch thick. (I found that letting them cool for five minutes made this easier, as well as a sharp knife with a tight serrate.) Return the slices to the baking sheet, laying them on their cut sides, and return them to the oven. Bake another 20 minutes, until they are crisp and dry. Allow to cool completely before storing or serving."
        ], 
        "date": "2008-07-24T12:38:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (140 grams) toasted hazelnuts (see directions below)", 
            "2 cups (250 grams) all-purpose flour", 
            "3/4 teaspoon baking powder", 
            "1/2 teaspoon table salt", 
            "2 sticks (1 cup or 225 grams) unsalted butter, at room temperature", 
            "3/4 cup (145 grams) packed light or dark brown sugar", 
            "1/2 cup (100 grams) granulated sugar", 
            "2 large egg yolks, at room temperature", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1/2 cup (150 grams) chocolate-hazelnut spread, such as Nutella"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/12344452563_694b210772_k.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/02/chocolate-hazelnut-linzer-hearts/", 
        "title": "chocolate hazelnut linzer hearts", 
        "directions": [
            "Place the nuts, flour, baking powder and salt in the bowl of a food processor fitted with the blade attachment and pulse until the nuts are finely ground, as powdery as you can get them without letting them turn to a paste. (You can tell when it’s beginning to turn to a paste and you should immediately stop when a ring of moist crumbs adheres to base edges of the bowl and doesn’t get picked up when you run the machine.) ", 
            "Place butter and both sugars in a large bowl and use an electric mixer to beat it until light and creamy, about 2 to 3 minutes. Scrape down the sides of the bowl, add yolks and vanilla, then beat until incorporated, about another 30 seconds. Sprinkle ground hazelnuts and other dry ingredients over butter mixture and mix until just incorporated. Divide dough in half and wrap each in plastic wrap. Chill dough packets in the fridge for at least 1 hour and up to 2 days.", 
            "Heat oven to 350°F. Line two baking sheets with parchment paper or silicone baking mats. Roll out the first dough packet until between 1/8 and 1/4-inch thick. Use a 2-inch cutter of your choice to cut out rounds of dough. Use a smaller cookie cutter (a 3/4-inch is ideal) to remove the centers of half of the cookies, creating ring shapes that will later form the lids. If the dough becomes too soft as you’re using it, just slip it into the freezer for a few minutes so that it firms up again.", 
            "Bake cookies until golden at edges, rotating trays as needed, about 8 to 9 minutes. Cool on baking sheets for 5 minutes before transferring to a wire rack to finish cooling. Repeat with remaining dough; you can re-chill and re-roll cookie scraps.", 
            "If powdering the linzer lids, arrange the ring-shaped cookies (the ones you removed the centers of) on a baking rack with a tray or paper underneath to catch the mess. Sprinkle with powdered sugar. ", 
            "Spread each of the cookie bases with about 1 teaspoon chocolate-hazelnut spread. Fit a ring-shaped lid on each. Cookies will keep at room temperature in an airtight container for several days, or so I’ve heard.", 
            "To toast your hazelnuts: Hazelnuts can be toasted on a baking sheet in the oven at 350°F for 10 minutes, but don’t take them out just yet. I like to toast them until they’re all the color of milky coffee under their loose skins, and roll them around on the tray every few minutes to make sure they’re toasting evenly. This can take an extra 1, 2, or even 5 minutes, and you should check on them frequently, so don’t go far from the oven after the 10 minute mark. Well-toasted hazelnuts don’t just taste better, with a deeper nutty flavor, but their skins come off more easily. (I even toast already-toasted hazelnuts from Trader Joe’s, as they’re never as golden as I want them.) There are two methods to skin hazelnuts, everyone else’s (rub them with a towel while they’re warm, getting off all the skins that you can) and mine (let them cool until you can hold them, and roll them around, a fistful at a time, in your dry hands, letting the skins fall back on the baking sheet; I do it this way because the towel method always leaves me with hazelnut flakes all over my kitchen when I go to shake it out/bring it to the hamper). Both work. "
        ], 
        "date": "2014-02-06T11:53:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 teaspoon good-quality instant espresso powder", 
            "3 tablespoons boiling water", 
            "1/2 cup (1 stick) unsalted butter, softened", 
            "1/2 cup granulated sugar", 
            "1 teaspoon pure vanilla extract", 
            "1/2 teaspoon coarse salt", 
            "1 large egg", 
            "1/2 cup unsweetened Dutch-process cocoa powder", 
            "1 3/4 cups all-purpose flour", 
            "1 large egg yolk", 
            "Sanding sugar, for sprinkling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chocolate-pretzel-cookies1.jpg?w=500", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/chocolate-pretzel-cookies/", 
        "title": "chocolate pretzel cookies", 
        "directions": [
            "1.\tStir espresso powder into the boiling water in a small bowl until dissolved; set aside. Meanwhile, put butter and granulated sugar in the bowl of an electric mixer fitted with the paddle attachment; mix on medium speed until creamy. Mix in vanilla and salt. Reduce speed to medium-low. Mix in egg, cocoa and dissolved espresso. Gradually add flour, and mix until a smooth dough forms. Turn out onto a piece of plastic; pat into a square. Wrap dough, and refrigerate until cold, about 30 minutes. ", 
            "2.\tDivide dough into 24 equal pieces. Roll into balls. Shape balls into 12-inch-long ropes. Twist each rope into a pretzel shape. Space 1 inch apart on baking sheets lined with parchment paper. ", 
            "3.\tPreheat oven to 325 degrees. Whisk egg yolk with 1 teaspoon water in a small bowl. Brush cookies with egg wash; sprinkle with sanding sugar. Bake cookies, rotating sheets halfway through, until dry, about 15 minutes. Let cool on sheets on wire racks. Cookies can be stored in airtight containers at room temperature up to 1 week. "
        ], 
        "date": "2007-12-08T11:52:18+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup all purpose flour", 
            "1 teaspoon baking powder", 
            "1/2 teaspoon salt", 
            "1 pound bittersweet (not unsweetened) or semisweet chocolate, chopped", 
            "1/4 cup (1/2 stick) unsalted butter", 
            "1 3/4 cups (packed) brown sugar", 
            "4 large eggs", 
            "1 tablespoon vanilla extract", 
            "5 1.4-ounce chocolate-covered English toffee bars (such as Heath), coarsely chopped*", 
            "1 cup walnuts, toasted, chopped", 
            "Flaky sea salt for sprinkling (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/chocolate-toffee-cookies1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/11/chocolate-toffee-cookies/", 
        "title": "chocolate toffee cookies", 
        "directions": [
            "Combine flour, baking powder and salt in small bowl; whisk to blend. Stir chocolate and butter in top of double boiler set over simmering water until melted and smooth. Remove from over water. Cool mixture to lukewarm.", 
            "Using electric mixer, beat sugar and eggs in bowl until thick, about 5 minutes. Beat in chocolate mixture and vanilla.", 
            "Stir in flour mixture, then toffee and nuts. Chill batter until firm, about 45 minutes.", 
            "Preheat oven to 350°F. Line 2 large baking sheets with parchment or waxed paper. Drop batter by spoonfuls onto sheets, spacing two inches apart. Sprinkle with a pinch of flaky sea salt, if you’re using it. Bake just until tops are dry and cracked but cookies are still soft to touch, about 12 to 15 minutes. Cool on sheets. (Can be made 2 days ahead. Store airtight at room temperature.)", 
            "I know that it will be impossible to let them cool completely, but they really taste a lot better cool, as they continue baking once they come out of the oven.", 
            "Slice and bake option: After struggling a bit to scoop these cookies, I rolled the dough into a log 1.5 inches in diameter and chilled it. When I was ready to bake the cookies, I cut it into 1/2-inch slices. You can store the dough log in the freezer, wrapped in waxed paper and then two layers of plastic wrap for up to a month, just baking the cookies off as you need. Cookies baked straight from the freezer may need an additional minute or two in the oven, depending on their thickness. ", 
            "* As it turns out, in NYC at least, drug stores such as Duane Reade and Rite Aid are a great–and cheap!–place to find these. We went there after failing to find them in three bodegas."
        ], 
        "date": "2008-11-13T23:26:06+00:00"
    }, 
    {
        "ingredient_list": [
            "3 large egg whites", 
            "3/4 cup (90 grams) confectioners sugar", 
            "1/2 cup (65 grams) all-purpose flour", 
            "1/3 cup (5 1/3 tablespoons or 75 grams) unsalted butter, melted", 
            "1/4 teaspoon table salt", 
            "Seeds from a 2-inch segment of vanilla bean, or 1/2 teaspoon vanilla extract or paste", 
            "4 ounces (115 grams) bittersweet chocolate, finely chopped", 
            "Sprinkles or other decorations (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cigarettes-russes-cookies1.jpg?w=640", 
        "tags": [
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/12/cigarettes-russes-cookies/", 
        "title": "cigarettes russes cookies", 
        "directions": [
            "Heat oven to 350°F. Line two baking sheets with parchment paper or silicone baking mats. Grab a bunch of pencils or chopsticks.", 
            "In a medium bowl, combine all ingredients with a whisk. Working in small batches to begin (I’d just make 2 on the first tray, so you can get the hang of it; add more to ensuing batches as you do), drop 1 level teaspoon of batter for each cookie at least 3 inches apart on your prepared sheet. Using a small offset spatula or spoon, spread each into a thin 3-inch/7.5-cm circle (circles don’t need to be perfect, nobody will care). ", 
            "Bake cookie sheets, one at a time, until edges are golden, about 6 to 8 minutes, but you should closely watch your first batch in case your oven bakes things more quickly and adjust the baking time for remaining batches if necessary. Slide a small offset spatula under the first cookie and quickly roll the loosened cookie around a pencil, chopstick or other thin rod into a tight cylinder. Transfer cookie-wrapped pencil to cooling rack. Repeat with remaining cookies and additional pencils. If they start cracking at the edges or become too brittle because they’ve cooled too much (this will probably happen after every two to three cookies), return the cookie sheet to the oven for 20 to 30 seconds to soften them again. Do this as many times as needed. Cookies can be slid off their pencils almost immediately, but it’s even easier if you give them a full minute or more to cool. Leave cookies to fully cool on rack; repeat process with remaining batter.", 
            "Melt chocolate in a small saucepan or microwave until half-melted. Stir until remaining chunks melt. When cookies are cool, working with 1 cookie at a time, dip 1/4 inch of tip of one or both ends into melted chocolate, letting excess drip off, then rolling them in sprinkles (if desired) and place on a parchment- or wax-paper-lined baking sheet. Let stand at room temperature until chocolate sets.", 
            "Do ahead: Cookies can be made 2 days ahead and kept in an airtight container. They will keep even longer in the freezer with layers of waxed paper between them.", 
            "More tips: "
        ], 
        "date": "2013-12-09T12:00:50+00:00"
    }, 
    {
        "ingredient_list": [
            "Cookies", 
            "2 2/3 cups (335 grams) all-purpose flour", 
            "2/3 cup plus 1/4 cup (75 grams) extra dark or Dutch-processed unsweetened cocoa powder", 
            "1 1/4 cups (2 1/2 sticks or 285 grams) unsalted butter, softened", 
            "1 cup (200 grams) granulated sugar", 
            "3/4 teaspoon table salt", 
            "2 large egg yolks", 
            "1 tablespoon vanilla extract", 
            "Filling", 
            "1/2 gallon (8 cups or approximately 1050 grams, weight will vary by brand/variety) ice cream, your choice of flavor (I used cookies and cream), softened"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/04/6961536206_e3a4dbebf7_k.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Ice Cream/Sorbet", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/04/classic-ice-cream-sandwiches/", 
        "title": "classic ice cream sandwiches", 
        "directions": [
            "Preheat oven to 350°F degrees. Line two baking sheets with parchment paper. Sift the flour and cocoa together (I am generally too lazy to sift things but cocoa is really lumpy so don’t skip this) and set aside. In the bowl of a standing mixer with a paddle attachment, beat the butter, sugar, and salt together until light and fluffy. Add the yolks and vanilla and mix until combined, then scrape down sides and mix briefly again. Add the flour mixture a little at a time then mix until combined.", 
            "Transfer the dough to a lightly floured work surface and divide into two equal pieces. If the dough is too soft to handle, wrap and chill it until firm enough to roll out (I recommend 30 minutes only; any longer and it becomes crumbly to roll out). Roll each batch into a 1/4-inch thick rectangle, about 10 by 8 inches. Cut into a total of 24 20 2-by-4-inch rectangles. You may have enough extra to reroll the scraps and create 4 more 2-by-4-inch rectangles, in which case, you could make two additional sandwiches.", 
            "Use an offset spatula to transfer the rectangles to the prepared sheets; you’ll only need an inch space between them. Use the tip of a thermometer (totally brilliant tip from Amy, by the way; it made far better indentations than skewers that I usually use for docking) to poke the cookies with holes (Amy recommends 14 holes but I used this as my guide and made more).", 
            "Bake the cookies for 16 to 18 minutes, or until they stay firm when tapped in the center. Transfer to a wire rack to cool completely. Repeat with remaining cookie dough, rerolling scraps as needed.", 
            "Meanwhile, line the bottom of a 9-by-13-inch pan with parchment paper, allowing it to overhang on two sides (it will act as a sling for the ice cream). Spread the softened ice cream into the pan, smooth the top and freeze until firm, about one hour (or longer if your freezer is as terrible as mine).", 
            "Run a knife along the exposed sides of the pan to loosen the ice cream. Holding onto the parchment paper, lift ice cream out of the pan and onto the work surface. Using one of the cookies as a template, cut ice cream into 10 to 12 2-by-4-inch bars (cut the number of cookie pairs your batch yielded). Strangely, I found using kitchen shears to go right through the ice cream and the paper underneath the easiest. I then flipped each piece of ice cream onto a cookie, peeled off the paper, and finished sandwiching the rectangle of ice cream with a second cookie.", 
            "(Look, I’d be lying if I didn’t tell you that this whole ice cream part caused a spectacular mess in my kitchen. Huge! It was an ice cream massacre! But, I was rushing and you should not. If your ice cream begins to soften, just slide it back into the freezer for a bit and it will become easy to work with again. Promise. Do as I say, not as I did, unless you like sticky floors.)", 
            "Wrap each ice cream sandwich in plastic and please, again, listen to Amy here. I was all “Oh, let me just get them cold again and I’ll wrap them later.” Which was wrong. They continue to lose their shape for a bit, runny and melting, before they freeze up and that is why my sandwiches were kind of a mess. “Sealing” them into their shape immediately with plastic is, well, the reason that Amy is a sweets stylist and my food looks, uh, “handmade.”", 
            "Freeze until just before serving. "
        ], 
        "date": "2012-04-25T08:23:29+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (2 sticks or 225 grams) unsalted butter", 
            "2 tablespoons water", 
            "1/2 cup plus 2 tablespoons (125 grams) granulated sugar", 
            "3/4 cup (145 grams) packed light-brown sugar", 
            "1 large egg", 
            "1/2 teaspoon pure vanilla extract", 
            "1 1/4 cup plus 3 tablespoons (175 grams) all-purpose flour", 
            "1 teaspoon baking soda", 
            "Slightly heaped 1/2 teaspoon flaky sea salt or 1/4 teaspoon table salt", 
            "4 cups (240 grams) dried, unsweetened coconut chips (I used these)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/coconut-brown-butter-cookies1.jpg?w=640", 
        "tags": [
            "Brown Butter", 
            "Coconut", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/06/coconut-brown-butter-cookies/", 
        "title": "coconut brown butter cookies", 
        "directions": [
            "In a medium saucepan, melt butter over medium heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as it seems to take forever (more than 5 minutes) but then turns dark very quickly. Once it is a deeply fragrant, almost nut-brown color, remove from heat and pour butter and all browned bits at the bottom into a measuring cup. Adding 2 tablespoons water should bring the butter amount back up to 1 cup. Chill browned butter in the fridge until it solidifies, about 1 to 2 hours. You can hurry this along in the freezer, but check back and stir often so it doesn’t freeze unevenly solid.", 
            "Heat oven to 350 degrees. Line baking sheets with parchment paper or a nonstick baking mat.", 
            "Scrape chilled browned butter and any bits into a large mixing bowl. Add both sugars and beat the mixture together until fluffy. Add egg and beat until combined, scraping down bowl as needed, then vanilla. Whisk flour, baking soda and salt together in a separate bowl. Pour half of flour mixture into butter mixture and mix until combined, then add remaining flour and mix again, scraping down bowl if needed. Add coconut chips in two parts as well.", 
            "Scoop dough into 1, 2 or more (Rubin recommends a 2-inch wide scoop for bakery-sized cookies) balls and arrange a few with a lot of room for spreading on first baking sheet; use the back of a spoon or your fingers to flatten the dough slightly. Bake first tray of cookies; 1 tablespoon scoops will take 10 to 11 minutes; 2 tablespoon scoops, 12 to 14 minutes, the 2-inch scoop used at the bakery, 14 to 16 minutes; take the cookies out when they’re deeply golden all over. If cookies have not spread as much as you see above, stir 2 teaspoons more water into cookie dough, mixing thoroughly, before baking off another tray. (See note below for full explanation.) This should do the trick, but if it does not, repeat the same with your next batch. Once you’ve confirmed that you have the water level correct, bake remaining cookies.", 
            "Cool cookies on baking sheet for 1 to 2 minutes before transferring to a cooling rack. Cookies keep for up to one week at room temperature. Extra dough can be stored in the fridge for several days or in the freezer for a month or more.", 
            "About the water: Browned butter is one of my favorite things to eat in cookies like things and least favorite things to write cookie recipes for, because when you brown the butter, water volume is lost, but not all types of butter contain the same amount of water. I find that for most standard American grocery store butters (I was using Trader Joe’s store brand here, but the equivalent would be any non-European style butter), 1 tablespoon of water per stick (1/2 cup) of butter is a sufficient replacement. However, should you find that your first batch of cookies is too thick, a little extra water is all you’ll need to get the texture right. It sounds scary, but I promise is as simple as can be. Holler at me in the comments if this doesn’t work for you and please note the kind of butter and how much water you used. "
        ], 
        "date": "2014-06-05T12:17:43+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups (375 grams) all-purpose flour", 
            "1 teaspoon baking powder", 
            "1/4 teaspoon baking soda", 
            "3/4 teaspoon fine sea or table salt", 
            "1 cup (8 ounces, 225 grams or 2 sticks) unsalted butter", 
            "1/4 cup (2 ounces, 55 grams or 1/4 of an 8-ounce brick) cream cheese", 
            "1 1/4 cups (250 grams) granulated sugar", 
            "1 large egg", 
            "2 teaspoons vanilla extract or 1/2 a vanilla bean, split and scraped (see Note up top)", 
            "1/4 teaspoon almond extract (optional)", 
            "1 cup rainbow sprinkles"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/confetti-cookies1.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/05/confetti-cookies/", 
        "title": "confetti cookies", 
        "directions": [
            "To make in a food processor: Place flour, baking powder, baking soda and salt in the work bowl and pulse a few times to blend. Add butter and cream cheese in large chunks, plus sugar and blend until mixture is powdery. Add egg, vanilla and almond extracts and run machine until the dough balls together. You’ll probably need to scrape it down once or twice to get the mixture even.\nTo make with an electric mixer: Combine flour, baking powder, baking soda and salt in a bowl and whisk to blend. In a large bowl or the bowl of a stand mixer, beat cream cheese, butter and sugar until fluffy. Add egg and extracts and blend again. Add flour mixture and beat just until flour disappears. In some cases, this dough will feel too soft to roll into balls in your hands; if so, let it chill in the fridge for 20 minutes or so before using.\nBoth methods: Scoop balls of dough — I like these cookies best with a #40, or 1 1/2 tablespoon, scoop; the texture is less dynamic when made smaller — and roll them briefly in the palms of your hands before dropping them in a bowl of rainbow sprinkles and gently rolling to coat them evenly. I find that the sprinkles adhere much better to tacky exterior of balls of dough that have been briefly warmed by your hands — trust me here.", 
            "Transfer balls of sprinkle-coated dough to baking sheets at least two inches apart. Use the bottom of a drinking glass to press down on the cookies until they are about 1/4 to 1/2-inch tall. If you see any bare spots in the sprinkles that bother you, you can sprinkle a few more on top. Bake for 9 to 10 minutes until they look underbaked but lightly golden underneath. [If they’re not quite soft in the center, they will be fully crisped through the next day.] Let set on the baking sheet on a rack for a few minutes before transferring to cooling racks to cool the rest of the way. Repeat with remaining cookie dough."
        ], 
        "date": "2016-05-12T12:10:09+00:00"
    }, 
    {
        "ingredient_list": [
            "2 sticks (1 cup, 8 ounces or 227 grams) unsalted butter, softened", 
            "7.5 ounces farmer cheese (a lowfat cottage/ricotta-style cheese; I buy mine from Friendship)*", 
            "2 tablespoons (1 ounce or 30 grams) sour cream", 
            "1/4 teaspoon vanilla", 
            "2 cups (8 3/4 ounces or 250 grams) all-purpose flour, plus additional for rolling cookies out", 
            "1/4 teaspoon salt", 
            "Jam or preserves (I used raspberry)", 
            "Milk, for brushing cookies", 
            "Powdered sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/crescent-jam-and-cheese-cookies1.jpg?w=640", 
        "tags": [
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/12/crescent-jam-and-cheese-cookies/", 
        "title": "crescent jam and cheese cookies", 
        "directions": [], 
        "date": "2010-12-28T21:47:36+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups (260 grams) all-purpose flour", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "3/4 cup (170 grams) unsalted butter, melted", 
            "1 cup (190 grams) packed brown sugar", 
            "1/2 cup (100 grams) granulated sugar", 
            "1 tablespoon (15 ml) vanilla extract (yes, this is correct, but feel free to use less if it seems too much)", 
            "1 large egg", 
            "1 large egg yolk", 
            "2 cups (about 12 ounces) semisweet chocolate chips"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/crispy-chewy-chocolate-chip-cookies1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/03/crispy-chewy-chocolate-chip-cookies/", 
        "title": "crispy chewy chocolate chip cookies", 
        "directions": [
            "Preheat the oven to 325°F (165°C). Grease cookie sheets or line with parchment paper.\nSift together the flour, baking soda and salt; set aside. In a medium bowl, cream together the melted butter, brown sugar and white sugar until well blended.\nBeat in the vanilla, egg, and egg yolk until light and creamy. Mix in the sifted ingredients until just blended.\nStir in the chocolate chips by hand using a wooden spoon. Drop cookie dough 1/4 cup at a time (for giant cookies) or a tablespoon at a time (for smaller cookies) onto the prepared cookie sheets. Cookies should be about 3 inches apart.\nBake larger cookies for 15 to 17 minutes, or 10 to 12 minutes for smaller ones (check your cookies before they’re done; depending on your scoop size, your baking time will vary) in the preheated oven, or until the edges are lightly toasted. Cool on baking sheets for a few minutes before transferring to wire racks to cool completely."
        ], 
        "date": "2009-03-03T09:00:26+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour", 
            "3/4 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1/4 teaspoon table salt", 
            "14 tablespoons (1 3/4 sticks) unsalted butter, slightly softened", 
            "1 cup sugar", 
            "1/4 cup packed light brown sugar", 
            "1 large egg", 
            "1 teaspoon vanilla extract", 
            "2 1/2 cups old-fashioned rolled oats"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/crispy-salted-oatmeal-white-chocolate-cookies1.jpg?w=500", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/05/crispy-salted-oatmeal-white-chocolate-cookies/", 
        "title": "crisp salted oatmeal white chocolate cookies", 
        "directions": [
            "6 ounces good-quality white chocolate bar, chopped (not “white chocolate” chips; they’re almost always artificial. I am adamant about this.)", 
            "1/2 teapoon flaky sea salt (like Maldon or fleur de sel) (for sprinkling on top)", 
            "1. Preheat oven to 350 degrees. Line baking sheet with parchment paper or Silpat. Whisk flour, baking powder, baking soda, and table salt in a medium bowl.", 
            "2. Beat butter and sugars until light and fluffy. Scrape down bowl with rubber spatula, then add egg and vanilla and beat until incorporated. Scrape down bowl again. Add flour mixture gradually and mix until just incorporated and smooth. Gradually add oats and white chocolate and mix until well incorporated.", 
            "3. Divide dough into 24 equal portions, each about 2 tablespoons. Roll between palms into balls, then place on lined baking sheets about 2 1/2 inches apart. Using fingertips, gently press down each ball to about 3/4-inch thickness.", 
            "4. Sprinkle a flake or two of sea salt on each cookie", 
            "5. Bake until cookies are deep golden brown, about 13 to 16 minutes, rotating baking sheet halfway through. Transfer baking sheet to wire rack to cool."
        ], 
        "date": "2008-05-09T11:15:21+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces (115 grams or about 1/3 cup) unsweetened chocolate (sometimes sold as 99%), chopped small", 
            "14 ounces (400 grams) sweetened, flaked coconut", 
            "2/3 cup (130 grams) granulated sugar", 
            "6 tablespoons (30 grams) cocoa powder", 
            "3 large egg whites", 
            "Heaped 1/4 teaspoon flaked sea salt or level 1/4 teaspoon table salt", 
            "1/2 teaspoon vanilla extract "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/dark-chocolate-macaroons.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Coconut", 
            "Cookie", 
            "Gluten-Free", 
            "Passover", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/04/dark-chocolate-coconut-macaroons/", 
        "title": "dark chocolate coconut macaroons", 
        "directions": [
            "Heat oven to 325°F. Line two large baking sheets with parchment paper.", 
            "Heat approximately half of chocolate chunks in a small saucepan until just melted, then, off the heat, stir in the remaining chunks until they’re smooth. The residual heat should be enough to melt them and leave the mixture lukewarm; if it’s not, heat the mixture again until just melted, but not very hot.", 
            "In a food processor, blend the coconut for one full minute. Add sugar and cocoa powder, blend another full minute. Add egg whites, salt and vanilla and blend until combined, then the melted chocolate until smooth. With a tablespoon measure or cookie scoop (I used a #70 scoop), scoop batter into 1-inch mounds. You can arrange the cookies fairly close together as they don’t spread, just puff a bit. ", 
            "Bake cookies for 15 minutes, until the macaroons are shiny and just set. Let them rest on the tray for 10 minutes after baking (or you can let them fully cool in place, if you’re not in a rush to use the tray again), as they’ll be hard to move right out of the oven. They’ll firm up as they cool, but still remain softer and less dry inside than traditional macaroons. Thank goodness. ", 
            "I like to dust them with a little powdered sugar once they’re cool. They’ll keep in an airtight container until your family finds out about them, or one week, whichever happens first."
        ], 
        "date": "2014-04-11T11:56:00+00:00"
    }, 
    {
        "ingredient_list": [
            "Pecan florentines", 
            "1/4 cup plus 2 tablespoons (6 tablespoons or 45 grams) all-purpose flour", 
            "1/2 cup (about 55 grams) pecan halves", 
            "1/4 teaspoon ground cinnamon (I halved this, found it to be just-enough)", 
            "1/8 teaspoon kosher salt (I recommend doubling this)", 
            "1/2 cup (115 grams) unsalted butter, cold is fine", 
            "2/3 cup (65, oops, sorry, it is 130 grams) granulated sugar (I would drop this by a tablespoon or two next time)", 
            "2 tablespoons heavy cream", 
            "1 tablespoon corn syrup, honey, or golden syrup", 
            "1/4 teaspoon vanilla extract", 
            "Eggnog filling", 
            "4 large eggs, hard-boiled", 
            "4 tablespoons (55 grams) unsalted butter, at room temperature", 
            "2 1/2 cups (300 grams) confectioners’ sugar", 
            "1 tablespoon whole milk", 
            "1/2 teaspoon vanilla extract", 
            "3/4 teaspoon freshly grated nutmeg (I halved this because I’m a spice wimp)", 
            "1/4 teaspoon ground cloves (I halved this too)", 
            "1/8 teaspoon kosher salt", 
            "2 tablespoons dark rum (can be skipped or reduced)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/eggnog-florentines1.jpg?w=640", 
        "tags": [
            "Christmas", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/12/eggnog-florentines/", 
        "title": "eggnog florentines", 
        "directions": [
            "Make the florentines: Heat oven to 350°F. In a food processor, combine the flour, pecans, cinnamon and salt and pulse until the nuts are very finely chopped, about 1 minute. Turn the nut mixture out into a large bowl. ", 
            "In a small-medium saucepan set over high heat, combine the butter, sugar, heavy cream and syrup and bring it to a boil. Boil the mixture for one full minute, then turn off the heat and add the vanilla. Pour this caramel mixture over the nut mixture and stir to combine them. Set aside for at least 30 minutes, until it has cooled. Mixture will firm up and seem worrisome, but you should not be worried.", 
            "Line baking sheets with parchment paper. Using a 1/2 or 1 teaspoon measure (the original recipe recommends a 1/2 teaspoon measure to scoop the cookies but I misread this and used a full teaspoon scoop — mine became 2 1/2 inches in diameter on average, which felt like a good size), scoop the dough into small balls and place them 3 inches apart on prepared baking sheets. Bake until the cookies are thin and golden brown, 7 to 9 minutes. They will not crisp until they are cool, so don’t worry if they’re soft.", 
            "Let cool on baking sheets for 5 or so minutes (so they’ll set up a little) before using a thin metal spatula to carefully transfer the cookies to paper towels to blot excess oil for a couple minutes. After they’ve been blotted, transfer cookies to a cooling rack, though they should be pretty cool by now. If any butter is left puddled on the parchment, wipe that off too before repeating the process with the remaining cookie dough.", 
            "Make the eggnog filling: Peel the eggs and separate the yolks from the whites. Save the whites for another use. Press the egg yolks through a fine-mesh strainer so that they become mashed and powdery. Place in a large bowl with butter, confectioners’ sugar, milk, vanilla, nutmeg, cloves and salt. Beat together until smooth, then raise mixer speed and beat until mixture is thick and frosting-like, about three minutes. Stir in the rum by hand, if using.", 
            "Spread a dollop of eggnog filling on one cookie, then gently press a second one on top of it. Repeat with remaining cookies and filling. Place them in the fridge for 10 minutes before serving, to firm up the filling.", 
            "Do ahead: The dough and the icing can be refrigerated in an airtight container or up to 3 days before baking. The baked, unfilled florentines can be stored in a loosely covered container at room temperature for up to two (though I had them longer) before filling them. Humidity is their enemy, makes them stick together. The original recipe says that once filled, the florentines need to be eaten immediately but our held up crisp in the fridge in a loosely covered container (not airtight) for a couple days. "
        ], 
        "date": "2013-12-11T12:30:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon (about 4 grams) instant espresso powder", 
            "1 tablespoon (15 ml) boiling water", 
            "2 sticks (8 ounces or 225 grams) unsalted butter, at room temperature", 
            "2/3 cup (80 grams) confectioners’ sugar", 
            "1/2 teaspoon pure vanilla extract", 
            "1/4 teaspoon coarse, sea or kosher salt", 
            "2 cups (250 grams) all-purpose flour", 
            "4 ounces (115 grams) bittersweet chocolate (plain, or a toffee variety), finely chopped, or 3/4 cup store-bought mini chocolate chips", 
            "Confectioners’ sugar, for dusting (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/12/espresso-chocolate-shortbread-cookies.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/espresso-chocolate-shortbread-cookies/", 
        "title": "espresso-chocolate shortbread cookies", 
        "directions": [
            "1. Dissolve the espresso in the boiling water, and set aside to cool to tepid. ", 
            "2. Working with a stand mixer, preferably fitted with a paddle attachment, or with a hand mixer in a large bowl, beat the butter and confectioners’ sugar together on medium speed for about 3 minutes, until the mixture is very smooth. Beat in the vanilla, espresso and salt, then reduce the mixer speed to low and add the flour, mixing only until it disappears into the dough. Don’t work the dough much once the flour is incorporated. Fold in the chopped chocolate with a sturdy rubber spatula. ", 
            "3. Using the spatula, transfer the soft, sticky dough to a gallon-size zipper-lock plastic bag. Put the bag on a flat surface, leaving the top open, and roll the dough into a 9 x 10 1/2 inch rectangle that’s 1/4 inch thick. As you roll, turn the bag occasionally and lift the plastic from the dough so it doesn’t cause creases. When you get the right size and thickness, seal the bag, pressing out as much air as possible, and refrigerate the dough for at least 2 hours, or for up to 2 days. ", 
            "4. Position the racks to divide the oven into thirds and preheat the oven to 325 degrees F. Line two baking sheets with parchment or silicone mats.", 
            "5. Put the plastic bag on a cutting board and slit it open. Turn the firm dough out onto the board (discard the bag) and, using a ruler as a guide and a sharp knife, cut the dough into 1 1/2-inch squares. Transfer the squares to the baking sheets and carefully prick each one twice with a fork, gently pushing the tines through the cookies until they hit the sheet. ", 
            "6. Bake for 18 to 20 minutes, rotating the sheets from top to bottom and front to back at the midway point. The shortbreads will be very pale–they shouldn’t take on much color. Transfer the cookies to a rack. ", 
            "7. If you’d like, dust the cookies with confectioners’ sugar while they are still hot. Cool the cookies to room temperature before serving."
        ], 
        "date": "2007-12-15T09:00:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup walnut pieces", 
            "1 cup dried Turkish or Calimyrna figs, quartered", 
            "3/4 stick (6 tablespoons or 3 ounces) unsalted butter, softened", 
            "1/4  cup granulated sugar, plus more for sprinkling", 
            "6 tablespoons dark brown sugar, packed", 
            "2 eggs", 
            "1 teaspoon pure vanilla extract", 
            "Grated zest of 1/2 a large orange (I used a clementine)", 
            "1 3/4 cup plus 2 tablespoons (or 2 cups minus 2 tablespoons)  unbleached, all-purpose flour", 
            "1 teaspoon baking powder", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon kosher salt", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon. ground nutmeg", 
            "1/8 teaspoon ground cloves", 
            "1 egg white, lightly beaten"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/fig-and-walnut-biscotti.jpg?w=753", 
        "tags": [
            "Cookie", 
            "Figs", 
            "Italian", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/01/fig-and-walnut-biscotti/", 
        "title": "fig and walnut biscotti", 
        "directions": [
            "1. Preheat the oven to 325 degrees.  Spread the walnuts on a baking sheet and toast for 5 to 7 minutes, or until golden brown and fragrant. Allow the walnuts to cool completely", 
            "2. Place the walnuts and dried figs in a food processor and process until they are finely chopped.", 
            "3. In the bowl of an electric mixer, cream together the butter and sugars until light and fluffy. Add the eggs, one at a time, and beat until incorporated, scraping down the sides of the bowl with a spatula occasionally. Beat in the vanilla and the orange zest.", 
            "4. In a medium bowl, stir together the flour, baking powder, baking soda, salt and spices. Beat the dry ingredients into the butter mixture to form a somewhat firm dough. Add the walnuts and figs and beat until thoroughly combined. Wrap the dough tightly in plastic and chill 35 to 40 minutes or until completely firm.", 
            "5. When the dough has chilled, lightly grease a baking sheet. On a floured board, use your palms to roll the piece of dough into a log the length of the baking sheet. Place the log on the baking sheet.", 
            "6. In a small bowl, beat the egg white with a fork until frothy. With a pastry brush, glaze the log with some egg white and sprinkle it with granulated sugar. Bake for 15 to 20 minutes (this took longer in my oven, but everything seems to these days), or until the log is lightly golden brown, firm to the touch and just beginning to crack slightly.", 
            "7. Allow the log to cool on the cookie sheet until cool to the touch, about 40 minutes.  With a serrated knife, slice the biscotti, slightly on the bias, into 1/2-inch slices. Lay the slices on the cookie sheet in single layer (I always end up needing a second baking sheet in this step, as they have a lot more surface area); Return the biscotti to the oven and cook for 20 more minutes, or until the biscotti are toasted and crisp. ", 
            "Store the biscotti in an airtight container. They will keep up to about 2 weeks."
        ], 
        "date": "2009-01-05T16:49:24+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/five-details-three-corners1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/03/five-details-three-corners/", 
        "title": "hamataschen + five details", 
        "directions": [], 
        "date": "2007-03-01T15:30:45+00:00"
    }, 
    {
        "ingredient_list": [
            "Cookie", 
            "2 cups plus 2 tablespoons (265 grams) all-purpose flour, plus extra for flouring hands", 
            "2 teaspoons (10 grams) baking powder", 
            "2 teaspoons (4 grams) ground cinnamon", 
            "2 teaspoons (4 grams) ground ginger", 
            "1/8 teaspoon ground cloves", 
            "A few grinds of black pepper", 
            "1/2 teaspoon coarse sea salt", 
            "1/2 cup (95 grams) dark brown sugar", 
            "1/2 cup (100 grams) granulated sugar", 
            "7 tablespoons (100 grams) unsalted butter, melted and cooled", 
            "2 large eggs", 
            "2 teaspoons (10 ml) vanilla extract", 
            "1 1/3 cups toasted, chopped nuts or white or dark chocolate chunks (optional, I kept mine plain)", 
            "1 large egg white", 
            "Cinnamon-sugar (optional)", 
            "1/3 cup (65 grams) granulated sugar", 
            "1 tablespoon (6 grams) ground cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/gingerbread-biscotti1.jpg?w=640", 
        "tags": [
            "Cookie", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/gingerbread-biscotti/", 
        "title": "gingerbread biscotti", 
        "directions": [
            "Do ahead: Baked biscotti should keep in airtight containers at room temperature for weeks.  "
        ], 
        "date": "2014-12-08T12:20:37+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups (281 grams) all-purpose flour", 
            "2 teaspoons (10 grams) baking soda", 
            "1/2 teaspoon (2 to 3 grams) table salt", 
            "3 teaspoons (6 grams) ground ginger", 
            "1 teaspoon (2 grams) cinnamon", 
            "1/2 teaspoon (1 gram) allspice", 
            "1/4 teaspoon ground white pepper", 
            "2 sticks (8 ounces or 227 grams) unsalted butter, at room temperature", 
            "1/2 cup (100 grams) granulated sugar", 
            "1/2 cup (96 grams) light brown sugar", 
            "1 large egg", 
            "1/3 cup (79 ml) unsulphured molasses"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/11/gingersnaps.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Fall", 
            "Photo", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2011/11/gingersnaps/", 
        "title": "gingersnaps", 
        "directions": [
            "Optional, for even more of a ginger kick: Add 1 to 2 teaspoons finely grated fresh ginger (with the wet ingredients) or 1 to 2 tablespoons finely minced candied ginger (with the dry ingredients). ", 
            "In a medium bowl, whisk together the flour, baking soda, salt and spices. In a large bowl, beat butter and sugars together until fluffy, about three minutes on medium. Add egg and molasses and beat until combined. Add dry ingredient and beat at low speed until just combined. Thoroughly scrape down bowl, ensuring ingredients are evenly mixed.", 
            "Transfer your cookie dough to plastic wrap — mine was quite soft and I felt like I was spreading frosting over plastic. I used a plate to support it. Chill in fridge for at least two hours, until firm.", 
            "Preheat oven to 350°F (180°C). Roll dough into 1-inch balls and spread at least two inches apart on baking sheets that have either been greased or lined with parchment paper. Bake for 10 to 15 minutes, which is a long range. In the 10 to 12 range, the cookies will be softer. In the 13 to 15 range, a bit snappier. In both cases, you’ll want to leave them on their baking sheets for long enough that they’re firm enough to be transferred to a cooling rack with a spatula, anywhere from 2 to 5 minutes. Cool cookies completely before packing up.", 
            "Do ahead: In an airtight container at room temperature, the cookies will soften a bit each day. Cookies keep for one week at room temperature or one month in the freezer. For even fresher cookies, you can keep balls of the unbaked dough in the freezer for up to two weeks and bake them as you need them, say, on Thanksgiving morning? "
        ], 
        "date": "2011-11-18T15:48:56+00:00"
    }, 
    {
        "ingredient_list": [
            "6 tablespoons unsalted butter", 
            "1 cup almond flour*", 
            "4 tablespoons Dutch-process unsweetened cocoa powder", 
            "1/8 teaspoon salt", 
            "3/4 cup powdered sugar", 
            "1/3 cup egg whites (approx. two large)", 
            "1/4 teaspoon almond extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/10/chocolate-financiers.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Gluten-Free", 
            "Passover", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/10/gluten-free-chocolate-financiers/", 
        "title": "gluten-free chocolate financiers", 
        "directions": [
            "Preheat the oven to 400°F. Lightly grease and flour financier molds or mini-muffin tins.  Melt the butter in a small saucepan and set it aside until it reaches room temperature. ", 
            "Mix the almond flour with the cocoa powder, salt, and powdered sugar. Stir the egg whites and almond extract into the almond mixture, then gradually stir in the melted butter until incorporated and smooth.  Spoon the batter into the molds, filling them three-quarters full. ", 
            "Bake the financiers for 10 to 15 minutes, until the cookies are slightly puffed and springy to the touch.  Remove them from the oven and let cool completely before removing the financiers from the molds.", 
            "Once cooled, financiers can be kept in an airtight container at room temperature for up to one week.", 
            "* I made this by pulsing blanched almonds in the food processor until they were reduced to a powder. However, if you can find it in the store, the texture will be less gritty (the best I could do was a cornmeal consistency). Either work. "
        ], 
        "date": "2007-10-22T19:11:23+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups all-purpose flour", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "3/4 cup unsalted butter, melted", 
            "1 cup packed brown sugar", 
            "1/2 cup white sugar", 
            "1 tablespoon vanilla extract", 
            "1 egg", 
            "1 egg yolk", 
            "2 cups semisweet chocolate chips", 
            "1 1/4 cups all-purpose flour", 
            "1/2 cup unsweetened Dutch process cocoa", 
            "1 teaspoon baking soda", 
            "1/4 teaspoon baking powder", 
            "1/4 teaspoon salt", 
            "1 1/2 cups sugar", 
            "1/2 cup plus 2 tablespoons (1 1/4 sticks) room- temperature, unsalted butter", 
            "1 large egg", 
            "2 1/4 cups all-purpose flour", 
            "2 teaspoons baking soda", 
            "1/2 teaspoon salt", 
            "1 1/2 teaspoon ground cinnamon", 
            "1 teaspoon ground ginger", 
            "3/4 teaspoon ground cloves", 
            "1/4 teaspoon ground allspice", 
            "12 tablespoons (1 1/2 stick) unsalted butter, softened", 
            "1/2 cup dark brown sugar, packed", 
            "1/2 cup granulated sugar, plus 1/3 cup for rolling cookies", 
            "1 large egg", 
            "1 teaspoon vanilla extract", 
            "1/3 cup unsulphured molasses"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/good-enough-for-me1.jpg?w=500", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/07/good-enough-for-me/", 
        "title": "ice cream sandwich cookies", 
        "directions": [], 
        "date": "2006-07-28T16:11:40+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups plus 2 tablespoons (375 grams) unbleached all-purpose flour (a swap of 1/2 cup with whole wheat flour or 1 cup whole wheat pastry flour works well here, too)", 
            "1 cup (176 grams) dark brown sugar, lightly packed", 
            "1 teaspoon (6 grams) baking soda", 
            "3/4 teaspoon kosher or coarse sea salt  (4 grams)", 
            "7 tablespoons (3 1/2 ounces or 100 grams) unsalted butter, cut into 1-inch cubes and frozen", 
            "1/3 cup  (114 grams) mild-flavored honey, such as clover", 
            "5 tablespoons (77 grams) milk, full-fat is best", 
            "2 tablespoons (27 grams) pure vanilla extract", 
            "Topping (optional)", 
            "3 tablespoons  (43 grams) granulated sugar", 
            "1 teaspoon  (5 grams) ground cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/graham-crackers1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/05/graham-crackers/", 
        "title": "graham crackers", 
        "directions": [
            "Make the dough: Combine the flour, brown sugar, baking soda, and salt in the bowl of a food processor fitted with the steel blade or in the bowl of an electric mixer fitted with the paddle attachment. Pulse or mix on low to incorporate. Add the butter and pulse on and off on and off, or mix on low, until the mixture is the consistency of a coarse meal.", 
            "[Alternately, if you don’t have a food processor or electric mixer, you can cut the ingredients together with a pastry blender. Just make sure they’re very well incorporated.]", 
            "In a small bowl, whisk together the honey, milk, and vanilla extract. Add to the flour mixture and pulse on and off a few times or mix on low until the dough barely comes together. It will be very soft and sticky. Lay out a large piece of plastic wrap and dust it lightly with flour, then turn the dough out onto it and pat it into a rectangle about 1-inch thick. Wrap it, then chill it until firm, about 2 hours or overnight. Meanwhile, prepare the topping, if using, by combining the sugar and cinnamon in a small bowl and setting aside.", 
            "Roll out the crackers: Divide the dough in half and return one half to the refrigerator. Sift an even layer of flour onto the work surface and roll the dough into a long rectangle about 1/8 inch thick. The dough will be sticky, so flour as necessary. Trim the edges of the rectangle to 4 inches wide. Working with the shorter side of the rectangle parallel to the work surface, cut the strip every 4 1/2 inches to make 4 crackers. [This makes a traditional graham cracker shape. I rebelled and made mine into 2-inch fluted squares with one of these.]", 
            "Place the crackers on one or two parchment-lined baking sheets and sprinkle with the topping. Chill until firm, about 30 to 45 minutes in the fridge or 15 to 20 minutes in the freezer. Repeat with the second batch of dough. Finally, gather any scraps together into a ball, chill until firm, and re-roll.", 
            "Adjust the oven rack to the upper and lower positions and preheat the oven to 350°F. ", 
            "Decorate the crackers: Mark a vertical line down the middle of each cracker, being careful not to cut through the dough (again, this is for the traditional cracker shape). Using a toothpick or skewer (I like to use the blunt end of a wooden skewer for more dramatic dots), prick the dough to form two dotted rows about 1/2 inch for each side of the dividing line.", 
            "Bake for 15 to 25 minutes, until browned and slightly firm to the touch, rotating the sheets halfway through to ensure even baking. [The baking time range is long because the original recipe calls for 25 minutes but my new oven — which I suspect runs crazy hot but have yet to confirm with the actual purchase of an oven thermometer — had them done in way less. Be safe, check them sooner. Nobody likes a burnt cracker!]"
        ], 
        "date": "2009-05-29T09:29:02+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups flour", 
            "1/2 teaspoon salt", 
            "1/2 cup powdered sugar", 
            "1 1/2 to 3 tablespoons unsweetened green tea powder (matcha) (updated amount: reviews seem to prefer the lower amount)", 
            "2 sticks (1 cup) unsalted butter, softened", 
            "1/2 teaspoon almond extract", 
            "Superfine sugar, for sprinkling (optional)", 
            "4 ounces white chocolate, chopping into very small pieces", 
            "3 to 4 tablespoons heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/green-dreams1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/02/green-dreams/", 
        "title": "green tea shortbread sandwiches", 
        "directions": [
            "Heat the chocolate in the microwave for 30 seconds, stir it completely, then repeat this process, if necessary, in 15-second increments. Don’t let the chocolate burn. ", 
            "Add heavy cream, one tablespoon at a time, stirring until smooth. Cool ganache in the refrigerator, stirring every few minutes, until firm enough to spread or pipe between cookies. ", 
            "Once you have filled and assembled your cookies, I find that shocking them in the freezer for 5 minutes get the chocolate to firm up quickly without sogging the cookie, so they can be stored at room temperature until needed."
        ], 
        "date": "2007-02-12T11:24:45+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons unsalted butter, softened", 
            "3 ounces cream cheese at room temperature", 
            "3 tablespoons sugar", 
            "1 egg", 
            "1 teaspoon vanilla extract", 
            "1/2 teaspoon orange zest", 
            "1 1/3 cups plus 4 teaspoons flour", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/hamantaschen1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/03/hamantaschen/", 
        "title": "hamantaschen", 
        "directions": [
            "Various jams (we used raspberry, blackberry and apricot, but my favorite is this stuff) or prepared fillings (such as poppy seed or prune pastry filing)", 
            "Cream butter and cream cheese together until smooth. Add sugar and mix for one minute longer, then egg, vanilla extract, orange zest and salt, mixing until combined. Finally, add the flour. The mixture should come together and be a tad sticky. If it feels too wet, add an additional tablespoon of flour.", 
            "Form dough into a disc, wrap in plastic and refrigerate for at least an hour.", 
            "Preheat oven to 350°F.", 
            "To form the hamantaschen, roll out the dough on a well-floured surface until it is about 1/4-inch thick. Using a round cookie cutter (3 inches is traditional, but very large; I used one that was 2 1/2 inches), cut the dough into circles. Spoon a teaspoon of you filling of choice in the center. Fold the dough in from three sides and firmly crimp the corners and give them a little twist to ensure they stay closed. Leave the filling mostly open in the center. Bake on a cookie sheet lined with parchment paper and bake until golden brown, about 20 minutes.", 
            "Cool on racks. Resist the urge to try a still-hot one unless a jam-burnt tongue is as much of your Purim tradition as are these cookies."
        ], 
        "date": "2008-03-23T11:00:49+00:00"
    }, 
    {
        "ingredient_list": [
            "1 almost-full cup (4 ounces) hazelnuts, toasted, skinned and cooled", 
            "2/3 cup sugar", 
            "2/3 cup matzo cake meal or 1 cup plus 1 tablespoon flour", 
            "1/4 teaspoon salt", 
            "1 stick (1/2 cup) unsalted butter, melted and cooled slightly", 
            "1 large egg, lightly beaten", 
            "1 teaspoon vanilla extract", 
            "Chocolate (I used chocolate baking discs or “wafers”; 2 or 3 chocolate chips would also work) "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/hazelnut-chocolate-thumbprint-cookies1.jpg?w=500", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Passover", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/03/hazelnut-chocolate-thumbprint-cookies/", 
        "title": "hazelnut chocolate thumbprint cookies", 
        "directions": [
            "Pulse hazelnuts, sugar, matzo cake meal or flour, and salt in a food processor until finely ground. (Be careful not to grind to a paste.) Transfer to a bowl and stir in butter, egg, and extract until combined well. Chill dough, covered, until firm, about 30 minutes.", 
            "Put oven rack in middle position and preheat oven to 350°F.", 
            "Drop level tablespoons of dough 1 inch apart onto 2 ungreased baking sheets (though I lined mine with parchment paper, for an easier lazier clean-up). Roll dough into balls, then chill until slightly firm, about 10 minutes. ", 
            "Press one piece of chocolate firmly into the top of each ball of cookie dough and bake, 1 sheet at a time, until tops are pale golden and undersides are golden, 10 to 12 minutes. Be careful not to overbake. Transfer cookies to a rack and cool completely.", 
            "To fill with jam instead: After balls of cookie dough have been chilled for an additional 10 minutes, make a 1/2-inch-wide (1/3-inch-deep) indentation in center of each ball using your thumb, index finger, or the rounded end of a wooden spoon. Fill each indentation with 1/4 teaspoon jam.", 
            "Almond variation: The hazelnuts can also be swapped with 3/4 cup sliced almonds. ", 
            "Do ahead: Cookies keep in an airtight container at room temperature 3 days."
        ], 
        "date": "2010-03-24T11:52:30+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups (6.75 ounces) all-purpose flour", 
            "3/4 cup (2.4 ounces) unsweetened cocoa powder (see Note)", 
            "1 cup plus 2 tablespoons sugar", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon baking soda", 
            "14 tablespoons (1 3/4 sticks) unsalted butter, slightly softened", 
            "3 tablespoons whole milk", 
            "1 teaspoon pure vanilla extract", 
            "1 batch of Chocolate Wafers (recipe above)", 
            "1 cup whipping cream", 
            "1 to 2 spoons of powdered sugar (adjusted to your preferred sweetness; I like my whipped cream barely sweetened)", 
            "A dash of your favorite flavoring or extract (I use about 1/2 teaspoon vanilla)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/homemade-chocolate-wafers-icebox-cupcakes1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/03/homemade-chocolate-wafers-icebox-cupcakes/", 
        "title": "homemade chocolate wafers + icebox cupcakes", 
        "directions": [
            "Whip cream with a spoonful or two of powdered sugar and a dash of a flavoring of your choice, until the whipped cream holds firm peaks. Spread about two teaspoons whipped cream between each cookie, to the edges, and stack them until you reach the height you’d like. If you spread whipped cream on top of the final cookie, you will end up with a softer lid — a good thing — but I prefer the look of the brown cookie top.", 
            "Set them in the fridge at least overnight or up to a day. The cookies will soften as they set, and become cake-like."
        ], 
        "date": "2009-03-25T14:16:11+00:00"
    }, 
    {
        "ingredient_list": [
            "Icing:", 
            "2 1/4 (9 1/2 ounces or 270 grams) cups powdered sugar", 
            "5 to 6 (75 to 90 ml) tablespoons whole milk", 
            "1 tablespoon (6 grams) cinnamon", 
            "1/4 teaspoon kosher salt**"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/iced-oatmeal-cookies1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/12/iced-oatmeal-cookies/", 
        "title": "iced oatmeal cookies", 
        "directions": [
            "Preheat oven to 350°F with racks in the upper and lower thirds of the oven. Rub two baking sheets with butter. In a food processor, grind 1/2 cup of oats to a fine powder, then add remaining oats and grind them all together until it resembles coarse meal, with only a few large flakes remaining.", 
            "Sift dry ingredients into a large bowl, pouring back any bits of grains or other ingredients that remain in the sifter. In a small bowl, whisk butter and eggs until combined. Using a spatula, fold the wet ingredients into the dry ingredients.", 
            "Scoop balls of dough about 2 to 3 tablespoons in size (I used a #40 cookie scoop, which scooped 2 tablespoon-sized balls) onto cookie sheets about 3 inches apart. Bake for 16 to 20 minutes, rotating the sheets halfway through. When tops are evenly brown, take them out and transfer them to a cooling rack. Repeat with remaining cookie dough. Let cookies cool completely before icing.", 
            "In a bowl, whisk icing ingredients together until smooth. It should have a honey-like consistency.  Drizzle the frosting over the cookies. Let the frosting set for 30 minutes (or more; it took longer at my place but by the next day, was fully firmed up) before eating. The cookies can be stored in an airtight container for up to a week.", 
            "* The original recipe replaced this volume with a multigrain flour mix that worked out to 1/2 cup barley flour + 1/4 cup millet flour + 1/4 cup rye flour. If you have any of these flours, swap them in and reduce the volume of all-purpose.", 
            "** Saltiness of kosher salt varies by brand. I’d recommend 2 teaspoons if you use Diamond kosher salt, and about half as much if you use Morton kosher salt or another brand."
        ], 
        "date": "2010-12-16T12:52:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/4 cups all-purpose flour", 
            "1/3 cup unsweetened cocoa powder", 
            "1/2 teaspoon baking soda", 
            "1 stick plus 3 tablespoons unsalted butter, at room temperature", 
            "2/3 cup (packed) light brown sugar", 
            "1/4 cup sugar", 
            "1/2 teaspoon fleur de sel or 1/4 teaspoon fine sea salt", 
            "1 teaspoon vanilla extract", 
            "5 ounces bittersweet chocolate, chopped into chips, or a generous 3/4 cup store-bought mini chocolate chips"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/01/world-peace-cookies.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/01/in-which-world-peace-eludes-me/", 
        "title": "in which world peace eludes me", 
        "directions": [
            "Sift the flour, cocoa and baking soda together. ", 
            "Working with a stand mixer, preferably fitted with a paddle attachment, or with a hand mixer in a large bowl, beat the butter on medium speed until soft and creamy. Add both sugars, the salt and vanilla extract and beat for 2 minutes more. ", 
            "Turn off the mixer. Pour in the flour mixture, drape a kitchen towel over the stand mixer to protect yourself and your kitchen from flying flour and pulse the mixer at low speed about 5 times, a second or two each time. Take a peek — if there is still a lot of flour on the surface of the dough, pulse a couple of times more; if not, remove the towel. Continuing at low speed, mix for about 30 seconds more, just until the flour disappears into the dough — for the best texture, work the dough as little as possible once the flour is added, and don’t be concerned if the dough looks a little crumbly. Toss in the chocolate pieces and mix only to incorporate. ", 
            "Turn the dough out onto a work surface, gather it together and divide it in half. Working with one half at a time, shape the dough into logs that are 1 1/2 inches in diameter. Wrap the logs in plastic wrap and refrigerate them for at least 3 hours. (The dough can be refrigerated for up to 3 days or frozen for up to 2 months. If you’ve frozen the dough, you needn’t defrost it before baking — just slice the logs into cookies and bake the cookies 1 minute longer.) ", 
            "Getting ready to bake: Center a rack in the oven and preheat the oven to 325°F (160°C). Line two baking sheets with parchment or silicone mats. ", 
            "Working with a sharp thin knife, slice the logs into rounds that are 1/2 inch thick. (The rounds are likely to crack as you’re cutting them — don’t be concerned, just squeeze the bits back onto each cookie.) Arrange the rounds on the baking sheets, leaving about one inch between them. ", 
            "Bake the cookies one sheet at a time for 12 minutes — they won’t look done, nor will they be firm, but that’s just the way they should be. Transfer the baking sheet to a cooling rack and let the cookies rest until they are only just warm, at which point you can serve them or let them reach room temperature. ", 
            "Serving: The cookies can be eaten when they are warm or at room temperature — I prefer them at room temperature, when the textural difference between the crumbly cookie and the chocolate bits is greatest — and are best suited to cold milk or hot coffee. ", 
            "Do ahead: Packed airtight, cookies will keep at room temperature for up to 3 days (Deb note: not a chance); they can be frozen for up to 2 months. They can also be frozen in log form for months, and can be sliced and baked directly from the freezer, adding a coupld minutes to the baking time.", 
            "Updated 12/18/11: Upon realizing that there were a few discrepancies in the gram weights, I’ve removed them until I can retest this and replace them with more accurate numbers. Hopefully, this week. Thank you. "
        ], 
        "date": "2007-01-05T14:32:35+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (125 grams) all-purpose flour", 
            "1/3 cup (30 grams) Dutched cocoa powder (see Updated Note)", 
            "1/4 teaspoon baking soda", 
            "1/2 cup (1 stick, 4 ounces or 115 grams) unsalted butter, at room temperature", 
            "1/2 to 2/3 cup (100 to 135 grams) granulated sugar (less for a more bittersweet cookie)", 
            "1/4 teaspoon fine sea salt", 
            "1 large egg yolk", 
            "1/2 teaspoon vanilla extract", 
            "3 1/2 ounces (100 grams) semi- or bittersweet chocolate, grated or finely chopped until almost powdery in a food processor", 
            "Coarse sugar (turbinato/sugar in the raw or decorative) for sprinkling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/01/intensely-chocolate-sables.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/01/intensely-chocolate-sables/", 
        "title": "intensely chocolate sables", 
        "directions": [
            "Sift together the flour, cocoa and baking soda together onto a piece of waxed paper or into a bowl and set aside. (I almost always skimp on sifting wherever possible, but my cocoa is always lumpy, so this is unavoidable.)", 
            "Cream butter, sugar and salt together in a large bowl with an electric mixer until light and fluffy. Add egg yolk and vanilla, beating until combined, then scraping down sides. Add dry ingredients and grated chocolate together and mix until just combined.", 
            "Scrape dough onto a piece of plastic wrap, wrap it up and chill it in the fridge until just firm, about 30 to 45 minutes. No need to get it fully hard, or it will be harder to roll out. Dough can be refrigerated until needed, up to a two days, or frozen longer, but let it warm up and soften a bit before rolling it out for decreased frustration.", 
            "Heat oven to 350 degrees. On a floured surface, roll dough gently — it will still be on the crumbly side, so only attempt to flatten it slightly with each roll — until it is 1/8-inch thick (for thin cookies, what I used), 1/4-inch thick (for thicker ones) or somewhere in-between (I suspect the Balthazar ones are rolled to 3/8-inch). Cut into desired shapes and space them an inch apart on a parchment-lined baking sheet. Sprinkle decoratively with coarse sugar. Bake for 8 to 10 minutes (for thinner cookies) or 10 to 12 minutes (for thicker ones). Leave cookies on baking sheets out of the oven for a couple minutes before gently, carefully transferring them to cooling racks, as they’ll be fragile until they cool.", 
            "Cookies can be stored in an airtight container for up to two weeks of 4 p.m. rations."
        ], 
        "date": "2013-01-25T11:25:25+00:00"
    }, 
    {
        "ingredient_list": [
            "For the chocolate wafers:", 
            "1 1/4 cups (155 grams) all-purpose flour", 
            "1/2 cup (45 grams, but cocoa weights can vary greatly) unsweetened Dutch process cocoa", 
            "1 teaspoon baking soda", 
            "1/4 teaspoon baking powder", 
            "1/4 teaspoon salt", 
            "1 to 1 1/2 cups (200 to 300 grams) sugar [see recipe note]", 
            "1/2 cup plus 2 tablespoons (1 1/4 sticks or 140 grams) room-temperature, unsalted butter", 
            "1 large egg", 
            "For the filling:", 
            "1/4 cup (1/2 stick or 55 grams) room-temperature, unsalted butter", 
            "1/4 cup (50 grams) vegetable shortening", 
            "2 cups (240 grams) sifted confectioners’ sugar", 
            "2 teaspoons (10 ml) vanilla extract "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/05/503300916_0a93c7b6ab_o.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/05/my-kingdom-for-a-glass-of-milk/", 
        "title": "homemade oreos", 
        "directions": [], 
        "date": "2007-05-18T15:25:01+00:00"
    }
]