{
  "date": "2014-05-16T10:36:40+00:00",
  "directions": [
    "Preheat your oven to warm and place a tray on a middle rack.",
    "Make waffles: Whisk flour, cornmeal, baking powder, sugar and salt in a medium bowl. In a smaller bowl, whisk together buttermilk, butter and egg. Stir wet ingredients and grated cheese into the dry mixture until combined. ",
    "Make waffles according to your manufacturer’s directions. In the waffle iron I used – a thin one that made 6 rectangular waffles per batch – I cooked the waffles on the middle heat setting and needed 1 1/4 to 1 1/2 cups batter per batch. I made about 1 1/2 batches, yielding 9 small waffles. ",
    "Transfer waffles to tray in warmed oven and leave them there while you cook your greens.",
    "Prepare creamed greens: Wash greens but no need to dry them. In a large skillet over medium-high heat, cook the greens until wilted. For baby spinach, we prefer it just barely wilted, which takes just a minute. For heartier greens, you’ll want to cook them a few minutes longer. Transfer greens to a colander and press out as much extra liquid as you can. If desired, coarsely chop greens. ",
    "Wipe out pan and return it to medium heat. Melt butter and then cook onion until soft and tender, about 5 minutes. Return greens to pan and drizzle heavy cream over them. Cook, stirring, until cream simmers for a minute and mixture is evenly combined. Season with salt and freshly ground black pepper and set aside.",
    "Poach eggs: Poach eggs according to your favorite method. If you don’t have one, here’s mine: Heat a saucepan with a few couple inches of water to the point right before it simmers. Using a cooking spoon, create a whirlpool and crack your egg right into the center of it and stop swirling. The egg should mostly wrap around itself. Continue to let the egg cook, keeping the water from fully simmering, until the white is firmed up but it the egg still jiggles from the middle when nudged with a spoon, about 3 to 4 minutes. Scoop out with a slotted spoon and repeat with remaining eggs.",
    "Assemble sandwiches: Place one square or wedge of waffle on a plate. Top with 1/4 of the creamed greens and a single poached egg. Dash with hot sauce, if desired, or a scattering of chopped tomatoes. Top with a second square or wedge of waffle and eat, precariously. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/five-new-ways-to-make-egg-sandwiches1.jpg?w=640",
  "ingredient_list": [
    "2 to 3 tablespoons olive oil",
    "1/2 small yellow onion, chopped",
    "2 cloves garlic, crushed then minced",
    "1 red bell pepper, cored and sliced into thin strips",
    "1 yellow bell pepper, cored and sliced into thin strips",
    "1 Anaheim or 1 jalapeño chile, cored and sliced into thin strips",
    "1/2 teaspoon ground cumin",
    "1 teaspoon paprika",
    "1/4 teaspoon table salt",
    "1 14-ounce can crushed tomatoes, fire-roasted if you can get them",
    "6 eggs",
    "1/2 cup feta cheese, crumbled",
    "2 teaspoons (or more to taste) za’atar",
    "1 to 2 tablespoons chopped flat-leaf parsley (optional), to garnish",
    "6 small or 4 large pitas",
    "Pickled shallots",
    "1/4 cup red or white wine vinegar",
    "2 teaspoons kosher salt",
    "1 1/2 teaspoons sugar",
    "1/4 cup water",
    "3 small shallots, peeled and thinly sliced",
    "Asparagus pesto",
    "1/2 pound asparagus spears, trimmed of tough ends",
    "1 garlic clove, peeled and chopped",
    "1/4 cup grated Parmesan cheese",
    "3 tablespoons pine nuts or almonds, toasted and cooled, divided",
    "1/4 teaspoon table salt, or a little more of a coarse sea salt",
    "2 tablespoons olive oil",
    "To assemble",
    "6 large slices whole-wheat sourdough bread, miche, or another sliced country bread of your choice, toasted",
    "2 tablespoons whole grain Dijon mustard",
    "6 large hard-boiled eggs",
    "2 to 3 slices of bacon, halved to approximate sandwich lengths",
    "2 thin slices white, sourdough or a country bread, toasted",
    "4 thin slices of tomato",
    "A few leaves of iceberg lettuce",
    "1 tablespoon mayonnaise",
    "1 large egg",
    "1 teaspoon butter",
    "Salt and freshly ground black pepper to taste",
    "1 pound Yukon Gold potatoes, cut into small (about 1/2-inch) cubes",
    "1 tablespoon olive or vegetable oil",
    "1/2 small onion, finely chopped",
    "1/2 pound Mexican chorizo, casings removed",
    "Salt",
    "Freshly ground black pepper",
    "6 large eggs",
    "8 small corn tortillas, warmed or blistered in a hot pan",
    "To finish",
    "Crumbled queso freso (cotija, ricotta salata and feta are decent substitutes, if you can’t find it)",
    "Chopped cilantro, diced tomatoes, diced white onions (you can also sink these in the same pickle brine as the shallots in the earlier recipe), pickled jalapenos, a dollop of crèma or sour cream, a squeeze of lime juice, a dash or hot sauce or all of the above",
    "Waffles",
    "3/4 cups all-purpose flour",
    "3/4 cups cornmeal",
    "1 1/2 teaspoons baking powder",
    "1 teaspoon granulated sugar",
    "1/2 teaspoon table salt",
    "1 cup buttermilk",
    "1 tablespoon unsalted butter, melted and cooled slightly",
    "1 large egg",
    "1/2 cup finely grated cheddar cheese",
    "Spray cooking oil to coat waffle iron",
    "Creamed greens",
    "5 ounces baby spinach or another fairly quick-cooking green of your choice, stemmed if stems are heavy",
    "Butter",
    "1/4 small onion, finely chopped",
    "3 tablespoons heavy cream",
    "To assemble",
    "4 large eggs",
    "Hot sauce and diced fresh tomatoes (optional)"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Eggs",
    "Photo",
    "Sandwich"
  ],
  "title": "five egg sandwiches",
  "url": "https://smittenkitchen.com/2014/05/five-egg-sandwiches/"
}