{
  "date": "2011-09-20T13:49:02+00:00",
  "directions": [
    "Make soup: Preheat oven to 400°F. Wrap garlic cloves in a tight foil packet. Place tomatoes, cut side up, on large baking sheet. Sprinkle generously with salt and pepper (I used 1 full teaspoon of Kosher salt). Drizzle tomatoes with olive oil.  Add foil packet of garlic to tray. Roast until tomatoes are brown and tender (garlic will be very tender), about 1 hour. Cool slightly.",
    "Unwrap garlic packet and peel cloves. Transfer cloves, tomatoes and any accumulated juices to a blender or food processor and pulse machine on and off until tomatoes are a chunky puree. Transfer tomatoes to medium pot and add thyme, crushed red pepper and stock and bring to a boil Reduce heat to a simmer and cook, uncovered, for 25 minutes. Remove from heat and adjust seasonings to taste.",
    "Create cheddar lid: Preheat oven to 350. Arrange four ovenproof soup bowls, crocks or large mugs on a large, foil-lined baking sheet. Stir grated onion into the warm soup. (I love this last-minute suggestion of onion.) Float toast slice(s) in each bowl, buttered side up and divide grated cheese generously over top. (If you’re using a wide bowl, you might find that you want more cheese to create a thick, broiled lid.)  Bake soups on tray for 15 to 20 minutes, until cheese on top is bubbling and brown at the edges. If you’d like it even more bronzed on top, preheat your broiler and finish soups for a minute or two under it. Serve immediately.",
    "Do ahead: Soup can be prepared one day ahead, and kept covered in the fridge. Rewarm before serving, or before finishing with cheddar crouton."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/09/roasted-tomato-soup-with-broiled-cheddar.jpg?w=750",
  "ingredient_list": [
    "Soup",
    "3 pounds plum tomatoes, halved lengthwise",
    "2 tablespoons olive oil",
    "2 large or 4 small cloves garlic, unpeeled",
    "1 teaspoon finely chopped fresh thyme leaves or 1/4 teaspoon dried",
    "1/4 teaspoon (or more to taste) dried crushed red pepper",
    "4 cups chicken or vegetable stock",
    "Lid",
    "4 1-inch slices from a large loaf of rye bread, whole wheat sourdough or bread of your choice (or 16 1-inch slices from a baguette), toasted until hard and lightly buttered on one side",
    "1 tablespoon grated raw onion",
    "1 cup coarsely grated cheddar (or more to taste)"
  ],
  "tags": [
    "Photo",
    "Soup",
    "Summer",
    "Tomatoes",
    "Vegetarian"
  ],
  "title": "roasted tomato soup with broiled cheddar",
  "url": "https://smittenkitchen.com/2011/09/roasted-tomato-soup-with-broiled-cheddar/"
}