{
  "date": "2014-08-07T12:18:31+00:00",
  "directions": [
    "Heat your oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (If you have an 8-inch square springform, you can skip this and just butter it well.)",
    "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. Transfer the dough clumps to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.",
    "(Don’t have a food processor? You might have an easier time using softened butter and preparing this cookie-style: cream it with the sugar with a hand mixer, then spoon in the salt and flour, beating until just combined. It might help to chill this mixture a bit before pressing it into the pan, or it might feel too greasy to easily spread.)",
    "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind your pistachios, sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. ",
    "Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. Cut apricots in half (or, you might find that you can tear them open at the seams with your fingers) and remove pits. From here, you have a few decoration options: you can place the apricot halves in facedown or up all over the pistachio base. You can do as I did, which is cut them into strips, then slide each cut half onto a butter knife or offset spatula, tilt it so that it fans a little, and slide it onto your pistachio filling decoratively. (With this method, I ended up not using all of my apricots.) You could also arrange the strips like petals of flower around the pan, for maximum pretties.]]",
    "Bake the bars for 60 minutes, or until they are golden and a toothpick inserted into the pistachio portion comes out batter-free. This might take up to 10 minutes longer depending on the juiciness of your apricots and the amount you were able to nestle in. Let cool completely in pan; you can hasten this along in the fridge. ",
    "To finish, you can make a shiny glaze for your tart by warming the jam in a small saucepan until it thins, and brushing this mixture over the top of the cooled tart. Or, you can keep it rustic with just a dusting of powdered sugar, as I did. ",
    "Cut bars into squares — chilled bars will give you the cleanest cuts. Keep leftover bars chilled. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/apricot-pistachio-squares1.jpg?w=640",
  "ingredient_list": [
    "Crust",
    "1 cup (125 grams) all-purpose flour",
    "1/4 teaspoon table salt",
    "1/4 cup (50 grams) granulated sugar",
    "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine ",
    "Filling",
    "3/4 cup (a scant 4 ounces or 110 grams) shelled unsalted pistachios",
    "1 tablespoon (10 grams) all purpose flour",
    "Few pinches of sea salt",
    "6 tablespoons (75 grams) sugar",
    "5 tablespoons (70 grams) unsalted butter, cold is fine",
    "1 large egg",
    "1/4 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)",
    "1 pound firm-ripe apricots",
    "To finish",
    "Powdered sugar or 1/4 cup apricot jam"
  ],
  "tags": [
    "Apricots",
    "Bars",
    "Photo",
    "Picnics",
    "Summer",
    "Tarts/Pies"
  ],
  "title": "apricot pistachio squares",
  "url": "https://smittenkitchen.com/2014/08/apricot-pistachio-squares/"
}