{
  "date": "2006-12-08T14:07:31+00:00",
  "directions": [
    "Preheat the oven to 350°F. ",
    "For the crust: Beat the butter and granulated sugar in the bowl of an electric mixer fitted with a paddle attachment, until light, approximately 3 minutes. Add the eggs and the vanilla and mix well. Sift together the flour, baking powder, and salt. Mix the dry ingredients into the batter with the mixer on low speed until just combined. Press the dough evenly into an ungreased 18 by 12 by 1-inch baking sheet, making an edge around the outside. It will be very sticky; sprinkle the dough and your hands lightly with flour. Bake for 15 minutes, until the crust is set but not browned. Allow to cool. ",
    "For the topping: Combine the butter, honey, brown sugar, and zests in a large, heavy-bottomed saucepan. Cook over low heat until the butter is melted, using a wooden spoon to stir. Raise the heat and boil for 3 minutes. Remove from the heat. Stir in the heavy cream and pecans. Pour over the crust, trying not to get the filling between the crust and the pan. Bake for 25 to 30 minutes, until the filling is set. Remove from the oven and allow to cool. Wrap in plastic wrap and refrigerate until cold. Cut into bars and serve."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/aww-yeah-1017-grams-of-butter1.jpg?w=500",
  "ingredient_list": [
    "Crust: ",
    "1 1/4 pounds unsalted butter, room temperature",
    "3/4 cup granulated sugar",
    "3 extra-large eggs",
    "3/4 teaspoon pure vanilla extract",
    "4 1/2 cups all-purpose flour",
    "1/2 teaspoon baking powder",
    "1/4 teaspoon salt ",
    "Topping: ",
    "1 pound unsalted butter",
    "1 cup good honey",
    "3 cups light brown sugar, packed",
    "1 teaspoon grated lemon zest",
    "1 teaspoon grated orange zest",
    "1/4 cup heavy cream",
    "2 pounds pecans, coarsely chopped"
  ],
  "tags": [
    "Bars",
    "Photo"
  ],
  "title": "pecan squares",
  "url": "https://smittenkitchen.com/2006/12/aww-yeah-1017-grams-of-butter/"
}