{
  "date": "2012-08-03T13:26:11+00:00",
  "directions": [
    "Preheat your oven to 350°F (180°C) and line an 8x8x2-inch baking pan with parchment, letting it extend up two sides. Butter or coat the bottom and sides with a nonstick spray and set the pan aside.",
    "Make the base: In a food processor, pulse together the sugar, zest and salt until combined. Add the butter and pulse until it is evenly dispersed in the dough. Add the flour and pulse the machine until it’s just combined and the mixture is crumbly. Press the dough into the prepared pan and about 1/2-inch up the sides. Don’t worry about making this perfect; mine was an uneven mess and nobody can tell. Bake for 15 minutes, until lightly browned at edges. Let cool on a rack while you prepare the filling (though no need for it to be completely cool when you fill it). Leave oven on.",
    "Make the pink lemonade layer: Puree the raspberries in your food processor until they’re as liquefied as they’ll get. I don’t even bother cleaning mine between steps, but I’m also probably lazier than you. Run the puree through a fine-mesh sieve, trying to press out all the raspberry puree that you can, leaving the seeds behind. I ended up with 1/3 cup strained puree; don’t worry if you get a smidge less.",
    "In a medium bowl, whisk together the eggs, sugar and lemon juice until smooth. Whisk in 3 tablespoons of raspberry puree. Stir in flour. Pour into cooling crust and return pan to the oven, baking the bars until they’re set (they’ll barely jiggle) and slightly golden at the edges, about 25 to 30 minutes. Cool completely before cutting into rectangles. (You can speed this up in the fridge.)",
    "I intended to cut mine into 32 2×1-inch rectangles but actually cut them into 28 2×1-ish rectangles. I like lemony bars small but you could also cut them into 16 2×2-inch squares. Dust with powdered sugar before serving. Store in fridge for up to a week."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade-bars1.jpg?w=500",
  "ingredient_list": [
    "For the base:",
    "1/4 cup (50 grams) granulated sugar",
    "1/4 teaspoon freshly grated lemon zest",
    "1/8 teaspoon table salt",
    "1/2 cup (4 ounces or 115 grams) unsalted butter, cut into chunks",
    "1 cup (125 grams) flour",
    "For the lemonade layer",
    "1 cup (about 5 ounces or 140 grams) raspberries",
    "2 large eggs",
    "3/4 cup (150 grams) granulated sugar",
    "1/4 cup freshly squeezed lemon juice; this should only require 2 lemons",
    "1/3 cup (40 grams) all-purpose flour",
    "Confectioners’ sugar, for dusting"
  ],
  "tags": [
    "Bars",
    "Citrus",
    "Lemon",
    "Photo",
    "Picnics",
    "Raspberries",
    "Summer"
  ],
  "title": "pink lemonade bars",
  "url": "https://smittenkitchen.com/2012/08/pink-lemonade-bars/"
}