{
  "date": "2016-09-01T07:33:56+00:00",
  "directions": [
    "Heat oven to 375 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.\nMake the crust: Combine the flour, almonds, salt, sugar and extract in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.\nMake crumble: Blend flour, almond paste, sugar and salt in processor until almond paste is finely ground. Add butter and blend, using on/off turns, until coarse crumbs form. Transfer crumble to bowl; mix in almonds.\nMake filling: Combine all ingredients in medium bowl; toss to coat well.\nAssemble squares: Sprinkle 1/2 cup prepared crumble over cooled crust. Top with plum mixture. Sprinkle with remaining crumble.",
    "Bake: Until filling bubbles thickly and top is golden, about 35 to 40 minutes. If the bars brown too quickly, cover them with foil for the remaining baking time. Cool in pan. I like to hurry this (too) along in the fridge or freezer. Once firm, I’ll use the parchment sling to remove the bars and cut them more cleanly on a cutting board. Dust with powdered sugar, if desired, before serving.\nDo ahead: These bars keep for up to a week in the fridge, longer in the freezer."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/plum-squares-with-marzipan-crumble.jpg?w=750",
  "ingredient_list": [
    "1 cup (130 grams) all-purpose flour",
    "1/2 cup (55 grams) sliced almonds, toasted or equivalent weight almond flour",
    "1/4 teaspoon fine sea or table salt",
    "1/4 cup (50 grams) granulated sugar",
    "1/4 teaspoon almond extract",
    "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine",
    "2/3 cup (85 grams) all purpose flour",
    "1/3 cup (packed) almond paste (about 3.5 ounces or half a 7-ounce tube)",
    "1/3 cup (65 grams) light brown sugar",
    "1/4 teaspoon fine sea or table salt",
    "4 tablespoons (2 ounces or 55 grams) chilled unsalted butter, cut into cubes",
    "1/4 cup (30 grams) sliced, toasted almonds",
    "1 pounds plums (about 6 to 7), halved, pitted, thinly sliced",
    "3 tablespoons granulated sugar",
    "1 1/2 tablespoons cornstarch"
  ],
  "tags": [
    "Bars",
    "Crumbles/Crisps",
    "Photo",
    "Plum",
    "Summer"
  ],
  "title": "plum squares with marzipan crumble",
  "url": "https://smittenkitchen.com/2016/09/plum-squares-with-marzipan-crumble/"
}