{
  "date": "2010-03-01T23:56:08+00:00",
  "directions": [
    "Confectioners’ sugar, for sprinkling.",
    "Make the cake dough: In a small bowl, mix milk with 2 tablespoons warm water. Add yeast and whisk gently until it dissolves. Mixture should foam slightly. (Very slightly in my case.)",
    "Using an electric mixer with paddle attachment, cream butter, sugar and salt. Scrape down sides of bowl and beat in the egg. Alternately add flour and the milk mixture, scraping down sides of bowl between each addition. Clark doesn’t say to do this, but I switched to a dough hook at this point to beat dough on medium speed until it formed a smooth mass and pulled away (just a little, my dough was still very soft) from sides of bowl, 7 to 10 minutes.",
    "Press, stretch and nudge dough into an ungreased (original recipe suggests this; I found that my topping stuck a lot and I really had to cut around it with a sharp knife; I will grease mine next time) 9-by 13-inch baking dish (see Note above about baking dishes) at least 2 inches deep. Cover dish with plastic wrap or clean tea towel, put in a warm place, and allow to rise until doubled, 2 1/2 to 3 hours.",
    "Make the gooey topping: Heat oven to 350 degrees. To prepare topping, in a small bowl, whisk corn syrup with 2 tablespoons water and the vanilla. Using an electric mixer with paddle attachment, cream butter, sugar and salt until light and fluffy, 5 to 7 minutes. Scrape down sides of bowl and beat in the egg. Alternately add flour and corn syrup mixture, scraping down sides of bowl between each addition.",
    "Spoon topping in large dollops over risen cake and use an offset spatula to gently spread it in an even layer. Bake for 30 to 45 minutes (see Note above about wide range); cake will rise and fall in waves and have a golden brown top, but will still be liquid in center when done. Allow to cool in pan before sprinkling with confectioners’ sugar for serving."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/st-louis-gooey-butter-cake1.jpg?w=500",
  "ingredient_list": [
    "For the cake",
    "3 tablespoons milk at room temperature",
    "1 3/4 teaspoons active dry yeast",
    "6 tablespoons unsalted butter at room temperature",
    "3 tablespoons sugar",
    "1 teaspoon kosher salt",
    "1 large egg",
    "1 3/4 cups all-purpose flour",
    "For the topping",
    "3 tablespoons plus 1 teaspoon light corn syrup",
    "2 1/2 teaspoons vanilla extract",
    "12 tablespoons (1 1/2 sticks) unsalted butter, at room temperature",
    "1 1/2 cups sugar",
    "1/2 teaspoon kosher salt",
    "1 large egg",
    "1 cup plus 3 tablespoons all-purpose flour"
  ],
  "tags": [
    "Cake",
    "Everyday Cakes",
    "Photo"
  ],
  "title": "st. louis gooey butter cake",
  "url": "https://smittenkitchen.com/2010/03/st-louis-gooey-butter-cake/"
}