{
  "date": "2014-05-09T11:20:41+00:00",
  "directions": [
    "Heat oven to 375 degrees F. For easy removal, line bottom and two sides of 8-by-8-inch square baking pan with parchment paper. No need to bother (and no greasing needed) if you plan to serve them right in the pan, as I did. ",
    "Place oats, 3/4 cup flour, brown sugar and salt in bottom of baking pan and mix. Pour melted butter over, and stir until clumps form. If the clumps feel soft or look overly damp, add the remaining 2 tablespoons flour. Set aside 1/2 cup of the crumble mixture. Press the rest of the crumb mixture evenly in the bottom of the pan.",
    "Spread half the fruit over the crust. Sprinkle it evenly with cornstarch, then lemon juice, and 1/2 tablespoon of granulated sugar. Spread remaining fruit over this, and top with second 1/2 tablespoon sugar. Scatter reserved crumbs over fruit and bake bars for 30 to 40 minutes (firmer fruits will take longer), until fruit is bubbly and crisp portion is golden and smells toasty and amazing. ",
    "Let cool in pan; I do this in the fridge, where they become crisp once chilled (less so at room temperature). Cut into squares and sprinkle with powdered sugar before serving. Store leftovers in fridge."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/strawberry-rhubarb-crisp-bars1.jpg?w=640",
  "ingredient_list": [
    "1 cup (80 grams) rolled oats",
    "3/4 cup (95 grams) plus up to 2 tablespoons (15 grams) extra all-purpose flour",
    "1/2 cup (95 grams) light brown sugar",
    "Heaped 1/4 teaspoon table salt",
    "6 tablespoons (85 grams) unsalted butter, melted",
    "1 teaspoon cornstarch (optional, but helps firm up the filling)",
    "1 tablespoon (15 ml) lemon juice",
    "1 tablespoon (15 grams) granulated sugar, divided",
    "1 cup (125 grams) small-diced rhubarb (from about 1 1/2 medium stalks)",
    "1 cup (155 grams) small-diced strawberries",
    "Powdered sugar, for decoration, if desired"
  ],
  "tags": [
    "Bars",
    "Cookie",
    "Crumbles/Crisps",
    "Photo",
    "Picnics",
    "Quick",
    "Rhubarb",
    "Strawberries",
    "Tarts/Pies"
  ],
  "title": "strawberry rhubarb crisp bars",
  "url": "https://smittenkitchen.com/2014/05/strawberry-rhubarb-crisp-bars/"
}