{
  "date": "2014-09-22T12:17:45+00:00",
  "directions": [
    "Heat oven: To 350°F. Coat a 9-inch springform with butter or a nonstick spray. Line the bottom of the pan with a round of parchment paper. ",
    "Prepare apples: Place peeled, halved and cored apples cut-side-down on a cutting board. Use a knife to create parallel thin slices, but only cut halfway through each apple so that the apples stay intact. Don’t fret if you cut through, however; you can just reassemble the halves on the cake in a few minutes.",
    "In a bowl, toss apples with lemon juice and 2 tablespoon granulated sugar.",
    "Prepare cake base: Beat butter and 1/4 cup plus 2 tablespoons granulated sugar together in a bowl with electric beaters until fluffy. Add honey and beat until combined. Add vanilla and egg yolks, beating until just combined. Sprinkle salt and baking powder over cake batter, and mix for just 5 seconds, until they disappear. Add flour, half at a time, mixing only until just combined.",
    "In a separate bowl with cleaned beaters, beat egg whites until stiff. Stir 1/4 of them into the cake batter, to lighten it a little. Fold in the rest in three additions. It will seem impossible to fold in at first because the batter is so stiff, but it will loosen with careful folding. Only fold the last addition of egg whites until it has mostly disappeared (a couple faint streaks of egg white are fine). ",
    "Spread cake batter in prepared cake pan, smoothing the top. Arrange apple halves facedown over the cake batter. To warn, 4 tiny/small apples will definitely fit over the cake batter. When I made it with 4 small-almost-medium apples, I could only fit 3 1/2 of them. No need to press the apples into the batter. You can pour any extra lemon juice and sugar in the bowl over the apples.",
    "Bake cake: 35 to 40 minutes, until a toothpick or skewer inserted into the center of the cake comes out clean. Let rest on a cooling rack for 5 minutes, then cut around the cake to make sure it’s not sticking to the pan at all, and unhinge the sides. Let cake cool completely. You can store it at room temperature at this point, or after you add the honey, for up to 5 days 3 days at room temperature. After that, a fridge is best for longevity. The cake is lovelier on day 2 than day 1.",
    "Before serving, if you’d like the glaze to look glossy, or whenever the cake is cool, if you don’t mind if the honey sinks into the cake: Warm 1/4 cup honey and a good pinch of sea salt until it liquefies to the point where it makes a thin glaze — this will take less than 30 seconds. Brush honey-salt mixture over cooled cake. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/sunken-apple-cake-with-salted-honey-glaze1.jpg?w=640",
  "ingredient_list": [
    "Topping",
    "4 tiny-to-small apples, halved, peeled and cored",
    "2 tablespoons fresh lemon juice",
    "2 tablespoons granulated sugar",
    "Batter",
    "1/2 cup plus 1 tablespoon (125 grams) unsalted butter, at room temperature",
    "1/4 cup plus 2 tablespoons (6 tablespoons) granulated sugar",
    "1/4 cup honey (any variety you like to eat)",
    "1 teaspoon vanilla extract",
    "3 large eggs, separated",
    "2 good pinches of salt",
    "2 teaspoons baking powder",
    "1 1/4 cups all-purpose flour",
    "Glaze",
    "1/4 cup honey",
    "A good pinch of sea salt"
  ],
  "tags": [
    "Apple",
    "Cake",
    "Everyday Cakes",
    "Fall",
    "German",
    "Jewish",
    "Photo"
  ],
  "title": "sunken apple and honey cake",
  "url": "https://smittenkitchen.com/2014/09/sunken-apple-and-honey-cake/"
}