[
    {
        "ingredient_list": [
            "1 small/medium acorn squash", 
            "4 tablespoons vegetable oil", 
            "3 tablespoons diced white onion", 
            "1 tablespoon minced jalapeno", 
            "1 clove garlic, minced", 
            "2 poblano chiles, roasted, peeled and cut into strips", 
            "Salt and pepper to taste", 
            "10-inch flour tortillas", 
            "1 cup shredded Mexican cheese blend of your choice (I used Muenster, not Mexican but worked great!)", 
            "Butter for frying quesadillas", 
            "Garnishes: Julienned radishes, crema or sour cream and/or salsa verde cruda (recipe below)", 
            "10 tomatillos, husked and well washed, quartered", 
            "1/2 bunch of scallions, roots and green ends trimmed, cut into big segements", 
            "5 garlic cloves, smashed", 
            "2 jalapenos, roughly chopped", 
            "Pinch of allspice", 
            "Salt to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/acorn-squash-quesadillas-tomatillo-salsa1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Tex-Mex", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2008/10/acorn-squash-quesadillas-tomatillo-salsa/", 
        "title": "acorn squash quesadillas + tomatillo salsa", 
        "directions": [
            "Puree all ingredients together until very smooth either in a blender or food processor. Season with salt."
        ], 
        "date": "2008-10-07T15:16:52+00:00"
    }, 
    {
        "ingredient_list": [
            "Pudding", 
            "1 3/4 cups (from a 15-ounce can, 415 grams) pumpkin puree (unsweetened; not pumpkin pie filling)", 
            "1/2 cup (100 grams) granulated sugar", 
            "1 teaspoon (2 grams) ground cinnamon", 
            "1/2 teaspoon (3 grams) table salt", 
            "1/2 teaspoon ground ginger", 
            "1/4 teaspoon ground cloves", 
            "1 cup (237 ml) whole milk", 
            "1/2 cup (118 ml) heavy cream", 
            "2 large eggs, lightly beaten", 
            "Topping", 
            "1 cup (227 grams) sour cream", 
            "1 tablespoon (13 grams) granulated sugar", 
            "1/4 teaspoon (1 ml) vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/11/baked-pumpkin-puddings-with-sour-cream.jpg?w=750", 
        "tags": [
            "Fall", 
            "Gluten-Free", 
            "Photo", 
            "Pudding", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2011/11/baked-pumpkin-and-sour-cream-puddings/", 
        "title": "baked pumpkin and sour cream puddings", 
        "directions": [
            "Preheat oven to 350°F.", 
            "The quickest method: In a medium bowl, whisk together all of the pudding ingredients.", 
            "For creamier, silkier pudding: Combine pumpkin, sugar, salt and spices in a food processor and blend for 30 seconds. Transfer to a saucepan and heat over medium-high. Once glurping and simmering in the pot, cook for another 5 minutes, stirring frequently. The mixture will thicken and get a bit darker. Reduce heat slightly and whisk in milk and cream. Off the heat, slowly whisk in eggs.", 
            "Both methods: Divide between 7 to 8 (I had just shy of enough to make eight 1/2-cup puddings) ovenproof 6-ounce pudding cups or ramekins on a baking sheet. Bake for 35 to 40 minutes, until puddings barely jiggle when shimmied and/or a knife tip inserted into the center of puddings comes out clean. Try not to overbake.", 
            "While they bake, combine topping ingredients in a small bowl. When the puddings are cooked through, transfer to a cooling rack on the counter and leave oven on. Spoon 2 tablespoons of sour cream mixture onto first pudding and use a small offset spatula, butter knife or spoon to quickly (it will get melty fast) spread it over the top of the first pudding. Repeat with remaining puddings.", 
            "Return puddings to oven for 5 more minutes, then cool completely at room temperature, about 1 to 2 hours. Chill until ready to serve. Eat with a gingersnap."
        ], 
        "date": "2011-11-16T11:27:48+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/11/black-bean-pumpkin-soup.jpg?w=750", 
        "tags": [
            "Beans", 
            "Fall", 
            "Gluten-Free", 
            "Photo", 
            "Pumpkin", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2007/11/black-bean-pumkin-soup/", 
        "title": "black bean pumpkin soup", 
        "directions": [
            "Garnish: sour cream and coarsely chopped lightly toasted pumpkin seeds ", 
            "In a food processor coarsely puree beans and tomatoes.", 
            "In a 6-quart heavy kettle cook onion, shallot, garlic, cumin, salt, and pepper in butter over moderate heat, stirring, until onion is softened and beginning to brown. Stir in bean puree. Stir in broth, pumpkin, and Sherry until combined and simmer, uncovered, stirring occasionally, 25 minutes, or until thick enough to coat the back of a spoon.", 
            "Just before serving, add ham and vinegar and simmer soup, stirring, until heated through. Season soup with salt and pepper.", 
            "Serve soup garnished with sour cream and toasted pumpkin seeds. "
        ], 
        "date": "2007-11-07T00:48:37+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups all-purpose flour", 
            "1/4 teaspoon salt", 
            "8 tablespoons (1 stick) unsalted butter, cut into", 
            "pieces", 
            "1/4 cup sour cream or plain yogurt", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup ice water", 
            "For the filling:", 
            "1 small butternut squash (about one pound)", 
            "2 tablespoons olive oil", 
            "1 to 2 tablespoons butter (if you have only non-stick, the smaller amount will do)", 
            "1 large onion, halved and thinly sliced in half-moons", 
            "1 teaspoon salt", 
            "Pinch of sugar", 
            "1/4 teaspoon cayenne, or to taste", 
            "3/4 cup fontina cheese (about 2 1/2 ounces), grated or cut into small bits", 
            "1 1/2 teaspoons chopped fresh sage leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/10/butternut-squash-and-caramelized-onion-galette.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Onions", 
            "Photo", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2007/10/butternut-squash-and-caramelized-onion-galette/", 
        "title": "butternut squash and caramelized onion galette", 
        "directions": [
            "1.\tMake pastry: In a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour.", 
            "2.\tPrepare squash: Preheat oven to 375 degrees F. Peel squash, then halve and scoop out seeds. Cut into a 1/2-inch dice. Toss pieces with olive oil and a half-teaspoon of the salt and roast on foil lined (for neatness sake) sheet for 30 minutes or until pieces are tender, turning it midway if your oven bakes unevenly. Set aside to cool slightly. ", 
            "3.\tCaramelize onions: While squash is roasting, melt butter in a heavy skillet and cook onion over low heat with the remaining half-teaspoon of salt and pinch of sugar, stirring occasionally, until soft and lightly golden brown, about 20 minutes. Stir in cayenne. ", 
            "4.\tRaise the oven temperature to 400 degrees. Mix squash, caramelized onions, cheese and herbs together in a bowl.", 
            "5.\tAssemble galette: On a floured work surface, roll the dough out into a 12-inch round. Transfer to an ungreased baking sheet. Spread squash, onions, cheese and herb mixture over the dough, leaving a 1 1/2-inch border. Fold the border over the squash, onion and cheese mixture, pleating the edge to make it fit. The center will be open.", 
            "6.\tBake until golden brown, 30 to 40 minutes. Remove from the oven, let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature. Serves 6."
        ], 
        "date": "2007-10-11T09:30:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium butternut squash (about 2 pounds)", 
            "5 to 6 tablespoons olive oil, divided", 
            "Salt and freshly ground black pepper, to taste", 
            "1 cup semi-pearled farro (see Note up top)", 
            "1/3 cup toasted pepitas (I used, and love, the salted ones)", 
            "3 ounces ricotta salata or another salty cheese, crumbled or coarsely grated (about 3/4 cup)(omit to make vegan)", 
            "1 tablespoon sherry vinegar", 
            "1 tablespoon water", 
            "1/2 teaspoon table salt", 
            "1/2 teaspoon granulated sugar", 
            "1/2 small red onion, finely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/butternut-squash-salad-with-farro-and-pepitas1.jpg?w=500", 
        "tags": [
            "Fall", 
            "Grain/Rice", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Vegan", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2012/10/butternut-squash-salad-with-farro-and-pepitas/", 
        "title": "butternut squash salad with farro and pepitas", 
        "directions": [
            "Preheat oven to 375 degrees F. ", 
            "Peel squash, then halve lengthwise and scoop out seeds. Cut squash into approximately 3/4-inch chunks. Coat one large or two small baking sheets with 2 tablespoons oil total. Spread squash out in single layer on sheet. Sprinkle with salt and freshly ground black pepper. Roast until pieces are tender, about 30 to 40 minutes, turning them over halfway through the cooking time. Set aside to cool slightly.", 
            "While squash is roasting, cook farro in a large pot of simmering salted water until the grains are tender but chewy, about 30 minutes. (Since there are so many varieties of farro, however, if your package suggests otherwise, it’s best to defer to its cooking suggestion.) Drain and cool slightly.", 
            "While squash is roasting and farro is simmering, in a small bowl, whisk together sherry vinegar, water, 1/2 teaspoon table salt and granulated sugar until sugar and salt dissolve. Stir in onion; it will barely be covered by vinegar mixture but don’t worry. Cover and set in fridge until needed; 30 minutes is ideal but less time will still make a lovely, lightly pickled onion.", 
            "In a large bowl, mix together butternut squash, farro, red onion and its vinegar brine, the crumbled cheese and pepitas. Toss with 3 tablespoons of the remaining olive oil, use the 4th one only if needed. Taste and adjust seasonings. Eat now or later. Salad keeps in the fridge for up to a week."
        ], 
        "date": "2012-10-23T11:28:02+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/bourbon-pumpkin-cheesecake.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Cake", 
            "Celebration Cakes", 
            "Photo", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2006/11/candy-corn-for-really-lucky-grown-ups/", 
        "title": "bourbon pumpkin cheesecake", 
        "directions": [
            "Garnish: pecan halves ", 
            "Make crust: Invert bottom of a 9-inch springform pan (to create flat bottom, which will make it easier to remove cake from pan), then lock on side and butter pan.", 
            "Stir together crumbs, pecans, sugars, and butter in a bowl until combined well. Press crumb mixture evenly onto bottom and 1/2 inch up side of pan, then chill crust, 1 hour.", 
            "Make filling and bake cheesecake: Put oven rack in middle position and Preheat oven to 350°F.", 
            "Whisk together pumpkin, eggs, brown sugar, cream, vanilla, and liqueur (if using) in a bowl until combined.", 
            "Stir together granulated sugar, cornstarch, cinnamon, nutmeg, ginger, and salt in large bowl. ", 
            "Add cream cheese and beat with an electric mixer at high speed until creamy and smooth, about 3 minutes. Reduce speed to medium, then add pumpkin mixture and beat until smooth.", 
            "Pour filling into crust, smoothing top, then put springform pan in a shallow baking pan (in case springform leaks). Bake until center is just set, 50 to 60 minutes. Transfer to rack and cool 5 minutes. (Leave oven on.)", 
            "Make topping: Whisk together sour cream, sugar, and liqueur (if using) in a bowl, then spread on top of cheesecake and bake 5 additional minutes.", 
            "Cool cheesecake completely in pan on rack, about 3 hours.", 
            "Chill, covered, until cold, at least 4 hours. Remove side of pan and bring to room temperature before serving.", 
            "Do ahead: Baked cheesecake can be chilled, covered, up to 2 days."
        ], 
        "date": "2006-11-22T14:12:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small head of cauliflower (about 1 pound) or 1 pound of a larger head of cauliflower, cut into 1-inch flowerets (Romanesco cauliflower, especially orange or green, would be a pretty substitute)", 
            "3 1/2 tablespoons olive oil", 
            "1 tablespoon truffle oil or a few pinches of truffle salt (optional) (see Notes below)", 
            "1 refrigerated pie crust or a homemade tart shell (recipe below)", 
            "1 large onion, halved lenghtwise and thinly sliced", 
            "1 tablespoon Dijon mustard", 
            "2 large eggs", 
            "1 (7- to 8- ounce) container mascarpone cheese (see Note below for suggested substitutions)", 
            "1/2 cup whipping cream (although any low- or full-fat milk or light cream will work as well)", 
            "1/4 teaspoon ground white or black pepper", 
            "Pinch of ground nutmeg", 
            "1 cup grated Gruyère cheese (Swiss or Comté are great swaps)", 
            "1/3 cup Parmesan cheese", 
            "1 1/4 cups flour", 
            "1 tablespoon plus 2 teaspoons cornstarch", 
            "1/4 teaspoon salt", 
            "6 tablespoons butter, diced", 
            "1 egg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/02/cauliflower-and-caramelized-onion-tart.jpg?w=753", 
        "tags": [
            "Cauliflower", 
            "Freezer Friendly", 
            "Onions", 
            "Photo", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2010/02/cauliflower-and-caramelized-onion-tart/", 
        "title": "cauliflower and caramelized onion tart", 
        "directions": [
            "In a large bowl, combine the flour, cornstarch and one-fourth teaspoon salt. Cut the butter in with a pastry blender, fork or two knives until it is in very tiny bits. Add one egg and mix with a fork until a dough forms. If this does not happen easily, toss it out onto a counter and knead it together. This dough is rather tough but with a little elbow grease, it does come together nicely. (Dough can also be made in a food processor, or as the original recipe suggests, in a stand mixer, though I have not tested in in the latter.)", 
            "On a lightly floured surface, roll the dough out to a 12-inch circle. Place the dough in a 9-inch pie plate or tart pan and press to remove any air bubbles. Crimp the edges, and refrigerate for 30 minutes. Proceed with a filling of your choice, no parbaking required."
        ], 
        "date": "2010-02-19T12:26:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium cauliflower (1 1/2 pounds, 23 to 24 ounces or 650 to 700grams)", 
            "1 large red onion, peeled", 
            "7 1/2 tablespoons (100 grams or 3.5 ounces) olive oil (I used 5 tablespoons, see Note up top)", 
            "1/2 teaspoon finely chopped rosemary", 
            "10 medium or 8 large eggs", 
            "Handful (3/4 ounce or 20 grams) basil, chopped", 
            "Scant 1 1/2 cups (180 grams or 6.3 ounces) all-purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "1/2 teaspoon ground turmeric", 
            "2 cups finely grated parmesan cheese (200 grams or 7 3/4 ounces, see Note up top) or about 1 generous cup of grated Romano cheese", 
            "Salt and black pepper", 
            "Butter, for greasing pan", 
            "2 tablespoons black sesame seeds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cauliflower-and-parmesan-cake1.jpg?w=500", 
        "tags": [
            "Cauliflower", 
            "Eggs", 
            "Fall", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/10/cauliflower-and-parmesan-cake/", 
        "title": "cauliflower and parmesan cake", 
        "directions": [
            "Preheat oven to 350°F (180°C) degrees. Break cauliflower into medium florets (this will cause less mess than chopping it). Place floret in a pot with a teaspoon of salt, cover them with water and simmer for 15 to 20 minutes, until quite soft. Strain and let drip in the colander for a few minutes so they dry and cool.", 
            "Meanwhile, prepare the batter. Halve your red onion and cut a few thin rings off the end of one side; set them aside. Coarsely chop the remainder of your onion. Heat all of your olive oil in a saucepan (I won’t tell if you use the one where you cooked your cauliflower) and saute the chopped red onion and rosemary together until soft, about 8 minutes. Remove from heat and allow to cool.", 
            "Whisk eggs and olive oil and onion mixture together. Stir in basil. Whisk flour, baking powder, turmeric, cheese, 1 1/2 teaspoons salt (use 1 teaspoon if you are nervous about this amount) and many, many grinds of black pepper together in a separate bowl and add to egg mixture, whisking to remove lumps. Stir in cauliflower gently, so most pieces remain intact.", 
            "Line the bottom of a 9-inch (24cm) round springform pan with parchment paper. Butter the sides generously. Put the sesame seeds in the pan and toss them around so that they stick to the sides. Pour in the cauliflower batter, arrange the reserved onion rings on top and bake cake in the center of the oven for 45 minutes, until golden brown and set.", 
            "Serve warm or at room temperature. Before you serve the cake, be sure to run a knife around the pan. This was probably the first time in my life I forgot, and several parts of the seed-crusted sides tore off!"
        ], 
        "date": "2010-10-20T12:57:42+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup + 3 tablespoons olive oil", 
            "1 teaspoon minced fresh rosemary", 
            "2 tablespoons fresh lemon juice", 
            "1 tablespoon red wine vinegar", 
            "1 1/2 teaspoons salt", 
            "1/2 teaspoon ground black pepper", 
            "1 medium head of cauliflower, trimmed, cut into small florets (about 3 cups)", 
            "1 (15-ounce) can kidney beans, drained", 
            "2 large heads of Belgian endive, trimmed, halved lengthwise, then thinly sliced crosswise", 
            "1 tablespoon chopped fresh chives", 
            "2 teaspoons chopped fresh parsley", 
            "1/2 cup crumbled feta cheese (about 3 ounces)", 
            "1 cup coarsely chopped walnuts, toasted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cauliflower-bean-and-feta-salad1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Cauliflower", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/04/cauliflower-bean-and-feta-salad/", 
        "title": "cauliflower, bean and feta salad", 
        "directions": [
            "Preheat oven to 400°F. Toss cauliflower florets with 3 tablespoons olive oil and season well with salt and pepper. Spread on a baking sheet and roast until edges are dark and caramelized, about 20 to 25 minutes, stirring once or twice.", 
            "While cauliflower is roasting, combine remaining 1/3 cup olive oil and rosemary in small saucepan. Stir over medium heat just until fragrant, about 1 minute. Cool.", 
            "Whisk lemon juice, vinegar, lemon peel, salt, and pepper in small bowl. Combine roasted, still warm cauliflower, beans, endive, chives, parsley, walnuts and rosemary oil in medium bowl; toss. Mix in cheese. Add lemon juice mixture and toss to coat. Season salad with salt and pepper."
        ], 
        "date": "2008-04-23T17:17:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium head (about 2 to 2 1/4 pounds) cauliflower", 
            "4 tablespoons (55 grams or 2 ounces) unsalted butter", 
            "4 tablespoons (30 grams or 1 ounce) all-purpose flour", 
            "2 teaspoons mustard powder", 
            "Salt, to taste", 
            "Freshly ground black pepper or ground cayenne", 
            "2 cups (475 ml) milk, whole is best but low-fat will probably work just fine", 
            "1 1/4 cups plus 2 tablespoons (about 155 grams or 5 1/2 ounces total) grated cheddar, the strongest you can get, preferably English or Irish", 
            "Chopped chives or flat-leaf parsley, for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-cheese1.jpg?w=640", 
        "tags": [
            "British", 
            "Cauliflower", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/10/cauliflower-cheese/", 
        "title": "cauliflower cheese", 
        "directions": [
            "Heat oven to 400 degrees.", 
            "Trim cauliflower and remove tough core. Cut into 1 to 2-inch florets. Steam (for about 10 minutes) or par-boil (6 to 7 minutes) florets until firm but tender. Drain, if needed, and spread florets on a towel so that it can wick out as much moisture as possible", 
            "Meanwhile, in a medium saucepan, melt butter over medium-high heat. Add flour and whisk to combine; cook for 1 minute to ensure you get rid of the floury taste. Add mustard powder and a pinch of cayenne or few grinds of black pepper, and stir to combine. Drizzle in milk in a thin, steady stream, whisking the whole time so that no lumps form. Season with salt and bring mixture to a simmer, stirring with a spoon; mixture should thicken. Stir in 1 1/4 cups cheddar, a handful at a time, letting each handful melt before adding the next. Taste sauce and adjust seasonings if needed.", 
            "Spread cauliflower florets in a 2-quart baking ovenproof baking dish. Spoon sauce over florets and sprinkle with remaining 2 tablespoons cheese. Bake until until bronzed and bubbly, about 30 minutes. For reference, f I wasn’t in such a rush to get dinner out on the table, I’d have baked mine a minute or two longer, up to 35 minutes.", 
            "Sprinkle with herbs, if desired. Eat with abandon.", 
            "P.S. A hat tip to Kate, who reminded me earlier this week that this site is way overdue for cauliflower cheese, and immediately solving my what-to-make-for-dinner crisis du jour."
        ], 
        "date": "2014-10-23T12:03:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small head cauliflower (1 pound florets, i.e. stems and leaves removed), cut into generous 1 to 2 inch chunks", 
            "1 large egg", 
            "1 garlic clove, minced", 
            "Few gratings of fresh lemon zest", 
            "3 ounces crumbled feta (about 1/2 cup)", 
            "1/2 cup all-purpose flour", 
            "1/4 teaspoon Aleppo pepper flakes; less if using regular red pepper flakes, which are hotter", 
            "3/4 teaspoon table salt or more to taste", 
            "1/2 teaspoon baking powder", 
            "Olive oil for frying", 
            "To serve", 
            "3/4 cup yogurt", 
            "1/2 teaspoon ground cumin", 
            "Salt and pepper to taste", 
            "Handful pomegranate arils"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/12/cauliflower-feta-fritters-with-pomegranate.jpg?w=751", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cauliflower", 
            "Lunch", 
            "Photo", 
            "Pomegranate", 
            "Snack", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/12/cauliflower-feta-fritters-with-pomegranate/", 
        "title": "cauliflower-feta fritters with pomegranate", 
        "directions": [
            "Cook cauliflower in simmering salted water, uncovered, until tender, about 5 to 6 minutes, until firm but tender. Using a slotted spoon, transfer to a bowl of ice water to stop cooking. Drain well. Spread on towels to dry as much as possible.", 
            "In the bottom of a large bowl, whisk together egg, garlic and lemon zest. Add cauliflower florets and mash with a potato masher until they’re crushed into an average of pea-sized pieces (i.e. some will be bigger, some smaller, but most will be little nubs). Sprinkle in feta and stir to combine egg mixture, cauliflower and feta. In a small dish, whisk flour, salt, pepper and baking powder until evenly combined. Sprinkle over cauliflower batter and stir just until combined.", 
            "Heat oven to 200 degrees F and place a tray inside. On the stove, heat a large, heavy skillet over moderate heat. Once hot, add a good slick of oil, about 2 to 3 tablespoons. Once the oil is hot (you can test it by flicking a droplet of water into it; it should hiss and sputter), scoop a two tablespoon-size mound of the batter and drop it into the pan, then flatten it slightly with your spoon or spatula. Repeat with additional batter, leaving a couple inches between each. Once brown underneath, about 2 to 3 minutes, flip each fritter and cook on the other side until equally golden, about another 1 to 2 minutes.", 
            "Transfer briefly to paper towels to drain, then the tray in the oven to keep them warm until needed. Once all fritters are cooked, mix yogurt with cumin, salt and pepper. Spread fritters on serving platter. Dollop each with cumin yogurt and sprinkle with pomegranate arils.", 
            "Do ahead: Fritters both freeze and reheat well. To warm and recrisp them, lay them on a tray and toast them at 400 degrees in the oven until crisp again."
        ], 
        "date": "2012-12-04T10:13:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (3-pound) head cauliflower, cut into large florets", 
            "Kosher salt", 
            "4 tablespoons (1/2 stick) unsalted butter, divided", 
            "3 tablespoons all-purpose flour", 
            "2 cups hot milk", 
            "1/2 teaspoon freshly ground black pepper", 
            "1/4 teaspoon grated nutmeg", 
            "3/4 cup freshly grated Gruyere, divided", 
            "1/2 cup freshly grated Parmesan", 
            "1/2 cup fresh bread crumbs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/11/cauliflower-gratin.jpg?w=753", 
        "tags": [
            "Cauliflower", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2008/11/cauliflower-gratin/", 
        "title": "cauliflower gratin", 
        "directions": [
            "Preheat the oven to 375 degrees F.", 
            "Cook the cauliflower florets in a large pot of boiling salted water for 5 to 6 minutes, until tender but still firm. Drain.", 
            "Meanwhile, melt 2 tablespoons of the butter in a medium saucepan over low heat. Add the flour, stirring constantly with a wooden spoon for 2 minutes. Pour the hot milk into the butter-flour mixture and stir until it comes to a boil. Boil, whisking constantly, for 1 minute, or until thickened. Off the heat, add 1 teaspoon of salt, the pepper, nutmeg, 1/2 cup of the Gruyere, and the Parmesan.", 
            "Pour 1/3 of the sauce on the bottom of an 8 by 11 by 2-inch baking dish. Place the drained cauliflower on top and then spread the rest of the sauce evenly on top. Combine the bread crumbs with the remaining 1/4 cup of Gruyere and sprinkle on top. Melt the remaining 2 tablespoons of butter and drizzle over the gratin. Sprinkle with salt and pepper. Bake for 25 to 30 minutes, until the top is browned. Serve hot or at room temperature."
        ], 
        "date": "2008-11-23T20:03:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small firm head cauliflower or broccoflower, about 12 ounces", 
            "1 hard-cooked egg", 
            "Sherry vinaigrette (below)", 
            "2 scallions, including an inch of the greens, thinly sliced", 
            "1 cup diced celery heart with leaves", 
            "1 small green bell pepper, thinly sliced", 
            "1 small cucumber, peeled, seeded, and chopped", 
            "12 pimiento-stuffed Spanish green olives, halved", 
            "1 tablespoon capers, rinsed", 
            "1/2 cup parsley leaves", 
            "1 or 2 garlic cloves, coarsely chopped", 
            "salt and freshly milled pepper", 
            "1 1/2 tablespoons sherry vinegar or aged red wine vinegar", 
            "1 teaspoon Dijon mustard", 
            "6 tablespoons extra-virgin olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cauliflower-salad-with-green-olives-and-capers1.jpg?w=500", 
        "tags": [
            "Cauliflower", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/11/cauliflower-salad-with-green-olives-and-capers/", 
        "title": "cauliflower salad with green olives and capers", 
        "directions": [
            "Pound the garlic with 1/4 teaspoon salt in a mortar until it breaks down into a puree. Combine the garlic, vinegar, and mustard in a small bowl, then whisk in the oil and season with pepper. Taste and correct the balance."
        ], 
        "date": "2008-11-05T20:58:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup thinly sliced almonds", 
            "Juice of half a lemon (about 1 tablespoon), plus more to taste", 
            "1 tablespoon white wine vinegar", 
            "1/4 teaspoon fine sea salt or table salt, then more to taste", 
            "3 tablespoons (30 grams) dried currants", 
            "5 tablespoons olive oil, plus more for frying", 
            "2 tablespoons (about 25 grams) brined or salt-packed capers", 
            "oil for frying", 
            "1 small, compact-looking head of cauliflower (about 1 1/4 pounds)", 
            "Freshly ground black pepper", 
            "3 scallions, thinly sliced (use green and white parts)", 
            "2 tablespoons chopped flat-leaf parsley (optional, mostly for color)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-slaw1.jpg?w=640", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/cauliflower-slaw/", 
        "title": "cauliflower slaw", 
        "directions": [
            "Heat oven to 350 degrees F. Spread almonds on a tray and toast them until they’re a deep golden color, tossing them once or twice to ensure even cooking. This will take 10 to 14 minutes. Set aside to cool.** ", 
            "Meanwhile, place lemon juice, vinegar and 1/4 teaspoon salt in a small bowl. Add currants; set aside and let them soak while you prepare the other ingredients. ", 
            "If using brined capers, drain and spread them on paper towels until most of their moisture has wicked out, about 5 minutes. If using salt-packed capers, soak them in water for 10 minutes to remove the saltiness, then drain, rinse and pat dry on paper towels. Pour a 1/2-inch of olive oil or another oil that you prefer to fry in in a small skillet or saucepan. Heat it over medium-high. When hot enough that a droplet of water added to the oil hisses, carefully add the capers and step back — they’re going to sputter a bit for the first 10 seconds. Once it’s safe to get closer, give them a stir. Depending on how dry they were, it can take 1 to 2 minutes for them to get lightly golden at the edges and then crisp. Remove with a slotted spoon. Drain on paper towels.", 
            "Trim cauliflower leaves and cut head into quarters. Using an adjustable-blade slicer (this is mine; it takes up very little room) to cut cauliflower, stem and florets, into 1/4-inch slices. Add to a large bowl. ", 
            "Scoop currants from vinegar mixture with a slotted spoon and add to bowl with cauliflower, along with almonds, capers, scallions and parsley. Slowly whisk 5 tablespoons olive oil into remaining vinegar mixture in a thin stream. Add several turns of freshly ground black pepper. Pour over cauliflower and other ingredients and turn gently to coat all pieces. Taste and adjust seasonings, adding more lemon juice, salt or pepper to taste. Dig in!", 
            "** P.S. I really tried to avoid this pesky oven step by toasting mine in a skillet, the one I’d use to fry the capers in a few minutes. Twice, I failed because the little bits got black and smoky before the larger ones toasted, no matter how much I kept them moving. I’m pretty sure I could do better in the future, but I was running out of almonds. If you trust your pan-toasting skills, feel free to cook the almonds there instead."
        ], 
        "date": "2014-09-16T11:56:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1 head cauliflower, trimmed of leaves", 
            "1 1/2 tablespoons butter or olive oil", 
            "3 tablespoons fresh soft bread crumbs", 
            "1 tablespoon plus 1 teaspoon extra virgin olive oil", 
            "3 tablespoons whole almonds", 
            "Salt and freshly ground black pepper", 
            "2 tablespoons golden raisins (I had only dark ones on hand, nobody complained)", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon capers, rinsed and drained", 
            "1 teaspoon finely chopped parsley", 
            "1 teaspoon finely chopped tarragon", 
            "1 teaspoon finely sliced chives."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cauliflower-with-almonds-raisins-and-capers1.jpg?w=500", 
        "tags": [
            "Cauliflower", 
            "Photo", 
            "Side Dish", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/10/cauliflower-with-almonds-raisins-and-capers/", 
        "title": "cauliflower with almonds, raisins and capers", 
        "directions": [
            "1. Preheat oven to 350 degrees. Cut cauliflower from top to bottom in 1-inch slices. Place a large ovenproof skillet over low heat and add one tablespoon butter. When it has melted, add bread crumbs and toss until toasted and golden brown, about 3 minutes. Transfer crumbs to a plate and wipe out pan.", 
            "2. Return pan to medium heat and add one teaspoon olive oil. Add almonds and toss until lightly browned, 2 to 3 minutes. Season lightly with salt and pepper to taste. Transfer almonds to a plate, let cool, and cut each almond into three pieces*; set aside.", 
            "3. Wipe out pan and return to medium heat. Add remaining one tablespoon olive oil and cauliflower slices. Sauté until lightly browned on both sides. Transfer pan to oven and roast until tender, about 12 minutes. (I had to brown my cauliflower in batches, not having enough surface area in my pan, but tossed everything back in to roast it.) Meanwhile, in a small saucepan over low heat, melt remaining 1/2 tablespoon butter and add raisins, vinegar and 1 tablespoon water. Simmer until raisins are plump and soft, about 5 minutes; drain and set aside. In a small bowl, combine almonds, capers, raisins, parsley, tarragon and chives. Season with salt and pepper and toss to mix.", 
            "4. Arrange roasted cauliflower on a serving platter. Spoon almond-herb mixture evenly on top and sprinkle with toasted bread crumbs. Serve immediately.", 
            "* I read this step and laughed and laughed. Yes, SURE. Let’s all cut our almonds into thirds! Anyone have a scalpel and some tweezers? Impossible! And then the strangest thing happened: I stopped rolling my eyes — “chef recipes!” — long enough to try it and it turns out with a sharp knife one can absolutely cut almonds into thirds. This isn’t to say that you must, unless you’re feeling fancy. You are more than welcome to cut yours into halves or fifths or even roughly chop them and I won’t tell a soul. It can be our little secret."
        ], 
        "date": "2009-10-22T12:18:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium head cauliflower (1 1/2 to 2 pounds)", 
            "Oil for pan, if roasting", 
            "4 tablespoons salted or unsalted butter", 
            "1 medium or 2 tiny shallots, finely minced", 
            "1 small clove garlic, minced", 
            "Approximately 3/4 cup panko (Japanese-style) breadcrumbs", 
            "Salt and freshly ground black pepper", 
            "Few gratings of lemon zest", 
            "1 to 2 tablespoons fresh lemon juice", 
            "1 tablespoon chopped flat-leaf parsley or chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cauliflower-with-brown-butter-breadcrumbs1.jpg?w=640", 
        "tags": [
            "Brown Butter", 
            "Cauliflower", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/cauliflower-with-brown-butter-crumbs/", 
        "title": "cauliflower with brown butter crumbs", 
        "directions": [
            "To steam cauliflower: Set a steamer basket (see Notes) inside a large pot. Bring about one inch of water to a boil in the pot, lower cauliflower, whole or in large florets, into basket, and cover pot with lid. Reduce heat to medium. Let cauliflower steam for 10 to 20 minutes (less time if using a proper steamer basket, longer if using the modified basket below), or until it is easily pierced with a knife.   ", 
            "To roast cauliflower: Heat oven to 400 degrees. Lightly coat a large baking sheet with oil. Scatter cauliflower florets evenly over pan and roast until cauliflower is brown at edges and easily pierced with a knife, about 20 to 30 minutes. Toss and flip pieces once, halfway through roasting time, to ensure that they brown easily.", 
            "Make brown butter crumbs: When cauliflower is almost done, melt butter in a heavy frying pan over medium heat, and continue to cook it after it is melted until it is a little brown, and smells toasty. Working quickly, stir in the shallots, and let them hiss in the butter for about 30 seconds. Add the breadcrumbs, garlic, 1/4 teaspoon table salt (if using unsalted butter, skip if using salted) and a few grinds of black pepper and cook together, stirring frequently, until crumbs are a shade darker, anywhere from 5 to 10 minutes. Add a scrape or two of lemon zest and adjust seasonings to taste.", 
            "Assemble dish: Place whole cooked cauliflower or cauliflower florets in a low serving bowl. Toss gently with lemon juice, salt and pepper to taste. Spoon crumbs over cauliflower, pressing them onto the florets as you can, and letting the rest fall into the serving dish. Scatter herbs over top and serve with a large spoon.", 
            "Do ahead: Steam or roast cauliflower and make crumbs; keep them separate until serving. Just before serving, rewarm cauliflower and add crumbs.", 
            "Many notes:"
        ], 
        "date": "2013-11-20T12:06:40+00:00"
    }, 
    {
        "ingredient_list": [
            "2 small or 1 large fresh poblano chiles", 
            "1 small head cauliflower, cored and cut into rough 1-inch chunks", 
            "Salt and freshly ground black pepper to taste", 
            "3 tablespoons olive oil, plus more for cooking quesadillas", 
            "3 scallions, thinly sliced", 
            "1 tablespoon lime juice", 
            "2 cups (about 8 ounces) coarsely grated monterey jack cheese", 
            "12 small (7-inch) flour tortillas", 
            "1/2 cup sour cream or Mexican crema", 
            "A few gratings fresh lime zest", 
            "1 tablespoon freshly squeezed lime juice", 
            "1/2 teaspoon ground cumin", 
            "Pinch of salt", 
            "1 bag coleslaw mix or (as used here) 3 cups finely shredded red cabbage and 1 coarsely grated carrot", 
            "Coarse salt", 
            "Juice of half a lime", 
            "2 scallions, sliced thin", 
            "A dollop of mayonnaise, sour cream or plain yogurt", 
            "A dash of hot sauce (optional)", 
            "1/4 cup roughly chopped cilantro or flat-leaf parsley leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/charred-cauliflower-quesadillas1.jpg?w=751", 
        "tags": [
            "Cauliflower", 
            "Peppers", 
            "Photo", 
            "Sandwich", 
            "Tex-Mex", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/02/charred-cauliflower-quesadillas/", 
        "title": "charred cauliflower quesadillas", 
        "directions": [
            "Toss cabbage mix, salt and lime together in a large bowl; set aside for 5 minutes. It will shrink down a bit. Stir in scallions, then mayo and hot sauce. Adjust seasonings/ingredients to taste, then stir in cilantro leaves. Serve alongside quesadillas or any of your favorite tortilla-clad meals. "
        ], 
        "date": "2015-02-02T11:54:41+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups (315 grams) flour", 
            "1 tablespoon (15 grams) sugar", 
            "1 teaspoon (5 grams) table salt", 
            "2 sticks (8 ounces, 225 grams tablespoons or 1 cup) unsalted butter, very cold", 
            "3 1/2 cups pumpkin puree, from 2 15-ounce (425 gram) cans or homemade", 
            "1 1/4 cups granulated sugar", 
            "1 teaspoon (6 grams) fine sea or table salt", 
            "2 teaspoons ground cinnamon", 
            "1 teaspoon ground ginger", 
            "1/4 teaspoon ground cloves", 
            "A few gratings of fresh nutmeg (or a pinch of ground nutmeg)", 
            "2 1/2 cups cold heavy cream, light cream or a combination of cream and milk", 
            "6 large eggs", 
            "8 ounces cream cheese, softened", 
            "1/3 cup sugar", 
            "1 large egg yolk", 
            "2 tablespoons heavy or light cream", 
            "1/4 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/cheesecake-marbled-pumpkin-slab-pie.jpg?w=750", 
        "tags": [
            "Fall", 
            "Photo", 
            "Pumpkin", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2016/11/cheesecake-marbled-pumpkin-slab-pie/", 
        "title": "cheesecake-marbled pumpkin slab pie", 
        "directions": [
            "\nMake the pie dough:", 
            "\nBy hand, with my one-bowl method: In the bottom of a large bowl, combine the flour, salt and sugar. Work the butter into the flour with your fingertips or a pastry blender until mixture resembles a coarse meal and the largest bits of butter are the size of tiny peas. (Some people like to do this by freezing the stick of butter and coarsely grating it into the flour, but I haven’t found the results as flaky.) Add 1/2 cup cold water and stir with a spoon or flexible silicone spatula until large clumps form. Use your hands to knead the dough together, right in the bottom of the bowl. If necessary to bring the dough together, you can add the last tablespoon of water.", 
            "With a food processor: In the work bowl of a food processor, combine flour, salt and sugar. Add butter and pulse machine until mixture resembles a coarse meal and the largest bits of butter are the size of tiny peas. Turn mixture out into mixing bowl. Add 1/2 cup cold water and stir with a spoon or flexible silicone spatula until large clumps form. Use your hands to knead the dough together, right in the bottom of the bowl. If necessary to bring the dough together, you can add the last tablespoon of water.\nBoth methods: Wrap dough in a sheet of plastic wrap and refrigerate for at least one hour, or up to 48 hours, or you can quick-firm this in the freezer for 15 minutes. Longer than 2 days, it’s best to freeze it until needed.\n\nGet ready to bake the pie: Heat oven to 400°F (205°C). Line a 10×15-inch jellyroll pan with a fitted rectangle of parchment paper.", 
            "Form the crust: On a lightly floured surface, roll out dough into a 13-by-18-inch rectangle (i.e. 3 inches bigger than your pan). Do your best to work quickly, keeping the dough as cold as possible (and tossing it in the freezer for a couple minutes if it softens too quickly) and using enough flour that it doesn’t stick to the counter.", 
            "Fold dough gently in half without creasing and transfer to prepared pan. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. Return pan to fridge until ready to fill.", 
            "Make pumpkin filling: Combine pumpkin, sugar, salt and spices in a medium saucepan over medium heat. Bring to a sputtering simmer and cook for 5 to 7 minutes, stirring frequently. Scoop cooked pumpkin filling into bowl, and whisk in cold cream until smooth. Whisk in eggs, one at a time. Pour filling into prepared pie crust.\nMarble cheesecake: Whisk cream cheese, sugar, egg yolk, cream and vanilla in a bowl until smooth. Dollop all over pumpkin batter and use a toothpick or chopstick to swirl decoratively in figure-8s, being very very careful not to drag the point of the toothpick/chopstick into the bottom crust, forming holes.\nBake pie: For 15 minutes, then reduce heat to 350°F (175°C) and bake for another 15 minutes, until only the center barely jiggles and a toothpick inserted into it comes out pumpkin-free. (Damp is fine, but the toothpick shouldn’t have loose pumpkin batter on it.)\nLet cool then chill in fridge until serving."
        ], 
        "date": "2016-11-16T13:09:00+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 1/4 cups (155 grams) all-purpose flour", 
            "1 1/2 teaspoons (6 grams) granulated sugar", 
            "1/2 teaspoon (3 grams) fine sea or table salt", 
            "1 stick (4 ounces or 115 grams) cold unsalted butter, cut into chunks", 
            "1/4 cup (60 ml) very cold water, plus an additional tablespoon if needed", 
            "Filling", 
            "1 3/4 cups pumpkin puree, from a 15-ounce (425 gram) can or homemade", 
            "2/3 cup (130 grams) granulated sugar", 
            "1/2 teaspoon (3 grams) fine sea or table salt", 
            "1 teaspoon ground cinnamon", 
            "1/2 teaspoon ground ginger", 
            "1/8 teaspoon ground cloves", 
            "A few gratings of fresh nutmeg (or a pinch of ground nutmeg)", 
            "1 1/3 cups (315 ml) cold heavy cream", 
            "3 large eggs", 
            "Topping", 
            "1/2 cup (95 grams) packed light or dark brown sugar", 
            "6 tablespoons (85 grams) unsalted butter", 
            "3 tablespoons (45 ml) heavy cream", 
            "1/4 teaspoon flaky sea salt, or a little less of a coarse salt", 
            "1 teaspoon (5 ml) vanilla extract", 
            "3/4 cup (85 grams) pecans (I coarsely chopped 1/2 cup, left the last 1/4 cup in halves)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/classic-pumpkin-pie-with-pecan-praline-sauce1.jpg?w=640", 
        "tags": [
            "Fall", 
            "Photo", 
            "Pumpkin", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2014/11/classic-pumpkin-pie-with-pecan-praline-sauce/", 
        "title": "classic pumpkin pie with pecan praline sauce", 
        "directions": [
            "Make the pie dough: ", 
            "Form the crust: On a floured counter, roll the dough out into a 12 to 13-inch circle-ish shape. Fold dough gently in quarters without creasing and transfer to a 9-inch standard (not deep-dish) pie plate. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. Return to fridge until ready to fill. (See Notes below for par-baking directions, if desired. I rarely desire this.)", 
            "Heat oven: To 400°F (205°C). ", 
            "Make the filling: Combine pumpkin, sugar, salt and spices in a medium saucepan over medium heat. Bring to a sputtering simmer and cook for 5 to 7 minutes, stirring frequently. Scoop cooked pumpkin filling into bowl, and whisk in cold cream until smooth. Whisk in eggs, one at a time. Pour filling into prepared pie crust.", 
            "Bake pie: For 15 minutes, then reduce heat to 350°F (175°C) and bake for another 30 to 40 minutes, until only the center barely jiggles and a toothpick inserted into it comes out pumpkin-free. (Damp is fine, but the toothpick shouldn’t have loose pumpkin batter on it.)", 
            "Let pie cool on a rack completely, if you, like me, prefer your pumpkin pie cool. You can hasten this along in the fridge. This pie is now ready to serve, but if you want to gild the lily a little, make the topping as well. ", 
            "Make pecan praline topping: In a small/medium saucepan set over medium-low heat, combine the brown sugar, butter, cream and salt. Bring to a simmer and cook until thick and bubbly, 3 to 5 minutes. Remove pan from heat and stir in vanilla and pecans. ", 
            "Serve pie: In wedges, ladles with pecan praline sauce. Extra pie (an unfamiliar phenomenon) keeps in the fridge for up to a week.", 
            "Notes:"
        ], 
        "date": "2014-11-17T11:45:00+00:00"
    }, 
    {
        "ingredient_list": [
            "200 grams (1 1/4 cups) red split lentils (masoor dal), picked over, washed and drained", 
            "1.2 liters (5 cups) water", 
            "1/2 teaspoon ground turmeric", 
            "5 tablespoons vegetable oil", 
            "1 teaspoon cumin seeds", 
            "2 to 4 cloves garlic, peeled and finely chopped", 
            "1 medium onion, peeled and cut into fine slices", 
            "225 grams (1/2 pound) cored and finely shredded cabbage", 
            "1 to 2 fresh, hot green chilies, finely sliced", 
            "1 1/2 teaspoons salt", 
            "1 medium tomato, peeled (ahem, Deb did not peel her tomato) and finely chopped", 
            "1/2 teaspoon peeled, finely grated fresh ginger", 
            "1 (1 3/4-lb) head cauliflower, cut into 3/4-inch-wide florets", 
            "1 1/4 lb Yukon Gold potatoes, peeled and cut into 1/2-inch cubes", 
            "5 tablespoons vegetable oil", 
            "1/2 teaspoon cumin seeds", 
            "3/4 teaspoon salt", 
            "1 medium onion, finely chopped", 
            "2 garlic cloves, finely chopped", 
            "2 teaspoons minced fresh jalapeño, including seeds", 
            "2 teaspoons minced peeled fresh ginger", 
            "1 teaspoon ground cumin", 
            "1/2 teaspoon ground coriander", 
            "1/4 teaspoon turmeric", 
            "1/4 teaspoon cayenne", 
            "1/2 cup water", 
            "1/4 cup finely chopped English (seedless cucumber)", 
            "1 thinly sliced scallion", 
            "3/4 cup yogurt", 
            "1/2 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/confessions-of-a-cumin-junkie1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Cabbage", 
            "Cauliflower", 
            "Gluten-Free", 
            "Indian", 
            "Photo", 
            "Potatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/02/confessions-of-a-cumin-junkie/", 
        "title": "recipes from a cumin junkie", 
        "directions": [
            "Mix!"
        ], 
        "date": "2007-02-26T21:39:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (210 grams) dried farro", 
            "3 cups water or broth", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "Olive oil", 
            "2 1/4 to 2 1/2 pound (1 to 1 1/8 kgs) head of cauliflower, cut into small florets", 
            "2 tablespoons finely chopped fresh sage leaves", 
            "2 tablespoons capers (brine-packed), drained", 
            "2 large or 3 regular cloves garlic, minced", 
            "1/2 teaspoon finely grated lemon zest", 
            "Crushed red pepper flakes, to taste", 
            "2 cups (6 ounces or 170 grams) coarsely grated, lightly packed Italian Fontina (Val d’Aosta variety, if you can find it) (buy about 8 ounces with rind)", 
            "1/2 cup (125 grams) ricotta cheese", 
            "1/2 cup (25 grams) panko (plain Japanese-style breadcrumbs)", 
            "1/3 cup (30 grams) finely grated pecorino romano cheese", 
            "2 tablespoons finely chopped fresh parsley leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/01/crusty-baked-cauliflower-and-farro.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Cauliflower", 
            "Freezer Friendly", 
            "Grain/Rice", 
            "Photo", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2017/01/crusty-baked-cauliflower-and-farro/", 
        "title": "crusty baked cauliflower and farro", 
        "directions": [
            "Cook farro: Rinse and drain farro. There are many, many ways to cook farro and any of them work here. You can follow the package directions on any farro you buy for best results.", 
            "On the stove: If you plan to cook this on the stove and want to save time, you can presoak the grains overnight in their 3 cups of liquid and they should then cook in only 10 minutes of simmering. Otherwise, simmer the farro in water or broth for about 30 minutes, until quite tender. Drain any excess liquid. Transfer farro to large bowl.\nIn a rice-cooker: I cook mine on the quick setting and have been very happy with the results. Drain any excess liquid once the farro is tender. Transfer farro to large bowl.\nMeanwhile, parcook cauliflower:\nIn the oven: Heat oven to 425 degrees. Brush a large baking sheet with 2 tablespoons olive oil. Spread florets in one layer, drizzle with 1 more tablespoon olive oil and sprinkle with salt and freshly ground black pepper. Roast for 20 minutes until lightly browned and crisp-tender (they will finish baking with the farro). Reduce heat to 400 degrees.", 
            "One the stove: Heat 2 tablespoons olive oil in a large saute pan over medium-high heat. Add half the cauliflower and cook, tossing occasionally, until lightly browned and tender, about 6 to 7 minutes. Add to bowl with farro. Repeat with more olive oil and second half of cauliflower, then add to bowl. Heat oven to 400 degrees.\nAssemble casserole: Add the sage, capers, garlic, lemon zest, red pepper flakes, 1 teaspoon salt and 1/2 teaspoon black pepper to cauliflower and farro and stir to combine. Stir in fontina. Transfer half of the mixture to an oiled 10-inch ovenproof frying pan or equivalent baking dish. Dollop rounded tablespoons of ricotta all over. Sprinkle remaining cauliflower and farro over the ricotta, leaving the pockets of it undisturbed.", 
            "In a small dish, combine panko with pecorino, parlsey and 1 tablespoon olive oil until evenly mixed. Sprinkle over cauliflower and farro.", 
            "Bake casserole: For 20 minutes, until browned and crusty on top. Dig in.\nDo ahead: Farro can be cooked up to 3 days in advance, kept in an airtight container in fridge. Cauliflower can be cooked 2 days in advance. Casserole can be assembled and baked a day later, easily, although the crumbs might lose their crisp from absorbing the moisture below if not added right before baking. Casserole keeps for several days in fridge and longer in freezer."
        ], 
        "date": "2017-01-13T12:58:52+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive oil, divided", 
            "1 large head cauliflower (mine was 1 3/4 pounds)", 
            "1 teaspoon whole cumin seeds", 
            "1/2 teaspoon kosher salt, plus additional", 
            "1/2 teaspoon freshly ground black pepper", 
            "Plain yogurt (I used whole milk yogurt, Greek style)", 
            "1/4 cup crumbled feta (optional)", 
            "Chopped fresh mint leaves, for serving", 
            "Pomegranate seeds, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cumin-seed-roasted-cauliflower-with-yogurt1.jpg?w=500", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Photo", 
            "Pomegranate", 
            "Quick", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/10/cumin-seed-roasted-cauliflower-with-yogurt/", 
        "title": "cumin seed roasted cauliflower with yogurt", 
        "directions": [
            "Preheat oven to 425°F. Brush a large baking sheet or roasting pan with 1 tablespoon of the olive oil.", 
            "Cut your cauliflower into bite-size florets but no need to make them all evenly sized. The smaller ones get more blistery, the bigger ones retain more texture and they’ll all be happy mingled together.  Toss florets with remaining olive oil, cumin seeds, salt and pepper and spread out on prepared tray. Roast for 20 to 30 minutes, until cauliflower is tender and its edges are toasty.", 
            "Either whisk a pinch of salt into your yogurt or to make feta-yogurt sauce blend 3/4 cup yogurt with feta in a food processor until smooth. Dollop on cauliflower then sprinkle dish with mint and pomegranate seeds. Eat immediately and vow to seriously make more effort in the lunch department if it can be this easy."
        ], 
        "date": "2011-10-20T14:48:04+00:00"
    }, 
    {
        "ingredient_list": [
            "Salad", 
            "3 tablespoons olive oil, possibly plus another spoonful", 
            "1 1/4 pound delicata squash (one medium)", 
            "1/2 pound brussels sprouts", 
            "Salt and freshly ground black pepper or Aleppo pepper flakes to taste", 
            "1 large pita bread", 
            "Kosher salt", 
            "2 scallions, thinly sliced", 
            "About 1 tablespoon mint leaves, finely chopped", 
            "About 1 tablespoon flat-leaf parsley or cilantro leaves, finely chopped", 
            "Additional ground sumac or paprika, to finish", 
            "Dressing", 
            "2 teaspoons ground sumac or paprika (see Note above)", 
            "2 teaspoons warm water", 
            "1 to 2 tablespoons lemon juice", 
            "1 small garlic clove, minced", 
            "1 teaspoon white wine vinegar", 
            "4 tablespoons olive oil", 
            "Salt and freshly ground black pepper or Aleppo pepper flakes to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/fall-toush-salad-with-delicata-and-brussels1.jpg?w=640", 
        "tags": [
            "Brussels Sprouts", 
            "Fall", 
            "Lunch", 
            "Middle Eastern", 
            "Photo", 
            "Vegan", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2014/10/fall-toush-salad/", 
        "title": "fall-toush salad", 
        "directions": [
            "Prepare vegetables:  Heat oven to 400F.  Coat two baking sheets with a tablespoon or so of olive oil each. ", 
            "Cut ends off delicata squash and scrape out seeds with a spoon. [Did you know you can toast these like pumpkin seeds for a crispy garnish? You can!] Slice squash into 1/2-inch rings, then cut each ring into 1 to 2-inch chunks (I cut each ring into 1/6ths). Spread on first baking sheet in one layer; sprinkle with salt and pepper. Roast for 20 to 25 minutes, until bronzed underneath, then flip and roast for another 10 to 13 minutes, until browned at the edges and tender in the center. Set aside to cool slightly.", 
            "Meanwhile, trim ends and any discolored leaves from brussels sprouts and halve them lengthwise.   Spread cut-side-down on second baking sheet; sprinkle with salt and pepper. Roast for 15 minutes, then flip sprouts and roast them for another 5 to 10 minutes, until toasty and crisp. Set aside to cool slightly.", 
            "Prepare pita chips:  Split pita into two layers and cut or tear into large bite-sized chunks. Toss in a bowl with a little less than 1 remaining tablespoon olive oil and a couple pinches of salt. Spread on a baking sheet (I reused my brussels sheet, because they were done first) and toast in oven with vegetables for 5 to 8 minutes, until golden and crisp.", 
            "Make dressing:  Soak sumac in water for 5 minutes, then whisk in remaining dressing ingredients. Adjust seasonings to taste; you may find you need more lemon juice or vinegar.", 
            "Assemble salad:  In a medium-large bowl, combine warm roasted vegetables and scallions. Toss with 1/2 to 2/3 dressing, or to taste. Stir in chopped herbs, then pita chips; add more dressing and adjust salt and pepper levels if needed. Sprinkle with sumac to finish, and serve.", 
            "To do ahead: I’d keep the roasted vegetables separate from the pita chips so they don’t get soggy. I’d expect the roasted vegetables to hold up pretty well with the dressing (although it’s going to mostly absorb) but if you’re worried, you can keep that separate until serving, too."
        ], 
        "date": "2014-10-13T19:52:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup hazelnuts or walnuts", 
            "1 medium-large fennel bulb, leaves and stems trimmed off", 
            "Salt and freshly ground black pepper", 
            "Juice of 1 lemon", 
            "2 large blood oranges", 
            "1 small shallot, peeled and cut into paper-thin slices", 
            "10 mint leaves", 
            "2 tablespoons extra-virgin olive oil", 
            "1 teaspoon lime zest "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/fennel-and-blood-orange-salad1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Fennel", 
            "Orange", 
            "Photo", 
            "Salad", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/02/fennel-and-blood-orange-salad/", 
        "title": "fennel and blood orange salad", 
        "directions": [
            "Place nuts in dry skillet and cook over medium heat, stirring, to toast. Let cool. If using hazelnuts, roll them around in a dishcloth (or, if cool enough, in your hands), discarding any loose skins. Coarsely chop nuts; set aside.", 
            "Slice about 1/2 inch from bottom of fennel and discard. Slice fennel very thinly on a mandonline, benriner or with a knife, starting with flat bottom side. Toss in serving bowl with salt, pepper and lemon juice. ", 
            "Trim all peel and pith from oranges. Holding peeled fruit over bowl containing fennel, use sharp knife to cut sections from membrane and let them drop into bowl. Squeeze remaining membrane over bowl to sprinkle salad with remaining juice, and discard membrane.Add shallots, mint leaves, olive oil and reserved nuts and toss gently. Sprinkle with lime zest. ", 
            "Do ahead: While the mint leaves will look and taste best on the first day, I really enjoyed the leftovers from this salad for lunch the next day."
        ], 
        "date": "2014-02-03T11:37:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups very thinly sliced fennel bulb", 
            "3 tablespoons extra-virgin olive oil, divided", 
            "1/4 teaspoon coarse kosher salt", 
            "6 cups arugula (about 4 ounces)", 
            "1 cup thinly sliced green onions", 
            "1/4 cup thinly sliced mint leaves", 
            "1 1/2 tablespoons balsamic vinegar", 
            "6 ounces thinly sliced prosciutto, torn into strips", 
            "1/2 cup pomegranate seeds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/fennel-prosciutto-and-pomegranate-salad1.jpg?w=500", 
        "tags": [
            "Fennel", 
            "Photo", 
            "Pomegranate", 
            "Salad", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/11/fennel-prosciutto-and-pomegranate-salad/", 
        "title": "fennel, prosciutto and pomegranate salad", 
        "directions": [
            "Toss fennel and 1 tablespoon olive oil in medium bowl. Sprinkle with 1/4 teaspoon salt. (Planning ahead? I did this a day in advance.)", 
            "Combine arugula, green onions, mint, vinegar, and 2 tablespoons olive oil in large bowl; toss. Season with salt and pepper.", 
            "Divide greens among plates. Top with fennel, then drape with prosciutto. Sprinkle pomegranate seeds over. (We did this totally out of order. We’re fired.)"
        ], 
        "date": "2008-11-10T23:03:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound green beans or haricot vert (skinny ones)", 
            "1/2 a fennel bulb (about 1/2 pound)", 
            "1 stalk celery, trimmed", 
            "1/2 medium red onion", 
            "1 tablespoon lemon juice", 
            "1/4 cup red wine vinegar", 
            "1/4 cup water", 
            "1 tablespoon kosher salt (I use Diamond brand; use less if you’re using Morton or table salt)", 
            "1 1/2 teaspoons sugar", 
            "1/3 cup (about 2 ounces) whole almonds", 
            "2 tablespoons plus 2 teaspoons olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/green-bean-salad-with-fried-almonds.jpg?w=750", 
        "tags": [
            "Easter", 
            "Fennel", 
            "Green Beans", 
            "Photo", 
            "Salad", 
            "Thanksgiving", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/02/green-bean-salad-with-pickled-red-onions-and-fried-almonds/", 
        "title": "green bean salad with fried almonds", 
        "directions": [
            "If you’ve got an adjustable blade slider, time to make it earn its keep! Very thinly slice half your fennel bulb, your celery and your half onion. If you don’t have a fancy slicer, just slice them thinly with a knife. Toss the fennel with lemon juice to prevent browning and also because it makes it extra delicious.", 
            "In a small bowl, whisk together the vinegar, water, salt and sugar together. Add the onions and set them aside for about an hour. If you don’t have an hour, 30 minutes will still pickle them to deliciousness but they will only get better with age.", 
            "Meanwhile, bring a large pot of salted water to boil. Trim and tail green beans, something I just discovered I could do with kitchen shears. For me, it was a time saver. Boil beans until crisp-tender, about 4 to 5 minutes for regular green beans and about 3 minutes for skinny ones (a.k.a. “haricot vert” — what I used). Plunge in an ice water bath. Drain and pat dry. (If you have no patience for the precision of ice water baths, take the green beans out a full minute early as they will continue cooking as they cool.)", 
            "Heat a small heavy skillet to medium heat and add one teaspoon olive oil. Add almonds and toss until lightly browned, 2 to 3 minutes. Season lightly with salt and pepper to taste. Transfer almonds to a plate, let cool, and cut each almond into half or thirds.", 
            "Assemble your salad: Toss green beans with most of fennel, all of celery and half of the pickled red onions. Sprinkle two tablespoons of the red onion pickling liquid and two tablespoons of olive oil over the mixture. Season generously with salt and pepper. Taste, adjust seasonings and ingredient levels to your preferences — we found we wanted more fennel, red onion and pickling liquid.", 
            "Serve, then eat, eat, eat. "
        ], 
        "date": "2011-02-16T21:35:45+00:00"
    }, 
    {
        "ingredient_list": [
            "For the croutons: ", 
            "1/4 cup unsalted butter", 
            "2 teaspoons finely chopped garlic", 
            "2 teaspoons finely chopped fresh thyme", 
            "6 cups day-old bread, crust removed, cubed", 
            "6 tablespoons finely grated Parmesan, plus more for garnish", 
            "Salt and freshly ground black pepper ", 
            "For the salad:", 
            "1 small red onion, sliced thinly lengthwise", 
            "3 tablespoons sherry vinegar", 
            "Gray salt", 
            "4 cups peeled, seeded, and diced butternut squash (1/2-inch dice)", 
            "1/2 cup plus 1 1/2 tablespoons extra-virgin olive oil", 
            "1 tablespoon chopped fresh sage", 
            "Freshly ground black pepper", 
            "1/2 pound Brussels sprouts, ends trimmed, then quartered", 
            "1/2 cup fresh Italian parsley leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/12/winter-panzanella.jpg?w=750", 
        "tags": [
            "Brussels Sprouts", 
            "Photo", 
            "Salad", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2006/12/holding-the-gray-salt/", 
        "title": "winter panzanella", 
        "directions": [
            "Preheat oven to 400°F. ", 
            "Melt the butter in a large skillet over moderate heat and cook until it foams. Add the garlic and thyme, and immediately add the bread cubes. Toss to coat well. Add most of the grated cheese and stir. Transfer bread to a baking sheet and sprinkle with the remaining cheese and salt and pepper and gently toss again while still warm to melt the cheese. Bake stirring once or twice, until the croutons are crisp and lightly colored on the outside but still soft within, about 10 to 15 minutes. Set aside and let cool. ", 
            "Soak the sliced onion in the sherry vinegar and a pinch of salt for about 15 minutes. Set aside. ", 
            "Toss the squash with 1 1/2 tablespoons of the olive oil, sage, salt, and pepper. Arrange in a single layer on a baking sheet and bake until the squash is tender and lightly caramelized, about 15 to minutes. Let cool. ", 
            "Bring a large pot of salted water to a boil. Add the quartered Brussels sprouts and cook until tender but retain a touch of crispness, about 1 1/2 minutes, and drain. ", 
            "Into the reserved red onions and vinegar, whisk in remaining 1/2 cup olive oil. Season with pepper. ", 
            "In a large bowl combine the roasted squash, croutons, and Brussels sprouts. Add the vinaigrette and toss. Add the parsley leaves and toss again. Taste and adjust the seasoning. Garnish with grated Parmesan and serve immediately. "
        ], 
        "date": "2006-12-03T22:40:52+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive or peanut oil", 
            "1/2 teaspoon whole cumin seeds", 
            "1/4 teaspoon whole fennel seeds", 
            "1 medium onion, peeled and chopped", 
            "1 medium potato (about 6 ounces), peeled and chopped", 
            "2 teaspoons peeled and chopped fresh ginger", 
            "2 cloves garlic, peeled and chopped", 
            "1 fresh hot green chili, chopped (more or less to taste)", 
            "2 teaspoons ground coriander", 
            "1 teaspoon ground cumin", 
            "1/4 teaspoon ground turmeric", 
            "1/4 teaspoon red chili powder or cayenne (to taste)", 
            "About 3 1/2 cups cauliflower florets (from about 1/2 a large 2.75-pound head)", 
            "2 medium tomatoes, peeled and chopped or 1 1/2 cups canned chopped tomatoes", 
            "1 1/2 teaspoons salt, or to taste (we wanted more)", 
            "A couple spoonfuls heavy cream or dollops of yogurt", 
            "1/2 cup cooked basmati or other long-grain white rice", 
            "Handful of fresh cilantro, chopped", 
            "Freshly ground black pepper", 
            "Lime wedges", 
            "Toasted pita or naan wedges"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/indian-spiced-cauliflower-soup.jpg?w=750", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Freezer Friendly", 
            "Indian", 
            "Photo", 
            "Potatoes", 
            "Soup", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/09/indian-spiced-cauliflower-soup/", 
        "title": "indian-spiced cauliflower soup", 
        "directions": [
            "Heat oil in the bottom of a 4 to 5-quart pot over medium-high heat. Once hot, add the cumin seeds and a few seconds later, the fennel seeds. Pause 2 seconds and then add the onions and potatoes. Stir and sauté for 5 minutes. Add the ginger, garlic and green chiles and stir for 1 minute more.\nTurn the heat to medium low and add the ground coriander, cumin, turmeric and red pepper. Stir for 1 minute. Add the cauliflower, tomatoes and salt and stir for 1 minute. Add 4 cups water, stir, and bring to a boil over medium-high heat. Cover, lower the heat again, and simmer gently for 25 minutes.\nLet the soup cool slightly, then blend it to your desired texture. Taste for seasoning and adjust as needed. Ladle into bowls and add a dollop of yogurt or tiny swirl (about 1/2 teaspoon) heavy cream, if desired. Squeeze lime juice over, add a few grinds of black pepper and place 2 tablespoons cooked rice to the center of each bowl. Scatter with cilantro and serve with pita wedges on the side, if desired. Dig in.\n"
        ], 
        "date": "2016-09-27T12:07:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (3 1/2- to 4-pound) spaghetti squash", 
            "1/2 stick (4 tablespoons) unsalted butter, cut into pieces", 
            "2 garlic cloves, minced", 
            "1 teaspoon ground cumin", 
            "1/2 teaspoon ground coriander", 
            "1/8 teaspoon cayenne", 
            "3/4 teaspoon salt", 
            "2 tablespoons chopped fresh cilantro or flat-leaf parsley, if you’re cilantro-averse"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/moroccan-spiced-spaghetti-squash1.jpg?w=500", 
        "tags": [
            "Fall", 
            "North African", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2009/11/moroccan-spiced-spaghetti-squash/", 
        "title": "moroccan-spiced spaghetti squash", 
        "directions": [
            "To cook the squash in a microwave: Pierce squash (about an inch deep) all over with a small sharp knife to prevent bursting. Cook in an 800-watt microwave oven on high power (100 percent) for 6 to 7 minutes. Turn squash over and microwave until squash feels slightly soft when pressed, 8 to 10 minutes more. Cool squash for 5 minutes.", 
            "To roast the squash, two methods: If you’d like to roast the squash whole, pierce it all over with a small sharp knife to prevent bursting and bake it in a 375°F oven for one hour. If you are good with a big, sharp kinfe, you can save some time by cutting the squash in half lengthwise, scooping out the seeds and roasting the halves face-down in an oiled baking pan for about 40 minutes in a 375°F oven.", 
            "Meanwhile, melt the butter in a small saucepan over medium heat. Add the garlic and cook, stirring, until it is barely golden. Stir in spices and salt and remove from heat.", 
            "If you have microwaved or roasted your squash whole, carefully halve it lengthwise (it will give off a lot of steam) and remove the seeds.", 
            "Carefully halve squash lengthwise (it will give off steam) and remove and discard seeds. Working over a bowl, scrape squash flesh with a fork, loosening and separating strands as you remove it from skin. Toss with the  spiced butter and cilantro. "
        ], 
        "date": "2009-11-05T22:36:19+00:00"
    }, 
    {
        "ingredient_list": [
            "2 heads cauliflower", 
            "1 medium onion", 
            "4 cloves garlic", 
            "1 pound whole-wheat pasta", 
            "Extra-virgin olive oil", 
            "Salt and pepper", 
            "1 pinch red pepper flakes", 
            "White wine vinegar", 
            "1/2 lemon", 
            "1/2 cup toasted walnuts", 
            "4 ounces ricotta salata or feta cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pasta-with-cauliflower-walnuts-and-feta1.jpg?w=500", 
        "tags": [
            "Cauliflower", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/03/pasta-with-cauliflower-walnuts-and-feta/", 
        "title": "pasta with cauliflower, walnuts and feta", 
        "directions": [
            "Put a large pot of water on to boil. Cut the cauliflower into small flowerets. Peel the onion and slice it very thin. Peel and finely chop the garlic. Put the pasta on to cook.", 
            "Saute the cauliflower in olive oil in a large saute pan. When the cauliflower begins to soften, season with salt and pepper and add the sliced onion and red pepper flakes. Saute over medium to high heat until the vegetables are brown and tender. The cauliflower should still be slightly crunchy and should not taste steamed. Add the garlic and remove from the heat, tossing and stirring so the garlic doesn’t burn; if it starts to brown, add a splash of water. Add a few drops each of vinegar and lemon juice and the toasted walnuts. Taste and correct the seasoning. When the pasta is done, drain and add to the cauliflower, adding enough extra-virgin olive oil to coat the pasta thoroughly, toss together and serve, with the cheese crumbled over the dish."
        ], 
        "date": "2008-03-17T22:17:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups all-purpose flour (have successfully swapped whole wheat flour for half)", 
            "1 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon table salt", 
            "1 teaspoon pumpkin-pie spice (or 1/2 teaspoon cinnamon + 1/4 teaspoon fresh nutmeg + 1/4 teaspoon ginger + pinch of ground cloves and allspice)", 
            "1 cup (original recipe) to 1 1/3 cup (what I use these days; makes it even more rich) canned solid-pack pumpkin (from a 15 ounce can, not pumpkin pie filling, which is sweetened and spiced)", 
            "1/3 cup vegetable or another neutral cooking oil", 
            "2 large eggs", 
            "1 1/4 cups plus 1 tablespoon granulated sugar", 
            "1 teaspoon cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/10/pumpkin-muffins.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Fall", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Potatoes", 
            "Pumpkin"
        ], 
        "url": "https://smittenkitchen.com/2006/10/promise-keeper-pumpkin-eater/", 
        "title": "pumpkin muffins", 
        "directions": [
            "Heat oven to 350 degrees. Put liners in 12 standard-sized muffin cups.", 
            "Stir or whisk together flour, baking powder, baking soda, salt and spice in small/medium bowl. ", 
            "In a larger bowl, whisk together pumpkin, oil, eggs and 1 1/4 cups sugar. Add dry ingredients to wet and stir until just combined. Divide batter among muffin cups (each about 3/4 full).", 
            "Stir together last tablespoon of sugar and teaspoon of cinnamon. Sprinkle over each muffin. ", 
            "Bake until puffed and golden brown and wooden pick or skewer inserted into the center of a muffin comes out clean, 25 to 30 minutes.", 
            "Cool in pan on a rack five minutes, then transfer muffins from pan to rack and cool to warm or room temperature.", 
            "Do ahead: Most muffins don’t keep well, but these are excellent on Day 2 (after being stored in an airtight container at room temperature) and not bad at all on Day 3. If longer, I’d keep them in the freezer until needed."
        ], 
        "date": "2006-10-24T09:45:32+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups whole milk (Or 1 cup heavy cream plus 1/2 cup whole milk)", 
            "3/4 cup canned solid-pack pumpkin", 
            "1/2 cup sugar", 
            "2 large eggs plus 1 yolk", 
            "1/2 teaspoon salt", 
            "1 teaspoon ground cinnamon", 
            "1/2 teaspoon ground ginger", 
            "1/8 teaspoon ground allspice", 
            "Pinch of ground cloves", 
            "2 tablespoons bourbon (optional)", 
            "5 cups cubed (1-inch) day-old baguette or crusty bread", 
            "3/4 stick unsalted butter, melted* (can skip this step if using the second set of instructions)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/10/pumpkin-bread-pudding.jpg?w=750", 
        "tags": [
            "Fall", 
            "Photo", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2007/10/pumpkin-bread-pudding/", 
        "title": "pumpkin bread pudding", 
        "directions": [
            "Preheat oven to 350°F with rack in middle.", 
            "Gourmet’s Instructions: Whisk together pumpkin, cream, milk, sugar, eggs, yolk, salt, spices and bourbon, if using, in a bowl. ", 
            "Toss bread cubes with butter in another bowl, then add pumpkin mixture and toss to coat. Transfer to an ungreased 8-inch square baking dish and bake until custard is set, 25 to 30 minutes.", 
            "Alternate, Come On, Be Lazy With Me, instructions: While preheating oven to 350°F with rack in middle, melt butter in bottom of a 8-inch square baking dish. Once it is melted, take it out of the oven and toss bread cubes with butter, coating thoroughly. In a separate bowl, whisk together all the remaining ingredients. Pour them over buttered bread cubes in baking dish, stirring to make sure all pieces are evenly coated. Bake until custard is set, 25 to 30 minutes. "
        ], 
        "date": "2007-10-18T13:49:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 15-ounce can (1 3/4 cups) pumpkin puree", 
            "1/2 cup (120 ml) vegetable or another neutral cooking oil or melted butter (115 grams)", 
            "3 large eggs", 
            "1 2/3 (330 grams) cups granulated sugar", 
            "1 1/2 teaspoons baking powder", 
            "3/4 teaspoon baking soda", 
            "3/4 teaspoon fine sea or table salt", 
            "3/4 teaspoon ground cinnamon", 
            "Heaped 1/4 teaspoon fresh grated nutmeg", 
            "Heaped 1/4 teaspoon ground ginger", 
            "Two pinches of ground cloves", 
            "2 1/4 cups (295 grams) all-purpose flour", 
            "1 tablespoon (12 grams) granulated sugar", 
            "1 teaspoon ground cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/pumpkin-bread.jpg?w=750", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fall", 
            "Photo", 
            "Pumpkin", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2016/10/pumpkin-bread/", 
        "title": "pumpkin bread", 
        "directions": [
            "Heat oven to 350 degrees F. Butter a 6-cup loaf pan or coat it with nonstick spray.\nIn a large bowl, whisk together pumpkin, oil, eggs and sugar until smooth. Sprinkle baking powder, baking soda, salt, cinanmon, nutmeg, ginger and cloves over batter and whisk until well-combined. Add flour and stir with a spoon, just until mixed. Scrape into prepared pan and smooth the top. In a small dish, or empty measuring cup, stir sugar and cinnamon together. Sprinkle over top of batter.\nBake bread for 65 to 75 minutes until a tester poked into all parts of cake (both the top and center will want to hide pockets of uncooked batter) come out batter-free, turning the cake once during the baking time for even coloring.\nYou can cool it in the pan for 10 minutes and then remove it, or cool it completely in there. The latter provides the advantage of letting more of the loose cinnamon sugar on top adhere before being knocked off.", 
            "Cake keeps at room temperature as long as you can hide it. I like to keep mine in the tin with a piece of foil or plastic just over the cut end and the top exposed to best keep the lid crisp as long as possible."
        ], 
        "date": "2016-10-13T12:01:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (29 ounce) can pumpkin puree, approx. 3 1/2 cups", 
            "3/4 cup apple juice", 
            "2 teaspoons ground ginger", 
            "1/2 teaspoon ground cloves", 
            "1 1/3 cups brown sugar", 
            "1 tablespoon ground cinnamon", 
            "1/2 teaspoon ground nutmeg", 
            "3 cups old-fashioned rolled oats", 
            "1 cup sweetened flaked coconut", 
            "1/4 cup vegetable oil", 
            "1/3 cup sliced almonds (1 oz)", 
            "1/2 cup chopped walnuts", 
            "1/3 cup green (hulled) pumpkin seeds, sometimes called pepitas (1 1/2 oz; not roasted)", 
            "1/3 cup packed dark brown sugar", 
            "1/4 cup mild honey", 
            "Pinch cinnamon", 
            "Pinch salt (flaky sea salt is wonderful in here)", 
            "1 cup tart dried cherries", 
            "1/2 cup dried blueberries", 
            "1/2 cup dried pears (1/4 inch dice)", 
            "1/2 cup diced dried apricots (1/4 inch dice)", 
            "1/3 cup golden raisins", 
            "— or —", 
            "2 3/4 cups mixed dried fruit of your choice (I used pears, figs and tart cherries)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pumpkin-butter-and-pepita-granola1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Coconut", 
            "Fall", 
            "Photo", 
            "Pumpkin"
        ], 
        "url": "https://smittenkitchen.com/2007/10/pumpkin-butter-and-pepita-granola/", 
        "title": "pumpkin butter + pepita granola", 
        "directions": [
            "Accompaniment: Sliced bananas; plain yogurt flavored with vanilla extract, pumpkin or apple butter", 
            "Put oven rack in middle position and preheat oven to 375°F. Stir together all ingredients except the fruit in a large bowl until combined. Spread mixture evenly on a large (17-by 12-inch) shallow baking pan lined with parchment paper and bake, stirring occasionally, until golden brown, 30 to 35 minutes, but checking every five minutes after the 15-minute mark because it burns quickly. Transfer granola, in pan, to rack to cool stirring occasionally, about 45 minutes. ", 
            "Stir in dried fruit.", 
            "Granola keeps, frozen (the fruit’s moisture softens granola if not kept frozen) in an airtight container, a few months."
        ], 
        "date": "2007-10-24T14:54:34+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "6 tablespoons (85 grams) unsalted butter, to be divided", 
            "1/2 cup (120 ml) whole milk, warmed (but not over 116 degrees)", 
            "2 1/4 teaspoons active dry yeast (from 1 .25-ounce or 7 gram envelope yeast)", 
            "3 1/2 cups (440 grams) all-purpose flour, plus extra for rolling out", 
            "1/4 cup (packed) (50 grams) light or dark brown sugar", 
            "1/4 cup (50 grams) granulated sugar", 
            "1 teaspoon (6 grams) table salt", 
            "1/2 teaspoon ground cinnamon", 
            "1/4 teaspoon freshly grated nutmeg", 
            "1/8 teaspoon ground cardamom (optional)", 
            "1/4 teaspoon ground ginger", 
            "2/3 cups (160 grams) pumpkin puree, canned or homemade", 
            "1 large egg", 
            "Oil for coating rising bowl", 
            "Filling", 
            "3/4 cup (packed, 145 grams) light or dark brown sugar", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/8 teaspoon table salt", 
            "2 teaspoons (5 grams) ground cinnamon", 
            "Glaze", 
            "4 ounces (115 grams) cream cheese, softened", 
            "2 tablespoons (30 ml) milk or buttermilk", 
            "2 cups (240 grams) powdered sugar, sifted", 
            "Few drops vanilla extract (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/10/pumpkin-cinnamon-rolls.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Fall", 
            "Photo", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2012/10/pumpkin-cinnamon-rolls/", 
        "title": "pumpkin cinnamon rolls", 
        "directions": [
            "Make your dough: Melt your butter, and hey, if you’re melting it in a little saucepan, you might as well brown it for extra flavor. Once the butter has melted, keep cooking it over medium heat for a few additional minutes. It will become hissy and sizzle a lot, then take on a nutty flavor as golden bits form at the bottom of the pot. Remove from heat and set aside to cool slightly.", 
            "Combine your warmed milk and yeast in a small bowl and set aside. After five to seven minutes, it should be a bit foamy. If it’s not, you might have some bad yeast and should start again with a newer packet.", 
            "In the bottom of the bowl of an electric mixer combine flour, sugars, salt and spices. Add just 1/4 cup (or two-thirds of; leave the rest for assembly) of your melted/browned butter and stir to combine. Add yeast-milk mixture, pumpkin and egg and mix combined. Switch mixer to a dough hook and run it for 5 minutes on low.", 
            "Scrape mixture into a large oiled bowl and cover with plastic wrap. Set aside for 1 hour in a draft-free place; it should just about double.", 
            "While it is rising, line the bottom of two 9-inch round cake pans (8-inch round should work too, as does an 8-inch square) with parchment paper and butter the sides of the pan and the paper.", 
            "Assemble buns: Scoop dough onto a very well floured surface and flour the top of it well. With a rolling pin, roll the dough to an approximately 16×11-inch rectangle. Brush reserved melted/browned butter over dough. Stir together remaining filling ingredients and sprinkle mixture evenly over dough. Starting on a longer side, roll the dough into a tight spiral. It’s going to make a mess because the dough is crazy soft and some stuff spills off the ends; don’t sweat it. It will all be delicious in the end.", 
            "Here’s how to cut cinnamon rolls without squishing their pretty spirals: With a sharp serrated knife, using absolutely no pressure whatsoever (only the weight of the blade should land on the dough) gently saw your log with a back-forth motion into approximately 1-inch sections. When a soft dough like this is rolled, it tends to grow longer, which means that you’ll have the option to either make more buns (say, 18 instead of 16) or just cut them a little larger (in generous inches).", 
            "Divide buns between two prepared pans. You can sprinkle any sugar that fell off onto the counter over them. Cover each pan with plastic wrap and let rise for another 45 minutes.", 
            "If you’re doing this ahead of time, you can now put them in the fridge overnight. In the morning, leave them out for an hour to warm up and finish rising.", 
            "15 minutes before you’re ready to bake them, heat the oven to 350°F. Meanwhile, you can make the glaze. Beat your cream cheese until it is light and fluffy. Add powdered sugar and vanilla. Drizzle in milk until you get the consistency you’re looking for, either thick enough to ice or thin enough to drizzle.", 
            "Finish your buns: Remove the plastic and bake buns for 25 minutes, until puffed and golden and the aroma brings all the boys to your yard is like a snickerdoodle. Transfer pans to wire cooling racks and drizzle/schmear with cream cheese glaze, then have at them."
        ], 
        "date": "2012-10-05T11:30:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 stick unsalted butter, room temperature, plus more for greasing pans", 
            "1 cup firmly packed dark-brown sugar", 
            "1/3 cup granulated sugar", 
            "2 cups cake flour", 
            "2 teaspoons baking powder", 
            "1 teaspoon baking soda", 
            "1 teaspoon ground cinnamon", 
            "1 teaspoon ground ginger", 
            "1/2 teaspoon ground nutmeg", 
            "1/8 teaspoon ground cloves", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "2 large eggs", 
            "1/2 cup buttermilk mixed with 1 teaspoon vanilla", 
            "1 1/4 cups canned solid-pack pumpkin"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pumpkin-cupcakes1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Fall", 
            "Photo", 
            "Pumpkin"
        ], 
        "url": "https://smittenkitchen.com/2008/11/pumpkin-cupcakes/", 
        "title": "pumpkin cupcakes", 
        "directions": [
            "Make the cupcakes: Heat oven to 350° (175°C). Line a cupcake pan with 18 liners.", 
            "In a stand mixer, beat the butter and sugars on medium speed until fluffy, about 5 minutes. Meanwhile, sift the flour, baking powder, baking soda, cinnamon, ginger, nutmeg, cloves, salt, and pepper into a medium bowl.", 
            "Add eggs, one at a time, to the mixer, scraping down the sides after each addition. Alternate adding the flour and milk mixtures, beginning and ending with the flour. Beat in the pumpkin until smooth. Scoop the batter among the cupcake liners — you’re looking to get them 3/4 full. Bake the cupcakes until a toothpick inserted into the center comes out clean, about 20 to 25 minutes. Cool the cupcakes on racks completely.", 
            "Make the frosting: In a stand mixer beat all the ingredients on medium until fluffy. Frost the tops of each cupcake, swirling decoratively. Refrigerate cupcakes for 30 minutes to set up frosting."
        ], 
        "date": "2008-11-26T23:26:14+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick) unsalted butter, plus more for pan", 
            "6 ounces bittersweet chocolate, chopped", 
            "2 cups all-purpose flour", 
            "1 teaspoon baking powder", 
            "1/8 teaspoon cayenne pepper", 
            "1/2 teaspoon salt", 
            "1 1/2 to 3/4 cups sugar (the original recipe calls for the larger amount; I think it could be dialed down a bit)", 
            "4 large eggs", 
            "1 tablespoon pure vanilla extract", 
            "1 1/4 cups solid-pack pumpkin", 
            "1/4 cup vegetable oil", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon ground nutmeg", 
            "1/2 cup chopped hazelnuts or other nuts (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pumpkin-swirl-brownies1.jpg?w=500", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Fall", 
            "Photo", 
            "Pumpkin"
        ], 
        "url": "https://smittenkitchen.com/2008/10/pumpkin-swirl-brownies/", 
        "title": "pumpkin swirl brownies", 
        "directions": [
            "1. Preheat oven to 350 degrees. Butter a 9-inch square baking pan or dish.  Cut a length of parchment that will cover the bottom and two sides (makes it much easier to remove), and line the pan with it. Butter the lining as well. (Deb note: I used an 8-inch square, because it was what I had. It works, too, but the brownies are crazy thick and take much longer to bake, just to give you a heads-up.)", 
            "2. Melt chocolate and butter in a heatproof bowl set over a pan of simmering water, stirring occasionally until smooth.", 
            "3. Whisk together flour, baking powder, cayenne, and salt in a large bowl; set aside. Put sugar, eggs, and vanilla in the bowl of an electric mixer fitted with the paddle attachment; beat until fluffy and well combined, 3 to 5 minutes. Beat in flour mixture.", 
            "4. Pour half of batter (about two cups) into a separate bowl and stir chocolate mixture into it. If you find that it is a little thick (as mine was) add a little more batter (a few tablespoons or so) until it is more pourable. This is important because mine was quite thick, and the pumpkin half was quite thin, so I had trouble swirling the two together. ", 
            "5. In other bowl, stir in the pumpkin, oil, cinnamon, and nutmeg. Transfer half of chocolate batter to prepared pan smoothing top with a rubber spatula. Top with half of pumpkin batter. Repeat to make one more chocolate layer and one more pumpkin layer. Work quickly so batters don’t set.", 
            "6. With a small spatula or a table knife, gently swirl the two batters to create a marbled effect. Be sure to get your knife all the way to the bottom of the pan–I didn’t, and ended up with a chocolate base, not that it is such a bad thing. Sprinkle with nuts, if using.", 
            "7. Bake until set, 40 to 45 minutes. Let cool in pan on a wire rack. Cut into 16 squares. "
        ], 
        "date": "2008-10-17T12:00:57+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups all-purpose flour", 
            "1/3 cup packed light brown sugar", 
            "2 1/4 teaspoons baking powder", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "2 teaspoons ground cinnamon", 
            "1 teaspoon ground ginger", 
            "1/4 teaspoon ground cloves", 
            "4 large eggs, separated", 
            "2 cups well-shaken buttermilk", 
            "1 cup canned solid-pack pumpkin", 
            "3/4 stick (6 tablespoons) unsalted butter, melted", 
            "Vegetable oil for brushing waffle iron or cooking spray"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/11/pumpkin-waffles.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Fall", 
            "Photo", 
            "Pumpkin"
        ], 
        "url": "https://smittenkitchen.com/2007/11/pumpkin-waffles/", 
        "title": "pumpkin waffles", 
        "directions": [
            "Preheat oven to 250°F and preheat waffle iron. Sift together flour, brown sugar, baking powder and soda, salt, and spices. Whisk egg yolks in a large bowl with buttermilk, pumpkin, and butter until smooth. Whisk in dry ingredients just until combined. ", 
            "In a mixing bowl with a whisk attachment, whisk the egg whites until they hold soft peaks (as in, far softer than the over-beaten whites you’ll see in my picture above). Folk them gently into the waffle batter, until just combined.", 
            "Brush waffle iron lightly with oil and spoon batter (about 2 cups for four 4-inch Belgian waffles) into waffle iron, spreading quickly. Cook according to manufacturer’s instructions. ", 
            "Transfer waffles to rack in oven to keep warm and crisp. Make more waffles in same manner. "
        ], 
        "date": "2007-11-11T23:13:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (1- pound) acorn squash", 
            "2 tablespoons maple syrup", 
            "1 tablespoon olive oil", 
            "1 teaspoon red pepper flakes (we used 1/2 tsp. and it had plenty of kick)", 
            "1/4 teaspoon salt, plus 1/4 teaspoon", 
            "1/4 teaspoon freshly ground black pepper, plus 1/4 teaspoon", 
            "1 pound pizza dough", 
            "1 cup shredded whole milk mozzarella", 
            "1/2 cup crumbled Gorgonzola", 
            "1 cup arugula", 
            "Squeeze of lemon juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-acorn-squash-and-gorgonzola-pizza1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Pizza", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2008/03/roasted-acorn-squash-and-gorgonzola-pizza/", 
        "title": "roasted acorn squash and gorgonzola pizza", 
        "directions": [
            "Preheat the oven to 375 degrees F.", 
            "Slice the squash in half from top to bottom. Scoop out the seeds. Slice the squash into 1/2 to 3/4-inch wide half moons and place in a medium bowl. Toss the squash with the syrup, olive oil, red pepper flakes, 1/4 teaspoon salt, and 1/4 teaspoon pepper. Place the squash on a parchment-lined baking sheet. Bake the squash until tender and golden, about 20 to 25 minutes.", 
            "Keep the temperature on the oven at 375 degrees F. Roll out the pizza dough on a flour dusted piece of parchment paper to a 13-inch diameter. Place the pizza and the parchment paper on a baking sheet. Sprinkle the mozzarella cheese and the Gorgonzola on the pizza dough. Bake in the oven until golden and cooked through, about 25 to 30 minutes.", 
            "Peel the skins off the squash. Top the cooked pizza with the cooked squash. Toss with arugula with the squeeze of lemon juice and the remaining 1/4 teaspoon salt and pepper. Slice and serve. "
        ], 
        "date": "2008-03-07T11:12:31+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons (30 ml) olive oil, divided", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "1 large or 2 small heads of cauliflower (about 2 1/4 to 2 3/4 pounds)", 
            "2 tablespoons (30 grams) unsalted butter", 
            "1/4 cup (30 grams) hulled pumpkin seeds (sold as pepitas) (see note above)", 
            "1/2 teaspoon crushed red pepper flakes, or less to taste", 
            "Juice of half a lime (about 1 tablespoon)", 
            "Handful chopped fresh cilantro, parsley or chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/cauliflower-with-pumpkin-seeds-brown-butter-and-lime.jpg?w=750", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/11/roasted-cauliflower-with-pumpkin-seeds-brown-butter-and-lime/", 
        "title": "roasted cauliflower with pumpkin seeds, brown butter and lime", 
        "directions": [
            "Heat oven to 450°F. Coat a large rimmed baking sheet with just over 1 tablespoon of the olive oil. Sprinkle the sheet with salt and pepper. Trim cauliflower and cut into 1/2-inch slices. Arrange in a single layer on baking sheet, then drizzle with remaining scant 1 tablespoon olive oil and sprinkle with more salt and pepper. Roast for 15 to 20 minutes, until underside is deeply browned. Carefully flip pieces and roast until dark brown and crisp on second side, about 15 to 20 minutes longer.\nWhile cauliflower roasts, in a small skillet over medium heat, melt butter, then reduce heat to medium-low and add pumpkin seeds. Stirring the whole time, cook until butter becomes light brown and smells toasty, about 4 to 6 minutes. Let cool for 10 minutes, then add lime juice and season with salt, black pepper and red pepper flakes to taste.\nArrange cauliflower on a serving platter and drizzle with dressing. Serve topped with herbs."
        ], 
        "date": "2016-11-01T11:24:09+00:00"
    }, 
    {
        "ingredient_list": [
            "Olive oil", 
            "1 large onion, sliced (1 1/2 cups)", 
            "2 cups (1/4-inch-sliced) fennel, top and core, if thick, removed", 
            "3 cloves garlic, minced (1 tablespoon)", 
            "1 pound sweet potatoes, peeled and sliced 1/4-inch thick", 
            "1 pound celery root, peeled and sliced 1/4-inch thick", 
            "1 pound yukon gold, peeled and sliced 1/4-inch thick", 
            "1 cup heavy cream (see Note up top)", 
            "2 cups chicken or vegetable stock or brother", 
            "2 cups grated gruyere cheese (6 ounces with rind)", 
            "2 teaspoons minced fresh thyme leaves", 
            "Kosher salt and freshly ground black pepper", 
            "2 1/2 cups coarse fresh breadcrumbs or panko (what I used)", 
            "2 to 3 tablespoons melted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/root-vegetable-gratin.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Fennel", 
            "Freezer Friendly", 
            "Onions", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/11/root-vegetable-gratin/", 
        "title": "root vegetable gratin", 
        "directions": [
            "Heat your oven to 350°F. Butter a 13×9-inch deep baking dish.\nHeat 2 tablespoons olive oil in a large deep (ideally 12-inch) saute pan over medium heat and add the onions and fennel. Cooking, tossing occasionally, until lightly browned and tender, about 10 minutes. Add the garlic and cook for one minute more.\nMeanwhile, in the largest bowl you own, combine the onion mixture with remaining vegetables, cream, stock, cheese, thyme, 1 tablespoon kosher salt and 1 1/2 teaspoons black pepper. Pour mixture into prepared dish and spread until even. Mix breadcrumbs and butter until evenly coated and distribute evenly over top of dish.\nBake 1 1/2 hours uncovered, or until vegetables are very tender when tested with a small knife and the top is browned and bubbly. Allow to set for 15 minutes at room temperature and serve hot."
        ], 
        "date": "2016-11-10T13:09:08+00:00"
    }, 
    {
        "ingredient_list": [
            "For the chicken", 
            "1 3/4-inch piece of ginger, peeled and minced (see Note up top)", 
            "4 cloves of garlic, minced or pressed", 
            "1 fresh green chili (I used a jalapeno), seeded and minced", 
            "1/2 cup whole-milk yogurt", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon chili powder or cayenne, or adjusted to taste (I used 1/4 teaspoon)", 
            "1/2 teaspoon ground turmeric", 
            "1/2 teaspoon ground cumin", 
            "3/4 teaspoon granulated sugar", 
            "1 teaspoon paprika", 
            "1 teaspoon garam masala", 
            "2 pounds chicken thighs, drumsticks or halved chicken breasts (all skin-on, bone-in)", 
            "For the vegetables", 
            "3 tablespoons olive oil", 
            "1 1/4 pounds (about 4 medium) Yukon Gold potatoes, peeled if desired, cut into 3/4-inch chunks", 
            "1 3/4 pounds (1 small or half a very large head) cauliflower, cut into 3/4-inch-wide florets", 
            "1/2 teaspoon kosher salt", 
            "1/2 teaspoon cumin seeds", 
            "To finish, if desired", 
            "A few thin slices of red onion", 
            "Lemon wedges", 
            "Salt", 
            "Dollops of yogurt", 
            "A few tablespoons roughly chopped cilantro, parsley or mint, or a mix therof"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/sheet-pan-chicken-tikka1.jpg?w=640", 
        "tags": [
            "Cauliflower", 
            "Chicken", 
            "Gluten-Free", 
            "Indian", 
            "Photo", 
            "Potatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/04/sheet-pan-chicken-tikka/", 
        "title": "sheet pan chicken tikka", 
        "directions": [
            "Combine ginger, garlic, fresh chili, yogurt, salt, spices and sugar in a freezer bag, bowl or container. Add chicken pieces and toss to coat evenly. Let marinate for 15 minutes or up to a day in the fridge.", 
            "When you’re ready to cook the dish, heat your oven to 425°F. Line a half-sheet (13×18-inch) with foil and coat it with 1 tablespoon of the olive oil. Add potatoes, cauliflower, salt, cumin and remaining 2 tablespoons olive oil and toss together with you hands until evenly coated.", 
            "Remove chicken from marinade and leave excess behind. Make spaces in the vegetables for chicken parts throughout the pan. Roast in oven for 20 minutes, then toss the potato and cauliflower to ensure they’re cooking evenly, and return the pan to the oven for 10 to 20 minutes more (i.e. 30 to 40 minutes total roasting time), until chicken and vegetables are cooked through. ", 
            "While it roasts, if you’d like to use the lightly pickled onion rings that we did on top, which added a nice tangy fresh zip to the dish, separate the rings and toss them in a small bowl with a squeeze of lemon juice and a pinch of salt. Set aside until needed.", 
            "When chicken and vegetables are cooked, top with garnishes of your choice — we used dollops of yogurt, herbs and scattered the above onion rings all over. Serve right in the pan."
        ], 
        "date": "2016-04-12T11:59:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 head cauliflower", 
            "2 tablespoons extra-virgin olive oil", 
            "1 small onion, chopped", 
            "2 cloves garlic, minced", 
            "1 quart low-sodium chicken stock", 
            "1/2 cup finely grated Parmesan", 
            "Salt and freshly ground black pepper ", 
            "2 tablespoons mayonnaise – or – 1 egg", 
            "1 tablespoon fresh lemon juice", 
            "1/2 teaspoon Dijon mustard", 
            "1 small garlic clove, minced", 
            "1/2 teaspoon Worcestershire sauce", 
            "1 oil-packed anchovy fillet, finely chopped (optional)", 
            "1/4 cup extra-virgin olive oil", 
            "10 to 12 ounces good-quality solid tuna packed in olive oil, well drained*", 
            "2 scallions washed, trimmed and chopped fine", 
            "6 pepperoncini peppers, destemmed and julienned", 
            "3 tablespoons chopped fresh dill", 
            "1/4 cup roasted or smoked almonds, chopped roughly, or a small handful toasted pine nuts", 
            "1/4 cup good-quality olive oil (or the oil the tuna was packed in)", 
            "1 tablespoon smooth Dijon mustard", 
            "1 tablespoon whole-grain mustard", 
            "1 teaspoon balsamic vinegar", 
            "1 teaspoon fresh lemon juice or more to taste", 
            "1/4 to 1/2 teaspoon freshly ground black pepper. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/09/silky-cauliflower-soup.jpg?w=749", 
        "tags": [
            "Cauliflower", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Seafood", 
            "Soup", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2006/09/silky-cauliflower-soup/", 
        "title": "silky cauliflower soup", 
        "directions": [
            "Mix all the ingredients well with a fork in a medium-size, nonreactive bowl. Taste and adjust the lemon juice and pepper. The salad can be made up to 3 days in advance and refrigerated. ", 
            "* I’ve done this two ways, with oil-packed and the reserved oil, as well as using drained water-packed and adding in 1/4 cup olive oil, and have to say that I find the latter to be a far less oil-slicked result. You can always add more olive oil, but I found it hard to take away the heaviness the oil-packed came with."
        ], 
        "date": "2006-09-03T11:54:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup heavy cream", 
            "1 cup whole milk (I used 2 cups of half and half instead of one cup each of cream and milk)", 
            "3 large eggs plus 2 large egg yolks", 
            "1 teaspoon vanilla extract", 
            "1 (15-ounce) can pumpkin puree", 
            "1 cup drained candied yams from 15-ounce can (regular canned yams can be substituted)", 
            "3/4 cup sugar", 
            "1/4 cup maple syrup", 
            "2 teaspoons grated fresh ginger (I used 1 1/2 teaspoons of ground because I’m not a huge fan of fresh ginger)", 
            "1/2 teaspoon ground cinnamon", 
            "1/4 teaspoon ground nutmeg", 
            "1 teaspoon table salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/silky-smooth-pumpkin-pie1.jpg?w=753", 
        "tags": [
            "Photo", 
            "Pumpkin", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2008/11/silky-smooth-pumpkin-pie/", 
        "title": "silky smooth pumpkin pie", 
        "directions": [
            "Preheat oven to 400 degrees F.", 
            "Roll out dough on generously floured (up to 1/4 cup) work surface to make 12-inch circle about 1/8-inch thick.  Roll dough loosely around rolling pin and unroll into pie plate, leaving at least 1-inch overhang all around pie plate.", 
            "Working around circumference, ease dough into plate by gently lifting edge of dough with one hand while pressing into plate bottom with other hand. Refrigerate 15 minutes. Trim overhang to 1/2 inch beyond lip of pie plate. Fold overhang under itself; edge should be flush with edge of pie plate. Using thumb and forefinger, flute edge of dough. Refrigerate dough-lined plate until firm, about 15 minutes.", 
            "Remove pan from refrigerator, line crust with foil and fill with pie weights or pennies. Bake on rimmed baking sheet 15 minutes. Remove foil and weights, rotate plate. Bake 5 to 10 more minutes until crust is golden brown and crisp. Remove plate and baking sheet from oven.", 
            "Make the filling: While pie shell is baking, whisk cream, milk, eggs, yolks and vanilla together in medium bowl. Combine pumpkin puree, yams, sugar, maple syrup, ginger, cinnamon, nutmeg and salt in large heavy-bottomed saucepan; bring to sputtering simmer over medium heat, 5 to 7 minutes. Continue to simmer pumpkin mixture, stirring constantly and mashing yams against sides of pot, until thick and shiny, 10 to 15 minutes.", 
            "Remove pan from heat. Whisk in cream mixture slowly, until fully incorporated. Strain mixture through fine-mesh strainer set over medium bowl, using back of ladle or spatula to press solids through strainer. Re-whisk mixture and transfer to warm pre-baked pie shell. Return pie plate with baking sheet to oven and bake pie for 10 minutes. Reduce heat to 300 degrees. Continue baking until edges are set (instant-read thermometer inserted in center registers 175 degrees), 20 to 35 minutes longer. Transfer pie to wire rack and cool to room temperature, 2 to 3 hours. (The pie finishes cooking with resident heat; to ensure the filling sets, cool it at room temperature and not in the refrigerator.)"
        ], 
        "date": "2008-11-07T21:11:29+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup black or green lentils", 
            "6 cups peeled, seeded and cubed butternut squash or sugar pumpkin (1-inch cubes) (from about a 2-poudn squash)", 
            "3 tablespoons olive oil, divided", 
            "1 teaspoon ground cumin", 
            "1 teaspoon hot smoked Spanish paprika*", 
            "1/2 teaspoon coarse salt", 
            "4 cups baby arugula (I skipped this)", 
            "1 cup soft crumbled goat cheese", 
            "1/4 cup thinly sliced mint leaves (optional; I used this, but added it after I took a photo)", 
            "1 tablespoon red wine vinegar, plus additional to taste", 
            "Roasted seeds (about 1/2 cup) from your butternut squash (optional; see note above)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/spicy-squash-salad-with-lentils-and-goat-cheese.jpg?w=751", 
        "tags": [
            "Beans", 
            "Fall", 
            "Photo", 
            "Salad", 
            "Thanksgiving", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2010/10/spicy-squash-salad-with-lentils-and-goat-cheese/", 
        "title": "spicy squash salad with lentils and goat cheese", 
        "directions": [
            "Preheat oven to 400°F. Toss squash or pumpkin cubes with 2 tablespoons oil, cumin, paprika and salt. Arrange in a single layer on baking sheet and roast 20 minutes. Flip pieces and roast for an additional 10 to 15 minutes, until tender. Cool.", 
            "Meanwhile, soak lentils for 10 minutes in a small bowl, then drain. Cook lentils in boiling salted water until tender but firm, about 30 minutes. Rinse with cold water, then drain and cool.", 
            "Combine lentils, pumpkin, any oil you can scrape from the baking sheet (I didn’t get enough for this to be worth it) with arugula, if using, half of goat cheese, mint, vinegar, and 1 tablespoon oil. Season with salt and pepper and extra vinegar, if desired (we felt it needed it). Divide among plates and pass with remaining goat cheese to sprinkle.", 
            "* I swapped half with sweet (not hot) smoked paprika to make sure it didn’t get too spicy for a 13 month-old’s tastes. If you don’t have either on hand, there are ways to approximate this smoky/spiciness with what you have in your pantry, such as mixing some regular paprika with a ground chipotle powder or another smoky spice, and then a pinch of cayenne for extra heat."
        ], 
        "date": "2010-10-27T12:47:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon unsalted butter", 
            "1 tablespoon olive oil", 
            "1 medium yellow onion, small dice", 
            "4 medium cloves garlic, thinly sliced", 
            "2 teaspoons ground cumin", 
            "1 (3-inch) cinnamon stick", 
            "Salt and freshly ground black pepper", 
            "1 pound butternut squash, large dice", 
            "3/4 pound red potatoes, large dice", 
            "2 cups low-sodium chicken or vegetable broth", 
            "2 cups cooked chickpeas, drained", 
            "1 (14-ounce) can diced tomatoes, with juices", 
            "Pinch saffron threads (optional)", 
            "1/2 preserved lemon, finely chopped", 
            "1 cup brined green olives (Aida recommended Cerignola)", 
            "Steamed couscous, for serving (directions here and elsewhere on the web)", 
            "Fresh cilantro leaves, roughly chopped, for garnish", 
            "Toasted slivered almonds, for garnish", 
            "Plain yogurt, for garnish", 
            "Hot sauce of your choice (for serving)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/squash-and-chickpea-moroccan-stew1.jpg?w=500", 
        "tags": [
            "Beans", 
            "North African", 
            "Photo", 
            "Stew", 
            "Vegan", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2009/01/squash-and-chickpea-moroccan-stew/", 
        "title": "squash and chickpea moroccan stew", 
        "directions": [
            "Heat butter and olive oil in a 3- to 4-quart Dutch oven or heavy-bottomed saucepan with a tight fitting lid over medium heat. When oil shimmers, add onion, garlic, cumin, and cinnamon, and season with salt and freshly ground black pepper. Cook, stirring occasionally, until spices are aromatic and onions are soft and translucent, about 5 minutes.", 
            "Add squash and potatoes, season with salt and freshly ground black pepper, stir to coat, and cook until just tender, about 3 minutes. Add broth, chickpeas, tomatoes and their juices, and saffron, if using. Bring mixture to a boil then reduce heat to low. Cover and simmer until squash is fork tender, about 10 minutes.", 
            "Remove from heat and stir in preserved lemon and olives. Serve over couscous garnished with cilantro, almonds, and yogurt. "
        ], 
        "date": "2009-01-07T13:39:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 2 1/2- to 3-pound kabocha or other yellow-fleshed squash (such as delicata, acorn or butternut, which I used)", 
            "1/2 to 3/4 cup olive oil", 
            "1/2 teaspoon dried chile flakes, more or less to taste", 
            "Coarse sea or kosher salt", 
            "1 yellow onion, peeled and thinly sliced", 
            "1/3 cup apple cider vinegar", 
            "1/4 cup maple syrup (though I’ll probably use 3 tablespoons next time)", 
            "4 slices country bread, 1-inch thick", 
            "1/2 cup (4 ounces) ricotta, goat cheese, feta or mascarpone", 
            "4 tablespoons chopped mint leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/squash-toasts-with-ricotta-and-cider-vinegar1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Fall", 
            "Photo", 
            "Thanksgiving", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2014/10/squash-toasts-with-ricotta-and-cider-vinegar/", 
        "title": "squash toasts with ricotta and cider vinegar", 
        "directions": [
            "Heat oven to 450. Line large baking sheet with parchment paper. No need to peel your squash (as shown above), just halved, seed and cut your squash into 1/4-inch thick slices. Toss with 3 tablespoons olive oil, 1 to 2 teaspoons salt (Vongerichten recommends 2 teaspoons; I used a bit less) and chile flakes until evenly coated. Transfer mixture to prepared sheet and roast until tender and slightly colored, anywhere from 15 to 30 minutes (depending on the density of the squash you use), flipping once about 2/3 of the way through. Once tender, you can cut the flesh from the skin and discard it. Leave roasted squash on the tray.", 
            "Meanwhile, heat 3 tablespoons olive oil in large skillet over medium-high heat. Add the onions and 1 teaspoon salt and cook, stirring frequently, until onions are softened and beginning to brown, about 10 to 15 minutes. Add vinegar and syrup and reduce heat to medium. Cook, stirring, until onions are jammy and broken down, another 10 to 15 minutes.", 
            "Pile onions on top of roasted squash, still on their baking sheet. Use a fork to gently half-mash the mixture; I like this best when the mixture is not uniformly combined. Taste and adjust seasonings if needed.", 
            "Heat a large skillet over medium-high heat. Add 1 tablespoon olive oil per slice of bread, and cook bread until just golden brown on both sides. Drain on paper towels. Spread cheese on toasts, heap with the squash-onion mixture, sprinkle with coarse salt and garnish with mint. ", 
            "Do ahead: Now that we’ve finished lunch, I can note with great confidence that these reheat wonderfully, even fully assembled, with none of the sog you’d expect from day-old stuff on bread. (It helps if you use a sturdy bread, of course.) Reheat on a baking sheet in a 300 degree oven for 15 minutes. "
        ], 
        "date": "2014-10-29T11:39:08+00:00"
    }, 
    {
        "ingredient_list": [
            "2 garlic cloves", 
            "Sea salt", 
            "6 tablespoons butter, softened", 
            "2 teaspoons Dijon mustard", 
            "1/4 cup drained small capers, rinsed", 
            "Grated zest of 1 lemon", 
            "3 tablespoons chopped marjoram", 
            "Black pepper", 
            "1 pound Brussels sprouts", 
            "1 small head (1/2 pound) white cauliflower", 
            "1 small head (1/2 pound) Romanesco (green) cauliflower"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/take-my-wife1.jpg?w=500", 
        "tags": [
            "Brussels Sprouts", 
            "Cauliflower", 
            "Fall", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/01/take-my-wife/", 
        "title": "cauliflower and brussels salad", 
        "directions": [
            "1. To make the mustard-caper butter, pound the garlic with a half-teaspoon salt in a mortar until smooth. Stir the garlic into the butter with the mustard, capers, lemon zest and marjoram. Season to taste with pepper. (The butter can be made a day ahead and refrigerated. Bring to room temperature before serving.)", 
            "2. Trim the base off the Brussels sprouts, then slice them in half or, if large, into quarters. Cut the cauliflower into bite-sized pieces.", 
            "3. Bring a large pot of water to a boil and add salt. Add the Brussels sprouts and cook for 3 minutes. Then add the other vegetables and continue to cook until tender, about 5 minutes. Drain, shake off any excess water, then toss with the mustard-caper butter. Taste for salt, season with pepper and toss again."
        ], 
        "date": "2007-01-11T12:12:46+00:00"
    }, 
    {
        "ingredient_list": [
            "Soup", 
            "1/4 cup (1/2 stick) butter", 
            "1 large onion, finely chopped", 
            "4 large garlic cloves, chopped", 
            "3 14 1/2-ounce cans low-salt chicken broth", 
            "4 cups 1-inch pieces peeled butternut squash (about 1 1/2 pounds)*", 
            "4 cups 1-inch pieces peeled acorn squash (about 1 1/2 pounds)*", 
            "1 1/4 teaspoons minced fresh thyme", 
            "1 1/4 teaspoons minced fresh sage", 
            "1 1/2 teaspoons ground cumin", 
            "1/2 teaspoon ground ginger", 
            "1/8 cup whipping cream", 
            "Croutons", 
            "2 tablespoons (1/4 stick) butter", 
            "24 1/4-inch-thick baguette bread slices", 
            "1 cup grated Gruyere cheese", 
            "1 teaspoon minced fresh thyme", 
            "1 teaspoon minced fresh sage ", 
            "1 deep pie dish, or frankly, any old dish you feel like baking in", 
            "1/4 peck of your favorite apples to bake with, or whatever the lady is selling that day", 
            "1 tablespoon flour", 
            "1-2 tablespoons sugar, or to taste", 
            "1 teaspoon cinnamon", 
            "1/2 teaspoon nutmeg", 
            "A pinch of allspice", 
            "5-6 tablespoons unsalted or salted butter, your choice, melted", 
            "1/3 cup brown sugar", 
            "1 teaspoon cinnamon", 
            "1/3 cup dried oatmeal", 
            "Up to 1 cup all-purpose flour "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/10/winter-squash-soup-with-gruyere-croutons.jpg?w=750", 
        "tags": [
            "Fall", 
            "Photo", 
            "Soup", 
            "Thanksgiving", 
            "Travel", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2006/10/the-leaf-peeps/", 
        "title": "winter squash soup with gruyere croutons", 
        "directions": [
            "Mix the brown sugar, cinnamon and oatmeal into the melted butter. Now, here’s where all of your personal choice comes in. You could: ", 
            "Add flour a couple tablespoons at a time until the mixture forms a dry crumble. I find the more I add, as long as I don’t add so much that there is flour that can’t adhere at all, the better it comes out. Taste a clump, and adjust the sugar and spice to taste. ", 
            "Sprinkle this over your apples and bake at 400 degrees for about 45 minutes, or until the top is golden and the apples underneath are bubbling in their thickened juices. If the top browns before this happens, cover it with foil until the apples are done. ", 
            "Serve alone or with ice cream, whipped cream, creme fraiche, plain or vanilla yogurt or dusted with powdered sugar. "
        ], 
        "date": "2006-10-16T16:53:55+00:00"
    }, 
    {
        "ingredient_list": [
            "2 (1 1/2 – to 1 3/4-lb) acorn squash", 
            "1/2 teaspoon black pepper", 
            "1 teaspoon salt", 
            "6 tablespoons olive oil", 
            "1 garlic clove", 
            "1 1/2 tablespoons fresh lime juice, or to taste", 
            "1 to 2 teaspoons finely chopped fresh hot red chile, including seeds", 
            "2 tablespoons chopped fresh cilantro"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/unflinchingly-good-things1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Fall", 
            "Gluten-Free", 
            "Photo", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2006/10/unflinchingly-good-things/", 
        "title": "acorn squash with chile-lime vinaigrette", 
        "directions": [
            "Put oven racks in upper and lower thirds of oven and preheat oven to 450°F. Halve squash lengthwise, then cut off and discard stem ends. Scoop out seeds and cut squash lengthwise into 3/4-inch-wide wedges. Toss squash with black pepper, 3/4 teaspoon salt, and 2 tablespoons oil in a bowl, then arrange, cut sides down, in 2 large shallow baking pans. Roast squash, switching position of pans halfway through roasting, until squash is tender and undersides of wedges are golden brown, 25 to 35 minutes.", 
            "While squash roasts, mince garlic and mash to a paste with remaining 1/4 teaspoon salt. Transfer paste to a small bowl and whisk in lime juice, chile (to taste), cilantro, and remaining 1/4 cup oil until combined. Transfer squash, browned sides up, to a platter and drizzle with vinaigrette. "
        ], 
        "date": "2006-10-04T00:29:56+00:00"
    }, 
    {
        "ingredient_list": [
            "For salad:", 
            "1 medium butternut squash (about 2 to 2 1/2 pounds), peeled, seeded, and cut into 1 1/2-inch pieces", 
            "1 medium garlic clove, minced or pressed", 
            "1/2 teaspoons ground allspice (I skip this)", 
            "2 tablespoons olive oil", 
            "Salt", 
            "One 15-ounce can chickpeas, drained and rinsed (1 1/2 cups)", 
            "1/4 of a medium red onion, finely chopped", 
            "1/4 cup coarsely chopped fresh cilantro or parsley", 
            "For tahini dressing:", 
            "1 medium garlic clove, finely minced with a pinch of salt", 
            "1/4 cup lemon juice", 
            "3 tablespoons well-stirred tahini", 
            "2 tablespoons water", 
            "2 tablespoons olive oil, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/warm-butternut-squash-and-chickpea-salad.jpg?w=750", 
        "tags": [
            "Beans", 
            "Fall", 
            "Photo", 
            "Salad", 
            "Vegan", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2009/01/warm-butternut-squash-and-chickpea-salad/", 
        "title": "warm butternut squash and chickpea salad", 
        "directions": [
            "Preheat the oven to 425°F.", 
            "In a large bowl, combine the butternut squash, garlic, allspice, olive oil, and a few pinches of salt. Toss the squash pieces until  evenly coated. Roast them on a baking sheet for 25 minutes, or until soft. Remove from the oven and cool.", 
            "Meanwhile, make the tahini dressing: In a small bowl, whisk together the garlic and lemon juice. Add the tahini, and whisk to blend. Add the water and olive oil, whisk well, and taste for seasoning. The sauce should have plenty of nutty tahini flavor, but also a little kick of lemon. You will probably need to add more water to thin it out.", 
            "To assemble the salad, combine the squash, chickpeas, onion, and cilantro or parsley in a mixing bowl. Either add the tahini dressing to taste, and toss carefully, or you could serve the salad with the dressing on the side. Serve immediately.", 
            "Do ahead: Molly says this salad, lightly dressed, keeps beautifully in the fridge, that you should hold a little of the dressing on the side and that it can be reheated in the microwave. I, for one, have never had any leftovers."
        ], 
        "date": "2009-01-28T23:23:25+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (8 to 8 1/4 ounces) roasted and mashed winter squash", 
            "1/3 cup (80 grams) yogurt or sour cream", 
            "2 large eggs", 
            "1/2 cup (about 30 grams) finely grated gruyere, comte or parmesan", 
            "3/4 teaspoon fine sea or table salt", 
            "A few grinds of black pepper", 
            "1 teaspoon baking powder", 
            "1 cup (130 grams) all-purpose flour", 
            "Butter or olive oil for frying pan", 
            "2 to 3 tablespoons butter", 
            "A pinch or two of salt", 
            "A few fresh sage leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/winter-squash-pancakes-with-crispy-sage-and-brown-butter.jpg?w=750", 
        "tags": [
            "Fall", 
            "Freezer Friendly", 
            "Lunch", 
            "Pancakes", 
            "Photo", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2016/10/winter-squash-pancakes-with-crispy-sage-and-brown-butter/", 
        "title": "winter squash pancakes with crispy sage and brown butter", 
        "directions": [
            "In a large bowl, whisk squash, yogurt, eggs, cheese, salt, pepper and baking powder until smooth. Add flour and stir until just combined. Batter will be thick.\nHeat a large frying over medium-low to medium heat. Coat the bottom with butter or olive oil, or a combination thereof, and spoon in pancake batter, a heaped soup spoon or scant 1/4 cup at a time. Press the back of the batter mound to flatten the pancake slightly. Cook until golden brown underneath, flip and then cook until the color until golden brown on the second side. If this is happening very fast, lower your heat. If you’re worried pancakes have not cooked in the center, you can finish them for 10 minutes in a 250 degrees oven. You can also keep your pancakes warm there until needed. Repeat with remaining batter.\nTo finish, wipe out frying pan and place butter, a pinch or two of salt and sage leaves back in it, heating over medium. The sage leaves will crisp and the butter will brown in a minute or two so keep a close watch on it. Pour leaves and butter over pancakes and quickly understand why you’ll never have them another way.\nTo roast squash: For butternut or kabocha, I halve the squash, scoop out the seeds and roast it face-down on an oiled baking sheet that I’ve sprinkled with coarse salt at 375 for 40 to 50 minutes, until tender. I get about 2 cups mashed squash from one 2-pound (i.e. small-medium) whole squash. If yours is already peeled and in, say, 1-inch chunks, it will likely be tender in just 25 minutes (just updated after rechecking my notes)."
        ], 
        "date": "2016-10-17T12:08:51+00:00"
    }
]