{
  "date": "2015-01-22T12:04:23+00:00",
  "directions": [
    "Fry eggs: Heat a wok or small skillet over the highest heat. Once hot, add enough oil to reach a depth of a generous 1/4-inch. Once the oil is hot enough to smoke, carefully crack the eggs into the oil — cautiously, as they will splatter a lot — and decrease the heat to medium-high. The eggs will hiss, sputter and the whites should puff and develop translucent bubbles. Once they’re very crispy and a deep golden brown underneath, 45 seconds to 1 minute, use a thin spatula to flip the eggs, trying not to break the yolks but not fretting if it happens. Cook for another minute on the second side, until the yolks are set but still slightly molten (aim to have them a little less loose than mine, shown above). Transfer eggs to paper towels; you can cook them up to 15 minutes before serving. Discard oil and wipe out wok or skillet.",
    "Assemble salad: Place all salad ingredients in a large bowl. Quarter the eggs through the yolks and add them to the salad.",
    "Make the dressing: Place the lime juice, palm syrup or dark brown sugar and water, fish sauce, garlic and chiles in the same wok or skillet. Set it over medium heat and heat the mixture until it just begins to sizzle at the edges, less than 30 seconds. ",
    "Finish and serve: Pour the hot dressing over the salad and eggs. Stir gently to combine. If you’re feeling fancy, transfer the salad, liquid at all, to a plate in a low heap. Eat at once."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/fried-egg-salad1.jpg?w=750",
  "ingredient_list": [
    "Eggs",
    "2 large eggs, at room temperature",
    "Enough vegetable oil to reach a depth of 1/4-inch",
    "Salad",
    "1 cup lightly-packed torn green leaf lettuce (approximately 2-inch pieces)",
    "1/4 cup thinly sliced yellow onion",
    "1/4 cup thin or julienned carrot strips",
    "1/4 cup coarsely chopped celery, Chinese or other, include leaves",
    "1/4 cup lightly packed coarsely chopped cilantro, thin stems and leaves",
    "Dressing",
    "1 1/2 tablespoons lime juice (Key limes are recommended, but don’t fuss if you can’t find them)",
    "1 1/2 tablespoons palm sugar simple syrup [see Note up top] or 1 tablespoon water + 1 teaspoon dark brown sugar",
    "1 tablespoon Thai fish sauce",
    "1 1/2 teaspoons (1 large clove) very thinly sliced garlic",
    "2 fresh Thai chiles, preferably green, thinly sliced (more or less to taste)"
  ],
  "tags": [
    "Budget",
    "Eggs",
    "Gluten-Free",
    "Photo",
    "Quick",
    "Salad",
    "Thai"
  ],
  "title": "fried egg salad",
  "url": "https://smittenkitchen.com/2015/01/fried-egg-salad/"
}