{
  "date": "2017-06-01T11:59:37+00:00",
  "directions": [
    "Prepare vegetables: Place bread, pepper halves, and onion wedges in a large bowl and drizzle with 3 tablespoons olive oil, then sprinkle 1 teaspoon kosher salt and many grinds (or about 1/4 teaspoon) black pepper. Use your hands to toss everything together until oil coats everything.\nTo grill: Heat your grill to medium-high, or if yours is small and dinky like mine, high heat. Spread peppers and onions across grill grates and grill, lid down, flipping as needed, until onions are charred in spots (they’ll be done first) and peppers are blistered and blackened in many spots and beginning to soften. Transfer onions to a plate as they’re done; transfer peppers to a bowl. Use bread in bowl to swipe up any excess salt, pepper, and/or oil in it and place slices on grill. Grill until toasted on both sides. Transfer to plate with onions.\nNo grill? You can do all of the above under your broiler, or in your oven at 450 degrees F. Broilers vary wildly in how robust their heat is, so keep an eye on it. Vegetables tend to take longer in the oven, up to 40 minutes, but check in at 20 to be safe. In both cases, turn vegetables and bread as needed to get an even color.\nMarinate peppers: Place foil or a lid over peppers in bowl to trap heat. Once they’re cool enough to handle, remove as much of the skin as you can. This is unquestionably the most annoying part so do only as much as would bother you to have to eat. (For me, this is almost every speck but you’re probably less crazy.) Cut peppers into 1/2- to 1-inch wide strips.\nIn the bottom of a large bowl, whisk together sherry vinegar, remaining 1 tablespoon olive oil, sugar, about 1/4 teaspoon kosher salt (and more to taste), and garlic. Add capers. Add peppers to bowl and let them marinate for as little as 5 minutes or up to a day, even. The longer they souse, the more pickled they’ll taste. After 5 minutes, however, they still have plenty of flavor.\nTo assemble and serve: Shortly before you’re ready to eat the salad, add onions to the bowl with the peppers. Tear bread into chunks and add to bowl, along with mozzarella. Mix gently, making sure the dressing coats the bread. Taste and add more seasoning if needed. Finish with herbs and serve in big heaps."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/grilled-pepper-and-torn-mozzarella-panzanella.jpg?w=750",
  "ingredient_list": [
    "4 1-inch slices bread, country-style",
    "3 large red bell peppers, halved, seeds removed",
    "1 medium red onion, peeled and cut into 1/2-inch wedges",
    "3 tablespoons olive oil",
    "Kosher salt and freshly ground black pepper",
    "2 tablespoons sherry vinegar",
    "1 garlic clove, minced",
    "1/2 teaspoon sugar",
    "1 tablespoon olive oil",
    "1 tablespoons capers, drained (rinsed if salted)",
    "4 ounces mozzarella, torn into bite-sized pieces, or 4 ounces bocconcini",
    "Fresh herbs — snipped chives, basil, or parsley or a mix thereof — to finish (optional)"
  ],
  "tags": [
    "Grilling",
    "Peppers",
    "Salad",
    "Summer",
    "Vegetarian"
  ],
  "title": "grilled pepper and torn mozzarella panzanella",
  "url": "https://smittenkitchen.com/2017/06/grilled-pepper-and-torn-mozzarella-panzanella/"
}