{
  "date": "2011-07-05T10:50:08+00:00",
  "directions": [
    "Prepare steaks: Arrange steaks on large rimmed sheet or cutting board. Mix 1 teaspoon Kosher salt, dark brown sugar, paprika, cayenne and freshly ground black pepper together in a dish. Rub all over steaks and let them marinate in this rub for 1 to 3 hours, covered in the refrigerator. Remove steaks from fridge 1 hour before you’re ready to cook them, to bring them to room temperature.",
    "Prepare salad: Pour 1 tablespoon sherry vinegar over onions in the bottom of a large bowl and let them sit for 10 minutes, stirring occasionally. This will temper the onion’s bite. Add tomatoes, celery and olives. Whisk remaining 2 tablespoons vinegar, reserved olive brine, horseradish, Worcestershire, pepper sauce and celery seeds in a medium bowl. Slowly drizzle in oil, whisking constantly until combined. Add to tomato salad and toss to coat. Season with salt and pepper to taste. Set aside until needed, and up to 4 hours in advance, if covered and refrigerated.",
    "Cook steaks: Preheat a charcoal grill to medium-high or a gas grill to the highest heat. Brush grill grates with oil. Grill steaks for about 4 to 5 minutes on each side for medium-rare. Let rest for 10 minutes before slicing into 1/4-inch thick slices, against the grain.",
    "Alternately, cook the steaks inside: Heat a large cast-iron skillet on medium-high to high and coat bottom with oil. When oil begins to shimmer, place steak in skillet and do not move it for 5 minutes. Turn it once, and cook for another 3 minutes for medium-rare. Repeat with second steak. If your steaks are too large to cook in one piece, you may halve them to fit. Let rest for 10 minutes before slicing into 1/4-inch thick slices, against the grain."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/07/bloody-mary-steak-salad.jpg?w=750",
  "ingredient_list": [
    "Steak",
    "2 1 1/2 pound skirt steaks",
    "Kosher salt",
    "4 teaspoons (packed) brown sugar, light or dark",
    "2 teaspoons paprika",
    "1/2 teaspoon cayenne pepper, or to taste",
    "1/2 teaspoon freshly ground black pepper",
    "Vegetable oil (for brushing)",
    "Salad",
    "1 cup finely chopped red onion",
    "3 tablespoons Sherry vinegar, divided",
    "2 pounds cherry or grape tomatoes, halved (from about 3 pints or 10 ounce containers)",
    "1 cup chopped celery hearts (inner stalks and leaves; from 1 bunch)",
    "1/2 cup chopped brined green olives plus 2 tablespoons olive brine",
    "2 tablespoons prepared horseradish",
    "1 tablespoon Worcestershire sauce",
    "1 teaspoon hot pepper sauce",
    "1/2 teaspoon celery seeds",
    "1/4 cup extra-virgin olive oil",
    "Kosher salt and freshly ground black pepper"
  ],
  "tags": [
    "Grilling",
    "Meat",
    "Photo",
    "Salad",
    "Summer",
    "Tomatoes"
  ],
  "title": "skirt steak with bloody mary tomato salad",
  "url": "https://smittenkitchen.com/2011/07/skirt-steak-with-blood-mary-tomato-salad/"
}