{
  "date": "2008-02-04T16:08:59+00:00",
  "directions": [
    "Mix all matzo ball ingredients in a bowl. Cover and place in the refrigerator for 30 minutes. ",
    "Bring 1 1/2 quarts of well-salted water to a brisk boil in a medium sized pot.",
    "Reduce the flame. Run your hands under water so they are thoroughly wet. Form matzo balls by dropping spoonfuls of matzo ball batter approximately 1-inch in diameter into the palm of your wet hands and rolling them loosely into balls. Drop them into the simmering salt water one at a time. Cover the pot and cook them for 30 to 40 minutes.",
    "About ten minutes before the matzo balls are ready, bring prepared chicken stock to a simmer with the sliced carrot in it. Ladle some soup and a couple matzo balls into each bowl and top with a couple snips of dill. Eat immediately. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/matzo-ball-soup.jpg?w=750",
  "ingredient_list": [
    "3 1/2 to 4 1/2 pounds chicken necks, backs and wings",
    "3 celery ribs, cut into big chunks",
    "3 carrots, scrubbed and cut into big chunks",
    "2 parsnips, scrubbed and cut into big chunks",
    "2 onions, unpeeled and quartered",
    "1 head garlic, cut horizontally in half",
    "1 Turkish or 1/2 California bay leaf",
    "1 tablespoon black peppercorns",
    "1 tablespoon Kosher salt",
    "4 quarts cold water",
    "–and/or–",
    "Any vegetables you have stashed in your Stock Bag (described above) ",
    "Matzo Balls",
    "1/2 cup matzo meal",
    "2 eggs, lightly beaten",
    "2 tablespoons reserved chicken fat or vegetable oil",
    "1 teaspoon salt",
    "1/4 teaspoon black pepper",
    "2 tablespoons chicken stock or seltzer (which both of our mothers swear by for making the balls extra light)",
    "For soup",
    "2 to 3 quarts prepared chicken stock (recipe above)",
    "1 carrot, thinly sliced",
    "A few sprigs of dill"
  ],
  "tags": [
    "Dumplings",
    "Jewish",
    "Passover",
    "Photo",
    "Soup"
  ],
  "title": "matzo ball soup",
  "url": "https://smittenkitchen.com/2008/02/matzo-ball-soup/"
}