[
    {
        "ingredient_list": [
            "2 firm tart apples (1 pound or 2 454 grams)", 
            "1 1/2 cups (6.75 ounces or 195 grams) all-purpose flour", 
            "1/4 cup sugar plus 1 1/2 tablespoons for sprinkling (total of 2.2 ounces or 63 grams)", 
            "1/2 tablespoon (7 grams) baking powder", 
            "1/2 teaspoon salt (3 grams) plus additional for egg wash", 
            "6 tablespoons (3 ounces or 85 grams)unsalted butter, chilled and cut into 1/2-inch cubes plus additional for baking sheet if not lining it with parchment", 
            "1/2 cup (2.25 ounces or 65 grams) sharp cheddar, shredded (white is recommended, I assume for aesthetics)", 
            "1/4 cup (2 ounces) heavy cream", 
            "2 large eggs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/5079390141_db09235efb_o.jpg?w=749", 
        "tags": [
            "Apple", 
            "Cheese", 
            "Fall", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2010/10/apple-and-cheddar-scones/", 
        "title": "apple and cheddar scones", 
        "directions": [
            "Position a rack at the center of oven and preheat oven to 375 °F. Line baking sheet with parchment paper.", 
            "Peel and core apples, then cut them into one-sixteenths. (I assumed this meant chunks, not slivers.) Placed them in a single layer on a baking sheet lined with parchment paper and bake them until they take on a little color and feel dry to the touch, about 20 minutes. They will be about half-baked. Let them cool completely. (You can speed this up in the fridge, as I did.) Leave oven on.", 
            "Sift or whisk flour, sugar, baking powder and salt together. Set aside. Place butter in the bowl of an electric mixer with a paddle attachment, along with cooled apple chunks, cheese, cream and one egg. Sprinkle flour mixture over the top and mix on low speed until the dough just comes together. Do not overmix.", 
            "[Don’t have a stand or hand mixer? I’d rub the cold butter into the flour mixture with my fingertips or with a pastry blender, hand-chop the apples coarsely and mix the rest together with a wooden spoon until combined. It might feel awkward, but it should all come together. Again, don’t overmix it though it will be harder to do this by hand.]", 
            "Generously flour your counter top and place the scone dough on top of it. Sprinkle with flour. Use a rolling pin to gently roll (or use your hands to pat) the dough into a 1 1/4-inch thick, 6-inch circle. Cut circle into 6 wedges. Transfer them to a baking sheet that has either been buttered or lined with a fresh sheet of parchment paper. Leave at least 2 inches between each scone.", 
            "Beat remaining egg in a small bowl with a pinch of salt. Brush the scones with egg wash and sprinkle them with remaining tablespoon of sugar. Bake until firm and golden, about 30 minutes. With a spatula, lift them to a wire rack to cool for 10 minutes. Before you eat one, make sure you realize how addictive they might be. Once you’ve got that down, go for it anyway.", 
            "Do ahead: Scones are best the day they are baked. However, they can be made ahead of time and stored unbaked in the freezer until you need them. Simply brush them with the egg wash and sprinkle them with sugar, and bake them still frozen for just a couple extra minutes. This way they are always freshly baked when you want them. These scones were passable on day two and terrible on day three. "
        ], 
        "date": "2010-10-15T14:09:55+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "1 cup all-purpose flour plus additional for kneading and rolling", 
            "3/4 cup cake flour (not self-rising)", 
            "2 large eggs", 
            "3/4 teaspoon salt", 
            "1/4 cup water", 
            "Filling", 
            "1/4 cup water", 
            "1/4 cup plus 2 tablespoons sugar", 
            "2 tablespoons apricot brandy (optional)", 
            "6 oz dried apricots (1 cup; preferably California)", 
            "1/2 cup walnuts (2 oz), finely chopped", 
            "Dough (recipe above)", 
            "1 stick (1/2 cup) unsalted butter", 
            "1/2 cup fresh bread crumbs", 
            "1/4 teaspoon cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apricot-and-walnut-vareniki1.jpg?w=500", 
        "tags": [
            "Apricots", 
            "Dumplings", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/apricot-and-walnut-vareniki/", 
        "title": "apricot and walnut vareniki", 
        "directions": [
            "Make filling: Bring water and 1/4 cup sugar to a boil, stirring until sugar is dissolved. Remove from heat and stir in brandy. Finely chop apricots in a food processor, then add sugar syrup and pulse until just combined (do not puree). Transfer to a bowl and stir in 1/4 cup walnuts. Cool.", 
            "Roll out dough and fill varenikis: Halve dough and roll out 1 piece on a lightly floured surface into a 15-inch round, keeping remaining dough wrapped. Trim dough to a 13-inch square. Cut lengthwise into 4 strips, then crosswise into fourths to form 16 (3 1/4-inch) squares. ", 
            "Put 1 slightly rounded teaspoon filling in center of each square. Working with 1 square at a time, moisten edges with water and fold in half diagonally to form a triangle, pressing edges firmly together to seal. overlap bottom points of triangle and press to seal (dumpling will look like a pointed hat). Transfer vareniki to a flour-dusted kitchen towel. Repeat with remaining squares, then make more dumplings with remaining dough and filling.", 
            "Cook varenikis in a large pot of lightly salted boiling water until tender, about 15 minutes. Make topping while varenikis cook:", 
            "Heat 2 tablespoons butter in a skillet over moderate heat, then cook bread crumbs and remaining 1/4 cup walnuts, stirring frequently, until golden, 2 to 3 minutes. Remove from heat and season lightly with salt. Stir together cinnamon and remaining 2 tablespoons sugar. Sprinkle 2 teaspoons cinnamon sugar over crumb mixture and toss. ", 
            "To serve varenikis: Melt remaining 6 tablespoons butter, then drizzle about 2 tablespoons on a warmed serving platter. Transfer varenikis with a slotted spoon to platter and drizzle with remaining 4 tablespoons butter. ", 
            "Serve hot, sprinkled with bread-crumb mixture and remaining cinnamon sugar to taste. "
        ], 
        "date": "2007-11-08T23:15:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour plus additional for kneading and rolling", 
            "3/4 cup cake flour (not self-rising)", 
            "2 large eggs", 
            "3/4 teaspoon salt", 
            "1/4 cup water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/best-things-in-small-packages1.jpg?w=500", 
        "tags": [
            "Dumplings", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/best-things-in-small-packages/", 
        "title": "wild mushroom pirogies", 
        "directions": [
            "Stir together flours in a bowl. Make a well in flour and add eggs, salt, and water, then stir together with a fork without touching flour. Continue stirring, gradually incorporating flour into well until a soft dough forms. Transfer dough to a lightly floured work surface and knead, adding only as much additional flour as needed to keep dough from sticking, until smooth and elastic, about 8 minutes. (Dough will be soft.) Cover with plastic wrap and let rest at room temperature at least 30 minutes.", 
            "Do ahead: Dough may be made 2 hours ahead, wrapped well in plastic wrap and chilled. Bring to room temperature before using."
        ], 
        "date": "2006-11-22T00:38:47+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups all-purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "2 teaspoons sugar", 
            "3/4 teaspoon baking soda", 
            "1 teaspoon salt", 
            "6 tablespoons (3/4 stick or 3 ounces) cold unsalted butter, cut into 1/2-inch cubes", 
            "1 1/2 cups crumbled blue cheese", 
            "4 scallions, finely chopped", 
            "1 cup well-shaken buttermilk (or, you can make your own)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/blue-cheese-scallion-drop-biscuits1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Cheese", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2010/04/blue-cheese-scallion-drop-biscuits/", 
        "title": "blue cheese scallion drop biscuits", 
        "directions": [
            "Preheat oven to 450°F. Whisk together flour, baking powder, sugar, baking soda, and salt in a bowl, then blend in butter with your fingertips until mixture resembles coarse meal. Stir in blue cheese and scallions. Add buttermilk and stir until just combined.", 
            "Drop dough in 12 equal mounds about 2 inches apart onto a buttered large baking sheet, or one lined with parchment paper. Bake in middle of oven until golden, 16 to 20 minutes. ", 
            "Do ahead: Biscuits are always best the day they are baked. However, if you wish to get a lead on them, you can make them, drop them onto your baking sheet, freeze them until they are firm, and place them in a freezer bag or container until you’re ready to bake them. They can be baked while still frozen (straight from the freezer), you’ll just want to add a few minutes to the baking time."
        ], 
        "date": "2010-04-21T16:51:30+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound broccolini or regular broccoli", 
            "2 tablespoons olive oil", 
            "3 cloves garlic, minced", 
            "A few pinches red pepper flakes, to taste", 
            "Finely grated zest, then juice, of 1/2 lemon (juice before zesting only if you enjoy being grumpy)", 
            "Coarse salt, to taste", 
            "1/2 cup finely grated aged pecorino romano cheese", 
            "8 thin slices totally unfancy deli provolone", 
            "8 slices bread of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/broccoli-melts1.jpg?w=640", 
        "tags": [
            "Broccoli", 
            "Cheese", 
            "Photo", 
            "Sandwich", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/02/broccoli-melts/", 
        "title": "broccoli melts", 
        "directions": [
            "If using broccolini, cut it into 2-inch segments. If regular broccoli, peel the stems with a vegetable peeler first so that they cook evenly, and cut the rest into large chunks.", 
            "Pour about 1-inch puddle of salted water into a large sauté pan and bring to a boil. Add broccoli and cover with a lid and boil/steam for 2 minutes. Drain well and pat dry on paper towels, wringing out as much extra liquid as possible. Chop into small (roughly 1/2-inch) bits.", 
            "Wipe sauté pan dry and heat over medium. Add olive oil and let it heat for a full minute. Add garlic and pepper flakes, cooking for 1 minutes, or until the garlic is just beginning to turn golden. Add the broccoli and cook 1 to 2 minutes more, seasoning with salt. Transfer mixture to a bowl and add lemon zest, juice, pecorino and more salt and pepper flakes to taste.", 
            "Heat broiler. Arrange slices of bread on a tray and lightly toast on both sides. Scoop broccoli mixture onto each slice of bread, lay a slice of provolone over it and run under the broiler until cheese has melted and begun to blister. Eat. Repeat. Don’t forget to share, or at least hide the evidence if you decide not to."
        ], 
        "date": "2016-02-16T12:02:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups (about 6 ounces) grated extra-sharp Cheddar cheese", 
            "4 tablespoons (1/2 stick or 2 ounces) unsalted butter, softened and cut into 4 pieces", 
            "3/4 cup flour, plus more for dusting", 
            "1/2 teaspoon kosher salt", 
            "1/2 teaspoon crushed red pepper flakes", 
            "1 tablespoon half-and-half (I used cream, because I had it on hand; suspect milk would work just as well)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/cheese-straws.jpg?w=753", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cheese", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/06/cheese-straws/", 
        "title": "cheese straws", 
        "directions": [
            "1.    Preheat oven to 350°F.", 
            "2.    In a food processor, combine the cheese, butter, flour, salt and red pepper in five 5-second pulses until the mixture resembles coarse crumbs. Add the half-and-half and process until the dough forms a ball, about 10 seconds.", 
            "3.    On a lightly floured surface, using a lightly floured rolling pin, roll the dough into an 8- by 10-inch rectangle that is 1/8-inch thick. With a sharp knife (or a pizza or pastry wheel; both worked great), cut the dough into thin 8-inch strips, each 1/4- to 1/3-inch wide (dipping the knife in flour after every few inches ensures a clean cut). Gently transfer the strips to an ungreased cookie sheet (though I lined mine with parchment), leaving at least 1/4-inch between them. The dough may sag or may break occasionally in the transfer, but don’t be concerned — just do your best. The straws can be any length, from 2 to 10 inches.", 
            "4.    Bake the straws on the middle rack for 12 to 15 minutes, or until the ends are barely browned. Remove from the oven and set the cookie sheet on a rack to cool.", 
            "5.    Serve at room temperature. Cheese straws will keep in the refrigerator, in a sealed container, for two days. They will not last an hour at a party.", 
            "Variation: One adaptation I am curious to try would be to roll these into thin, round crackers. Because they puff a bit, I’d roll them as thin as possible, and use a fork or skewer to make some holes to keep the expansion in check. If you try this, I’d love to hear how it went for you."
        ], 
        "date": "2009-06-16T15:19:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds baking potatoes, peeled and cut into chunks", 
            "4 to 5 tablespoons unsalted butter + a little extra to melt and drizzle over the dumplings (Deb note: I was able to make do with just 2 T butter in a non-stick)", 
            "3 onions, finely chopped", 
            "Salt and black pepper to taste", 
            "1 to 2 packages of gyoza (pot sticker) wrappers", 
            "3 to 5 green onions, thinly sliced or 1/4 cup chopped chives or 2 tablespoons chopped parsley or additional fried onions (see note), to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/from-insert-your-origin-here-with-love1.jpg?w=500", 
        "tags": [
            "Dumplings", 
            "Photo", 
            "Potatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/07/from-insert-your-origin-here-with-love/", 
        "title": "quick potato pierogi", 
        "directions": [
            "Sour cream, melted butter or vinegar to serve ", 
            "Cook the potatoes in a large pot of salted boiling water until just tender. Drain and set aside. ", 
            "Melt the butter in a large heavy frying pan and cook the onions until they soften then lightly brown, darkly browned in spots. ", 
            "Mash the potatoes in a bowl then mix in the onions and their cooking butter. Season generously with salt and pepper. ", 
            "Using a round cookie or biscuit cutter the width of the smaller side of the dumpling wrapper, cut 10 to 12 wrappers at a time into circles, discarding the extra. Working on at a time, brush the edge of the round wrapper with water and place a spoonful of filling in the center. Fold dumpling in half, pressing the edges together to thoroughly seal. ", 
            "Place each dumpling on a parchment or waxed paper lined baking sheet and repeat until all filling has been used. ", 
            "Chill in the refrigerator if you are making them ahead of time. If you wish to freeze the dumplings for later use, make sure they are not touching, then freeze them until solid and later gather them into a freezer bag. This ensures that you will avoid having one mega-pierogi clump when you are ready to cook them.", 
            "To cook the pierogi: Bring a large pot of salted water to a boil and add the dumplings one at a time, until the surface of the pan is covered with dumplings. Do not overcrowd; you’ll have to work in batches. When they are done, about 2-3 minutes, remove with a slotted spoon. ", 
            "Transfer to bowls and serve sprinkled with green onions, parsley or chives, drizzled with a little melted butter or vinegar or topped with a deb of sour cream. ", 
            "Alternatively, you can pan-brown the pierogi. Heat some oil in a heavy frying pan and add dumplings in a single layer. When they are golden and in spots, browned, turn and brown other side. Add enough water to reach about 1/4-1/2 inch in depth. Cover and cook 3-4 minutes; remove lid and check for doneness. When pierogi are tender but not mushy to the tooth, and the liquid is evaporated, they are ready. ", 
            "Note: To make fried onions, saute 2 to 3 thinly sliced onions, in butter in a heavy frying pan until they are limp and lightly browned; add several tablespoons water and cook until the onions are soft and silky, the liquid mostly evaporated. Season with salt and pepper. "
        ], 
        "date": "2007-07-08T13:54:11+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups all-purpose flour", 
            "1 tablespoon baking powder", 
            "1 teaspoon salt", 
            "8 tablespoons (1 stick or 4 ounces) cold butter, diced", 
            "1/2 cup heavy cream", 
            "3 eggs, divided", 
            "1/4 pound sharp Cheddar cheese, diced", 
            "2 small jalapeños pepper, minced (I wimped out and used only one only to find my scones entirely heat-free)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/jalapeno-cheddar-scones.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Cheese", 
            "Peppers", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2009/10/jalapeo-cheddar-scones/", 
        "title": "jalapeño-cheddar scones", 
        "directions": [
            "Preheat oven to 400°F. In a small skillet, melt 1/2 tablespoon of butter and sauté the jalapeños in it until soft, about two minutes. Let them cool, then place them in a small bowl with the cheddar cheese and coat them with one tablespoon of the flour. Combine the remaining flour with the baking powder and salt. Cut in the remaining butter with a pastry blender, fork or two knives, until the butter bits are pea sized.", 
            "Lightly whip two of the eggs and cream and add to the flour-butter mixture. Using a wooden spoon, fold mixture until it begins to come together. Add the cheddar-jalapeño mixture to the dough and mix until everything is incorporated.", 
            "Turn out the dough onto a well-floured surface and knead gently for less than one minute. Pat dough out to a 3/4- to 1-inch thickness and either cut into 8 triangles or the shape of your choice with a biscuit cutter. Make an egg wash by beating the remaining egg with a teaspoon of water. Brush the scones with egg wash and place on a parchment-lined (or well-oiled) baking sheet. Bake for 25 minutes or until golden brown.", 
            "Scones are always best the first day.", 
            "Want to flash-freeze yours, as I did? Brief directions, here."
        ], 
        "date": "2009-10-15T13:41:15+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick) unsalted butter, plus more for casserole", 
            "6 slices white bread, crusts removed, torn into 1/4- to l/2-inch pieces", 
            "5 1/2 cups milk", 
            "1/2 cup all-purpose flour", 
            "2 teaspoons coarse salt, plus more for water", 
            "1/4 teaspoon ground nutmeg", 
            "1/4 teaspoon freshly ground black pepper", 
            "1/4 teaspoon cayenne pepper", 
            "4 1/2 cups (about 18 ounces) grated sharp white cheddar cheese", 
            "2 cups (about 8 ounces) grated Gruyère or 1 1/4 cups (about 5 ounces) grated Pecorino Romano cheese", 
            "1 pound elbow macaroni"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/marthas-macaroni-cheese1.jpg?w=640", 
        "tags": [
            "Cheese", 
            "Freezer Friendly", 
            "Pasta", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/05/marthas-macaroni-and-cheese/", 
        "title": "martha’s macaroni-and-cheese", 
        "directions": [
            "1. Preheat oven to 375°F. Butter a 3-quart casserole dish; set aside. Place the bread in a medium bowl. In a small saucepan over medium heat, melt 2 tablespoons butter. Pour the melted butter into the bowl with the bread, and toss. Set the breadcrumbs aside.", 
            "2. Warm the milk in a medium saucepan over medium heat. Melt the remaining 6 tablespoons butter in a high-sided skillet over medium heat. When the butter bubbles, add the flour. Cook, stirring, 1 minute.", 
            "3. While whisking, slowly pour in the hot milk a little at a time to keep mixture smooth. Continue cooking, whisking constantly, until the mixture bubbles and becomes thick, 8 to 12 minutes.", 
            "4. Remove the pan from the heat. Stir in salt, nutmeg, black pepper, cayenne pepper, 3 cups cheddar cheese, and 1 1/2 cups Gruyère (or 1 cup Pecorino Romano); set the cheese sauce aside.", 
            "5. Cover a large pot of salted water, and bring to a boil. Cook the macaroni until the outside of pasta is cooked and the inside is underdone, 2 to 3 minutes. Transfer the macaroni to a colander, rinse under cold running water, and drain well. Stir the macaroni into the reserved cheese sauce.", 
            "6. Pour the mixture into the prepared dish. Sprinkle the remaining 1 1/2 cups cheddar cheese, 1/2 cup Gruyère (or 1/4 cup Pecorino Romano), and the breadcrumbs over the top. Bake until golden brown, about 30 minutes (though we needed a bit more time to get it brown, but your oven may vary). Transfer the dish to a wire rack for 5 minutes; serve."
        ], 
        "date": "2008-05-07T11:15:54+00:00"
    }, 
    {
        "ingredient_list": [
            "3 1/2 to 4 1/2 pounds chicken necks, backs and wings", 
            "3 celery ribs, cut into big chunks", 
            "3 carrots, scrubbed and cut into big chunks", 
            "2 parsnips, scrubbed and cut into big chunks", 
            "2 onions, unpeeled and quartered", 
            "1 head garlic, cut horizontally in half", 
            "1 Turkish or 1/2 California bay leaf", 
            "1 tablespoon black peppercorns", 
            "1 tablespoon Kosher salt", 
            "4 quarts cold water", 
            "–and/or–", 
            "Any vegetables you have stashed in your Stock Bag (described above) ", 
            "Matzo Balls", 
            "1/2 cup matzo meal", 
            "2 eggs, lightly beaten", 
            "2 tablespoons reserved chicken fat or vegetable oil", 
            "1 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "2 tablespoons chicken stock or seltzer (which both of our mothers swear by for making the balls extra light)", 
            "For soup", 
            "2 to 3 quarts prepared chicken stock (recipe above)", 
            "1 carrot, thinly sliced", 
            "A few sprigs of dill"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/matzo-ball-soup.jpg?w=750", 
        "tags": [
            "Dumplings", 
            "Jewish", 
            "Passover", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/02/matzo-ball-soup/", 
        "title": "matzo ball soup", 
        "directions": [
            "Mix all matzo ball ingredients in a bowl. Cover and place in the refrigerator for 30 minutes. ", 
            "Bring 1 1/2 quarts of well-salted water to a brisk boil in a medium sized pot.", 
            "Reduce the flame. Run your hands under water so they are thoroughly wet. Form matzo balls by dropping spoonfuls of matzo ball batter approximately 1-inch in diameter into the palm of your wet hands and rolling them loosely into balls. Drop them into the simmering salt water one at a time. Cover the pot and cook them for 30 to 40 minutes.", 
            "About ten minutes before the matzo balls are ready, bring prepared chicken stock to a simmer with the sliced carrot in it. Ladle some soup and a couple matzo balls into each bowl and top with a couple snips of dill. Eat immediately. "
        ], 
        "date": "2008-02-04T16:08:59+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons (30 grams) unsalted butter", 
            "2 tablespoons (15 grams) all-purpose flour", 
            "3/4 cup (175 ml) milk, ideally whole but lowfat should work", 
            "A few gratings fresh nutmeg", 
            "Salt and black pepper to taste", 
            "1 tablespoon (15 grams) smooth Dijon mustard", 
            "1 1/2 pounds (680 grams) fresh mushrooms (cremini, white or a mix of wild all work), thinly sliced", 
            "Olive oil and butter as needed", 
            "2 teaspoons minced mixed fresh herbs such as rosemary, thyme and sage", 
            "Salt and black pepper to taste", 
            "1 pound loaf of a hearty white or whole wheat sourdough bread, in 3/4-inch slices", 
            "8 ounces (225 grams) coarsely grated gruyere or comte", 
            "Chopped fresh flat-leaf parsley, to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/mushroom-tartines.jpg?w=750", 
        "tags": [
            "Cheese", 
            "Mushrooms", 
            "Photo", 
            "Put An Egg On It", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/03/mushroom-tartines/", 
        "title": "mushroom tartines", 
        "directions": [
            "Make the sauce: In a large skillet (so you can use it again for the mushrooms), melt butter over medium heat and then stir in flour until a paste forms. Very slowly drizzle in milk, whisking the whole time to keep the mixture smooth. Add nutmeg, salt and pepper and cook, stirring, until mixture has simmered for a couple minutes. It will be thick and get thicker as it cools; this makes for a better spread. Scrape into a bowl and stir in Dijon. Adjust seasonings if needed. Set aside.\nHeat oven: To 425 degrees F. Line your largest baking sheet with foil.\n\nCook the mushrooms: Wipe out skillet and heat over medium-high. Add a glug of olive oil or a mix of olive oil and butter. Once it is very hot, add 1/3 to 1/2 of mushrooms, 1/3 to 1/2 of herbs and let sear in pan until brown underneath, about 2 to 3 minutes, before stirring and continuing to cook until tender and any liquid in the pan has cooked off, about 5 minutes. Season well with salt and pepper. Repeat with remaining mushrooms.", 
            "Assemble and bake: Spread bread in one layer on prepared baking sheet. Schmear each all the way to the edges with sauce; you should have exactly enough for a thin coat on each. Heap each slice with mushrooms; use them all. Sprinkle cheese over and since the mushrooms are heaped so high, you’ll probably have to press it in a bit with your hand. You’ll be glad you got all the cheese on there.", 
            "Bake for 10 minutes, until cheese is melted all over, then transfer to the broiler and cook until tops are browned, a few minutes more (but keep an eye on it because broilers vary wildly and mine is rather weak).", 
            "To serve: Scatter with parsley and eat with a knife and fork, preferably with a big green salad on the side."
        ], 
        "date": "2017-03-29T12:21:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound firm tofu", 
            "1/2 cup coarsely grated carrots", 
            "1/2 cup shredded Napa cabbage", 
            "2 tablespoons finely chopped red pepper", 
            "2 tablespoons finely chopped scallions", 
            "2 teaspoons finely minced fresh ginger", 
            "1 tablespoon chopped cilantro leaves", 
            "2 minced cloves garlic (Deb addition)", 
            "1 tablespoon soy sauce", 
            "1 tablespoon hoisin sauce", 
            "2 teaspoons toasted sesame oil (I replace 1 teaspoon with hot sesame oil — delicious)", 
            "1 egg, lightly beaten", 
            "1 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "35 to 40 small wonton wrappers", 
            "1/3 cup chicken stock or water", 
            "1/4 cup soy sauce", 
            "1 tablespoon rice vinegar", 
            "1 tablespoon dark sesame oil or 1/2 tablespoon dark, 1/2 tablespoon hot sesame oil", 
            "1 small clove garlic, minced (optional)", 
            "1 (1/2-inch-thick) slice peeled fresh ginger", 
            "1/4 cup Asian sesame paste or smooth peanut butter", 
            "3 tablespoons Asian sesame oil", 
            "1/4 cup rice vinegar (not seasoned)", 
            "1 1/2 tablespoons sugar", 
            "2 tablespoons water", 
            "1 teaspoon Asian chile paste with garlic*", 
            "1/2 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/on-obsessiveness-and-ollies1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Chinese", 
            "Dumplings", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2007/02/on-obsessiveness-and-ollies/", 
        "title": "vegetable dumplings", 
        "directions": [
            "Blend all dressing ingredients in a blender until smooth. Dressing keeps, covered tightly and chilled, 1 week. "
        ], 
        "date": "2007-02-19T21:04:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour, more as needed", 
            "1/2 teaspoon salt", 
            "1/2 cup finely grated fresh Parmesan cheese (alternate: I think Romano could also work well here)", 
            "4 tablespoons unsalted butter", 
            "1/4 cup cream or half-and-half, more as needed", 
            "Coarse salt, pepper, sesame or poppy seeds or whatever you like for sprinkling (optional)."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/parmesan-cream-crackers1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cheese", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/12/parmesan-cream-crackers/", 
        "title": "parmesan cream crackers", 
        "directions": [
            "Heat oven to 400°F. Line a baking sheet with parchment paper or lightly dust with flour. Put flour, salt, cheese and butter in bowl of a food processor. Pulse until flour and butter are combined. Add about 1/4 cup cream or half-and-half and let machine run for a bit until a dough forms. If it does not come together, add more liquid a teaspoon at a time, until mixture holds together but is not sticky. (I only needed the ingredient levels as listed to pull the dough together.)", 
            "Roll out dough on a lightly floured surface until 1/4-inch thick or even thinner, adding flour as needed. From here, you can either form them into individual crackers (I went for 1 1/2-inch squares cut with a fluted pastry wheel) and bake them an inch apart on your baking sheet (the method I used) or transfer the entire rolled-out sheet to your baking sheet (draping it over the rolling pin will make it easier) and score them lightly with a knife, pizza or pastry wheel to break into crackers after they are baked. For either method, dock all over with a fork and sprinkle with salt or any other toppings you are using.", 
            "Bake until moderately browned, about 12 minutes. Cool on a rack; serve warm or at room temperature or store in a tin for a few days.", 
            "Note: Mine were the most crisp before they’d been kept in a container. If you’re baking them less than a day in advance, I think they can be left uncovered to maintain their best texture."
        ], 
        "date": "2009-12-27T23:05:19+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups whole milk", 
            "1 cup heavy cream (see Note above about using less)", 
            "1/2 teaspoon coarse sea salt", 
            "3 tablespoons freshly squeezed lemon juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/06/rich-homemade-ricotta.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cheese", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/06/rich-homemade-ricotta/", 
        "title": "rich homemade ricotta", 
        "directions": [
            "Pour the milk, cream and salt into a 3-quart nonreactive saucepan. Attach a candy or deep-fry thermometer. Heat the milk to 190°F, stirring it occasionally to keep it from scorching on the bottom. Turn off the heat [Updated] Remove from heat and add the lemon juice, then stir it once or twice, gently and slowly. Let the pot sit undisturbed for 5 minutes.", 
            "Line a colander with a few layers of cheesecloth and place it over a large bowl (to catch the whey). Pour the curds and whey into the colander and let the curds strain for at least an hour. At an hour, you’ll have a tender, spreadable ricotta. At two hours, it will be spreadable but a bit firmer, almost like cream cheese. (It will firm as it cools, so do not judge its final texture by what you have in your cheesecloth.) Discard the whey, or, if you’re one of those crafty people who use it for other things, of course, save it. Eat the ricotta right away or transfer it to an airtight container and refrigerate until ready to use.", 
            "Serve: On 1/2-inch slices of baguette that have been run under the broiler until lightly bronzed. Serve it simply [as shown in the top photo, left to right] with honey and a pinch of flaky sea salt, a couple grinds of black pepper, pinch of salt and drizzle of olive oil, and/or a few droplets of an aged balsamic. Or with zucchini ribbons [as shown in the last photo], I started with about half a pound of miniature zucchini my mother-in-law had found at Trader Joes. Larger ones will work just fine, but you might want to first cut a big one in half lengthwise. Peel them into ribbons and toss them with 1/4 teaspoon of salt and let them drain in a colander for a while (this wilts them), about 20 minutes. Rinse and pat them dry. Toss with lemon juice, olive oil, salt and black pepper to taste. Arrange in piles on ricotta crostini.", 
            "Do ahead: I keep mine only 3 to 4 days; the really fresh milk I used doesn’t last long. However, Salvatore also uses really fresh milk, and theirs appears to keep closer to two weeks. In conclusion? Shelf lives will vary. Use your nose to judge freshness. Or your partner’s nose, because who doesn’t like hearing “Hey honey, sniff this for me?”"
        ], 
        "date": "2011-06-18T09:48:36+00:00"
    }, 
    {
        "ingredient_list": [
            "2/3 cup water", 
            "1 tablespoon butter", 
            "1/2 teaspoon salt", 
            "1/2 cup semolina", 
            "1 tablespoon Parmesan cheese", 
            "1 egg, lightly beaten", 
            "1 tablespoon chopped parsley or chives (optional)", 
            "1 carrot, peeled, cut into short, fat matchsticks", 
            "1 parsnip, peeled, cut the same as the carrot", 
            "Few tablespoons snipped chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/semolina-dumpling-soup1.jpg?w=500", 
        "tags": [
            "Dumplings", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/05/semolina-dumpling-soup/", 
        "title": "semolina dumpling soup", 
        "directions": [
            "Once your stock is ready, add the carrots and parnsips and simmer them until they’re almost cooked, about five minutes. You can make the dumplings while you wait. Once everything is cooked, garnish (or forget to, in our case) and serve quickly."
        ], 
        "date": "2008-05-21T15:49:19+00:00"
    }, 
    {
        "ingredient_list": [
            "Potstickers", 
            "3 to 3 1/4 cups chopped spring vegetables (such as asparagus, favas, peas, lima beans or more) (I used 2 1/4 cups chopped asparagus from 12 ounces stalks plus 1 cup cooked favas from about 1 pound fresh in their pods)", 
            "1 tablespoon neutral cooking oil, such as safflower, canola or peanut", 
            "3/4 cup thinly sliced scallions (from about 3/4 of a bundle, about 3 ounces)", 
            "1 tablespoon minced ginger", 
            "1 clove garlic, peeled minced (if using garlic chives, omit)", 
            "1 cup (about 6 ounces) firm tofu, chopped small (see Note up top for alternative)", 
            "1/2 cup garlic or regular chives", 
            "1 teaspoon toasted sesame oil", 
            "1/4 teaspoon kosher salt, or more to taste", 
            "To assemble", 
            "1 tablespoon cornstarch", 
            "1/2 cup water", 
            "50 round dumpling wrappers (most packages contain 50)", 
            "Scallion dipping sauce", 
            "2 to 3 scallions (or, remainder of bundle used for potstickers), thinly sliced (use some in sauce, some for garnish)", 
            "1/4 cup rice vinegar", 
            "1/4 cup soy sauce", 
            "1 tablespoon regular or spicy toasted sesame oil ", 
            "To cook", 
            "1 to 2 tablespoons neutral cooking oil", 
            "1/4 to 1/2 cup water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/spring-vegetables-potstickers.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Dumplings", 
            "Peas", 
            "Photo", 
            "Spring", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/05/spring-vegetable-potstickers/", 
        "title": "spring vegetable potstickers", 
        "directions": [
            "Prepare vegetables: If using asparagus, cut off tough ends and sliced stalks into 1/2-inch segments. If using fava, remove them from their pods. Boil favas for 3 minutes, then drain, and press them out of their opaque skins (if difficult, first make a small slit on one end with a paring knife). To prepare peas, simply remove them from their pods. To prepare lima beans, remove them from their pods and simmer them for about 5 minutes to soften.  ", 
            "Make filling: Heat a wok or large saute pan over medium heat. Add a tablespoon of oil and heat, then add scallions, ginger and garlic, if using. Cook for one minute, then add vegetables in the order of the time they need to cook until crisp-tender. Asparagus will need about 4 minutes, peas about 2 to 3, and favas and limas will already be tender, so just a minute to warm them. Add tofu and chives and cook just until chives wilt, about 1 minute more. Season with salt and transfer to a fine-mesh colander, to drain off any excess liquid. Let cool in colander for 15 minutes. ", 
            "If mixture is still on the chunky side, either chop it finely on a cutting board or pulse it a few times in a food processor. You don’t want to puree it; bits of vegetable should still be recognizable, but it will be easier to mound in dumplings if chopped well. Adjust seasonings if needed and mix with sesame oil.", 
            "Assemble potstickers: Line two baking sheets with parchment paper or very lightly oil them. Mix cornstarch and water in a small bowl; this will act as your “glue.” Most dumpling wrappers come dusted with a little starch, so you’ll be okay if you want to skip the cornstarch, but I always feel safer having a little extra as an insurance plan.", 
            "Remove first wrapper from package and put it on a plate; place a damp towel or piece of plastic wrap over the unused ones to keep them from drying out. Brush wrapper with cornstarch-water mixture. Mound 1 to 2 teaspoons filling in the center. Fold the wrapper in half over the filling, sealing the center edge shut. Make a few small pleats down each sides to seal in the rest of the filling, while trying to press out as much air as possible (a process that looks difficult but is so easy, I think you’ll find it intuitive — use the photos in the post as guidance). Rest the dumpling, pleats up, on prepared tray and repeat with remaining wrappers and filling. When you’re all done, look over your potstickers; use the cornstarch mixture and pinching to seal any open sides or loosened pleats.", 
            "You can now freeze the dumplings on their trays, then transfer them to a freezer bag once they will no longer stick together, or cook them right away.", 
            "Make dipping sauce: Mix ingredients and adjust levels to taste. For a sweeter sauce, add a 1/2 teaspoon honey or brown sugar.", 
            "Cook potstickers: Heat a large skillet (I really like to use a nonstick here) over medium-high heat. Once hot, add the oil and heat this too. Once the oil is hot, arrange potstickers in a single layer and cook until browned at the bottom. This will take about 1 minute for fresh ones and up to 5 minutes for frozen ones. Add water; it will hiss and sputter, so move quickly. You’ll want the smaller amount of water for a smaller batch and the larger if you’re cooking more. Put a lid on the pot and cook dumplings for 2 to 3 minutes more (plus an additional minute if your dumplings were frozen to begin with). Remove lid and simmer until any remaining water has cooked off. ", 
            "Transfer to serving plate; garnish with scallion greens. Serve with dipping sauce."
        ], 
        "date": "2013-05-01T11:21:44+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces goat milk Gouda, coarsely grated*", 
            "4 ounces fresh goat cheese, softened", 
            "1 tablespoon all-purpose flour", 
            "1 large egg", 
            "1/4 cup Panko** breadcrumbs", 
            "1/2 teaspoon coarse or sea salt", 
            "Olive oil, for frying", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/warm-crisp-and-a-little-melty-salad-croutons1.jpg?w=500", 
        "tags": [
            "Cheese", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/05/warm-crisp-and-a-little-melty-salad-croutons/", 
        "title": "warm, crisp and a little melty salad croutons", 
        "directions": [
            "Mash together cheeses in a bowl, mixing until combined. Form the mixture into four balls then smoosh each slightly into thick patties. Arrange three small dishes for dredging stations: Place the flour in the first one, beat the egg lightly in the second, and mix the breadcrumbs and salt in the last one. Heat a healthy slick of olive oil (the original recipe suggested 3 tablespoons; in a tiny skillet, I used closer to 2) in a small skillet over medium heat. Once hot, fry each patty until golden and crispy, about two minutes per side. It’s going to get melty (I’m not sorry) and seem pesky to flip once warm. I found using two forks made this easy-peasy. Briefly pause the crouton on paper towels to drain excess oil, before landing it on top of your salad of choice, then finish the whole thing with freshly ground black pepper. Repeat with remaining croutons. Eat at once. ", 
            "* Gouda, a Dutch cheese, is traditionally made with cow’s milk. You can buy it young (smooth, semi-firm and mild flavored), or aged (harder, darker, stronger-flavored with crunchy flecks), smoked, light, and even more ways. However, if you can find the goat milk gouda suggested here, perfect for goat cheese-phobes, it’s really amazing in these croutons, absolutely worth swinging by a cheese shop or grocery store with a great cheese counter for. (It’s also sold online from a variety of stores.) If you cannot get it, you could replace the gouda with another semi-firm cheese good for grating and melting, like a young cow’s milk gouda, gruyere, etc.", 
            "** If you can’t find or don’t want to buy Panko, here’s how I fake it: Preheat oven to 350 degrees. Tear one to two slices of soft, crustless white bread into 1-inch pieces and pulse them in the food processor until coarsely ground. This will make a generous half cup. Transfer crumbs to a rimmed baking sheet and bake until just barely golden brown and dry, about 15 minutes, stirring occasionally. Cool. Use."
        ], 
        "date": "2012-05-11T14:13:44+00:00"
    }, 
    {
        "ingredient_list": [
            "6 ounces (1 1/2 cups coarsely grated) sharp cheddar, orange if you can find one you like", 
            "4 tablespoons (2 ounces or 57 grams) butter", 
            "1/2 cup (2 1/2 ounces or 62 grams) whole wheat flour", 
            "1/4 cup (1 1/8 ounces or 31 grams) all-purpose flour", 
            "1/8 teaspoon onion powder", 
            "1/8 to 1/4 teaspoon table salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/03/whole-wheat-goldfish-crackers.jpg?w=750", 
        "tags": [
            "Cheese", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2011/03/whole-wheat-goldfish-crackers/", 
        "title": "whole wheat goldfish crackers", 
        "directions": [
            "Preheat oven to 350°F. Combine all ingredients in a food processor, running the machine until the dough forms a ball, about two minutes.", 
            "If the dough feels warm or worrisome-ly soft, wrap it in waxed paper or plastic wrap and chill it in the fridge for 30 to 45 minutes. This also makes it easier to transfer shapes once they are rolled out.", 
            "On a lightly floured surface, using a lightly floured rolling pin, roll the dough out 1/8-inch thick. Form shapes with a cookie cutter, dipping it in flour from time to time to ensure a clean cut. Gently transfer crackers to an ungreased (though mine were parchment-lined, because they are in despicable shape) cookie sheet with a 1/2 inch between them. Bake the crackers on the middle rack for 12 to 15 minutes, or until they are barely browned at the edges. Remove from the oven and set the cookie sheet on a rack to cool.", 
            "Tiny Goldfish Cookie Cutter: I bought mine here."
        ], 
        "date": "2011-03-03T15:53:44+00:00"
    }
]