{
  "date": "2015-07-29T11:11:33+00:00",
  "directions": [
    "Spread each slice of bread with mayonnaise and set aside.",
    "Heat a skillet, preferably nonstick, over medium-low heat. Add a thin layer of olive oil and let it heat until shimmering. Add first slice of provone to skillet and fry it until crusty and golden underneath. Using a very thin spatula (this “flexible fish spatula” style is my favorite, for everything) carefully flip slice. It’s probably not going to flip neatly and you’ll probably curse me and also Hess but a messy slice will taste no less delicious than a photogenic one, promise. Just do your best. Fry the slice on the other side until golden underneath, then lift this browned cheese mess out of the pan and onto your first prepared bread slice. Repeat with remaining slices of cheese, frying more than one at a time if you’re now more comfortable with the process. ",
    "Arrange slices of tomatoes over fried provolone on bread, sprinkle with salt and pepper and eat with one hand while calming an irate newborn with the other (if you’re me) or with two hands, from a plate, sitting down with a napkin on your lap, you civilized thing (if you’re not me, clearly). ",
    "* Forgive me if I sound like a broken record, but my favorite is the whole wheat sourdough (a.k.a. miche or pain de campagne; think: Poilâne, but not requiring a ticket to Paris) you see here and elsewhere on the site. If you live near a Le Pain Quotidien, they sell theirs in quarters from gigantic loaves. Balthazar also makes their own, which is wonderful, and also sells it in quarters, inexpensively. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/07/tomato-and-fried-provolone-sandwich1.jpg?w=640",
  "ingredient_list": [
    "4 1/2-inch thick slices your favorite sturdy bread*",
    "4 tablespoons mayonnaise",
    "Two to four 1/4-inch slices provolone cheese (use larger amount for smaller slices)",
    "Olive oil2 medium-sized perfectly ripe tomatoes, sliced",
    "Flaky salt and freshly cracked black pepper, to taste"
  ],
  "tags": [
    "Photo",
    "Quick",
    "Sandwich",
    "Summer",
    "Tomatoes",
    "Vegetarian"
  ],
  "title": "tomato and fried provolone sandwich",
  "url": "https://smittenkitchen.com/2015/07/tomato-and-fried-provolone-sandwich/"
}