{
  "date": "2013-05-07T11:17:43+00:00",
  "directions": [
    "The night before: Pour warm water in the bottom of a large (larger than you think you’ll need, because the batter will rise a lot) bowl. Sprinkle yeast on top and let it dissolve and foam ever-so-slightly for 15 minutes. Stir in milk, butter, salt, sugar and flour — I do a little bit of wet ingredients then a little bit of dry, back and forth, to avoid forming lumps. If lumps form, you can mostly whisk them out. ",
    "Cover bowl with plastic wrap and set out on counter (see Note up top for debate on this) overnight.",
    "The next morning, whisk in eggs and baking soda until smooth. Heat waffle iron** (a thinner one is better than a Belgian-style one, as these will not rise enough to fill a tall one out) and coat lightly with butter or oil. Ladle in 1/2 to 3/4-cup batter per waffle batch. The batter will be very thin and will spread a lot in the pan, so err on the side of underfilled until you figure out the right amount. Repeat with remaining batter.",
    "Waffles can be kept crisp in a warm oven until needed. If you only want to make a few at a time, the batter keeps well in the fridge for several days, says Cunningham.",
    "** I suspect someone will ask me here about the waffle iron I use. It’s this one. I bought it last year when I was working on a story about breakfast egg sandwiches (which I just realized never ran, hmm) and I wanted to make one with waffles. I honestly do not care for it or any waffle iron I’ve ever owned for one reason, a reason that makes me a little shouty: why don’t waffles irons have removable plates for washing?! I have yet to see one and cleaning them is such an ordeal; this is the only waffle recipe I’ve loved enough that it has felt worth the bother."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/essential-raised-waffles1.jpg?w=640",
  "ingredient_list": [
    "1/2 cup warm water (about 105 to 110 degrees, so not too hot)",
    "1 packet (1/4 ounce, 7 grams or 2 1/4 teaspoons) active dry yeast",
    "2 cups milk, warmed (again, not too hot",
    "1 stick (4 ounces or 115 grams) unsalted butter, melted and cooled until lukewarm",
    "1 teaspoon table salt",
    "1 teaspoon granulated sugar",
    "2 cups (250 grams) all-purpose flour",
    "2 large eggs",
    "1/4 teaspoon baking soda",
    "Oil or melted butter for waffle iron",
    "Powdered sugar, syrup or berries for serving"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Photo",
    "Waffles"
  ],
  "title": "essential raised waffles",
  "url": "https://smittenkitchen.com/2013/05/essential-raised-waffles/"
}