{
  "date": "2008-12-10T14:30:48+00:00",
  "directions": [
    "Preheat the broiler. Carve off all of the bottom and most of the top and side crusts from your bread (you can reserve these to use as croutons for soup or another salad). Tear bread into irregular 2- to 3-inch chunks, wads, bite-sized bits and fat crumbs. You should get about 4 cups.",
    "Toss them with just a tablespoon or two of olive oil, lightly coating them, and broil them very briefly, just to lightly color the edges. If you’d like to toast the pine nuts (recommended) you can put them on your broiler tray as well, but watch them very carefully — they cook quickly!",
    "Combine about 1/4 cup of the olive oil with the Champagne or white wine vinegar and salt and pepper to taste. Toss about 1/4 cup of this tart vinaigrette with the torn bread in a wide salad bowl; the bread will be unevenly dressed. Taste one of the more saturated pieces. If it is bland, add a little salt and pepper and toss again.",
    "Heat a spoonful of the olive oil in a small skillet, add the garlic and scallions, and cook over medium-low heat, stirring constantly, until softened. Don’t let them color. Scrape into the bread and fold to combine. Drain the plumped currants and fold them in, along with the pine nuts, if they were not already mixed with the bread scraps from the broiling step. Dribble the chicken stock or lightly salted water over the salad and fold again.",
    "Taste a few pieces of bread — a fairly saturated one and a dryish one. If it is bland, add salt, pepper, and/or a few drops of vinegar, then toss well.",
    "If you’re going to serve the salad under the roast chicken (recipe above), you can pile the bread salad on the serving dish you want to use and tent it with foil. If you want to serve it separately, do the same, but in a 1-quart shallow baking dish. Hang onto the bowl you mixed it in — you’ll use it again.",
    "Place the salad in the oven after you flip the chicken the final time, for about 5 to 10 minutes.",
    "Tip the bread salad back into the salad bowl. It will be steamy-hot, a mixture of soft, moist wads, crispy-on-the-outside-but-moist-in-the-middle-wads, and a few downright crispy ones. Drizzle and toss with a spoonful of the pan juices. Add the greens, a drizzle of vinaigrette, and fold well. Taste again."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/zuni-cafe-roast-chicken-bread-salad1.jpg?w=500",
  "ingredient_list": [],
  "tags": [
    "Chicken",
    "Date Night",
    "Photo",
    "Salad"
  ],
  "title": "zuni cafe’s roasted chicken + bread salad",
  "url": "https://smittenkitchen.com/2008/12/zuni-cafe-roast-chicken-bread-salad/"
}