{
  "date": "2010-08-30T14:49:15+00:00",
  "directions": [
    "Peel your tomatoes: Bring a pot of water to boil. Cut a small X at the bottom of each tomato. Blanche the tomatoes in the boiling water for 10 to 30 seconds, then either rinse under cold water or shock in an ice water bath. Peeling the tomatoes should now be a cinch. If one gives you trouble, toss it back in the boiling water for another 10 seconds until the skin loosens up. Discard the skins (or get crafty with them).",
    "Finish preparing your tomatoes: If using plum tomatoes, halve each lengthwise. If using beefsteak or another round variety, quarter them. Squeeze the seeds out over a strainer over a bowl and reserve the juices. (You can discard the seeds, or get crafty with them.) Either coarsely chop you tomatoes on a cutting board or use a potato masher to do so in your pot, as you cook them in a bit.",
    "Prepare your vegetables: I finely chop my onion, and mince my carrot, celery and garlic, as does Bastianich. Batali grates his carrots. Burell pulses all four on the food processor to form a paste. All of these methods work.",
    "Cook your sauce: Heat your olive oil in a large pot over meduim. Cook your onions, carrots, celery and garlic, if you’re using them, until they just start to take on a little color, about 10 minutes. I really like to concentrate their flavor as much as possible. Add your tomatoes and bring to a simmer, lowering the heat to medium-low to keep it at a gentle simmer. If you haven’t chopped them yet, use a potato masher to break them up as you cook them. Simmer your sauce, stirring occasionally. At 30 minutes, you’ll have a fine pot of tomato sauce, but at 45 minutes, you might just find tomato sauce nirvana: more caramelized flavors, more harmonized texture. ",
    "If your sauce seems to be getting thicker than you want it to be, add back the reserved tomato juice as need. If your sauce is too lumpy for your taste, use an immersion blender to break it down to your desired texture. (“Blasphemy!” some will say, but they’re not in the kitchen with you. So there.) Season with 1/2 teaspoon salt and more to taste. I like somewhere between 1/2 and 1 teaspoon for 4 pounds of tomatoes. Scatter fresh basil over the pot before serving. Taste once more. Swear you’ll never buy jarred sauce again.",
    "More ways to play around: There are innumerable ways to tweak your tomato sauce. Some like a pinch of red pepper flakes cooked with the carrots/celery/garlic and onion in the beginning. Some add them at the end. Some swear by a glug of red wine added with the tomatoes. Others insist that a tablespoon of tomato paste will give your relatively quick-cooked sauce a longer-cooked flavor. Have fun with it.",
    "To play around as little as possible: Skip the onion, carrot and celery. Just cook your tomatoes for 30 to 45 minutes and at the end, drizzle in some olive oil or melted butter. If you have time, you can infuse that oil or butter with garlic and basil. Season to taste with salt. Wonder why you ever added so many ingredients to something so obviously perfect without them."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/08/fresh-tomato-sauce.jpg?w=750",
  "ingredient_list": [
    "4 pounds sad, unloved tomatoes (some swear by romas, I’ve had success with all varieties)",
    "1/4 cup olive oil",
    "Small onion",
    "2 to 3 small cloves of garlic",
    "1/2 medium carrot",
    "1/2 stalk of celery",
    "1/2 teaspoon salt plus more to taste",
    "Slivers of fresh basil, to finish"
  ],
  "tags": [
    "Italian",
    "Photo",
    "Savory Sauces and Condiments",
    "Summer",
    "Tomatoes",
    "Vegetarian"
  ],
  "title": "fresh tomato sauce",
  "url": "https://smittenkitchen.com/2010/08/fresh-tomato-sauce/"
}