[
    {
        "ingredient_list": [
            "2 medium roma tomatoes, cubed", 
            "1 1-pound English cucumber, cubed", 
            "1/2 medium red onion, cubed, or 4 scallions, finely sliced", 
            "3 tablespoons finely minced fresh, flat-leaf parsley", 
            "Juice of half a lemon", 
            "2 to 3 tablespoons olive oil", 
            "1 1/2 teaspoons sumac powder", 
            "Salt and pepper, to taste", 
            "6 large pitas, cut into eight wedges each, then each wedge split into two layers (for small chips) cut into six wedges and split (for large, scoopable chips)", 
            "Olive oil cooking spray or 2 tablespoons olive oil", 
            "Flaky sea salt", 
            "1 tablespoon za’atar or sumac"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/700544972_564e118f79_b.jpg?w=753", 
        "tags": [
            "Cucumber", 
            "Israeli", 
            "Photo", 
            "Round-Up", 
            "Salad", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/07/a-salad-palette/", 
        "title": "israeli salad + pita chips", 
        "directions": [
            "Preheat oven to 350 degrees. On a large baking sheet lined with parchment paper, arrange all of the pita slices so they do not overlap. Either brush or spray with olive oil, then sprinkle with sea salt and your spice of choice. Bake for 10 to 15 minutes, or until they begin to color. Let them cool completely before using, or bagging for later. "
        ], 
        "date": "2007-07-03T11:53:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup olive oil", 
            "5 Anaheim chiles or 3 jalape&#241os, stemmed, seeded, and finely chopped (I was nervous and only used 2 Anaheims; I would go for 3 or 4 next time for a more moderate but still gentle kick)", 
            "1 small yellow onion, chopped", 
            "5 cloves garlic, crushed then sliced", 
            "1 teaspoon ground cumin", 
            "1 tablespoon paprika", 
            "1 28-ounce can whole peeled tomatoes, undrained", 
            "Kosher salt, to taste", 
            "6 eggs", 
            "1/2 cup feta cheese, crumbled", 
            "1 tablespoon chopped flat-leaf parsley", 
            "Warm pitas, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/shakshuka.jpg?w=752", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Budget", 
            "Eggs", 
            "Israeli", 
            "North African", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/04/shakshuka/", 
        "title": "shakshuka", 
        "directions": [
            "Heat oil in a 12-inch skillet over medium-high heat. Add chiles and onions and cook, stirring occasionally, until soft and golden brown, about 6 minutes. Add garlic, cumin, and paprika, and cook, stirring frequently, until garlic is soft, about 2 more minutes.", 
            "Put tomatoes and their liquid into a medium bowl and crush with your hands. Add crushed tomatoes and their liquid to skillet along with 1/2 cup water, reduce heat to medium, and simmer, stirring occasionally, until thickened slightly, about 15 minutes. Season sauce with salt.", 
            "Crack eggs over sauce so that eggs are evenly distributed across sauce’s surface. Cover skillet and cook until yolks are just set, about 5 minutes. Using a spoon, baste the whites of the eggs with tomato mixture, being careful not to disturb the yolk. Sprinkle shakshuka with feta and parsley and serve with pitas, for dipping."
        ], 
        "date": "2010-04-08T22:24:26+00:00"
    }
]