{
  "date": "2011-08-21T14:31:35+00:00",
  "directions": [
    "Preheat you oven to 350 degrees. Butter a 9-inch springform pan; set aside. Spread hazelnuts on a baking sheet. Bake until fragrant, about 10 to 15 minutes, then let cool enough to remove the skins.*  Place nuts in the bowl of a food processor, and pulse until medium fine, about 30 pulses.",
    "Transfer nuts to the bowl of an electric mixer and add 1 1/2 cups flour, 1/2 cup granulated sugar, brown sugar, 1/2 teaspoon cinnamon, and 1/2 teaspoon salt; mix until just combined. Add butter, and mix on low speed until crumbs begin to stick together, about 2 to 3 minutes. Press 3 cups of crumb into the bottom of the prepared pan and about 1 1/2 inches up the sides of the pan to form crust; I like to use the bottom and side of a heavy measuring cup to help press the crumbs neatly down and up the side, forming a nice inner corner. Set remaining crumb mixture (about 1 1/2 cups) aside. Transfer crust to the oven; bake until it appears to be set, 15 to 20 minutes; go easy on this baking time as I found it was easy to overbake the outer corners of the tart base in the final baking. It’s going to slump a wee bit in the oven; feel free to press the sides back up the sides with the back of a metal spoon when it comes out of the oven to get them back in place. Set aside to cool (the fridge will expedite this for you).",
    "Slice plums in half, and remove pits. Slice larger plums into eighths and smaller ones into quarters and arrange in cooled crust. In a medium bowl, whisk together 1 tablespoon flour and 1/4 cup plus 2 tablespoons granulated sugar. Whisk in egg, egg yolk, heavy cream, milk, 1/4 teaspoon cinnamon, 1/4 teaspoon salt, and a few gratings of fresh nutmeg. Pour custard over fruit; sprinkle with reserved crumb mixture. Transfer tart to the oven; bake until custard has set and is slightly golden, 45 to 50 minutes. Let rest at least 25 minutes before cutting if serving warm. You can serve this warm or at room temperature but we much preferred it fully chilled.",
    "* On toasting and skinning hazelnuts: I find that the trick to getting the skins off it to toast them quite well; keep an eye on them so they don’t burn, but let them get some color. That extra color will translate to deeper flavor and looser skins; everyone wins. Some people like to rub the nuts in a dishtowel to loosen the skins but I hate the mess this makes all over my kitchen when I inevitably forget that the towel is a mess of flakes and pick it up. Instead, with dry hands, I roll a few together between my palms until the skins come off and the mess stays on the tray. In general, I almost never get all of the skins off but it doesn’t matter; as long as most of the skins are removed, you won’t have any nagging bitterness."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/hazelnut-plum-crumb-tart1.jpg?w=500",
  "ingredient_list": [
    "Crust and crumbs",
    "3/4 cup unsalted butter (1 1/2 sticks), chilled, cut into small pieces, plus more for pan",
    "1/3 cup (1 3/4 ounces of 49 grams) hazelnuts",
    "1 1/2 cups (188 grams) all-purpose flour",
    "1/2 cup granulated sugar",
    "1/3 cup packed light or dark brown sugar",
    "1/2 teaspoon ground cinnamon",
    "1/2 teaspoon table salt",
    "Filling",
    "1 pound ripe but firm plums (about 4 standard black ones or 12 smaller Italian plums; I used a mix of both)",
    "1 tablespoon (8 grams) all-purpose flour",
    "1/4 cup plus 2 tablespoons (6 tablespoons) granulated sugar",
    "1 large egg, lightly beaten",
    "1 large egg yolk",
    "1/3 cup heavy cream",
    "1/4 cup milk",
    "1/4 teaspoon table salt",
    "1/4 teaspoon ground cinnamon",
    "Grated nutmeg, optional"
  ],
  "tags": [
    "Photo",
    "Plum",
    "Summer",
    "Tarts/Pies"
  ],
  "title": "hazelnut plum crumb tart",
  "url": "https://smittenkitchen.com/2011/08/hazelnut-plum-crumb-tart/"
}