[
    {
        "ingredient_list": [
            "Topping:", 
            "1 teaspoon aniseed", 
            "1 1/2 cups pastry flour", 
            "3/4 cup polenta (coarse cornmeal)", 
            "1/2 cup sugar", 
            "1 1/2 teaspoons baking powder", 
            "1/4 teaspoon salt", 
            "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes", 
            "1 large egg, beaten to blend", 
            "Filling:", 
            "2 cups fresh cranberries", 
            "White sugar–original recipe calls for 2/3 cup, I’d suggest 1/3 cup or omitting it entirely", 
            "2/3 cup (packed) golden brown sugar", 
            "2 teaspoons finely grated lemon peel", 
            "1 1/2 teaspoons finely grated orange peel", 
            "1 teaspoon ground cinnamon", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "2 pounds Granny Smith apples, peeled, cored, cut into 1-inch cubes", 
            "2 tablespoons fresh lemon juice", 
            "Vanilla gelato or ice cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-cranberry-crisp1.jpg?w=500", 
        "tags": [
            "Apple", 
            "Cranberries", 
            "Crumbles/Crisps", 
            "Disasters", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/apple-cranberry-crisp/", 
        "title": "apple cranberry crisp", 
        "directions": [
            "For topping: Toast aniseed in small skillet over medium heat until slightly darker in color, about 3 minutes. Place seeds in processor. Add next 5 ingredients; blend 5 seconds. Add butter; blend, using on/off turns, until mixture resembles coarse crumbs. Transfer mixture to large bowl. Drizzle egg over and stir until ingredients are evenly moistened.", 
            "For filling: Preheat oven to 375°F. Combine first 8 ingredients in large bowl; stir to blend. Add apples and lemon juice; toss to blend. Transfer filling to 11x7x2- inch glass baking dish (or other shallow 2-quart baking dish).", 
            "Crumble topping finely over filling. Bake dessert until apples are tender, juices bubble thickly, and topping is crisp and golden, about 1 hour. Cool 15 minutes. Serve crisp warm with gelato."
        ], 
        "date": "2007-12-13T15:15:50+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup granulated sugar", 
            "1 cup water", 
            "1 (12-ounce) package fresh or frozen cranberries, rinsed, drained and sorted through, removing any stems or deflated ones", 
            "Several julienned strips of orange peel, or thick pieces of zest", 
            "A few squeezes of orange juice", 
            "1 15-ounce can jellied cranberry sauce", 
            "1 15-ounce can whole-berry cranberry sauce", 
            "1 bag frozen mixed berries, not defrosted", 
            "1 handful chopped walnuts", 
            "1 2/3 cups ruby Port", 
            "1/4 cup balsamic vinegar", 
            "1/4 cup (packed) golden brown sugar", 
            "8 dried black Mission figs, stemmed, chopped", 
            "1 6-inch-long sprig fresh rosemary", 
            "1/4 teaspoon ground black pepper", 
            "1 12-ounce bag fresh cranberries", 
            "3/4 cup sugar "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/cranberry-sauce.jpg?w=750", 
        "tags": [
            "Cranberries", 
            "Fruit", 
            "Photo", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2006/11/cranberries-candied-fruity-and-drunk/", 
        "title": "cranberries: candied, fruity and drunk", 
        "directions": [
            "Combine first 6 ingredients in medium saucepan. Bring to boil, stirring until sugar dissolves. Reduce heat to low and simmer 10 minutes. Discard rosemary. Mix in cranberries and 3/4 cup sugar. Cook over medium heat until liquid is slightly reduced and berries burst, stirring occasionally, about 6 minutes. Cool. Transfer sauce to bowl; chill until cold. ", 
            "Do ahead: Cranberry sauce can be prepared 1 week ahead. Cover and keep refrigerated."
        ], 
        "date": "2006-11-10T14:08:46+00:00"
    }, 
    {
        "ingredient_list": [
            "13 tablespoons (1 stick plus 5 tablespoons) unsalted butter, cut into 1-inch pieces", 
            "1/3 cup powdered sugar", 
            "1 egg yolk", 
            "1 1/2 cups unbleached flour", 
            "1 tablespoon heavy cream", 
            "1 1/4 cups heavy cream", 
            "1/2 cup (1 stick) unsalted butter, cut into eight pieces", 
            "1 cup granulated sugar", 
            "1 3/4 cup frozen cranberries", 
            "2 cups unblanched sliced almonds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cranberry-caramel-and-almond-tart1.jpg?w=640", 
        "tags": [
            "Cranberries", 
            "Fall", 
            "Fruit", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2007/10/cranberry-caramel-and-almond-tart/", 
        "title": "cranberry, caramel and almond tart", 
        "directions": [
            "1. Keep (or preheat) the oven to 350 degrees. Measure the cream and butter into a saucepan and heat it over low heat. When the butter has melted completely, remove from heat.", 
            "2. To make the caramel, spread the sugar evenly in a perfectly dry, deep 10-inch skillet and place it over medium-low heat.", 
            "3. The sugar should turn straw-colored, then gold and then a nutty-brown caramel after about 10 minutes. If the sugar cooks unevenly, gently tilt or swirl the pan to evenly distribute the sugar. Remove from heat and slowly whisk the cream and butter into the sugar, which can splatter as the cream is added (long sleeves are a good precaution). If the caramel seizes, return it to the heat and continue to stir until it is smooth and creamy. Strain the caramel into a bowl and cool it for 30 minutes.", 
            "4. Stir the frozen cranberries and the almonds into the caramel and mix until all the fruit and nuts are coated. Spoon the filling into the partially baked tart dough mounding toward the center.", 
            "5. Bake for 25 to 30 minutes, until the juices and the caramel are bubbling slowly around the edges. Remove from the oven and let stand for 1 hour, then gently lift the tart ring off the pastry.", 
            "6. Carefully transfer the tart to a serving platter. Serve warm or at room temperature."
        ], 
        "date": "2007-10-31T18:15:19+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough:", 
            "4 large egg yolks", 
            "1 large whole egg", 
            "1/4 cup (50 grams) granulated sugar", 
            "6 tablespoons (85 grams) butter, melted, plus additional to grease pan", 
            "3/4 cup (175 ml) buttermilk", 
            "Zest of 1 orange, finely grated (to be used in dough and filling, below)", 
            "3 3/4 cups (470 grams) all-purpose flour, plus more for dusting counter", 
            "1 packet (7 grams or 2 1/4 teaspoons) instant dry yeast", 
            "1 1/4 teaspoons coarse or kosher salt, or more to taste", 
            "1 teaspoon oil for bowl", 
            "Filling:", 
            "1 1/2 tablespoons (20 grams) butter", 
            "1 cup (190 grams) packed light brown sugar", 
            "1 cup (115 grams) fresh cranberries", 
            "Orange zest leftover from above", 
            "Icing:", 
            "3 1/2 tablespoons (55 ml) orange juice", 
            "2 cups (240 grams) powdered sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cranberry-orange-breakfast-buns1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Cranberries", 
            "Fall", 
            "Orange", 
            "Photo", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2013/11/cranberry-orange-breakfast-buns/", 
        "title": "cranberry-orange breakfast buns", 
        "directions": [
            "Make the dough: In the bottom of the bowl of a stand mixer, whisk the yolks, whole egg, sugar, butter, buttermilk and 3/4 of the orange zest together (saving the rest for the filling). Add 2 cups of the flour along with the yeast and salt; stir until evenly moistened. Switch to the dough hook and add the remaining 1 3/4 cups flour and let the dough hook knead the mixture on low speed for 5 to 7 minutes. The dough should be soft and moist, but not overly sticky. Scrape the dough into a large, lightly oiled bowl (I usually scrape my dough briefly onto the counter, oil the mixing bowl, and scrape the dough back into it) and cover it with plastic wrap. Let dough rise at room temperature until doubled, which will take between 2 and 2 1/2 hours.", 
            "[Don’t have a stand mixer? Stir the mixture together with a wooden spoon, then continue stirring and beating it about in a large bowl for several minutes, until it comes together. Turn the dough out onto a floured counter and knead it for another 5 minutes. It will stick; don’t sweat it. Just scrape everything up and into the oiled bowl when it’s time to let it rise. Try to resist adding extra flour when it sticks; it will only toughen the dough. That would be sad.]", 
            "Prepare the filling: Melt the butter and set it aside. In a food processor, pulse the whole cranberries until they’re ground to a coarse rubble, but not fully pureed. You’ll need to scrape the machine down once or twice. Set them aside. ", 
            "[Don’t have a food processor? Just hand chop them very well, as if to coarsely mince them.]", 
            "Assemble the buns: Butter a 9×13-inch baking dish, a heavier ceramic or glass dish is ideal here. Turn the risen dough out onto a floured work surface and roll it into a rectangle that is 18 inches wide (the side nearest to you) and 12 or so inches long. (It’s okay if it goes longer/thinner.) Brush the dough with the melted butter. Sprinkle it with the brown sugar. Scatter the ground cranberries over it, then the remaining orange zest. ", 
            "Roll the dough into a tight, 18-inch long spiral. Using a sharp serrated knife, very, very gently saw the log into 1 1/2-inch sections; you should get 12. Arrange the buns evenly spread out in your baking dish. Cover with plastic wrap and refrigerate overnight, or up to 16 hours.", 
            "The next morning, bake the buns: Take your buns out of the fridge 30 minutes before you’d like to bake them, to allow them to warm up slightly. Heat your oven to 350 degrees F. Bake your buns until they’re puffed and golden (the internal temperature should read 190 degrees F), approximately 30 minutes.", 
            "Transfer pan to a cooling rack and let cool slightly. Make the icing by whisking the orange juice and powdered sugar together. Spread a little on each bun, or drizzle it over the whole pan. Serve immediately. ", 
            "Many notes:"
        ], 
        "date": "2013-11-13T11:31:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup coarsely chopped pecans", 
            "1 1/2 tablespoons all purpose flour", 
            "2/3 cup granulated sugar", 
            "9 tablespoons (1 stick plus 1 tablespoon) unsalted butter, at room temperature", 
            "1 large egg", 
            "1 large egg white", 
            "1 tablespoon brandy (optional)", 
            "1 1/2 teaspoons finely grated orange zest", 
            "1/2 to 1 cup whole, fresh cranberries", 
            "1 Great Unshrinkable Sweet Tart Shell, baked and cooled", 
            "Powdered sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cranberry-pecan-frangipane-tart1.jpg?w=500", 
        "tags": [
            "Cranberries", 
            "Fall", 
            "Fruit", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2008/11/cranberry-pecan-frangipane-tart/", 
        "title": "cranberry pecan frangipane tart", 
        "directions": [
            "For pecan filling: Finely grind pecans and flour in processor. Mix in sugar, then butter, orange zest and brandy (if using). Blend until smooth. Mix in egg and egg white. Transfer filling to medium bowl. Cover and chill at least 3 hours. (Can be made 2 days ahead. Keep chilled.)", 
            "Position rack in center of oven and preheat to 350°F. Spread pecan filling evenly in baked tart crust. Arrange cranberries on top. Use the smaller amount for a sparsely cranberried tart like you see in these pictures. Use the larger amount if you, like us, really like things extra tart.", 
            "Bake tart until golden and tester inserted into center of filling comes out clean, about 44 to 55 minutes. Cool tart in pan on rack. Push pan bottom up, releasing tart from pan. (Can be made 8 hours ahead. Let stand at room temperature.) Cut tart into wedges; sprinkle with powdered sugar, if desired, and serve.", 
            "Do ahead: Tart dough can be made, wrapped twice and kept in the fridge for a few days, or in the freezer for a week or two. Baked pastry shell, once cool, can be covered in foil and kept at room temperature for up to two days. Frangipane can be made up to three days in advance, and kept in the fridge until ready to fill the shell. Cranberries keep well in the fridge, but even longer in the freezer. Tart can be made up to a day in advance and wrapped in the fridge (probably longer in the fridge, but you may risk losing some crispness) or at room temperature."
        ], 
        "date": "2008-11-19T23:52:25+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 1/4 cups (155 grams) all-purpose flour", 
            "1 1/2 teaspoons (6 grams) granulated sugar", 
            "1/2 teaspoon (3 grams) fine sea or table salt", 
            "1 stick (4 ounces or 115 grams) cold unsalted butter, cut into chunks", 
            "1/4 cup (60 ml) very cold water, plus an additional tablespoon if needed", 
            "Filling", 
            "4 1/2 cups fresh or frozen cranberries (from 1 1/2 12-ounce bags)", 
            "1 cup granulated sugar, plus 1 to 2 more tablespoons, if desired, to taste", 
            "A few gratings of orange zest (yes, clementine zest works great here too)", 
            "A pinch of salt", 
            "1 tablespoon cornstarch", 
            "Streusel", 
            "2/3 cup rolled oats or 1/2 cup oat flour", 
            "1/2 cup all-purpose flour", 
            "1/3 cup granulated sugar", 
            "1/3 cup light or dark brown sugar", 
            "1/2 teaspoon ground cinnamon", 
            "1/4 teaspoon coarse or sea salt", 
            "3/4 cup pecans, toasted if you have the time", 
            "6 tablespoons unsalted butter, melted and cooled", 
            "To serve", 
            "Powdered sugar, sweetened whipped cream with a splash of vanilla extract or vanilla ice cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cranberry-pie-with-thick-pecan-crumble1.jpg?w=640", 
        "tags": [
            "Cranberries", 
            "Fall", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2014/11/cranberry-pie-with-thick-pecan-crumble/", 
        "title": "cranberry pie with thick pecan crumble", 
        "directions": [
            "Make the pie dough: ", 
            "Form the crust: On a floured counter, roll the dough out into a 12 to 13-inch circle-ish shape. Fold dough gently in quarters without creasing and transfer to a 9-inch standard (not deep-dish) pie plate. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. Return to fridge until ready to fill. ", 
            "[Optional: If you’d like to par-bake the crust, once you’ve rolled it out, freeze it for 10 minutes inside your pie tin, until solid. Prick unbaked crust with a fork several times. Line it with lightly buttered foil. Fill with pie weights, dried beans or pennies. Bake at 400°F (205°C) on rimmed baking sheet 15 minutes. Remove paper or foil and weights, and bake 5 to 10 more minutes until crust is golden brown and lightly crisp.]", 
            "Heat oven: (Or reduce oven heat, if you just par-baked your crust) to 375°F (190°C).", 
            "Make the filling: Combine all filling ingredients — no need to defrost frozen cranberries, they’ll just need a couple extra minutes to warm up — in a medium saucepan over medium heat. After about 5 minutes, berries will begin to leak juices. Cook, stirring for 5 minutes more until filling is loose. If desired, you can lightly crush the mixture once or twice with a potato masher, but try to leave most berries intact. Transfer filling to a bowl to let it cool slightly for 5 to 10 minutes while you make the crumble topping.", 
            "Make the topping: If using whole oats, grind them to a powder in a food processor. Add pecans and coarsely grind them too. Add remaining ingredients except the butter, pulsing a few times to combine. Add butter, pulsing until crumbles form. Sprinkle topping over cranberry filling.", 
            "Bake pie: For 45 to 50 minutes, until juices are bubbling enough that they splash a bit onto the crumb topping. If pie browns too quickly, cover top with a piece of foil for remaining baking time. Transfer to a wire rack to cool a bit before serving showered with powdered sugar and alongside whipped cream or vanilla ice cream."
        ], 
        "date": "2014-11-24T12:16:16+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup sugar", 
            "3/4 cup fresh or thawed frozen cranberries, chopped", 
            "1/2 cup water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/intensely-almond-cake-with-cranberry-syrup1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Cranberries", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/01/cranberry-syrup-and-an-intensely-almond-cake/", 
        "title": "cranberry syrup (and an intensely almond cake)", 
        "directions": [
            "Cook sugar in a dry 1 1/2-quart heavy saucepan over moderate heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally with a fork or flat whisk, until sugar is melted and turns a deep golden caramel. Tilt pan and carefully add cranberries and water (caramel will harden and vigorously steam). Simmer over moderately low heat, stirring, until caramel is completely dissolved, then pour syrup through a very fine sieve into a heatproof bowl, pressing hard on solids. Let cool.", 
            "To use: Stir into sparkling water, sparkling wine, drizzle over ice cream or yogurt or puddle underneath an intense almond cake.", 
            "Play around: Stir in a couple inches of scraped vanilla bean pulp with the cranberries for a cranberry-vanilla syrup. Add a tablespoon of orange zest in with the cranberries for an orange-hinted cranberry syrup."
        ], 
        "date": "2010-01-14T22:44:47+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 vanilla bean, split lengthwise", 
            "1 3/4 cups sugar", 
            "2 cups fresh or thawed frozen cranberries (6 ounces)", 
            "2 cups plus 1 tablespoon all-purpose flour, divided", 
            "2 teaspoons baking powder", 
            "3/4 teaspoon salt", 
            "1 stick plus 1 tablespoon unsalted butter, softened, divided", 
            "2 large eggs", 
            "1/2 cup whole milk", 
            "Confectioners sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cranberry-vanilla-coffee-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Cranberries", 
            "Everyday Cakes", 
            "Fall", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/12/cranberry-vanilla-coffee-cake/", 
        "title": "cranberry vanilla coffee cake", 
        "directions": [
            "Preheat oven to 375°F with rack in middle. Generously butter a 9- by 2-inch round cake pan. Line bottom with a round of parchment paper and butter parchment.", 
            "Scrape seeds from vanilla bean into a food processor with tip of a paring knife (reserve pod for another use if desired). Add sugar and pulse to combine. Transfer to a bowl.", 
            "Pulse cranberries with 1/2 cup vanilla sugar in processor until finely chopped (do not purée).", 
            "Whisk together 2 cups flour, baking powder, and salt. Beat together 1 stick butter and 1 cup vanilla sugar in a bowl with an electric mixer at medium-high speed until pale and fluffy. Add eggs 1 at a time, beating well after each addition. Scrape down side and bottom of bowl. Reduce speed to low and mix in flour mixture and milk alternately in batches, beginning and ending with flour, until just combined.", 
            "Spread half of batter in pan, then spoon cranberries over it, leaving a 1/2-inch border around edge. Spoon small bits of the remaining batter over the top of the cranberries and smooth them with as gentle of a hand as possible.", 
            "Blend remaining 1/4 cup vanilla sugar with remaining tablespoon each of butter and flour using your fingertips. Crumble over top of cake.", 
            "Bake until a wooden pick inserted into cake (not into cranberry filling) comes out clean and side begins to pull away from pan, 45 to 50 minutes. Cool in pan 30 minutes, then remove from pan and cool completely, crumb side up.", 
            "Do ahead: Coffee cake can be made 1 day ahead and kept, tightly wrapped, at room temperature."
        ], 
        "date": "2008-12-12T19:51:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/4 teaspoon salt", 
            "Scant 1/4 teaspoon ground cinnamon", 
            "5 tablespoons unsalted butter, at room temperature", 
            "3/4 cup (packed) light brown sugar", 
            "2 large eggs", 
            "1/3 cup flavorless oil, such as canola or safflower", 
            "Grated zest of 1 orange", 
            "1 1/2 teaspoons pure vanilla extract", 
            "8 purple or red plums (or even Italian prune plums, when they are in season), halved and pitted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/dimply-plum-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/08/dimply-plum-cake/", 
        "title": "dimply plum cake", 
        "directions": [
            "Center a rack in the oven and preheat the oven to 350°F. Butter an 8-inch square baking pan, dust the inside with flour, tap out the excess and put the pan on a baking sheet. (Alternately, you can use this spray to butter and flour, which is indeed my greatest baking Joy.)", 
            "Whisk the flour, baking powder, salt and cinnamon together.", 
            "Working with a mixer, beat the butter at medium speed until it’s soft and creamy, about 3 minutes. Add the sugar and beat for another 3 minutes, then add the eggs, one at a time, and beat for a minute after each egg goes in. Still working on medium speed, beat in the oil, zest and vanilla; the batter will look smooth and creamy, almost satiny. Reduce the mixer speed to low and add the dry ingredients, mixing only until they are incorporated.", 
            "Run a spatula around the bowl and under the batter, just to make sure there are no dry spots, then scrape the batter into the pan and smooth the top. Arrange the plums cut side up in the batter–Dorie says she usually makes four rows of four plum halves each–jiggling the plums a tad just so they settle comfortably into the batter.", 
            "Bake for about 30 to 40 minutes (Dorie says 40, mine was done in 30 so check early and often), or until the top is honey brown and puffed around the plums and a thin knife inserted into the center of the cake comes out clean. Transfer the cake to a rack and cool for 15 minutes during which time the plums juices will seep back into the cake then run a knife around the sides of the pan and unmold the cake. Invert and cool right side up.", 
            "Once cool, I dusted mine with powdered sugar. (It soaks into the plums, but keeps the cake a speckly white.)", 
            "You can wrap the cake and keep it at room temperature for up to 2 days, during which time it will get softer and moister."
        ], 
        "date": "2008-08-21T08:54:58+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust and crumbs", 
            "3/4 cup unsalted butter (1 1/2 sticks), chilled, cut into small pieces, plus more for pan", 
            "1/3 cup (1 3/4 ounces of 49 grams) hazelnuts", 
            "1 1/2 cups (188 grams) all-purpose flour", 
            "1/2 cup granulated sugar", 
            "1/3 cup packed light or dark brown sugar", 
            "1/2 teaspoon ground cinnamon", 
            "1/2 teaspoon table salt", 
            "Filling", 
            "1 pound ripe but firm plums (about 4 standard black ones or 12 smaller Italian plums; I used a mix of both)", 
            "1 tablespoon (8 grams) all-purpose flour", 
            "1/4 cup plus 2 tablespoons (6 tablespoons) granulated sugar", 
            "1 large egg, lightly beaten", 
            "1 large egg yolk", 
            "1/3 cup heavy cream", 
            "1/4 cup milk", 
            "1/4 teaspoon table salt", 
            "1/4 teaspoon ground cinnamon", 
            "Grated nutmeg, optional"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/hazelnut-plum-crumb-tart1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Plum", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2011/08/hazelnut-plum-crumb-tart/", 
        "title": "hazelnut plum crumb tart", 
        "directions": [
            "Preheat you oven to 350 degrees. Butter a 9-inch springform pan; set aside. Spread hazelnuts on a baking sheet. Bake until fragrant, about 10 to 15 minutes, then let cool enough to remove the skins.*  Place nuts in the bowl of a food processor, and pulse until medium fine, about 30 pulses.", 
            "Transfer nuts to the bowl of an electric mixer and add 1 1/2 cups flour, 1/2 cup granulated sugar, brown sugar, 1/2 teaspoon cinnamon, and 1/2 teaspoon salt; mix until just combined. Add butter, and mix on low speed until crumbs begin to stick together, about 2 to 3 minutes. Press 3 cups of crumb into the bottom of the prepared pan and about 1 1/2 inches up the sides of the pan to form crust; I like to use the bottom and side of a heavy measuring cup to help press the crumbs neatly down and up the side, forming a nice inner corner. Set remaining crumb mixture (about 1 1/2 cups) aside. Transfer crust to the oven; bake until it appears to be set, 15 to 20 minutes; go easy on this baking time as I found it was easy to overbake the outer corners of the tart base in the final baking. It’s going to slump a wee bit in the oven; feel free to press the sides back up the sides with the back of a metal spoon when it comes out of the oven to get them back in place. Set aside to cool (the fridge will expedite this for you).", 
            "Slice plums in half, and remove pits. Slice larger plums into eighths and smaller ones into quarters and arrange in cooled crust. In a medium bowl, whisk together 1 tablespoon flour and 1/4 cup plus 2 tablespoons granulated sugar. Whisk in egg, egg yolk, heavy cream, milk, 1/4 teaspoon cinnamon, 1/4 teaspoon salt, and a few gratings of fresh nutmeg. Pour custard over fruit; sprinkle with reserved crumb mixture. Transfer tart to the oven; bake until custard has set and is slightly golden, 45 to 50 minutes. Let rest at least 25 minutes before cutting if serving warm. You can serve this warm or at room temperature but we much preferred it fully chilled.", 
            "* On toasting and skinning hazelnuts: I find that the trick to getting the skins off it to toast them quite well; keep an eye on them so they don’t burn, but let them get some color. That extra color will translate to deeper flavor and looser skins; everyone wins. Some people like to rub the nuts in a dishtowel to loosen the skins but I hate the mess this makes all over my kitchen when I inevitably forget that the towel is a mess of flakes and pick it up. Instead, with dry hands, I roll a few together between my palms until the skins come off and the mess stays on the tray. In general, I almost never get all of the skins off but it doesn’t matter; as long as most of the skins are removed, you won’t have any nagging bitterness."
        ], 
        "date": "2011-08-21T14:31:35+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (115 grams or 4 ounces) unsalted butter", 
            "1 cup (130 grams)  all-purpose flour", 
            "1 cup (200 grams) sugar, divided", 
            "1 1/2 teaspoons baking powder", 
            "1/2 teaspoon fine sea or table salt", 
            "3/4 cup (175 ml) whole milk", 
            "2 medium apples, peeled", 
            "3 small (I used Italian prune plums) or 2 medium plums, no need to peel", 
            "3/4 teaspoon ground cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/magic-apple-plum-cobbler1.jpg?w=750", 
        "tags": [
            "Apple", 
            "Crumbles/Crisps", 
            "Fall", 
            "Photo", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/09/magic-apple-plum-cobbler/", 
        "title": "magic apple plum cobbler", 
        "directions": [
            "Heat your oven to 350°F. Place butter in a 2 to 3-quart (3 was recommended, but I had a lot of extra space) baking dish or a 7×11-inch cake pan. Place pan in oven for 5 to 7 minutes, until butter has melted. Tilt the dish to ensure it is evenly coated with butter.\nWhisk together the flour, 3/4 cup sugar, baking powder and salt in a small bowl and stir in milk. Mix until smooth. Pour batter over the butter but do not stir, even if it looks like a puddle-y buttery mess.", 
            "Cut apples into 8 wedges, small plums into 4 wedges and medium ones into 4 to 6. Space fruit over batter. Sprinkle with cinnamon and then remaining sugar.", 
            "Bake the cobbler until it is set and golden on top, 35 to 40 minutes. Cool slightly on a rack. Serve the cobbler warm or at room temperature.\n"
        ], 
        "date": "2016-09-16T12:07:20+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 tablespoons freshly grated lemon zest (from about 2 lemons; preferably Meyer)", 
            "2 1/2 cups all-purpose flour", 
            "1/2 cup sugar plus 3 tablespoons additional if using fresh cranberries", 
            "1 tablespoon baking powder", 
            "1/2 teaspoon salt", 
            "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits", 
            "1 1/4 cups fresh cranberries, chopped coarse, or 1 1/4 cups dried cranberries, if you insist", 
            "1 large egg", 
            "1 large egg yolk", 
            "1 cup heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/meyer-lemon-and-fresh-cranberry-scones1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Cranberries", 
            "Fall", 
            "Fruit", 
            "Lemon", 
            "Photo", 
            "Scones/Biscuits", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/11/meyer-lemon-and-fresh-cranberry-scones/", 
        "title": "meyer lemon and fresh cranberry scones", 
        "directions": [
            "Accompaniment: creme fraiche or whipped cream", 
            "Preheat oven to 400°F. and line a large baking sheet with parchment paper.", 
            "With a vegetable peeler remove the zest from lemons and chop fine, reserving lemons for another use.", 
            "In a food processor pulse flour, 1/2 cup sugar, baking powder, salt, butter and zest until mixture resembles coarse meal and transfer to a large bowl.", 
            "In a small bowl toss together fresh cranberries and 3 tablespoons sugar and stir into flour mixture. If using dried fruit, add to flour mixture.", 
            "In another small bowl lightly beat egg and yolk and stir in cream. Add egg mixture to flour mixture and stir until just combined.", 
            "On a well-floured surface with floured hands pat dough into a 1-inch-thick round (about 8 inches in diameter) and with a 2-inch round cutter or rim of a glass dipped in flour cut out as many rounds as possible, rerolling scraps as necessary. Arrange rounds about 1 inch apart on baking sheet and bake in middle of oven 15 to 20 minutes, or until pale golden.", 
            "[I decided to rebel and pat them into a square and cut them into smaller ones. The square shapes didn’t keep very well, so I don’t recommend this! Learn from me, people.]", 
            "Serve scones warm with creme fraiche or whipped cream. Scones keep, individually wrapped in plastic wrap and foil, chilled, 1 day or frozen 1 week."
        ], 
        "date": "2008-11-15T11:58:01+00:00"
    }, 
    {
        "ingredient_list": [
            "Crumble", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 cup (50 grams) granulated sugar", 
            "3 tablespoons (37 grams) packed dark or light brown sugar", 
            "1 cup gingersnap crumbs (4 ounces or 113 grams or about 16 storebought cookies)", 
            "1/8 teaspoon ground ginger", 
            "1/8 teaspoon table salt", 
            "Pinch of white pepper, especially if your gingersnaps aren’t particularly snappish", 
            "1/2 cup (4 ounces or 113 grams or 1 stick) unsalted butter, melted and cooled", 
            "Filling", 
            "2 pounds (about 4 to 5) large ripe pears (I used Anjou, suggested in the original recipe) peeled, halved, cored and sliced 1/4 inch thick", 
            "1 1/2 cups (6 ounces or 170 grams) fresh cranberries", 
            "1 tablespoon (15 ml) lemon juice", 
            "1/2 teaspoon finely grated lemon zest", 
            "1/2 teaspoon vanilla extract", 
            "1/2 cup (100 grams) granulated sugar", 
            "2 tablespoons (14 grams) cornstarch"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/10/pear-cranberry-and-gingersnap-crumble.jpg?w=750", 
        "tags": [
            "Cranberries", 
            "Crumbles/Crisps", 
            "Fall", 
            "Pear", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/10/pear-cranberry-and-gingersnap-crumble/", 
        "title": "pear cranberry and gingersnap crumble", 
        "directions": [
            "Preheat the oven to 350°F.", 
            "Stir together the flour, granulated sugar, brown sugar, gingersnap crumbs, ginger and salt. Stir in the melted butter until large crumbs form.", 
            "In a 1 1/2 to 2 quart baking dish, mix the pears, cranberries, lemon juice, lemon zest and vanilla. In a small bowl, whisk the sugar and cornstarch together then toss it with the fruit mixture in the pan. Sure, you could do this in a bowl but then you’d also have to wash that bowl and hooray for fewer dishes.", 
            "Sprinkle the gingersnap crumble over the fruit. Set the crumble on a foil-lined baking sheet (in a 2 quart dish, mine didn’t come close to bubbling over but I see no reason to risk it) and bake it for about 45 minutes, until the crumble is a shade darker and you see juices bubbling through the crumbs. See how long you can wait before digging in."
        ], 
        "date": "2011-10-26T09:47:57+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 teaspoons or 1 (1/4-ounce) package active dry yeast", 
            "1/4 cup warm water (105–110°F)", 
            "2 cups (267 grams) plus 2 tablespoons (18 grams) all-purpose flour, divided", 
            "1 cup sugar (220 grams), divided", 
            "1/2 teaspoon salt", 
            "1/2 cup plain whole-milk yogurt (124 grams) (preferably Greek-style, but I used regular yogurt and it worked just fine) at room temperature", 
            "1 large egg, warmed in shell in warm water five minutes", 
            "1 1/2 teaspoons grated lemon zest", 
            "1 teaspoon pure vanilla extract", 
            "1 1/4 sticks (5 ounces or 142 grams) unsalted butter, cut into tablespoons and softened, divided", 
            "3/4 pound firm-ripe plums (about 4 small), halved and pitted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/plum-kuchen1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/07/plum-kuchen/", 
        "title": "plum kuchen", 
        "directions": [
            "Stir together yeast and warm water in mixer bowl and let stand until foamy, about five minutes. (If mixture doesn’t foam, start over with new yeast.)", 
            "Add two cups flour, 2/3 cup sugar, salt, yogurt, egg, zest, and vanilla to yeast mixture and mix at medium-low speed 1 minute. Beat in one stick of the butter, one tablespoon at a time, until incorporated. Beat at medium speed until dough is smooth and shiny, about five minutes. (Dough will be very sticky.) Scrape down side of bowl and sprinkle dough with remaining two tablespoons flour. Cover bowl loosely with a kitchen towel or plastic wrap and let dough rise in a draft-free place at warm room temperature until doubled, 1 1/2 to 2 hours.", 
            "Spread remaining two tablespoons butter in bottom of an 8- or 9-inch square baking pan and sprinkle with remaining 1/3 cup sugar. Cut each plum half into five or six slices and arrange in one layer in pan. (I had quite a bit of extra plum slices to snack on, but my plums were also giants.)", 
            "Stir dough until flour is incorporated, then spread evenly over plums. Loosely cover with buttered plastic wrap, then kitchen towel. Let rise in a draft-free place at warm room temperature until almost doubled, about 1 1/2 hours.", 
            "Preheat oven to 375°F with rack in middle. Bake until kuchen is golden-brown and a wooden pick inserted into center comes out clean, 30 to 35 minutes. Cool in pan five minutes, then invert and unmold onto a rack to cool completely.", 
            "Serve with additional yogurt, lightly sweetened, or sweetened crème fraîche."
        ], 
        "date": "2009-07-31T13:35:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (130 grams) all-purpose flour", 
            "1/2 cup (55 grams) sliced almonds, toasted or equivalent weight almond flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 teaspoon almond extract", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "2/3 cup (85 grams) all purpose flour", 
            "1/3 cup (packed) almond paste (about 3.5 ounces or half a 7-ounce tube)", 
            "1/3 cup (65 grams) light brown sugar", 
            "1/4 teaspoon fine sea or table salt", 
            "4 tablespoons (2 ounces or 55 grams) chilled unsalted butter, cut into cubes", 
            "1/4 cup (30 grams) sliced, toasted almonds", 
            "1 pounds plums (about 6 to 7), halved, pitted, thinly sliced", 
            "3 tablespoons granulated sugar", 
            "1 1/2 tablespoons cornstarch"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/plum-squares-with-marzipan-crumble.jpg?w=750", 
        "tags": [
            "Bars", 
            "Crumbles/Crisps", 
            "Photo", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/09/plum-squares-with-marzipan-crumble/", 
        "title": "plum squares with marzipan crumble", 
        "directions": [
            "Heat oven to 375 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.\nMake the crust: Combine the flour, almonds, salt, sugar and extract in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.\nMake crumble: Blend flour, almond paste, sugar and salt in processor until almond paste is finely ground. Add butter and blend, using on/off turns, until coarse crumbs form. Transfer crumble to bowl; mix in almonds.\nMake filling: Combine all ingredients in medium bowl; toss to coat well.\nAssemble squares: Sprinkle 1/2 cup prepared crumble over cooled crust. Top with plum mixture. Sprinkle with remaining crumble.", 
            "Bake: Until filling bubbles thickly and top is golden, about 35 to 40 minutes. If the bars brown too quickly, cover them with foil for the remaining baking time. Cool in pan. I like to hurry this (too) along in the fridge or freezer. Once firm, I’ll use the parchment sling to remove the bars and cut them more cleanly on a cutting board. Dust with powdered sugar, if desired, before serving.\nDo ahead: These bars keep for up to a week in the fridge, longer in the freezer."
        ], 
        "date": "2016-09-01T07:33:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (125 grams) all-purpose flour", 
            "1 teaspoon (5 grams) baking powder (the aluminum-free kind, if you can find it)", 
            "Large pinch of salt", 
            "1 cup (200 grams) granulated sugar plus 1 to 2 tablespoon (depending on sweetness of plums)", 
            "1/2 cup (115 grams or 8 tablespoons) unsalted butter, softened", 
            "2 large eggs", 
            "12 smallish purple Italian purple plums, halved and pitted", 
            "2 teaspoons (10 ml) fresh lemon juice", 
            "1 teaspoon or tablespoon ground cinnamon (see Note up top for explanation)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/purple-plum-torte11.jpg?w=640", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fall", 
            "Photo", 
            "Picnics", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/10/purple-plum-torte/", 
        "title": "purple plum torte", 
        "directions": [
            "Heat oven to 350°F. Sift or whisk together flour, baking powder and salt in a medium bowl. In a larger bowl, cream butter and 1 cup sugar together with an electric mixer until fluffy and light in color. Add the eggs, one at a time and scraping down the bowl, then the dry ingredients, mixing until just combined. ", 
            "Spoon batter into an ungreased 9-inch springform pan (but if you’re worried, you can always lightly coat it first with butter or a nonstick spray) and smooth the top. Arrange the plums, skin side up, all over the batter, covering it. Sprinkle the top with lemon juice, then cinnamon, then remaining sugar. ", 
            "Bake until cake is golden and a toothpick inserted into a center part of the cake comes out free of batter (but of course not plum juice), about 45 to 50 minutes. Cool on rack. ", 
            "Once cool, if you can stand it, and I highly recommend trying, leave it covered at room temperature overnight as this cake is even better on the second day, when those plum juices further release into the cake around it, becoming not just “cake with plum,” but cakeplumughyum (official terminology, there). "
        ], 
        "date": "2013-10-11T10:50:35+00:00"
    }, 
    {
        "ingredient_list": [
            "Lid", 
            "7 tablespoons (100 grams) unsalted butter, at room temperature", 
            "1/2 cup (100 grams) granulated sugar", 
            "1/2 teaspoon finely grated orange zest", 
            "1 large egg, lightly beaten", 
            "1 cup plus 6 1/2 tablespoons (175 grams) all-purpose flour", 
            "1/2 teaspoon baking powder", 
            "1/4 teaspoon coarse or flaky salt (or less of table salt)", 
            "Milk or cream, for brushing crust", 
            "Coarse or fine sugar, for sprinkling crust", 
            "Softly whipped, lightly sweetened cream, for serving", 
            "Filling", 
            "1 pound ripe prune plums or greengages, halved, pitted, and halved again (i.e. quartered)", 
            "1 pound apples, peeled, cored and cut into smaller chunks (than you see in my photos)", 
            "2 tablespoons sugar", 
            "1/8 teaspoon ground cinnamon", 
            "Squeeze or two of orange or lemon juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/single-crust-apple-plum-pie.jpg?w=749", 
        "tags": [
            "Apple", 
            "Fall", 
            "Photo", 
            "Plum", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2010/10/single-crust-plum-and-apple-pie/", 
        "title": "single-crust plum and apple pie", 
        "directions": [
            "Make the lid: In a stand mixer, cream the butter, sugar and orange zest until light and fluffy. Mix in the lightly beaten egg and scrape down sides. Slowly add the flour, baking powder and salt and beat until combined. Scrape dough into a piece of waxed paper or plastic wrap, and stick in the freezer for 10 to 20 minutes, or until firmed up.", 
            "Assemble the pie: Preheat oven to 350°F (180°C or gas mark 4) Butter a pie or baking dish. Add the fruit and spinkle it with the sugar, cinnamon and orange or lemon juice. Gently toss the ingredients together once or twice; don’t worry, they’ll “muddle” well once cooking in the oven.", 
            "Roll out the firmed-up lid dough on a very well floured counter and gently lift it onto the pie and trim the overhang. It will tear. This is fine, and all the better to let juice erupt through. If it flusters you, you can use some of the trimmings to patch it up but still, the pie will bubble through in other places. Brush the crust with milk or cream, sprinkle with sugar and bake for 40 minutes, until lightly golden on top. Scoop onto dishes and serve with whipped cream."
        ], 
        "date": "2010-10-01T11:33:17+00:00"
    }, 
    {
        "ingredient_list": [
            "Crepes", 
            "2 tablespoons butter, melted and cooled slightly (I browned this first, which probably won’t surprise you)", 
            "1/2 cup milk (fat level shouldn’t matter, but I use whole)", 
            "2 large eggs", 
            "1/2 cup all-purpose flour", 
            "Two pinches of salt", 
            "Few gratings fresh nutmeg", 
            "2 tablespoons honey", 
            "Plums", 
            "1 pound sugar or other plums, pitted and cut into quarters if tiny, eighths if larger", 
            "1 tablespoon unsalted butter", 
            "1 tablespoon honey", 
            "Pinch of ground cinnamon", 
            "Juice of half a lemon", 
            "Assembly", 
            "1 cup ricotta (ever wanted to make your own?)", 
            "3 tablespoons slivered fresh mint leaves", 
            "Toasted and chopped pistachios or almonds", 
            "Additional honey, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sugar-plum-crepes-with-ricotta-and-honey1.jpg?w=500", 
        "tags": [
            "Pancakes", 
            "Photo", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2011/08/sugar-plum-crepes-with-ricotta-and-honey/", 
        "title": "sugar plum crepes with ricotta and honey", 
        "directions": [
            "Make crepes: In a blender, combine crepe ingredients. (Alternately, in a bowl with an immersion blender, or whisked vigorously by hand.) Cover with plastic wrap and refrigerate for an hour or up to two days.", 
            "Preheat a medium skillet or crepe pan over medium-high heat. Once heated, brush pan lightly with melted butter or oil. Pour 1/4 cup batter into skillet, swirling it until it evenly coats the bottom and cook, undisturbed, until the bottom is golden and the top is set, about 2 minutes. Carefully flip and cook on other side for 5 to 10 seconds. Transfer wrapper to paper towel covered plate. Continue with remaining batter.", 
            "Prepare filling: (Optional, see Note up top.) Melt the butter in heavy, large skillet (or, the one you just used for crepes, because I’m on day 9 of a broken dishwasher and will not create additional work for myself) over moderately high heat. Add the plums and cook them for 2 minutes, tossing them about until they’re warmed through. Add the honey and cinnamon and cook them for 1 minute more. Squeeze the juice of half a lemon over them and transfer to a bowl. Cover the bowl with foil if you’re looking to keep them warm for a while.", 
            "Assemble: Lay a crepe on a plate. Dollop a couple spoonfuls of ricotta down middle of crepe. Add a spoonful or two of warm plums. Sprinkle with pistachios and mint, if using. Drizzle with extra honey, if desired (it otherwise won’t be very sweet). Fold crepe sides over each other, so that they slightly overlap. Garnish with extra mint. Close your eyes pretend you’re eating them on a boat in the Mediterranean, watching the sun slip behind the sea. Try not to impale your foot with a wooden racecar while you do, as it’s bad for morale.", 
            "Do ahead: Fully cooked, crepes can be kept stacked and wrapped in the fridge for two days, if needed. The sauteed fruit can be cooked ahead of time, gently rewarmed when needed."
        ], 
        "date": "2011-08-06T18:39:31+00:00"
    }, 
    {
        "ingredient_list": [
            "For crust", 
            "1 cup all purpose flour", 
            "1 tablespoon sugar", 
            "1/8 teaspoon salt", 
            "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces", 
            "2 tablespoons ice water", 
            "1/4 teaspoon vanilla extract", 
            "For filling", 
            "1/3 cup whole almonds (about 2 ounces)", 
            "1/3 cup sugar", 
            "1 large egg", 
            "3 tablespoons unsalted butter, room temperature", 
            "4 teaspoons framboise (raspberry liqueur) or brandy", 
            "12 ounces ripe red-skinned plums, pitted, cut into 3/4-inch-thick wedges", 
            "1/4 cup red currant jelly", 
            "Make crust: ", 
            "Preheat oven to 375°F. Combine first 3 ingredients in processor. Using on/off turns, cut in butter until mixture resembles coarse meal. Mix 2 tablespoons ice water and vanilla in small bowl. Pour water mixture over dough. Process until moist clumps form. ", 
            "Make filling:", 
            "Finely grind almonds with sugar in processor. Add egg, butter and 2 teaspoons framboise. Process until batter forms. Pour filling into crust. Arrange plums atop filling. Bake until plums are tender and filling is golden and set, about 50 minutes."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/tartlets-not-innocent1.jpg?w=500", 
        "tags": [
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Plum", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2007/08/tartlets-not-innocent/", 
        "title": "plum-almond tart", 
        "directions": [
            "Melt jelly with remaining 2 teaspoons framboise in heavy small saucepan over medium-low heat. Brush jelly mixture over plums. ", 
            "Cool tart. Serve at room temperature with whipped cream, if desired. "
        ], 
        "date": "2007-08-16T17:27:23+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/upside-down-cranberry-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Cranberries", 
            "Fall", 
            "Photo", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2010/11/upside-down-cranberry-cake/", 
        "title": "upside-down cranberry cake", 
        "directions": [
            "Preheat oven to 375°F. Grease a 9-inch round cake pan with butter and cover the bottom with parchment paper (see Note above). In a medium saucepan over medium heat, combine the brown sugar, 4 tablespoons (1/4 cup) of the melted butter, molasses and 1/4 cup water and bring to a boil. Stir well and pour into prepared cake pan. Set pan aside.", 
            "Sift the flour, sugar, baking powder and salt together into a bowl or onto a sheet of waxed paper and set aside. In the bowl of an electric mixture fitted with the whisk attachment (eh, I just used a handmixer with standard beaters) beat the eggs and sour cream together at medium speed until well blended. Add optional flavorings of your choice. Scrape down the bowl and add remaining melted butter (1/2 cup) and beat until combined. Add flour mixture and beat until smooth.", 
            "Add the cranberries to the prepared baking pan and gently press the fruit into an even layer. Dollop the batter on top and use an offset spatula to gently nudge it into place without disturbing the cranberries underneath. Bake on the center rack (with a tray underneath to catch drips… just in case; mine did not overflow but came stressfully close) until golden and a tester inserted into just the cake comes out clean, which took 30 to 35 minutes in my oven but is suggested to take 45. Please, please check yours on the early side. Remove from the oven and let cool in pan for 15 minutes. Run a thin knife around the inside of the pan then insert over a flat platter that is (Learn From My Mistakes Alert!) larger than your cake pan, to catch any puddling or jumping cranberries. Remove the parchment paper.", 
            "Serve warm, with freshly whipped cream. However, this cake wasn’t half bad two to three days layer, kept covered at room temperature."
        ], 
        "date": "2010-11-10T14:06:58+00:00"
    }
]