{
  "date": "2012-10-19T11:38:05+00:00",
  "directions": [
    "Heat your oven to 400°F. Line a rimmed baking sheet or jelly roll pan with parchment paper. Ideally you would use a 10×15-inch jelly roll pan, as I do here. A smaller pan will make a thicker tart (and you might need fewer apples). In a larger pan, you can still fit a 10×15-inch tart, which I think is the ideal size here. ",
    "Lightly flour your counter and lay out your pastry. Flour the top and gently roll it until it fits inside your baking sheet, and transfer it there. Try not to roll it any bigger than you’ll need it, or you’ll have to trim, which means you’ll have to sprinkle the trimmings with cinnamon-sugar and bake them into cookie-sized segments for snacks. And that would be terrible.",
    "Peel the apples and cut them in half top-to-bottom. Remove the cores and stems (I like to use a melon baller and/or a pairing knife). Slice the apples halves crosswise as thinly as you can with a knife, or to about 1/16-inch thickness with a mandoline. Leaving a 1/2-inch border, fan the apples around the tart in slightly overlapping concentric rectangles — each apple should overlap the one before so that only about 3/4-inch of the previous apple will be visible — until you reach the middle. Sprinkle the apples evenly with the first two tablespoons of sugar then dot with the first two tablespoons butter. ",
    "Bake for 30 minutes, or until the edges of the tart are brown and the edges of the apples begin to take on some color. If you sliced your apples by hand and they were on the thicker side, you might need a little more baking time to cook them through. The apples should feel soft, but dry to the touch. If you puffed pastry bubbles dramatically in any place during the baking time, simply poke it with a knife or skewer so that it deflates. This is fun, I promise.",
    "Meanwhile, about 20 minutes into the baking time, make your glaze. In a small saucepan over medium-high heat, melt your last 1/4 cup sugar; this will take about 3 minutes. Cook the liquefied sugar to a nice copper color, another minute or two. Off the heat, add the sea salt and butter and stir until the butter melts and is incorporated. Add the heavy cream and return to the stove over medium heat. Cook, stirring constantly, until you have a lovely, bronzed caramel syrup, just another minute, two, tops. Set aside until needed. You may need to briefly rewarm it to thin the caramel before brushing it over the tart.",
    "After the tart has baked, transfer it to a cooling rack, but leave the oven on. Using very short, gentle strokes, and brushing in the direction that the apples fan to mess up their design as little as possible, brush the entire tart, including the exposed pastry, with the salted caramel glaze. You might have a little leftover. Whatever you do, do not spread it on a sliced apple for a snack. Trust me. ",
    "Return the apple tart to the oven for 5 to 10 more minutes, until the caramel glaze bubbles. Let tart cool complete before cutting into 12 squares. Serve plain, with coffee or tea, if you’re feeling grown-up or with a scoop of vanilla ice cream, if you’re feeling particularly indulgent."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/10/apple-mosaic-tart-with-salted-caramel.jpg?w=750",
  "ingredient_list": [
    "Tart base",
    "14-ounce package puff pastry, defrosted in fridge overnight",
    "3 large or 4 medium apples (about 1 1/4 pounds)",
    "2 tablespoons granulated sugar",
    "2 tablespoons unsalted butter, cold, cut into small bits",
    "Salted caramel glaze",
    "1/4 cup granulated sugar",
    "2 tablespoons unsalted butter (or salted, but then ease up on the sea salt)",
    "1/4 teaspoon flaky sea salt (or half as much table salt)",
    "2 tablespoons heavy cream"
  ],
  "tags": [
    "Apple",
    "Fall",
    "Photo",
    "Tarts/Pies"
  ],
  "title": "apple mosaic tart with salted caramel",
  "url": "https://smittenkitchen.com/2012/10/apple-mosaic-tart-with-salted-caramel/"
}