{
  "date": "2011-11-30T11:18:28+00:00",
  "directions": [
    "Trim sprouts and halve lengthwise. In a large, heavy 12-inch skillet heat butter and oil over moderate heat. Arrange halved sprouts in skillet, cut sides down, in one layer. Sprinkle with salt and pepper, to taste. Cook sprouts, without turning until undersides are golden brown, about 5 minutes. [Updated to note: If your sprouts don’t fit in one layer, don’t fret! Brown them in batches, then add them all back to the pan, spreading them as flat as possible, before continuing with the shallots, wine, etc.]",
    "Add the shallots, wine and stock and bring to a simmer. Once simmering, reduce the heat to medium-low (for a gentle simmer), cover the pot with a lid (foil works too, if your skillet lacks a lid) and cook the sprouts until they are tender can be pierced easily with the tip of a paring knife, about 15 to 20 minutes.",
    "Remove the lid, and scoop out brussels (leaving the sauce behind). Add cream and simmer for two to three minutes, until slightly thickened. Whisk in mustard. Taste for seasoning, and adjust as necessary with more salt, pepper or Dijon. Pour sauce over brussels, sprinkle with parsley, if using, and serve immediately."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/dijon-braised-brussels-sprouts1.jpg?w=500",
  "ingredient_list": [
    "1 pound brussels sprouts",
    "1 tablespoon unsalted butter",
    "1 tablespoon olive oil",
    "Salt",
    "Freshly ground black pepper",
    "1/2 cup dry white wine",
    "1 cup broth (chicken or vegetable)",
    "2 to 3 shallots, peeled and thinly sliced",
    "2 tablespoons heavy cream",
    "1 tablespoon smooth dijon mustard (or more to taste)",
    "2 tablespoons chopped flat-leaf parsley (optional)"
  ],
  "tags": [
    "Brussels Sprouts",
    "Fall",
    "Photo",
    "Side Dish",
    "Vegetarian"
  ],
  "title": "dijon-braised brussels sprouts",
  "url": "https://smittenkitchen.com/2011/11/dijon-braised-brussels-sprouts/"
}