{
  "date": "2011-11-18T15:48:56+00:00",
  "directions": [
    "Optional, for even more of a ginger kick: Add 1 to 2 teaspoons finely grated fresh ginger (with the wet ingredients) or 1 to 2 tablespoons finely minced candied ginger (with the dry ingredients). ",
    "In a medium bowl, whisk together the flour, baking soda, salt and spices. In a large bowl, beat butter and sugars together until fluffy, about three minutes on medium. Add egg and molasses and beat until combined. Add dry ingredient and beat at low speed until just combined. Thoroughly scrape down bowl, ensuring ingredients are evenly mixed.",
    "Transfer your cookie dough to plastic wrap — mine was quite soft and I felt like I was spreading frosting over plastic. I used a plate to support it. Chill in fridge for at least two hours, until firm.",
    "Preheat oven to 350°F (180°C). Roll dough into 1-inch balls and spread at least two inches apart on baking sheets that have either been greased or lined with parchment paper. Bake for 10 to 15 minutes, which is a long range. In the 10 to 12 range, the cookies will be softer. In the 13 to 15 range, a bit snappier. In both cases, you’ll want to leave them on their baking sheets for long enough that they’re firm enough to be transferred to a cooling rack with a spatula, anywhere from 2 to 5 minutes. Cool cookies completely before packing up.",
    "Do ahead: In an airtight container at room temperature, the cookies will soften a bit each day. Cookies keep for one week at room temperature or one month in the freezer. For even fresher cookies, you can keep balls of the unbaked dough in the freezer for up to two weeks and bake them as you need them, say, on Thanksgiving morning? "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/11/gingersnaps.jpg?w=750",
  "ingredient_list": [
    "2 1/4 cups (281 grams) all-purpose flour",
    "2 teaspoons (10 grams) baking soda",
    "1/2 teaspoon (2 to 3 grams) table salt",
    "3 teaspoons (6 grams) ground ginger",
    "1 teaspoon (2 grams) cinnamon",
    "1/2 teaspoon (1 gram) allspice",
    "1/4 teaspoon ground white pepper",
    "2 sticks (8 ounces or 227 grams) unsalted butter, at room temperature",
    "1/2 cup (100 grams) granulated sugar",
    "1/2 cup (96 grams) light brown sugar",
    "1 large egg",
    "1/3 cup (79 ml) unsulphured molasses"
  ],
  "tags": [
    "Cookie",
    "Fall",
    "Photo",
    "Thanksgiving"
  ],
  "title": "gingersnaps",
  "url": "https://smittenkitchen.com/2011/11/gingersnaps/"
}