{
  "date": "2010-10-27T12:47:51+00:00",
  "directions": [
    "Preheat oven to 400°F. Toss squash or pumpkin cubes with 2 tablespoons oil, cumin, paprika and salt. Arrange in a single layer on baking sheet and roast 20 minutes. Flip pieces and roast for an additional 10 to 15 minutes, until tender. Cool.",
    "Meanwhile, soak lentils for 10 minutes in a small bowl, then drain. Cook lentils in boiling salted water until tender but firm, about 30 minutes. Rinse with cold water, then drain and cool.",
    "Combine lentils, pumpkin, any oil you can scrape from the baking sheet (I didn’t get enough for this to be worth it) with arugula, if using, half of goat cheese, mint, vinegar, and 1 tablespoon oil. Season with salt and pepper and extra vinegar, if desired (we felt it needed it). Divide among plates and pass with remaining goat cheese to sprinkle.",
    "* I swapped half with sweet (not hot) smoked paprika to make sure it didn’t get too spicy for a 13 month-old’s tastes. If you don’t have either on hand, there are ways to approximate this smoky/spiciness with what you have in your pantry, such as mixing some regular paprika with a ground chipotle powder or another smoky spice, and then a pinch of cayenne for extra heat."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/spicy-squash-salad-with-lentils-and-goat-cheese.jpg?w=751",
  "ingredient_list": [
    "3/4 cup black or green lentils",
    "6 cups peeled, seeded and cubed butternut squash or sugar pumpkin (1-inch cubes) (from about a 2-poudn squash)",
    "3 tablespoons olive oil, divided",
    "1 teaspoon ground cumin",
    "1 teaspoon hot smoked Spanish paprika*",
    "1/2 teaspoon coarse salt",
    "4 cups baby arugula (I skipped this)",
    "1 cup soft crumbled goat cheese",
    "1/4 cup thinly sliced mint leaves (optional; I used this, but added it after I took a photo)",
    "1 tablespoon red wine vinegar, plus additional to taste",
    "Roasted seeds (about 1/2 cup) from your butternut squash (optional; see note above)"
  ],
  "tags": [
    "Beans",
    "Fall",
    "Photo",
    "Salad",
    "Thanksgiving",
    "Vegetarian",
    "Winter Squash"
  ],
  "title": "spicy squash salad with lentils and goat cheese",
  "url": "https://smittenkitchen.com/2010/10/spicy-squash-salad-with-lentils-and-goat-cheese/"
}