{
  "date": "2009-07-13T11:56:34+00:00",
  "directions": [
    "Combine the chocolate and espresso powder, if using, in the top of a double-boiler or in a heatproof bowl over simmering water. Stir until the chocolate is melted. (Alternately, you can melt the chocolate in a microwave for 30 seconds, stirring well, and then heating in 15 second increments, stirring between each, until the chocolate is melted.) Remove from heat and let chocolate cool until tepid.",
    "Whisk together the sour cream, 1/4 cup of the corn syrup and vanilla extract until combined. Add the tepid chocolate slowly and stir quickly until the mixture is uniform. Taste for sweetness, and if needed, add additional corn syrup in one tablespoon increments until desired level of sweetness is achieved.",
    "Let cool in the refrigerator until the frosting is a spreadable consistency. This should not take more than 30 minutes. Should the frosting become too thick or stiff, just leave it out until it softens again."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/best-birthday-cake1.jpg?w=500",
  "ingredient_list": [
    "4 cups plus 2 tablespoons (480 to 530 grams due to variance between brands) cake flour (not self-rising)",
    "2 teaspoons (10 grams) baking powder",
    "1 1/2 teaspoons baking soda",
    "1 teaspoon (5 grams) table salt",
    "2 sticks (1 cup, 1/2 pound or 225 grams) unsalted butter, softened",
    "2 cups (400 grams) sugar",
    "2 teaspoons (10 ml) pure vanilla extract",
    "4 large eggs, at room temperature",
    "2 cups buttermilk (475 ml), well-shaken",
    "15 ounces semisweet or bittersweet chocolate, chopped",
    "1 1/4 teaspoons instant espresso (optional, but can be used to pick up the flavor of average chocolate)",
    "2 1/4 cups sour cream, at room temperature",
    "1/4 to 1/2 cup light corn syrup",
    "3/4 teaspoon vanilla extract"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Chocolate",
    "Photo"
  ],
  "title": "best birthday cake",
  "url": "https://smittenkitchen.com/2009/07/best-birthday-cake/"
}