{
  "date": "2007-01-19T12:53:44+00:00",
  "directions": [
    "Preheat the oven to 350°F. Grease an 8 1/2 by 4 1/4 by 2 1/2-inch loaf pan. Line the bottom with parchment paper. Grease and flour the pan.",
    "Sift together the flour, baking powder, and salt into 1 bowl. In another bowl, whisk together the yogurt, 1 cup sugar, the eggs, grapefruit zest, and vanilla. Slowly whisk the dry ingredients into the wet ingredients. With a rubber spatula, fold the vegetable oil into the batter, making sure it’s all incorporated. Pour the batter into the prepared pan and bake for about 50 minutes, or until a cake tester placed in the center of the loaf comes out clean.",
    "Meanwhile, cook the 1/3 cup grapefruit juice and remaining 1 tablespoon sugar in a small pan until the sugar dissolves and the mixture is clear. Set aside.",
    "When the cake is done, allow it to cool in the pan for 10 minutes. Carefully place on a baking rack over a sheet pan. While the cake is still warm, pour the grapefruit-sugar mixture over the cake and allow it to soak in. Cool.",
    "For the glaze, combine the confectioners’ sugar and grapefruit juice and pour over the cake."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/01/grapefruit-yogurt-cake.jpg?w=750",
  "ingredient_list": [
    "1 1/2 cups (190 grams) all-purpose flour",
    "2 teaspoons baking powder",
    "1/2 teaspoon kosher salt",
    "1 cup (230 grams) plain whole-milk yogurt",
    "1 cup (200 grams) plus 1 tablespoon (13 grams) sugar",
    "3 extra-large eggs",
    "1 tablespoon grated grapefruit zest (approximately one large grapefruit)",
    "1/2 teaspoon pure vanilla extract",
    "1/2 cup (120 ml) vegetable oil",
    "1/3 cup (80 ml) freshly squeezed grapefruit juice"
  ],
  "tags": [
    "Cake",
    "Citrus",
    "Everyday Cakes",
    "Fruit",
    "Grapefruit",
    "Photo",
    "Winter"
  ],
  "title": "grapefruit yogurt cake",
  "url": "https://smittenkitchen.com/2007/01/cake-paradisi/"
}