{
  "date": "2013-03-22T11:25:25+00:00",
  "directions": [
    "Make macaroons: Position oven racks in the top and lower thirds of oven and heat oven to 325°F. Outline four 8-inch circles on individual pieces of parchment paper. Turn each sheet of parchment over so your ink or pencil lines don’t seep into the macaroon, place each piece of parchment paper on large baking sheets, and very lightly coat each piece of parchment with oil or butter. (I sprayed mine with a cooking oil and wiped all but a sheer coating away with a paper towel.)",
    "Place hazelnuts, 1 cup sugar and salt in a food processor and blend until finely ground. Using electric mixer, beat egg whites in large, dry bowl with clean beaters (or a whisk attachment) until soft peaks form. Drizzle in vanilla extract, then slowly add remaining 2 tablespoons sugar. Beat until stiff but not dry. Fold nut mixture into egg whites in 1/3 increments (i.e. a little at a time so it doesn’t overtake the fluffy egg whites). Spread 1/4 of macaroon batter evenly within each circle, filling completely.",
    "Bake macaroon layers until golden and dry to the touch — this takes 20 to 23 minutes in my oven. Cool macaroons on their sheets on a cooling rack. You can speed this along by placing them for five minutes each in your freezer.",
    "Make chocolate filling: While meringues cool, heat half of chocolate, water, and coffee (if using) in a small heavy saucepan over moderately low heat, stirring until smooth. Off the heat, stir in second half of chocolate chunks until melted, which should also cool the mixture to lukewarm. Spread chocolate evenly over tops of meringue rounds; it will be just a thin slick on each. Cool until chocolate is set, a process that could take a few hours at room temperature or, again, could be hastened along by resting each disc in your freezer for five minutes, or until firm.",
    "Make whipped frosting and filling:: Beat cream with sugar and liqueur or vanilla in a bowl with cleaned beaters until it holds stiff peaks. ",
    "Assemble torte: Gently peel the parchment off the back of each macaroon round. Arrange your first disc on your cake serving plate. If you like to follow proper cake-decorating protocol, you will insert some small strips of waxed paper under the edge to protect the cake plate while you decorate. If you don’t, hey, I too embrace cake imperfections. Spread 1/3 cup whipped cream over it. Repeat with second and third macaroon rounds, then top with final round. Frost top and side of torte with whipped cream. I did this in two parts, a thin “crumb” coat (after which I put the cake in the freezer for 5 minutes to “set” it, although whipped cream doesn’t really set) a thicker final one, with the remaining cream, which led to a neater final result. ",
    "If desired, use a vegetable peeler to scrape away curls from a chocolate bar for decoration. Remove waxed paper strips if you used them, and serve immediately or up to a day or two layer. Store in fridge.",
    "Do ahead: Whipped cream confections are generally best on the first day, but we found ours to hold up just fine in the fridge for more than 24 hours. Macaroons alone, or macaroons with chocolate coating, can be baked in advance. Simply keep them separated with waxed paper in an airtight container at room temperature for up to two days. Humidity is the enemy of macaroons, so if you live in a humid environment, you’ll want to store them as little time as possible lest they become sticky. ",
    "* I toast hazelnuts in a single layer on a baking sheet at 350 for anywhere from 8 to 12 minutes, rolling them around once or twice. One cool, I roll them around in dry hands over the tray to remove as much of their skins as possible. This is not a popular method. More common is to roll them around in a dishtowel but I find this coats my entire existence (counter/floor/self) with hazelnut skins. You’re probably neater than me, however. A third and even awesome method would be to happen upon toasted and skinned hazelnuts at Trader Joe’s, as I did this week, for a measly $6.99/pound. Finally, if you have already ground hazelnut meal or flour, you can use the equivalent weight of it instead of whole ones.",
    "** Passover legal-ese: If you follow a strict Passover regimen, Frangelico and other liqueurs may not be acceptable, and neither will vanilla extract (although Passover-friendly stuff is available) because they contain alcohol derived from grains. This cake is dairy and many kosher Seders are meat meals, so it would not be acceptable to eat until two hours, or even six hours, after the meal. Which should give everyone enough time to digest your cousin’s brisket, huh? (Sorry, couldn’t resist.) ",
    "Update: Helene (comment #118) brilliantly made a suggestion for a non-dairy whipped cream alternative: 7-Minute Frosting, which is also sometimes called Marshmallow Frosting. It’s billowy, white, shiny and light and can even be toasted on the outside with a blowtorch for a toasted marshmallow effect, but very easy to make. Here’s my favorite recipe for it. While it holds up well for two days, I do want to warn that it “crusts” (a gross word for getting dry out the very outer edges) after a day or so. It’s very light, might just seem faintly crisp, but the inside will still be pillowy."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/03/chocolate-hazelnut-macaroon-torte.jpg?w=750",
  "ingredient_list": [
    "Macaroons",
    "Oil or butter for greasing parchment rounds",
    "1 cup plus 2 tablespoons (225 grams) granulated sugar",
    "6 large egg whites",
    "2 1/2 cups hazelnuts (about 12 ounces or 340 grams), toasted, then skinned as much as possible*",
    "1/4 teaspoon table salt",
    "1 teaspoon (5 ml) vanilla extract**",
    "Chocolate filling",
    "6 ounces (170 grams or the equivalent of 1 cup chips) bittersweet chocolate, coarsely chopped",
    "1/4 cup water",
    "1 teaspoon instant coffee or espresso granules (optional)",
    "Whipped frosting and filling",
    "1 1/2 cups chilled heavy or whipping cream",
    "3 tablespoons granulated sugar",
    "1 tablespoon Frangelico or another hazelnut liqueur or 1 teaspoon vanilla extract**",
    "Decoration",
    "A semi- or bittersweet chocolate bar for shaving (optional)"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Chocolate",
    "Gluten-Free",
    "Passover",
    "Photo"
  ],
  "title": "chocolate-hazelnut macaroon torte",
  "url": "https://smittenkitchen.com/2013/03/chocolate-hazelnut-macaroon-torte/"
}