{
  "date": "2017-07-12T13:31:30+00:00",
  "directions": [
    "Preheat oven: To 350 degrees F. Line the bottom of an 8×8-inch square or 9-inch round cake pan with parchment paper and coat the bottom and sides with nonstick spray or butter.\nMake cake: Beat butter, sugar, and salt together in a medium bowl. Add egg whites, one at a time, beating until combined and slightly fluffy. Add vanilla and buttermilk and beat to combine. The mixture will instantly look like cottage cheese and you will be sure it’s ruined but I promise it is not. Add baking powder and cornstarch and beat very well to combine. Scrape down sides of bowl and beat one second more. Add flour and mix just until it disappears. Use a rubber scraper to gently fold in sprinkles.\nBake cake: Spread batter in prepared pan and smooth the top. Bake for 20 minutes, or until a toothpick inserted into the center of the cake comes out batter-free. Let cool in pan on cooling rack for 5 minutes, then run a knife around the side to loosen the cake, flip it out onto the cooling rack, and slide the cooling rack into the freezer until cake is cool, about 10 to 15 minutes.\nFrost and serve: While the cake cools, beat butter, sugar, salt and vanilla until fluffy, then add milk or cream and beat until smooth. Once cake is fully cool, transfer it to a serving plate. Spread frosting on top — you’ll have more than enough, so if you need to set some aside for small decorations or tinting and writing on the cake, this won’t be a problem. Finish with sprinkles. Share with friends.\n\nHow to Make a Confetti Sheet Cake: For the sheet cake version of this, triple the cake recipe and divide the batter between two 9×13-inch cake pans (mine were 935 grams of batter each). They bake for 18 to 20 minutes and yield two skinny cake layers that once frosted and filled make a 2-inch tall cake. I don’t know how to tell you this, I almost want to warn you to cover your ears, but if you want to fill and frost them the way I did, you’ll need to make five times the amount of frosting written. I actually made a 6x batch (1-pound boxes of powdered sugar hold 3 3/4 cups, so I used two in full), but it was too much (thank goodness). If your design is more elaborate, however, and you want more room for frosting error, just do the 6x. It feels a little late in this recipe for butter/sugar austerity, don’t you think?\nHow to “Elmo” Your Sheet Cake: My method was to copy some Muppet pictures from the web (I found looking for coloring pages yielded more linear pics), resize them, print them, and cut them out into stencils. Once the cake’s white frosting was set (in the fridge so it gets cold and firm), I briefly laid them over the cake and used a toothpick to make a light outline. I then cut the stencils further into eyes, noses, etc. and traced these on too. From there, it was just tinting tiny amounts of frosting the right colors and piping them on, like you were coloring in with a crayon. I used a Wilton #5 round tip for every part of the Muppets and the dots around the edges of the cake, and then a Wilton #2 for the corners of the mouths and eyeballs, but if you only had the #5, or even a #4, you’ll be just fine.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/07/confetti-party-cake-bite.jpg?w=750",
  "ingredient_list": [
    "1/2 cup (115 grams or 4 ounces) unsalted butter, at room temperature",
    "2/3 cups (130 grams) granulated sugar",
    "1/2 teaspoon kosher salt",
    "2 large egg whites",
    "1/2 teaspoon vanilla extract",
    "1/2 cup (120 ml) buttermilk",
    "1 teaspoon baking powder",
    "2 tablespoons (16 grams) cornstarch",
    "1 cup (130 grams) all-purpose flour",
    "1/4 cup rainbow sprinkles",
    "1/2 cup (115 grams or 4 ounces) unsalted butter, at room temperature",
    "1 1/4 cups (150 grams) powdered sugar, sifted if lumpy",
    "Pinch of fine salt",
    "1/2 teaspoon vanilla extract, plus more to taste",
    "1 tablespoon milk or cream",
    "Rainbow sprinkles for decoration"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Photo",
    "Recipes"
  ],
  "title": "confetti party cake",
  "url": "https://smittenkitchen.com/2017/07/confetti-party-cake/"
}