{
  "date": "2011-06-13T16:08:21+00:00",
  "directions": [
    "Prepare your cake pans: Choose a cake size and shape option from the Notes, above. Assemble either the cake pans you will need, or sheets of parchment paper if you don’t have all the necessary pans. If using cake pans, line the bottom of each with a sheet of fitted parchment paper, and butter and flour (or use a butter-flour spray) the parchment and sides of the pan. Tap out excess flour, if needed. If using sheets of parchment paper, cut each larger than needed for the cake shape and size. Stencil your cake shape on one side of the sheet, then flip it over and butter and flour the shape area on the reverse side. Again, tap out any excess flour. [Want to make the number 1 for your kid’s first birthday? This is how to approach it.]",
    "Make the cake: Preheat oven to 450°F and place a rack in the center of your oven. In the bowl of an electric mixer, beat 10 egg yolks for a few minutes at high speed, until pale and lemon-colored. Reduce speed and gradually add sugar, then increase the speed and beat the yolks and sugar until thick and glossy. Scrape bowl occasionally with rubber spatula. Reduce speed again and gradually add flour and salt; increase speed mix for 5 minutes more, then mix in lemon juice. Scrape bowl again with a rubber spatula. In a separate bowl with cleaned beaters, or by transferring your cake batter to a new bowl and washing it out and drying it with a long sigh, beat the 7 egg whites with a whisk attachment until they hold stiff peaks. Because your yolk mixture is more or less the thickness of spackle at this point, stir a few heaping spoonfuls of the whites into it to loosen the mixture, before folding in the rest of the whites in three additions. When you’re done, your batter will have transformed from a dry paste to a spreadable, foamy batter.",
    "Bake your cake layers: Spread your batter in prepared pans or within their stenciled shapes on parchment paper; try to push the batter rather than pull it with an offset spatula, it will help keep the parchment from rolling up. Don’t worry if they spread past the shape outline on parchment; you will trim them later. If you have a digital scale and want to be super-fussy about making sure the layers are even, weighing the batter and dividing it out accordingly will do the trick. [I can make it even easier; the net weight of my batter was 985 grams.] If not and you’re aiming for a traditional 7-layer 9-inch round cake, spread batter to about 1/4-inch thickness in each circle. Spread the batter evenly to the edges with an offset spatula; be careful not to leave any holes. If you’re using parchment shapes, slide cookie sheets under them before baking.",
    "Bake each layer for 5 minutes, or until golden with some dark brown spots. Thicker layers may take up to 2 additional minutes. When layer is baked, remove it from the oven and flip it out onto a cooling rack that has been dusted with a small amount of confectioners’ sugar. Carefully, gently remove parchment paper then flip cake back onto another lightly dusted cooling rack to finish cooling. It’s best to cool the layers right side up; the tops are the stickiest part.",
    "Repeat with remaining layers. Dunk your cake batter bowl in water right away; that egg yolk-enriched batter dries quickly and was surprisingly hard to scrub off later! Layers will cool very quickly. Trim edges of cake, if needed, to make even shapes or divide larger rectangular pans accordingly.",
    "Make the filling and frosting: Melt chocolate until smooth. Set aside to cool to room temperature, but of course not so cool that it hardens again. In the bowl of an electric mixer, beat butter until soft and smooth, scraping frequently. Add vanilla and 3 egg yolks. Add sugar and cooled chocolate, beating until thoroughly mixed and scraping as needed.",
    "Assemble the cake: Place four strips of parchment or waxed paper around the outer edges of your cake plate. Place first cake layer on plate and spread chocolate on top and to edges with an offset spatula. The filling must be spread fairly thinly to have enough for all layers and the outsides of the cake. However, I’d preemptively scaled up the chocolate filling and frosting and had nearly two cups of extra — the levels listed above should be just fine. Repeat with remaining layers (or all layers except one, if you’d like to do a decorative caramel layer), stacking cake as evenly as possible. Once fully stacked and filled, you can trim the edges again so that they’re even.",
    "Spread chocolate on outside of cake in a thin coat, just to cover and adhere the crumbs to the cake. Place cake in fridge for 30 minutes (or freezer for 5 minutes) to set the chocolate. Spread chocolate more thickly and smoothly to make a final exterior coat of frosting. Remove paper strips.",
    "Caramel topping, if using: Lightly grease a sheet of parchment paper. Place last cake layer on this sheet. Lightly oil a large chef’s knife (if cutting layer into 16 traditional wedges) or sharp cookie cutter of your choice and set aside. Combine the sugar and water in a small, heavy saucepan and swirl it until the sugar melts and begins to turn a pale amber color. Quickly and carefully, pour this (you’ll have a bit of extra) over the prepared cake layer and spread it evenly with an offset spatula, right over the outer edges. Using prepared knife or cutter, quickly cut layer as you wish. Leave in place, then cool completely. Once fully cooled, cut edges of shapes again, to ensure that you can remove them cleanly. Arrange caramel pieces or wedges over cake, propping them up decoratively with hazelnuts.",
    "Chill cake until needed.",
    "Do ahead: You can bake the cake layers ahead of time, freezing them between sheets of waxed paper, wrapped tightly in plastic. No need to defrost before assembling. The whole cake has kept for 4 days for us now, and seems like it would safely keep for a week."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/06/dobos-torte.jpg?w=750",
  "ingredient_list": [
    "Cake layers:",
    "7 large eggs, separated",
    "3 large egg yolks",
    "1 pound (3 1/2 cups or 455 grams) confectioners’ sugar, plus extra for dusting racks",
    "3/4 cup (94 grams or 3 1/3 ounces) all-purpose flour",
    "1 tablespoon lemon juice",
    "1/8 teaspoon table salt",
    "Frosting and filling:",
    "1/2 pound (8 ounces or 227 grams) semi- or bittersweet chocolate, coarsely chopped",
    "1/2 pound (2 sticks or 226 grams) unsalted butter, cut into chunks",
    "1 teaspoon vanilla extract",
    "3 large egg yolks",
    "2 tablespoons confectioners’ sugar",
    "Caramel layer (optional)",
    "1/2 cup granulated sugar",
    "1 tablespoon water",
    "Handful of toasted, peeled hazelnuts"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Chocolate",
    "Photo"
  ],
  "title": "dobos torte",
  "url": "https://smittenkitchen.com/2011/06/dobos-torte/"
}