{
  "date": "2013-09-20T08:55:10+00:00",
  "directions": [
    "Make cake layers: Heat oven to 325°F. Line the bottom of two 9×13 rectangular (i.e. quarter-sheet) cake pans with parchment paper. Grease parchment and sides of pan. Using an electric mixer, beat butter with sugar in a large bowl until light and fluffy. Add eggs, one at time, beating each in until just incorporated and scraping down sides of bowl. Add vanilla, then buttermilk. (Don’t worry if the batter looks a uneven and grainy; it will all be fine in a minute.) ",
    "Place flour, cocoa powder, baking soda, baking powder and salt in a sifter over the mixing bowl and sift ingredients in. Beat or stir dry ingredients into batter until just combined; scrape down bowl again. Divide batter between two pans. Bake each layer for 30 to 40 minutes, rotating them once top-to-bottom and back-to-front halfway through. Cakes are ready when a toothpick inserted into the center of each layer comes out batter-free. Cool in the pan 10 minutes, then remove cakes from pans and let cool completely on racks. I often put those racks right into the freezer, to firm up this very soft and tender cake before leveling and frosting it; it makes the process much easier.",
    "Make fudge buttercream filling: Place all of the ingredients in a food processor and pulse to incorporate, then process until the frosting is smooth. If you don’t have a food processor, you can beat the butter until light and fluffy with an electric mixture, then add the sugar and melted chocolate, followed by the milk or cream and vanilla. With an electric mixer, it helps to sift the powdered sugar first.",
    "Fill cake: Remove first cooled cake layer from freezer. Place on cake board or serving tray. Arrange small scraps of waxed or parchment paper underneath edges, to protect the cake plate from frosting as you decorate. Level the top of the cake if it has domed by shaving off the dome with a horizontal serrated knife. Put the cake scraps in the garbage and cover them with dish soap; nothing good will come of it otherwise. Spread fudge buttercream filling evenly over first cake layer. Place second layer on top of filling; you can level this too slightly if it it has dome, but it’s less essential to the stacking of the cake if it’s the top layer. Return the cake to the freezer, while you make the frosting. Having it very cold will make it easier to cover the chocolate crumbs with your light-colored frosting in a few minutes.",
    "Make vanilla buttercream: You can make this either in the food processor (using the same method as the fudge buttercream, above) or with an electric beater, however, I find that I can get this frosting fluffier by hand with the latter, via electric beaters or a stand mixer. Beat the butter until light and fluffy in a large bowl. Add sugar 1/2 cup at a time (trust me on this, it allows us to get away with less sugar than the standard recipe) until fully incorporated. Beat in half-and-half then vanilla. ",
    "Frost and finish cake: From here, you method will vary depending on your intended decorations. I put 1 cup frosting in a separate bowl for the piped decorations (clouds, planes and writing) and tinted the rest with just one drop of a concentrated blue color. (I love this stuff.) Thinly coat entire cake with frosting (this is a “crumb” coat, to mask the chocolate crumbs better), then return the cake to the freezer for 10 minutes, to set the first layer of frosting, then finish frosting the cake with the remaining frosting. Tint and pipe any decorations needed with remaining buttercream.",
    "To serve: If making this the day before the party (recommended!), keep it in the fridge overnight. If you want it fully defrosted for a party that day, an hour or so at room temperature should be sufficient. It doesn’t hold the cold in very long."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/09/fudgy-chocolate-sheet-cake.jpg?w=750",
  "ingredient_list": [
    "Cake layers",
    "1 cup (2 sticks, 8 ounces or 230 grams) unsalted butter, at room temperature",
    "2 cups (380 grams) firmly packed dark brown sugar",
    "2/3 cup (135 grams) granulated sugar",
    "4 large eggs",
    "2 cups (475 ml) buttermilk",
    "2 teaspoons vanilla extract",
    "2 3/4 cups (345 grams) all-purpose flour",
    "1 1/3 cups (115 grams, approximately) Dutch-process cocoa",
    "1/2 teaspoon baking soda",
    "1 teaspoon baking powder",
    "3/4 teaspoon table salt",
    "Fudge buttercream filling",
    "2 ounces unsweetened chocolate, melted and cooled",
    "1 1/2 cups confectioners’ sugar (no need to sift)",
    "1/2 cup (1 stick, 4 ounces or 115 grams) unsalted butter, at room temperature",
    "2 tablespoons half-and-half or whole milk",
    "1 teaspoon vanilla extract",
    "Vanilla buttercream frosting",
    "1 cup (2 sticks or 230 grams) unsalted butter, at room temperature",
    "3 3/4 cups (1 1-pound box) powdered sugar, sifted",
    "4 tablespoons half-and-half or whole milk",
    "2 teaspoons vanilla (use less if you want a whiter frosting)"
  ],
  "tags": [
    "Celebration Cakes",
    "Chocolate",
    "Photo"
  ],
  "title": "fudgy chocolate sheet cake",
  "url": "https://smittenkitchen.com/2013/09/fudgy-chocolate-sheet-cake/"
}