{
  "date": "2008-01-27T14:24:12+00:00",
  "directions": [
    "Special equipment: a 9- to 9 1/2-inch springform pan; a mandoline or other adjustable-blade slicer",
    "Make crust: Preheat oven to 350°F and butter bottom and side of springform pan.",
    "Stir together crumbs, sugar, and butter in a bowl with a fork until combined well, then press evenly onto bottom and one-third up side of pan. Bake crust in middle of oven 8 minutes and cool in pan on a rack.",
    "Make filling:  Reduce oven temperature to 325°F.",
    "Beat cream cheese with an electric mixer at medium speed until fluffy, then beat in sugar. Add lime juice, sour cream, and vanilla and beat until smooth. Mix in flour and salt at low speed, scraping down side as needed, until just incorporated, then add eggs all at once and mix just until incorporated.",
    "Pour filling into crust and set springform pan in a shallow baking pan. Bake cake in middle of oven until set in center, 1 hour to 1 hour and 10 minutes. Cool completely in springform pan on rack. (Cake will continue to set as it cools.)",
    "Run a thin knife around edge of cake and remove side of pan. If desired, transfer cake with a large metal spatula to a serving plate.",
    "Make topping: Peel mangoes and, leaving fruit whole, slice very thinly lengthwise (slightly less than 1/8 inch thick) with mandoline (use caution — peeled mango is slippery). Halve wide slices lengthwise. Gently toss mango slices with lime juice. (I instead cut the slices with a flower-shaped cookie cutter, thinking they’d be a little neater for the miniature cakes.)",
    "Beat cream with sugar in a bowl with electric mixer until it just holds stiff peaks, then spread over top of cheesecake. Bending and curling mango slices, arrange them decoratively over cream.",
    "Do ahead: Cheesecake (without topping) can be made 1 day ahead and chilled, covered. If desired, bring to room temperature. Add topping just before serving."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/key-lime-cheesecake1.jpg?w=500",
  "ingredient_list": [
    "For crust",
    "1 1/4 cups fine graham cracker crumbs (5 ounces)",
    "3 tablespoons sugar",
    "1/2 stick (1/4 cup) unsalted butter, melted",
    "For filling",
    "2 (8 ounce) packages cream cheese at room temperature",
    "1 cup plus 2 tablespoons sugar",
    "3/4 cup fresh key lime juice (strained from about 1 1/2 lb Key limes) or bottled (Nellie and Joe’s is wonderful, as is Manhattan brand, if you can find it)",
    "1/2 cup sour cream",
    "1/2 teaspoon vanilla",
    "2 1/2 tablespoons all-purpose flour",
    "1/4 teaspoon salt",
    "3 large eggs",
    "For topping",
    "2 large firm-ripe mangoes",
    "1 tablespoon fresh Key lime juice (strained) or bottled",
    "1/2 cup chilled heavy cream",
    "1 tablespoon sugar"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Citrus",
    "Coconut",
    "Photo"
  ],
  "title": "key lime cheesecake",
  "url": "https://smittenkitchen.com/2008/01/key-lime-cheesecake/"
}