{
  "date": "2015-04-16T12:07:44+00:00",
  "directions": [
    "Heat oven to 350°F (175°C). In a medium saucepan, combine syrup, cream, cider vinegar and a pinch or two of salt and bring to a boil. Reduce to a simmer and cook for 5 minutes, stirring occasionally. It may look a tad curdled at first from the vinegar, but it will all cook smoothly in the end. Set aside while you prepare the cake dough.",
    "In a large bowl, beat butter and sugar until fluffy. Add egg and vanilla and beat until combined, scraping down bowl. Sift flour, baking powder and salt directly into butter-egg mixture, then fold together with a spatula. Batter will be very thick. ",
    "Divide 2/3 maple syrup sauce into 6 individual baking dishes, or ramekins, or pour it into 1 8-inch round skillet or cake pan. Divide cake dough into 6 mounds and drop one of each into each ramekin, or spread them out in larger dish. Pour remaining syrup sauce over and bake until the cakes are firm and golden, about 25 to 30 minutes. ",
    "Serve warm, dolloped with crème fraîche or unsweetened whipped cream, plus extra sea salt, to taste. Reheat before serving any leftovers."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/pudding-chomeur-maple-pudding-cake-or-unemployed-persons-pudding1.jpg?w=750",
  "ingredient_list": [
    "3/4 cup (175 ml) pure maple syrup",
    "1/3 cup (80 ml) heavy cream",
    "1 1/2 teaspoons apple cider vinegar",
    "A couple pinches of sea salt",
    "6 tablespoons (3 ounces or 85 grams) unsalted butter, softened",
    "2 tablespoons (25 grams) granulated sugar",
    "1 large egg",
    "1/2 teaspoon vanilla extract",
    "1 cup (125 grams) all-purpose flour",
    "1 teaspoon baking powder",
    "1/4 teaspoon fine sea or table salt",
    "To serve: crème fraîche and more sea salt, to taste"
  ],
  "tags": [
    "Breakfast",
    "Cake",
    "Photo"
  ],
  "title": "maple pudding cake",
  "url": "https://smittenkitchen.com/2015/04/maple-pudding-cake-pudding-chomeur/"
}