{
  "date": "2009-06-14T12:22:06+00:00",
  "directions": [
    "Make the filling: Place 1/4 cup of the sugar in a small saucepan. Cook over high heat, without stirring, until all the sugar turns caramel. Tilt pan to distribute caramel. Lower the heat and carefully whisk in the jam, the scraped vanilla bean and seeds, 1 tablespoon of water, a pinch of salt and the lemon juice. (The caramel will bubble violently.) Simmer, stirring, until the caramel dissolves into the jam. Remove from heat and set aside to cool. (This can be done a day in advance.)",
    "Make the cookie layers: In a food processor, pulverize the whole almonds with 2 tablespoons of the flour.",
    "Using an electric mixer, cream the butter, remaining sugar, 1/4 teaspoon salt and the zests until light and fluffy, about 5 minutes. Scrape down the bowl with a rubber spatula. Mix in the pulverized almonds until combined. Beat in the egg yolks, one at a time, and then add the almond extract and orange-flower water. Mix in the remaining flour.",
    "Divide the dough into six equal balls. (Yes, I weighed mine.) Place each ball between two sheets of plastic wrap and press into an 8-inch circle, using the inside of a pie pan as a guide. I used an 8-inch cake pan for this. Try to keep the edges as neat and clean as possible. It may be easiest to do this by trimming any jagged edges once the discs have chilled, before you bake them.",
    "Chill the dough rounds in the refrigerator for 2 hours or freeze for 30 minutes.",
    "Preheat oven to 375 degrees. Remove plastic wrap, place a dough round on a parchment-lined baking sheet and bake until golden, about 15 minutes. Please, watch this baking time carefully, as your oven will vary and the cookies are so thin, even an extra minute or two can overly darken the edges. Nobody likes a burnt cookie cake!",
    "Cool completely on a wire rack. Repeat with remaining rounds.",
    "To assemble the cake: Lay a round in the center of a serving plate. Spread with 3 to 4 tablespoons of jam to just before the edge. (If your jam is super-intense, as our currant jam was, err on the 3 tablespoon rather than 4-tablespoon side, so it doesn’t overwhelm the delicate cookies.) Continue to layer the rounds, spreading jam between each. Spread a thin layer of jam over the top and cover with sliced almonds.",
    "The cake can be served immediately, but tastes even better, and is easier to cut, if tightly wrapped and served 1 to 2 days later. (Don’t skimp on this.) Thus, you might find it easiest to wrap the cake without the final layer of jam over the top — as I did — spreading it once you’re ready to unwrap and serve it."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/neapolitan-cake1.jpg?w=500",
  "ingredient_list": [
    "1 1/4 cups sugar",
    "1 1/2 cups jam, raspberry, apricot, strawberry or peach are suggested, but I used currant jam, which I strained",
    "Half of a vanilla bean, split lengthwise, seeds scraped",
    "Salt",
    "1/2 tablespoon lemon juice",
    "1 cup whole blanched almonds, toasted",
    "3 cups flour, sifted",
    "1 cup unsalted butter, at room temperature",
    "Finely grated zest of 1 lemon",
    "Finely grated zest of 1 orange",
    "4 large egg yolks, at room temperature",
    "1/2 teaspoon almond extract",
    "1 teaspoon orange-flower water (I skipped this)",
    "1/4 cup sliced almonds, toasted"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Cookie",
    "Photo"
  ],
  "title": "neapolitan cake",
  "url": "https://smittenkitchen.com/2009/06/neapolitan-cake/"
}