{
  "date": "2008-10-23T16:02:05+00:00",
  "directions": [
    "7. Serve with pink candles on pink plates to the sort of person who dreams in pink. I suspect you know at least one.",
    "* Huntsman notes that it may seem surprising that frozen strawberries are used here, but they’re always available and their quality is consistent. I suspect you could swap fresh ones, but given that the ones in the store in October are so lackluster, and cruelly unlike the astounding ones we had in Paris last week, I went with her suggestion. This will be from about half a one-pound bag."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lady-cake1.jpg?w=500",
  "ingredient_list": [
    "For the cake",
    "4 1/2 cups cake flour",
    "3 cups sugar",
    "5 1/4 teaspoons baking powder",
    "3/4 teaspoon salt",
    "3 sticks (12 ounces) unsalted butter, at room temperature",
    "1 1/2 cups pureed frozen strawberries*",
    "8 egg whites",
    "2/3 cup milk",
    "1 to 2 drops red food dye, if using (to make the pink color pop more)",
    "For the cream cheese frosting",
    "3 (8 ounce) packages cream cheese, softened",
    "3/4 cup (1 1/2 sticks; 6 ounces) unsalted butter, softened",
    "3 cups sifted confectioners’ sugar",
    "2 teaspoons vanilla extract",
    "Make the cake",
    "1. Preheat the oven to 350»F. Butter three 9-inch round or 8-inch square cake pans. Line with parchment or waxed paper and butter the paper.",
    "Make the cream cheese frosting",
    "5. In a medium bowl, cream together the cream cheese and butter until creamy. Mix in the vanilla, then gradually stir in the confectioners’ sugar. Store in the refrigerator after use.",
    "Frost and assemble the cake",
    "6. Place one cake layer on a cake board or platter. Tucking scraps of waxed paper under the edges of the cake will protect the board or plate from any mess created while frosting the cake. (I forgot, as can be clearly seen above.) Spread about 2/3 cup frosting over the layer, spreading it to the edge. Repeat with the second layer. Add the top layer and frost the top and sides of cake with remaining frosting, reserving a small amount if you wish to tint it and pipe a decoration on the cake. If not, you can decorate the cake top with thinly-sliced strawberries. Remove the waxed strips to reveal and neat, clean cake board."
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Fruit",
    "Photo",
    "Strawberries"
  ],
  "title": "pink lady cake",
  "url": "https://smittenkitchen.com/2008/10/pink-lady-cake/"
}