{
  "date": "2014-08-14T11:59:12+00:00",
  "directions": [
    "Heat oven to 350°F (180°C). Wrap exterior of a 9-inch springform pan (including base) tightly in a triple layer of foil; set aside.",
    "Make crust: Stir together cracker crumbs, melted butter, and sugar in a medium bowl. Press crumb mixture firmly into bottom of pan and up the sides to about 1-inch from the top of the pan. I like to use the bottom and outside of a 1-cup measure to help press them in firmly. Bake until set, about 10 minutes. Let cool in pan on a wire rack. Reduce oven temperature to 325 degrees.",
    "Make raspberry sauce for swirl: Process raspberries with sugar in a food processor until smooth, about 30 seconds. Pass puree through a fine sieve into a small bowl; discard solids. Set aside.",
    "Make cheesecake: Put cream cheese in the bowl of an electric mixer fitted with a paddle attachment; mix on medium speed until fluffy, about 3 minutes. With mixer on low speed, add remaining 1 1/2 cups sugar in a slow, steady stream; scrape down bowl. Add salt and vanilla; mix until well combined. Add eggs, one at a time, mixing each until just combined and scraping down the bowl. Pour cream cheese filling over crust.",
    "Using a squeeze bottle, piping bag or a zip-lock bag with a tiny corner snipped off, place tiny droplets of raspberry sauce all over top of cake. Use a toothpick or skewer to swirl the sauce and filling together decoratively. I had extra sauce; it makes a delicious dessert sauce to serve with the cake.",
    "Bake cake: Set cake pan inside a large, shallow roasting pan — I set mine inside a 12-inch round saucepan. Transfer to oven. Carefully pour or ladle boiling water into roasting pan until it reaches halfway up the sides of the cake pan. Bake until cake is set but still slightly wobbly in center, 60 to 65 minutes. (This always takes longer in my oven because I always fail to seal the foil around the pan well enough that water doesn’t get in. Just keep baking it until it seems mostly set, like loose Jell-O. A toothpick inserted near the center should not have wet, thin batter on it when removed)",
    "Transfer cake pan to rack; let cake cool to room temperature then refrigerate, uncovered, at least 6 hours or overnight. Before unmolding, run a knife around edge of cake.",
    "If you’d like to serve this with a chocolate sauce, bring heavy cream to a boil in a small saucepan. Remove from heat, stir in chocolate until melted. ",
    "Serve cake in wedges, with any leftover raspberry sauce or chocolate sauce, or both. ",
    "Notes: "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/raspberry-swirl-cheesecake1.jpg?w=640",
  "ingredient_list": [
    "Crust",
    "2 cups (about 250 grams) finely ground chocolate cookie crumbs (from about 1 9-ounce sleeve chocolate wafers; see more suggestions below)",
    "6 tablespoons (85 grams) unsalted butter, melted",
    "3 tablespoons (40 grams) granulated sugar",
    "1/8 teaspoon table salt",
    "Raspberry Swirl",
    "6 ounces (170 grams) fresh or frozen raspberries (which have been thawed or they will not puree easily)",
    "2 tablespoons (25 grams) granulated sugar",
    "Cheesecake",
    "32 ounces (905 grams) cream cheese, very soft at room temperature",
    "1 1/2 cups (300 grams) granulated sugar",
    "Pinch of salt",
    "1 teaspoon pure vanilla extract",
    "4 large eggs, room temperature",
    "Chocolate sauce for serving (optional)",
    "1/2 cup (120 ml) heavy or whipping cream",
    "4 ounces (115 grams) semisweet or bittersweet chocolate"
  ],
  "tags": [
    "Celebration Cakes",
    "Photo",
    "Raspberries"
  ],
  "title": "raspberry swirl cheesecake",
  "url": "https://smittenkitchen.com/2014/08/raspberry-swirl-cheesecake/"
}