{
  "date": "2016-10-07T11:53:24+00:00",
  "directions": [
    "The day before, get ready: Heat oven to 350 degrees F. Get 2 baking sheets (or even better, round pizza pans) down, more if you have them. Tear off 6 sheets of parchment paper large enough to have a 9-inch circle on it.\nMake cookie/cake dough: In a medium-sized saucepan, combine the sugar, honey and butter over medium heat. Once simmering, cook for 3 to 4 minutes (no specific temperature needed), it should get a faint shade darker and smell wonderful. Whisk in baking soda.\nRemove from heat and set aside for 2 to 3 minutes. It’s not going to significantly cool off, just settle a little. Lightly beat your eggs in a spouted measuring cup (for easiest pouring) or small bowl. Take a deep breath. Whisking the honey mixture vigorously in the pot the whole time, drizzle the thinnest stream (think: 1/2 teaspoon at a time, that slowly) of the eggs into the honey mixture. Do not stop mixing. Continue until all of the eggs are thoroughly whisked in.\nStir in the salt and vanilla and 3 cups (390 grams) of the flour with a spoon. The dough is going to be thick like a bread but you’ve got this. Stir in the last 1/2 cup of flour 1/4 cup at a time; you’ll get a bonus arm workout.\nShape and bake the cookies/cakes: [Plus, a bunch more layer tips at the end.] Lightly flour your counter and divide the still-warm dough into 8 even pieces. Roll the first one between two sheets of parchment paper (no flouring needed) to a slightly-bigger-than-9-inch round. Remove top sheet of parchment paper. Very lightly dust the top with flour if you’re going to put something on it (such as the bottom of a 9-inch cake pan or the rim of a 9-inch bowl) to trim the shape to an even 9-inch circle. Save the trimmings — put them aside on one of the sheets of parchment paper, it’s fine if they overlap a little. Dock the circle all over with a fork. Slide your 9-inch round onto a baking sheet and bake for 6 to 7 minutes; it should feel firmish and get slightly darker at the edges. Slide the cookie onto a cooling rack. Go ahead and reuse the parchment for another layer.\nMeanwhile, while the first layer is baking, roll out your second piece so it’s ready to go into the oven as soon as the first comes out. If you’re making good time, get the third ready too and continue to bake them two at a time. Keep adding the unbaked cookie trimmings onto one piece of parchment paper. Repeat this process as you bake each round and you’ll have all 8 baked before you know it.\nFinally, take that last sheet of parchment with all of the cookie scraps on it and slide it onto a baking sheet and bake it, checking in at 4 minutes, because the thinnest scraps will want to burn quickly. By 5 minutes, all should be baked until pale golden. Let cool completely and save until you’re ready to decorate the cake tomorrow.\nFill and frost the cake: Whisk sour cream and sweetened condensed milk together in a large bowl. Once cookies are cool, place a dab of the sour cream mixture on your cake plate and place the first cookie on top of it to help adhere it.\nCut or tear one of your used pieces of parchment paper into strips and tuck them all around the underside of the cake to protect your cake plate. Trust me, if you do not do this, you will regret it.\nScoop 3/4 cup sour cream mixture onto the center of your first cookie layer. Spread it only a little from the center, leaving a good 1- to 2-inch margin of unfrosted cookie. Stack the second cookie on top and repeat until you have 8 layers.\nThis will quickly become a huge mess. The sour cream is going to spill out and down the sides anyway (hear hear for those paper strips) and you’re going to start yelling at me/drafting an angry comment in your head. It’s also going to want to slide around and not stay neatly stacked. It’s totally okay because the filling will thicken as it absorbs into the cookies. Put the cake in the fridge for a couple hours (1 to 3) and when you come back to it, nudge the stack gently back into place and use a spoon and icing spatula to scoop the spilled-out filling back up the sides and onto the top of the cake. Don’t worry about it looking neat. Let it chill overnight.\nThe next day, finish the cake: Grind your baked, reserved cookie scraps in a blender or food processor, or bash them into crumbs in a bag with a rolling pin.\nTake your cake out and do one final frosting clean-up. Spread any newly puddled sour cream back up the sides and across the top. If you’d like to make a decoration on top of your cake, take one of those used pieces of parchment paper (see how much Deb hates wasting parchment) and cut a stencil with it. Place it gently on top of the cake.\nUse a small spoon to sprinkle the top and sides of the cake with the crumbs. In the coolest trick I saw on a cooking video, use a pastry brush (or extremely clean paintbrush, I won’t tell) to gently brush the crumbs off the stencil and across the cake in a thin layer. It sounds crazy but it works — on the sides too. Remove the stencil and parchment paper strips and look at that clean serving plate! (Bravo, you.)\nYou can serve the cake right away, or keep it in the fridge for up to 5 days. When slicing, I found that a knife dipped in hot water made picture-perfect cuts.\nA bunch of extra dough and cake layer tips:The dough is a bit stiff, but it will stretch to the size you need with pressure. If you’re finding it to be a huge pain, that the dough clearly wants to go to 8 inches but not 9, just go ahead and make the cake 8 inches round. It will be just as good of a cake; the layers might need a single extra minute to bake.Ovens will vary, especially for such thin cookies, so keep an eye on the first round as of the 6-minute mark, checking in each minute after as it can brown very quickly, and then you’ll know how much time you need for the remaining ones.This dough is easiest to roll/softest when it’s still a little warm; if yours has cooled quickly, I found that you could put each piece in the microwave for 5 to 7 seconds (only!) to get it a touch warmer again, without prematurely baking the cookie.Go ahead and save all of those used pieces of parchment paper for the next step and beyond. We’re going to use them again."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/russian-honey-cake.jpg?w=750",
  "ingredient_list": [
    "1/2 cup (170 grams) honey",
    "1/2 cup (100 grams) sugar",
    "1/2 cup (115 grams) unsalted butter",
    "1 teaspoon baking soda",
    "3 large eggs",
    "1/4 teaspoon fine sea or table salt",
    "1 teaspoon (5 ml) vanilla extract",
    "3 1/2 cups (455 grams) all-purpose flour, divided",
    "32 ounces (just shy of 4 cups or 900 grams) sour cream",
    "1 14-ounce can (400 grams) sweetened condensed milk"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Photo",
    "Russian"
  ],
  "title": "russian honey cake",
  "url": "https://smittenkitchen.com/2016/10/russian-honey-cake/"
}