{
  "date": "2015-10-23T11:56:52+00:00",
  "directions": [
    "Heat your oven to 350°F. Generously grease a 10-cup Bundt pan, either with butter or a nonstick spray; I like to use a butter-flour spray and go over the pan twice. Bundts are sticky! Fortuntely, this cake is not. ",
    "In a large bowl, cream butter and sugar together until light and fluffy. Beat in eggs, one at a time, scraping down bowl between each, and then yolks. Add vanilla. Sprinkle batter with salt and baking powder and mix briefly to combine. Add about 1/3 of flour, mix to combine, then half of buttermilk, mixing again just to combine, repeating with next 1/3 of flour, remaining buttermilk then remaining flour. ",
    "Dollop batter into prepared pan and spread so that the top is smooth. Bake in heated oven for 40 to 45 minutes, or until toothpick inserted into cake comes out batter-free. Let cool in pan on wire rack for 10 minutes, then invert onto rack and let cool absolutely completely. You can hasten this along in the fridge; it will take about 45 minutes.",
    "When cake is completely and totally cool, invert it again. If your cake had domed quite a bit in the oven, you can use a serrated knife to level it a little. Then, using a melon baller (my first choice), small spoon or paring knife, scoop out several mounds of cake through the underside, being sure not to cut through top or sides of cake. If using a traditional bundt shape (as I show), I used the larger bloops in the pattern (there are 8) for mine. What happens to the cake bellies you scoop out is between you and your gods. ",
    "Combine egg whites, sugar and cream of tartar in a heatproof bowl and place this over a pot of gently simmering water. Whisk constantly until sugar dissolves and whites are lukewarm to touch, about 3 minutes. Remove bowl from simmering water and use an electric mixer to beat with a whisk attachment on low speed, gradually increasing to high, until stiff, glossy peaks form, about 4 to 7 minutes. Add vanilla and mix to combine.",
    "Scoop filling into a large piping bag fitted with a large, round tip or plastic bag with the corner cut off and fill the indentations of the cake. Center your cake platter over the cake and invert your filled cake back onto it. If desired, dust lightly with powdered sugar before serving. ",
    "This cake keeps at room temperature for up to 3 days. I keep mine under a cake dome. ",
    "* A few ways to approach the filling:"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/twinkie-bundt1.jpg?w=750",
  "ingredient_list": [
    "Cake",
    "1 cup (225 grams) unsalted butter, at room temperature",
    "1 3/4 cups (350 grams) granulated sugar",
    "2 large eggs",
    "2 large yolks (save the 2 whites for filling, below)",
    "1 teaspoon (5 ml) vanilla extract",
    "2 teaspoons baking powder",
    "1 teaspoon fine sea salt or table salt",
    "2 1/2 cups (315 grams) all-purpose flour",
    "1 cup (235 ml) buttermilk",
    "Filling*",
    "2 large egg whites",
    "2/3 cup (135 grams) granulated sugar",
    "1/4 teaspoon cream of tartar",
    "1 teaspoon (5 ml) vanilla extract"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Photo"
  ],
  "title": "twinkie bundt",
  "url": "https://smittenkitchen.com/2015/10/twinkie-bundt/"
}