[
    {
        "ingredient_list": [
            "Pastry", 
            "1 1/4 cups (160 grams) all-purpose flour", 
            "1/2 teaspoon table salt", 
            "1 1/2 teaspoons granulated sugar", 
            "Zest of half a lemon", 
            "8 tablespoons (4 ounces or 113 grams) cold unsalted butter, cut into pieces", 
            "1/4 cup ricotta, yogurt or sour cream", 
            "3 to 4 tablespoons cold water", 
            "Filling", 
            "2 cups berries or chopped fruit (I used raspberries and cherries on the red one, blueberries for on the blue)", 
            "3 to 4 tablespoons granulated sugar (use the lower amount if your fruit is especially sweet)", 
            "2 tablespoons cornstarch", 
            "Juice of half a lemon", 
            "Pinch of salt", 
            "Glaze", 
            "1 egg yolk beaten with 1 teaspoon water", 
            "1 heaped teaspoon turbinado or coarse sugar for sprinkling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/blue-and-red-berry-ricotta-galettes1.jpg?w=640", 
        "tags": [
            "Blueberries", 
            "Cherries", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/07/blue-and-red-berry-ricotta-galette/", 
        "title": "blue and red berry ricotta galette", 
        "directions": [
            "Make dough: Whisk the flour, salt, sugar and zest together in the bottom of a large bowl. Work the butter into the flour with your fingertips or a pastry blender until mixture resembles a coarse meal and the largest bits of butter are the size of tiny peas. Stir ricotta and 3 tablespoons water together in a small dish and pour into butter-flour mixture. Stir together with a flexible spatula as best as you can, then use your hands to knead the mixture into a rough, craggy ball. Wrap in plastic and flatten into a disc. Chill in the fridge for 1 hour or up to 48 hours, or you can quick-firm this in the freezer for 15 minutes.", 
            "Assemble galette: Heat oven to 400 degrees. On a floured counter, roll the dough out into a large round-ish shape, about 14 to 15 inches across. ", 
            "[If you’d like to form yours into a star, as shown, use the red dashed outline of this template [PDF]. It will print smaller on an 8.5×11-inch piece of paper than you need, but you can use it as a rough guide to cut as large of a pentagon shape as your dough will allow.] ", 
            "Transfer round or pentagon-shaped dough to a parchment-lined baking sheet; I like to fold my dough gently, without creasing, in quarters then unfold it onto the baking pan. [If you’re making a star, cut a 1-inch notch in the center of each side, angling it toward the center, as shown in the blue dashed lines of the template.] ", 
            "Stir together all of the filling ingredients and spread them in the center of the dough, leaving a 2-inch border. If you’re making a round galette, fold the border over the filling, pleating the edge to make it fit. [If you’re making a star shape, fold each of the 5 corners into the center, along the green dotted lines of the template. Pinch the outer corners closed, to seal in the filling and the shape.] ", 
            "Whisk egg yolk and water together and brush over exposed crust. Sprinkle with coarse sugar.", 
            "Bake galette: For 30 minutes, or golden all over. Remove from the oven and let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature, preferably with vanilla ice cream. [My favorite vanilla ice cream recipe is used here.]"
        ], 
        "date": "2014-07-02T10:25:05+00:00"
    }, 
    {
        "ingredient_list": [
            "3 large egg", 
            "2 tablespoons granulated sugar", 
            "3/4 cup all-purpose flour", 
            "3/4 cup milk", 
            "1/2 teaspoon almond extract (more or less to taste)", 
            "Pinch of salt", 
            "4 tablespoons butter", 
            "2 cups pitted sweet cherries", 
            "1/2 cup sliced almonds, well-toasted", 
            "Powdered sugar", 
            "Lemon wedges"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/cherry-almond-dutch-baby1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Cherries", 
            "Pancakes", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/06/cherry-almond-dutch-baby/", 
        "title": "cherry almond dutch baby", 
        "directions": [
            "Heat oven to 425°F. Whisk egg, sugar, flour, milk, extract and salt together until the batter is blended but lumpy; you can also do this in a blender. In a 12-inch ovenproof frying pan, melt butter. Add cherries and cook until warmed, about 2 minutes. Pour in batter and transfer to heated oven. Bake for 15 to 20 minutes, until golden brown and rumpled-looking. (I err on the side of more cooking time with these pancakes, because I find the longer, within a range, they cook, the more rumpled and golden they get.) ", 
            "Remove pancake from oven and quickly scatter with toasted almonds, dust with powdered sugar and squeeze lemon juice over. Serve in wedges, piping hot."
        ], 
        "date": "2014-06-26T11:23:35+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust:", 
            "7 tablespoons unsalted butter, melted", 
            "1/3 cup sugar", 
            "1/4 teaspoon vanilla extract", 
            "1 cup plus 1 tablespoon all purpose flour", 
            "Pinch of salt", 
            "Filling:", 
            "1/2 cup sugar", 
            "2 large eggs", 
            "Pinch of salt", 
            "1/4 cup all purpose flour", 
            "1 teaspoon vanilla extract", 
            "1/2 cup (1 stick) unsalted butter, diced", 
            "1 pound sweet cherries, which will yield 12 ounces of pitted cherries, which yielded some leftovers, perfect for snacking (alternately, you can use 12 ounces of the berry of your choice)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/3664441408_6dbba66669_b.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cherries", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/06/cherry-brown-butter-bars/", 
        "title": "cherry brown butter bars", 
        "directions": [
            "Make crust: Preheat over to 375°F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (It should look like this.) Congratulations! You’ve just faked a square tart pan.", 
            "Using rubber spatula or fork, mix melted butter, sugar, and vanilla in medium bowl, or if you’re Deb, in the bottom of the small saucepan you used to melt the butter. Add flour and salt and stir until incorporated. Transfer dough to your prepared pan, and use your fingertips to press the dough evenly across the bottom of the pan. Bake the crust until golden, about 18 minutes (it will puff slightly while baking). Transfer crust to rack and cool in pan. Maintain oven temperature.", 
            "Make the filling: Cook butter in heavy small saucepan (a lighter-colored one will make it easier to see the color changing, which happens quickly) over medium heat until deep nutty brown (do not burn), stirring often and watching carefully, about six minutes. Immediately pour browned butter into glass measuring cup to cool slightly.", 
            "Whisk sugar, eggs, and salt in medium bowl to blend. Add flour and vanilla and whisk until smooth. Gradually whisk browned butter into sugar-egg mixture; whisk until well blended.", 
            "Arrange pitted cherries, or the berries of your choice, in bottom of cooled crust. Carefully pour browned butter mixture evenly over the fruit. Bake bars until filling is puffed and golden and tester inserted into center comes out clean, about 40 minutes (though, of course, this took less time in my hyperactive oven so please watch your baking times carefully). Cool bars completely in pan on rack.", 
            "Use the parchment paper overhang to carefully remove cooled bars from pan and place them on a cutting board and cut them into squares with a very sharp knife. The cherries, if they fall over your slicing lines, will want to give you trouble but if you saw a sharp knife into them slowly before pressing down, they’ll cut neatly and with minimum carnage.", 
            "Do ahead: Can be made at least a day ahead, and stored at room temperature. Any longer, keep them cool in the fridge."
        ], 
        "date": "2009-06-29T13:07:57+00:00"
    }, 
    {
        "ingredient_list": [
            "3 large eggs", 
            "1/2 cup (100 grams) sugar", 
            "6 tablespoons (85 grams) unsalted butter, melted and cooled slightly, plus more to butter dish", 
            "1 cup (130 grams)  all-purpose flour", 
            "A couple pinches of salt", 
            "1 cup (235 ml) milk", 
            "1/2 teaspoon almond extract", 
            "2 teaspoons brandy or rum (optional)", 
            "2 generous (245 grams) cups sweet cherries, pitted if you wish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/cherry-clafoutis.jpg?w=750", 
        "tags": [
            "Cherries", 
            "French", 
            "Fruit", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2007/07/cherry-clafoutis/", 
        "title": "cherry clafoutis", 
        "directions": [
            "Heat oven to 400F. Beat the sugar and eggs together with a whisk until they lighter in color. Gradually add butter, beating to incorporate. Add the flour and salt all at once and whisk until the batter is a homogeneous mixture. Next slowly pour in the milk a little at a time. Add the extract, and brandy or rum if you are using it, mixing well. The batter should be very smooth and shiny.\nPlace the cherries in a buttered glass or earthenware baking dish, cake pan (9 or 10 inches in diameter) or skillet that can go in the oven. (I use a 9-inch cake pan.) Pour the batter over the fruit. Bake 25 to 30 minutes, until slightly browned and almost completely set in the middle. Let sit at least 15 minutes before serving in wedges. I like it dusted with powdered sugar.", 
            ""
        ], 
        "date": "2007-07-20T12:37:46+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (1 1/2 sticks) unsalted butter, room temperature, divided", 
            "1/4 cup (packed) dark brown sugar", 
            "2 teaspoons balsamic vinegar", 
            "3 cups whole pitted fresh Bing cherries or other dark sweet cherries (about 21 ounces whole unpitted cherries)", 
            "1 1/4 cups all purpose flour", 
            "1/4 cup yellow cornmeal (preferably stone-ground medium grind)", 
            "2 teaspoons baking powder", 
            "1/4 teaspoon salt", 
            "1 cup sugar", 
            "2 large eggs, separated", 
            "3/4 teaspoon vanilla extract", 
            "1/2 cup whole milk", 
            "1/4 teaspoon cream of tartar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cherry-cornmeal-upside-down-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Cherries", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/05/cherry-cornmeal-upside-down-cake/", 
        "title": "cherry cornmeal upside-down cake", 
        "directions": [
            "Position rack in center of oven; preheat to 350°F. Combine 1/4 cup butter with brown sugar and vinegar in 10- to 11-inch ovenproof skillet with 2-inch-high sides. Stir over medium heat until butter melts and sugar dissolves, about 2 minutes. Increase heat to high; add cherries and bring to boil. Remove from heat.", 
            "Whisk flour, cornmeal, baking powder, and salt in medium bowl to blend. Using electric mixer, beat 1/2 cup butter in large bowl. Add sugar; beat until pale and fluffy, about 3 minutes. Beat in egg yolks and vanilla. Add flour mixture alternately with milk in 2 additions each, beating just until blended and occasionally scraping down sides of bowl. Using clean dry beaters, beat egg whites in another medium bowl until foamy. Add cream of tartar and beat until whites are stiff but not dry. Using rubber spatula, fold 1/4 of whites into batter to lighten slightly. Fold in remaining whites in 3 additions (batter will be thick). Spoon batter over cherries in skillet, then spread evenly with offset spatula to cover cherries.", 
            "Bake cake until top is golden brown and tester inserted into center comes out clean, about 45 minutes. Cool in skillet on rack 5 minutes. Run spatula around edges of cake to loosen. Place large serving platter upside down atop skillet. Using pot holders or oven mitts, firmly hold platter and skillet together and invert. Leave skillet atop cake 5 minutes. Remove skillet. If necessary, rearrange any cherries that may have become dislodged. Let cake cool at least 45 minutes. Cut cake into wedges and serve slightly warm or at room temperature."
        ], 
        "date": "2008-05-15T10:39:25+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup walnut pieces", 
            "1 cup dried Turkish or Calimyrna figs, quartered", 
            "3/4 stick (6 tablespoons or 3 ounces) unsalted butter, softened", 
            "1/4  cup granulated sugar, plus more for sprinkling", 
            "6 tablespoons dark brown sugar, packed", 
            "2 eggs", 
            "1 teaspoon pure vanilla extract", 
            "Grated zest of 1/2 a large orange (I used a clementine)", 
            "1 3/4 cup plus 2 tablespoons (or 2 cups minus 2 tablespoons)  unbleached, all-purpose flour", 
            "1 teaspoon baking powder", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon kosher salt", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon. ground nutmeg", 
            "1/8 teaspoon ground cloves", 
            "1 egg white, lightly beaten"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/fig-and-walnut-biscotti.jpg?w=753", 
        "tags": [
            "Cookie", 
            "Figs", 
            "Italian", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/01/fig-and-walnut-biscotti/", 
        "title": "fig and walnut biscotti", 
        "directions": [
            "1. Preheat the oven to 325 degrees.  Spread the walnuts on a baking sheet and toast for 5 to 7 minutes, or until golden brown and fragrant. Allow the walnuts to cool completely", 
            "2. Place the walnuts and dried figs in a food processor and process until they are finely chopped.", 
            "3. In the bowl of an electric mixer, cream together the butter and sugars until light and fluffy. Add the eggs, one at a time, and beat until incorporated, scraping down the sides of the bowl with a spatula occasionally. Beat in the vanilla and the orange zest.", 
            "4. In a medium bowl, stir together the flour, baking powder, baking soda, salt and spices. Beat the dry ingredients into the butter mixture to form a somewhat firm dough. Add the walnuts and figs and beat until thoroughly combined. Wrap the dough tightly in plastic and chill 35 to 40 minutes or until completely firm.", 
            "5. When the dough has chilled, lightly grease a baking sheet. On a floured board, use your palms to roll the piece of dough into a log the length of the baking sheet. Place the log on the baking sheet.", 
            "6. In a small bowl, beat the egg white with a fork until frothy. With a pastry brush, glaze the log with some egg white and sprinkle it with granulated sugar. Bake for 15 to 20 minutes (this took longer in my oven, but everything seems to these days), or until the log is lightly golden brown, firm to the touch and just beginning to crack slightly.", 
            "7. Allow the log to cool on the cookie sheet until cool to the touch, about 40 minutes.  With a serrated knife, slice the biscotti, slightly on the bias, into 1/2-inch slices. Lay the slices on the cookie sheet in single layer (I always end up needing a second baking sheet in this step, as they have a lot more surface area); Return the biscotti to the oven and cook for 20 more minutes, or until the biscotti are toasted and crisp. ", 
            "Store the biscotti in an airtight container. They will keep up to about 2 weeks."
        ], 
        "date": "2009-01-05T16:49:24+00:00"
    }, 
    {
        "ingredient_list": [
            "Bread", 
            "2 1/4 teaspoons (1 packet — 1/4 ounce or 7 grams) active dry yeast", 
            "1/4 cup (85 grams) plus 1 teaspoon honey", 
            "2/3 cup warm water (110 to 116 degrees F)", 
            "1/3 cup (80 ml) olive oil, plus more for the bowl", 
            "2 large eggs", 
            "2 teaspoons flaky sea salt, such as Maldon, or 1 1/2 teaspoons table salt", 
            "4 cups (500 grams) all-purpose flour", 
            "Fig Filling", 
            "1 cup (5 1/2 ounces or 155 grams) stemmed and roughly chopped dried figs", 
            "1/8 teaspoon freshly grated orange zest, or more as desired", 
            "1/2 cup (120 ml) water", 
            "1/4 cup (60 ml) orange juice", 
            "1/8 teaspoon sea salt", 
            "Few grinds black pepper", 
            "Egg wash", 
            "1 large egg", 
            "Coarse or flaky sea salt, for sprinkling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/09/fig-olive-oil-and-sea-salt-challah.jpg?w=750", 
        "tags": [
            "Announcements", 
            "Bread", 
            "Cookbooks", 
            "Figs", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/09/fig-olive-oil-and-sea-salt-challah-book-tour/", 
        "title": "fig, olive oil and sea salt challah + book tour!", 
        "directions": [
            "To make dough with a stand mixer: Whisk the yeast and 1 teaspoon honey into warm water, and let it stand for a few minutes, until foamy. In a large mixer bowl, combine the yeast mixture with remaining honey, 1/3 cup olive oil, and eggs. Add the salt and flour, and mix until dough begins to hold together. Switch to a dough hook, and run at low speed for 5 to 8 minutes. Transfer the dough to an olive-oil coated bowl (or rest the dough briefly on the counter and oil your mixer bowl to use for rising, so that you’ll use fewer dishes), cover with plastic wrap, and set aside for 1 hour, or until almost doubled in size.", 
            "To make the dough by hand: Proof the yeast as directed above. Mix the wet ingredients with a whisk, then add the salt and flour. Mix everything together with a wooden spoon until the dough starts to come together. Turn the mixture out onto a floured counter, and knead for 5 to 10 minutes, until a smooth and elastic dough is formed. Let rise as directed above.", 
            "Meanwhile, make fig paste: In a small saucepan, combine the figs, zest, water, juice, salt, and a few grinds of black peper. Bring to a simmer over medium heat, and cook, stirring occasionally, until the figs are soft and tender, about 10 minutes. Season with salt and pepper to taste. Remove from heat, and let cool to lukewarm. PRocess fig mixture in a food processor until it resembles a fine paste, scraping down the sides of the bowl as necessary. Set aside to cool.", 
            "Insert figs: After your dough has risen, turn it out onto a floured counter and divide it in half. Roll the first half of the dough into a wide and totally imperfect rectangle (really, the shape doesn’t matter). Spread half the fig filling evenly over the dough, stopping short of the edge. Roll the dough into a long, tight log, trapping the filling within. Then gently stretch the log as wide as feels comfortable (I take mine to my max counter width, a pathetic three feet), and divide it in half. Repeat with remaining dough and fig filling.", 
            "Weave your challah: Arrange two ropes in each direction, perpendicular to each other, like a tight tic-tac-toe board. Weave them so that one side is over, and the other is under, where they meet. So, now you’ve got an eight-legged woven-headed octopus. Take the four legs that come from underneath the center and move the leg to their right — i.e., jumping it. Take the legs that were on the right and, again, jump each over the leg before, this time to the left. If you have extra length in your ropes, you can repeat these left-right jumps until you run out of rope. Tuck the corners or odd bumps under the dough with the sides of your hands to form a round.", 
            "Transfer the dough to a parchment-cover heavy baking sheet, or, if you’ll be using a bread stone, a baker’s peel. Beat egg until smooth, and brush over challah.  Let challah rise for another hour, but 45 minutes into this rise, preheat your oven to 375°F.", 
            "Bake your loaf: Before baking, brush loaf one more time with egg wash and sprinkle with sea salt. Bake in middle of oven for 35 to 40 minutes. It should be beautifully bronzed; if yours starts getting too dark too quickly, cover it with foil for the remainder of the baking time. The very best way to check for doneness is with an instant-read thermometer — the center of the loaf should be 195 degrees. ", 
            "Cool loaf on a rack before serving. Or, well, good luck with that."
        ], 
        "date": "2012-09-11T11:26:27+00:00"
    }, 
    {
        "ingredient_list": [
            "Crumb crust", 
            "8 ounces (15 4 3/4 x 2 1/2-inch sheets of graham cracker; yes, I am crazy enough to both count and measure) finely ground graham crackers or cookies such as chocolate or vanilla wafers", 
            "8 tablespoons (1 stick or 4 ounces or 113 grams) unsalted butter, melted", 
            "1/2 cup sugar", 
            "1/4 teaspoon salt", 
            "Very tall cheesecake filling:", 
            "5 (8-ounce) packages cream cheese, softened (Philadelphia is recommended for cheesecakes but if you’ve had success with other brands, feel free to use them again)", 
            "1 3/4 cups sugar", 
            "3 tablespoons all-purpose flour", 
            "1 teaspoon finely grated lemon zest", 
            "1 teaspoon finely grated orange zest", 
            "5 large eggs", 
            "2 large egg yolks", 
            "1/2 teaspoon vanilla", 
            "Cherry topping", 
            "10 ounces sweet or sour cherries, pitted (they’re not in season here so I used frozen; worked just fine)", 
            "2 tablespoons lemon juice", 
            "1/4 cup sugar*", 
            "1 tablespoon cornstarch", 
            "1/2 cup water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/4483663963_3070fd49b9_b.jpg?w=753", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Cherries", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/04/new-york-cheesecake/", 
        "title": "new york cheesecake", 
        "directions": [
            "Make crumb crust: Stir together crust ingredients and press onto bottom and up the sides, stopping one inch shy of the top rim**, of a buttered 9 1/2-inch (or 24 cm) springform pan. You can fill it right away but I like to pop my into the freezer so it quickly sets while I prepare the filling.", 
            "Make very tall cheesecake filling: Preheat oven to 550 F degrees***. Beat together cream cheese, sugar, flour and zest with an electric mixer until smooth. Add vanilla, then eggs and yolks, one at a time, beating on low speed until each ingredient is incorporated. Scrape bowl down between additions; I cannot stress this enough as if you do not, you’ll end up with unmixed stripes of cream cheese. I always find at least one, despite my best efforts.", 
            "Put springform pan with crust in a shallow baking pan (to catch drips). Pour filling into crust (springform pan will be completely full) and baking in baking pan in the middle of the oven for 12 minutes or until puffed. Please watch your cake because some ovens will top-brown very quickly and if yours does too fast, turn the oven down as soon as you catch it. Reduce the temperature to 200 degrees (see Note below about my baking drama) and continue baking until cake is mostly firm (center will still be slightly wobbly when pan is gently shaken), about one hour more.", 
            "Run a knife around the top edge of the cake to loosen it and cool the cake completely in springform on a rack, then chill it, loosely covered, at least 6 hours.", 
            "Make cherry topping (optional): Place all ingredients together in a medium saucepan. Bring to a boil. Once it is boiling, cook it for an additional one to two minutes then remove from heat. Cool completely.", 
            "Remove side of pan and transfer cake to a plate. If you had any wonky baking issues (see my Note below), you might need to trim the cake flat. I promise not to tell anyone what happened to those scraps, okay?", 
            "Spread topping (if using) over chilled cheesecake. The original recipe says to bring this to room temperature before serving, but I never have!", 
            "Do ahead: Cheesecake keeps, covered and chilled, 2 weeks.", 
            "Baking drama: As some of the pictures might suggest, I really borked (an actual word, thank you) the baking of this cake. First, I was convinced that 550 degrees would singe my cake so I did the first step at 400, to see if you can get away with it. Yes, I am guilty of not following a recipe from time to time too. It turns out, 550 would have been just fine. Then, although I turned my oven down to 200, I didn’t check the thermometer inside my junky oven, and had I, I’d have realized that what my oven calls 200 is more like 150. And an hour later, was almost completely raw. Then I upped it to 300, which my oven told me was actually 250, where it still took another hour to bake and gained many cracks. I blame the fact that the oven didn’t start hot enough, as many others have made this recipe crack-free. What’s the point of me sharing this? To give you a heads up that oven wonkiness may ensue. What matters is that, in the end, you do not take the cake out before it is ready. An accurate oven helps too. I’m going to get right on that.", 
            "* You might dial this up by up to another 1/4 cup if you’re using sour cherries. However, if you’re using sour cherries I’m going to assume it is because you like them, and the more tart taste they impart, thus you probably will enjoy this sauce just as much with only 1/4 cup sugar. Look at me, psychologizing!", 
            "** This is updated based on responses from commenters. Thank you, intrepid home bakers!", 
            "*** Yes, this is correct, but updated to note 9/12/10 that please, if you are using a Teflon-coated pan, note it’s temperature limit, often around 475, and only start your baking temperature there."
        ], 
        "date": "2010-04-06T12:58:45+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups strained yogurt* or Greek-style yogurt", 
            "3/4 cup sugar", 
            "1/2 teaspoon almond extract", 
            "3/4 cup cherries, pits removed and roughly chopped", 
            "1 cup unsweetened coconut milk"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pinkcherry1.jpg?w=500", 
        "tags": [
            "Cherries", 
            "Coconut", 
            "Fruit", 
            "Ice Cream/Sorbet", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/05/pinkcherry/", 
        "title": "coconut pinkcherry yogurt", 
        "directions": [
            "Mix together the yogurt, sugar, almond extract, cherries and coconut milk. Stir until the sugar is completely dissolved. Refrigerate 1 hour. ", 
            "Freeze in your ice cream maker according to the manufacturer’s instructions.", 
            "* To make 1 cup (240g) of strained yogurt, line a mesh strainer with a few layers of cheese cloth, then scrape 16 ounces or 2 cups (480g) of plain whole-milk yogurt into the cheesecloth. Gather the ends and fold them over the yogurt, then refrigerate for at least 6 hours."
        ], 
        "date": "2007-05-23T15:03:53+00:00"
    }, 
    {
        "ingredient_list": [
            "2/3 cup water", 
            "6 tablespoons sugar", 
            "3 tablespoons fresh lemon juice", 
            "1/2 vanilla bean, halved lengthwise", 
            "2 1/2 cups (1 pound) cherries, pitted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sour-cherry-compote1.jpg?w=500", 
        "tags": [
            "Cherries", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/08/sour-cherry-compote/", 
        "title": "sour cherry compote", 
        "directions": [
            "Combine water, sugar and lemon juice in heavy medium saucepan. Scrape seeds from vanilla bean into saucepan; add bean. Bring to boil over high heat, stirring until sugar dissolves. Boil until thin syrup forms, about 7 minutes. Reduce heat to medium; add cherries. Stir 1 minute. At this point, if you would like to keep your cherries whole and lovely as they are, stop cooking it and you’re done. I ended up letting mine simmer about 5 minutes more, until the cherries were slightly more broken down, but quite far from a jam. Cool the compote, then cover and chill until cold.", 
            "Do ahead: Keeps in the fridge for at least a week."
        ], 
        "date": "2008-08-26T11:19:31+00:00"
    }, 
    {
        "ingredient_list": [
            "For the almond crumble:", 
            "2/3 cup whole oats, ground to a flour in a food processor (yielding 1/2 cup oat flour)", 
            "1/2 cup all-purpose flour", 
            "1/2 cup sugar", 
            "1/4 teaspoon ground cinnamon", 
            "1/2 teaspoon kosher salt (you might want to first read up on kosher salts)", 
            "3/4 cup unsalted whole almonds, coarsely ground in a food processor or chopped medium fine by hand", 
            "6 tablespoons unsalted butter, melted and cooled", 
            "For the sour cherry filling:", 
            "3/4 cup sugar", 
            "3 tablespoons cornstarch", 
            "1/4 teaspoon kosher salt", 
            "2 1/4 pounds fresh sour cherries, pitted, or 2 pounds frozen sour cherries, partially thawed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sour-cherry-pie-with-almond-crumble1.jpg?w=500", 
        "tags": [
            "Cherries", 
            "Crumbles/Crisps", 
            "Photo", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2010/07/sour-cherry-pie-with-almond-crumble/", 
        "title": "sour cherry pie with almond crumble", 
        "directions": [
            "Prepare the bottom crust: Roll out the chilled pie dough into a 12 inch round. Gently fit into a 9- or 9.5-inch pie plate. Fold the edges under and crimp decoratively. Either refrigerate until firm, about 30 minutes (if you don’t wish to blind-bake the crust first) or preheat oven to 425, line dough with foil and weigh it down with pie weights. Bake until crust is light golden brown, about 30 minutes (for a more stable, crisp bottom crust). [Updated to add] Reduce temperature to 375°F.", 
            "Prepare the crumble: Grind oats to an oat flour in a food processor (you can also swap 1/2 cup oat flour, if you have it), then add the all-purpose flour, sugar, cinnamon, salt and whole almonds. Grind them together until the nuts are coarsely ground (if you don’t have a food processor, you can chop them medium-fine by hand). Stir together with melted butter in a bowl.", 
            "Make the cherry filling: In a large bowl, mix the cherries with the sugar, cornstarch and kosher salt. Taste the mixture to see if you want more sugar than is called for.", 
            "Assemble the pie: Pour the cherries into your unbaked or blind-baked pie shell. Sprinkle the almond crumble over the cherries. Place the pie plate on a foil-lined cookie sheet. Bake for about 1 hour and 10 minutes, or until the juices are bubbling and thick. Remove to a rack to cool to room temperature before serving."
        ], 
        "date": "2010-07-01T17:35:06+00:00"
    }, 
    {
        "ingredient_list": [
            "6 cups sour cherries, pitted (fresh or frozen will work; if frozen, defrost and drain first)", 
            "3/4 to 1 1/4 cups of sugar*", 
            "1/4 cup cornstarch", 
            "Juice of half a lemon", 
            "Pinch or two of salt", 
            "2 tablespoons heavy cream or one egg, beaten with a tablespoon of water", 
            "Glaze:", 
            "1 cup confectioners’ sugar", 
            "1 to 2 tablespoons milk or water or 1 tablespoon water plus 1 tablespoon lemon juice (I did this to make the glaze more interesting)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/3750059011_2643b0d11d_o.jpg?w=753", 
        "tags": [
            "Cherries", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/07/sour-cherry-slab-pie/", 
        "title": "sour cherry slab pie", 
        "directions": [
            "Preheat oven to 375°. In a large bowl, combine cherries, sugar, cornstarch, lemon juice, and salt. Stir to combine; set aside.", 
            "On a lightly floured surface, roll out the larger piece of dough into an 18-by-12-inch rectangle. I won’t lie: this can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible (and tossing it in the freezer for a couple minutes  if it softens too quickly; it is summer afterall) and using enough flour that it doesn’t stick to the counter. [See more of my pie-rolling tips here.]", 
            "Transfer to a 15-by-10-by-1-inch rimmed baking sheet, (pastry will hang over sides of pan). I went ahead and lined mine with parchment, just to ensure I’d be able to easily lift it out. Pour cherry mixture into lined baking sheet; set aside.", 
            "On a lightly floured surface, roll out remaining piece of dough into a 16-by-11-inch rectangle. Drape over filling. Bring bottom pastry up and over top pastry. Pinch edges to seal. Using a fork, prick top crust all over. Brush with heavy cream or egg wash.", 
            "Bake until crust is golden and filling is bubbling, 40 to 55 minutes. Transfer to a wire rack until just warm to the touch, about 45 minutes.", 
            "In a medium bowl, stir together confectioners’ sugar and milk, water or lemon juice (or combination thereof) until desired glaze consistency is achieved. Use a spoon to drizzle over top. Serve warm or room temperature.", 
            "* Martha had suggested 1 to 1 1/2 cups sugar for 6 cups of sour cherries. I balked, imagining my beautiful Jersey cherries drowning a syrupy death, and used 3/4 cup, which yielded a lightly-sweetened pie with the tartness of the cherries still coming through, just as we like. Please adjust this to your tastes, and according to the tartness of the cherries you brought home.", 
            "Some tips for replacing the sour cherries with other fruit: This pie is roughly 100% of a regular pie filling with 150% percent of the crust. Thus, if you’re looking to use something besides sour cherries, you can swap in 6 cups of any other fruit. Adjust the sugar accordingly — you’ll probably want less sugar with peaches or berries than you would with very sour cherries, or the same amount, if you like your pies on the sweeter side. (Remember, I kept this one very lightly sweetened.) Adjust the cornstarch accordingly too — peaches and berries usually let off more liquid than apples, but only slightly more than cherries.", 
            "One other route you can take is to use the filling part of your favorite pie recipe, as most standard fruit pies contain 6 cups of berries or chopped fruit. This way you’ll already know what spices, if any, you want to add and that the amount of sweetener and/or cornstarch/thickener is already spot-on. ", 
            "And do share your tweaks in the comments: I am sure that others would love to benefit from your experimentation!"
        ], 
        "date": "2009-07-24T14:39:46+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups pitted fresh cherries (about 2 1/2 pounds unpitted)", 
            "4 tablespoons cornstarch", 
            "2/3 to 3/4 cup sugar (adjust this according to the sweetness of your cherries)", 
            "1/8 teaspoon salt", 
            "Juice of half a lemon", 
            "1/4 teaspoon almond extract", 
            "1 tablespoon cold unsalted butter, cut into small bits", 
            "1 egg, beaten with 2 tablespoons water", 
            "Coarse sugar, for decoration"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sweet-cherry-pie1.jpg?w=500", 
        "tags": [
            "Cherries", 
            "Fruit", 
            "Photo", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/06/sweet-cherry-pie/", 
        "title": "sweet cherry pie", 
        "directions": [
            "Preheat oven to 400°F. ", 
            "Stir together the cherries, cornstarch, sugar, salt, lemon and almond extract gently together in a large bowl. ", 
            "Roll out half of chilled dough (use larger piece, if you’ve divided them unevenly) on a floured work surface to 13-inch round. Gently place it in 9-inch pie pan, either by rolling it around the rolling pin and unrolling it over the pan or by folding it into quarters and unfolding it in the pan. Trim edges to a half-inch overhang.", 
            "Spoon filling into pie crust, discarding the majority of the liquid that has pooled in the bowl. Dot the filling with the bits of cold butter.", 
            "Roll out the remaining dough into a 12-inch round on a lightly floured surface, drape it over the filling, and trim it, leaving a 1-inch overhang. Fold the overhang under the bottom crust, pressing the edge to seal it, and crimp the edge decoratively. Brush the egg wash over over pie crust, then sprinkle with coarse sugar. ", 
            "Cut slits in the crust with a sharp knife, forming steam vents, and bake the pie in the middle of the oven for 25 minutes. Reduce the temperature to 350°F. and bake the pie for 25 to 30 minutes more, or until the crust is golden. Let the pie cool on a rack."
        ], 
        "date": "2008-06-22T12:22:30+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup sugar", 
            "3 star anise", 
            "1/2 of plump vanilla bean, split in half lengthwise", 
            "8 dried Turkish apricots, cut in half", 
            "4 dried figs, quartered", 
            "4 2-inch long pieces lemon zest (peeled with a vegetable peeler) from a Meyer lemon if you can find one", 
            "Juice of the zest lemon", 
            "3 firm Bosc pears", 
            "1 firm tart apple", 
            "Seeds from half a pomegranate"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/winter-fruit-salad1.jpg?w=500", 
        "tags": [
            "Figs", 
            "Fruit", 
            "Pear", 
            "Photo", 
            "Pomegranate", 
            "Salad", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/11/winter-fruit-salad/", 
        "title": "winter fruit salad", 
        "directions": [
            "1. Fill a medium saucepan with 4 cups water. Add the sugar, star anise, vanilla bean and lemon zest. Bring to a boil, and cook until all the sugar is dissolved. Let it cool for just a few minutes (it should still be hot) and then stir in the dried figs and apricots. Let it cool completely.", 
            "2. Meanwhile, peel and core pears and apple. Slice thinly lengthwise and place in a large bowl, and toss with the lemon juice.", 
            "3. Once the syrup with dried fruit has cooled, pour it over the apples and pears.  Cover the bowl with plastic wrap and chill it overnight in the refrigerator.", 
            "4. The next morning, using a slotted spoon, ladle the fruit into a serving bowl, sprinkle with the pomegranate seeds and serve. Remove the vanilla beans (you can rinse and save what is left of them for another use) and lemon peels if you wish, or leave them in for decoration.", 
            "Do ahead Syrup can be made in advance and kept in the fridge for a day or two. Hot syrup can be poured over the dried fruit and kept in the fridge for a day or so. Prepared salad keeps in the fridge for a day or two, but is best fresh."
        ], 
        "date": "2008-11-16T22:12:16+00:00"
    }
]