{
  "date": "2013-11-20T12:06:40+00:00",
  "directions": [
    "To steam cauliflower: Set a steamer basket (see Notes) inside a large pot. Bring about one inch of water to a boil in the pot, lower cauliflower, whole or in large florets, into basket, and cover pot with lid. Reduce heat to medium. Let cauliflower steam for 10 to 20 minutes (less time if using a proper steamer basket, longer if using the modified basket below), or until it is easily pierced with a knife.   ",
    "To roast cauliflower: Heat oven to 400 degrees. Lightly coat a large baking sheet with oil. Scatter cauliflower florets evenly over pan and roast until cauliflower is brown at edges and easily pierced with a knife, about 20 to 30 minutes. Toss and flip pieces once, halfway through roasting time, to ensure that they brown easily.",
    "Make brown butter crumbs: When cauliflower is almost done, melt butter in a heavy frying pan over medium heat, and continue to cook it after it is melted until it is a little brown, and smells toasty. Working quickly, stir in the shallots, and let them hiss in the butter for about 30 seconds. Add the breadcrumbs, garlic, 1/4 teaspoon table salt (if using unsalted butter, skip if using salted) and a few grinds of black pepper and cook together, stirring frequently, until crumbs are a shade darker, anywhere from 5 to 10 minutes. Add a scrape or two of lemon zest and adjust seasonings to taste.",
    "Assemble dish: Place whole cooked cauliflower or cauliflower florets in a low serving bowl. Toss gently with lemon juice, salt and pepper to taste. Spoon crumbs over cauliflower, pressing them onto the florets as you can, and letting the rest fall into the serving dish. Scatter herbs over top and serve with a large spoon.",
    "Do ahead: Steam or roast cauliflower and make crumbs; keep them separate until serving. Just before serving, rewarm cauliflower and add crumbs.",
    "Many notes:"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cauliflower-with-brown-butter-breadcrumbs1.jpg?w=640",
  "ingredient_list": [
    "1 medium head cauliflower (1 1/2 to 2 pounds)",
    "Oil for pan, if roasting",
    "4 tablespoons salted or unsalted butter",
    "1 medium or 2 tiny shallots, finely minced",
    "1 small clove garlic, minced",
    "Approximately 3/4 cup panko (Japanese-style) breadcrumbs",
    "Salt and freshly ground black pepper",
    "Few gratings of lemon zest",
    "1 to 2 tablespoons fresh lemon juice",
    "1 tablespoon chopped flat-leaf parsley or chives"
  ],
  "tags": [
    "Brown Butter",
    "Cauliflower",
    "Fall",
    "Photo",
    "Side Dish",
    "Thanksgiving",
    "Vegetarian"
  ],
  "title": "cauliflower with brown butter crumbs",
  "url": "https://smittenkitchen.com/2013/11/cauliflower-with-brown-butter-crumbs/"
}