{
  "date": "2011-12-28T18:54:59+00:00",
  "directions": [
    "Preheat oven to 350°F. Butter 12 standard size or 30 miniature muffin cups, or line cups with paper liners.",
    "Prepare coatings: In a small saucepan, melt 6 tablespoons butter over medium heat and continue to cook it, stirring frequently, until brown bits form on the bottom and it smells nutty and heavenly. Immediately remove from heat and set aside. In a small bowl, combine 2/3 cup sugar and cinnamon. Set aside as well.",
    "Prepare puffs: Whisk flour, baking powder, baking soda, salt and nutmeg together in a medium bowl and set aside. In the large bowl of an electric mixer, beat softened butter and sugar together until light and fluffy. Add egg and vanilla and beat until combined. Mix in 1/3 of flour mixture, followed by 1/2 of buttermilk, repeating again and finishing with the flour mixture. Mix only until combined. ",
    "Spoon into prepared muffin cups, filling only 3/4 of the way. (I filled mine higher and they ended up spilling over a bit and doming less than they are capable of.) Bake standard sized muffins for 20 to 25 minutes and miniature muffins for 12 to 14 minutes. When finished, muffins will feel springy to the touch and a tester inserted into the center will come out clean. Transfer them in their pan to a wire rack. ",
    "As soon as you feel you’re able to pick one up, take your first puff and roll the top and upper edges in the browned butter. Don’t be afraid to pick up the browned butter solids at the bottom of the saucepan; they’re the dreamiest part. Let any excess butter drip off for a second before gently rolling the butter-soaked cake top in cinnamon-sugar. I find if you roll too firmly, or have too much wet/not absorbed butter on top, the sugar can clump off, which is heartbreaking. Transfer puff to wire rack to set and repeat with remaining puffs. Eat warm.",
    "For an even more indulgent, doughnut-like puff: Make an extra two tablespoons of the browned butter and roll the whole puff in it and the cinnamon sugar. (I usually have enough cinnamon sugar to fully roll the puffs.)",
    "Do ahead: Puffs are best within hours after they are baked. They can be made it advance and stored in a freezer bag until needed, too. Simply spread them out on a baking tray and reheat them until warm in the oven."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/cinnamon-brown-butter-breakfast-puffs1.jpg?w=750",
  "ingredient_list": [
    "Coating",
    "2/3 cup granulated sugar",
    "1 tablespoon ground cinnamon",
    "6 tablespoons unsalted butter",
    "Puffs",
    "1 1/2 cups all-purpose flour",
    "1 1/2 teaspoons baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon table salt",
    "1/4 teaspoon freshly grated nutmeg",
    "1/2 cup granulated sugar",
    "1/3 cup (5 tablespoons plus 1 teaspoon) unsalted butter, at room temperature, plus extra for greasing muffin cups",
    "1 large egg",
    "1 teaspoon pure vanilla extract",
    "1/2 cup buttermilk "
  ],
  "tags": [
    "Breakfast",
    "Brown Butter",
    "Brunch",
    "Muffin/Quick Bread",
    "Photo"
  ],
  "title": "cinnamon brown butter breakfast puffs",
  "url": "https://smittenkitchen.com/2011/12/cinnamon-brown-butter-breakfast-puffs/"
}