[
    {
        "ingredient_list": [
            "1 cup all-purpose flour", 
            "1 tablespoon baking powder", 
            "1/4 teaspoon salt", 
            "3 eggs, at room-temperature", 
            "4 ounces (1 stick) unsalted butter", 
            "3/4 cup sugar", 
            "3 pears, peeled, in a small dice (I used anjou, but would recommend a softer variety, like a bosc or any other of your favorites)", 
            "3/4 cup bittersweet chocolate chunks"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/bittersweet-chocolate-and-pear-cake1.jpg?w=500", 
        "tags": [
            "Brown Butter", 
            "Cake", 
            "Chocolate", 
            "Everyday Cakes", 
            "Fall", 
            "Fruit", 
            "Italian", 
            "Pear", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/01/bittersweet-chocolate-and-pear-cake/", 
        "title": "bittersweet chocolate and pear cake", 
        "directions": [
            "Preheat the oven to 350°F. Butter a 9-inch springform pan and dust with breadcrumbs (I cheated and used flour), set aside.", 
            "Sift the flour, baking powder and salt together, set aside.", 
            "Using a mixer fitted with the whisk attachment, whip the eggs on high speed until pale and very thick. (In a professional Kitchen Aid, it takes at least five minutes; on a home machine, it will take nine minutes to get sufficient volume)", 
            "While the eggs are whipping, brown the butter. Melt the butter in a medium saucepan (because it will foam a lot) and cook it until the butter browns and smells nutty (about 6 to 8 minutes). It helps to frequently scrape the solids off the bottom of the pan in the last couple minutes to ensure even browning. Remove from the flame but keep in a warm spot.", 
            "Add the sugar to the eggs and whip a few minutes more.", 
            "Just as the egg-sugar mixture is starting to lose volume, turn the mixture down to stir, and add the flour mixture and brown butter. Add one third of the flour mixture, then half of the butter, a third of the flour, the remaining butter, and the rest of flour. Whisk until just barely combined — no more than a minute from when the flour is first added — and then use a spatula to gently fold the batter until the ingredients are combined. It is very important not to over-whisk or fold the batter or it will lose volume.", 
            "Pour into prepared pan. Sprinkle the pear and chocolate chunks over the top, and bake until the cake is golden brown and springs back to the touch, about 40 to 50 minutes [updated, thanks for your responses], or a tester comes out clean.", 
            "We served it with barely whipped whipped cream with a drop of almond extract in it, but I believe Anna serves it with buttermilk ice cream at the restaurant, which is, the best thing in the entire world, something I have the recipe for and promise to tell you about soon. (I’m just scared to make it because I ate the entire pint she gave me last time by myself. In three days.)", 
            "Update 1/27/09: I’ve added more baking suggestions in the comments: in short, please, don’t take your cake out before it is done. Doneness is much more important than baking times. "
        ], 
        "date": "2009-01-22T10:32:37+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick, 4 ounces or 113 grams) butter, melted", 
            "1 cup (218 grams or 7 3/4 ounces for light; 238 grams or 8 3/8 ounces for dark) brown sugar", 
            "1 large egg", 
            "1 teaspoon vanilla or 1/2 teaspoon almond extract", 
            "Pinch salt", 
            "1 cup (4 3/8 ounces or 125 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/blondies.jpg?w=749", 
        "tags": [
            "Bourbon", 
            "Brown Butter", 
            "Brownies/Blondies", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/blondies/", 
        "title": "blondies, infinitely adaptable", 
        "directions": [
            "Further additions, use one or a combination of: ", 
            "New favorite combination of late (added 5/24/14): We’ve gotten on a kick making these again, but I’ve really wanted to increase the toasty butterscotch flavor and have done so by: browning the butter, using dark brown sugar but only 3/4 cup (I prefer these less sweet these days), increasing the vanilla to 1 1/2 teaspoons and the salt to 1/4 teaspoon fleur de sel or flaky sea salt, plus a few flakes crumbled on top. I use 1 cup chopped bittersweet chocolate and 1/2 cup chopped walnuts or pecans as the mix-ins. Hope this provides some inspiration!"
        ], 
        "date": "2006-11-25T19:37:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 sticks unsalted butter", 
            "1/2 cup packed brown sugar (preferably dark)", 
            "1 teaspoon pure vanilla extract", 
            "1 1/3 cups all-purpose flour", 
            "1/4 teaspoon salt (flaky salt would be great in these)", 
            "Demerara sugar (Sugar in the Raw) or sanding sugar for rolling (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/brown-butter-brown-sugar-shorties1.jpg?w=500", 
        "tags": [
            "Brown Butter", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/12/brown-butter-brown-sugar-shorties/", 
        "title": "brown butter brown sugar shorties", 
        "directions": [
            "Cut butter into four or five pieces and cook butter in a small heavy saucepan over medium heat, stirring frequently, until it has a nutty fragrance and flecks on bottom of pan turn a light brown, anywhere from 4 to 7 minutes. It helps to frequently scrape the solids off the bottom of the pan in the last couple minutes to ensure even browning. Transfer butter to a bowl and chill until just firm, about 1 hour.", 
            "Beat together butter and brown sugar with an electric mixer until pale and fluffy. Beat in vanilla, then mix in flour and salt at low speed until just combined. Transfer dough to a sheet of wax paper or parchment and form into a 12-inch log, 1 1/2 inches in diameter. Chill, wrapped in wax paper, until firm, about 1 hour.", 
            "Preheat oven to 350°F with rack in middle. Unwrap dough and roll it in coarse sugar, if using, and press the granules in with the paper you’d be using to wrap it. Slice dough into 1/4-inch-thick rounds, arranging 1 1/2 inches apart on an ungreased baking sheet. Bake until surface is dry and edges are slightly darker, 10 to 12 minutes. Let sit on sheet for a minute before transferring to a rack to cool. (Cookies will quite fragile at first, but will firm up as they cool.)", 
            "Dough keeps, chilled, up to 1 week, or in the freezer, up to one month. Cookies keep in an airtight container at room temperature 1 week.", 
            "Update 12/8/08: I am going to go ahead and put a yellow/yield light on this recipe. Although I have tested it twice, and had dreamy results both times, as have the majority of respondents, enough commenters are speaking of “spreading” or “falling apart” cookies that I want to warn you to approach this recipe more cautiously. "
        ], 
        "date": "2008-12-02T13:03:17+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/brussel-sprouts-and-chestnuts-in-brown-butter1.jpg?w=500", 
        "tags": [
            "Brown Butter", 
            "Brussels Sprouts", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/11/brussel-sprouts-and-chestnuts-in-brown-butter/", 
        "title": "brussels sprouts and chestnuts in brown butter", 
        "directions": [
            "1. Bring 4 cups salted water to a boil, add brussels sprouts and cook 10 minutes. Drain and refresh under cold water. Drain again. ", 
            "2. Meanwhile, melt butter in a 3-quart saucepan. Add shallots and cook over medium heat, stirring, until light brown. Pour contents of pan through a fine strainer into a dish, pressing to remove as much butter as possible from shallots. Place shallots on paper towel to drain. Return butter to saucepan. ", 
            "3. If serving immediately, preheat oven to 400 degrees. Place saucepan over medium heat and cook until butter has a nutty aroma and is turning brown. Whisk in flour and cook until mixture is light brown. Whisk in stock and cook until sauce has thickened. Add lemon juice, salt and pepper to taste, and nutmeg. Add chestnuts and brussels sprouts, folding ingredients together. ", 
            "4. Transfer to an 8-cup baking dish. Scatter shallots on top. Bake about 15 minutes. Serve."
        ], 
        "date": "2007-11-14T23:57:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium head cauliflower (1 1/2 to 2 pounds)", 
            "Oil for pan, if roasting", 
            "4 tablespoons salted or unsalted butter", 
            "1 medium or 2 tiny shallots, finely minced", 
            "1 small clove garlic, minced", 
            "Approximately 3/4 cup panko (Japanese-style) breadcrumbs", 
            "Salt and freshly ground black pepper", 
            "Few gratings of lemon zest", 
            "1 to 2 tablespoons fresh lemon juice", 
            "1 tablespoon chopped flat-leaf parsley or chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cauliflower-with-brown-butter-breadcrumbs1.jpg?w=640", 
        "tags": [
            "Brown Butter", 
            "Cauliflower", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/cauliflower-with-brown-butter-crumbs/", 
        "title": "cauliflower with brown butter crumbs", 
        "directions": [
            "To steam cauliflower: Set a steamer basket (see Notes) inside a large pot. Bring about one inch of water to a boil in the pot, lower cauliflower, whole or in large florets, into basket, and cover pot with lid. Reduce heat to medium. Let cauliflower steam for 10 to 20 minutes (less time if using a proper steamer basket, longer if using the modified basket below), or until it is easily pierced with a knife.   ", 
            "To roast cauliflower: Heat oven to 400 degrees. Lightly coat a large baking sheet with oil. Scatter cauliflower florets evenly over pan and roast until cauliflower is brown at edges and easily pierced with a knife, about 20 to 30 minutes. Toss and flip pieces once, halfway through roasting time, to ensure that they brown easily.", 
            "Make brown butter crumbs: When cauliflower is almost done, melt butter in a heavy frying pan over medium heat, and continue to cook it after it is melted until it is a little brown, and smells toasty. Working quickly, stir in the shallots, and let them hiss in the butter for about 30 seconds. Add the breadcrumbs, garlic, 1/4 teaspoon table salt (if using unsalted butter, skip if using salted) and a few grinds of black pepper and cook together, stirring frequently, until crumbs are a shade darker, anywhere from 5 to 10 minutes. Add a scrape or two of lemon zest and adjust seasonings to taste.", 
            "Assemble dish: Place whole cooked cauliflower or cauliflower florets in a low serving bowl. Toss gently with lemon juice, salt and pepper to taste. Spoon crumbs over cauliflower, pressing them onto the florets as you can, and letting the rest fall into the serving dish. Scatter herbs over top and serve with a large spoon.", 
            "Do ahead: Steam or roast cauliflower and make crumbs; keep them separate until serving. Just before serving, rewarm cauliflower and add crumbs.", 
            "Many notes:"
        ], 
        "date": "2013-11-20T12:06:40+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust:", 
            "7 tablespoons unsalted butter, melted", 
            "1/3 cup sugar", 
            "1/4 teaspoon vanilla extract", 
            "1 cup plus 1 tablespoon all purpose flour", 
            "Pinch of salt", 
            "Filling:", 
            "1/2 cup sugar", 
            "2 large eggs", 
            "Pinch of salt", 
            "1/4 cup all purpose flour", 
            "1 teaspoon vanilla extract", 
            "1/2 cup (1 stick) unsalted butter, diced", 
            "1 pound sweet cherries, which will yield 12 ounces of pitted cherries, which yielded some leftovers, perfect for snacking (alternately, you can use 12 ounces of the berry of your choice)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/3664441408_6dbba66669_b.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cherries", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/06/cherry-brown-butter-bars/", 
        "title": "cherry brown butter bars", 
        "directions": [
            "Make crust: Preheat over to 375°F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (It should look like this.) Congratulations! You’ve just faked a square tart pan.", 
            "Using rubber spatula or fork, mix melted butter, sugar, and vanilla in medium bowl, or if you’re Deb, in the bottom of the small saucepan you used to melt the butter. Add flour and salt and stir until incorporated. Transfer dough to your prepared pan, and use your fingertips to press the dough evenly across the bottom of the pan. Bake the crust until golden, about 18 minutes (it will puff slightly while baking). Transfer crust to rack and cool in pan. Maintain oven temperature.", 
            "Make the filling: Cook butter in heavy small saucepan (a lighter-colored one will make it easier to see the color changing, which happens quickly) over medium heat until deep nutty brown (do not burn), stirring often and watching carefully, about six minutes. Immediately pour browned butter into glass measuring cup to cool slightly.", 
            "Whisk sugar, eggs, and salt in medium bowl to blend. Add flour and vanilla and whisk until smooth. Gradually whisk browned butter into sugar-egg mixture; whisk until well blended.", 
            "Arrange pitted cherries, or the berries of your choice, in bottom of cooled crust. Carefully pour browned butter mixture evenly over the fruit. Bake bars until filling is puffed and golden and tester inserted into center comes out clean, about 40 minutes (though, of course, this took less time in my hyperactive oven so please watch your baking times carefully). Cool bars completely in pan on rack.", 
            "Use the parchment paper overhang to carefully remove cooled bars from pan and place them on a cutting board and cut them into squares with a very sharp knife. The cherries, if they fall over your slicing lines, will want to give you trouble but if you saw a sharp knife into them slowly before pressing down, they’ll cut neatly and with minimum carnage.", 
            "Do ahead: Can be made at least a day ahead, and stored at room temperature. Any longer, keep them cool in the fridge."
        ], 
        "date": "2009-06-29T13:07:57+00:00"
    }, 
    {
        "ingredient_list": [
            "Coating", 
            "2/3 cup granulated sugar", 
            "1 tablespoon ground cinnamon", 
            "6 tablespoons unsalted butter", 
            "Puffs", 
            "1 1/2 cups all-purpose flour", 
            "1 1/2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon table salt", 
            "1/4 teaspoon freshly grated nutmeg", 
            "1/2 cup granulated sugar", 
            "1/3 cup (5 tablespoons plus 1 teaspoon) unsalted butter, at room temperature, plus extra for greasing muffin cups", 
            "1 large egg", 
            "1 teaspoon pure vanilla extract", 
            "1/2 cup buttermilk "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/cinnamon-brown-butter-breakfast-puffs1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brown Butter", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/12/cinnamon-brown-butter-breakfast-puffs/", 
        "title": "cinnamon brown butter breakfast puffs", 
        "directions": [
            "Preheat oven to 350°F. Butter 12 standard size or 30 miniature muffin cups, or line cups with paper liners.", 
            "Prepare coatings: In a small saucepan, melt 6 tablespoons butter over medium heat and continue to cook it, stirring frequently, until brown bits form on the bottom and it smells nutty and heavenly. Immediately remove from heat and set aside. In a small bowl, combine 2/3 cup sugar and cinnamon. Set aside as well.", 
            "Prepare puffs: Whisk flour, baking powder, baking soda, salt and nutmeg together in a medium bowl and set aside. In the large bowl of an electric mixer, beat softened butter and sugar together until light and fluffy. Add egg and vanilla and beat until combined. Mix in 1/3 of flour mixture, followed by 1/2 of buttermilk, repeating again and finishing with the flour mixture. Mix only until combined. ", 
            "Spoon into prepared muffin cups, filling only 3/4 of the way. (I filled mine higher and they ended up spilling over a bit and doming less than they are capable of.) Bake standard sized muffins for 20 to 25 minutes and miniature muffins for 12 to 14 minutes. When finished, muffins will feel springy to the touch and a tester inserted into the center will come out clean. Transfer them in their pan to a wire rack. ", 
            "As soon as you feel you’re able to pick one up, take your first puff and roll the top and upper edges in the browned butter. Don’t be afraid to pick up the browned butter solids at the bottom of the saucepan; they’re the dreamiest part. Let any excess butter drip off for a second before gently rolling the butter-soaked cake top in cinnamon-sugar. I find if you roll too firmly, or have too much wet/not absorbed butter on top, the sugar can clump off, which is heartbreaking. Transfer puff to wire rack to set and repeat with remaining puffs. Eat warm.", 
            "For an even more indulgent, doughnut-like puff: Make an extra two tablespoons of the browned butter and roll the whole puff in it and the cinnamon sugar. (I usually have enough cinnamon sugar to fully roll the puffs.)", 
            "Do ahead: Puffs are best within hours after they are baked. They can be made it advance and stored in a freezer bag until needed, too. Simply spread them out on a baking tray and reheat them until warm in the oven."
        ], 
        "date": "2011-12-28T18:54:59+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "1 1/4 cups (295 ml) milk", 
            "1 teaspoon (5 ml) vanilla extract", 
            "2 1/2 cups (315 grams) all-purpose flour", 
            "1/4 teaspoon table salt (see Note)", 
            "2 teaspoons (10 grams) baking powder", 
            "1 to 2 teaspoons ground cinnamon (Bill calls for 2 but I preferred 1, so that it didn’t dominate)", 
            "1 cup (200 grams) granulated sugar", 
            "5 ounces (140 grams) sweetened flaked coconut (about 1 1/2 cups)", 
            "6 tablespoons (85 grams) unsalted butter, melted or melted and browned, if desired", 
            "Vegetable oil or nonstick cooking spray for baking pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/03/coconut-bread.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brown Butter", 
            "Brunch", 
            "Coconut", 
            "Everyday Cakes", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/03/coconut-bread/", 
        "title": "coconut bread", 
        "directions": [
            "Heat oven to 350 degrees. In a small bowl, whisk together eggs, milk and vanilla.", 
            "In a medium bowl, sift together flour, salt, baking powder and cinnamon. Add sugar and coconut, and stir to mix. Make a well in the center, and pour in egg mixture, then stir wet and dry ingredients together until just combined. Add butter, and stir until just smooth — be careful not to overmix.", 
            "Butter and flour a 9×5-inch loaf pan, or coat it with a nonstick spray. Spread batter in pan and bake until a toothpick inserted into the center comes out clean, anywhere from 1 to 1 1/4 hours. Cool in pan five minutes, before turning out onto a cooling rack. ", 
            "Serve in thick slices, toasted, with butter and confectioners’ sugar or salted honey brown butter spread."
        ], 
        "date": "2013-03-18T10:26:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (2 sticks or 225 grams) unsalted butter", 
            "2 tablespoons water", 
            "1/2 cup plus 2 tablespoons (125 grams) granulated sugar", 
            "3/4 cup (145 grams) packed light-brown sugar", 
            "1 large egg", 
            "1/2 teaspoon pure vanilla extract", 
            "1 1/4 cup plus 3 tablespoons (175 grams) all-purpose flour", 
            "1 teaspoon baking soda", 
            "Slightly heaped 1/2 teaspoon flaky sea salt or 1/4 teaspoon table salt", 
            "4 cups (240 grams) dried, unsweetened coconut chips (I used these)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/coconut-brown-butter-cookies1.jpg?w=640", 
        "tags": [
            "Brown Butter", 
            "Coconut", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/06/coconut-brown-butter-cookies/", 
        "title": "coconut brown butter cookies", 
        "directions": [
            "In a medium saucepan, melt butter over medium heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as it seems to take forever (more than 5 minutes) but then turns dark very quickly. Once it is a deeply fragrant, almost nut-brown color, remove from heat and pour butter and all browned bits at the bottom into a measuring cup. Adding 2 tablespoons water should bring the butter amount back up to 1 cup. Chill browned butter in the fridge until it solidifies, about 1 to 2 hours. You can hurry this along in the freezer, but check back and stir often so it doesn’t freeze unevenly solid.", 
            "Heat oven to 350 degrees. Line baking sheets with parchment paper or a nonstick baking mat.", 
            "Scrape chilled browned butter and any bits into a large mixing bowl. Add both sugars and beat the mixture together until fluffy. Add egg and beat until combined, scraping down bowl as needed, then vanilla. Whisk flour, baking soda and salt together in a separate bowl. Pour half of flour mixture into butter mixture and mix until combined, then add remaining flour and mix again, scraping down bowl if needed. Add coconut chips in two parts as well.", 
            "Scoop dough into 1, 2 or more (Rubin recommends a 2-inch wide scoop for bakery-sized cookies) balls and arrange a few with a lot of room for spreading on first baking sheet; use the back of a spoon or your fingers to flatten the dough slightly. Bake first tray of cookies; 1 tablespoon scoops will take 10 to 11 minutes; 2 tablespoon scoops, 12 to 14 minutes, the 2-inch scoop used at the bakery, 14 to 16 minutes; take the cookies out when they’re deeply golden all over. If cookies have not spread as much as you see above, stir 2 teaspoons more water into cookie dough, mixing thoroughly, before baking off another tray. (See note below for full explanation.) This should do the trick, but if it does not, repeat the same with your next batch. Once you’ve confirmed that you have the water level correct, bake remaining cookies.", 
            "Cool cookies on baking sheet for 1 to 2 minutes before transferring to a cooling rack. Cookies keep for up to one week at room temperature. Extra dough can be stored in the fridge for several days or in the freezer for a month or more.", 
            "About the water: Browned butter is one of my favorite things to eat in cookies like things and least favorite things to write cookie recipes for, because when you brown the butter, water volume is lost, but not all types of butter contain the same amount of water. I find that for most standard American grocery store butters (I was using Trader Joe’s store brand here, but the equivalent would be any non-European style butter), 1 tablespoon of water per stick (1/2 cup) of butter is a sufficient replacement. However, should you find that your first batch of cookies is too thick, a little extra water is all you’ll need to get the texture right. It sounds scary, but I promise is as simple as can be. Holler at me in the comments if this doesn’t work for you and please note the kind of butter and how much water you used. "
        ], 
        "date": "2014-06-05T12:17:43+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "3/4 pound (12 ounces, 340 grams or about 2 1/4 cups) dried dates", 
            "2 1/4 cups (530 ml) boiling water", 
            "1 1/2 teaspoons baking soda", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "3/4 cup (150 grams) granulated sugar", 
            "2 tablespoons (25 grams) light or dark brown sugar", 
            "2 large eggs", 
            "1/4 teaspoon fine sea or table salt", 
            "1 2/3 cups (210 grams) all-purpose flour", 
            "Sauce", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "1 cup (235 ml) heavy or whipping cream", 
            "1 cup plus 2 tablespoons (215 grams) brown sugar (light is called for, but I’d like to use dark next time)", 
            "2 teaspoons vanilla extract", 
            "To serve", 
            "Unsweetened whipped cream (optional, but please don’t skip it)", 
            "A few flakes of sea salt", 
            "Fresh mint leaves (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/date-cake-with-toffee-sauce-31.jpg?w=640", 
        "tags": [
            "Cake", 
            "Christmas", 
            "Dates", 
            "English", 
            "Everyday Cakes", 
            "Photo", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/11/date-cake-with-toffee-sauce/", 
        "title": "sticky toffee pudding", 
        "directions": [
            "Make the cake: Pit and roughly chop dates and place them in a heatproof bowl. Pour boiling water over them and stir in the baking soda. Cover the bowl and set it aside for 30 minutes.", 
            "Meanwhile, heat oven to 350°F (175°C). Butter a 9×13-inch baking pan. As an extra precaution, if you’re nervous about sticking (although this cake should not), you can line the bottom with a fitted rectangle of parchment paper.", 
            "Blend date-water mixture in a blender or food processor until smooth. In a large bowl, combine the melted butter and sugars. Whisk in eggs, then salt. Stir in the flour, then date puree. Pour the batter into the prepared pan and bake for 25 to 30 minutes, until a toothpick inserted into the center comes out clean. ", 
            "To serve it rustic-style, as we did, let it cool in the pan on a cooling rack. If you’d like to transfer it later to a serving plate, let cool in the pan for 20 minutes, then flip it out onto a cooling rack, removing the parchment paper if you used it.", 
            "Make the sauce: Combine butter, cream, sugar and vanilla in a larger saucepan than you think you’ll need (I vote for 2 1/2 to 3 quarts) over medium heat and bring to a simmer. Whisk for about 10 minutes, until the mixture thickens slightly. ", 
            "To serve: Cut the cake into squares (still warm is just fine). Drizzle each slice with toffee sauce, a pinch of sea salt, and top with a dollop of whipped cream, if desired. If your mint plant has survived the fall better than mine has, a leaf or two would be lovely here, too."
        ], 
        "date": "2014-11-06T12:06:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour", 
            "3/4 teaspoon ground cinnamon", 
            "1 tablespoon ground ginger", 
            "1/8 teaspoon ground cloves", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1 1/2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/4 teaspoon fine sea or table salt", 
            "1/2 cup buttermilk, yogurt thinned with a little milk, fresh apple cider or even stout beer", 
            "1/2 cup molasses", 
            "1/2 cup dark brown sugar, packed", 
            "1/4 cup granulated sugar", 
            "1 large egg", 
            "3 tablespoons butter, melted, plus extra for brushing waffle iron", 
            "Powdered sugar for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/deep-dark-gingerbread-waffles11.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Christmas", 
            "Photo", 
            "Waffles", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/deep-dark-gingerbread-waffles/", 
        "title": "deep dark gingerbread waffles", 
        "directions": [
            "In a large bowl, whisk together the flour, cinnamon, ginger, cloves, nutmeg, baking powder, baking soda and salt. In a medium bowl, whisk together the buttermilk, molasses, sugars, egg and butter until combined. The butter will likely firm up and make little white splotches throughout; this is a-okay. Pour the wet into the dry ingredients and stir until just combined. ", 
            "Heat waffle iron to a middle heat. Either brush waffle iron with melted butter or spray it lightly with a nonstick cooking spray. Ladle gingerbread batter into waffle iron until they’re about 3/4 filled out. Cook according to manufacturer’s directions. In my waffle iron, I like to cook them 1 to 2 minutes more.", 
            "To remove waffles: Open waffle iron. Wait about 30 seconds, giving them a chance to steam off a little. With tongs in one hand and a small spatula in the other, gently, carefully lift corners of each waffle section enough to slide the spatula underneath, then lift and slide some more until you can get the section out. Curse Deb, because these waffles are very sticky and eager to tear. Trust Deb, that they will be worth it. Spread them on a tray in a single layer to let cool slightly; within 1 minute, they should be crisp to the touch and easier to lift. Repeat with remaining batter. Try not to stack waffles — even though they’re firm, they will stick.", 
            "Serve immediately, dusted with powdered sugar and, if you’re feeling fancy, a dollop of barely or unsweetened whipped cream or crème fraîche."
        ], 
        "date": "2014-12-18T11:54:57+00:00"
    }, 
    {
        "ingredient_list": [
            "Pecan florentines", 
            "1/4 cup plus 2 tablespoons (6 tablespoons or 45 grams) all-purpose flour", 
            "1/2 cup (about 55 grams) pecan halves", 
            "1/4 teaspoon ground cinnamon (I halved this, found it to be just-enough)", 
            "1/8 teaspoon kosher salt (I recommend doubling this)", 
            "1/2 cup (115 grams) unsalted butter, cold is fine", 
            "2/3 cup (65, oops, sorry, it is 130 grams) granulated sugar (I would drop this by a tablespoon or two next time)", 
            "2 tablespoons heavy cream", 
            "1 tablespoon corn syrup, honey, or golden syrup", 
            "1/4 teaspoon vanilla extract", 
            "Eggnog filling", 
            "4 large eggs, hard-boiled", 
            "4 tablespoons (55 grams) unsalted butter, at room temperature", 
            "2 1/2 cups (300 grams) confectioners’ sugar", 
            "1 tablespoon whole milk", 
            "1/2 teaspoon vanilla extract", 
            "3/4 teaspoon freshly grated nutmeg (I halved this because I’m a spice wimp)", 
            "1/4 teaspoon ground cloves (I halved this too)", 
            "1/8 teaspoon kosher salt", 
            "2 tablespoons dark rum (can be skipped or reduced)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/eggnog-florentines1.jpg?w=640", 
        "tags": [
            "Christmas", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/12/eggnog-florentines/", 
        "title": "eggnog florentines", 
        "directions": [
            "Make the florentines: Heat oven to 350°F. In a food processor, combine the flour, pecans, cinnamon and salt and pulse until the nuts are very finely chopped, about 1 minute. Turn the nut mixture out into a large bowl. ", 
            "In a small-medium saucepan set over high heat, combine the butter, sugar, heavy cream and syrup and bring it to a boil. Boil the mixture for one full minute, then turn off the heat and add the vanilla. Pour this caramel mixture over the nut mixture and stir to combine them. Set aside for at least 30 minutes, until it has cooled. Mixture will firm up and seem worrisome, but you should not be worried.", 
            "Line baking sheets with parchment paper. Using a 1/2 or 1 teaspoon measure (the original recipe recommends a 1/2 teaspoon measure to scoop the cookies but I misread this and used a full teaspoon scoop — mine became 2 1/2 inches in diameter on average, which felt like a good size), scoop the dough into small balls and place them 3 inches apart on prepared baking sheets. Bake until the cookies are thin and golden brown, 7 to 9 minutes. They will not crisp until they are cool, so don’t worry if they’re soft.", 
            "Let cool on baking sheets for 5 or so minutes (so they’ll set up a little) before using a thin metal spatula to carefully transfer the cookies to paper towels to blot excess oil for a couple minutes. After they’ve been blotted, transfer cookies to a cooling rack, though they should be pretty cool by now. If any butter is left puddled on the parchment, wipe that off too before repeating the process with the remaining cookie dough.", 
            "Make the eggnog filling: Peel the eggs and separate the yolks from the whites. Save the whites for another use. Press the egg yolks through a fine-mesh strainer so that they become mashed and powdery. Place in a large bowl with butter, confectioners’ sugar, milk, vanilla, nutmeg, cloves and salt. Beat together until smooth, then raise mixer speed and beat until mixture is thick and frosting-like, about three minutes. Stir in the rum by hand, if using.", 
            "Spread a dollop of eggnog filling on one cookie, then gently press a second one on top of it. Repeat with remaining cookies and filling. Place them in the fridge for 10 minutes before serving, to firm up the filling.", 
            "Do ahead: The dough and the icing can be refrigerated in an airtight container or up to 3 days before baking. The baked, unfilled florentines can be stored in a loosely covered container at room temperature for up to two (though I had them longer) before filling them. Humidity is their enemy, makes them stick together. The original recipe says that once filled, the florentines need to be eaten immediately but our held up crisp in the fridge in a loosely covered container (not airtight) for a couple days. "
        ], 
        "date": "2013-12-11T12:30:07+00:00"
    }, 
    {
        "ingredient_list": [
            "Winter Warmth Syrup", 
            "1 1/2 cups water", 
            "1 cup raw, demerara or turbinado sugar (granulated will do just fine if you do not have them)", 
            "1/2 apple, peeled, cored, and diced", 
            "1/2 pear, peeled, cored, and diced", 
            "12 walnut halves", 
            "3 cinnamon sticks, broken up", 
            "6 whole cloves", 
            "1 whole nutmeg", 
            "For Each Cocktail", 
            "1 piece of orange peel (about 1 by 2 inches)", 
            "3/4 ounce Winter Warmth Syrup (recipe above)", 
            "2 dashes of bitters (Fee Brothers black walnut bitters are recommended, I used orange bitters)", 
            "2 ounces bourbon, rye or Canadian whisky"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/the-fairytale-of-new-york1.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Christmas", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/fairytale-of-new-york/", 
        "title": "fairytale of new york", 
        "directions": [
            "Make the winter warmth syrup: Combine all ingredients in a saucepan over medium heat. Bring to a simmer, stirring until the sugar dissolves, and simmer for 15 to 20 minutes. Remove from the heat and cool. Strain into a clean glass bottle, cover and refrigerate for up to 2 weeks. Makes about 2 cups.", 
            "Make a drink: Place the orange peel, syrup and bitters in a low glass and muddle. Pour in whiskey, add a large ice cube and don’t forget to share. ", 
            "Make a carafe: We brought 2 4-cup carafes of this to a party, using all of the syrup and about 5 1/2 cups bourbon. We tossed a few orange peels into each jar. Don’t forget to remind friends to pour it over ice (we forgot), so they are not asleep before, you know, Santa comes down the chimney."
        ], 
        "date": "2014-12-23T11:56:26+00:00"
    }, 
    {
        "ingredient_list": [
            "Sugared Cranberries", 
            "1 cup (200 grams) plus 1/3 cup (65 grams) granulated sugar", 
            "1 cup water", 
            "1 cup (100 grams) fresh cranberries ", 
            "Cake layers", 
            "1 cup (235 ml) oatmeal stout or Guinness Stout", 
            "1 cup (235 ml) dark molasses (ideally, not blackstrap)", 
            "1/2 teaspoon baking soda", 
            "3 large eggs", 
            "1 cup (190 grams) packed dark brown sugar", 
            "1 cup (200 grams) granulated sugar", 
            "3/4 cup (150 grams) vegetable or another neutral oil", 
            "2 cups (260 grams) all-purpose flour", 
            "1 1/2 teaspoons baking powder", 
            "2 tablespoons ground ginger", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon ground cloves", 
            "1/4 teaspoon freshly grated nutmeg", 
            "1/2 teaspoon kosher salt", 
            "Pinch of ground cardamom", 
            "Filling", 
            "2 cups (475 ml) heavy or whipping cream", 
            "6 tablespoons (45 grams) powdered sugar", 
            "1/2 cup (115 grams) mascarpone"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/gingerbread-layer-cake1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Christmas", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/12/gingerbread-layer-cake/", 
        "title": "gingerbread layer cake", 
        "directions": [
            "Make sugared cranberries: Bring 1 cup granulated sugar and 1 cup water to a gentle simmer (not a full boil) on the stove, stirring until sugar has dissolved. Remove from heat and add cranberries. Pour mixture into a bowl and let syrupy cranberries chill in fridge overnight, or at least 8 hours. The next morning, drain cranberries (you can reserve syrup for soda or sweetening cocktails). Place remaining 1/3 cup sugar in a bowl and roll cranberries in it. Arrange them on a tray or plate and refrigerate for another 45 minutes to an hour, so that the sugar sets. (They’ll feel mostly dry to the touch.) ", 
            "Make the cake layers: Heat oven to 350°F. Butter and flour, or use a nonstick spray to coat three 9-inch round cake pans (see note above re: if you have fewer) and line the bottom of each with a fitted round of parchment paper.", 
            "Bring stout and molasses to a boil in a large saucepan and remove from heat; whisk in baking soda carefully — it will foam up. Cool to room temperature. ", 
            "In a large bowl, whisk together sugars and oil. Whisk in eggs, then whisk in cooled stout-molasses mixture. Place dry ingredients in a fine-mesh sieve or sifter and shake over bowl. Stir until just combined. ", 
            "Divide batter into prepared cake pans; you’ll have about (updated!) a scant (bit less than) 2 cups or 515 grams of batter in each. Bake for 18 to 22 minutes, until a toothpick inserted into the center of the cake comes out batter-free. Cool in pan on rack for 5 minutes, then flip out onto cooling rack, carefully remove parchment paper (it’s sticky) and flip back right side-up, letting each layer cool completely. You can hasten this along outside (if it’s cold) or in the freezer. ", 
            "Make whipped mascarpone cream: Beat heavy cream and powdered sugar in a large bowl with a whisk or electric beaters until soft peaks form. Beat in mascarpone, one spoonful at a time, just until it disappears into the cream. ", 
            "Assemble cake: Place first cake layer on cake stand and level top with a serrated knife if it has domed. Spread with 1 cup whipped mascarpone. Repeat twice, then smooth sides. Decorate with sugared cranberries. Serve immediately, or keep refrigerated until needed."
        ], 
        "date": "2015-12-22T12:11:36+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, cut into chunks, plus more for pan", 
            "1 cup water", 
            "1 1/2 teaspoons baking soda", 
            "2/3 cup packed dark-brown sugar", 
            "1 cup unsulfured molasses", 
            "1 tablespoon freshly grated ginger (optional)", 
            "2 large eggs, room temperature, lightly beaten", 
            "2 1/2 cups all-purpose flour, plus more for pan", 
            "2 teaspoons ground ginger", 
            "1 1/2 teaspoons ground cinnamon", 
            "1/2 teaspoon ground cloves", 
            "1/2 teaspoon ground or freshly grated nutmeg", 
            "1/2 teaspoon salt", 
            "2 teaspoons baking powder", 
            "Confectioners’ sugar, for dusting finished cake", 
            "Lightly sweetened whipped cream, essential for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/gingerbread-snacking-cake1.jpg?w=640", 
        "tags": [
            "Christmas", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/12/gingerbread-snacking-cake/", 
        "title": "gingerbread snacking cake", 
        "directions": [
            "Heat oven to 350 degrees. Line a 9×13-inch baking pan with parchment paper. Butter and flour parchment and sides of cake pan, or spray both with a nonstick baking spray.", 
            "Bring water to a boil in a medium saucepan (or large one, if you’d like to make the cake entirely in there) and add baking soda — it will foam up! this is fun! Let stand for 5 minutes, then stir in butter until melted. Whisk in dark brown sugar, molasses and fresh ginger, if using. Mixture is usually just lukewarm by now, but if it still feels quite hot to the touch, set it aside to 10 to 15 minutes to cool further before using.", 
            "Place flour, ground ginger, cinnamon, cloves, nutmeg, salt and baking powder in a fine-mesh strainer or sifter so that you can sift them over the wet ones in a minute. ", 
            "Transfer molasses mixture to a large mixing bowl if your saucepan isn’t large enough to make the batter in. Whisk in eggs until just combined. Sift dry ingredients over wet, then stir the wet and dry ingredients together until just combined.", 
            "Pour batter into prepared pan; bake for 30 to 35 minutes, until a toothpick inserted into the center of the cake comes out clean. Transfer cake to a wire rack and let cool completely. Once fully cool, cut around cake to make sure no parts are sticking to the side and invert cake out onto a rack, then onto a serving plate. Dust with confectioners’ sugar and cut into squares. Please, promise you’ll serve this with lightly sweetened, softly whipped cream. They’re made for each other.", 
            "Do ahead: Whipped cream needs to be stored in the fridge, of course. Cake keeps at room temperature for up to a week in an airtight container. It gets better with age, just like you, babe. "
        ], 
        "date": "2013-12-23T12:27:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup oatmeal stout or Guinness Stout", 
            "1 cup dark molasses (not blackstrap)", 
            "1/2 teaspoon baking soda", 
            "2 cups all-purpose flour", 
            "1 1/2 teaspoons baking powder", 
            "2 tablespoons ground ginger", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon ground cloves", 
            "1/4 teaspoon freshly grated nutmeg", 
            "Pinch of ground cardamom", 
            "3 large eggs", 
            "1 cup packed dark brown sugar", 
            "1 cup granulated sugar", 
            "3/4 cup vegetable oil", 
            "Confectioners sugar for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/gramercy-taverns-gingerbread1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Christmas", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/12/gramercy-taverns-gingerbread/", 
        "title": "gramercy tavern’s gingerbread", 
        "directions": [
            "Accompaniment: Unsweetened whipped cream", 
            "Preheat oven to 350°F. Generously butter bundt pan and dust with flour, knocking out excess. (She is not kidding about this. I used a nonstick pan with a butter/flour spray and still lost a chunk of cake. I will be more generous next time.)", 
            "Bring stout and molasses to a boil in a large saucepan and remove from heat. Whisk in baking soda, then cool to room temperature.", 
            "Sift together flour, baking powder, and spices in a large bowl. Whisk together eggs and sugars. Whisk in oil, then molasses mixture. Add to flour mixture and whisk until just combined.", 
            "Pour batter into bundt pan and rap pan sharply on counter to eliminate air bubbles. Bake in middle of oven until a tester comes out with just a few moist crumbs adhering, about 50 minutes. Cool cake in pan on a rack 5 minutes. Turn out onto rack and cool completely.", 
            "Serve cake, dusted with confectioners sugar, with whipped cream.", 
            "Do ahead: This gingerbread is better if made a day ahead. It will keep 3 days, covered, at room temperature. I am sure it will keep well-wrapped in the freezer even longer."
        ], 
        "date": "2008-12-25T13:37:45+00:00"
    }, 
    {
        "ingredient_list": [
            "5 ounces (about one heaping cup) hazelnuts, blanched to remove dark skins*", 
            "1/2 pound unsalted butter (plus 1 tablespoon melted extra for greasing the pan)", 
            "1/2 vanilla bean", 
            "1 1/3 cups powdered sugar, plus extra for dusting the cake", 
            "1/3 cup all-purpose flour", 
            "5 extra-large egg whites (I used 6 since I was using ", 
            "large eggs)", 
            "3 tablespoons granulated sugar", 
            "4 ounces semisweet chocolate chips or finely-chopped chocolate", 
            "1/4 cup heavy cream", 
            "1/2 teaspoon instant coffee granules"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/03/hazelnut-brown-butter-cake.jpg?w=750", 
        "tags": [
            "Brown Butter", 
            "Cake", 
            "Celebration Cakes", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/03/hazelnut-brown-butter-cake/", 
        "title": "hazelnut brown butter cake", 
        "directions": [
            "Melt the chocolate, heavy cream, and coffee in the top of a double boiler over simmering water until smooth and warm, stirring occasionally. Drizzle over the top of the cake. (I usually use the boil cream and then stir in chips until they melt method, but found that this time it ended up too thick and hard to drizzle. Feel free to try either, though!)", 
            "Updated to add: Eggbeater’s Shuna has made this cake before, and has terrifically detailed instructions and step-by-step pictures for those of you who need more than gushing to guide you through a recipe! Check it out. "
        ], 
        "date": "2008-03-10T17:13:33+00:00"
    }, 
    {
        "ingredient_list": [
            "Base and lattice", 
            "4 1/2 cups (1 pound or 455 grams) shelled walnuts", 
            "3 cups (375 grams) all-purpose flour", 
            "2 teaspoons ground cinnamon", 
            "1/2 teaspoon ground cloves (I halved this, using only 1/4 teaspoon)", 
            "1/4 to 1/2 teaspoon table salt (Heatter says 1/4, I really prefer this with 1/2)", 
            "2 1/2 sticks (10 ounces or 285 grams) cold, unsalted butter, cut into chunks", 
            "1 2/3 cup (330 grams) granulated sugar", 
            "1 egg plus 1 egg yolk", 
            "Finely grated zest of 1 lemon", 
            "Filling", 
            "1/4 cup (about 20 to 25 grams) fine, dry breadcrumbs", 
            "2 cups (about 575 grams) seedless raspberry jam", 
            "To finish", 
            "1 egg yolk", 
            "1 teaspoon water", 
            "2/3 to 1 cup (75 to 115 grams) to slivered almonds (julienne-shaped pieces) (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/linzer-torte1.jpg?w=640", 
        "tags": [
            "Austrian", 
            "Christmas", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/12/linzer-torte/", 
        "title": "linzer torte", 
        "directions": [
            "Make base: Heat oven to 400 degrees. Butter two 9-inch round layer cake pans (preferably with removable bottoms if you plan to serve this in wedges, like a cake), two 8-inch square pans (what I used, then cut each into square bars, like cookies), one 9×13-inch rectangular pan (again, for bar cookies) or one 11- to 12-inch round cake pan (again ideally with a removable bottom). Line the bottom of each with a piece of parchment paper cut to fit, then butter then paper. ", 
            "In a food processor, process walnuts and 1/2 cup of the flour (reserve remaining 2 1/2 cups for next step) for 15 seconds, or until the nuts are finely ground but have not formed a paste. ", 
            "Place remaining 2 1/2 cups flour, cinnamon, cloves and salt in a large, wide-ish mixing bowl. With a pastry blender, work the butter into the dry mixture until it forms coarse crumbs. Stir in the sugar and walnut-flour mixture. In a small dish, beat the whole egg, yolk, and lemon rind utnil combined, and stir into crumb mixture. Stir the mixture in as best as you can with a spoon, then work the rest in with your hands. Knead the dough a few times inside the bowl until a cohesive mass, one that holds together, forms. ", 
            "Divide dough into quarters if making two tortes, or halves if making one.", 
            "Place one portion into the bottom of each pan, and press evenly and firmly over the bottoms and then about 1 1/4 to 1 1/2 inches up the sides with your fingers. Don’t worry about making it smooth or level on the sides; it gets filled in later.", 
            "Bake shell(s) for 15 minutes, or until it barely begins to color at the edges.", 
            "While the shell(s) bakes, roll remaining piece(s) of dough between two pieces of waxed paper, until 1/4- to 3/8-inch in thickness one inch bigger than your pan size. [I.e., for each 9-inch round torte, you’ll want a 10-inch diameter circle; for each 8-inch square torte, a 9-inch square, etc.] Transfer to freezer until the dough is well-chilled, about 20 minutes.", 
            "Remove shell(s) from oven and let cool slightly; reduce baking temperature to 350 degrees. ", 
            "Make filling: If you’re using panko or another coarse dry breadcrumb, you can pulse it in a food processor until it is fine powder. I found I needed almost double the volume in panko (7 tablespoons) to yield 1/4 cup of a fine breadcrumb powder.", 
            "Sprinkle 2 tablespoons finely ground breadcrumbs over each par-baked shell, or all 1/4 cup over your single large one. If jam is not already soft, stir it until it is, then spread 1 cup over each shell. Cut dough(s) into 1/2- to 3/4-inch wide strips, cutting through the bottom of the waxed paper at the same time. Lift each strip-and-waxed paper over the jam and reverse it onto the jam, then peel off waxed paper. Cut the ends of the dough by pressing them onto the sides of the pan. Arrange strips 1/2- to 3/4-inch apart, crisscrossing them on an angle to make a lattice top with diamond-shaped openings. [Note: I neither “wove” my lattice or ended up making “diamond-shaped” openings. Oops.] Use leftover pieces to fill in any gaps between lattice-strips and tall sides of shells. The two doughs will blend together in the oven. ", 
            "To finish: Mix egg yolks and water. Brush it all over lattice top and border. Sprinkle with almonds, if using. (I prefer to use 1/3 cup per smaller torte, instead of the 1/2 cup Heatter recommends. I only sprinkled them on one.) Bake torte(s) for 45 to 60 minutes (Heatter recommends 60, I find it perfect, but ovens and baking pans vary, check yours sooner if you’re nervous), until crust and almonds on top are well-browned. ", 
            "Remove from oven and place on racks. If you’ve baked it in a cake pan and wish to serve it as a “cake,” i.e. in wedges, Heatter recommends that you remove it from the pan while still warm by cutting around the torte carefully (the crust is very fragile) with a small, sharp knife and loosening the torte in the pan, before reversing it onto a cooling rack, and then back again onto another rack to finish cooling. If using a pan with a removable base, you should safely be able to remove it once it has fully cooled. Personally, I had no trouble letting my cool fully in the square pan but the first square did not come out cleanly. ", 
            "Once fully cool, Heatter recommends you let the tortes stand overnight (covered with foil) before serving for best flavor. You can decorate the tortes with powdered sugar before serving in wedges or squares. "
        ], 
        "date": "2013-12-13T12:34:39+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (6 ounces or 170 grams) unsalted butter, plus additional for greasing pan", 
            "1 1/2 cups (6 3/4 ounces or 190 grams) all purpose flour", 
            "2 teaspoons (9 grams) baking powder", 
            "3/4 teaspoon (4 grams) salt", 
            "Pinch of allspice", 
            "1 cup (7 ounces or 200 grams) sugar", 
            "2 large eggs", 
            "2/3 cup whole milk or buttermilk", 
            "1 1/2 pounds nectarines, halved, pitted and cut into 1/2-inch thick wedges (about 4 cups)", 
            "1 tablespoon lemon juice", 
            "Streusel", 
            "Reserved butter from cake (above)", 
            "1/2 cup (3 1/2 ounces or 100 grams) sugar", 
            "1/2 cup (2 1/4 ounces or 64 grams) all purpose flour", 
            "1/4 teaspoon cinnamon", 
            "Pinch of salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/4833941545_0c7c5409a1_o-1.jpg?w=751", 
        "tags": [
            "Brown Butter", 
            "Cake", 
            "Cookbooks", 
            "Everyday Cakes", 
            "Nectarine", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/07/nectarine-brown-butter-buckle/", 
        "title": "nectarine brown butter buckle", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns. Set aside and let cool (the fridge will hasten this along).", 
            "Prepare you pan: Preheat oven to 350°F. Line the bottom of a 10-inch round cake pan, springform or cast iron skillet with parchment paper and butter the paper and rest of the pan generously; set aside.", 
            "Make the cake: Whisk flour, baking powder, salt and allspice in medium bowl to blend. In a large bowl, whisk together 1/2 cup cooled browned butter (set aside remaining 1/4 cup for topping), sugar and then eggs, one at  a time. Stir in milk or buttermilk. Stir dry ingredients into this wet mixture; mix until just combined and spread batter in prepared pan. Toss nectarine wedges with lemon juice and arrange them in a single layer on top of the batter.", 
            "Make the streusel and bake the cake: Stir remaining brown butter, sugar, flour, cinnamon and salt together until large crumbs form. Sprinkle the nectarine-topped batter with crumbs. Bake until top is golden brown and tester inserted into center comes out with moist crumbs, about 40 to 45 minutes. Let cool in pan for 5 minutes before flipping out onto a cooling rack."
        ], 
        "date": "2010-07-28T10:13:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (7 ounces or 200 grams) white sugar", 
            "1 teaspoon (5 grams) baking powder", 
            "2 3/4 cups plus 2 tablespoons (12 5/8 ounces or 359 grams) cups all-purpose flour (or you can measure 3 cups and remove 2 tablespoons flour)", 
            "1/4 teaspoon cinnamon", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1/4 teaspoon (2 grams) salt", 
            "1 cup (2 sticks or 8 ounces or 227 grams) cold unsalted butter", 
            "1 large egg", 
            "2 peaches, pitted and thinly sliced (between 1/8 and 1/4-inch thick)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/09/4950027940_b3512efca3_o.jpg?w=749", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cookie", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/09/peach-shortbread/", 
        "title": "peach shortbread", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns and the very second that you turn around to do something else. Set it in the freezer until solid (about 30 minutes).", 
            "[Don’t have time for all this brown butter madness? Check the head notes to use regular softened butter instead.]", 
            "Preheat the oven to 375°F (190°C). Butter a 9×13 inch pan, or spray it with a nonstick spray. In a medium bowl, stir together sugar, baking powder, flour, salt and spices with a whisk.  Use a pastry blender, fork or your fingertips, blend the solidified brown butter and egg into the flour mixture. It will be crumbly. Pat 3/4 of the crumbs into the bottom of the prepared pan, pressing firmly. Tile peach slices over crumb base in a single layer. Scatter remaining crumbs evenly over peaches and bake in preheated oven for 30 minutes, until top is slightly brown and you can see a little color around the edges. Cool completely in pan before cutting into squares.", 
            "Keeping: I’ve kept mine in the fridge and they’ve held up great there since Monday. I imagine that these would freeze well, between layers of waxed paper, with the container sealed well in plastic wr"
        ], 
        "date": "2010-09-02T15:58:05+00:00"
    }, 
    {
        "ingredient_list": [
            "For topping ", 
            "1 1/2 cups all-purpose flour", 
            "1 cup whole almonds with skin", 
            "1/4 cup packed light brown sugar", 
            "1/4 teaspoon salt", 
            "3/4 stick unsalted butter, melted and cooled", 
            "For filling ", 
            "1 vanilla bean, split lengthwise", 
            "1/2 stick unsalted butter", 
            "1/4 cup packed light brown sugar", 
            "2 tablespoons granulated sugar", 
            "1 tablespoon all-purpose flour", 
            "3 lb firm-ripe Anjou or Bartlett pears (about 6), peeled and coarsely chopped", 
            "2 tablespoons pear brandy or eau-de-vie"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pear-crisps-with-vanilla-brown-butter1.jpg?w=500", 
        "tags": [
            "Brown Butter", 
            "Crumbles/Crisps", 
            "Fall", 
            "Fruit", 
            "Pear", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/pear-crisps-with-vanilla-brown-butter/", 
        "title": "pear crisps with vanilla brown butter", 
        "directions": [
            "Equipment: 6 (8-ounce) gratin dishes or shallow ramekins", 
            "Make topping: Pulse together flour, almonds, brown sugar, and salt in a food processor until nuts are finely chopped. Add butter and pulse just until blended. Coarsely crumble in a shallow baking pan and chill at least 1 hour. ", 
            "Make filling and bake crisps: Preheat oven to 425°F with rack in middle.", 
            "Scrape seeds from vanilla bean into a small heavy saucepan, then add pod and butter and cook over medium-low heat, swirling pan occasionally, until butter is browned and fragrant, about 4 minutes. ", 
            "While butter browns, stir together sugars, flour, and a pinch of salt in a large bowl. Add pears and brandy and toss to combine.", 
            "Discard vanilla pod, then toss butter with pear mixture. Spoon filling into gratin dishes and sprinkle with topping, mounding it slightly in centers. Put in a shallow baking pan and bake 30 minutes, then rotate baking sheet and bake until topping is golden brown and filling is bubbling, 10 to 15 minutes more. Cool to warm or room temperature on a rack. ", 
            "Do ahead: The topping can made in advance, chilled and covered for up to two days. The crisps can be assembled (but not baked) 1 day ahead and chilled, covered. Bring them room temperature before baking. "
        ], 
        "date": "2007-12-06T17:45:55+00:00"
    }, 
    {
        "ingredient_list": [
            "9 tablespoons (4.5 ounces) unsalted butter, plus extra for pans", 
            "1/2 cup pecans, toasted (350°F for 10 to 13 minutes, or until browned) and cooled", 
            "1 cup confectioners’ sugar", 
            "2 tablespoons granulated sugar, plus extra for berries (optional)", 
            "3 tablespoons all-purpose flour", 
            "1 teaspoon baking powder", 
            "7 tablespoons white or yellow cornmeal", 
            "1/4 teaspoon kosher salt", 
            "4 egg whites", 
            "1 teaspoon vanilla extract", 
            "Berries, for serving", 
            "Ice cream or whipped cream, for serving."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pecan-cornmeal-butter-cake1.jpg?w=500", 
        "tags": [
            "Brown Butter", 
            "Cake", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/05/pecan-cornmeal-butter-cake/", 
        "title": "pecan cornmeal butter cake", 
        "directions": [
            "In a small pan, cook the butter until it browns and smells nutty (about 6 to 8 minutes). It helps to frequently scrape the solids off the bottom of the pan in the last couple minutes to ensure even browning. Strain and set aside to cool.", 
            "In a food processor, pulse pecans, confectioners’ and granulated sugar until powdery. Whisk together flour, baking powder, cornmeal and salt in a large bowl and add pecan-sugar mixture to this.", 
            "In a small bowl, whisk the egg whites and vanilla together, just to combine. Whisk this and the browned butter into the dry ingredients. Refrigerate batter at least three hours or overnight.", 
            "Heat oven to 325 degrees. Thickly butter the sides of a 9-inch round fluted tart pan, or 9-inch springform. Line the bottom with a circle of parchment paper. Please. My gut told me to do this and I ignored it, following the recipe, and the cake stuck terribly. ", 
            "Bake until golden and a tester comes out clean, about 25 minutes. Cool 10 to 15 minutes in pan, then turn out on a rack. Serve topped with berries (which you can macerate with a little sugar for a few minutes) and softly whipped cream."
        ], 
        "date": "2010-05-07T15:54:24+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust:", 
            "1 1/4 cups (155 grams) all-purpose flour", 
            "1 1/2 teaspoons (6 grams) granulated sugar", 
            "1/2 teaspoon (3 grams) fine sea or table salt", 
            "1 stick (4 ounces or 115 grams) cold unsalted butter, cut into chunks", 
            "1/4 cup (60 ml) very cold water, plus an additional tablespoon if needed", 
            "Filling", 
            "6 tablespoons unsalted butter", 
            "1 cup packed dark brown sugar", 
            "3/4 cup golden syrup (see Note up top)", 
            "A pinch or two of sea salt", 
            "2 cups (225 grams) pecan halves", 
            "1 teaspoon apple cider vinegar", 
            "1 tablespoon bourbon (optional)", 
            "2 teaspoons vanilla extract", 
            "3 large eggs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/pecan-pie1.jpg?w=750", 
        "tags": [
            "Christmas", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2015/11/pecan-pie/", 
        "title": "pecan pie", 
        "directions": [
            "Make the pie dough: ", 
            "Form the crust: On a floured counter, roll the dough out into a 12 to 13-inch circle-ish shape. Fold dough gently in quarters without creasing and transfer to a 9-inch standard (not deep-dish) pie plate. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. If not parbaking, place in fridge until ready to fill. If parbaking, place in freezer for 20 minutes, until solid.", 
            "Par-bake the crust: [Optional, but will lead to a crispier base.] Heat oven 400°F (205°C). Line frozen crust with lightly buttered or oiled foil. Fill with pie weights, dried beans or pennies. Bake on a rimmed baking sheet for 20 minutes. Carefully remove foil and weights and let cool a little before filling. ", 
            "Heat oven: (Or reduce oven heat, if you just par-baked your crust) to 350°F (175°C).", 
            "Prepare filling: Spread pecans on a rimmed baking sheet and toast in the oven for 10 to 12 minutes, stirring once or twice so that they toast evenly. Set aside until needed. If you like smaller bits, you can chop them, or as shown here, chop half of them (although I usually leave them whole).", 
            "In medium saucepan, combine butter, brown sugar, golden syrup and pinch of salt. Bring to a simmer over medium heat and cook for 2 minutes, stirring. Remove from heat and stir in pecans, cider vinegar, vanilla and bourbon (if using). Pour into a bowl (so that it cools faster) and set the mixture aside to cool a little, about 5 to 10 minutes. Then, whisk in one egg at a time until combined. Pour mixture into prepared pie shell. ", 
            "Bake: For 40 to 45 minutes. The pie is done with the edges are set and puffed slightly and the center is slightly firm to the touch but still has some jiggle to it. Cool on a rack. Serve slightly warm or room temperature."
        ], 
        "date": "2015-11-12T12:04:09+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups (250 grams or 8 3/4 ounces) all-purpose flour", 
            "2 tablespoons (25 grams or 7/8 ounce) granulated sugar", 
            "1 teaspoon (5 grams) table salt", 
            "1 1/8 teaspoon (1/2 packet or 1/8 ounce) active dry yeast", 
            "3/4 cup (177 ml) milk", 
            "4 tablespoons (57 grams or 2 ounces) unsalted butter, softened", 
            "1 large egg plus 1 large egg yolk", 
            "1 stick (4 ounces or 113 grams) unsalted butter, divided", 
            "1 to 2 tablespoons honey (use less for lightly sweet, more for a more traditional honey butter)", 
            "Few pinches flaky sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sally-lunn-bread-honeyed-brown-butter-spread1.jpg?w=500", 
        "tags": [
            "Bread", 
            "Brown Butter", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/03/sally-lunn-bread-honeyed-brown-butter-spread/", 
        "title": "sally lunn bread + honeyed brown butter spread", 
        "directions": [
            "In a small saucepan, melt half your butter over medium heat. Once melted, reduce heat to medium-low. The butter will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Remove from heat and cool to room temperature. While it is cooling, leave the other half of the butter out to soften slightly (semi-firm is fine).", 
            "Whip softened butter with an electric mixer until fluffy. Slowly drizzle in the room temperature browned butter, honey and salt continue whipping until combined. Chill butter in fridge until a nice spreadable consistency, or until  needed."
        ], 
        "date": "2011-03-15T08:29:19+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces (113 grams) unsalted butter, plus extra for the pan", 
            "1 10-ounce (285-gram) bag marshmallows", 
            "Heaping 1/4 teaspoon coarse sea salt", 
            "6 cups (160 grams) crispy rice cereal (about half a 12-ounce box)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/salted-brown-butter-crispy-treats.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Candy", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2009/11/salted-brown-butter-crispy-treats/", 
        "title": "salted brown butter crispy treats", 
        "directions": [
            "Butter (or coat with non-stick spray) an 8-inch square cake pan with 2-inch sides.", 
            "In a large pot, melt butter over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as while you may be impatient for it to start browning, the period between the time the butter begins to take on color and the point where it burns is often less than a minute.", 
            "As soon as the butter takes on a nutty color, turn the heat off and stir in the marshmallows. The residual heat from the melted butter should be enough to melt them, but if it is not, turn it back on low until the marshmallows are smooth.", 
            "Remove the pot from the stove and stir in the salt and cereal together. Quickly spread into prepared pan. I liked to use a piece of waxed or parchment paper that I’ve sprayed with oil to press it firmly and evenly into the edges and corners, though a silicon spatula works almost as well.", 
            "Let cool, cut into squares and get ready to make new friends. "
        ], 
        "date": "2009-11-02T13:52:13+00:00"
    }, 
    {
        "ingredient_list": [
            "6 cups all-purpose flour, plus more for work surface", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon baking powder", 
            "4 teaspoons ground ginger", 
            "4 teaspoons ground cinnamon", 
            "1 1/2 teaspoons ground cloves", 
            "1 teaspoon finely ground pepper", 
            "1 1/2 teaspoons coarse salt", 
            "1 cup (2 sticks or 1/2 pound) unsalted butter (at room temperature)", 
            "1 cup packed dark-brown sugar", 
            "2 large eggs", 
            "1 cup unsulfured molasses", 
            "To decorate:", 
            "Royal icing", 
            "Various fine sanding sugars and sugar decorations"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/12/spicy-gingerbread-cookies.jpg?w=753", 
        "tags": [
            "Christmas", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/12/spicy-gingerbread-cookies/", 
        "title": "spicy gingerbread cookies", 
        "directions": [
            "Whisk together flour, baking soda, baking powder, spices and salt in a large bowl and set aside. Beat butter and brown sugar together in a large bowl with an electric mixer until fluffy. Mix in eggs and molasses. Add flour mixture, mixing on low until just combined. Divide dough into thirds and wrap each in plastic. Refrigerate until cold and firm, about one hour or up to two days.", 
            "Preheat oven to 350 degrees. Roll out dough on a lightly floured work surface to a 1/4-inch thick. Cut into shapes of your choice, such as snowflakes* or gingerbread men. Spread two inches apart on baking sheets lined with parchment paper, and refrigerate until the cookies firm up again, about 15 minutes.", 
            "Bake cookies until crisp but not dark, 12 to 14 minutes. Let cool on sheets on wire racks.", 
            "When cool, you can decorate the cookies with icing and sprinkles. When you pipe designs, sprinkle the icing with sanding sugar and let it sit for five minutes before tapping off the excess sugar. Then let the icing set completely at room temperature, which will take an hour or so, depending on how thick it is.", 
            "Store cookies between layers of parchment or waxed paper in an airtight container for up to a week.", 
            "* By the way, I don’t recommend my snowflake cookie cutter set as you will grow gray hairs trying to get the cookie cutter back from the dough without pulling off some icicles. Look for a set with less intricate details."
        ], 
        "date": "2010-12-23T18:47:18+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 stick salted or unsalted butter", 
            "1 teaspoon granulated sugar", 
            "6 slices white sandwich bread, crusts removed", 
            "1/4 cup packed dark brown sugar**", 
            "1/2 teaspoon lemon zest, finely grated", 
            "1/8 teaspoon salt (omit if using salted butter)", 
            "1/2 cup panko (Japanese bread crumbs, or make your own, below*)", 
            "1 1/2 to 2 cups strawberries, stemmed and sliced (I forgot to jot down the weight, but it was less than a half pound of whole berries)", 
            "Softly whipped cream, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/4642234776_22d0c3bbb2_o.jpg?w=750", 
        "tags": [
            "Brown Butter", 
            "Crumbles/Crisps", 
            "Photo", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2010/05/strawberry-brown-butter-bettys/", 
        "title": "strawberry brown butter bettys", 
        "directions": [
            "Preheat oven to 350°F with rack in middle.", 
            "In a small pot, melt butter over medium heat. Once melted, reduce heat to medium-low. The butter will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as while you may be impatient for it to start browning, the period between the time the butter begins to take on color and the point where it burns is less than a minute. Remove from heat.", 
            "Lightly butter muffin cups with some of brown butter, then sprinkle with granulated sugar. Roll bread slices with a rolling pin to flatten. Brush both sides with additional brown butter, then gently fit into muffin cups.", 
            "Stir together brown sugar, zest, salt and panko, then add strawberries and toss to coat. Stir in remaining brown butter. Heap strawberry mixture into cups, pressing gently.", 
            "Cover pan with foil and bake 15 minutes. Uncover and bake until strawberries are very tender, about 10 minutes more. Let stand 5 minutes before removing from pan. Serve warm or at room temperature.", 
            "* Make your own panko: Sure, it’s not exactly the same thing but I’m convinced that you can make very panko-like crumbs if you do the following — Preheat oven to 350 degrees. Tear one to two slices of soft, crustless white bread into 1-inch pieces and pulse them in the food processor until coarsely ground. This will make a generous half cup. Transfer crumbs to a rimmed baking sheet and bake until golden brown and dry, about 15 minutes, stirring occasionally. Cool. Use.", 
            "**Sweetness: [Updated 5/28/10] I “tested” this recipe with local, early-season not overly sweet strawberries. However, the ones you have may be sweeter. If you think your strawberries are on the sweeter side, you might want to dial the brown sugar back by one or even two tablespoons (the two tablespoon level, especially, if you like barely-sweet desserts). Hope that helps!"
        ], 
        "date": "2010-05-26T12:42:11+00:00"
    }
]