{
  "date": "2015-05-29T12:03:04+00:00",
  "directions": [
    "In a 1-liter carafe, combine water and 1/4 cup granulated sugar and shake it several times. Set this aside in the fridge to chill and dissolve while you prepare the other ingredients.",
    "Combine your berry of choice with remaining tablespoon of sugar; it’s best to let the strawberries sit with the sugar for 10 minutes to get the color and juices flowing; blackberries and raspberries can be used right away. Blend the berries and sugar until fully pureed, and then a minute longer. Press through a fine-mesh strainer if you, like me, prefer your lemonade without seeds. You should have a generous 1/4 cup of each puree.",
    "Remove sugar water carafe from the fridge; if sugar hasn’t fully dissolved, give it a few more shakes and it will. Add lemon juice and berry puree. For the pink hues you see above, use 1 tablespoon blackberry puree, 2 tablespoons raspberry puree or 4 tablespoons (or all) of the strawberry puree. If you don’t mind a dark red/purple color and want a stronger black- or raspberry flavor, you can use all of the puree. Extra puree makes an ideal yogurt or yogurt popsicle stir-in, or can be used for additional batches of pink lemonade, because this will go on repeat.",
    "Give the carafe another shake, and drink right away or chill until your next picnic. ",
    "A whole bunch of things about lemonade, from an obsessive: "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade1.jpg?w=640",
  "ingredient_list": [
    "3 cups cold water",
    "1/4 cup plus 1 tablespoon granulated sugar, divided",
    "1 cup (about 5 ounces) fresh raspberries, blackberries or sliced strawberries",
    "1 cup lemon juice (from 4 to 6 lemons, depending on size and juicer efficiency)"
  ],
  "tags": [
    "Blackberries",
    "Citrus",
    "Drinks",
    "Lemon",
    "Photo",
    "Picnics",
    "Raspberries",
    "Strawberries",
    "Summer"
  ],
  "title": "picnic pink lemonade",
  "url": "https://smittenkitchen.com/2015/05/pink-lemonade/"
}