{
  "date": "2009-09-04T11:15:52+00:00",
  "directions": [
    "Preheat the oven to 450°F. Grease a 12-inch skillet with one tablespoon of the lard or butter, leaving any excess in the pan, and place it in the oven.",
    "In a large bowl, whisk the dry ingredients together. In a medium bowl, whisk the egg until frothy and then whisk in the buttermilk. Add the wet ingredients to the dry ones and mix thoroughly. Melt the remaining butter in a small skill (or your microwave) and whisk the butter into your batter.",
    "While the fat in the large skillet is smoking, carefully remove the skillet from the oven and swirl the fat around to coat the bottom and sides evenly. Pour the batter into the skillet; it should “sizzle alluringly”, says the Lee Brothers. Bake for 15 minutes, or until the top of the bread is golden brown and the edge has pulled away from the side of the skillet. Remove from the oven and either serve hot, in six wedges, or let cool and reserve for Corn Bread Salad (above)."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/corn-bread-salad1.jpg?w=500",
  "ingredient_list": [
    "1 recipe Crispy Corn Bread (below) or 3 cups of 1-inch cornbread cubes",
    "1 1/2 pounds ripe tomatoes (4 to 6 medium)",
    "6 cups roughly torn sturdy fresh lettuce, such as Bibb, butter or Boston",
    "2 cups bitter greens, such as arugula or dandelion greens",
    "1 large Vidalia onion, trimmed, peeled, sliced crosswise as thinly as possible and separated into rings",
    "1 recipe Buttermilk-Lime Dressing (below)",
    "3/4 cups whole or lowfat buttermilk (whole preferred)",
    "5 tabespoons freshly squeezed lime juice (they say from 3 to 4 limes; I only needed 1 1/2)",
    "2 tablespoons olive oil",
    "1 tablespoon apple cider vinegar (optional, this was my addition to give it more zing)",
    "1 tablespoon honey",
    "1/4 cup finely minced fresh basil",
    "1/4 cup finely minced fresh flat-leaf parsley",
    "1/4 cup finely minced green onios",
    "1/2 teaspoon salt, plus more to taste",
    "1 tablespoon lard or unsalted butter",
    "1 1/2 cups stone-ground cornmeal",
    "1 teaspoon baking powder",
    "1 teaspoon baking soda",
    "1/2 teaspoon salt",
    "1 teaspoon sugar",
    "1 large egg",
    "1 1/2 cups whole or lowfat buttermilk (whole is preferred, here’s how you can make your own)",
    "2 tablespoons unsalted butter"
  ],
  "tags": [
    "Arugula",
    "Herbs",
    "Photo",
    "Salad",
    "Summer",
    "Tomatoes"
  ],
  "title": "corn bread salad",
  "url": "https://smittenkitchen.com/2009/09/corn-bread-salad/"
}