{
  "date": "2014-03-06T11:56:31+00:00",
  "directions": [
    "Rinse quinoa well in a small colander. This is essential to remove bitterness. Place quinoa and 1 1/2 cups water in a small saucepan and bring to a simmer with a couple pinches of salt. Simmer at a very low temperature for 15 to 20 minutes, until tender. Drain any un-absorbed liquid from cooked quinoa. Spread quinoa on a plate to cool quickly.",
    "Wash your kale and dry it well. Then, with a knife, remove the rib from each stalk, leaving long strips of kale leaves. Stack the leaves in small batches, roll them tightly the long way, and cut the roll crosswise into thin ribbons. Add the kale ribbons to a large salad bowl. Add remaining salad ingredients to kale and toss to mix.",
    "Whisk dressing ingredients together in a small dish, and pour the dressing over the salad. Season with salt and pepper to taste, then dig in."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/03/kale-and-quinoa-salad-with-ricotta-salata.jpg?w=750",
  "ingredient_list": [
    "Salad",
    "1/2 cup uncooked quinoa (or 1 1/2 cups cooked)",
    "8 ounces Black Kale, also known as Cavolo Nero, or Lacinato, Dinosaur, or Tuscan Kale",
    "1/2 cup slivered almonds, very well toasted and cooled",
    "1/3 cup dried cherries, chopped a bit",
    "2 to 3 scallions, thinly sliced",
    "2 teaspoons chopped fresh dill",
    "2 ounces ricotta salata, crumbled or finely grated",
    "Few gratings of fresh lemon zest",
    "Dressing",
    "3 tablespoons olive oil",
    "1 1/2 tablespoons white wine vinegar",
    "2 teaspoons smooth Dijon mustard",
    "1 teaspoon coarse Dijon mustard",
    "Just shy of 1 teaspoon honey",
    "Salt and freshly ground black pepper to taste"
  ],
  "tags": [
    "Grain/Rice",
    "Kale",
    "Lunch",
    "Photo",
    "Salad",
    "Vegetarian"
  ],
  "title": "kale and quinoa salad with ricotta salata",
  "url": "https://smittenkitchen.com/2014/03/kale-and-quinoa-salad-with-ricotta-salata/"
}