[
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/a-monday-kind-of-salad1.jpg?w=500", 
        "tags": [
            "Gluten-Free", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/01/a-monday-kind-of-salad/", 
        "title": "sweet and spicy candied pecans", 
        "directions": [
            "Preheat oven to 325°F. Spray baking sheet with nonstick spray. Combine corn syrup and next 4 ingredients in large bowl. Stir to blend. Add pecans; stir gently to coat. Transfer to baking sheet.", 
            "Place large piece of foil on work surface. Bake pecans 5 minutes. Using fork, stir pecans to coat with melted spice mixture. Continue baking until pecans are golden and coating bubbles, about 10 minutes. Transfer to foil. Working quickly, separate nuts with fork. Cool. (Can be made 3 days ahead. Store airtight at room temperature.) "
        ], 
        "date": "2007-01-24T09:22:58+00:00"
    }, 
    {
        "ingredient_list": [
            "2 medium roma tomatoes, cubed", 
            "1 1-pound English cucumber, cubed", 
            "1/2 medium red onion, cubed, or 4 scallions, finely sliced", 
            "3 tablespoons finely minced fresh, flat-leaf parsley", 
            "Juice of half a lemon", 
            "2 to 3 tablespoons olive oil", 
            "1 1/2 teaspoons sumac powder", 
            "Salt and pepper, to taste", 
            "6 large pitas, cut into eight wedges each, then each wedge split into two layers (for small chips) cut into six wedges and split (for large, scoopable chips)", 
            "Olive oil cooking spray or 2 tablespoons olive oil", 
            "Flaky sea salt", 
            "1 tablespoon za’atar or sumac"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/700544972_564e118f79_b.jpg?w=753", 
        "tags": [
            "Cucumber", 
            "Israeli", 
            "Photo", 
            "Round-Up", 
            "Salad", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/07/a-salad-palette/", 
        "title": "israeli salad + pita chips", 
        "directions": [
            "Preheat oven to 350 degrees. On a large baking sheet lined with parchment paper, arrange all of the pita slices so they do not overlap. Either brush or spray with olive oil, then sprinkle with sea salt and your spice of choice. Bake for 10 to 15 minutes, or until they begin to color. Let them cool completely before using, or bagging for later. "
        ], 
        "date": "2007-07-03T11:53:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1 ounce walnuts (about 1/3 cup)", 
            "1 1/2 pounds fingerling potatoes, cut crosswise into 1/2-inch-thick rounds", 
            "6 ounces haricots, verts, or other green beans, trimmed and cut into 2-inch segments", 
            "2 tablespoons white wine or other mild vinegar", 
            "2 tablespoons plain yogurt", 
            "1 teaspoon Dijon mustard", 
            "1 teaspoon coarse salt", 
            "Freshly ground pepper", 
            "2 tablespoons walnut oil", 
            "3 ounces baby arugula"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/arugula-potato-and-green-bean-salad1.jpg?w=500", 
        "tags": [
            "Arugula", 
            "Green Beans", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/07/arugula-potato-and-green-bean-salad/", 
        "title": "arugula, potato and green bean salad", 
        "directions": [
            "Preheat oven to 375°. Place walnuts on a rimmed baking sheet and toast in oven until fragrant, about 8 minutes. Let cool slightly, then coarsely chop and set aside.", 
            "Bring a medium saucepan of water to a boil. Add potatoes, and cook until tender, about 10 minutes. Using a slotted spoon, transfer potatoes to a colander to drain and cool. Set aside.", 
            "Prepare an ice-water bath; set aside. Return pan of water to a boil. Add green beans, and cook until tender and bright green, about 3 to 4 minutes. Using a slotted spoon, transfer to ice-water bath to stop the cooking. Drain.", 
            "Whisk together vinegar, yogurt, mustard and 1/2 teaspoon salt in a small bowl; season with pepper. Add oil in a slow, steady stream, whisking until emulsified. Set dressing aside.", 
            "Arrange arugula, potatoes, and green beans on a platter. Season with remaining 1/2 teaspoon salt and 1/4 teaspoon pepper. Drizzle with dressing and sprinkle with toasted walnuts; toss to coat."
        ], 
        "date": "2009-07-16T15:31:03+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup black beans, cooked, drained (about 2/3 of a 15-ounce can)", 
            "1 large bell pepper, finely diced (I used a mix of colors because we keep them around for the kid)", 
            "1/4 cup finely diced white or red onion", 
            "1 small jalapeno, seeded and minced", 
            "1/4 cup olive oil", 
            "2 tablespoons freshly squeezed lime juice (from about 1 lime)", 
            "1/4 teaspoon coarse salt, plus more to taste", 
            "1/2 teaspoon ground cumin", 
            "Dashes of hot sauce or pinches of cayenne, to taste", 
            "Chopped cilantro for garnish", 
            "4 ripe avocados", 
            "1 cup finely diced cucumber (from about half a long English or 2 small Persian cukes), seeds removed", 
            "1 cup finely diced radishes (from about 4 large red ones)", 
            "2 scallions, finely chopped", 
            "4 tablespoons toasted sesame oil", 
            "2 teaspoons white miso (shiromiso, which is more mild/less salty)", 
            "2 tablespoons rice vinegar", 
            "1/2 teaspoon finely grated or minced fresh ginger root (or more to taste)", 
            "1 teaspoon white sesame seeds, toasted", 
            "1 teaspoon black sesame seeds", 
            "4 ripe avocados"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/avocado-cup-salads-two-ways1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Avocado", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/04/avocado-cup-salads-two-ways/", 
        "title": "avocado cup salads, two ways", 
        "directions": [
            "Mix cucumber, radishes and scallions in a medium bowl. In a small dish, whisk sesame oil, miso, rice vinegar and ginger. Add dressing flavor and seasonings to taste. Halve avocados and remove pits. Score avocado halves with a knife, cutting lines in both directions to form a grid, but being careful not to through the skin. ", 
            "If you’re serving all four avocados right away, go ahead and mix the dressing and salad ingredients together, then heap each avocado half with salad and dressing and garnish with mix of sesame seeds. If you’d like to stretch this over several days of lunches or the like, keep the mixed salad ingredients and dressing in separate dishes. When you’re ready to eat, cut and score your avocado, dot a little dressing directly on each half, heap with salad filling and drizzle with more dressing. Garnish with mix of seeds. ", 
            "Eat with a spoon. "
        ], 
        "date": "2014-04-23T12:13:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large carrot, peeled and roughly chopped", 
            "1 small shallot, peeled and roughly chopped", 
            "2 tablespoons roughly chopped fresh ginger", 
            "2 tablespoons white miso", 
            "2 tablespoons rice vinegar", 
            "2 tablespoons toasted sesame seed oil", 
            "1/4 cup grape seed or another neutral oil", 
            "2 tablespoons water", 
            "1 small/medium head of lettuce (I used Bibb)", 
            "1/4 red onion, thinly sliced", 
            "1 avocado, quartered and thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/avocado-salad-with-carrot-ginger-dressing.jpg?w=750", 
        "tags": [
            "Avocado", 
            "Carrots", 
            "Photo", 
            "Salad", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/04/avocado-salad-with-carrot-ginger-dressing/", 
        "title": "avocado salad with carrot-ginger dressing", 
        "directions": [
            "Make the dressing: Whiz the carrots, shallot and ginger in a blender or food processor until finely chopped. Scrape down the sides, then add the miso, vinegar and sesame oil. While the machine running, slowly drizzle in the grape seed oil and the water.\nAssemble salad: Trim and chop lettuce into small wedges. Arrange on a platter. Scatter onion and avocado on top.* If you’d like, and I do, sprinkle some flaky sea salt and black pepper over the salad at this point. Dollop with plenty of dressing and serve with remaining dressing on the side.I also added a few strips of purple and yellow carrot on top that had been cut with a juleinne peeler, plus some snipped chives. Toasted black and white sesame seeds would also make a pretty garnish here."
        ], 
        "date": "2010-04-26T17:25:21+00:00"
    }, 
    {
        "ingredient_list": [
            "2 medium tomatoes", 
            "1/2 pound yellow wax beans, ends trimmed and beans halved crosswise", 
            "1/2 pound haricot vert, or slim green beans, ends trimmed and beans halved crosswise", 
            "2 to 3 tablespoons olive oil", 
            "2 cloves garlic, minced", 
            "Pinch of red pepper flakes", 
            "Glug of white wine", 
            "Salt and pepper", 
            "Juice of one lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/bean-symphony1.jpg?w=500", 
        "tags": [
            "Elsewhere", 
            "Green Beans", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/08/bean-symphony/", 
        "title": "mixed bean salad", 
        "directions": [
            "Bring a medium-large pot of salted water to boil. Carefully lower the two tomatoes in with a slotted spoon and cook for one minute. Leave the water boiling while you drop them into a bath of ice water, peel them and then set them aside.", 
            "Meanwhile, lower the wax beans in the water for 2 to 3 minutes, until lightly cooked but still firm. Remove them from the boiling water with a large slotted spoon or tongs and plunge them in the ice bath to stop cooking them. Drain them in a colander and then spread them out on a kitchen towel to dry. ", 
            "Repeat this process with the haricot vert, but only cook them for one minute. ", 
            "If you, like me, are in a tiny kitchen and love nothing more than a one pot dish, dump the water out of the pot, dry it, and heat the olive oil to medium-high. If you love doing dishes, you can complete this step in a large saute pan. Yeah, I thought so. ", 
            "Once the oil is heated, add the minced garlic and stir it around with a wooden spoon until lightly cooked but not brown, one minute or so. Add a pinch of red pepper flakes, and then the two peeled tomatoes that you have set aside. Break them up into chunks with your spoon, and simmer this into sauciness for about 5 minutes. Add a glug of white wine, and simmer for one more minute. ", 
            "Dump the drained and dried beans into the tomato sauce, and mix it around until combined and heated through. Salt and pepper to taste. Put the salad in a serving bowl and squeeze the lemon juice all over it, tossing it lightly. ", 
            "Eat immediately."
        ], 
        "date": "2007-08-07T14:11:07+00:00"
    }, 
    {
        "ingredient_list": [
            "Salt", 
            "1 cup semi-pearled farro", 
            "1 pound broccolini or regular broccoli (previously: 2 pounds, see note)", 
            "4 tablespoons olive oil", 
            "2 cloves garlic, minced", 
            "Red pepper flakes, to taste", 
            "Finely grated zest, then juice, of 1 lemon (juice before zesting only if you enjoy being grumpy)", 
            "Freshly ground black pepper", 
            "4 ounces pecorino romano, grated or ground in a food processor"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/broccoli-rubble-farro-salad.jpg?w=750", 
        "tags": [
            "Broccoli", 
            "Grain/Rice", 
            "Lunch", 
            "Picnics", 
            "Put An Egg On It", 
            "Recipes", 
            "Salad", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2017/05/broccoli-rubble-farro-salad/", 
        "title": "broccoli rubble farro salad", 
        "directions": [
            "Bring a medium/large pot of salted water to boil. Once boiling, add broccoli and boil for 2 to 2 1/2 minutes, until slightly softened but still crisp overall. Scoop out with slotted spoon or tongs, then drain.", 
            "Add farro back to same pot (I’m totally okay with some errant leftover broccoli flecks and vitamins here, if you’re not, use another pot of salted water) and cook, simmering, for 25 to 30 minutes, until tender. (Since there are so many varieties of farro, however, if your package suggests otherwise, it’s best to defer to its cooking suggestion.) Drain and tip into a large mixing bowl; cool to lukewarm.\nPat drained broccoli dry on towels, trying to remove as much excess moisture as possible. Chop into small (roughly 1/2-inch) bits. In a large sauté pan, heat olive oil over medium-high heat until hot. Add garlic and pepper flakes, to taste, and cook for 1 minute, until garlic is faintly golden. Add chopped broccoli, lemon zest, and salt (I use a full teaspoon kosher salt here, but adjust the amount to your taste) and cook, stirring, for 3 to 4 more minutes, until broccoli is well-seasoned and slightly more tender.\nAdd broccoli and every bit of garlic and oil from the pan to the bowl of farro and stir to combine. Add lemon juice, black pepper and more salt to taste (but 1/2 teaspoon of each is what we used) and stir to combine. Stir in cheese.", 
            "Serve warm or at room temperature as-in, with an egg on top, burrata, and/or seasoned breadcrumbs."
        ], 
        "date": "2017-05-24T12:05:32+00:00"
    }, 
    {
        "ingredient_list": [
            "2 heads of broccoli", 
            "1/2 cup thinly sliced almonds, toasted", 
            "1/3 cup dried cranberries", 
            "1/2 small red onion, finely chopped", 
            "Buttermilk Dressing (Adapted from this salad.)", 
            "1/2 cup buttermilk, well-shaken", 
            "1/3 cup mayonnaise (this is more than is in the original, to thicken the dressing further)", 
            "2 tablespoons cider vinegar", 
            "1 tablespoon sugar", 
            "3 tablespoons finely chopped shallot (or, you could just use a little extra red onion to simplify it)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/broccoli-slaw.jpg?w=753", 
        "tags": [
            "Broccoli", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2009/05/broccoli-slaw/", 
        "title": "broccoli slaw", 
        "directions": [
            "Trim broccoli and cut it into large chunks. From here, you can either feed it through your food processor’s slicing blade, use a mandoline to cut it into thin slices, or simply had chop it into smaller pieces. I used the stem and the flowerets, but if you have a broccoli stem aversion you can just use the tops. (P.S. My favorite way to prep the stems is to peel them — the tough skin is why most people think they don’t like broccoli stems; the broccoli underneath is juicy and crisp — then use the mandoline or a knife to cut them into thin slices.)", 
            "Toss the sliced broccoli with the almonds, cranberries and red onion in a large bowl. Meanwhile, whisk the dressing ingredients in a smaller one, with a good pinch of salt and black pepper. Pour the dressing over the broccoli (if you’ve skipped the stems, you might not want it all; I otherwise found this to be the perfect amount) and toss it well. Season well with salt and pepper to taste.", 
            "Should keep up to a week in the fridge, if you don’t have any pregnant women nearby.", 
            "Variation: I bet this slaw would be equally good with cauliflower. I might use dried currants instead of cranberries, walnuts instead of almonds and maybe even some celery slices thrown in. Have fun with it."
        ], 
        "date": "2009-05-11T14:22:16+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 large red onion, diced small", 
            "2 tablespoons red wine vinegar", 
            "2 teaspoons ground sumac", 
            "1/4 teaspoon kosher salt, plus more to season salad", 
            "2 cups shredded brussels sprouts", 
            "1/2 cup fresh pomegranate seeds (from about 1/2 a large one)", 
            "1/2 a large unpeeled apple, cored and diced (I used Granny Smith, the book recommends Pink Lady or Honeycrisp)", 
            "Juice of half a lemon, plus more to taste", 
            "1 1/2 to 2 tablespoons honey, plus more to taste", 
            "1/4 cup olive oil", 
            "3/4 cup toasted, cooled walnuts, lightly crushed or coarsely chopped", 
            "Ground chipotle chile pepper, urfa biber peppers, hot smoked paprika or another chile flake, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad.jpg?w=750", 
        "tags": [
            "Apple", 
            "Brussels Sprouts", 
            "Fall", 
            "Gluten-Free", 
            "Onions", 
            "Photo", 
            "Pomegranate", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Tips", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad/", 
        "title": "brussels sprouts, apple and pomegranate salad", 
        "directions": [
            "Make the sumac-pickled onions: Combine red onion, wine vinegar, sumac and 1/4 teaspoon kosher salt in a small dish and set aside while you prepare the other ingredients, or ideally at least 15 minutes.\nCombine all salad ingredients, including red onions and their pickling liquid, in a medium bowl and season to taste with salt and red pepper. Taste and adjust ingredients as desired — I’ve seen versions of the recipe with more honey, olive oil and lemon; I didn’t need them but you might find you do.\nThis salad can be prepped ahead, but I’d keep the dressing off of it until at most an hour before serving so it doesn’t discolor the sprouts."
        ], 
        "date": "2016-11-21T13:06:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium butternut squash (about 2 pounds)", 
            "5 to 6 tablespoons olive oil, divided", 
            "Salt and freshly ground black pepper, to taste", 
            "1 cup semi-pearled farro (see Note up top)", 
            "1/3 cup toasted pepitas (I used, and love, the salted ones)", 
            "3 ounces ricotta salata or another salty cheese, crumbled or coarsely grated (about 3/4 cup)(omit to make vegan)", 
            "1 tablespoon sherry vinegar", 
            "1 tablespoon water", 
            "1/2 teaspoon table salt", 
            "1/2 teaspoon granulated sugar", 
            "1/2 small red onion, finely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/butternut-squash-salad-with-farro-and-pepitas1.jpg?w=500", 
        "tags": [
            "Fall", 
            "Grain/Rice", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Vegan", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2012/10/butternut-squash-salad-with-farro-and-pepitas/", 
        "title": "butternut squash salad with farro and pepitas", 
        "directions": [
            "Preheat oven to 375 degrees F. ", 
            "Peel squash, then halve lengthwise and scoop out seeds. Cut squash into approximately 3/4-inch chunks. Coat one large or two small baking sheets with 2 tablespoons oil total. Spread squash out in single layer on sheet. Sprinkle with salt and freshly ground black pepper. Roast until pieces are tender, about 30 to 40 minutes, turning them over halfway through the cooking time. Set aside to cool slightly.", 
            "While squash is roasting, cook farro in a large pot of simmering salted water until the grains are tender but chewy, about 30 minutes. (Since there are so many varieties of farro, however, if your package suggests otherwise, it’s best to defer to its cooking suggestion.) Drain and cool slightly.", 
            "While squash is roasting and farro is simmering, in a small bowl, whisk together sherry vinegar, water, 1/2 teaspoon table salt and granulated sugar until sugar and salt dissolve. Stir in onion; it will barely be covered by vinegar mixture but don’t worry. Cover and set in fridge until needed; 30 minutes is ideal but less time will still make a lovely, lightly pickled onion.", 
            "In a large bowl, mix together butternut squash, farro, red onion and its vinegar brine, the crumbled cheese and pepitas. Toss with 3 tablespoons of the remaining olive oil, use the 4th one only if needed. Taste and adjust seasonings. Eat now or later. Salad keeps in the fridge for up to a week."
        ], 
        "date": "2012-10-23T11:28:02+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 small red cabbage, trimmed, cored, and shredded (about 6 cups)", 
            "1/2 small green cabbage, trimmed, cored, and shredded (about 6 cups)", 
            "1 tablespoon kosher salt, plus more to taste", 
            "1 bunch fresh baby spinach, stemmed and cut into 1/2-inch wide ribbons (about 4 cups loosely packed)", 
            "1/4 cup fresh lime juice (from about 2 small limes)", 
            "1 tablespoon Dijon or other salty prepared mustard", 
            "1/2 teaspoon ground cumin", 
            "1/4 cup peanut oil", 
            "1/2 cup roasted unsalted peanuts, coarsely chopped", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-and-lime-salad-with-roasted-peanuts1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Citrus", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spinach", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/04/cabbage-and-lime-salad-with-roasted-peanuts/", 
        "title": "cabbage and lime salad with roasted peanuts", 
        "directions": [
            "In a large bowl, toss the shredded red and green cabbage with the salt. Transfer the cabbage to a colander and let it drain for two hours. (I was in a rush and did this in one. It was still nicely wilted, but of course could have been even softer.)", 
            "If you’re worried about the cabbage being too salty when you’re done with the salting process, taste a piece of cabbage and if it concerns you, rinse and drain the cabbage well. This is not a suggestion in the original recipe, but something I suspect might bother some people.", 
            "Put the salted, drained cabbage back into your (rinsed and dried) large bowl and add the spinach. In a medium bowl, whisk the lime juice, mustard and cumin together. Add the peanut oil in a thin stream, whisking constantly until the ingredients are thoroughly emulsified. Toss the salad with the dressing and add the roasted peanuts. Season to taste with salt and pepper.", 
            "This salad is best served immediately, but it does keep surprisingly well in the fridge for a day or two. "
        ], 
        "date": "2010-04-28T22:35:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small savoy cabbage", 
            "1/3 cup walnuts", 
            "2 tablespoons cider vinegar", 
            "1 tablespoon lemon juice", 
            "Salt and pepper", 
            "1/2 cup olive oil", 
            "2 tablespoons creme fraiche or heavy cream (we used sour cream)", 
            "2 apples (any crisp, tasty eating variety, such as Sierra Beauty, Granny Smith, or Fuji)", 
            "1/3 cup crumbled blue cheese (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-apple-and-walnut-salad1.jpg?w=500", 
        "tags": [
            "Apple", 
            "Cabbage", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/11/cabbage-apple-and-walnut-salad/", 
        "title": "cabbage, apple and walnut salad", 
        "directions": [
            "Preheat the oven to 375°F.", 
            "Tear off and discard the tough outer leaves of the cabbage. Cut it in half and cut out its core. Slice the halves crosswise into a fine chiffonade.", 
            "Toast the walnuts in the oven for 8 minutes. While they are still warm, first rub them in a clean dishtowel to remove some of the skins, then chop or coarsely crumble them.", 
            "To prepare the dressing, mix the vinegar with the lemon juice, some salt, and a generous amount of pepper.", 
            "Whisk in the olive oil and then the creme fraiche or cream. Taste and adjust the acid and salt as desired.", 
            "Quarter, peel, and core the apples. Slice the quarters lengthwise fairly thin and cut these slices lengthwise into a julienne. Toss the cabbage, apples, and walnuts (and blue cheese, if you’re using it) with the dressing and an extra pinch of salt. Let the salad sit for 5 minutes, taste again, adjust the seasoning as needed, and serve."
        ], 
        "date": "2008-11-28T23:58:37+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 pound carrots, peeled, trimmed and coarsely grated", 
            "4 tablespoons olive oil", 
            "1 crushed clove of garlic", 
            "1/2 teaspoon caraway seeds or about half as much, ground (I used seeds but ground them first)", 
            "3/4 teaspoon cumin seeds or about half as much, ground (I used the seed but ground them first, again)", 
            "1/2 teaspoon paprika", 
            "3/4 teaspoon harissa (for a solid kick of heat; adjust yours to taste, and to the heat level of your harissa)", 
            "1/2 teaspoon sugar", 
            "3 tablespoons lemon juice", 
            "2 tablespoons flat leaf parsley, finely chopped", 
            "2 tablespoons fresh mint, finely chopped", 
            "100 grams feta, crumbled or chopped into bits"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/carrot-salad-with-harissa-feta-mint.jpg?w=750", 
        "tags": [
            "Carrots", 
            "North African", 
            "Photo", 
            "Salad", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/05/carrot-salad-with-harissa-feta-and-mint/", 
        "title": "carrot salad with harissa, feta and mint", 
        "directions": [
            "In a small sauté pan, cook the garlic, caraway, cumin, paprika, harissa and sugar in the oil until fragrant, about one to two minutes. Remove from heat and add the lemon juice and a pinch of salt. Pour over the carrots and mix. Add the herbs and mix. Leave to infuse for an hour and add the feta before eating. With a fork.", 
            "Harissa: Is a North African chile paste that has become so popular, we were tickled to find it all over tables in Paris two years ago, right next to the Dijon mustard. There is almost nothing it doesn’t make more delicious: eggs, potatoes, stews, couscous, sandwiches and more, and there are almost as many recipes as there are people who consume it. Most boil down to hot chiles ground with garlic, cumin, coriander, caraway and olive oil, often with a smidge of sundried tomatoes. You can make your own (I’ve been eying this recipe for some time) or you can buy some (I brought home this brand, which we love). The adavantage of making your own, as always, is that you can adjust the recipe to suit your tastes and desired level of heat."
        ], 
        "date": "2010-05-17T16:05:52+00:00"
    }, 
    {
        "ingredient_list": [
            "Chickpeas", 
            "1 3/4 cups cooked chickpeas, or 1 15-ounce can, drained and patted dry on paper towels", 
            "1 tablespoon olive oil", 
            "1/2 teaspoon coarse sea salt", 
            "1/4 teaspoon ground cumin", 
            "Salad", 
            "1 pound carrots, peeled and coarsely grated", 
            "1/4 cup coarsely chopped parsley", 
            "1/4 cup shelled, salted pistachios, coarsely chopped", 
            "Dressing", 
            "1 medium garlic clove, minced", 
            "1/4 cup lemon juice", 
            "3 tablespoons well-stirred tahini", 
            "2 tablespoons water, plus more if needed", 
            "2 tablespoons olive oil", 
            "Salt and red pepper flakes to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/carrot-salad-with-tahini-and-crisped-chickpeas1.jpg?w=640", 
        "tags": [
            "Carrots", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/05/carrot-salad-with-tahini-and-crisped-chickpeas/", 
        "title": "carrot salad with tahini and crisped chickpeas", 
        "directions": [
            "Roast chickpeas: Heat oven to 425 degrees F. Toss chickpeas with one tablespoon olive oil, salt and cumin until they’re all coated. Spread them on a baking sheet or pan and roast them in the oven until they’re browned and crisp. This can take anywhere from 15 to 20 minutes, depending on the size and firmness of your chickpeas. Toss them occasionally to make sure they’re toasting evenly. Set aside until needed.", 
            "Make dressing: Whisk all ingredients together until smooth, adding more water if needed to thin the dressing slightly. Taste and adjust seasoning; don’t worry if it tastes a little sharp on the lemon, it will marry perfectly with the sweet grated carrots.", 
            "Assemble salad: Place grated carrots in large bowl and toss with parsley. Mix in 2/3 of the dressing, adding more if desired. Add more salt and pepper if needed. Sprinkle with a large handful of chickpeas (you’ll have extra and if you’re like us, won’t regret it) and pistachios and dig in.", 
            "Do ahead: Salad keeps well in the fridge for two days, however, I’d add the chickpeas and pistachios right before serving, so they don’t get soft."
        ], 
        "date": "2014-05-29T10:45:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup + 3 tablespoons olive oil", 
            "1 teaspoon minced fresh rosemary", 
            "2 tablespoons fresh lemon juice", 
            "1 tablespoon red wine vinegar", 
            "1 1/2 teaspoons salt", 
            "1/2 teaspoon ground black pepper", 
            "1 medium head of cauliflower, trimmed, cut into small florets (about 3 cups)", 
            "1 (15-ounce) can kidney beans, drained", 
            "2 large heads of Belgian endive, trimmed, halved lengthwise, then thinly sliced crosswise", 
            "1 tablespoon chopped fresh chives", 
            "2 teaspoons chopped fresh parsley", 
            "1/2 cup crumbled feta cheese (about 3 ounces)", 
            "1 cup coarsely chopped walnuts, toasted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cauliflower-bean-and-feta-salad1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Cauliflower", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/04/cauliflower-bean-and-feta-salad/", 
        "title": "cauliflower, bean and feta salad", 
        "directions": [
            "Preheat oven to 400°F. Toss cauliflower florets with 3 tablespoons olive oil and season well with salt and pepper. Spread on a baking sheet and roast until edges are dark and caramelized, about 20 to 25 minutes, stirring once or twice.", 
            "While cauliflower is roasting, combine remaining 1/3 cup olive oil and rosemary in small saucepan. Stir over medium heat just until fragrant, about 1 minute. Cool.", 
            "Whisk lemon juice, vinegar, lemon peel, salt, and pepper in small bowl. Combine roasted, still warm cauliflower, beans, endive, chives, parsley, walnuts and rosemary oil in medium bowl; toss. Mix in cheese. Add lemon juice mixture and toss to coat. Season salad with salt and pepper."
        ], 
        "date": "2008-04-23T17:17:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small firm head cauliflower or broccoflower, about 12 ounces", 
            "1 hard-cooked egg", 
            "Sherry vinaigrette (below)", 
            "2 scallions, including an inch of the greens, thinly sliced", 
            "1 cup diced celery heart with leaves", 
            "1 small green bell pepper, thinly sliced", 
            "1 small cucumber, peeled, seeded, and chopped", 
            "12 pimiento-stuffed Spanish green olives, halved", 
            "1 tablespoon capers, rinsed", 
            "1/2 cup parsley leaves", 
            "1 or 2 garlic cloves, coarsely chopped", 
            "salt and freshly milled pepper", 
            "1 1/2 tablespoons sherry vinegar or aged red wine vinegar", 
            "1 teaspoon Dijon mustard", 
            "6 tablespoons extra-virgin olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cauliflower-salad-with-green-olives-and-capers1.jpg?w=500", 
        "tags": [
            "Cauliflower", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/11/cauliflower-salad-with-green-olives-and-capers/", 
        "title": "cauliflower salad with green olives and capers", 
        "directions": [
            "Pound the garlic with 1/4 teaspoon salt in a mortar until it breaks down into a puree. Combine the garlic, vinegar, and mustard in a small bowl, then whisk in the oil and season with pepper. Taste and correct the balance."
        ], 
        "date": "2008-11-05T20:58:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup thinly sliced almonds", 
            "Juice of half a lemon (about 1 tablespoon), plus more to taste", 
            "1 tablespoon white wine vinegar", 
            "1/4 teaspoon fine sea salt or table salt, then more to taste", 
            "3 tablespoons (30 grams) dried currants", 
            "5 tablespoons olive oil, plus more for frying", 
            "2 tablespoons (about 25 grams) brined or salt-packed capers", 
            "oil for frying", 
            "1 small, compact-looking head of cauliflower (about 1 1/4 pounds)", 
            "Freshly ground black pepper", 
            "3 scallions, thinly sliced (use green and white parts)", 
            "2 tablespoons chopped flat-leaf parsley (optional, mostly for color)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-slaw1.jpg?w=640", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/cauliflower-slaw/", 
        "title": "cauliflower slaw", 
        "directions": [
            "Heat oven to 350 degrees F. Spread almonds on a tray and toast them until they’re a deep golden color, tossing them once or twice to ensure even cooking. This will take 10 to 14 minutes. Set aside to cool.** ", 
            "Meanwhile, place lemon juice, vinegar and 1/4 teaspoon salt in a small bowl. Add currants; set aside and let them soak while you prepare the other ingredients. ", 
            "If using brined capers, drain and spread them on paper towels until most of their moisture has wicked out, about 5 minutes. If using salt-packed capers, soak them in water for 10 minutes to remove the saltiness, then drain, rinse and pat dry on paper towels. Pour a 1/2-inch of olive oil or another oil that you prefer to fry in in a small skillet or saucepan. Heat it over medium-high. When hot enough that a droplet of water added to the oil hisses, carefully add the capers and step back — they’re going to sputter a bit for the first 10 seconds. Once it’s safe to get closer, give them a stir. Depending on how dry they were, it can take 1 to 2 minutes for them to get lightly golden at the edges and then crisp. Remove with a slotted spoon. Drain on paper towels.", 
            "Trim cauliflower leaves and cut head into quarters. Using an adjustable-blade slicer (this is mine; it takes up very little room) to cut cauliflower, stem and florets, into 1/4-inch slices. Add to a large bowl. ", 
            "Scoop currants from vinegar mixture with a slotted spoon and add to bowl with cauliflower, along with almonds, capers, scallions and parsley. Slowly whisk 5 tablespoons olive oil into remaining vinegar mixture in a thin stream. Add several turns of freshly ground black pepper. Pour over cauliflower and other ingredients and turn gently to coat all pieces. Taste and adjust seasonings, adding more lemon juice, salt or pepper to taste. Dig in!", 
            "** P.S. I really tried to avoid this pesky oven step by toasting mine in a skillet, the one I’d use to fry the capers in a few minutes. Twice, I failed because the little bits got black and smoky before the larger ones toasted, no matter how much I kept them moving. I’m pretty sure I could do better in the future, but I was running out of almonds. If you trust your pan-toasting skills, feel free to cook the almonds there instead."
        ], 
        "date": "2014-09-16T11:56:06+00:00"
    }, 
    {
        "ingredient_list": [
            "Salt", 
            "1/2 pound pasta (I used Setaro’s organietti, but other radiatore shapes are great here)", 
            "1 medium eggplant (1 pound)", 
            "Freshly ground black pepper", 
            "Additional sherry or red wine vinegar", 
            "2 ounces ricotta salata, crumbled", 
            "2 tablespoons chopped flat-leaf parsley or basil", 
            "3/4 cup (2 3/4 ounds ounces) walnuts, toasted and cooled first for best flavor", 
            "3 tablespoons grated Parmesan cheese", 
            "1 small garlic clove, peeled", 
            "2 sprigs of thyme, cleaned", 
            "Salt", 
            "2 teaspoons sherry vinegar, plus more at end", 
            "1/4 cup olive oil, plus more at end", 
            "2 tablespoons (about 3) minced sun-dried tomatoes (oil or dry-packed will both work)", 
            "Freshly ground black pepper and/or red pepper flakes"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/06/charred-eggplant-and-walnut-pesto-pasta-salad1.jpg?w=750", 
        "tags": [
            "Eggplant", 
            "Grilling", 
            "Pasta", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/06/charred-eggplant-and-walnut-pesto-pasta-salad/", 
        "title": "charred eggplant and walnut pesto pasta salad", 
        "directions": [
            "\nCook pasta: In very well salted water until 1 to 2 minutes before doneness and drain.\nPrepare eggplant: Trim eggplant and slice into 1/2-inch coins. Brush both sides with olive oil and sprinkle with salt and freshly ground black pepper. Heat grill to medium-high. Arrange eggplant in one layer and cook until charred underneath, about 8 minutes. (If it’s sticking to the grill, it wants to cook longer.) Flip pieces over and cook until charred on second side, about 5 to 8 minutes more. Set aside to cool slightly then chop into chunks.\nNo grill? Heat oven to 425. Trim eggplant and slice into 1/2-inch coins. Coat a baking sheet generously with olive oil, arrange eggplant on top and sprinkle with salt and pepper. Roast, without disturbing, for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release easily; if they don’t want to, cook them a few minutes longer. Flip each piece, sprinkle again with salt and pepper, and roast on the second side for 10 to 12 minutes, or until charred underneath again.\nMake dressing: In food processor, coarsely grind walnuts, cheese, garlic, thyme, salt and freshly ground black pepper and/or red pepper flakes. Stir in oil and tomatoes, then whisk in vinegar to taste.\nAssemble salad: Toss cooked pasta with walnut dressing and additional vinegar and oil to loosen (I used about 1 tablespoon extra oil and 2 tablespoons extra vinegar in total). Chop eggplant into chunks, add to bowl and toss again. Adjust seasonings to taste, then stir in cheese and herbs."
        ], 
        "date": "2016-06-07T12:01:16+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons mayonnaise – or – 1 egg", 
            "1 tablespoon fresh lemon juice", 
            "1/2 teaspoon Dijon mustard", 
            "1 small garlic clove, minced", 
            "1/2 teaspoon Worcestershire sauce, plus a drop or two more, to taste", 
            "1 oil-packed anchovy fillet, finely chopped (optional)", 
            "1/4 cup extra-virgin olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chicken-caesar-salad1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/01/chicken-caesar-salad/", 
        "title": "chicken caesar salad", 
        "directions": [
            "Whisk all except last together. Gradually whisk in 1/4 cup olive oil. Season with salt and pepper. (Dressing can be made 1 day ahead. Cover and refrigerate. Bring to room temperature and rewhisk before using.)"
        ], 
        "date": "2008-01-16T09:07:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            "Zest and juice of 1 lemon", 
            "3 cloves garlic, minced", 
            "1 1/2 teaspoon kosher salt", 
            "3/4 teaspoon paprika", 
            "1/4 teaspoon hot smoked paprika, plus more to taste", 
            "1 1/2 teaspoons dried oregano, crumbled", 
            "Freshly ground black pepper", 
            "10 boneless, skinless chicken thighs (about 3 pounds)", 
            "2 cups (554 grams) plain, unsweetened Greek yogurt", 
            "1 hothouse, English or seedless cucumber, unpeeled (about 1 pound)", 
            "2 tablespoons freshly squeezed lemon juice", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon minced fresh dill", 
            "2 medium cloves garlic, minced", 
            "1 1/2 teaspoons kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "1 head romaine lettuce, chopped", 
            "1 red onion, thinly sliced", 
            "About 1 pound small-medium tomatoes, chopped", 
            "1 hothouse, English or seedless cucumber, chopped", 
            "4 large pitas (intending 1/2 per person) or more as needed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/chicken-gyro-salad1.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Cucumber", 
            "Greek", 
            "Greens", 
            "Grilling", 
            "Onions", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/05/chicken-gyro-salad/", 
        "title": "chicken gyro salad", 
        "directions": [
            "Prepare the chicken: Combine all ingredients in a large freezer bag. Rub all around, coating chicken as evenly as possible. Let marinate for 20 minutes or up to 24 hours, whatever time you have.\nMake tzatziki: Place the yogurt in a medium bowl. Quarter your cucumber lengthwise and cut out the seeded area. Coarsely grate your cucumber onto a clean dishcloth and wring it out as well as you can. All of that liquid makes for a soggy sauce. Add wrung-out cucumber to yogurt bowl along with lemon, vinegar, dill, garlic, salt and pepper and stir to combine. Taste and adjust seasonings. Chill until needed.\nPrepare salad components: Arrange lettuce, onion, tomatoes and cucumbers on a platter. If desired, toss onion with a squeeze of lemon and/or dash or two of vinegar and salt so that it mellows/lightly pickles while it rests.\nCook chicken: Heat your grill to high heat or a grill pan to medium-high. Remove chicken from marinade and grill on first side until dark lines appear, about 5 minutes, then flip and grill for 3 minutes more on second side. Cooking times will vastly range by the thickness and coldness of your chicken, as well as variations between grills. Transfer cooked chicken to a cutting board, let rest for a couple minutes while you quickly heat/toast your pitas on the grill.\nCut chicken into thin strips. Cut pitas into wedges. Add to platter with vegetables and let everyone dig in. Repeat all summer."
        ], 
        "date": "2016-05-31T12:01:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup gold tequila", 
            "1 cup freshly squeezed lime juice (5 to 6 limes)", 
            "1/2 cup freshly squeezed orange juice (2 oranges)", 
            "1 tablespoon chili powder", 
            "1 tablespoon minced fresh jalapeno pepper (1 pepper seeded)", 
            "1 tablespoon minced fresh garlic (3 cloves)", 
            "2 teaspoons kosher salt", 
            "1 teaspoon freshly ground black pepper", 
            "3 whole (6 split) boneless chicken breasts, skin on*", 
            "Combine the tequila, lime juice, orange juice, chili powder, jalapeno pepper, garlic, salt, and pepper in a large bowl. Add the chicken breasts. Refrigerate overnight. ", 
            "1 cup green onions, coarsely chopped", 
            "1/4 cup red wine vinegar", 
            "2 serrano chiles", 
            "2 tablespoons mayonnaise", 
            "Salt and pepper", 
            "1/2 cup pure olive oil", 
            "1 head purple cabbage, finely shredded", 
            "1 small red onion, halved and thinly sliced", 
            "1/4 cup chopped cilantro leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chicken-jealousy1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Chicken", 
            "Citrus", 
            "Photo", 
            "Salad", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2007/04/chicken-jealousy/", 
        "title": "tequila lime chicken + green onion slaw", 
        "directions": [
            "Blend green onions, vinegar, chiles, mayonnaise, salt, pepper and oil in a blender until emulsified. Place cabbage and red onions in a bowl, add the dressing and stir until combined. Fold in the cilantro and season with salt and pepper to taste.  "
        ], 
        "date": "2007-04-26T16:21:34+00:00"
    }, 
    {
        "ingredient_list": [
            "For the Pickled Onions: ", 
            "1/2 cup red wine vinegar (I swapped half with white vinegar; I was feeling stingy with my fancy red wine stuff)", 
            "1/2 cup cold water", 
            "2 tablespoons kosher salt (updated: 1 heaped tablespoon is a better amount here)", 
            "1 tablespoon sugar", 
            "2 to 3 really good shots hot sauce", 
            "1 red onion, sliced into very thin rings", 
            "For the Chicken Milanese: ", 
            "1 cup all-purpose flour", 
            "2 eggs, beaten with 1 tablespoon of water", 
            "1 1/2 cups panko bread crumbs", 
            "1/2 cup grated pamesan", 
            "4 small boneless, skinless chicken breasts, butterflied and lightly pounded/flattened (no need to tenderize; a good organic chicken breast will already be tender, says Burrell) to 1/4-inch thick*", 
            "Kosher salt and pepper", 
            "Extra-virgin olive oil, for frying", 
            "For the Escarole Salad:", 
            "1/2 cup grated pecorino romano", 
            "1/2 cup toasted hazelnuts", 
            "2 tablespoons freshly chopped parsley leaves", 
            "1 head escarole, washed, spun dry, cut into bite size pieces", 
            "High-quality extra-virgin olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/chicken-milanese-and-a-escarole-salad.jpg?w=753", 
        "tags": [
            "Chicken", 
            "Escarole", 
            "Greens", 
            "Italian", 
            "Photo", 
            "Pickled", 
            "Salad", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2009/01/chicken-milanese-an-escarole-salad/", 
        "title": "chicken milanese + an escarole salad", 
        "directions": [
            "Make the pickled red onions: In a small bowl, combine red wine vinegar with 1/2 cup of cold tap water. Stir in salt, the sugar and the hot sauce. Add the sliced onions and let sit for at least one hour. [Do ahead: We made these the night before to save time; they were even better pickled overnight.]", 
            "Make the chicken milanese: Set up a standard breading procedure in three wide deep plates. Fill one with flour, one with the beaten eggs, and one with the panko and grated cheese. Season the chicken breasts with salt and pepper. Using one hand for dry things and one hand for wet things, take each piece of chicken through the breading procedure: dredge lightly in the flour, then the egg wash and then through the bread crumbs. Lay the breaded chicken on a sheet tray and refrigerate for at least one hour. [Do ahead: You could even prep these the night before, to save time. Cover them loosely with plastic wrap in the fridge.]", 
            "Pour olive oil into a large saute pan until it reaches a thickness of about a half an inch – better a little more rather than a little less. Bring to a medium-high heat. Test the oil by flicking flour or bread crumbs into the oil. If it doesn’t sizzle, wait! When the oil is hot, test it again by dipping the edge of a piece of chicken into the oil, the oil should gently sizzle. Cook the chicken in the oil in batches on both sides until it is a lovely golden brown color and is crispy, about four to five minutes on the first side and three to four minutes on the second. Do not crowd the pan or the chicken will become very greasy and soggy. When the chicken comes out of the oil lay it on paper towels to drain off the excess oil and sprinkle with salt. [Do ahead: You can keep the chicken in a low oven to keep it warm while the rest of the chicken is cooking. I did this to hold it until we were ready to eat.]", 
            "Make the escarole salad: Combine the romano, hazelnuts and parsley in the food processor and pulse until they are coarsely chopped. Toss together the escarole, hazelnut mixture and some of the pickled red onions and dress with some of the pickling liquid and olive oil. Season with salt and pepper.", 
            "Place chicken on each serving plate and top with the escarole salad.", 
            "* Tiny kitchen tip! My makeshift setup since I don’t have one of those mallet things was to lay the breasts out on a cutting board, cover them with plastic and thwack away at them with a small, heavy saucepan. It worked great! And I had one less gadget to buy."
        ], 
        "date": "2009-01-24T19:16:33+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large red peppers, roasted and skinned (great directions over here, if you’re new to this)", 
            "3 cups of cooked chickpeas, rinsed if canned (about 2 15-ounce cans)", 
            "1/4 cup of parsley, chopped", 
            "2 tablespoons of chopped mint", 
            "3 tablespoons of capers, rinsed", 
            "2 tablespoons of fresh lemon juice or red wine or sherry vinegar", 
            "1/4  teaspoon of salt", 
            "2 cloves of garlic, minced", 
            "4 tablespoons of extra virgin olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chickpea-salad-with-roasted-red-peppers1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/11/chickpea-salad-with-roasted-red-peppers/", 
        "title": "chickpea salad with roasted red peppers", 
        "directions": [
            "Cut the peppers into half-inch wide strips and put them in a large bowl together with the chickpeas, herbs and the capers. In a smaller bowl, whisk together the lemon juice, salt, garlic and oil. Pour over the chickpea mixture and combine.Serve immediately, or refrigerate it for a day to get the flavors to mingle fantastically.", 
            "This is a great make-ahead dish for weekday lunches. It would also be wonderful on a pile of torn lettuce, served with toasted pita wedges."
        ], 
        "date": "2008-11-14T23:57:05+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups chopped or balled melon (from about 1 cantaloupe or honeydew, or 1/4 a large watermelon)", 
            "Juice of half a lime, divided, plus more to taste", 
            "Coarse salt, to taste", 
            "1/2 to 1 teaspoon chili powder", 
            "3 tablespoons crumbled cotija cheese", 
            "1 tablespoon toasted pepitas (I like the salty ones)", 
            "1 tablespoon chopped fresh cilantro, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_4945.jpg?w=750", 
        "tags": [
            "Cantaloupe", 
            "Honeydew", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Tex-Mex", 
            "Vegetarian", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2016/08/chile-lime-melon-salad/", 
        "title": "chile-lime melon salad", 
        "directions": [
            "Place melon in a wide bowl or on a platter. Squeeze half lime juice over, adding second half to taste, then sprinkle with salt and chili powder. Scatter with cheese, pepitas and cilantro and dig in.", 
            "Do ahead: I’d expected this salad not to keep at all but we found it just fine (with no watery run-off) after 2 hours in the fridge. I wouldn’t keep it assembled too much longer, though. You don’t want the salt to draw the juices out of the fruit before you eat it, and it’s quick enough to put together at the last minute.\n"
        ], 
        "date": "2016-08-09T11:39:50+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups chopped, crunchy vegetables", 
            "1/2 cup (2 ounces) crumbled feta, queso fresco or ricotta salata", 
            "2 scallions, thinly sliced", 
            "1/3 cup well-toasted sunflower seeds, salted or unsalted", 
            "2 tablespoons fresh lime juice", 
            "2 tablespoons olive oil", 
            "1/4 teaspoon coarse or Kosher salt, plus more to taste", 
            "1/4 teaspoon chile powder or 1/8 teaspoon each your choice combination of chile powder, cumin, cayenne or sumac", 
            "Freshly ground black pepper, to taste", 
            "1 to 2 tablespoons thinly sliced fresh mint leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/06/7463002884_41ea1ca04d_o.jpg?w=750", 
        "tags": [
            "Beans", 
            "Citrus", 
            "Cucumber", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Radishes", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/06/chopped-salad-with-feta-lime-and-mint/", 
        "title": "chopped salad with feta, lime and mint", 
        "directions": [
            "Mix the vegetables, feta, scallions, seeds and mint in a medium bowl. Whisk lime juice, olive oil, salt, spice and black pepper in a small dish and pour over vegetables, tossing to evenly coat. Adjust with more salt or pepper as needed. Garnish with mint and crunch-crunch-crunch away!"
        ], 
        "date": "2012-06-29T07:38:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound Campari or plum tomatoes, diced, drained", 
            "1 1/2 cups diced seeded watermelon", 
            "1 large green bell pepper, seeded, cut into 1/3-inch cubes", 
            "1/2 large English hothouse cucumber, seeded, cut into 1/3-inch cubes", 
            "1/2 cup very thinly sliced radishes", 
            "3 tablespoons olive oil, divided", 
            "10 ounces feta cheese, cut into small cubes (about 2 1/2 cups),", 
            "2 divided green onions, chopped, divided", 
            "1/4 cup thinly sliced fresh mint leaves, divided", 
            "1/2 cup plain Greek-style yogurt", 
            "1 teaspoon dried oregano"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2653761539_5d0fcda7de_b.jpg?w=750", 
        "tags": [
            "Fruit", 
            "Peppers", 
            "Photo", 
            "Radishes", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2008/07/chopped-vegetable-watermelon-and-feta-salad/", 
        "title": "chopped vegetable, watermelon and feta salad", 
        "directions": [
            "Toss first five ingredients and two tablespoons oil in large bowl. Add half each of cheese, green onions, and mint. Mix remaining cheese, green onions, mint, and oil in processor; add yogurt and oregano. Process just to blend (do not over-mix or dressing will get thin). Season dressing with salt and pepper; mix into salad."
        ], 
        "date": "2008-07-10T12:36:51+00:00"
    }, 
    {
        "ingredient_list": [
            "Dressing (Heads up: I found I only needed half of this)", 
            "3/4 cup canola oil", 
            "1/4 cup extra-virgin olive oil", 
            "1/4 cup red wine vinegar", 
            "1 tablespoon fresh lemon juice", 
            "3/4 teaspoon dry mustard", 
            "1/2 teaspoon Worcestershire", 
            "1/4 teaspoon sugar", 
            "1 clove garlic, minced", 
            "Kosher salt and freshly ground black pepper, to taste", 
            "Salad", 
            "1/2 head iceberg lettuce, cored and shredded", 
            "1/2 head romaine lettuce, chopped", 
            "1/2 bunch watercress, some of the stems trimmed, chopped", 
            "2 ounces blue cheese, crumbled (we used a Stilton)", 
            "6 strips cooked bacon, roughly chopped", 
            "3 hard-boiled eggs, peeled and cut into 1/2-inch cubes", 
            "2 medium tomatoes, peeled*, seeded, and cut into 1/2-inch cubes", 
            "1 boneless skinless chicken breast, cooked and cut into 1/2-inch cubes", 
            "1 avocado, peeled, pitted, and cut into 1/2-inch cubes", 
            "Kosher salt and freshly ground black pepper, to taste", 
            "2 tablespoons chives, minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/classic-cobb-salad.jpg?w=752", 
        "tags": [
            "Avocado", 
            "Eggs", 
            "Photo", 
            "Salad", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2010/04/classic-cobb-salad/", 
        "title": "classic cobb salad", 
        "directions": [
            "Make the dressing: Combine the canola oil, olive oil, vinegar, lemon juice, mustard, Worcestershire, sugar, and garlic in a blender. Purée the ingredients to make a smooth dressing and season with salt and pepper. Set the dressing aside.", 
            "Make the salad: On a (very) large platter, combine the iceberg and romaine lettuces along with the watercress. Arrange the blue cheese, bacon, eggs, tomatoes, chicken, and avocado on top of the greens in neat rows. To serve, drizzle salad with dressing, season with salt and pepper, and top with chives. Alternatively, toss everything together in a bowl.", 
            "Do ahead: Salad dressing keeps, covered and refrigerated, for up to one week. Individual ingredients (except the avocado, which is too prone to browning) can be prepped and chopped, and kept in separate containers in the fridge until you’re ready to assemble the salad. However, no doubt due to sturdiness of 2/3 of the lettuces, I found that the entire assembled salad kept surprisingly well wrapped in plastic in the fridge for a few hours.", 
            "* To peel a tomato: Cut an X in bottom of each tomato and blanch in a large pot of boiling water for 10 seconds. Immediately transfer with a slotted spoon to an ice bath to cool. Slide the skins right off, starting at the X. Completely befuddled by the need for this step? Skip it."
        ], 
        "date": "2010-04-14T22:13:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 recipe Crispy Corn Bread (below) or 3 cups of 1-inch cornbread cubes", 
            "1 1/2 pounds ripe tomatoes (4 to 6 medium)", 
            "6 cups roughly torn sturdy fresh lettuce, such as Bibb, butter or Boston", 
            "2 cups bitter greens, such as arugula or dandelion greens", 
            "1 large Vidalia onion, trimmed, peeled, sliced crosswise as thinly as possible and separated into rings", 
            "1 recipe Buttermilk-Lime Dressing (below)", 
            "3/4 cups whole or lowfat buttermilk (whole preferred)", 
            "5 tabespoons freshly squeezed lime juice (they say from 3 to 4 limes; I only needed 1 1/2)", 
            "2 tablespoons olive oil", 
            "1 tablespoon apple cider vinegar (optional, this was my addition to give it more zing)", 
            "1 tablespoon honey", 
            "1/4 cup finely minced fresh basil", 
            "1/4 cup finely minced fresh flat-leaf parsley", 
            "1/4 cup finely minced green onios", 
            "1/2 teaspoon salt, plus more to taste", 
            "1 tablespoon lard or unsalted butter", 
            "1 1/2 cups stone-ground cornmeal", 
            "1 teaspoon baking powder", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "1 teaspoon sugar", 
            "1 large egg", 
            "1 1/2 cups whole or lowfat buttermilk (whole is preferred, here’s how you can make your own)", 
            "2 tablespoons unsalted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/corn-bread-salad1.jpg?w=500", 
        "tags": [
            "Arugula", 
            "Herbs", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2009/09/corn-bread-salad/", 
        "title": "corn bread salad", 
        "directions": [
            "Preheat the oven to 450°F. Grease a 12-inch skillet with one tablespoon of the lard or butter, leaving any excess in the pan, and place it in the oven.", 
            "In a large bowl, whisk the dry ingredients together. In a medium bowl, whisk the egg until frothy and then whisk in the buttermilk. Add the wet ingredients to the dry ones and mix thoroughly. Melt the remaining butter in a small skill (or your microwave) and whisk the butter into your batter.", 
            "While the fat in the large skillet is smoking, carefully remove the skillet from the oven and swirl the fat around to coat the bottom and sides evenly. Pour the batter into the skillet; it should “sizzle alluringly”, says the Lee Brothers. Bake for 15 minutes, or until the top of the bread is golden brown and the edge has pulled away from the side of the skillet. Remove from the oven and either serve hot, in six wedges, or let cool and reserve for Corn Bread Salad (above)."
        ], 
        "date": "2009-09-04T11:15:52+00:00"
    }, 
    {
        "ingredient_list": [
            "4 thick slices of bacon (4 ounces), cut crosswise 1/2 inch thick", 
            "1 pound Yukon gold potatoes, peeled and cut into 1/2-inch dice", 
            "2 red bell peppers, cut into 1/2-inch dice, although I made mine smaller", 
            "6 large or 8 medium ears of corn, kernels removed (I used 8 large and it was a massive salad)", 
            "1 medium red onion, thinly sliced", 
            "1/4 cup cider vinegar", 
            "Salt and crushed red pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/08/corn-chowder-salad1.jpg?w=640", 
        "tags": [
            "Corn", 
            "Peppers", 
            "Photo", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/08/corn-chowder-salad/", 
        "title": "corn chowder salad", 
        "directions": [
            "Cook bacon: In a large frying pan, cook the bacon over moderately low heat, stirring a few times, until it is crisp, about 5 to 10 minutes. Using a slotted spoon, transfer the bacon to paper towels and let drain.", 
            "Fry potatoes, peppers and corn: Pour off all but 3 tablespoons of the bacon fat in the skillet. Add the potatoes and cook over moderately high heat until they start to brown, about about 3 to 6 minutes. Stir and cook for about 2 minutes longer, until almost tender; they’ll finish cooking with the other vegetables. Add the diced red peppers and cook, stirring occasionally, until the potatoes and peppers are tender, about 5 minutes. Add the corn kernels and cook, stirring, until heated through but still crisp, about 3 minutes.", 
            "Assemble and serve: Transfer the vegetables to a large bowl and stir in the onion, cider vinegar and bacon. Season with red pepper and salt to taste. Serve warm, or at room temperature."
        ], 
        "date": "2015-08-31T11:23:49+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups cubed (1/2 inch) cooked chicken (about 1 3/4 lb) (I like to brine mine first, then poach it in water for 15 to 20 minutes because I am completely neurotic about chicken getting dried out in any way.)", 
            "1 cup walnuts, toasted and chopped", 
            "1 celery rib, diced into small bits (1 cup)", 
            "2 or more tablespoons finely chopped shallot", 
            "1 cup dried cranberries", 
            "2/3 to 3/4 cup mayonnaise", 
            "3 tablespoons tarragon vinegar, if you have it, or champagne or white wine vinegar works well, too", 
            "2 tablespoons finely chopped fresh tarragon or herb or your choice", 
            "1/2 teaspoon salt", 
            "1/2 teaspoon black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/10/cranberry-walnut-chicken-salad.jpg?w=753", 
        "tags": [
            "Chicken", 
            "Lunch", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/10/cranberry-walnut-chicken-salad/", 
        "title": "cranberry-walnut chicken salad", 
        "directions": [
            "Really complicated directions: Toss together all ingredients in a large bowl until combined well.", 
            "I like to eat mine on top of chopped Romaine lettuce, or with toasted pocketless pita wedges.", 
            "Variations: Are almost endless, but this is particularly good with leftover Thanksgiving turkey and chopped pecans."
        ], 
        "date": "2008-10-15T01:00:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds fresh peas in pods or about 1 1/2 cups already shelled or frozen and defrosted", 
            "1/4 cup plain yogurt", 
            "2 tablespoons tahini (sesame seed paste)", 
            "1 tablespoon lemon juice", 
            "2 tablespoons water", 
            "1/4 teaspoon ground cumin", 
            "1/4 teaspoon paprika, smoked if you have it", 
            "1/4 teaspoon salt", 
            "1 scallions, thinly sliced", 
            "Toasted pitas, cut into wedges, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/4682924368_cce5a4dd30_o.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Peas", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/06/crushed-peas-with-smoky-sesame-dressing/", 
        "title": "crushed peas with smoky sesame dressing", 
        "directions": [
            "Cook peas: Have ready a colander and an ice bath, and bring a medium pot of lightly salted water to a boil. Blanche peas for 30 seconds (if you like them with a real residual snap) to 1 minute (for a slightly more yielding pea) and drain them, then immediately shocking them in the ice water. Drain the peas again and pat them dry on a large towel.", 
            "Crush peas:  Using a potato or egg-masher (and hopefully not an annoying one like mine, with holes the exact size of peas!), muddler or meat pounder (be gentle!), lightly crush the peas. Aim for mixed textures, some left whole, most in halves and a few a little more broken up. Put them in a large bowl.", 
            "Make dressing:  Whisk together tahini, yogurt, lemon juice, water, cumin, paprika and salt. You might be tempted, as I was, to swap the water with olive oil but don’t do it — it makes a horrible curdled mess you will be sad to have to toss.", 
            "Assemble: Mix peas with about 3 tablespoons of the dressing, to start, then add more to taste. Sprinkle with scallions. Heap pea mixture on toasted pita wedges."
        ], 
        "date": "2010-06-11T11:56:25+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 to 1 pound fresh mozzarella, diced into 1/2-inch cubes", 
            "1 pound peak-season tomatoes (I prefer roma for this because they’re less wet, but other varieties also work), diced into 1/2-inch cubes", 
            "1 15-ounce can white beans, drained and rinsed or 1 3/4 cups white beans that you’ve cooked fresh", 
            "1/4 cup pesto (or a handful of slivered basil plus 1/4 cup olive oil)", 
            "3 to 4 tablespoons red wine vinegar", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cubed-hacked-caprese1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Gluten-Free", 
            "Photo", 
            "Salad", 
            "Side Dish", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2009/08/cubed-hacked-caprese/", 
        "title": "cubed, hacked caprese", 
        "directions": [
            "Mix and season and then reseason again to adjust to your taste. Eat at once or keep it in the fridge up to a few days (really, it will depend on how fresh your mozzarella is; the made-daily stuff is only good for a day or two, most others will last nearly a week)."
        ], 
        "date": "2009-08-24T22:03:04+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (227 grams) plain, full-fat yogurt", 
            "1 garlic clove, peeled", 
            "1-inch piece of fresh ginger, peeled", 
            "1/4 teaspoon granulated sugar", 
            "Juice of half a lemon (about 2 tablespoons)", 
            "1 tablespoon minced mild or hot fresh chile (I used a jalapeno)", 
            "1 teaspoon cumin seeds, black or yellow mustard seeds or nigella seeds (I used black mustard seeds)", 
            "2 tablespoons chopped mint leaves, divided", 
            "2 tablespoons chopped cilantro leaves, divided", 
            "Kosher salt to taste", 
            "2 long, English-style cucumbers (2 pounds total)", 
            "1 cup cherry or grape tomatoes, diced", 
            "1/2 medium red onion, chopped small"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/cucumber-yogurt-raita-salad1.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Indian", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/05/cucumber-yogurt-raita-salad/", 
        "title": "cucumber yogurt raita salad", 
        "directions": [
            "\nMake the dressing by placing yogurt in a medium bowl and using a very fine grater to grate the garlic and ginger over it. Stir in sugar, lemon, chile, seeds, half of the mint and cilantro and season it with salt to taste. Set aside until you’re ready to serve the salad.\nCut the cucumbers in half lengthwise, then each half three more times into long wedge-shaped pieces (i.e. 8 long pieces per cucumber). Cut them into 1 to 1 1/2-inch lengths on a diagonal and add them to a big bowl. Pile tomatoes and onion on top and when you’re ready to eat, mix half of the dressing with the salad. Sprinkle with remaining mint and cilantro and serve with extra yogurt dressing on the side."
        ], 
        "date": "2016-05-26T11:49:16+00:00"
    }, 
    {
        "ingredient_list": [
            "1 to 1 1/4 pounds red cabbage (1 small head or half of a large one), sliced very thin", 
            "3 tablespoons olive oil", 
            "2 tablespoons lime or lemon juice (I use lime)", 
            "Salt and red pepper flakes (I used the mild Aleppo variety) to taste", 
            "About 1/2 cup pitted dates, coarsely chopped or sliced", 
            "4 ounces feta, crumbled into chunks", 
            "1 tablespoon chopped flat-leaf parsley", 
            "2 teaspoons well-toasted sesame seeds "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-feta-and-red-cabbage-salad1.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Dates", 
            "Fall", 
            "Gluten-Free", 
            "Photo", 
            "Salad", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/11/date-feta-and-red-cabbage-salad/", 
        "title": "date, feta and red cabbage salad", 
        "directions": [
            "Toss cabbage with olive oil and first tablespoons of lime juice, plus salt and pepper, coating leaves evenly. Taste and add more lime juice, salt and pepper to taste. I do this a few times, making sure I really get this base well seasoned because it will be hard to do it as well later.", 
            "Toss dressed cabbage gently with half of dates and feta. Sprinkle with remaining dates, then feta, then parsley and sesame seeds. Dig in.", 
            "Do ahead: The whole salad can sit assembled for at least an hour, if not longer in the fridge. Mine is going strong on the second day. You can also prepare the parts separately (feta, chopped dates, sliced cabbage) to assemble right before serving, if you’re planning ahead for Thanksgiving or a dinner party."
        ], 
        "date": "2015-11-10T12:01:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 lb green cabbage, cored and cut into 3-inch chunks, then finely chopped or shredded", 
            "1 medium onion, finely chopped", 
            "1 large green bell pepper, finely chopped", 
            "1 large carrot, coarsely grated", 
            "1 1/4 cups mayonnaise", 
            "1/3 cup cider vinegar", 
            "2 teaspoons sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/06/dead-simple-slaw.jpg?w=750", 
        "tags": [
            "Budget", 
            "Cabbage", 
            "Photo", 
            "Round-Up", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/06/dead-simple-slaw-6-heat-wave-reprieves/", 
        "title": "dead simple slaw + 6 heat wave reprieves", 
        "directions": [
            "Toss all vegetables in a large bowl with 1 tsp each of salt and pepper. Whisk together mayonnaise, vinegar, and sugar, then toss with slaw. Chill, covered, stirring occasionally, at least 1 hour (for vegetables to wilt and flavors to blend).", 
            "Do ahead: Slaw can be chilled up to 1 day."
        ], 
        "date": "2008-06-10T11:05:48+00:00"
    }, 
    {
        "ingredient_list": [
            "For pork", 
            "1 pound solid piece boneless pork butt (shoulder) or pork tenderloin", 
            "1/4 cup hoisin sauce", 
            "1/4 cup soy sauce (low-sodium is best here)", 
            "1/4 cup Chinese rice wine or sake", 
            "1 tablespoon finely chopped peeled fresh ginger", 
            "1 teaspoon finely chopped garlic", 
            "1/2 teaspoon salt (see Note below)", 
            "For dressing", 
            "3/4 cup seasoned rice vinegar", 
            "1/2 cup peanut or vegetable oil**", 
            "3 tablespoons fresh lime juice", 
            "3 tablespoons finely grated peeled fresh ginger", 
            "1 large fresh jalapeno chile, seeded and minced", 
            "For salad", 
            "8 oz very thin bean-thread noodles (also known as cellophane, glass, or mung bean noodles)", 
            "3/4 lb Chinese long beans (1 bunch) or green beans, trimmed and cut into 3-inch pieces", 
            "1 seedless cucumber (usually plastic-wrapped; about 1 lb), halved lengthwise and sliced diagonally 1/8 inch thick", 
            "1 bunch scallions, cut into matchsticks", 
            "1 firm-ripe mango, peeled, pitted, and thinly sliced", 
            "2 thin carrots, cut into 1/8-inch-thick matchsticks", 
            "1/2 cup loosely packed fresh cilantro leaves", 
            "1/2 cup loosely packed fresh mint leaves", 
            "1/2 cup loosely packed fresh small basil leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/05/cellophane-noodle-salad-with-roast-pork.jpg?w=753", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Salad", 
            "Vietnamese"
        ], 
        "url": "https://smittenkitchen.com/2007/05/deb-1-mandoline-0/", 
        "title": "cellophane noodle salad with roast pork", 
        "directions": [
            "Prepare pork:  Cut pork along the grain into long 1 1/2- to 2-inch-wide strips. Remove and discard any sinew but do not trim fat. Transfer pork to a large sealable plastic bag. Stir together remaining pork ingredients in a small bowl until combined well. Add to pork and turn to coat, then squeeze bag to eliminate as much air as possible and seal. Marinate pork, chilled, at least 4 hours but no longer than 24.", 
            "Roast pork: Put oven rack in lower third of oven and preheat oven to 375°F. Put 1/2 inch water in a 13- by 9-inch roasting pan and place a metal rack across top of pan (rack should not touch water). ", 
            "Remove pork from marinade, reserving marinade, and arrange pork strips 1 inch apart on rack. Roast in oven 15 minutes.", 
            "Meanwhile, bring marinade to a boil in a 1-quart saucepan, then boil 1 minute (marinade may look curdled). Remove from heat.", 
            "Brush both sides of pork with some marinade and roast 10 minutes more. Generously brush both sides of pork with marinade again and roast, basting 2 or 3 times, 10 minutes more. I recommend brushing it as many times as it takes to use the marinade up; you won’t regret it.", 
            "Increase oven temperature to 400°F and roast pork until strips are mahogany-colored and caramelized on edges, 10 to 15 minutes more (pork shoulder will need the most time, tenderloin the least; totally cooking time will be about 50 minutes). Transfer to a cutting board and let stand, loosely covered with foil, 10 minutes.", 
            "Make dressing while pork roasts:  Blend together all dressing ingredients in a blender until smooth. (See Note below about an alternate dressing.)", 
            "Cook noodles and beans while pork finishes roasting: Soak noodles in cold water to cover until pliable, about 15 minutes, then drain in a colander. Cut noodles in half with kitchen shears.", 
            "Cook beans in a 5- to 6-quart pot of boiling salted water, uncovered, until crisp-tender, 4 to 5 minutes. Transfer with a skimmer or slotted spoon to a large bowl of ice and cold water to stop cooking, reserving cooking liquid in pot. Drain beans and pat dry.", 
            "Return bean-cooking liquid to a boil, then cook noodles, uncovered, stirring occasionally, until just tender, about 2 minutes. Drain noodles in colander and rinse under cold water to stop cooking. Drain noodles again, then spread out on paper towels and pat dry.", 
            "Assemble salad:  Cut as much pork as desired for salad across the grain into 1/4-inch-thick slices. Toss noodles with 1/4 cup dressing in a bowl. Toss long beans with 2 tablespoons dressing in another bowl. Arrange pork, noodles, beans, and remaining salad ingredients on a large platter. Drizzle with some of dressing and serve remaining dressing on the side.", 
            "Many notes (Updated 1/10/14):"
        ], 
        "date": "2007-05-21T12:37:19+00:00"
    }, 
    {
        "ingredient_list": [
            "6 tablespoons distilled white vinegar", 
            "4 teaspoons coarse kosher salt", 
            "2 1-pound English (also sold as hothouse or seedless) cucumbers, very thinly sliced", 
            "A few branches plus 3 tablespoons chopped fresh dill", 
            "3 1/4 pounds Yukon Gold potatoes (about 10 medium), unpeeled", 
            "Additional coarse kosher salt", 
            "1 cup very thinly sliced white onion", 
            "8 radishes, trimmed, thinly sliced", 
            "3/4 cup mayonnaise"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/06/dilled-potato-and-pickled-cucumber-salad.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Photo", 
            "Pickled", 
            "Potatoes", 
            "Radishes", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/06/dilled-potato-and-pickled-cucumber-salad/", 
        "title": "dilled potato and pickled cucumber salad", 
        "directions": [
            "The day before, make pickles: Pour vinegar and 4 teaspoon salt into gallon-size resealable plastic bag and swish around to combine. Add cucumbers and dill branches; turn several times to coat with mixture. Refrigerate overnight. If and when you pop into the fridge, turn the bag to keep things well mixed.", 
            "Cook your potatoes: Although you don’t have to, I also like to boil my potatoes the day before, because I like them very cold, and it seems easier to get it out of the way. Boil them in a large pot salted water until tender, about 30 minutes. Drain, then cool completely. I leave them in the fridge overnight.\nThe next day: Drain cucumber mixture in a colander; if you’ve got an hour, you can drain it that long, but I never do. Discard brine and dill.\nAssemble your salad: The original directions called for peeling your cold potatoes but I never do. Cut potatoes crosswise into 1/2-inch-thick slices. Place potatoes in large bowl; sprinkle generously with coarse salt and pepper. Add drained cucumbers, onion, sliced radishes, and remaining 3 tablespoons dill; toss to blend.\n1 to 2 hours before serving: Stir mayonnaise into salad to taste. Season with additional salt and pepper. Serve cold or at room temperature.\nDo ahead: Salad keeps dressed for a day. Salad keeps without mayo for a few days; I add mayo before serving. In both cases, keep it covered in the fridge."
        ], 
        "date": "2007-06-20T09:41:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup white wine vinegar", 
            "1/4 cup water", 
            "2 teaspoons Kosher salt (you can go up to 1 tablespoon if using the lighter weight Diamond brand; here’s why)", 
            "1 1/2 teaspoons granulated sugar", 
            "2 stalks celery, trimmed, diced tiny", 
            "4 large eggs", 
            "1 heaped teaspoon whole-grain Dijon", 
            "2 teaspoons minced shallot or red onion (or more to taste)", 
            "2 tablespoons mayonnaise or full-fat plain yogurt", 
            "Salt and freshly ground pepper to taste", 
            "Chopped flat-leaf parsley or fresh dill (to garnish, optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/02/egg-salad-with-pickled-celery-and-coarse-dijon.jpg?w=750", 
        "tags": [
            "Celery", 
            "Eggs", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/02/egg-salad-with-pickled-celery-and-coarse-dijon/", 
        "title": "egg salad with pickled celery and coarse dijon", 
        "directions": [
            "Pickle your celery: Combine vinegar, water, Kosher salt and sugar in a jar and shake it until the salt and sugar dissolve. Add diced celery to jar, cover it and place in the fridge for at least 30 minutes, ideally one hour and up to one week.", 
            "Cook your eggs: Place eggs in a saucepan and cover with an inch of cold water. Bring to a boil over high heat, and once boiling, reduce the heat to medium and set your timer for 10 minutes (for perfectly cooked through eggs), or 9 minutes (if you like them just-barely-set in the center, like mine above). Once the timer rings, drain eggs and rinse under cold water to stop cooking. To quickly chill them so you can use them right away, cover them in ice water for 10 to 15 minutes.", 
            "Make your salad: Peel your eggs and chop them, placing them in a medium bowl. Add 1 heaped tablespoon of pickled celery (more to taste), Dijon, shallot, mayo, salt and pepper and mix. Season to taste with salt and pepper. Serve on toasted whole grain bread, garnished with fresh herbs. "
        ], 
        "date": "2013-02-05T11:35:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium eggplant, about 3/4 pound, cut into 1/2-inch cubes", 
            "2 tablespoons olive oil plus additional for oiling baking sheet", 
            "1/4 teaspoon salt", 
            "Black pepper", 
            "1 teaspoon red wine vinegar", 
            "1/4 cup crumbled crumbled feta", 
            "1 scallion, thinly sliced", 
            "8 1/2-inch slices of baguette, brushed with olive oil (I used 1-inch slices in the photos, then decided they were too thick)", 
            "1 small clove garlic, peeled and halved"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/eggplant-salad-toasts1.jpg?w=500", 
        "tags": [
            "Eggplant", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/08/eggplant-salad-toasts/", 
        "title": "eggplant salad toasts", 
        "directions": [
            "Preheat oven to 425 degrees. Lightly oil a baking sheet or roasting pan. Toss eggplant, 2 tablespoons olive oil, salt and a generous amount of black pepper together in a medium bowl until evenly coated. Spread on prepared baking sheet and roast for about 25 minutes, moving pieces around occasional so they evenly brown. For a cold salad, let the eggplant cool a bit before mixing it with red wine vinegar, feta and scallion. For a warm salad where the feta glues itself to the eggplant a bit, toss the vinegar, feta and scallion together when the eggplant just comes out of the oven. You’ll want to eat the warm salad quickly.", 
            "Broil or toast baguette slices then rub them with a garlic clove before heaping on eggplant salad. "
        ], 
        "date": "2010-08-21T13:25:20+00:00"
    }, 
    {
        "ingredient_list": [
            "2 teaspoons fennel seeds, toasted", 
            "1/4 cup olive oil", 
            "3 tablespoons fresh lemon juice", 
            "3 tablespoons finely chopped shallot (1 large)", 
            "1 teaspoon salt", 
            "1/2 teaspoon sugar", 
            "1/2 pound frisée (French curly endive), torn into bite-size pieces (10 cups) [we swapped butter lettuce]", 
            "3 Belgian endives, cut crosswise into 1/2-inch-wide slices [we swapped regular green endives]", 
            "1 bunch of celery ribs, thinly sliced crosswise (1 to 2 cups, depending on the size of your bundle)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/endive-and-celery-salad-with-fennel-vinaigrette1.jpg?w=500", 
        "tags": [
            "Celery", 
            "Endive", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/05/endive-and-celery-salad-with-fennel-vinaigrette/", 
        "title": "endive and celery salad with fennel vinaigrette", 
        "directions": [
            "In addition: Either an electric coffee/spice grinder or exceptional skill crushing spices in a mortar and pestle", 
            "Grind fennel seeds in grinder until ground but not powdery. Transfer to a small bowl or cup, then stir in oil until combined. Let stand 15 minutes.", 
            "Whisk together lemon juice, shallot, salt, and sugar in another small bowl or cup until salt and sugar are dissolved. Stir fennel oil, then add to shallot mixture in a slow stream, whisking until combined.", 
            "Toss lettuces and celery in a large bowl with just enough vinaigrette to coat. Season with black pepper to taste.", 
            "Pairing: I think this salad would be fantastic with maybe some shards of your favorite hard cheese and a poached egg on top, should those of you out there not be at a point in your lives when runny yolks are verboten. (Sniffle.)"
        ], 
        "date": "2009-05-06T15:58:59+00:00"
    }, 
    {
        "ingredient_list": [
            "3 oranges (I used 2 navel and one cara cara orange)", 
            "2 heads of endive", 
            "2 ounces soft goat cheese or chevre, crumbled", 
            "1/3 cup sliced almonds or chopped marcona almonds, well-toasted", 
            "Freshly ground black pepper", 
            "Olive oil for drizzling", 
            "Sherry vinegar", 
            "1 tablespoon minced chives", 
            "Flaky or other sea salt, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/endives-with-oranges-and-almonds1.jpg?w=750", 
        "tags": [
            "Citrus", 
            "Endive", 
            "Gluten-Free", 
            "Orange", 
            "Photo", 
            "Salad", 
            "Spanish", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/endives-with-oranges-and-almonds/", 
        "title": "endives with oranges and almonds", 
        "directions": [
            "Cut the top and bottom off your oranges, exposing the citrus flesh inside. Then, resting on either end, cut the peels, including the white pith, off the oranges. [Set aside for orangettes!] Use your knife to cut between each membrane and orange segment, cutting only so far as the center, which should release the orange segments. You can chop them once or twice more, so the pieces are not too large. ", 
            "Trim end off endives and arrange individual leaves on a medium platter. Add a few orange chunks to each, then goat cheese crumbles and almonds. Season with black pepper, then drizzle with a very thin stream of olive oil. Add a few droplets of sherry vinegar to each “boat.” Scatter chives over and finish each with sea salt. ", 
            "Dig in. No forks needed, unless you’re classy."
        ], 
        "date": "2014-12-15T11:50:02+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup hazelnuts or walnuts", 
            "1 medium-large fennel bulb, leaves and stems trimmed off", 
            "Salt and freshly ground black pepper", 
            "Juice of 1 lemon", 
            "2 large blood oranges", 
            "1 small shallot, peeled and cut into paper-thin slices", 
            "10 mint leaves", 
            "2 tablespoons extra-virgin olive oil", 
            "1 teaspoon lime zest "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/fennel-and-blood-orange-salad1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Fennel", 
            "Orange", 
            "Photo", 
            "Salad", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/02/fennel-and-blood-orange-salad/", 
        "title": "fennel and blood orange salad", 
        "directions": [
            "Place nuts in dry skillet and cook over medium heat, stirring, to toast. Let cool. If using hazelnuts, roll them around in a dishcloth (or, if cool enough, in your hands), discarding any loose skins. Coarsely chop nuts; set aside.", 
            "Slice about 1/2 inch from bottom of fennel and discard. Slice fennel very thinly on a mandonline, benriner or with a knife, starting with flat bottom side. Toss in serving bowl with salt, pepper and lemon juice. ", 
            "Trim all peel and pith from oranges. Holding peeled fruit over bowl containing fennel, use sharp knife to cut sections from membrane and let them drop into bowl. Squeeze remaining membrane over bowl to sprinkle salad with remaining juice, and discard membrane.Add shallots, mint leaves, olive oil and reserved nuts and toss gently. Sprinkle with lime zest. ", 
            "Do ahead: While the mint leaves will look and taste best on the first day, I really enjoyed the leftovers from this salad for lunch the next day."
        ], 
        "date": "2014-02-03T11:37:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups very thinly sliced fennel bulb", 
            "3 tablespoons extra-virgin olive oil, divided", 
            "1/4 teaspoon coarse kosher salt", 
            "6 cups arugula (about 4 ounces)", 
            "1 cup thinly sliced green onions", 
            "1/4 cup thinly sliced mint leaves", 
            "1 1/2 tablespoons balsamic vinegar", 
            "6 ounces thinly sliced prosciutto, torn into strips", 
            "1/2 cup pomegranate seeds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/fennel-prosciutto-and-pomegranate-salad1.jpg?w=500", 
        "tags": [
            "Fennel", 
            "Photo", 
            "Pomegranate", 
            "Salad", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/11/fennel-prosciutto-and-pomegranate-salad/", 
        "title": "fennel, prosciutto and pomegranate salad", 
        "directions": [
            "Toss fennel and 1 tablespoon olive oil in medium bowl. Sprinkle with 1/4 teaspoon salt. (Planning ahead? I did this a day in advance.)", 
            "Combine arugula, green onions, mint, vinegar, and 2 tablespoons olive oil in large bowl; toss. Season with salt and pepper.", 
            "Divide greens among plates. Top with fennel, then drape with prosciutto. Sprinkle pomegranate seeds over. (We did this totally out of order. We’re fired.)"
        ], 
        "date": "2008-11-10T23:03:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound feta (cow’s milk)", 
            "2/3 cup sundried tomatoes in oil", 
            "1/2 cup pitted Kalamata olives", 
            "2 tablespoons fresh dill", 
            "3 tablespoons flat-leaf parsley", 
            "2 scallions", 
            "1/4 cup olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/feta-salsa1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Salad", 
            "Savory Sauces and Condiments"
        ], 
        "url": "https://smittenkitchen.com/2008/12/feta-salsa/", 
        "title": "feta salsa", 
        "directions": [
            "Crumble the feta into a bowl. Chop the tomatoes and olives, dill and parsley and thinly slice the scallions. Gently mix the ingredients together and drizzle with a few tablespoons of olive oi, or to taste."
        ], 
        "date": "2008-12-05T17:36:49+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/4 teaspoon salt", 
            "1 tablespoon sugar, optional", 
            "2 eggs", 
            "1 1/2 to 2 cups milk", 
            "2 tablespoons melted and cooled butter (optional), plus unmelted butter for cooking, or use neutral oil.", 
            "1/2 pound frisee (French curly endive)", 
            "6 ounces slab bacon or thick-cut bacon slices", 
            "2 tablespoons distilled white vinegar", 
            "4 large eggs", 
            "2 tablespoons chopped shallot", 
            "3 tablespoons red-wine vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/four-breakfasts1.jpg?w=500", 
        "tags": [
            "Bread", 
            "Breakfast", 
            "Pancakes", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2007/01/four-breakfasts/", 
        "title": "pancakes, english muffins, frisee salad", 
        "directions": [
            "Tear frisee into bite-size pieces and put in a large bowl. If using slab bacon, cut lengthwise into 1/4-inch-thick slices. Cut bacon slices crosswise into 1/4-inch-thick sticks (lardons).", 
            "In a heavy skillet cook bacon over moderate heat, stirring occasionally, until golden and remove skillet from heat.", 
            "Have ready another skillet with 1 inch warm water. Half-fill a 4-quart saucepan with water and stir in white vinegar. Bring liquid to a bare simmer. Break each egg into a teacup. Slide 1 egg into simmering liquid and immediately push white around yolk with a slotted spoon, moving egg gently. (Egg will become oval, with yolk completely covered by white.) Add remaining 3 eggs in same manner. Simmer eggs about 1 1/2 minutes for runny yolks to about 3 minutes for firm yolks. (Serving this salad with runny “not fully cooked” yolks may be of concern if there is a problem with salmonella in your area.) Immediately transfer eggs to skillet of warm water.", 
            "Reheat bacon in its skillet over moderate heat. Add shallot and cook, stirring, 1 minute. Add red-wine vinegar and boil 5 seconds. Immediately pour hot dressing over frisee and toss with salt and pepper to taste.", 
            "Divide salad among 4 plates and top with drained poached eggs. Season eggs with salt and pepper and serve salad immediately."
        ], 
        "date": "2007-01-07T10:59:54+00:00"
    }, 
    {
        "ingredient_list": [
            "Eggs", 
            "2 large eggs, at room temperature", 
            "Enough vegetable oil to reach a depth of 1/4-inch", 
            "Salad", 
            "1 cup lightly-packed torn green leaf lettuce (approximately 2-inch pieces)", 
            "1/4 cup thinly sliced yellow onion", 
            "1/4 cup thin or julienned carrot strips", 
            "1/4 cup coarsely chopped celery, Chinese or other, include leaves", 
            "1/4 cup lightly packed coarsely chopped cilantro, thin stems and leaves", 
            "Dressing", 
            "1 1/2 tablespoons lime juice (Key limes are recommended, but don’t fuss if you can’t find them)", 
            "1 1/2 tablespoons palm sugar simple syrup [see Note up top] or 1 tablespoon water + 1 teaspoon dark brown sugar", 
            "1 tablespoon Thai fish sauce", 
            "1 1/2 teaspoons (1 large clove) very thinly sliced garlic", 
            "2 fresh Thai chiles, preferably green, thinly sliced (more or less to taste)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/fried-egg-salad1.jpg?w=750", 
        "tags": [
            "Budget", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2015/01/fried-egg-salad/", 
        "title": "fried egg salad", 
        "directions": [
            "Fry eggs: Heat a wok or small skillet over the highest heat. Once hot, add enough oil to reach a depth of a generous 1/4-inch. Once the oil is hot enough to smoke, carefully crack the eggs into the oil — cautiously, as they will splatter a lot — and decrease the heat to medium-high. The eggs will hiss, sputter and the whites should puff and develop translucent bubbles. Once they’re very crispy and a deep golden brown underneath, 45 seconds to 1 minute, use a thin spatula to flip the eggs, trying not to break the yolks but not fretting if it happens. Cook for another minute on the second side, until the yolks are set but still slightly molten (aim to have them a little less loose than mine, shown above). Transfer eggs to paper towels; you can cook them up to 15 minutes before serving. Discard oil and wipe out wok or skillet.", 
            "Assemble salad: Place all salad ingredients in a large bowl. Quarter the eggs through the yolks and add them to the salad.", 
            "Make the dressing: Place the lime juice, palm syrup or dark brown sugar and water, fish sauce, garlic and chiles in the same wok or skillet. Set it over medium heat and heat the mixture until it just begins to sizzle at the edges, less than 30 seconds. ", 
            "Finish and serve: Pour the hot dressing over the salad and eggs. Stir gently to combine. If you’re feeling fancy, transfer the salad, liquid at all, to a plate in a low heap. Eat at once."
        ], 
        "date": "2015-01-22T12:04:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup well-shaken buttermilk", 
            "1/2 cup mayonnaise", 
            "1 tablespoon fresh lemon juice", 
            "1/4 teaspoon Worcestershire sauce", 
            "1 small garlic clove, minced", 
            "1/4 teaspoon salt", 
            "1/8 teaspoon black pepper", 
            "2 ounces crumbled firm blue cheese (1/2 cup)", 
            "2 tablespoons finely chopped fresh chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/from-aruba-on-an-iceberg-wedge1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Salad", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/12/from-aruba-on-an-iceberg-wedge/", 
        "title": "aruba + a blue cheese iceberg wedge", 
        "directions": [
            "Blend buttermilk, mayonnaise, lemon juice, Worcestershire sauce, garlic, salt and pepper in a food processor until smooth. Add blue cheese and pulse until cheese is incorporated but dressing is still slightly chunky. Transfer to a bowl and stir in chives. ", 
            "Do ahead: Keeps, covered and chilled, for one week, though we’ve yet to test that theory."
        ], 
        "date": "2007-12-24T12:19:05+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups cubed day-old dense country bread (1-inch cubes)", 
            "2 medium-size garlic cloves, chopped", 
            "1 large pinch of coarse salt (Kosher or sea)", 
            "1 small pinch of cumin seeds", 
            "3 tablespoons sherry vinegar, preferably aged, or best-quality red wine vinegar, or more to taste", 
            "1/3 cup fragrant extra-virgin olive oil", 
            "1 2/3 pounds very ripe but firm tomatoes, cut into 3/4-inch cubes", 
            "2 small Kirby (pickling) cucumbers, cored, seeded and diced", 
            "1/2 cup finely chopped white onion", 
            "1/2 cup seedless green grapes, cut in half", 
            "About 1/2 cup slivered fresh mint or basil (optional)", 
            "1 small onion", 
            "3 medium-size garlic cloves, peeled", 
            "3 fresh flat-leaf parsley sprigs, plus 1/4 cup chopped parsley", 
            "1 bay leaf", 
            "1 cup green or brown lentils (see Note)", 
            "Extra-virgin olive oil", 
            "1/2 pound sweet Spanish-style chorizo sausage, diced medium-fine", 
            "2 ounces thinly sliced serrano ham or proscuitto", 
            "2 tablespoon sherry vinegar, preferably aged (we, of course, used more)", 
            "1 tablespoon best-quality red wine vinegar", 
            "1 tablespoon chicken stock or broth, or water", 
            "1 teaspoon honey", 
            "Coarse salt (kosher or sea) and freshly ground black pepper", 
            "3 medium-size firm tomatoes, peeled, seeded and chopped", 
            "1/4 cup finely slices scallions, both white and green parts"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/gazpacho-and-lentil-chorizo-salads1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spanish"
        ], 
        "url": "https://smittenkitchen.com/2007/10/gazpacho-and-lentil-chorizo-salads/", 
        "title": "gazpacho salad", 
        "directions": [
            "2.\tArrange the bread cubes in a single layer on a large rimmed baking sheet and bake until they are just beginning to turn golden, 8 to 10 minutes, stirring once. Lead the bread cubes cool.", 
            "3.\tPlace the garlic, salt, and cumin in a mortar and, using a pestle, mash them into a paste. Add the vinegar and olive oil and whisk to mix. "
        ], 
        "date": "2007-10-05T09:21:02+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 a large, seedless English cucumber (about 6 to 7 ounces), chopped", 
            "1/2 a green bell pepper, chopped", 
            "1 cup (about 6 ounces) cherry or grape tomatoes, halved", 
            "1/4 cup kalamata olives (you can also serve these alongside)", 
            "1/4 small red onion, thinly sliced", 
            "1 lemon, halved", 
            "2 to 3 ounces feta (Bulgarian or French, if you can find them, are my favorites), in thick slices", 
            "2 tablespoons olive oil, or more to taste", 
            "Salt and freshly ground black pepper", 
            "1 sprig oregano, leaves minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/greek-salad-with-lemon-and-oregano.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Greek", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/05/greek-salad-with-lemon-and-oregano/", 
        "title": "greek salad with lemon and oregano", 
        "directions": [
            "Toss cucumbers, pepper, tomatoes, olives (if using) and onion in a shallow bowl or deep plate. Squeeze half a lemon over it. Arrange feta slices on top. Drizzle with olive oil, sprinkle with salt, pepper and oregano. Serve with a slice of feta on top of each serving, and the second half of the lemon for those that like their salads punchier.", 
            "* If you’re concerned about the pungency of the raw onion, you can squeeze the lemon juice on top of it and let it sit for a while in a dish before adding both to the salad. It will mellow and soften it.   "
        ], 
        "date": "2013-05-21T13:27:21+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound green beans, though if you can find a mix of green and yellow beans, it will be all the prettier", 
            "1 pound cherry tomatoes", 
            "1 large shallot", 
            "2 tablespoons red wine vinegar", 
            "Salt and pepper", 
            "1/3 cup extra-virgin olive oil", 
            "Basil or other herb (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/05/green-bean-and-cherry-tomato-salad.jpg?w=750", 
        "tags": [
            "Green Beans", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/05/green-bean-and-cherry-tomato-salad/", 
        "title": "green bean and cherry tomato salad", 
        "directions": [
            "Prepare the vegetables: Top and tail the beans and cut them into large segments. Parboil the beans in salted water until just tender, about four to five minutes. Drain and immediately spread them out to cool. Stem the cherry tomatoes and cut them in half. ", 
            "Make the vinaigrette: Peel and mince the shallot and put it in a bowl with the vinegar and salt and pepper. Whisk in the olive oil. Taste and adjust the balance with more vinegar, oil, or salt, as needed. Toss the cherry tomatoes in with the vinaigrette; this can sit for a while. Do not add the green beans  until just before serving or they will discolor from the acid in the vinaigrette. For variety, the salad can be garnished with basil or some other fresh herb such as parsley, chervil or hyssop.", 
            "Do ahead: Beans and vegetables can be prepared ahead of time. Simply toss with the dressing only at the last minute, as it can discolor the green beans after several hours."
        ], 
        "date": "2008-05-01T15:52:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound green beans or haricot vert (skinny ones)", 
            "1/2 a fennel bulb (about 1/2 pound)", 
            "1 stalk celery, trimmed", 
            "1/2 medium red onion", 
            "1 tablespoon lemon juice", 
            "1/4 cup red wine vinegar", 
            "1/4 cup water", 
            "1 tablespoon kosher salt (I use Diamond brand; use less if you’re using Morton or table salt)", 
            "1 1/2 teaspoons sugar", 
            "1/3 cup (about 2 ounces) whole almonds", 
            "2 tablespoons plus 2 teaspoons olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/green-bean-salad-with-fried-almonds.jpg?w=750", 
        "tags": [
            "Easter", 
            "Fennel", 
            "Green Beans", 
            "Photo", 
            "Salad", 
            "Thanksgiving", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/02/green-bean-salad-with-pickled-red-onions-and-fried-almonds/", 
        "title": "green bean salad with fried almonds", 
        "directions": [
            "If you’ve got an adjustable blade slider, time to make it earn its keep! Very thinly slice half your fennel bulb, your celery and your half onion. If you don’t have a fancy slicer, just slice them thinly with a knife. Toss the fennel with lemon juice to prevent browning and also because it makes it extra delicious.", 
            "In a small bowl, whisk together the vinegar, water, salt and sugar together. Add the onions and set them aside for about an hour. If you don’t have an hour, 30 minutes will still pickle them to deliciousness but they will only get better with age.", 
            "Meanwhile, bring a large pot of salted water to boil. Trim and tail green beans, something I just discovered I could do with kitchen shears. For me, it was a time saver. Boil beans until crisp-tender, about 4 to 5 minutes for regular green beans and about 3 minutes for skinny ones (a.k.a. “haricot vert” — what I used). Plunge in an ice water bath. Drain and pat dry. (If you have no patience for the precision of ice water baths, take the green beans out a full minute early as they will continue cooking as they cool.)", 
            "Heat a small heavy skillet to medium heat and add one teaspoon olive oil. Add almonds and toss until lightly browned, 2 to 3 minutes. Season lightly with salt and pepper to taste. Transfer almonds to a plate, let cool, and cut each almond into half or thirds.", 
            "Assemble your salad: Toss green beans with most of fennel, all of celery and half of the pickled red onions. Sprinkle two tablespoons of the red onion pickling liquid and two tablespoons of olive oil over the mixture. Season generously with salt and pepper. Taste, adjust seasonings and ingredient levels to your preferences — we found we wanted more fennel, red onion and pickling liquid.", 
            "Serve, then eat, eat, eat. "
        ], 
        "date": "2011-02-16T21:35:45+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds green beans", 
            "1 cup (5 ounces or 140 grams) almonds, toasted and cooled", 
            "1 1/4 ounces (about 1/3 cup grated) parmesan or aged pecorino cheese, but no need to grate if using a food processor", 
            "1 small garlic clove, peeled and crushed", 
            "Leaves from a sprig or two of thyme", 
            "Pinches of red pepper flakes, to taste", 
            "1/4 teaspoon coarse sea or kosher salt", 
            "2 to 3 teaspoons white wine vinegar", 
            "1/3 cup olive oil, plus extra for drizzling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/07/green-beans-with-almond-pesto1.jpg?w=640", 
        "tags": [
            "Gluten-Free", 
            "Green Beans", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/07/green-beans-with-almond-pesto/", 
        "title": "green beans with almond pesto", 
        "directions": [
            "Bring a large pot of salted water to boil. Trim green beans — I find using kitchen shears the quickest way — and cook beans in boiling water until crisp tender, about 3 to 4 minutes for regular green beans or 2 to 3 minutes for the skinnier “haricot vert” variety. Plunge in an ice water bath to fully cool. Drain and pat dry. (If you have no patience for the precision of ice water baths, take the green beans out a full minute early as they will continue cooking as they cool.)", 
            "In food processor, grind almonds, cheese, garlic, thyme, pepper and salt to a coarse paste. Add vinegar, and pulse again. Stir in oil and adjust seasonings to taste. ", 
            "Toss cooled green beans with almond pesto. Drizzling with extra olive oil for a fresh glisten. Dig in.", 
            "Serving suggestions: a mix of cherry tomatoes, grilled bread drizzled with olive oil and rubbed with a halved garlic clove or even grilled sausages."
        ], 
        "date": "2015-07-07T10:06:07+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces arugula", 
            "8 ounces of thick-cut bacon", 
            "Handful of grape tomatoes, halved or quartered (optional)", 
            "Small amount of parmesan cheese, shaved with a vegetable peeler (optional)", 
            "Aged balsamic vinegar", 
            "Drizzle of olive oil", 
            "Sea salt", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/grilled-bacon-salad-with-arugula-and-balsamic1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Arugula", 
            "Grilling", 
            "Meat", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/07/grilled-bacon-salad-with-arugula-and-balsamic/", 
        "title": "grilled bacon salad with arugula and balsamic", 
        "directions": [
            "Arugula is grown in dark, sandy soil and almost always arrives gritty. Don’t skimp on washing it. I like to fill a large bowl or basin with very cold water and drop the arugula into it, pumping it up and down a few times with your hands to allow any dirt and grit to fall to the bottom. Pull it out of the water, being careful not to drag any grit from the bottom of the bowl with it. Spread out on towels to dry it.", 
            "Meanwhile, get you grill very hot. Lay out all of your bacon slices and grill them* until browned underneath, which will take all of two minutes. Flip them with tongs; another minute should finish them on the second side. Transfer them to a platter. Tear your arugula into bite-sized pieces over it. Scatter with tomatoes and peels of parmesan, if using. Drizzle very thinly with olive oil and sprinkle with a few, spare droplets of balsamic vinegar. Season with salt and black pepper. Serve immediately, just as some of the arugula begins to sigh over the hot bacon.", 
            "* As I’ve already received a few comments about flare-ups on the grill from bacon grease, I want to add before you start that you should definitely use your judgement here; the recipe is not the law. Ours flared a little, but not so much that it worried me. If it’s flaring too much on a high heat, lower it or move it to a cooler part of the grill. You can also close the lid for a minute, or do fewer strips at a time. You know your grill best. Be safe."
        ], 
        "date": "2013-07-11T12:03:54+00:00"
    }, 
    {
        "ingredient_list": [
            "4 1-inch slices bread, country-style", 
            "3 large red bell peppers, halved, seeds removed", 
            "1 medium red onion, peeled and cut into 1/2-inch wedges", 
            "3 tablespoons olive oil", 
            "Kosher salt and freshly ground black pepper", 
            "2 tablespoons sherry vinegar", 
            "1 garlic clove, minced", 
            "1/2 teaspoon sugar", 
            "1 tablespoon olive oil", 
            "1 tablespoons capers, drained (rinsed if salted)", 
            "4 ounces mozzarella, torn into bite-sized pieces, or 4 ounces bocconcini", 
            "Fresh herbs — snipped chives, basil, or parsley or a mix thereof — to finish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/grilled-pepper-and-torn-mozzarella-panzanella.jpg?w=750", 
        "tags": [
            "Grilling", 
            "Peppers", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/06/grilled-pepper-and-torn-mozzarella-panzanella/", 
        "title": "grilled pepper and torn mozzarella panzanella", 
        "directions": [
            "Prepare vegetables: Place bread, pepper halves, and onion wedges in a large bowl and drizzle with 3 tablespoons olive oil, then sprinkle 1 teaspoon kosher salt and many grinds (or about 1/4 teaspoon) black pepper. Use your hands to toss everything together until oil coats everything.\nTo grill: Heat your grill to medium-high, or if yours is small and dinky like mine, high heat. Spread peppers and onions across grill grates and grill, lid down, flipping as needed, until onions are charred in spots (they’ll be done first) and peppers are blistered and blackened in many spots and beginning to soften. Transfer onions to a plate as they’re done; transfer peppers to a bowl. Use bread in bowl to swipe up any excess salt, pepper, and/or oil in it and place slices on grill. Grill until toasted on both sides. Transfer to plate with onions.\nNo grill? You can do all of the above under your broiler, or in your oven at 450 degrees F. Broilers vary wildly in how robust their heat is, so keep an eye on it. Vegetables tend to take longer in the oven, up to 40 minutes, but check in at 20 to be safe. In both cases, turn vegetables and bread as needed to get an even color.\nMarinate peppers: Place foil or a lid over peppers in bowl to trap heat. Once they’re cool enough to handle, remove as much of the skin as you can. This is unquestionably the most annoying part so do only as much as would bother you to have to eat. (For me, this is almost every speck but you’re probably less crazy.) Cut peppers into 1/2- to 1-inch wide strips.\nIn the bottom of a large bowl, whisk together sherry vinegar, remaining 1 tablespoon olive oil, sugar, about 1/4 teaspoon kosher salt (and more to taste), and garlic. Add capers. Add peppers to bowl and let them marinate for as little as 5 minutes or up to a day, even. The longer they souse, the more pickled they’ll taste. After 5 minutes, however, they still have plenty of flavor.\nTo assemble and serve: Shortly before you’re ready to eat the salad, add onions to the bowl with the peppers. Tear bread into chunks and add to bowl, along with mozzarella. Mix gently, making sure the dressing coats the bread. Taste and add more seasoning if needed. Finish with herbs and serve in big heaps."
        ], 
        "date": "2017-06-01T11:59:37+00:00"
    }, 
    {
        "ingredient_list": [
            "2 of the largest, most globe-like artichokes you can find", 
            "2 lemons", 
            "A few cloves of garlic, smashed but left in their skins", 
            "One can of cranberry beans, rinsed and drained", 
            "A bundle of fresh arugula, washed and dried", 
            "2 to 3 tablespoons mayonnaise", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/gulping-beanfuls1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Arugula", 
            "Beans", 
            "Photo", 
            "Salad", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/04/gulping-beanfuls/", 
        "title": "artichoke, cranberry bean and arugula salad", 
        "directions": [
            "Prepare your artichokes: Peel the toughest, smallest and greenest outer leaves off and discard them. Once you reach the first of the yellow leaves, of moderate thickness, you’re good. Leaving half to one full inch of the yellow leaves attached to the stem, cut the remainder off in one clean cut. Now, start scooping, with a small paring knife and a small spoon (a grapefruit one works great here). You want to remove all of the spindly inner leaves as well as all off the furry choke, while creating a bowl shape, using those truncated yellow leaves as sides. Rub half a lemon over every cut surface, so it doesn’t brown. Be generous. Now, as carefully as you can, peel all of the dark green skin from the stem, again rubbing each cut surface with the halved lemon. Trim the stem down to one inch or less, making sure that it is flat and that when turned upside-down, the artichoke can balance on the surface, again coating the surface with lemon. Repeat this process for the second artichoke.", 
            "Bring a large pot of water to boil, adding a few glugs of plain vinegar, those garlic cloves and the lemons you’d used to coat the artichokes, first squeezing any remaining juice into the pot. If you have any old white wine, this is also an excellent flavor to impart in the artichokes. Boil the bowl-shaped artichoke hearts for about 25 to 35 minutes, or until they can be pierced easily with a fork. Drain them and set them aside. (These can be cooked a day or even two in advance, and reheated when you’re ready to make the salad.)", 
            "Make your dressing: Whisk your mayonnaise with the juice of one lemon. You want a thin dressing. Season it with salt and pepper.", 
            "Assemble your salad: Turn each artichoke upside-down on a plate so it stands on it’s truncated stem. Toss about 1/2 to 2/3 of a cup of beans with a spoonful or two of the dressing, and fill the artichoke cavity with them. Toss the arugula with more dressing, and arrange it over and around the artichoke. Season with more salt and pepper. Leave the extra dressing near you as you’ll probably want more for your artichoke heart. Eat with vigor."
        ], 
        "date": "2007-04-05T14:44:47+00:00"
    }, 
    {
        "ingredient_list": [
            "For the croutons: ", 
            "1/4 cup unsalted butter", 
            "2 teaspoons finely chopped garlic", 
            "2 teaspoons finely chopped fresh thyme", 
            "6 cups day-old bread, crust removed, cubed", 
            "6 tablespoons finely grated Parmesan, plus more for garnish", 
            "Salt and freshly ground black pepper ", 
            "For the salad:", 
            "1 small red onion, sliced thinly lengthwise", 
            "3 tablespoons sherry vinegar", 
            "Gray salt", 
            "4 cups peeled, seeded, and diced butternut squash (1/2-inch dice)", 
            "1/2 cup plus 1 1/2 tablespoons extra-virgin olive oil", 
            "1 tablespoon chopped fresh sage", 
            "Freshly ground black pepper", 
            "1/2 pound Brussels sprouts, ends trimmed, then quartered", 
            "1/2 cup fresh Italian parsley leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/12/winter-panzanella.jpg?w=750", 
        "tags": [
            "Brussels Sprouts", 
            "Photo", 
            "Salad", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2006/12/holding-the-gray-salt/", 
        "title": "winter panzanella", 
        "directions": [
            "Preheat oven to 400°F. ", 
            "Melt the butter in a large skillet over moderate heat and cook until it foams. Add the garlic and thyme, and immediately add the bread cubes. Toss to coat well. Add most of the grated cheese and stir. Transfer bread to a baking sheet and sprinkle with the remaining cheese and salt and pepper and gently toss again while still warm to melt the cheese. Bake stirring once or twice, until the croutons are crisp and lightly colored on the outside but still soft within, about 10 to 15 minutes. Set aside and let cool. ", 
            "Soak the sliced onion in the sherry vinegar and a pinch of salt for about 15 minutes. Set aside. ", 
            "Toss the squash with 1 1/2 tablespoons of the olive oil, sage, salt, and pepper. Arrange in a single layer on a baking sheet and bake until the squash is tender and lightly caramelized, about 15 to minutes. Let cool. ", 
            "Bring a large pot of salted water to a boil. Add the quartered Brussels sprouts and cook until tender but retain a touch of crispness, about 1 1/2 minutes, and drain. ", 
            "Into the reserved red onions and vinegar, whisk in remaining 1/2 cup olive oil. Season with pepper. ", 
            "In a large bowl combine the roasted squash, croutons, and Brussels sprouts. Add the vinaigrette and toss. Add the parsley leaves and toss again. Taste and adjust the seasoning. Garnish with grated Parmesan and serve immediately. "
        ], 
        "date": "2006-12-03T22:40:52+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds small (2-inch) potatoes, your choice of variety (I found a rainbow-colored pack, and couldn’t resist, clearly)", 
            "1/4 cup red onion, chopped", 
            "1 tablespoon white-wine vinegar", 
            "1 cup sour cream (or 1/2 cup sour cream, 1/2 cup yogurt)", 
            "2 tablespoons fresh dill, finely chopped", 
            "1/4 cup chopped fresh chives (frustratingly, couldn’t find these)", 
            "1 tablespoon Dijon mustard", 
            "3 tablespoons prepared horseradish", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/horseradish-potato-salad1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/06/horseradish-potato-salad/", 
        "title": "horseradish potato salad", 
        "directions": [
            "Boil the potatoes until fork tender, cool them to room temperature and quarter them. In a large bowl, mix the remaining ingredients and fold over the potatoes. Adjust seasoning to taste — you might add another tablespoon of vinegar if you feel it needs more ‘zing’ — and prepare to wow the Eastern Europeans in your life!"
        ], 
        "date": "2009-06-21T11:57:10+00:00"
    }, 
    {
        "ingredient_list": [
            "Salad", 
            "1/2 cup uncooked quinoa (or 1 1/2 cups cooked)", 
            "8 ounces Black Kale, also known as Cavolo Nero, or Lacinato, Dinosaur, or Tuscan Kale", 
            "1/2 cup slivered almonds, very well toasted and cooled", 
            "1/3 cup dried cherries, chopped a bit", 
            "2 to 3 scallions, thinly sliced", 
            "2 teaspoons chopped fresh dill", 
            "2 ounces ricotta salata, crumbled or finely grated", 
            "Few gratings of fresh lemon zest", 
            "Dressing", 
            "3 tablespoons olive oil", 
            "1 1/2 tablespoons white wine vinegar", 
            "2 teaspoons smooth Dijon mustard", 
            "1 teaspoon coarse Dijon mustard", 
            "Just shy of 1 teaspoon honey", 
            "Salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/03/kale-and-quinoa-salad-with-ricotta-salata.jpg?w=750", 
        "tags": [
            "Grain/Rice", 
            "Kale", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/03/kale-and-quinoa-salad-with-ricotta-salata/", 
        "title": "kale and quinoa salad with ricotta salata", 
        "directions": [
            "Rinse quinoa well in a small colander. This is essential to remove bitterness. Place quinoa and 1 1/2 cups water in a small saucepan and bring to a simmer with a couple pinches of salt. Simmer at a very low temperature for 15 to 20 minutes, until tender. Drain any un-absorbed liquid from cooked quinoa. Spread quinoa on a plate to cool quickly.", 
            "Wash your kale and dry it well. Then, with a knife, remove the rib from each stalk, leaving long strips of kale leaves. Stack the leaves in small batches, roll them tightly the long way, and cut the roll crosswise into thin ribbons. Add the kale ribbons to a large salad bowl. Add remaining salad ingredients to kale and toss to mix.", 
            "Whisk dressing ingredients together in a small dish, and pour the dressing over the salad. Season with salt and pepper to taste, then dig in."
        ], 
        "date": "2014-03-06T11:56:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (105 grams or 3 3/4 ounces) walnut halves or pieces", 
            "1/4 cup (45 grams or 1 1/2 ounces) golden raisins", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon water", 
            "1/4 cup panko (15 grams or 1/2 ounce) or slightly coarse homemade breadcrumbs (from a thin slice of hearty bread)", 
            "1 tiny clove garlic, minced or pressed", 
            "Coarse or kosher salt", 
            "3 tablespoons olive oil", 
            "1 bunch (about 14 ounces or 400 grams) tuscan kale (also known as black or lacinato kale; this is the thinner, flatter leaf variety), washed and patted dry", 
            "2 ounces (55 grams) pecorino cheese, grated or ground in a food processor, which makes it delightfully rubbly (1/2 cup total)", 
            "Juice of half a lemon", 
            "Freshly ground black pepper or red pepper flakes, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/kale-salad-with-pecorino-and-walnuts.jpg?w=750", 
        "tags": [
            "Kale", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/08/kale-salad-with-pecorino-and-walnuts/", 
        "title": "kale salad with pecorino and walnuts", 
        "directions": [
            "Prepare walnuts: Heat oven to 350. Toast walnuts on a baking sheet for 10 minutes, tossing once. Let cool and coarsely chop. ", 
            "Prepare raisins: In a small saucepan over low heat, simmer white wine vinegar, water and raisins for 5 minutes, until plump and soft. Set aside in liquid. ", 
            "Prepare crumbs: Toast bread crumbs, garlic and 2 teaspoons of the olive oil in a skillet together with a pinch of salt until golden. Set aside.", 
            "Prepare kale: Trim heavy stems off kale and remove ribs. I always find removing the ribs annoying with a knife, because the leaves want to roll in on the knife and make it hard to get a clean cut. Instead, I’ve taken to tearing the ribs off with my fingers, which is much easier for me. Stack sections of leaves and roll them into a tube, then cut them into very thin ribbons crosswise. ", 
            "Assemble salad: Put kale in a large bowl. Add pecorino, walnuts and raisins (leaving any leftover vinegar mixture in dish), remaining 2 tablespoons olive oil and lemon juice and toss until all the kale ribbons are coated. Taste and adjust seasonings with salt, pepper and some of the reserved vinegar mixture from the raisins, if needed. Let sit for 10 minutes before serving, if you can, as it helps the ingredients come together. Just before serving, toss with breadcrumbs and, if needed, a final 1 teaspoon drizzle of olive oil. "
        ], 
        "date": "2013-08-13T11:50:38+00:00"
    }, 
    {
        "ingredient_list": [
            "Lentils", 
            "Scant 1 cup dried green lentils (Puy or Casteluccio, if you can find them) lentils, picked and rinsed over", 
            "2 large garlic cloves, halved lengthwise", 
            "2 fresh sage sprigs", 
            "2 tablespoons olive oil", 
            "For the dressing and salad", 
            "2 teaspoons coriander seeds, toasted and ground**", 
            "1 teaspoon cumin seeds, toasted and ground**", 
            "1/2 large garlic clove", 
            "Salt (Maldon or another flaky sea salt if you’ve got it)", 
            "2 tablespoons well-stirred tahini paste", 
            "1/4 cup freshly squeezed lemon juice, plus more to taste", 
            "2 tablespoons plus 2 teaspoons olive oil", 
            "1 and 3/4 cups drained chickpeas (from a 15-ounce can), low sodium if you can find them", 
            "1/2 small preserved lemon, pith and flesh discarded, rind finely diced (optional)", 
            "1 very small red onion, thinly sliced into half-moons", 
            "A handful of small, delicate cilantro or flat-leaf parsley sprigs", 
            "A scant 1/4 cup feta (goat’s milk if you can find it, otherwise use what you can get)", 
            "1 and 1/2 tablespoons raw sesame seeds, toasted in a dry pan until a shade or two darker"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/lentil-and-chickpea-salad.jpg?w=750", 
        "tags": [
            "Beans", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/04/lentil-and-chickpea-salad-with-feta-and-tahini/", 
        "title": "lentil and chickpea salad with feta and tahini", 
        "directions": [
            "Make the lentils: Put the lentils, garlic, sage, and olive oil in a small pot, along with 2 cups cold water, and set it over medium heat. Let the water come to a simmer (not boiling), then turn the heat to low and cook the lentils in a very gentle simmer just until they are tender  — April recommends 25 minutes, but mine took 35 and needed a touch more water at the end. Take the pan off the heat and let the lentils cool a bit before draining them. Pick out and discard the sage and garlic. You’ll have about 2 cups cooked lentils.", 
            "Make the dressing: Mix together the ground coriander and cumin in a small bowl. Mash the garlic clove to a paste with 1 teaspoon salt (use half as much Kosher salt, even less table salt) on a cutting board or in a mortar. In a small bowl for your dressing, combined the mashed garlic, tahini, 3 tablespoons of the lemon juice, 2 tablespoons of the olive oil, 1 teaspoon of the ground coriander-and-cumin mixture and 2 tablespoons water. Stir well, then taste. Add more lemon if desired.", 
            "Assemble the salad: Place onion slices in a medium bowl and break them up with your fingers. Sprinkle in two good pinches of salt, then two teaspoons of lemon juice, two remaining teaspoons of olive oil and the cilantro or parsley. Toss well, then crumble in the cheese and gently toss again.", 
            "Toss the lentils with the drained chickpeas, preserved lemon rind (if using), and 1 teaspoon flaky sea salt (use half as much Kosher salt, even less table salt) in a large mixing bowl. Pour in the tahini dressing and toss it all together really well, then stir in the onion-feta mixture.", 
            "Arrange the salad in bowl or platter. Sprinkle the mixture with the sesame seeds and some of the remaining spices. Serve, and don’t forget to share.", 
            "P.S. We had this with a Simple Potato Gratin (a post I’m itching to update even more simply, and less hideously, but the important stuff is there) and lamb chops (may I recommend these?). ", 
            "** To toast and grind spices: Put the spices, one at a time, in a small dry pan over medium-high heat. Toast, shaking the pan frequently, until the spices become very sweet and fragrant, anywhere from 2 to 4 minutes. Let them cool in a bowl or on a small plate and grind in a mortar and pestle or in a coffee grinder."
        ], 
        "date": "2013-04-01T12:27:09+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds unpeeled small Yukon gold (Ina’s suggestion) or fingerling (what I used) potatoes", 
            "Coarse, kosher or sea salt", 
            "3 tablespoons Champagne or white wine vinegar", 
            "1/2 teaspoon Dijon mustard", 
            "1/2 teaspoon minced or pressed garlic", 
            "1 large or extra-large egg yolk, ideally at room temperature", 
            "Freshly ground black pepper", 
            "1/2 cup olive oil", 
            "1/4 cup dry white wine (you can skip this, or use less, with little harm; I used 1 tablespoon vermouth instead)", 
            "3 tablespoons drained capers (I imagine minced cornichons would be a good alternative)", 
            "6 scallions, thinly sliced (yielding about 1 cup)", 
            "2 medium stalks celery, diced small (about 1/4 inch) (yielding about 1/2 cup)", 
            "1/2 cup finely diced red onion", 
            "1 1/2 pounds cooked lobster meat, cooked and cooled, in a 1-inch dice (from about 7 to 8 pounds fresh lobster; see post above for better budgeted suggestions)", 
            "1 lemon", 
            "3 tablespoons coarsely chopped fresh tarragon (Ina’s suggestion) or flat-leaf parsley (what we used)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/lobster-and-potato-salad.jpg?w=750", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad", 
            "Seafood", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/05/lobster-and-potato-salad/", 
        "title": "lobster and potato salad", 
        "directions": [
            "Cook the potatoes: Place the potatoes in a large pot and cover with an inch or two over water. Add 1 tablespoon salt and bring to a boil. Lower the heat and simmer for 15 to 25 minutes, depending on the size of the potatoes, until just tender. (A bamboo skewer is ideal to test them.) Drain in a colander, and let potatoes cool for 5 minutes. Cut potatoes into quarters or halves (or fingerlings into 1/2- to 1-inch segments) and place them in a large bowl.", 
            "Make the vinaigrette: Whisk together the vinegar, mustard, garlic, egg yolk, 1 teaspoon salt, and many grinds of black pepper (Ina recommends you use a full teaspoon of pepper). Whisking constantly and vigorously, pour the oil in in a thin drizzle, ideally making an emulsion. Stir in the wine (if using) and capers. ", 
            "Assemble the salad: While the potatoes are still very warm, pour half the vinaigrette on the potatoes and toss them gently, allowing them to soak up the vinaigrette. Stir in the scallions, celery, red onion, lobster, and add enough vinaigrette to moisten. Reserve any remaining vinaigrette for later. Add the zest and juice of the lemon, the tarragon or parsley, and more salt and pepper to taste (Ina calls for another 2 teaspoons salt and 1 teaspoon pepper, but this felt like overkill). Cover with plastic wrap and refrigerate for at least an hour to allow flavors to blend. Taste for seasonings and add more vinaigrette, if necessary. ", 
            "Serve: This salad is especially good served closer to room temperature. Don’t forget to share."
        ], 
        "date": "2013-05-29T10:56:52+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds cooked lobster meat*, chopped roughly into 1/2 and 3/4-inch pieces", 
            "1 small celery rib, finely chopped", 
            "1/4 cup mayonnaise (Charles insists on Hellman’s; I didn’t argue)", 
            "Squeeze or two of lemon juice", 
            "Pinch of kosher salt and freshly ground black pepper", 
            "2 top-loading hot dog buns or 64 miniature burger buns (described above) or small dinner rolls", 
            "Unsalted butter", 
            "Snipped fresh chives for garnish (though we mixed ours right into the salad, for convenience)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/lobster-rolls1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Salad", 
            "Seafood"
        ], 
        "url": "https://smittenkitchen.com/2009/08/lobster-rolls/", 
        "title": "lobster rolls", 
        "directions": [
            "In a large bowl, combine the lobster meat, celery, mayonnaise, lemon and salt and pepper and mix thoroughly. Adjust seasonings to taste.", 
            "Do ahead: Cover the mixture and store it in the refrigerator until ready to serve. It will last for up to two days.", 
            "How they prepare the buns at the restaurant: In a small sauté pan over low to medium heat, melt two teaspoons of butter. Place the hot dog buns on their sides in the butter. Flip the buns a couple of times so that both sides soak up an equal amount of butter and brown evenly. Remove the buns from the pan and place them on a large plate. Fill the toasted buns with lobster salad.", 
            "How we prepared our miniature rolls: On large roasting pans, we split each of our rolls and lightly toasted them, open side up, before quickly slathering both sides with butter and filling each with a generous tablespoon of lobster salad.", 
            "Sprinkle your rolls with chives and serve with a salad, slaw or shoestring fries.", 
            "* We bought our lobster meat, cooked that morning and shelled, from The Lobster Place, for those of you who were going to ask. However, not all markets are as trustworthy when it comes to lobster meat that they label “fresh” — it is often overcooked and not as recently-rendered as they promise. If you’re up for it, cooking and cracking your own will ensure freshness while reducing your grocery tab. About 20 percent of the weight of a lobster is its meat, so you would need, for example, five one-pound lobsters to get one pound of meat. Don’t panic — as I did — when you see how tiny the mass of two pounds of lobster meat might look. Once diced, our salad nearly filled a six-cup bowl."
        ], 
        "date": "2009-08-10T11:45:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound small shrimp, shelled and deveined or pre-cooked and defrosted", 
            "2 firm-ripe avocados, halved, scored into a small dice", 
            "2 cups grape tomatoes, quartered or 2 cups chopped tomatoes, drained a little", 
            "1/2 small white onion, very finely chopped (use red if you can’t find white)", 
            "1 small jalapeño, seeded and finely chopped (optional)", 
            "Drizzle of olive oil", 
            "Juice of 1 to 2 limes", 
            "Salt", 
            "Handful cilantro leaves, roughly chopped", 
            "Hot sauce, on the side", 
            "Tortilla chips, to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/9349257784_815a1814b7_o.jpg?w=750", 
        "tags": [
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Seafood", 
            "Side Dish", 
            "Summer", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2013/07/mama-canales-garcias-avocado-shrimp-salsa/", 
        "title": "mama canales-garcia’s avocado-shrimp salsa", 
        "directions": [
            "To cook the shrimp: Bring salted water* to a boil and turn off heat. Add shrimp, cover pot and let stand until firm and pink, about 5 to 7 minutes. Drain shrimp, pat dry and chill. ", 
            "Make salsa: Chop shrimp into small bites and put in medium bowl. Scoop avocados into bowl. Add tomatoes, white onion, jalapeño (if using, to taste) and a drizzle of olive oil. Add the juice of one lime, and a second one, if needed. Add salt to taste, then cilantro. Serve with tortilla chips.", 
            "* If you have more time, you can first make a shrimp stock with about 3 cups water, 1 cup beer or wine, the reserved shrimp shells, additional lime juice or the peels from the lime juice you’ll use in the salad and some peppercorns or red pepper flakes. Boil these together for 20 minutes, then strain the mixture. Cook the shrimp in this stock instead."
        ], 
        "date": "2013-07-23T12:01:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 mangoes, peeled, pitted and julienned", 
            "1 to 1 1/4 pounds Napa cabbage, halved and sliced very thinly", 
            "1 red pepper, julienned", 
            "1/2 red onion, thinly sliced", 
            "6 tablespoons of fresh lime juice, from about two limes", 
            "1/4 cup rice vinegar", 
            "2 tablespoons oil of your choice", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon red pepper flakes, or to taste (or omit this and whisk in a chile paste to taste)", 
            "1/4 cup thinly sliced fresh mint leaves", 
            "1/4 cup toasted cashews, coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/mango-slaw-with-cashews-and-mint.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Mango", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2010/07/mango-slaw-with-cashews-and-mint/", 
        "title": "mango slaw with cashews and mint", 
        "directions": [
            "Toss mangoes, cabbage, pepper and onion in a large bowl. Whisk lime juice, vinegar, oil, salt and red pepper in a smaller bowl and pour over slaw. You can either serve this immediately or leave the flavors to muddle for an hour in the fridge. Before serving, toss with mint leaves and sprinkle with cashews.", 
            "About your mango: This salad will work with almost any variety or ripeness of mango, whether sour or sweet. Use the one you can get, or that you enjoy the most. In general, a firmish not overly ripe mango (unlike the very ripe, sweet one I used) holds up best but all will be delicious in this salad."
        ], 
        "date": "2010-07-08T12:58:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup red wine vinegar", 
            "1/4 cup cold water", 
            "1 tablespoon kosher salt", 
            "2 teaspoons sugar", 
            "1/2 a red onion, cut into a 1/2-inch dice (use less if your onion is huge)", 
            "3 bell peppers, your choice of colors (I used one red, orange and yellow)", 
            "1 kirby cucumber,", 
            "1/4-pound firm feta cheese", 
            "1/4 to 1/2 cup pitted kalmata olives", 
            "1/4 cup olive oil", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/mediterranean-pepper-salad.jpg?w=753", 
        "tags": [
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/06/mediterranean-pepper-salad/", 
        "title": "mediterranean pepper salad", 
        "directions": [
            "Swish together the red wine vinegar, water, kosher salt and sugar in a small bowl until the salt and sugar are dissolved. Add the red onion and set it aside.", 
            "Meanwhile, time to practice your knife skills. Core and seed your bell peppers and chop them into 1/2-inch pieces. Chop the cucumber and feta into similarly-sized chunks. Put your peppers, cucumber, feta and olives in a large bowl.", 
            "By now, your onions will have lightly pickled, both sweetening and softening their blow. Drain them and add them to the other vegetables in the large bowl, but reserve the vinegar mixture. Pour a quarter cup of the vinegar mixture over the salad, then drizzle with olive oil. Season generously with salt and freshly ground black pepper, or to taste. Toss evenly and serve at once, or let the flavors muddle together in the fridge for a few hours.", 
            "Forgetful, who me? People, I just realized I forgot to add the cup of grape tomatoes that are usually in this salad, and that I’d purchased specifically to add to it. Like grape tomatoes? Add them! Don’t like them? Turns out you might not know they were missing."
        ], 
        "date": "2009-06-25T16:09:49+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 tablespoons red onion, cut into tiny bits", 
            "4 pieces of citrus, preferably a mix of grapefruits and oranges but use what you can get, and what you like to eat (spoiled by the spread at the store, I used 1 pink grapefruit, 1 cara cara and 1 blood orange, and 1 mineola)", 
            "1 tablespoon red wine vinegar or lemon juice", 
            "1 teaspoon smooth Dijon mustard", 
            "1 tablespoon olive oil", 
            "Salt and freshly ground pepper, to taste", 
            "3 to 4 tablespoons (1.5 ounces) feta cheese, chopped or crumbled", 
            "1 tablespoon fresh mint, chopped or cut into tiny slivers"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mixed-citrus-salad-with-feta-and-mint1.jpg?w=500", 
        "tags": [
            "Fruit", 
            "Grapefruit", 
            "Herbs", 
            "Orange", 
            "Photo", 
            "Salad", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2010/01/mixed-citrus-salad-with-feta-and-mint/", 
        "title": "mixed citrus salad with feta and mint", 
        "directions": [
            "Place your red onion in the bottom of a medium bowl. Nest a strainer over the bowl.", 
            "Prepare your citrus fruits by beveling the stem end of one, cutting enough off that you reveal the pith-free flesh of the fruit. Repeat on the other end. Rest your fruit on one of its now-flat surface and begin cutting the peel and pith off in large, vertical pieces. You want the fruit’s exterior to be “white”-free.", 
            "Turn the fruit back on its side and cut it into 1/4-inch thick wheels, removing any seeds and thick white stem as you do. Place the wheels and any collected juices from the cutting board in the strainer over the bowl with onion. Repeat with remaining citrus fruits. (As the extra juices drip over the bowl, it will soften the raw onion bite.)", 
            "Spread the fruit slices out on a platter. Scoop out the onion bits (a slotted spoon or fork does the trick) and sprinkle them over, leaving the juice in the bowl. Whisk one tablespoon of juice (this is all I had accumulated) with red wine vinegar or lemon juice, Dijon and olive oil. Season with salt and freshly cracked black pepper. Drizzle the dressing over the citrus, sprinkle with feta and mint, adjust salt and pepper to taste, serve immediately and daydream of warmer places."
        ], 
        "date": "2010-01-22T15:44:57+00:00"
    }, 
    {
        "ingredient_list": [
            "Oregano dressing", 
            "4 cloves garlic", 
            "1 to 2 tablespoons dried oregano (Nancy recommends 2; I got nervous and used 1, but might not have minded more)", 
            "2 teaspoons kosher salt", 
            "Freshly ground black pepper", 
            "2 tablespoons lemon juice, or juice of 1 lemon", 
            "1/4 cup red wine vinegar", 
            "1/4 cup olive oil, ideally extra-virgin", 
            "Salad and assembly", 
            "1 (15-ounce) can chickpeas or 1 3/4 cups cooked chickpeas, drained", 
            "1 small red onion, peeled and sliced into paper-thin rings", 
            "1/2 pound provolone (see Note about varieties), sliced 1/8-inch thick then cut into 1/4-inch ribbons", 
            "1/2 pound salami, peeled, sliced 1/8-inch thick then cut into 1/4-inch ribbons", 
            "4 medium or 8 small pickled pepperoncini, sliced into rings", 
            "3/4 pound cherry tomatoes", 
            "Sea salt", 
            "1 head iceberg lettuce (see Note about size), halved, cored, and cut in 1/2-inch ribbons", 
            "1 head radicchio, halved, cored and cut in 1/4-inch ribbons", 
            "2 tablespoons dried oregano for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/nancys-chopped-salad1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Gluten-Free", 
            "Italian", 
            "Lunch", 
            "Photo", 
            "Radicchio", 
            "Salad", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/06/nancys-chopped-salad/", 
        "title": "nancy’s chopped salad", 
        "directions": [
            "Make dressing: Roughly chop the garlic and then add the oregano, salt and up to 1/2 teaspoon ground pepper. Chop the mixture together and use the side of a knife or a mortar and pestle to make a grainy herb paste. Transfer the paste to a large salad bowl, and add the lemon juice and vinegar. Mix with a fork allowing the salt to dissolve, then add the oil and whisk with a fork until well combined. The dressing should be thick with garlic and oregano. If you’re using a small head of iceberg, transfer 1/3 the dressing into a small bowl to be used only if needed. For a larger head of iceberg, you’ll want it all.", 
            "Assemble salad: Gently fold the chickpeas, red onion, provolone, salami, pepperoncini (including seeds and juice) into the dressing, one at a time. Halve the tomatoes lengthwise and season with 1 1/2 teaspoons sea salt. Set aside until ready to serve.", 
            "To serve: When ready to serve, gently add the tomatoes, lettuce and radicchio to the salad bowl, along with a couple of generous pinches of oregano, and toss to combine with the dressing. Adjust seasonings to taste, adding any reserved dressing if needed. Serve immediately.", 
            "Sicilian Oregano Sources: It’s definitely available online here and here. If you’re in NYC, I bought the jar you see here at Brooklyn Larder a year or two ago for about $7. However, I was over at Buon Italia in Chelsea Market today (6/5) and they sell, well, almost a tree of the stuff, easily 10 times what was in that jar, for all of $4.50. Buy it and share it with all of your friends! "
        ], 
        "date": "2014-06-02T12:24:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup well-shaken buttermilk", 
            "2 tablespoons mayonnaise", 
            "2 tablespoons cider vinegar", 
            "2 tablespoons minced shallot", 
            "1 tablespoon sugar", 
            "3 tablespoons finely chopped chives", 
            "1 pound Napa cabbage, cored and thinly sliced crosswise (4 cups)", 
            "6 radishes, diced", 
            "2 celery ribs, thinly sliced diagonally"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/napa-cabbage-salad-with-buttermilk-dressing.jpg?w=751", 
        "tags": [
            "Cabbage", 
            "Photo", 
            "Picnics", 
            "Radishes", 
            "Salad", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2008/07/napa-cabbage-salad-with-buttermilk-dressing/", 
        "title": "napa cabbage salad with buttermilk dressing", 
        "directions": [
            "Whisk together buttermilk, mayonnaise, vinegar, shallot, sugar, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a large bowl until sugar has dissolved, then whisk in chives.", 
            "Toss cabbage, radishes, and celery with dressing."
        ], 
        "date": "2008-07-31T12:22:28+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups (415 grams or 15 ounces) mayonnaise, low-fat is fine, as is swapping half with yogurt", 
            "1/4 cup smooth (60 grams) Dijon mustard", 
            "3 tablespoons (45 grams) whole grain mustard (I use whole grain Dijon)", 
            "2 tablespoons (30 ml) apple cider vinegar", 
            "1 teaspoon celery seed", 
            "1/2 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "1 1/2 cups (170 grams or 6 ounces) crumbled blue cheese (optional)", 
            "1/2 of a small head (about 430 grams or 15 ounces for half) green cabbage", 
            "1/2 small (about 375 grams or 13 ounces for half) head red cabbage", 
            "1 giant carrot (about 6 ounces) or 4 slim ones, scrubbed or peeled and shredded", 
            "1 cup chopped fresh parsley leaves or 1 cup slivered kale leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/not-your-mamas-coleslaw.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2006/11/not-your-mamas-coleslaw/", 
        "title": "not your mama’s coleslaw", 
        "directions": [
            "Make the dressing: Mix the mayonnaise, mustards, vinegar, celery seed, salt, and pepper in a smaller bowl. Stir in blue cheese, if using.", 
            "Prepare the vegetables: Halve the cabbage halves and cut out the cores. Slice the cabbage as thinly as you can with a sharp knife, on a mandoline, or with a food processor’s slicing blade (lay the cabbage horizontally in the feed tube). Transfer chopped cabbage into a large bowl, fishing out any very large pieces and slicing them thinly by hand. Stir in the shredded carrot. If you’re going to dress this later, this is the best stopping point.", 
            "To serve: Up to an hour before you’ll eat the slaw, toss the cabbage mixture with dressing to taste –- you will want to start with half and add more as needed — and parsley. Adjust seasonings as needed.", 
            "Note: No matter how gargantuan the salad looks right now, it will soon wilt down a bit and yield moderate portions for 8 to 10 people.\n"
        ], 
        "date": "2006-11-01T14:37:22+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 to 1 pound seedless cucumber, washed and chopped into chunks", 
            "2 thin or 1 regular scallions, thinly sliced", 
            "1 large avocado, pitted and diced", 
            "2 tablespoons mayonaise", 
            "Juice of half a lime, plus more to taste", 
            "Salt and hot sauce (we used Sriracha) to taste", 
            "Chopped cilantro or flat-leaf parsley to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/17041084926_d38d46dae0_k.jpg?w=750", 
        "tags": [
            "Avocado", 
            "Cucumber", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/04/obsessively-good-avocado-cucumber-salad/", 
        "title": "obsessively good avocado cucumber salad", 
        "directions": [
            "Combine cucumber, scallions and avocado in a bowl. Whisk together mayo, lime and seasonings, adjusting levels to taste. Drizzle salad with dressing and garnish with cilantro or parsley. Repeat again tomorrow. "
        ], 
        "date": "2015-04-07T12:00:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound firm tofu", 
            "1/2 cup coarsely grated carrots", 
            "1/2 cup shredded Napa cabbage", 
            "2 tablespoons finely chopped red pepper", 
            "2 tablespoons finely chopped scallions", 
            "2 teaspoons finely minced fresh ginger", 
            "1 tablespoon chopped cilantro leaves", 
            "2 minced cloves garlic (Deb addition)", 
            "1 tablespoon soy sauce", 
            "1 tablespoon hoisin sauce", 
            "2 teaspoons toasted sesame oil (I replace 1 teaspoon with hot sesame oil — delicious)", 
            "1 egg, lightly beaten", 
            "1 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "35 to 40 small wonton wrappers", 
            "1/3 cup chicken stock or water", 
            "1/4 cup soy sauce", 
            "1 tablespoon rice vinegar", 
            "1 tablespoon dark sesame oil or 1/2 tablespoon dark, 1/2 tablespoon hot sesame oil", 
            "1 small clove garlic, minced (optional)", 
            "1 (1/2-inch-thick) slice peeled fresh ginger", 
            "1/4 cup Asian sesame paste or smooth peanut butter", 
            "3 tablespoons Asian sesame oil", 
            "1/4 cup rice vinegar (not seasoned)", 
            "1 1/2 tablespoons sugar", 
            "2 tablespoons water", 
            "1 teaspoon Asian chile paste with garlic*", 
            "1/2 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/on-obsessiveness-and-ollies1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Chinese", 
            "Dumplings", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2007/02/on-obsessiveness-and-ollies/", 
        "title": "vegetable dumplings", 
        "directions": [
            "Blend all dressing ingredients in a blender until smooth. Dressing keeps, covered tightly and chilled, 1 week. "
        ], 
        "date": "2007-02-19T21:04:34+00:00"
    }, 
    {
        "ingredient_list": [
            "3 1/2 pounds pork of spareribs, halved crosswise, preferably by a butcher, and cut into individual ribs", 
            "1/3 cup honey", 
            "1/4 cup soy sauce", 
            "1 large garlic clove, minced and mashed to a paste with 1/4 teaspoon salt", 
            "1/3 cup hoisin sauce", 
            "1/2 teaspoon English-style dry mustard", 
            "1/4 cup distilled white vinegar ", 
            "1/4 cup peanut or neutral oil, like grapeseed or corn", 
            "1/4 cup rice vinegar", 
            "3 tablespoons white miso, sold at Asian markets and specialty stores", 
            "1 tablespoon dark sesame oil", 
            "2 medium carrots, peeled and cut into big pieces", 
            "1 inch-long piece fresh ginger, peeled and cut into coins", 
            "Salt and freshly ground black pepper. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/party-of-five1.jpg?w=500", 
        "tags": [
            "Chinese", 
            "Meat", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2006/11/party-of-five/", 
        "title": "hoisin-honey pork riblets", 
        "directions": [
            "1. Put all ingredients except salt and pepper into food processor and pulse a few times to mince carrots. Then let machine run for a minute or so until mixture is chunky-smooth.", 
            "2. Taste and add salt and pepper to taste. Serve immediately or cover tightly and refrigerate for up to several days."
        ], 
        "date": "2006-11-19T22:47:28+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/pasta-and-fried-zucchini-salad1.jpg?w=640", 
        "tags": [
            "Pasta", 
            "Peas", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Summer Squash", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2014/06/pasta-and-fried-zucchini-salad/", 
        "title": "pasta and fried zucchini salad", 
        "directions": [
            "Bring a large pot of salted water to a boil. ", 
            "While you’re waiting, in a medium saucepan or skillet, heat sunflower oil over medium-high heat. Fry zucchini slices in batches for about 3 to 4 minutes, flipping once, until golden on both sides. [Update to add: If your zucchini isn’t browning right away, bump up the heat until it does in just a few minutes.] Drain in colander, shaking with a couple pinches of salt, then transfer to a large bowl and pour vinegar on top. Set aside.", 
            "In the hot water, cook edamame for 3 minutes, frozen peas for 3 to 4 minutes, or fresh peas for 1 to 2 minutes (to taste). Drain and run cool water over until lukewarm. Set aside to dry. Leave pot boiling, then cook pasta until al dente in it. Drain and rinse under cold water. ", 
            "Combine half of basil and all of the parsley and olive oil in a food processor or blender. Blend until smooth, then season with salt and pepper.", 
            "Transfer pasta back to empty pot. Add fried zucchini and any juices, basil-parsley oil, edamame or peas, lemon zest, capers and mozzarella. Stir gently together, then season generously with salt and pepper. Right before you serve it, stir in remaining basil leaves. ", 
            "Do ahead: Assembled dish keeps in the fridge for at least a day, or so I hear."
        ], 
        "date": "2014-06-09T11:53:03+00:00"
    }, 
    {
        "ingredient_list": [
            "8 ounces regular whole-wheat thin spaghetti, vermicelli or angel hair", 
            "1 tablespoon extra-virgin olive oil", 
            "2 cloves garlic, minced", 
            "1/3 cup chopped flat-leaf parsley", 
            "1/4 cup pitted chopped Spanish or Greek olives", 
            "2 tablespoons capers", 
            "1 teaspoon anchovy paste", 
            "1 tablespoon fresh oregano leaves or 1 teaspoon dried", 
            "1/8 teaspoon crushed red pepper flakes", 
            "1 (14-ounce) can diced tomatoes", 
            "3/4 cup chopped fresh arugula", 
            "1/4 cup grated Parmesan", 
            "Artichoke prep:", 
            "3 to 4 artichokes", 
            "Glug of white wine", 
            "2 garlic cloves, smashed", 
            "Salt", 
            "2 lemons", 
            "Vinaigrette:", 
            "1 tablespoon olive oil", 
            "1 1/2 teaspoons sherry or champagne vinegar", 
            "Few drops of honey", 
            "1/2 teaspoon Dijon mustard", 
            "Pinch of truffle salt, or whichever salt you prefer", 
            "1 tiny head of radicchio", 
            "2 endives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pasta-puttanesca-broken-artichoke-hearts-salad1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Pasta", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/02/pasta-puttanesca-broken-artichoke-hearts-salad/", 
        "title": "pasta puttanesca, broken artichoke hearts salad", 
        "directions": [
            "Freshly ground black pepper, to taste", 
            "Carve out the artichoke hearts (the drama!): Halve one lemon. Remove all leaves from the artichokes, including the dark outer ones, the lighter yellow interior leave and the thorny purple/pink ones near the heart. Rub all exposed areas with a lemon half. Trim the stalk, cutting down the length of it to about one inch and shaving off any dark green nubs or imperfections–rub lemon on this too. Trim the dark green stumps the leaves have left behind, again, coat this with lemon. Using a paring knife or grapefruit spoon, remove the fuzzy choke completely, then squeeze some lemon juice over the heart. Save the mostly used-up lemon halves. [Becks & Posh have an excellent step-by-step tutorial on this process, with pictures, for those who want further instruction.]", 
            "Bring a small/medium saucepan 2/3 to boil with enough water to cover the artichokes, the glug of white wine, smashed garlic gloves, a couple pinches of salt and the not-discarded lemon halves you’d used in the first step. Once it is boiling, add the prepared artichoke hearts. Boil them for about 20 to 25 minutes, until they are tender. (The tip of a sharp knife should easily go through them.)", 
            "Drain the artichoke hearts and toss them with juice of the second lemon while they cool. Set them aside, briefly. Meanwhile, make your dressing in the bottom of your salad bowl, whisking all vinaigrette ingredients. Thinly slice your radicchio and endives and toss them with the vinaigrette. Lightly smash the artichoke hearts that have been set aside, and toss these in as well. Season with freshly ground black pepper to taste. "
        ], 
        "date": "2008-02-16T12:15:49+00:00"
    }, 
    {
        "ingredient_list": [
            "Roasted tomatoes", 
            "4 cups (about 680 grams) grape tomatoes", 
            "Olive oil", 
            "Salt", 
            "Oregano dressing", 
            "1 big clove or 2 small cloves garlic", 
            "1 1/2 tablespoons dried oregano (if you can find it, Sicilian is my favorite)", 
            "1 1/4 teaspoons kosher salt, plus more to taste", 
            "Freshly ground black pepper", 
            "3 tablespoons lemon juice", 
            "3 tablespoons red or white wine vinegar", 
            "1/3 cup olive oil", 
            "Assembly", 
            "1 pound (455 grams) dried pasta, a bite-sized shape of your choosing (I used reginetti), cooked until 1 to 2 minutes before doneness and drained", 
            "6 ounces (170 grams) crumbled salty cheese, such as ricotta salata, feta, queso fresco (I used this posh, delicious stuff)", 
            "1/2 cup (70 grams) pine nuts, well-toasted and cooled", 
            "1/2 cup (70 grams) pitted and rough-chopped olives of your choice (I used gaeta here, but like them even more when oil-cured)", 
            "Salt and pepper", 
            "Handful fresh basil leaves, roughly chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pasta-salad-with-roasted-tomatoes1.jpg?w=640", 
        "tags": [
            "Pasta", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/05/pasta-salad-with-roasted-tomatoes/", 
        "title": "pasta salad with roasted tomatoes", 
        "directions": [
            "Roast tomatoes: Heat oven to 300°F (150°C). Cover 1 to 2 baking sheets with parchment paper or a nonstick baking mat. Cut each small tomato in half lengthwise and arrange cut side up in a single layer on prepared sheets. Drizzle lightly with olive oil and sprinkle with salt. Bake in oven for approximately 90 minutes, until somewhat shriveled and dry to the touch, but not fully dehydrated. Set aside until needed, letting them cool. [Note, if you pine nuts are not yet toasted, you can place them in the oven for the last 10 minutes, shaking them once or twice for even coloring. Let cool as well before using.]", 
            "Make dressing: Roughly chop the garlic on a cutting board, then add oregano, salt and a few grinds of black pepper. Mince the mixture with your knife until it’s a grainy herb paste. Transfer to a small bowl, whisk in lemon juice and vinegar, then slowly drizzle in oil, whisking the whole time. Taste and adjust as needed; you might need more salt or vinegar. You want a strongly flavored dressing that won’t get lost in that big bowl of ingredients.", 
            "Assemble salad: In a giant bowl, place drained pasta, roasted tomatoes, cheese, pine nuts and olives and toss gently to combine. Add dressing to taste, along with any extra salt and pepper needed. Finish with basil. Salad can be eaten right away, but will keep in the fridge up to 3 days. This is also perfect for picnics and potlucks, as it can handle being out in the sun without going south."
        ], 
        "date": "2015-05-27T11:58:05+00:00"
    }, 
    {
        "ingredient_list": [
            "4 pounds small Yukon gold or red-skinned potatoes, quartered", 
            "1 pound green beans, cut into one-inch segments", 
            "1 to 2 small garlic cloves, peeled", 
            "2 bunches of basil (about one ounce each)", 
            "1/4 to 1/2 cup olive oil", 
            "6 tablespoons (or more to taste) mild vinegar, such as champagne, white wine or a white balsamic", 
            "1/4 cup chopped green onions (scallions)", 
            "1/2 cup pine nuts, toasted", 
            "Parmesan cheese to taste", 
            "Salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/pesto-potato-salad-with-green-beans.jpg?w=753", 
        "tags": [
            "Green Beans", 
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/06/pesto-potato-salad-with-green-beans/", 
        "title": "pesto potato salad with green beans", 
        "directions": [
            "Cook potatoes in large pot of boiling salted water until just tender, about 10 minutes. Add beans; cook four minutes longer. Drain well and let cool, then transfer potatoes and beans to a large bowl.", 
            "Meanwhile, discard the stems from the basil and wash and dry the leaves. Puree them in a food processor with garlic, drizzling in enough olive oil that it gets saucy. Season the pesto with salt and pepper. [Alternately, you can swap this step with one cup of prepared pesto, but seriously, I think you’ll be missing out.]", 
            "Toss the beans and potatoes with pesto. Stir in vinegar, green onions, pine nuts and season with salt, pepper and/or additional vinegar to taste. Finally, shave some wide flecks of parmesan over the salad with a vegetable peeler.", 
            "Serve immediately, or make this up to two hours in advance. It can be stored at room temperature."
        ], 
        "date": "2009-06-01T13:58:28+00:00"
    }, 
    {
        "ingredient_list": [
            "Brine", 
            "1 1/2 cups white vinegar", 
            "1 1/2 cups water", 
            "1/3 cup granulated sugar", 
            "1/2 teaspoon celery seed", 
            "1 tablespoon plus 2 teaspoons kosher salt* plus more to taste  ", 
            "Salad", 
            "1 small head (2 pounds) green cabbage", 
            "1 red bell pepper", 
            "1 carrot (I used only 1/2 my very thick one)", 
            "1 kirby cucumber"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/pickled-cabbage-salad1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cabbage", 
            "Gluten-Free", 
            "Photo", 
            "Pickled", 
            "Salad", 
            "Side Dish", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/11/pickled-cabbage-salad/", 
        "title": "pickled cabbage salad", 
        "directions": [
            "Mix brine ingredients in the bottom of a medium bowl and set aside. ", 
            "Prepare your vegetables: Trim and core cabbage and slice thinly with a knife, food processor slicing blade or adjustable-blade slicer. Place in a large bowl. Core, seed and thinly slice red pepper; peel and thinly slice or julienne carrot; thinly slice cucumber (I quartered mine first). Add vegetables to cabbage bowl.", 
            "By the time you’re done preparing your vegetables, the sugar and salt should in the pickling mixture should have dissolved. If not, whisk a few times until they do. Taste and adjust if you’d like it a little saltier — I added 1 more teaspoon of kosher salt in the end. ", 
            "Pour pickling brine over vegetables and cover bowl with a lid or plastic wrap. Refrigerate for 1 hour or up to 1 week. Salad becomes more pickled as it rests. Eat with everything. ", 
            "* Not all salts are weighted equally: Read more here. I used Morton brand, which for 1 tablespoon plus 2 teaspoons clocks in at 24 grams. If using table or fine sea salt, use only 4 teaspoons. "
        ], 
        "date": "2014-11-10T11:46:07+00:00"
    }, 
    {
        "ingredient_list": [
            "Pickling mixture", 
            "1 cup distilled white vinegar", 
            "4 tablespoons sugar", 
            "2 tablespoons Kosher salt", 
            "2 tablespoons yellow mustard seeds", 
            "1 cup cold water", 
            "Slaw mixture", 
            "4 to 5 cups mixed slivered or julienned* firm, raw vegetables (see above for vegetable suggestions, below for slicing tips)", 
            "Optional: Few slivers of jalapeno"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/06/pickled-vegetable-sandwich-slaw.jpg?w=750", 
        "tags": [
            "Photo", 
            "Pickled", 
            "Picnics", 
            "Salad", 
            "Sandwich", 
            "Side Dish", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/06/pickled-vegetable-sandwich-slaw/", 
        "title": "pickled vegetable sandwich slaw", 
        "directions": [
            "Heat vinegar, sugar, salt and mustard seeds to a simmer in a small, non-reactive pot over moderate heat, stirring only until sugar and salt dissolve. Stir in water, which should bring the mixture’s temperature down significantly. Let cool to lukewarm. ", 
            "Divide vegetables between jars. (I used two 3/4 liter jars.) Pour vinegar mixture over vegetables and refrigerate until needed. You’ll find the vegetables to be lightly pickled within an hour, and deliciously pickled within a day. They will get slightly more pickled as they sit, but the change shouldn’t be too dramatic from the 24 hour level.", 
            "Eat with/on sandwiches, aside grilled food and pack it along for picnics — it goes with almost anything. Then make more, because this stuff is habit-forming.", 
            "Do ahead: Mine have kept in the fridge for a month without any change in taste or appearance. Updated to add (thanks, Erika!) that you’ll want to make sure that your vegetables are submerged in the brine for them to keep this long.", 
            "* I used a mix of a sharp knife, a simple mandoline (that includes julienne blades) and a julienne peeler (the Kuhn one), which I was embarrassed to admit I bought last year until I realized how much easier it makes getting juliennes from long, thin vegetables (carrots, cucumbers, parsnips and zucchini). Don’t fret if you don’t have a fancy peeler or mandoline; you can cut thin strips with your knife, then slice them into skinny matchsticks quite easily."
        ], 
        "date": "2013-06-27T11:28:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds fingerlings, or small red or yukon gold potatoes", 
            "4 large eggs", 
            "1/4 pound frisee (French curly endive) or another sturdy lettuce", 
            "6 ounces slab bacon or thick-cut bacon slices", 
            "2 tablespoons finely chopped shallot", 
            "3 tablespoons red wine vinegar", 
            "1/2 teaspoon smooth Dijon mustard", 
            "2 ounces crumbled blue cheese, or more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/potatoes-with-soft-eggs-and-warm-bacon-vinaigrette1.jpg?w=750", 
        "tags": [
            "Brunch", 
            "Budget", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2015/03/potatoes-with-soft-eggs-and-bacon-vinaigrette/", 
        "title": "potatoes with soft eggs and bacon vinaigrette", 
        "directions": [
            "Cook potatoes: In a large saucepan, cover potatoes with cold water, set a timer for 25 minutes (for small red or gold potatoes), and bring to a boil. Once boiling, reduce to a simmer. Cook until tender but not falling apart, which for small red potatoes usually takes me 25 minutes (fingerlings, because they’re thinner, might be worth checking at 20). Drain and when cool enough to touch, but still hot, halve lengthwise and arrange cut side up on a platter.", 
            "Meanwhile, cook eggs: Bring medium saucepan of water to a boil. Lower eggs into it and boil for five (for a runnier egg) to six (for a less-runny but still loose egg) minutes. Drain and rinse egg briefly under cool water until cool enough to handle and carefully peel — because the egg inside is so soft, I recommend chipping off smaller pieces at a time and running it under water as needed so you don’t accidentally rip it open. Set aside. ", 
            "Prep salad: Tear frisee into bite-size pieces and put in a large bowl. ", 
            "Right before you’re ready to serve everything, make vinaigrette: If using slab bacon, cut lengthwise into 1/4-inch thick slices, then 1/4-inch thick sticks (lardons); if using bacon slices, just cut them crosswise into 1/4-inch lardons. Cook bacon in a heavy skillet over moderate heat, until bacon is 3/4 as crisp as you’d like it to get. Add shallots, and cook for 1 minute more. Whisk in red wine vinegar and Dijon and let simmer for 10 seconds. Immediately pour 3/4 hot dressing over potatoes and last 1/4 over frisee in bowl, tossing the lettuce to combine evenly. Season both with salt and pepper. ", 
            "To finish: Top dressed potatoes with peeled eggs and use a knife to cut them into quarters, so they break open over the potatoes. Season cut eggs with salt and pepper again, sprinkle potato dish with blue cheese. Serve with frisee on the side or on top.", 
            "Note: I’ve made this a few times (can you blame me?) and sometimes I got a lot of “renderings” from the bacon and had more than enough dressing for the potatoes and side bowl of lettuce and a couple times it felt a little scant. If you don’t feel like you have enough dressing to stretch over the potatoes and lettuce, just cover the potatoes well. The lettuce can be always be lightly dressed with a splash of olive oil, teaspoon of red wine vinegar plus the salt and pepper."
        ], 
        "date": "2015-03-16T12:00:58+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/prague-vienna-and-a-mixed-salad1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Salad", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/05/prague-vienna-and-a-mixed-salad/", 
        "title": "prague, vienna and a mixed salad", 
        "directions": [], 
        "date": "2008-05-13T12:44:30+00:00"
    }, 
    {
        "ingredient_list": [
            "1 extra-large egg yolk (I used one large and a smidgen of another)", 
            "1/2 cup plus 2 tablespoons grapeseed oil (suggested for its neutrality; I used half olive oil but suggest you do so sparingly as the olive flavor becomes very pronounced)", 
            "2 tablespoons finely diced shallot", 
            "1 to 2 lemons, for juicing", 
            "1/4 cup crème fraîche (did you know you can make your own?)", 
            "1/4 cup buttermilk (did you know you can make your own?)", 
            "2 apples, firm, crisp and juicy", 
            "2 pears, Asian or your favorite variety", 
            "2 heads radicchio", 
            "2 tablespoons sliced mint", 
            "1 tablespoon chopped flat-leaf parsley", 
            "Kosher salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/radicchio-apple-and-pear-salad1.jpg?w=500", 
        "tags": [
            "Apple", 
            "Pear", 
            "Photo", 
            "Radicchio", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2010/04/radicchio-apple-and-pear-salad/", 
        "title": "radicchio, apple and pear salad", 
        "directions": [
            "Place the egg yolk in a stainless steel bowl. Begin whisking in the grapeseed oli drop by drop, as slowly as you can bear. (I find having a second person dripping it in makes it easier.) Continue in this manner until the mixture begins to thicken.Once the mayo has emulsified, you can add the rest of the oil in a slow, steady stream (however, as a beginner, I still take it very slowly), whisking all the time. Arm getting tired? Try to murmur “jiggle-free upper arms… sleeveless sundresses…” to yourself. I find it helps.", 
            "Combine the shallot, 1 tablespoon lemon juice and 1/2 teaspoon salt in a small bowl and let it sit for 5 minutes. Whisk in the crème fraîche and buttermilk. Gently whisk this mixture into the mayonnaise, and taste for balance and seasoning.", 
            "Slice the apples and pears away from the core. Cut into 1/8-inch thick slices (I went even thinner, using a mandoline) and place them in a large salad bowl. Tear the radicchio into bite-sized pieces and add to the salad bowl. Toss salad with half of dressing (Goin suggests three-fourths but I found this to make an overly-creamy salad; you can always add more) and season with salt and pepper. Add a squeeze of lemon juice and a little more dressing if necessary.", 
            "Transfer to a platter (chilled, if you’re being fancy) and scatter the mint and parsley on top."
        ], 
        "date": "2010-04-04T12:16:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 lb eggplant, cut into 1/2-inch cubes", 
            "3/4 lb zucchini, cut into 1/2-inch cubes", 
            "10 tablespoons extra-virgin olive oil", 
            "1 teaspoon salt", 
            "1 teaspoon black pepper", 
            "1 cup chopped scallion (from 1 bunch)", 
            "1 1/2 teaspoons ground cumin", 
            "1/2 teaspoon ground coriander", 
            "1/4 teaspoon cayenne (note: I used 1/8 tsp. and it was plenty spicy; adjust to taste)", 
            "1 1/4 cups pearl barley (8 oz)", 
            "1 (14-oz) can reduced-sodium vegetable or chicken broth (1 3/4 cups)", 
            "3/4 cup water", 
            "2 tablespoons fresh lemon juice", 
            "1 garlic clove, minced", 
            "1/4 teaspoon sugar", 
            "1/2 lb cherry tomatoes, quartered", 
            "1/3 cup Kalamata or other brine-cured black olives, pitted and halved", 
            "1/2 cup thinly sliced red onion, rinsed and drained if desired", 
            "1 cup chopped fresh flat-leaf parsley", 
            "1/2 cup chopped fresh mint"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/03/mediterranean-eggplant-and-barley-salad.jpg?w=750", 
        "tags": [
            "Eggplant", 
            "Grain/Rice", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/03/recipe-liberation-day/", 
        "title": "mediterranean eggplant and barley salad", 
        "directions": [
            "Accompaniment: 1 (1/2-lb) piece ricotta salata, cut crosswise into thin slices ", 
            "Roast eggplant and zucchini: Put oven racks in upper and lower thirds of oven and preheat oven to 425°F.", 
            "Toss eggplant and zucchini with 5 tablespoons oil, 3/4 teaspoon salt, and 3/4 teaspoon pepper in a bowl, then spread in 2 oiled large shallow (1-inch-deep) baking pans. Roast vegetables in oven, stirring occasionally and switching position of pans halfway through baking, until vegetables are golden brown and tender, 20 to 25 minutes total. Combine vegetables in 1 pan and cool, reserving other pan for cooling barley.", 
            "Cook barley: Heat 2 tablespoons oil in a 3- to 4-quart heavy pot over moderately high heat until hot but not smoking, then cook scallion, cumin, coriander, and cayenne, stirring, until fragrant, about 1 minute. Add barley and cook, stirring until well coated with oil, 2 minutes more. Add broth and water and bring to a boil. Reduce heat and simmer, covered, until all of liquid is absorbed and barley is tender, 30 to 40 minutes. Remove from heat and let stand, covered, 5 minutes. Transfer to reserved shallow baking pan and spread to quickly cool, uncovered, to room temperature, about 20 minutes.", 
            "Make dressing and assemble salad: Whisk together lemon juice, garlic, sugar, and remaining 1/4 teaspoon salt, 1/4 teaspoon pepper, and 3 tablespoons oil in a large bowl. Add barley, roasted vegetables, and remaining ingredients to bowl with dressing and toss until combined well. Serve with cheese slices.", 
            "Do ahead: Salad can be made 1 day ahead and chilled, covered. Return to room temperature before serving."
        ], 
        "date": "2007-03-15T11:33:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup pine nuts or sliced almonds, toasted* and cooled", 
            "1 pound asparagus, rinsed", 
            "1 lemon, halved", 
            "Olive oil", 
            "Coarse salt", 
            "Freshly ground black pepper", 
            "1 to 2 ounces Parmesan cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/ribboned-asparagus-salad-with-lemon1.jpg?w=500", 
        "tags": [
            "Asparagus", 
            "Budget", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2011/05/ribboned-asparagus-salad-with-lemon/", 
        "title": "ribboned asparagus salad with lemon", 
        "directions": [
            "No need to snap off the tough ends of your asparagus. Lay a single stalk on its side on a cutting board. Holding onto the tough end, use a vegetable peeler (a Y-shaped peeler is easiest, but I’ve used a standard one successfully) to shave off thin asparagus ribbons from stalk to tip, peeling away from the tough end in your hand. [Updated] Discard the tough ends once you’re done peeling. Gently pile your ribbons on a medium-sized serving platter. Squeeze some lemon juice over the asparagus, drizzle it with a bit of olive oil and sprinkle it with salt and pepper. Toss gently and then use your peeler to shave curls of Parmesan right off the block, over the asparagus. Sprinkle with some toasted nuts. Repeat with remaining asparagus, a third of the remaining bundle at a time. Eat immediately.", 
            "* I toast mine in a single layer on a baking sheet at 350 for 5 to 10 minutes. It’s really important, especially with pine nuts, that you stay close and toss them frequently because they love to burn, but if you move them around a bit, you can get a wonderful, even coffee coffee color on them and an intensely nutty flavor. It makes even unfancy nuts taste amazing."
        ], 
        "date": "2011-05-02T14:41:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound carrots, scrubbed or peeled and cut into two-inch segments (angled if you’re feeling fancy)", 
            "3 tablespoons olive oil, divided", 
            "1/4 teaspoon ground cumin", 
            "Coarse salt and freshly ground black pepper", 
            "1/2 an avocado, pitted and sliced (we had a mega-‘cado and only used 1/4 of it)", 
            "Juice of half a lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-carrot-and-avocado-salad1.jpg?w=500", 
        "tags": [
            "Avocado", 
            "Carrots", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2009/08/roasted-carrot-and-avocado-salad/", 
        "title": "roasted carrot and avocado salad", 
        "directions": [
            "Roast the carrots: Preheat your oven to 400 degrees. Toss the carrot chunks in a medium bowl with two tablespoons of the olive oil, cumin and as generous of a helping of salt and pepper as you like. (We like a lot. Especially with sweet things like carrots.)", 
            "Spread them on a roasting sheet (I lined ours with foil because despite having a dishwasher these days, old must-create-fewer-dishes-at-all-times habits die hard) and roast for about 20 minutes, or until tender and browned. Of course, roasting time will vary depending on the thickness of your carrots. Our heftier chunks took over 30.", 
            "Finish the salad: Once the carrots are roasted, arrange them on a serving platter with slices of avocado on top. Drizzle the salad with the last tablespoons of olive oil, lemon juice and extra salt and pepper, if it needs it. Eat immediately."
        ], 
        "date": "2009-08-03T09:53:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 to 2 tablespoons plus 4 teaspoons olive oil", 
            "1 1/2 pounds eggplant (about 2 medium), in 3/4- to 1-inch slices", 
            "2 ounces (1/2 cup) chopped or crumbled ricotta salata", 
            "2 tablespoons capers, drained", 
            "1/3 cup finely diced red onion", 
            "3 seeded, diced medium tomatoes (1 1/2 cups)", 
            "3 tablespoons minced fresh mint leaves", 
            "2 teaspoon red wine vinegar", 
            "Freshly ground black pepper."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-eggplant-with-tomatoes-and-mint1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Eggplant", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/09/roasted-eggplant-with-tomatoes-and-mint/", 
        "title": "roasted eggplant with tomatoes and mint", 
        "directions": [
            "Preheat oven to 425 degrees. Coat a large baking sheet generously with olive oil, about 1 to 2 tablespoons. Arrange eggplant rounds in a single layer. Sprinkle with salt and freshly ground black pepper. Roast, without disturbing, for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release from the pan with no effort. If they’re not, let it cook longer. Once flipped, sprinkle them with additional salt and freshly ground black pepper and return the pan to the oven for another 10 to 12 minutes or so, until the undersides match the tops.", 
            "[Alternatively, on the grill: Brush eggplant slices with oil; sprinkle with salt and pepper. Grill eggplant slices until slightly charred and tender when pierced with knife, about 5 to 7 minutes per side.]", 
            "Meanwhile, mix your ricotta, capers, onion, tomatoes, mint, vinegar and remaining 4 teaspoons olive oil in a small bowl. Taste for seasoning; ricotta salata tends to be quite salty so I don’t find that this dish needs more than a pinch of salt, if that. Add more vinegar, if desired. Add freshly ground black pepper, to taste.", 
            "When the eggplant discs are done, arrange them on a serving platter. Scoop a spoonful of the salad over each round. Eat immediately."
        ], 
        "date": "2011-09-08T22:11:12+00:00"
    }, 
    {
        "ingredient_list": [
            "6 bell peppers (if you can get a mix of colors, go for it)", 
            "1/4 cup red wine vinegar", 
            "1 clove garlic, minced", 
            "Salt, to taste", 
            "Freshly ground black pepper, to taste", 
            "2 tablespoons extra-virgin olive oil", 
            "2 tablespoons capers, drained", 
            "2 tablespoons flat-leaf parsley, chopped (optional)", 
            "1/2 pound ball of mozzarella, sliced (this is a great place to use the really fresh stuff, if you can get it)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-peppers-with-capers-and-mozzarella1.jpg?w=500", 
        "tags": [
            "Italian", 
            "Peppers", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/06/roasted-peppers-with-capers-and-mozzarella/", 
        "title": "roasted peppers with capers and mozzarella", 
        "directions": [
            "Roast the peppers: Preheat the oven to 400 degrees. Line peppers on a large baking sheet and roast them for 45 minutes to 1 hour, using tongs to rotate them 1/4 of the way, rotisserie-style, every 15 minutes. It’s safer to extend the cooking time than shorten it, as the skins will only come off easily if they’re fully cooked.", 
            "Once they’re fully roasted, cover the pepper tray with another piece of foil and let the peppers cool. When they’re cool enough to handle, remove the skins. Remove seeds and slice sections of pepper into 1/4-inch wide strips.", 
            "Toss peppers with red wine vinegar, garlic and a few pinches of salt. Cover and let marinate for an hour or overnight (and up to 4 days) in the fridge. ", 
            "To serve, arrange peppers on a plate. Adjust seasonings, adding salt, freshly ground black pepper or additional vinegar, to taste. Drizzle with olive oil, sprinkle with capers and parsley and arrange mozzarella over salad.", 
            "Eat with some crusty bread and a glass of wine, preferably al fresco."
        ], 
        "date": "2011-06-08T11:09:56+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds medium red-skinned potatoes, unpeeled, scrubbed", 
            "8 dill pickle spears or a handful of cornichon, coarsely chopped (about 1 1/2 cups)", 
            "3 celery stalks, chopped (about 1 cup)", 
            "1 small red onion, chopped (about 1 cup)", 
            "3 hard-boiled eggs, peeled, chopped", 
            "2/3 cup mayonnaise", 
            "2 tablespoons Dijon mustard", 
            "2 tablespoons apple cider vinegar", 
            "2 tablespoons minced fresh dill", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/roseanne-cash-all-american-potato-salad.jpg?w=750", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2007/07/rosanne-cash-all-american-potato-salad/", 
        "title": "rosanne cash’s all-american potato salad", 
        "directions": [
            "A few hours before serving or, even better, the day before: Place potatoes in medium-sized pot and cover with a few inches of salted water. Bring to a boil and cook until fork-tender, about 30 minutes. Drain and cool completely. (Overnight in the fridge makes this easy, and the potatoes even easier to slice cleanly the next day.)\nTo assemble and serve: Cut cooled potatoes into chunks and transfer to large bowl. Add pickles, celery, onion, and eggs. Combine mayonnaise, mustard, vinegar, and dill in a jar. Stir about half of dressing into salad, tossing to combine evenly. Add more dressing to taste, and season well with salt and pepper.", 
            "Do ahead: Keep dressing and vegetables separate until just before serving. Potato salad keeps for up to 4 days in fridge. Leftover dressing should keep for a couple weeks."
        ], 
        "date": "2007-07-05T23:23:15+00:00"
    }, 
    {
        "ingredient_list": [
            "Dressing", 
            "4 1/2 tablespoons toasted sesame seeds, plus more for garnish", 
            "3 tablespoons water", 
            "3 tablespoons soy sauce (use low-sodium for a less salty sauce)", 
            "2 tablespoons plus 1 teaspoon tahini", 
            "2 tablespoons plus 1 teaspoon  rice vinegar", 
            "1 1/2 tablespoons toasted sesame oil", 
            "3/4 teaspoon granulated sugar, or more to taste", 
            "Chili sesame oil to taste", 
            "Omelet Ribbons", 
            "Neutral cooking oil, to coat skillet", 
            "3 large eggs", 
            "3 teaspoons water", 
            "A few pinches sugar", 
            "A few pinches salt", 
            "Assembly", 
            "1 9.5-ounce package buckwheat soba noodles", 
            "Raw vegetables of choice (we used julienned carrots, cucumbers and radishes, plus some snipped chives on top, which have recently reappeared in my garden!)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/sesame-soba-and-ribboned-omelet-salad1.jpg?w=750", 
        "tags": [
            "Japanese", 
            "Photo", 
            "Put An Egg On It", 
            "Salad", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/03/sesame-soba-and-ribboned-omelet-salad/", 
        "title": "sesame soba and ribboned omelet salad", 
        "directions": [
            "Make the dressing: Put the toasted sesame seeds into a blender or food processor and run the machine until the seeds look like wet sand — it will take a couple minutes. Add the water, soy sauce, tahini, rice vinegar, sesame oil, sugar, salt and chili sesame oil and blend until combined. Taste and adjust ingredients to your preferences. ", 
            "Make the omelet ribbons: Whisk eggs with water, sugar and salt until well-blended and even in color. Heat a 10-inch skillet (I really like using a nonstick here and for other crepe-like things) over medium and coat very lightly with cooking oil. Pour in 1/3 of mixture, which will be enough to coat the pan very thinly. (If your pan is bigger or smaller, use less or more accordingly per batch, the goal is to keep the egg very thin.) Cook for 1 to 2 minutes, until the egg has set and the edges look dry. Carefully flip* the omelet and cook for 20 to 30 seconds on second side. Flip egg out onto paper towel to blot oil and repeat 2 more times. ", 
            "Stack the three omelets together and roll them into a log. Use a sharp knife to slice the roll into very thin ribbons, thinner even than you see in my photos. ", 
            "Cook the noodles: In well-salted water until tender but firm for the time recommended on your package of noodles, usually 4 to 5 minutes. Drain noodles and run cold water over them to cool. Drain again, shaking out excess water.", 
            "To serve: My favorite way for a family meal is to put everything out in separate dishes and let each of us assemble to taste. (Or, if you’re this one, grab the bowl of egg ribbons and help yourself.) Or, you can toss the noodles with about half the sauce, then arrange it in a bowl with the omelet ribbons on top, followed by your vegetables. Garnish with extra sesame seeds and serve with additional sauce on the side. ", 
            "* One day, when I have video on this site, I will demonstrate my crepe-flipping “method” for you but hopefully this will help until then: I use two thin spatulas (such as offset icing spatulas or a flexible fish spatula). The first smaller one goes under the edge and lifts the omelet/crepe enough that I can hold the second larger spatula in my other hand and slide it under enough that it goes past the center of the omelet/crepe. From here, it’s easier to flip without tearing."
        ], 
        "date": "2016-03-16T12:06:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1 head cauliflower", 
            "2 tablespoons extra-virgin olive oil", 
            "1 small onion, chopped", 
            "2 cloves garlic, minced", 
            "1 quart low-sodium chicken stock", 
            "1/2 cup finely grated Parmesan", 
            "Salt and freshly ground black pepper ", 
            "2 tablespoons mayonnaise – or – 1 egg", 
            "1 tablespoon fresh lemon juice", 
            "1/2 teaspoon Dijon mustard", 
            "1 small garlic clove, minced", 
            "1/2 teaspoon Worcestershire sauce", 
            "1 oil-packed anchovy fillet, finely chopped (optional)", 
            "1/4 cup extra-virgin olive oil", 
            "10 to 12 ounces good-quality solid tuna packed in olive oil, well drained*", 
            "2 scallions washed, trimmed and chopped fine", 
            "6 pepperoncini peppers, destemmed and julienned", 
            "3 tablespoons chopped fresh dill", 
            "1/4 cup roasted or smoked almonds, chopped roughly, or a small handful toasted pine nuts", 
            "1/4 cup good-quality olive oil (or the oil the tuna was packed in)", 
            "1 tablespoon smooth Dijon mustard", 
            "1 tablespoon whole-grain mustard", 
            "1 teaspoon balsamic vinegar", 
            "1 teaspoon fresh lemon juice or more to taste", 
            "1/4 to 1/2 teaspoon freshly ground black pepper. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/09/silky-cauliflower-soup.jpg?w=749", 
        "tags": [
            "Cauliflower", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Seafood", 
            "Soup", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2006/09/silky-cauliflower-soup/", 
        "title": "silky cauliflower soup", 
        "directions": [
            "Mix all the ingredients well with a fork in a medium-size, nonreactive bowl. Taste and adjust the lemon juice and pepper. The salad can be made up to 3 days in advance and refrigerated. ", 
            "* I’ve done this two ways, with oil-packed and the reserved oil, as well as using drained water-packed and adding in 1/4 cup olive oil, and have to say that I find the latter to be a far less oil-slicked result. You can always add more olive oil, but I found it hard to take away the heaviness the oil-packed came with."
        ], 
        "date": "2006-09-03T11:54:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound skirt steak, trimmed of excess fat if necessary, halved crosswise, at room temperature", 
            "1 to 2 tablespoons olive oil", 
            "1 pint (2 cups) cherry tomatoes, halved", 
            "1/2 cup (about 4 ounces) crumbled blue cheese", 
            "1/2 pound baby arugula", 
            "Vinaigrette (below)", 
            "3 tablespoons minced chives, 2 thinly sliced scallions or 3 tablespoons finely chopped red onion, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/09/skirt-steak-salad-with-blue-cheese.jpg?w=749", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Salad", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/09/skirt-steak-salad-with-arugula-and-blue-cheese/", 
        "title": "skirt steak salad with blue cheese", 
        "directions": [
            "Whisk ingredients. Season with salt and pepper and adjust ingredients to taste (usually more Dijon and vinegar for me)."
        ], 
        "date": "2010-09-17T13:41:24+00:00"
    }, 
    {
        "ingredient_list": [
            "Steak", 
            "2 1 1/2 pound skirt steaks", 
            "Kosher salt", 
            "4 teaspoons (packed) brown sugar, light or dark", 
            "2 teaspoons paprika", 
            "1/2 teaspoon cayenne pepper, or to taste", 
            "1/2 teaspoon freshly ground black pepper", 
            "Vegetable oil (for brushing)", 
            "Salad", 
            "1 cup finely chopped red onion", 
            "3 tablespoons Sherry vinegar, divided", 
            "2 pounds cherry or grape tomatoes, halved (from about 3 pints or 10 ounce containers)", 
            "1 cup chopped celery hearts (inner stalks and leaves; from 1 bunch)", 
            "1/2 cup chopped brined green olives plus 2 tablespoons olive brine", 
            "2 tablespoons prepared horseradish", 
            "1 tablespoon Worcestershire sauce", 
            "1 teaspoon hot pepper sauce", 
            "1/2 teaspoon celery seeds", 
            "1/4 cup extra-virgin olive oil", 
            "Kosher salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/07/bloody-mary-steak-salad.jpg?w=750", 
        "tags": [
            "Grilling", 
            "Meat", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2011/07/skirt-steak-with-blood-mary-tomato-salad/", 
        "title": "skirt steak with bloody mary tomato salad", 
        "directions": [
            "Prepare steaks: Arrange steaks on large rimmed sheet or cutting board. Mix 1 teaspoon Kosher salt, dark brown sugar, paprika, cayenne and freshly ground black pepper together in a dish. Rub all over steaks and let them marinate in this rub for 1 to 3 hours, covered in the refrigerator. Remove steaks from fridge 1 hour before you’re ready to cook them, to bring them to room temperature.", 
            "Prepare salad: Pour 1 tablespoon sherry vinegar over onions in the bottom of a large bowl and let them sit for 10 minutes, stirring occasionally. This will temper the onion’s bite. Add tomatoes, celery and olives. Whisk remaining 2 tablespoons vinegar, reserved olive brine, horseradish, Worcestershire, pepper sauce and celery seeds in a medium bowl. Slowly drizzle in oil, whisking constantly until combined. Add to tomato salad and toss to coat. Season with salt and pepper to taste. Set aside until needed, and up to 4 hours in advance, if covered and refrigerated.", 
            "Cook steaks: Preheat a charcoal grill to medium-high or a gas grill to the highest heat. Brush grill grates with oil. Grill steaks for about 4 to 5 minutes on each side for medium-rare. Let rest for 10 minutes before slicing into 1/4-inch thick slices, against the grain.", 
            "Alternately, cook the steaks inside: Heat a large cast-iron skillet on medium-high to high and coat bottom with oil. When oil begins to shimmer, place steak in skillet and do not move it for 5 minutes. Turn it once, and cook for another 3 minutes for medium-rare. Repeat with second steak. If your steaks are too large to cook in one piece, you may halve them to fit. Let rest for 10 minutes before slicing into 1/4-inch thick slices, against the grain."
        ], 
        "date": "2011-07-05T10:50:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup chopped red onion", 
            "1/4 cup roughly chopped capers", 
            "1/4 cup chopped cornichons, plus 2 tablespoons of the juice", 
            "1 tablespoon Dijon mustard", 
            "2 cups mayonnaise (the book recommends Hellmans, amusingly enough)", 
            "3/4 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "5 tablespoons sherry vinegar", 
            "1/2 teaspoon sugar", 
            "5 cups julienned Savoy or green cabbage (or 3 cups red cabbage, julienned, and 2 cups green cabbage for a more colorful presentation)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/slaw-tartare1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Disasters", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/05/slaw-tartare/", 
        "title": "slaw tartare", 
        "directions": [
            "Mix everything but the cabbage in a small bowl. In a larger one, toss the cabbage with as much dressing as you like. Adjust the salt and pepper to taste. Refrigerating a couple hours before serving allows the flavors to meld well, and the cabbage to soften slightly."
        ], 
        "date": "2009-05-21T12:18:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 15-ounce can chickpeas, drained and rinsed", 
            "2 tablespoons pitted, halved and very thinly sliced black olives", 
            "1 tablespoon finely chopped red onion", 
            "1 tablespoon chopped fresh parsley", 
            "Zest and juice from half a lemon (if you’ve got one of those sad, juiceless lemons, use both sides for juice)", 
            "Couple good pinches of salt", 
            "A few grinds of black pepper", 
            "A few glugs of olive oil (the original is quite oily, like bread-soaking oily, I went a little lighter. Both ways are delicious)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/smashed-chickpea-salad1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Budget", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2009/01/smashed-chickpea-salad/", 
        "title": "smashed chickpea salad", 
        "directions": [
            "Mix everything but the olive oil in a small to midsize bowl. Very lightly smash the chickpea mixture with the back of a fork or a potato masher. You’re not looking for a hummus-like puree but something closer to a coarse chop with a few smaller bits to hold it together. Add the glugs of olive oil, mix it lightly and enjoy.", 
            "This is also awesome as a sandwich on toasted bread, and it needs nothing else on it. But, if you want to doll it up, here are some ideas: A slice of roasted red pepper (as they do at ‘wichcraft), watercress (ditto), a slice of pickled garlicky red pepper (our way). We schmeared the bread with a tahini dressing, which was just tahini, lemon juice and a minced garlic clove thinned with water, but if you’ve got some harissa, I bet that would also be delicious."
        ], 
        "date": "2009-01-19T14:07:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup mayonnaise", 
            "1/2 cup sour cream", 
            "1 tablespoon prepared horseradish", 
            "1 tablespoon Worcestershire sauce", 
            "2 tablespoons Creole mustard, or a mustard that you prefer", 
            "1 teaspoon smoked paprika", 
            "Zest and juice from 2 lemons", 
            "2 tablespoons Tabasco sauce (see Note; I skipped this)", 
            "1 teaspoon cayenne powder (I used much less)", 
            "3 green onions, thinly sliced (white and green parts)", 
            "1 stalk celery, finely diced", 
            "1/2 jalapeño, finely chopped (I skipped this)", 
            "1/2 medium yellow onion, finely diced (and this)", 
            "1 pound skinned and flaked smoked whitefish", 
            "Salt and pepper, to taste", 
            "Saltine crackers to serve", 
            "1 tablespoons finely chopped chives, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/smoked-whitefish-dip-horseradish1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Photo", 
            "Recipes", 
            "Salad", 
            "Seafood", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2014/11/smoked-whitefish-dip-with-horseradish/", 
        "title": "smoked whitefish dip with horseradish", 
        "directions": [
            "Make the dressing by mixing mayonnaise, sour cream, horseradish, Worcestershire, mustard, paprika, zest and lemon juice, hot sauce (if using), cayenne (to taste), green onions, celery, jalapeño (if using) and onion in a medium bowl. Season with salt and pepper to taste.\nPlace skinned and flaked whitefish in a larger bowl. Add dressing to taste (we used about 3/4 of it total) and adjust seasonings with salt and pepper. Serve with crackers, garnished with chives.\n"
        ], 
        "date": "2014-11-03T11:53:27+00:00"
    }, 
    {
        "ingredient_list": [
            "Vinaigrette", 
            "1 tablespoon Dijon mustard", 
            "1 tablespoon Sherry wine vinegar", 
            "1/4 cup canola oil", 
            "1 teaspoon chopped fresh Italian parsley", 
            "1/2 teaspoon chopped fresh tarragon", 
            "Fine sea salt", 
            "Freshly ground black pepper", 
            "Potatoes", 
            "2 cups coarse sea salt", 
            "2 pounds fingerling potatoes (such as Ruby Crescent or Russian Banana)", 
            "2 small shallots, thinly sliced", 
            "2 hard-boiled eggs, peeled, chopped", 
            "2 green onions, thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/some-very-good-things1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2006/11/some-very-good-things/", 
        "title": "potato salad with sherry mustard vinaigrette", 
        "directions": [
            "For vinaigrette: Combine mustard and vinegar in small bowl. Whisk in oil, then herbs. Season with sea salt and pepper.", 
            "For potatoes: Preheat oven to 400°F. Spread sea salt in even layer on rimmed baking sheet; arrange potatoes over salt, spacing slightly apart. Cover sheet with foil and bake until potatoes are tender, about 1 hour. Remove from oven, uncover, and cool to lukewarm.", 
            "Meanwhile, cook bacon in medium skillet over medium heat until brown and crisp. Transfer to paper towels to drain. ", 
            "Peel potatoes; cut in half lengthwise. Place warm potatoes in medium bowl. Add bacon, shallots, eggs, onions, and vinaigrette. Toss well and serve."
        ], 
        "date": "2006-11-27T11:49:34+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup black or green lentils", 
            "6 cups peeled, seeded and cubed butternut squash or sugar pumpkin (1-inch cubes) (from about a 2-poudn squash)", 
            "3 tablespoons olive oil, divided", 
            "1 teaspoon ground cumin", 
            "1 teaspoon hot smoked Spanish paprika*", 
            "1/2 teaspoon coarse salt", 
            "4 cups baby arugula (I skipped this)", 
            "1 cup soft crumbled goat cheese", 
            "1/4 cup thinly sliced mint leaves (optional; I used this, but added it after I took a photo)", 
            "1 tablespoon red wine vinegar, plus additional to taste", 
            "Roasted seeds (about 1/2 cup) from your butternut squash (optional; see note above)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/spicy-squash-salad-with-lentils-and-goat-cheese.jpg?w=751", 
        "tags": [
            "Beans", 
            "Fall", 
            "Photo", 
            "Salad", 
            "Thanksgiving", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2010/10/spicy-squash-salad-with-lentils-and-goat-cheese/", 
        "title": "spicy squash salad with lentils and goat cheese", 
        "directions": [
            "Preheat oven to 400°F. Toss squash or pumpkin cubes with 2 tablespoons oil, cumin, paprika and salt. Arrange in a single layer on baking sheet and roast 20 minutes. Flip pieces and roast for an additional 10 to 15 minutes, until tender. Cool.", 
            "Meanwhile, soak lentils for 10 minutes in a small bowl, then drain. Cook lentils in boiling salted water until tender but firm, about 30 minutes. Rinse with cold water, then drain and cool.", 
            "Combine lentils, pumpkin, any oil you can scrape from the baking sheet (I didn’t get enough for this to be worth it) with arugula, if using, half of goat cheese, mint, vinegar, and 1 tablespoon oil. Season with salt and pepper and extra vinegar, if desired (we felt it needed it). Divide among plates and pass with remaining goat cheese to sprinkle.", 
            "* I swapped half with sweet (not hot) smoked paprika to make sure it didn’t get too spicy for a 13 month-old’s tastes. If you don’t have either on hand, there are ways to approximate this smoky/spiciness with what you have in your pantry, such as mixing some regular paprika with a ground chipotle powder or another smoky spice, and then a pinch of cayenne for extra heat."
        ], 
        "date": "2010-10-27T12:47:51+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces baby spinach", 
            "2 large white mushrooms, thinly sliced", 
            "1/4 small or medium red onion, very thinly sliced", 
            "1 large egg, hard-boiled (see above), chilled, peeled and thinly sliced", 
            "4 pieces thick-sliced bacon (about 4 ounces), finely diced", 
            "2 tablespoons red wine vinegar", 
            "1/2 teaspoon honey or sugar", 
            "1/2 teaspoon smooth Dijon mustard", 
            "Coarse salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/spinach-salad-with-warm-bacon-vinaigrette1.jpg?w=750", 
        "tags": [
            "Mushrooms", 
            "Photo", 
            "Salad", 
            "Spinach"
        ], 
        "url": "https://smittenkitchen.com/2012/11/spinach-salad-with-warm-bacon-vinaigrette/", 
        "title": "spinach salad with warm bacon vinaigrette", 
        "directions": [
            "Place spinach in a large, wide salad serving bowl. Scatter with mushrooms, red onion (see above for a different, mellower way to add the onions) and coins of hard-boiled egg. In a large skillet, fry bacon bits over medium-high heat until they’re brown and crisp and have rendered their fat. Use a slotted spoon to scoop them out of the skillet and spread them on a piece of paper towel briefly before sprinkling them over the salad. Pour out all but two tablespoons of hot bacon fat from the skillet. Reheat over medium and quickly whisk in the red wine vinegar, honey and Dijon. Pour over entire salad and season salt and pepper. Toss gently and serve hot. Repeat tomorrow night."
        ], 
        "date": "2012-11-23T13:27:45+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large skin-on, bone-in chicken breast (about 12 to 14 ounces)", 
            "About 2 1/2 tablespoons olive oil", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "Salt and freshly ground black pepper", 
            "1 tablespoon white wine vinegar", 
            "1/2 small cucumber, such as a Persian variety, halved, thinly sliced", 
            "1 small celery rib, sliced thin", 
            "3 radishes, quartered lengthwise, sliced thin", 
            "1 scallion, sliced thin", 
            "1 tablespoon chopped dill, chives or parsley, or a mix, for garnish", 
            "3 tablespoons creme fraiche", 
            "1 1/2 teaspoons prepared horseradish, liquid drained off a little, plus more to taste", 
            "2 to 3 thin slices rye, pumpernickel or another dense health bread, toasted "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/spring-chicken-salad-toasts1.jpg?w=750", 
        "tags": [
            "Celery", 
            "Chicken", 
            "Cucumber", 
            "Photo", 
            "Radishes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2016/03/spring-chicken-salad-toasts/", 
        "title": "spring chicken salad toasts", 
        "directions": [
            "Heat oven to 425°. Place chicken on a small rimmed baking sheet and rub with 1 tablespoon olive oil. Season with salt and pepper and roast until golden brown and cooked through, about 25 to 30 minutes. Let cool, then remove skin and bones and shred meat into bite-sized pieces. ", 
            "Place shredded chicken in a medium bowl and toss with 1 1/2 tablespoons olive oil, 1 tablespoon vinegar, 1/2 teaspoon kosher salt and freshly ground black pepper until evenly coated. Add cucumber, celery, radishes and scallion to salad and toss to combine. Adjust salt, pepper and vinegar to taste.", 
            "If you need horseradish crème fraîche\tin your life — I know I always do — combine crème fraîche, horseradish and a couple pinches salt in a small dish and stir to combine. ", 
            "Heap salad on 2 to 3 toasts (i.e. more on 2 or less on 3). Dollop with horseradish creme fraiche, if using, and garnish with herbs.", 
            "Do Ahead: Chicken can be cooked 2 days ahead; cover and chill. Shred just before using."
        ], 
        "date": "2016-03-28T12:00:20+00:00"
    }, 
    {
        "ingredient_list": [
            "For the croutons:", 
            "1/4 cup olive oil", 
            "2 cloves garlic, finely chopped", 
            "6 cups day-old bread, crust removed, cubed", 
            "6 tablespoons finely grated Parmesan, plus more for garnish", 
            "Salt and freshly ground black pepper", 
            "For the vinaigrette:", 
            "Half a red onion, finely diced", 
            "2 to 2 1/2 tablespoons champagne or white wine vinegar", 
            "Juice of half a lemon", 
            "1/4 cup olive oil", 
            "1/2 teaspoon Dijon mustard", 
            "For the salad:", 
            "4 large leeks", 
            "2 teaspoons salt", 
            "1 pound asparagus", 
            "1 19-ounce can of white beans, rinsed and drained or 1 1/2 cups cooked white beans"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/04/spring-panzanella.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Beans", 
            "Leeks", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spring", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/04/spring-panzanella/", 
        "title": "spring panzanella", 
        "directions": [
            "Preheat oven to 400°F.", 
            "Mix the bread cubes with the garlic, olive oil, parmesan, salt and pepper in a large bowl. Toss to coat well. Transfer bread to a baking sheet and sprinkle with salt and pepper. Bake stirring once or twice, until the croutons are crisp and lightly colored on the outside but still soft within, about 10 to 15 minutes. Set aside and let cool.", 
            "Mix the red onion with the vinegar and lemon juice in a small bowl and set aside for a few minutes before whisking in the remaining vinaigrette ingredients: olive oil and dijon. Set aside.", 
            "Cut off dark green tops of leeks and trim root ends. Halve each leek lengthwise to within 2 inches of root end. Rinse well under cold running water to wash away sand. Cover leeks with cold water in a 12-inch heavy skillet. Add salt and simmer leeks, uncovered, until tender, 15 to 20 minutes.", 
            "Without draining the cooking water (you will reuse it for the asparagus), transfer leeks to a bowl of ice and cold water to stop cooking, then pat the leeks dry with paper towels. Break off tough ends of asparagus and cook it in the boiling water until crisp-tender, no more than three minutes if they’re pencil-thin, more if your asparagus is thicker. Transfer it to another bowl of ice water, drain and pat it dry.", 
            "Cut the leeks and the asparagus each into one-inch segments–the leeks will be especially slippery and prone to separating; hold firm and use a sharp knife! Place pieces in a large bowl and mix in beans and cooled parmesan croutons. Pour vinaigrette over and toss well. Season with salt and pepper. "
        ], 
        "date": "2008-04-04T12:26:36+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds small new or fingerling potatoes (I used a mix of reds and yukon golds)", 
            "1 pound asparagus", 
            "1/4 pound sugar snap peas, green beans or other spring pea", 
            "4 small-to-medium radishes, thinly sliced", 
            "Pickled spring onions", 
            "3 spring onions (about 6 ounces)", 
            "1/4 cup white wine vinegar", 
            "1/4 cup water", 
            "1 tablespoon kosher salt (I use Diamond brand; use less if you’re using Morton or table salt)", 
            "1 1/2 teaspoons sugar", 
            "Sharp mustard vinaigrette", 
            "1/4 cup olive oil", 
            "2 tablespoons whole grain mustard (both Roland and Maille make a whole seed one I’m tremendously fond of)", 
            "2 teaspoons smooth Dijon mustard", 
            "2 tablespoons white wine vinegar", 
            "Salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/spring-salad-with-new-potatoes.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Peas", 
            "Photo", 
            "Potatoes", 
            "Radishes", 
            "Salad", 
            "Spring", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/05/spring-salad-with-new-potatoes/", 
        "title": "spring salad with new potatoes", 
        "directions": [
            "Place potatoes in a medium saucepan and cover with one inch of water. Bring to a boil and cook for about 15 minutes, or until the tip of a knife easily pierces through a potato. Drain the potatoes and let them cool until they’re almost room temperature. You can hasten this by covering them with cold water, and replacing the water a few times as it warms up.", 
            "Meanwhile, pickle your spring onions. Whisk vinegar, water, salt and sugar together in the bottom of a small container with a lid until the salt and sugar dissolve. Slice the bulbs and paler green parts into very thin coins and submerge them in the vinegar mixture. Cover and put in fridge until you’re ready to use them; if you can put them aside for an hour or even overnight, even better. Reserve the onion greens.", 
            "Refill the saucepan you used for the potatoes (here’s to fewer dishes!) with salted water and bring it to a boil. Prepare an ice bath, a large bowl with ice and water in it. Trim the tough ends off the asparagus. Once the water is boiling, add the asparagus. One minute later, add the sugar snap peas. Two minutes later, drain both together then dump them in the ice bath until chilled. Drain the vegetables and spread them out on towel to absorb excess water.", 
            "Slice the cooked asparagus spears and sugar snaps into 1/2-inch segments and place them in a large bowl. Chop potatoes into moderate-sized chunks and add them to the bowl. Cut the radishes as thinly as possible, with a mandoline if you have one. If they’re especially big (mine were), you can first quarter them lengthwise. Cut some of the reserved onion greens into thin slivers (no need to use all of them, as the onion flavor might take over) and add them to the bowl.", 
            "When you’re ready to serve the salad, or an hour or two in advance, whisk the dressing ingredients and toss it with the vegetables, to taste. (You may find you don’t want to use all of it.) Stir in as many pickled onion coins as you please, save the rest for anything and everything. Season with salt and freshly ground black pepper, to taste. Eat and enjoy!.", 
            "Do ahead: Pickles can be started in the day or days before. Potatoes can be boiled and chilled in fridge overnight, as can other vegetables. Vinaigrette can be made in advance as well, but I might wait until the last minute to toss it with the vegetables as the vinegar, over a long sitting time, can ever-so-slightly discolor the cut edges of the asparagus and beans."
        ], 
        "date": "2011-05-30T10:20:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound of small pasta (I used shells because I imagined the peas would nest in there and gah, such cuteness)", 
            "1/4 pound snow pea pods, ends trimmed", 
            "1/2 pound fresh summer peas, which yielded about 1 cup once shelled", 
            "3/4 to 1 cup Roasted Red Pepper Vinaigrette (recipe below)", 
            "1 red bell pepper, roasted, skinned and seeded or the equivalent from a jar, drained", 
            "1/4 cup olive oil", 
            "2 tablespoons red wine vinegar (and up to 2 tablespoons more if you, like us, like that extra bite in your dressing)", 
            "1 tablespoon chopped shallot (about 1 small)", 
            "1/2 teaspoon salt", 
            "Several grinds of black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/summer-pea-and-roasted-red-pepper-pasta-salad1.jpg?w=500", 
        "tags": [
            "Pasta", 
            "Peas", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/08/summer-pea-and-roasted-red-pepper-pasta-salad/", 
        "title": "summer pea and roasted red pepper pasta salad", 
        "directions": [
            "Puree the red bell pepper in a food processor or blender as much as possible, then add the remaining ingredients and running the machine until the dressing is silky smooth. Adjust the vinegar level and seasonings to taste."
        ], 
        "date": "2009-08-08T08:35:26+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons good olive oil", 
            "1 small French bread or boule, cut into 1-inch cubes (6 cups)", 
            "1 teaspoon kosher salt", 
            "2 large ripe tomatoes, cut into 1-inch cubes", 
            "1 hothouse cucumber, unpeeled, seeded, and sliced 1/2 inch thick", 
            "2 bell peppers, seeded and cut into 1-inch cubes (I like to use a combination of purple or yellow or orange, to nicely colorize the dish)", 
            "1/2 red onion, cut in half and thinly sliced", 
            "20 large basil leaves, coarsely chopped", 
            "3 tablespoons capers, drained", 
            "For the vinaigrette", 
            "1 teaspoon finely minced garlic", 
            "1/2 teaspoon Dijon mustard", 
            "3 tablespoons champagne vinegar", 
            "1/3 cup good olive oil", 
            "1/2 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/summers-last-hurrah-panzanella-e1472056230782.jpg?w=753", 
        "tags": [
            "Cucumber", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/09/summers-last-hurrah-panzanella/", 
        "title": "summer’s last hurrah panzanella", 
        "directions": [
            "Heat the oil in a large saute pan. Add the bread and salt; cook over low to medium heat, tossing frequently, for 10 minutes, or until nicely browned. Add more oil as needed.", 
            "For the vinaigrette, whisk together the ingredients.", 
            "In a large bowl, mix the tomatoes, cucumber, red pepper, yellow pepper, red onion, basil, and capers. Add the bread cubes and toss with the vinaigrette. Season liberally with salt and pepper.", 
            "Serve immediately, or allow the salad to sit for about half an hour for the flavors to blend."
        ], 
        "date": "2008-09-21T12:05:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds sweet potato, scrubbed, unpeeled, in 3/4- to 1-inch coins", 
            "4 tablespoons olive oil, divided", 
            "1/4 cup toasted and cooled pecan halves", 
            "2 tiny or 1 small shallot", 
            "2 stalks celery", 
            "2 tablespoons flat-leaf parsley", 
            "1 tablespoon dried cranberries or cherries (optional)", 
            "2 ounces firmish goat cheese", 
            "Salt and freshly ground black pepper", 
            "2 teaspoons red wine vinegar", 
            "1/2 teaspoon smooth Dijon mustard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/11/sweet-potatoes-with-pecans-and-goat-cheese.jpg?w=749", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/11/sweet-potatoes-with-pecans-and-goat-cheese/", 
        "title": "sweet potatoes with pecans and goat cheese", 
        "directions": [
            "Preheat oven to 450 degrees. Coat a large baking sheet generously with olive oil, about 1 to 2 tablespoons. Lay sweet potatoes in one layer on the oiled sheet. Sprinkle with salt and freshly ground black pepper. Roast, without disturbing, for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release from the pan with no effort. If they’re not, let it cook longer. Sprinkle them with additional salt and freshly ground black pepper and return the pan to the oven for another 10 minutes or so, until the undersides match the tops.", 
            "Meanwhile, prepare your salad. Chop your pecans well, mince your shallot, chop your celery and parsley, mince cranberries if using them. Crumble your goat cheese. If you, like me, got too soft of a goat cheese for mixing, set it aside and sprinkle it on top. If it’s firmer, stir it into the mixture. In a small dish, whisk together 2 tablespoons olive oil, 2 teaspoons red wine vinegar and 1/2 teaspoon dijon. Pour half over salad.", 
            "When the sweet potatoes are done, set a couple coins aside just in case the baby isn’t into the toppings. Lay the rest on a serving platter. Scoop a spoonful of the salsa over each round. Pour remaining salad dressing over top, to taste. Eat immediately."
        ], 
        "date": "2010-11-15T16:43:05+00:00"
    }, 
    {
        "ingredient_list": [
            "2 15-ounce cans black beans, drained and well-rinsed", 
            "4 bell peppers, a mix of colors, chopped into a small dice", 
            "1/2 super-large or 1 medium white onion, chopped into a small dice", 
            "Juice of one lime", 
            "3 tablespoons olive oil", 
            "1 teaspoon ground cumin", 
            "3/4 teaspoon salt", 
            "1 fresh chile, very thinly sliced or finely chopped or hot sauce, to taste", 
            "Optional: If you’re the kind of person who loves cilantro, it’s a great match for this salad. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/black-bean-confetti-salad1.jpg?w=640", 
        "tags": [
            "Beans", 
            "Gluten-Free", 
            "Peppers", 
            "Photo", 
            "Salad", 
            "Tex-Mex", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/04/tabula-beana/", 
        "title": "black bean confetti salad", 
        "directions": [
            "Mix beans, bell peppers and white onion in a large bowl. In a separate, smaller bowl, whisk remaining ingredients into a vinaigrette. Ideally, you’ll have a 1/2 cup of dressing. Pour it over the bean mixture, toss it well and adjust seasonings to taste.  "
        ], 
        "date": "2007-04-23T00:22:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup pearl barley", 
            "1/2 pound haricot vert (slim green beans) trimmed and cut into 2″ segments", 
            "1 large ear corn", 
            "1 large bunch of arugula (about 4 ounces total)", 
            "1/4 cup extra-virgin olive oil", 
            "1/8 cup white wine vinegar", 
            "2 tablespoons minced shallots", 
            "1 tablespoon minced fresh thyme", 
            "1 teaspoon Dijon mustard", 
            "4 tablespoons soft fresh goat cheese (such as Montrachet), crumbled "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-new-recipe-smell1.jpg?w=500", 
        "tags": [
            "Corn", 
            "Grain/Rice", 
            "Green Beans", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/05/the-new-recipe-smell/", 
        "title": "barley, corn and haricot vert salad", 
        "directions": [
            "Cook barley in medium saucepan of boiling salted water until tender, about 30 to 40 minutes. Drain; cool. Transfer to large bowl.", 
            "Cook haricot vert in large pot of boiling salted water until crisp-tender, about 3 minutes. Don’t drain water. Transfer beans to bowl of ice water to cool. Drain well. Transfer to bowl with barley. Add corn to boiling water and cook for 2 to 3 minutes, then also plunge in ice water. Dry and cut kernels from cob, then add to salad bowl. Coarsely chop washed and dried arugula; add to bowl with barley mixture.", 
            "Whisk olive oil, vinegar, shallots, thyme and Dijon mustard in small bowl to blend. Pour enough dressing over barley mixture to coat. Season salad to taste with salt and pepper. Sprinkle with goat cheese and serve alongside any remaining dressing."
        ], 
        "date": "2007-05-02T10:09:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pound zucchini (about 3 large)*", 
            "1 1/4 teaspoons salt", 
            "1/2 pound arugula, stems discarded and leaves cut into 1/2-inch-wide strips (6 cups)", 
            "1 ounce Parmigiano-Reggiano, coarsely grated (on large holes of a box grater; 1/2 cup)", 
            "3 tablespoons extra-virgin olive oil", 
            "Juice of one lemon", 
            "1/4 teaspoon black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/this-side-of-a-meltdown1.jpg?w=500", 
        "tags": [
            "Budget", 
            "Italian", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2007/05/this-side-of-a-meltdown/", 
        "title": "zucchini carpaccio salad", 
        "directions": [
            "Special equipment: an adjustable-blade slicer", 
            "Cut zucchini crosswise into paper-thin slices with slicer.  Toss zucchini slices with one teaspoon salt in a large colander set over a bowl and let drain 20 minutes. ", 
            "Rinse zucchini slices well, then drain, pressing gently on slices to extract any excess liquid. Pat zucchini slices dry with a kitchen towel.", 
            "Put arugula greens in a large bowl. Sprinkle with 1/4 cup Parmigiano-Reggiano and remaining 1/4 teaspoon salt. Drizzle 1 1/2 tablespoons of oil over greens and toss. Arrange zucchini slices over arugula greens, then drizzle with remaining oil, lemon juice and sprinkle with remaining 1/4 cup Parmigiano-Reggiano and pepper.", 
            "* A delicious and colorful variation could include yellow summer squash, as well."
        ], 
        "date": "2007-05-31T12:48:22+00:00"
    }, 
    {
        "ingredient_list": [
            "Crushed croutons", 
            "4 slices hearty white bread", 
            "1 small shallot, minced (about 2 tablespoons)", 
            "1 garlic clove, minced or pressed through garlic press", 
            "1/4 teaspoon table salt", 
            "Freshly ground black pepper", 
            "2 tablespoons olive oil", 
            "2 tablespoons grated Parmesan cheese", 
            "Tomato salad", 
            "1 pound cherry or grape tomatoes, mixed colors if you can find them", 
            "2 teaspoons olive oil", 
            "1 tablespoon mellow red wine vinegar (yours isn’t mellow? use less)", 
            "1/8 teaspoon table salt", 
            "Pinch of sugar", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/08/6046162939_322f528323_b.jpg?w=750", 
        "tags": [
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2011/08/tomato-salad-with-crushed-croutons/", 
        "title": "tomato salad with crushed croutons", 
        "directions": [
            "Handful basil leaves, slivered. ", 
            "Prepare the crushed croutons: Preheat oven to 350 degrees. Tear bread into chunks and pule them in a food processor until coarsely ground (largest chunks can be lima bean sized). No food processor? Keep tearing the bread up until it is in ragged, mixed sized crumbs. Spread crumbs on a rimmed baking sheet and toss with shallots, garlic, salt, pepper, olive oil and parmesan until croutons are evenly coated with oil. Bake until golden brown and dry, about 15 to 20 minutes, stirring occasionally. Remove from oven and set aside to cool slightly. (Warm is fine, hot might wilt your tomatoes, boo.)", 
            "Assemble salad: Halve each tomato lengthwise and arrange cut side up on a platter. Whisk together vinegar, olive oil, salt, sugar and a few grinds of pepper in a small dish. Drizzle over tomatoes. Sprinkle tomatoes with crushed croutons. Garnish with slivers of basil."
        ], 
        "date": "2011-08-15T14:43:34+00:00"
    }, 
    {
        "ingredient_list": [
            "4 pounds potatoes (I like tiny Yukon golds, but you can use whatever boiling potatoes you like for salads)", 
            "1 3/4 cups Greek yogurt (I used full-fat but I think other fat levels would work)", 
            "1/4 cup sour cream", 
            "2 tablespoons freshly squeezed lemon juice (from half a big lemon)", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon minced fresh dill", 
            "1 medium garlic clove, minced", 
            "2 teaspoons kosher salt (I use Diamond brand; use less if you use another, read why here)", 
            "Freshly ground black pepper", 
            "1 hothouse or English cucumber (1 pound), unpeeled but quartered lengthwise, seeds removed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/tzatziki-potato-salad.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/05/tzatziki-potato-salad/", 
        "title": "tzatziki potato salad", 
        "directions": [
            "More ideas for additions: Crumbled feta, chopped green olives, chopped fresh mint leaves or a minced hot chile", 
            "In a medium pot, cover your potatoes with cold water and bring them to a boil over high heat. Once boiling, reduce heat to medium-high and let potatoes simmer until tender enough that they can be pierced easily with a skewer or slim knife. I find that small potatoes tend to be done in roughly 30 minutes from the time I put them on the stove cold, but it’s best to start checking 5 to 10 minutes sooner. Drain potatoes and let them cool completely. (This is a great step to do ahead, as it seems to take potatoes forever to cool. If you’re really in a rush, spread them on a tray and pop them in the freezer for 10 minutes.) ", 
            "Meanwhile, in the bottom of a large bowl, stir together yogurt, sour cream, lemon juice, vinegar, dill, garlic, salt and lots of freshly ground black pepper. ", 
            "Grate the cucumber on a box grater (or in your food processor’s shredding blade, if you like to get things done in one hundredth of the time) and try to remove some of the excess by squeezing out handfuls, pressing it in a mesh sieve with a spoon or wringing it in a square of cheesecloth or a lint-free dishtowel. Add to yogurt mixture. ", 
            "Once potatoes are cool, cut tiny ones into quarters or larger ones into generous chunks. Add to cucumbers and yogurt and stir to coat. Add any extra ingredients desired. Adjust seasonings to taste. Either eat immediately or keep in the fridge for up to three days."
        ], 
        "date": "2012-05-24T15:44:11+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large seedless cucumbers (about 2 pounds)", 
            "1 tablespoon salt", 
            "1/3 cup white-wine vinegar", 
            "1/4 cup water", 
            "2 teaspoons sugar", 
            "1 garlic clove, forced through a garlic press", 
            "1 teaspoon dill seed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/viennese-cucumber-salad1.jpg?w=500", 
        "tags": [
            "Announcements", 
            "Cucumber", 
            "Photo", 
            "Round-Up", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/01/viennese-cucumber-salad/", 
        "title": "viennese cucumber salad", 
        "directions": [
            "Score cucumbers lengthwise with a fork (I used a zester tool) and slice thin, preferably with slicing disk of a food processor. In a large bowl toss cucumbers with salt and let stand 1 hour.  ", 
            "In a small saucepan bring vinegar and water to a boil with sugar, garlic, and dill seed, stirring until sugar is dissolved, and let dressing cool. In a colander drain cucumbers and rinse under cold water. ", 
            "Drain cucumbers well, squeezing out excess liquid. In a bowl combine cucumbers with dressing and marinate, covered and chilled, at least 1 hour and up to 6 hours. (After about two hours cucumber skin will discolor, but there will be no effect on flavor.) "
        ], 
        "date": "2008-01-03T13:15:58+00:00"
    }, 
    {
        "ingredient_list": [
            "For salad:", 
            "1 medium butternut squash (about 2 to 2 1/2 pounds), peeled, seeded, and cut into 1 1/2-inch pieces", 
            "1 medium garlic clove, minced or pressed", 
            "1/2 teaspoons ground allspice (I skip this)", 
            "2 tablespoons olive oil", 
            "Salt", 
            "One 15-ounce can chickpeas, drained and rinsed (1 1/2 cups)", 
            "1/4 of a medium red onion, finely chopped", 
            "1/4 cup coarsely chopped fresh cilantro or parsley", 
            "For tahini dressing:", 
            "1 medium garlic clove, finely minced with a pinch of salt", 
            "1/4 cup lemon juice", 
            "3 tablespoons well-stirred tahini", 
            "2 tablespoons water", 
            "2 tablespoons olive oil, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/warm-butternut-squash-and-chickpea-salad.jpg?w=750", 
        "tags": [
            "Beans", 
            "Fall", 
            "Photo", 
            "Salad", 
            "Vegan", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2009/01/warm-butternut-squash-and-chickpea-salad/", 
        "title": "warm butternut squash and chickpea salad", 
        "directions": [
            "Preheat the oven to 425°F.", 
            "In a large bowl, combine the butternut squash, garlic, allspice, olive oil, and a few pinches of salt. Toss the squash pieces until  evenly coated. Roast them on a baking sheet for 25 minutes, or until soft. Remove from the oven and cool.", 
            "Meanwhile, make the tahini dressing: In a small bowl, whisk together the garlic and lemon juice. Add the tahini, and whisk to blend. Add the water and olive oil, whisk well, and taste for seasoning. The sauce should have plenty of nutty tahini flavor, but also a little kick of lemon. You will probably need to add more water to thin it out.", 
            "To assemble the salad, combine the squash, chickpeas, onion, and cilantro or parsley in a mixing bowl. Either add the tahini dressing to taste, and toss carefully, or you could serve the salad with the dressing on the side. Serve immediately.", 
            "Do ahead: Molly says this salad, lightly dressed, keeps beautifully in the fridge, that you should hold a little of the dressing on the side and that it can be reheated in the microwave. I, for one, have never had any leftovers."
        ], 
        "date": "2009-01-28T23:23:25+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces goat milk Gouda, coarsely grated*", 
            "4 ounces fresh goat cheese, softened", 
            "1 tablespoon all-purpose flour", 
            "1 large egg", 
            "1/4 cup Panko** breadcrumbs", 
            "1/2 teaspoon coarse or sea salt", 
            "Olive oil, for frying", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/warm-crisp-and-a-little-melty-salad-croutons1.jpg?w=500", 
        "tags": [
            "Cheese", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/05/warm-crisp-and-a-little-melty-salad-croutons/", 
        "title": "warm, crisp and a little melty salad croutons", 
        "directions": [
            "Mash together cheeses in a bowl, mixing until combined. Form the mixture into four balls then smoosh each slightly into thick patties. Arrange three small dishes for dredging stations: Place the flour in the first one, beat the egg lightly in the second, and mix the breadcrumbs and salt in the last one. Heat a healthy slick of olive oil (the original recipe suggested 3 tablespoons; in a tiny skillet, I used closer to 2) in a small skillet over medium heat. Once hot, fry each patty until golden and crispy, about two minutes per side. It’s going to get melty (I’m not sorry) and seem pesky to flip once warm. I found using two forks made this easy-peasy. Briefly pause the crouton on paper towels to drain excess oil, before landing it on top of your salad of choice, then finish the whole thing with freshly ground black pepper. Repeat with remaining croutons. Eat at once. ", 
            "* Gouda, a Dutch cheese, is traditionally made with cow’s milk. You can buy it young (smooth, semi-firm and mild flavored), or aged (harder, darker, stronger-flavored with crunchy flecks), smoked, light, and even more ways. However, if you can find the goat milk gouda suggested here, perfect for goat cheese-phobes, it’s really amazing in these croutons, absolutely worth swinging by a cheese shop or grocery store with a great cheese counter for. (It’s also sold online from a variety of stores.) If you cannot get it, you could replace the gouda with another semi-firm cheese good for grating and melting, like a young cow’s milk gouda, gruyere, etc.", 
            "** If you can’t find or don’t want to buy Panko, here’s how I fake it: Preheat oven to 350 degrees. Tear one to two slices of soft, crustless white bread into 1-inch pieces and pulse them in the food processor until coarsely ground. This will make a generous half cup. Transfer crumbs to a rimmed baking sheet and bake until just barely golden brown and dry, about 15 minutes, stirring occasionally. Cool. Use."
        ], 
        "date": "2012-05-11T14:13:44+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large shallots, 1 halved, 1 finely diced,", 
            "4 sprigs of thyme", 
            "1 small bay leaf", 
            "1 cup dry small green lentils (see Note up top for varieties)", 
            "1 small bay leaf", 
            "Salt and pepper", 
            "1 pound fingerling potatoes", 
            "2 tablespoons red wine vinegar", 
            "1 to 2 garlic cloves, minced or smashed to a paste (I use less)", 
            "1 tablespoon smooth Dijon mustard", 
            "1/4 cup of your favorite olive oil", 
            "2 teaspoons capers, rinsed if salted, drained if brined, and roughly chopped", 
            "2 tablespoons cornichons or other sour gherkins, roughly chopped", 
            "1 to 2 scallions, thinly sliced", 
            "1/2 cup chopped flat leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/01/warm-lentil-and-potato-salad.jpg?w=750", 
        "tags": [
            "Beans", 
            "Lunch", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Side Dish", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/01/warm-lentil-and-potato-salad/", 
        "title": "warm lentil and potato salad", 
        "directions": [
            "Cook lentils: Pick over and rinse lentils. Place them in a small/medium saucepan with the halved shallot, thyme branches, bay leaf, some salt and 4 cups of water. Simmer the lentils over medium heat for 25 to 30 minutes, until firm-tender. Drain (discarding shallot, thyme and bay leaf) and keep warm.", 
            "Meanwhile, cook potatoes: In a separate saucepan, cover potatoes with 1 to 2 inches cold water. Set timer for 15 minutes, then bring potatoes to a simmer. When the timer rings, they should be easily pierced with a toothpick or knife. Drain and keep warm. ", 
            "Make the dressing: Place the chopped shallot and red wine vinegar in the bottom of a small bowl and let sit for 5 minutes. Whisk in minced garlic, dijon, a pinch of salt, a few grinds of black pepper and olive oil. Stir in chopped capers, cornichon and scallions. ", 
            "Assemble salad: Slice potatoes into 1/2-inch segments and place in serving bowl. Add lentils, dressing and all but 1 tablespoon parsley and combine. Adjust seasoning with additional salt and pepper if needed. Scatter salad with remaining parsley. ", 
            "Serve alone, with a soft-cooked egg on top, or as a side to a larger roast, chop or sausages. Reheat as needed. If you plan to make this at the outset of several meals and would like to eat it warm, I’d keep the dressing separate, warming only the lentils and potatoes and stirring in the cold dressing to taste.", 
            "Keeps in fridge for up to 5 days."
        ], 
        "date": "2014-01-21T12:32:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup hazelnuts", 
            "2 tablespoons finely diced shallots", 
            "3 tablespoons sherry or a white wine vinegar", 
            "9 tablespoons extra-virgin olive oil", 
            "2 pounds mushrooms (cremini or a mix of wild mushrooms), cleaned and sliced", 
            "2 tablespoons unsalted butter", 
            "6 ounces salad greens such as frisé, arugula or a mix of your choice", 
            "A 1 cup mix of fresh herbs (optional) such as chives, tarragon", 
            "1 teaspoon fresh thyme or a couple pinches of dried", 
            "1/4 cup sliced shallots", 
            "1/4 pound pecorino (Goin loves di Grotta, and we did too, but Romano would also work) or Parmesan-Reggiano or another hard, sharp cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/03/warm-mushroom-salad-with-hazelnuts.jpg?w=753", 
        "tags": [
            "Mushrooms", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2010/03/warm-mushroom-salad-with-hazelnuts/", 
        "title": "warm mushroom salad with hazelnuts", 
        "directions": [
            "Preheat the oven to 375°F. Toast the hazelnuts on a baking sheet for 8 to 10 minutes, rolling them around once or twice to make sure they toast evenly. Rub nuts in a dish towel to remove skins then let cool. Chop the hazelnuts coarsely.", 
            "Whisk the shallots, vinegar, 1/2 teaspoon salt together in a bowl and let sit for five minutes (this will soften and almost pickle the shallots), before whisking in 5 tablespoons olive oil.", 
            "Heat a large sauté pan over medium-high heat. Add 2 tablespoons olive oil and 1 tablespoon butter until the butter foams. Add half the mushrooms, half the thyme and season with salt and pepper. Sauté the mushrooms for about 5 minutes, until they’re softened but not limp (your cooking time will depend on the type of mushrooms you used).", 
            "Transfer mushrooms to a plate then repeat with the second half. When they are cooked, return the first half of the mushrooms to the pan then toss in sliced shallots, cooking for an additional 2 minutes.", 
            "Spread salad greens on a plate. Sprinkle fresh herbs on top, if using. Spoon hot mushrooms over the salad greens. Pour three-quarters of the vinaigrette in the sauté pan and swirl it in the pan until heated. Season it with 1/4 teaspoon salt and freshly ground black pepper. Pour over salad and toss carefully. Adjust to taste — you may need more salt, pepper, vinaigrette or even more sherry vinegar.", 
            "Use a vegetable peeler to shave cheese over the salad. Sprinkle with hazelnuts. Serve immediately."
        ], 
        "date": "2010-03-04T22:23:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound very large (16 to 20 per pound) shrimp, peeled, de-veined, and rinsed, shells reserved", 
            "1 teaspoon salt", 
            "1 cup dry white wine", 
            "4 peppercorns", 
            "5 coriander seeds", 
            "1/2 bay leaf", 
            "5 sprigs fresh parsley", 
            "1 sprig fresh tarragon", 
            "1teaspoon juice from 1 small lemon", 
            "1 cup ketchup", 
            "2 1/2 teaspoons prepared horseradish (I believed we used slightly more)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "1 teaspoon ancho or other mild chili powder", 
            "Pinch cayenne pepper", 
            "1 tablespoon juice from 1 small lemon", 
            "3 tablespoons good olive oil", 
            "1 small French bread or boule, cut into 1-inch cubes (6 cups)", 
            "1 teaspoon kosher salt", 
            "2 large ripe tomatoes, cut into 1-inch cubes", 
            "1 hothouse cucumber, unpeeled, seeded, and sliced 1/2 inch thick", 
            "1 red bell pepper, seeded and cut into 1-inch cubes", 
            "1 yellow bell pepper, seeded and cut into 1-inch cubes", 
            "1/2 red onion, cut in half and thinly sliced", 
            "20 large basil leaves, coarsely chopped", 
            "3 tablespoons capers, drained", 
            "1 lemon", 
            "4 small\tartichokes", 
            "2/3 cup\theavy cream", 
            "1 teaspoon garlic, finely chopped (about 1 medium clove)", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon ground white pepper", 
            "2 tablespoons olive oil", 
            "6 medium Yukon Gold potatoes", 
            "4 ounces Asiago cheese, grated (I used cave-aged Gruyere, because it’s my favorite)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/when-the-stars-make-you-drool1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Artichokes", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Seafood", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2006/11/when-the-stars-make-you-drool/", 
        "title": "shrimp cocktail + artichoke-potato gratin", 
        "directions": [
            "1.\tBring reserved shells, 3 cups water and salt to boil in medium saucepan over medium-high head; reduced heat to low; cover, and simmer until fragrant, about 20 minutes. Strain stock through sieve, pressing on shells to extract all liquid.", 
            "2.\tBring stock and remaining ingredients except shrimp to boil in 3- or 4-quart saucepan over high heat; boil 2 minutes. Turn off heat and stir in shrimp; cover and let stand until firm and pink, 8 to 10 minutes. Drain shrimp, reserving stock for another use. Plunge shrimp into ice water to stop coking, then draining again. Serve shrimp chilled with cocktail sauce.", 
            "1. Heat the oil in a large saute pan. Add the bread and salt; cook over low to medium heat, tossing frequently, for 10 minutes, or until nicely browned. Add more oil as needed.", 
            "2. For the vinaigrette, whisk together the ingredients.", 
            "3. In a large bowl, mix the tomatoes, cucumber, red pepper, yellow pepper, red onion, basil, and capers. Add the bread cubes and toss with the vinaigrette. Season liberally with salt and pepper.", 
            "4. Serve immediately, or allow the salad to sit for about half an hour for the flavors to blend."
        ], 
        "date": "2006-11-06T17:25:43+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds Russet potatoes, boiled, peeled and finely diced (1/4- to 1/2-inch for this and all chopped ingredients)", 
            "2 eggs, hard-boiled, finely diced (optional)", 
            "1 small red or white onion, finely diced", 
            "3/4 cup mayonnaise (low-fat, or a mixture of mayo and sour cream work great here)", 
            "3 small dill pickles, finely diced", 
            "1 cup canned peas and carrots, drained or 1/2 cup cooked peas and 1 carrot, chopped and cooked", 
            "Salt and pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/why-were-afraid-to-cook-salad-olivier1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Russian", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/07/why-were-afraid-to-cook-salad-olivier/", 
        "title": "why we’re afraid to cook + salad olivier", 
        "directions": [
            "Mix all ingredients and season to taste. "
        ], 
        "date": "2008-07-18T15:48:10+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup sugar", 
            "3 star anise", 
            "1/2 of plump vanilla bean, split in half lengthwise", 
            "8 dried Turkish apricots, cut in half", 
            "4 dried figs, quartered", 
            "4 2-inch long pieces lemon zest (peeled with a vegetable peeler) from a Meyer lemon if you can find one", 
            "Juice of the zest lemon", 
            "3 firm Bosc pears", 
            "1 firm tart apple", 
            "Seeds from half a pomegranate"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/winter-fruit-salad1.jpg?w=500", 
        "tags": [
            "Figs", 
            "Fruit", 
            "Pear", 
            "Photo", 
            "Pomegranate", 
            "Salad", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/11/winter-fruit-salad/", 
        "title": "winter fruit salad", 
        "directions": [
            "1. Fill a medium saucepan with 4 cups water. Add the sugar, star anise, vanilla bean and lemon zest. Bring to a boil, and cook until all the sugar is dissolved. Let it cool for just a few minutes (it should still be hot) and then stir in the dried figs and apricots. Let it cool completely.", 
            "2. Meanwhile, peel and core pears and apple. Slice thinly lengthwise and place in a large bowl, and toss with the lemon juice.", 
            "3. Once the syrup with dried fruit has cooled, pour it over the apples and pears.  Cover the bowl with plastic wrap and chill it overnight in the refrigerator.", 
            "4. The next morning, using a slotted spoon, ladle the fruit into a serving bowl, sprinkle with the pomegranate seeds and serve. Remove the vanilla beans (you can rinse and save what is left of them for another use) and lemon peels if you wish, or leave them in for decoration.", 
            "Do ahead Syrup can be made in advance and kept in the fridge for a day or two. Hot syrup can be poured over the dried fruit and kept in the fridge for a day or so. Prepared salad keeps in the fridge for a day or two, but is best fresh."
        ], 
        "date": "2008-11-16T22:12:16+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds zucchini (2 to 3, depending on size), halved lenthwise and very thinly sliced", 
            "1 teaspoon salt", 
            "1 1/2 ounces parmesan or pecorino romano cheese, thinly sliced on a mandoline or with a peeler", 
            "1/2 cup slivered almonds, well-toasted and cooled (300 degree oven for 7 to 10 minutes, tossing occasionally, usually works)", 
            "1/2 pound pasta of your choice (I like the extra bite of whole wheat pasta in pasta salads), cooked, drained and cooled", 
            "5 tablespoons olive oil", 
            "Juice of one lemon", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/zucchini-and-almond-pasta-salad1.jpg?w=500", 
        "tags": [
            "Pasta", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2010/08/zucchini-and-almond-pasta-salad/", 
        "title": "zucchini and almond pasta salad", 
        "directions": [
            "Further additions, if you wish: 1/2 cup crumbled feta or blue cheese (replacing parmesan), 1/4 red onion, thinly sliced (you can let this marinate in the dressing for a few minutes, to reduce its bite), 1/4 pound fresh arugula or 1/4 cup thinly slivered basil or 1 cup white beans, rinsed and drained", 
            "Toss zucchini slices with one teaspoon salt in a large colander set over a bowl or in sink. Let drain 20 minutes. If they taste too salty to you, rinse and drain them again.", 
            "Stir zucchini, parmesan, almonds and pasta together. Whisk together olive oil and lemon juice, seasoning generously with black pepper and salt to taste. Toss with salad and adjust seasonings to taste. Pack up salad and take it with you to the beach."
        ], 
        "date": "2010-08-09T09:39:52+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/zuni-cafe-roast-chicken-bread-salad1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Date Night", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/12/zuni-cafe-roast-chicken-bread-salad/", 
        "title": "zuni cafe’s roasted chicken + bread salad", 
        "directions": [
            "Preheat the broiler. Carve off all of the bottom and most of the top and side crusts from your bread (you can reserve these to use as croutons for soup or another salad). Tear bread into irregular 2- to 3-inch chunks, wads, bite-sized bits and fat crumbs. You should get about 4 cups.", 
            "Toss them with just a tablespoon or two of olive oil, lightly coating them, and broil them very briefly, just to lightly color the edges. If you’d like to toast the pine nuts (recommended) you can put them on your broiler tray as well, but watch them very carefully — they cook quickly!", 
            "Combine about 1/4 cup of the olive oil with the Champagne or white wine vinegar and salt and pepper to taste. Toss about 1/4 cup of this tart vinaigrette with the torn bread in a wide salad bowl; the bread will be unevenly dressed. Taste one of the more saturated pieces. If it is bland, add a little salt and pepper and toss again.", 
            "Heat a spoonful of the olive oil in a small skillet, add the garlic and scallions, and cook over medium-low heat, stirring constantly, until softened. Don’t let them color. Scrape into the bread and fold to combine. Drain the plumped currants and fold them in, along with the pine nuts, if they were not already mixed with the bread scraps from the broiling step. Dribble the chicken stock or lightly salted water over the salad and fold again.", 
            "Taste a few pieces of bread — a fairly saturated one and a dryish one. If it is bland, add salt, pepper, and/or a few drops of vinegar, then toss well.", 
            "If you’re going to serve the salad under the roast chicken (recipe above), you can pile the bread salad on the serving dish you want to use and tent it with foil. If you want to serve it separately, do the same, but in a 1-quart shallow baking dish. Hang onto the bowl you mixed it in — you’ll use it again.", 
            "Place the salad in the oven after you flip the chicken the final time, for about 5 to 10 minutes.", 
            "Tip the bread salad back into the salad bowl. It will be steamy-hot, a mixture of soft, moist wads, crispy-on-the-outside-but-moist-in-the-middle-wads, and a few downright crispy ones. Drizzle and toss with a spoonful of the pan juices. Add the greens, a drizzle of vinaigrette, and fold well. Taste again."
        ], 
        "date": "2008-12-10T14:30:48+00:00"
    }
]