{
  "date": "2014-06-02T12:24:46+00:00",
  "directions": [
    "Make dressing: Roughly chop the garlic and then add the oregano, salt and up to 1/2 teaspoon ground pepper. Chop the mixture together and use the side of a knife or a mortar and pestle to make a grainy herb paste. Transfer the paste to a large salad bowl, and add the lemon juice and vinegar. Mix with a fork allowing the salt to dissolve, then add the oil and whisk with a fork until well combined. The dressing should be thick with garlic and oregano. If you’re using a small head of iceberg, transfer 1/3 the dressing into a small bowl to be used only if needed. For a larger head of iceberg, you’ll want it all.",
    "Assemble salad: Gently fold the chickpeas, red onion, provolone, salami, pepperoncini (including seeds and juice) into the dressing, one at a time. Halve the tomatoes lengthwise and season with 1 1/2 teaspoons sea salt. Set aside until ready to serve.",
    "To serve: When ready to serve, gently add the tomatoes, lettuce and radicchio to the salad bowl, along with a couple of generous pinches of oregano, and toss to combine with the dressing. Adjust seasonings to taste, adding any reserved dressing if needed. Serve immediately.",
    "Sicilian Oregano Sources: It’s definitely available online here and here. If you’re in NYC, I bought the jar you see here at Brooklyn Larder a year or two ago for about $7. However, I was over at Buon Italia in Chelsea Market today (6/5) and they sell, well, almost a tree of the stuff, easily 10 times what was in that jar, for all of $4.50. Buy it and share it with all of your friends! "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/nancys-chopped-salad1.jpg?w=640",
  "ingredient_list": [
    "Oregano dressing",
    "4 cloves garlic",
    "1 to 2 tablespoons dried oregano (Nancy recommends 2; I got nervous and used 1, but might not have minded more)",
    "2 teaspoons kosher salt",
    "Freshly ground black pepper",
    "2 tablespoons lemon juice, or juice of 1 lemon",
    "1/4 cup red wine vinegar",
    "1/4 cup olive oil, ideally extra-virgin",
    "Salad and assembly",
    "1 (15-ounce) can chickpeas or 1 3/4 cups cooked chickpeas, drained",
    "1 small red onion, peeled and sliced into paper-thin rings",
    "1/2 pound provolone (see Note about varieties), sliced 1/8-inch thick then cut into 1/4-inch ribbons",
    "1/2 pound salami, peeled, sliced 1/8-inch thick then cut into 1/4-inch ribbons",
    "4 medium or 8 small pickled pepperoncini, sliced into rings",
    "3/4 pound cherry tomatoes",
    "Sea salt",
    "1 head iceberg lettuce (see Note about size), halved, cored, and cut in 1/2-inch ribbons",
    "1 head radicchio, halved, cored and cut in 1/4-inch ribbons",
    "2 tablespoons dried oregano for garnish (optional)"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Gluten-Free",
    "Italian",
    "Lunch",
    "Photo",
    "Radicchio",
    "Salad",
    "Tomatoes",
    "Weeknight Favorite"
  ],
  "title": "nancy’s chopped salad",
  "url": "https://smittenkitchen.com/2014/06/nancys-chopped-salad/"
}