{
  "date": "2008-02-16T12:15:49+00:00",
  "directions": [
    "Freshly ground black pepper, to taste",
    "Carve out the artichoke hearts (the drama!): Halve one lemon. Remove all leaves from the artichokes, including the dark outer ones, the lighter yellow interior leave and the thorny purple/pink ones near the heart. Rub all exposed areas with a lemon half. Trim the stalk, cutting down the length of it to about one inch and shaving off any dark green nubs or imperfections–rub lemon on this too. Trim the dark green stumps the leaves have left behind, again, coat this with lemon. Using a paring knife or grapefruit spoon, remove the fuzzy choke completely, then squeeze some lemon juice over the heart. Save the mostly used-up lemon halves. [Becks & Posh have an excellent step-by-step tutorial on this process, with pictures, for those who want further instruction.]",
    "Bring a small/medium saucepan 2/3 to boil with enough water to cover the artichokes, the glug of white wine, smashed garlic gloves, a couple pinches of salt and the not-discarded lemon halves you’d used in the first step. Once it is boiling, add the prepared artichoke hearts. Boil them for about 20 to 25 minutes, until they are tender. (The tip of a sharp knife should easily go through them.)",
    "Drain the artichoke hearts and toss them with juice of the second lemon while they cool. Set them aside, briefly. Meanwhile, make your dressing in the bottom of your salad bowl, whisking all vinaigrette ingredients. Thinly slice your radicchio and endives and toss them with the vinaigrette. Lightly smash the artichoke hearts that have been set aside, and toss these in as well. Season with freshly ground black pepper to taste. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pasta-puttanesca-broken-artichoke-hearts-salad1.jpg?w=500",
  "ingredient_list": [
    "8 ounces regular whole-wheat thin spaghetti, vermicelli or angel hair",
    "1 tablespoon extra-virgin olive oil",
    "2 cloves garlic, minced",
    "1/3 cup chopped flat-leaf parsley",
    "1/4 cup pitted chopped Spanish or Greek olives",
    "2 tablespoons capers",
    "1 teaspoon anchovy paste",
    "1 tablespoon fresh oregano leaves or 1 teaspoon dried",
    "1/8 teaspoon crushed red pepper flakes",
    "1 (14-ounce) can diced tomatoes",
    "3/4 cup chopped fresh arugula",
    "1/4 cup grated Parmesan",
    "Artichoke prep:",
    "3 to 4 artichokes",
    "Glug of white wine",
    "2 garlic cloves, smashed",
    "Salt",
    "2 lemons",
    "Vinaigrette:",
    "1 tablespoon olive oil",
    "1 1/2 teaspoons sherry or champagne vinegar",
    "Few drops of honey",
    "1/2 teaspoon Dijon mustard",
    "Pinch of truffle salt, or whichever salt you prefer",
    "1 tiny head of radicchio",
    "2 endives"
  ],
  "tags": [
    "Artichokes",
    "Pasta",
    "Photo",
    "Salad"
  ],
  "title": "pasta puttanesca, broken artichoke hearts salad",
  "url": "https://smittenkitchen.com/2008/02/pasta-puttanesca-broken-artichoke-hearts-salad/"
}