{
  "date": "2016-03-11T11:44:30+00:00",
  "directions": [
    "Make the crust: Heat oven to 350°F (176#176;C). Place a 9-inch round tart pan (ideally with a removable bottom) on a rimmed baking sheet. Finely grind cookies with sugar and salt in a food processor. Add melted butter and process until clumpy. (See note up top about needing more with other types of cookies.) Press crumb mixture firmly into bottom and up sides of pan. Bake until crust is lightly browned, about 10 minutes. If any parts of the crumb walls have fallen or slumped, you can press them gently back into place with a spoon. Let cool completely. I have no patience for long cooling processes and put it in the freezer for 15 minutes. ",
    "Make the filling: In a large bowl, beat  the cream cheese, butter, sugar, peanut butter, salt and vanilla together until fluffy with an electric mixer or with good elbow grease, a big whisk. Scrape the mixture into the tart shell and smooth the surface with a spatula. Chill this while you prepare the topping — again, I just slide it into the freezer for 10 minutes. A cold surface helps the chocolate set faster.",
    "Make the topping: Heat chocolate, pinch of salt and cream together in a microwave or saucepan until the chips are mostly melted. Stir until smooth. Let sit for 5 minutes to cool slightly then pour over peanut butter filling and gently spread smooth. Sprinkle with flaky salt, if desired. Chill the tart until firm. As you can guess, I do this in the freezer for 15 minutes or so because I like to have my treats as soon as possible. An hour in the fridge would also do the trick.",
    "Serve in wedges. Don’t forget to share."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/chocolate-peanut-butter-tart1.jpg?w=640",
  "ingredient_list": [
    "Crust",
    "2 5.3-ounce (150 gram) shortbread cookie packages (to yield 1 3/4 to 2 cups shortbread cookie crumbs)",
    "2 tablespoons granulated sugar",
    "1/4 teaspoon coarse or kosher salt",
    "3 tablespoons unsalted butter, melted (see note about butter amount)",
    "Filling",
    "1/2 cup (4 ounces or 115 grams) cream cheese, softened",
    "2 tablespoons (1 ounce or 30 grams) unsalted butter, softened",
    "1/3 cup (40 grams) powdered or confectioners’ sugar",
    "1/2 cup (130 grams) creamy peanut butter (I use Skippy but think a more natural one would work just fine here)",
    "1/4 teaspoon coarse or kosher salt",
    "1/2 teaspoon vanilla extract",
    "Topping",
    "1 cup (about 6 ounces or 170 grams) semisweet chocolate chips",
    "A pinch of salt",
    "1/2 cup (120 ml) heavy cream",
    "Flaky sea salt, to finish (optional)"
  ],
  "tags": [
    "Chocolate",
    "Peanut Butter",
    "Photo",
    "Tarts/Pies"
  ],
  "title": "chocolate peanut butter tart",
  "url": "https://smittenkitchen.com/2016/03/chocolate-peanut-butter-tart/"
}