{
  "date": "2007-10-01T17:44:47+00:00",
  "directions": [
    "Make brownies: Preheat oven to 350 degrees F with rack in middle. Butter a 13- by 9- by 2-inch baking pan, then line bottom of pan with parchment paper and butter parchment. ",
    "Beat together butter and sugar with an electric mixer at medium-high speed until mixture is light and fluffy, then add peanut butter and beat until incorporated. Beat in whole eggs, egg yolk, and vanilla. Reduce mixer sped to low, then mix in flour until just combined. ",
    "Mix in chocolate chips (1 1/2 cups) then spread batter in baking pan, smoothing top. (It will be thick, almost like cookie batter.)",
    "Bake until brownies are deep golden, puffed on top and a wooden pick inserted in center come out with some crumbs adhering, 40 to 45 minutes. ",
    "Cool completely in pan on a rack, about 1 1/2 hours.",
    "Make ganache: Put chocolate chips (1 1/2 cups) in a heatproof bowl. ",
    "Bring cream to a boil in a small saucepan, then pour over chocolate chips and let mixture stand for one minute. ",
    "Gently whisk in butter until it is incorporated, chocolate is melted, and a smooth mixture forms. ",
    "Spread ganache on cooled brownies and let stand until set, about 15 minutes. ",
    "Brownies keep in one layer in an airtight container three days, and we hope much longer if hidden waaay in the back of the freezer. ",
    "* I swapped bittersweet chips for the semisweet by accident, but really liked that bitter, grown-up kick.",
    "** Our store only sells some all natural hipppy-dippy peanut butter. It worked fine but I couldn’t help but feel this recipe needed a bit of salt. It could be that, uh, it needs some salt, or that traditional peanut butter (IstillheartyouSkippy!) has more salt in it. I’d suggest you try the dough/batter (because you’re going to anyway) before you bake it and judge for yourself whether it needs a little more flavor balance."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peanut-butter-brownies1.jpg?w=500",
  "ingredient_list": [],
  "tags": [
    "Brownies/Blondies",
    "Chocolate",
    "Peanut Butter",
    "Photo"
  ],
  "title": "peanut butter brownies",
  "url": "https://smittenkitchen.com/2007/10/peanut-butter-brownies/"
}