[
    {
        "ingredient_list": [
            "2 firm tart apples (1 pound or 2 454 grams)", 
            "1 1/2 cups (6.75 ounces or 195 grams) all-purpose flour", 
            "1/4 cup sugar plus 1 1/2 tablespoons for sprinkling (total of 2.2 ounces or 63 grams)", 
            "1/2 tablespoon (7 grams) baking powder", 
            "1/2 teaspoon salt (3 grams) plus additional for egg wash", 
            "6 tablespoons (3 ounces or 85 grams)unsalted butter, chilled and cut into 1/2-inch cubes plus additional for baking sheet if not lining it with parchment", 
            "1/2 cup (2.25 ounces or 65 grams) sharp cheddar, shredded (white is recommended, I assume for aesthetics)", 
            "1/4 cup (2 ounces) heavy cream", 
            "2 large eggs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/5079390141_db09235efb_o.jpg?w=749", 
        "tags": [
            "Apple", 
            "Cheese", 
            "Fall", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2010/10/apple-and-cheddar-scones/", 
        "title": "apple and cheddar scones", 
        "directions": [
            "Position a rack at the center of oven and preheat oven to 375 °F. Line baking sheet with parchment paper.", 
            "Peel and core apples, then cut them into one-sixteenths. (I assumed this meant chunks, not slivers.) Placed them in a single layer on a baking sheet lined with parchment paper and bake them until they take on a little color and feel dry to the touch, about 20 minutes. They will be about half-baked. Let them cool completely. (You can speed this up in the fridge, as I did.) Leave oven on.", 
            "Sift or whisk flour, sugar, baking powder and salt together. Set aside. Place butter in the bowl of an electric mixer with a paddle attachment, along with cooled apple chunks, cheese, cream and one egg. Sprinkle flour mixture over the top and mix on low speed until the dough just comes together. Do not overmix.", 
            "[Don’t have a stand or hand mixer? I’d rub the cold butter into the flour mixture with my fingertips or with a pastry blender, hand-chop the apples coarsely and mix the rest together with a wooden spoon until combined. It might feel awkward, but it should all come together. Again, don’t overmix it though it will be harder to do this by hand.]", 
            "Generously flour your counter top and place the scone dough on top of it. Sprinkle with flour. Use a rolling pin to gently roll (or use your hands to pat) the dough into a 1 1/4-inch thick, 6-inch circle. Cut circle into 6 wedges. Transfer them to a baking sheet that has either been buttered or lined with a fresh sheet of parchment paper. Leave at least 2 inches between each scone.", 
            "Beat remaining egg in a small bowl with a pinch of salt. Brush the scones with egg wash and sprinkle them with remaining tablespoon of sugar. Bake until firm and golden, about 30 minutes. With a spatula, lift them to a wire rack to cool for 10 minutes. Before you eat one, make sure you realize how addictive they might be. Once you’ve got that down, go for it anyway.", 
            "Do ahead: Scones are best the day they are baked. However, they can be made ahead of time and stored unbaked in the freezer until you need them. Simply brush them with the egg wash and sprinkle them with sugar, and bake them still frozen for just a couple extra minutes. This way they are always freshly baked when you want them. These scones were passable on day two and terrible on day three. "
        ], 
        "date": "2010-10-15T14:09:55+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "1 cup all-purpose flour plus additional for kneading and rolling", 
            "3/4 cup cake flour (not self-rising)", 
            "2 large eggs", 
            "3/4 teaspoon salt", 
            "1/4 cup water", 
            "Filling", 
            "1/4 cup water", 
            "1/4 cup plus 2 tablespoons sugar", 
            "2 tablespoons apricot brandy (optional)", 
            "6 oz dried apricots (1 cup; preferably California)", 
            "1/2 cup walnuts (2 oz), finely chopped", 
            "Dough (recipe above)", 
            "1 stick (1/2 cup) unsalted butter", 
            "1/2 cup fresh bread crumbs", 
            "1/4 teaspoon cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apricot-and-walnut-vareniki1.jpg?w=500", 
        "tags": [
            "Apricots", 
            "Dumplings", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/apricot-and-walnut-vareniki/", 
        "title": "apricot and walnut vareniki", 
        "directions": [
            "Make filling: Bring water and 1/4 cup sugar to a boil, stirring until sugar is dissolved. Remove from heat and stir in brandy. Finely chop apricots in a food processor, then add sugar syrup and pulse until just combined (do not puree). Transfer to a bowl and stir in 1/4 cup walnuts. Cool.", 
            "Roll out dough and fill varenikis: Halve dough and roll out 1 piece on a lightly floured surface into a 15-inch round, keeping remaining dough wrapped. Trim dough to a 13-inch square. Cut lengthwise into 4 strips, then crosswise into fourths to form 16 (3 1/4-inch) squares. ", 
            "Put 1 slightly rounded teaspoon filling in center of each square. Working with 1 square at a time, moisten edges with water and fold in half diagonally to form a triangle, pressing edges firmly together to seal. overlap bottom points of triangle and press to seal (dumpling will look like a pointed hat). Transfer vareniki to a flour-dusted kitchen towel. Repeat with remaining squares, then make more dumplings with remaining dough and filling.", 
            "Cook varenikis in a large pot of lightly salted boiling water until tender, about 15 minutes. Make topping while varenikis cook:", 
            "Heat 2 tablespoons butter in a skillet over moderate heat, then cook bread crumbs and remaining 1/4 cup walnuts, stirring frequently, until golden, 2 to 3 minutes. Remove from heat and season lightly with salt. Stir together cinnamon and remaining 2 tablespoons sugar. Sprinkle 2 teaspoons cinnamon sugar over crumb mixture and toss. ", 
            "To serve varenikis: Melt remaining 6 tablespoons butter, then drizzle about 2 tablespoons on a warmed serving platter. Transfer varenikis with a slotted spoon to platter and drizzle with remaining 4 tablespoons butter. ", 
            "Serve hot, sprinkled with bread-crumb mixture and remaining cinnamon sugar to taste. "
        ], 
        "date": "2007-11-08T23:15:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 garlic clove, peeled and smashed", 
            "1 cup large green pitted olives", 
            "1 tablespoon capers, rinsed and drained", 
            "1 15-ounce can of artichoke hearts, drained", 
            "1/4 cup extra-virgin olive oil", 
            "8 large slices of crusty bread"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/artichoke-olive-crostini1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Artichokes", 
            "Italian", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/04/artichoke-olive-crostini/", 
        "title": "artichoke-olive crostini", 
        "directions": [
            "1. Preheat the oven to 400°F. In a food processor, process the garlic, olives, capers, artichoke hearts and olive oil to a coarse paste.", 
            "2. Toast the bread on the oven rack for 6 minutes, or until crisp and browned. Spread the olive paste thickly over the toasts and serve.", 
            "Do ahead: The olive paste can be refrigerated for 2 days. Let it return to room temperature before using."
        ], 
        "date": "2009-04-06T11:44:33+00:00"
    }, 
    {
        "ingredient_list": [
            "6 large eggs", 
            "4 medium asparagus spears", 
            "2 teaspoons very finely minced shallot, scallion or chives, plus a pinch extra for garnish", 
            "3 tablespoons mayonnaise, whipping cream, creme fraiche, sour cream and/or soft butter", 
            "1/2 teaspoon smooth Dijon (optional)", 
            "Few gratings fresh lemon zest (optional)", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/asparagus-stuffed-eggs1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Asparagus", 
            "Breakfast", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/04/asparagus-stuffed-eggs/", 
        "title": "asparagus-stuffed eggs", 
        "directions": [
            "Hard-boil eggs using whichever method you prefer. I cover mine with cold water, bring it to a boil, then set a timer for 9 1/2 minutes. When it rings, drain the eggs, and plunge them in ice water until they’re fully cool. Eggs can be cooked ahead of time and stored in the fridge for up to 4 days. ", 
            "Cook asparagus spears in salted simmering water until full tender, about 4 to 5 minutes. Drain and plunge in cold water. Drain and again and spread on towels to dry out as much as possible. Cut 1/2-inch off the tips of each spears and cut these tips lengthwise (they’ll be your garnish). Puree remaining asparagus — I found that my food processor didn’t do a great job due to the small volume, but yours might. A food mill with a fine disc works well here. ", 
            "You’ll want to remove the excess water from your puree; I did so by spreading it for a minute on a few paper towel layers. If you don’t, the filling will be soggy and damp, or in Julia’s words, “a disappointing texture and flavor.” ", 
            "Peel your eggs. Dip your knife in water before cutting each in half lengthwise for a cleaner cut. Shave a thin strip off the bottom of each so that it will not rock about in its dish. Remove the yolks and press them through a fine-mesh strainer to sieve them. Add asparagus puree, shallot or chives, mayonnaise or cream, Dijon or lemon zest (if using) and combine mixture until smooth. Season carefully with salt and freshly ground black pepper.", 
            "You can spoon the mixture into each egg half, or use a piping bag with a star tip for a fancier presentation. Decorate each stuffed egg with a reserved asparagus tip (you’ll be a little short of what you need), and the remaining with the extra shallot, scallion or chives. Wrap tray in plastic and keep in fridge until ready to serve. "
        ], 
        "date": "2014-04-08T12:25:30+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "1/3 cup whole blanched almonds, Marconas if you can get them", 
            "Yogurt dressing", 
            "1 cup plain yogurt (strained or Greek-style if you can find it)", 
            "2 tablespoons lemon juice", 
            "1 teaspoon smoked paprika", 
            "1 small clove garlic, minced", 
            "1/4 teaspoon table salt", 
            "Asparagus", 
            "1 tablespoon olive oil", 
            "1 pounds asparagus spears, tough ends trimmed or peeled", 
            "Salt and freshly ground black pepper", 
            "To serve", 
            "Squeeze of lemon juice", 
            "Drizzle of olive oil", 
            "Coarse sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/asparagus-with-almonds-and-yogurt-dressing1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Asparagus", 
            "Easter", 
            "Photo", 
            "Side Dish", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/06/asparagus-with-almonds-and-yogurt-dressing/", 
        "title": "asparagus with almonds and yogurt dressing", 
        "directions": [
            "Hard-boil your eggs according to your favorite method. I like to put my eggs cold in a pot of water and bring it to a boil over high heat. Once it comes to a boil, I set the timer for 10 minutes and reduce the heat to a moderate simmer. When the timer goes off, I drain them and plunge them in ice water for a quick cooling. While they cool, toast your almonds. [If you have time, cook the eggs 24 hours or more in advance. Older hard-boiled eggs peel more cleanly.] ", 
            "In a 12-inch heavy skillet, toast your almonds over medium heat, tossing them frequently until they’re lightly bronzed. [Marcona almonds often come already toasted and in a bit of olive oil. If you’re happy with their color, use them as is. If not, you can put the almonds and oil in the skillet to toast them more deeply, as I did.] Let cool.", 
            "Once eggs and almonds are cool, coarsely chop both and set aside. ", 
            "Make your yogurt dressing, whisking all of the ingredients in a small bowl. Adjust seasonings to taste. Spread 1/2 cup dressing in a thin layer over serving dish and set aside. ", 
            "Reheat heavy 12-inch skillet over medium high heat. Add oil, and once the oil is fully heated, add your trimmed asparagus spears — placing half in one direction and half in the other allows them to fit better. They won’t fit flat in a single layer, but you should try to spread them as evenly as possible. Cover the skillet with a lid (foil if you don’t have one that fits) and let skinny spears cook for 3 minutes and fatter ones for 5. Remove the lid, increase the heat to high, season the asparagus with salt and black pepper, and use tongs to cook the spears until they’re crisp-tender and well-browned along a side or two, about 5 minutes more for skinny spears or 7 minutes for thicker ones. ", 
            "Transfer asparagus to dressing-coated serving dish. Sprinkle spears with an additional squeeze of lemon juice, if desired, a tiny drizzle of olive oil, chopped almonds, eggs and a bit of coarse sea salt. Dollop with additional yogurt dressing. Then dig in."
        ], 
        "date": "2012-06-01T14:03:21+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup black beans, cooked, drained (about 2/3 of a 15-ounce can)", 
            "1 large bell pepper, finely diced (I used a mix of colors because we keep them around for the kid)", 
            "1/4 cup finely diced white or red onion", 
            "1 small jalapeno, seeded and minced", 
            "1/4 cup olive oil", 
            "2 tablespoons freshly squeezed lime juice (from about 1 lime)", 
            "1/4 teaspoon coarse salt, plus more to taste", 
            "1/2 teaspoon ground cumin", 
            "Dashes of hot sauce or pinches of cayenne, to taste", 
            "Chopped cilantro for garnish", 
            "4 ripe avocados", 
            "1 cup finely diced cucumber (from about half a long English or 2 small Persian cukes), seeds removed", 
            "1 cup finely diced radishes (from about 4 large red ones)", 
            "2 scallions, finely chopped", 
            "4 tablespoons toasted sesame oil", 
            "2 teaspoons white miso (shiromiso, which is more mild/less salty)", 
            "2 tablespoons rice vinegar", 
            "1/2 teaspoon finely grated or minced fresh ginger root (or more to taste)", 
            "1 teaspoon white sesame seeds, toasted", 
            "1 teaspoon black sesame seeds", 
            "4 ripe avocados"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/avocado-cup-salads-two-ways1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Avocado", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/04/avocado-cup-salads-two-ways/", 
        "title": "avocado cup salads, two ways", 
        "directions": [
            "Mix cucumber, radishes and scallions in a medium bowl. In a small dish, whisk sesame oil, miso, rice vinegar and ginger. Add dressing flavor and seasonings to taste. Halve avocados and remove pits. Score avocado halves with a knife, cutting lines in both directions to form a grid, but being careful not to through the skin. ", 
            "If you’re serving all four avocados right away, go ahead and mix the dressing and salad ingredients together, then heap each avocado half with salad and dressing and garnish with mix of sesame seeds. If you’d like to stretch this over several days of lunches or the like, keep the mixed salad ingredients and dressing in separate dishes. When you’re ready to eat, cut and score your avocado, dot a little dressing directly on each half, heap with salad filling and drizzle with more dressing. Garnish with mix of seeds. ", 
            "Eat with a spoon. "
        ], 
        "date": "2014-04-23T12:13:24+00:00"
    }, 
    {
        "ingredient_list": [
            "3 slices Italian bread, torn into small bits (1 cup)", 
            "1/3 cup milk", 
            "3 ounces sliced pancetta, finely chopped (you can swap in Canadian Bacon if you can’t find pancetta)", 
            "1 small onion, finely chopped", 
            "1 small garlic clove, minced", 
            "2 tablespoons extra-virgin olive oil, divided", 
            "1 large egg", 
            "1 pound ground chicken", 
            "2 tablespoons tomato paste, divided*", 
            "3 tablespoons finely chopped flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/baked-chicken-meatballs.jpg?w=753", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Chicken", 
            "Freezer Friendly", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2009/10/baked-chicken-meatballs/", 
        "title": "baked chicken meatballs", 
        "directions": [
            "Preheat oven to 400°F with a rack in the upper third of the oven. Soak bread in milk in a small bowl until softened, about four minutes.", 
            "Cook pancetta, onion, and garlic in one tablespoon oil with 1/2 teaspoon each of salt and pepper in a large skillet over medium heat until onion is softened, about 6 minutes. (Alternately, as in “I thought of this after the fact”, I’d bet you could render the pancetta for a couple minutes and cook the onions and garlic in that fat, rather than olive oil.) Cool slightly.", 
            "Squeeze bread to remove excess milk, then discard milk. Lightly beat egg in a large bowl, then combine with chicken, 1 tablespoon tomato paste, pancetta mixture, bread, and parsley. Form 12 meatballs and arrange in another 4-sided sheet pan (I used a 9×13 roasting dish).", 
            "Stir together remaining tablespoons of tomato paste and oil and brush over meatballs (the paste/oil does not mix in any cohesive manner, but just smoosh it on and run with it) , then bake in upper third of oven until meatballs are just cooked through, 15 to 20 minutes (though mine took a good 5 minutes longer).", 
            "* I accidentally added a heaping tablespoon of the tomato paste into the meatball mixture the first time I made it, and ended up liking it better than without it. I’d use the tomato paste on top too. It’s good both places."
        ], 
        "date": "2009-10-29T20:38:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup coarsely chopped almonds, blanched if you can find them", 
            "1 1/2 tablespoons all purpose flour", 
            "2/3 cup sugar", 
            "9 tablespoons (1 stick plus 1 tablespoon) unsalted butter, at room temperature", 
            "1 large egg", 
            "1 large egg white", 
            "1/2 teaspoon almond extract", 
            "1 1/2 teaspoons orange zest (not traditional, but just lovely in there)", 
            "1/3 cup raspberry jam", 
            "Slivered or sliced almonds, for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/bakewell-tart1.jpg?w=500", 
        "tags": [
            "English", 
            "Photo", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2010/03/bakewell-tart/", 
        "title": "bakewell tart", 
        "directions": [
            "Finely grind almonds and flour in processor. Mix in sugar, then butter, extract and orange zest. Blend until smooth. Mix in egg and egg white. Transfer filling to medium bowl. Cover and chill at least 3 hours. ", 
            "Position rack in center of oven and preheat to 350°F. Spread jam over base of tart shell. Dollop the almond filling all over, then spread it carefully with an offset spatula. If using slivered or sliced almonds as garnish, sprinkle them over the top now. Bake tart until golden and tester inserted into center of filling comes out clean, about 45 minutes. Cool tart in pan on rack. ", 
            "To serve, push pan bottom up, releasing tart from pan. Cut tart into wedges and sprinkle with powdered sugar, if desired.", 
            "Do ahead: Almond filling can be made 2 days ahead. Keep chilled. Whole tart can also be made half a day in advance. Let stand at room temperature"
        ], 
        "date": "2010-03-20T06:41:18+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup extra virgin olive oil", 
            "1 medium onion, finely diced", 
            "1 1/2 cups arborio rice", 
            "1 cup Barolo or other dry red wine", 
            "6 cups chicken stock, preferably homemade, or low-sodium, canned", 
            "3 tablespoons cold, unsalted butter, cut into small pieces", 
            "1/3 cup freshly grated Parmesan cheese, more for serving.", 
            "1 garlic clove, peeled and smashed", 
            "1 cup large green pitted olives", 
            "1 tablespoon capers, rinsed and drained", 
            "1 15-ounce can of artichoke hearts, drained", 
            "1/4 cup extra-virgin olive oil", 
            "8 large slices of crusty bread "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/batali-sans-barolo1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Grain/Rice", 
            "Italian", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/03/batali-sans-barolo/", 
        "title": "risotto al barolo + green crostini", 
        "directions": [
            "1. Preheat the oven to 400°F. In a food processor, process the garlic, olives, capers, artichoke hearts and olive oil to a coarse paste.", 
            "2. Toast the bread on the oven rack for 6 minutes, or until crisp and browned. Spread the olive paste thickly over the toasts and serve. "
        ], 
        "date": "2007-03-25T09:37:34+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large onions, chopped (about 3 cups)", 
            "1/4 cup vegetable oil", 
            "1 tablespoon minced garlic", 
            "2 carrots, sliced thin (suggested by Gourmet) or in a small dice, as I’d chop them next time", 
            "3 pounds boneless beef chuck, ground coarse or 3 pounds ground beef", 
            "1/4 cup chili powder", 
            "1 tablespoon ground cumin", 
            "2 tablespoons paprika", 
            "1 tablespoon crumbled dry oregano", 
            "Dried red pepper flakes, to taste (Gourmet suggests 1 tablespoon; I used 1 teaspoon knowing that my flakes are very hot)", 
            "2 8-ounce cans tomato sauce or 2 cups fresh tomato sauce or tomato puree", 
            "1 1/4 cups beef broth", 
            "3 tablespoons cider vinegar", 
            "1 3/4 cups or 1 19-ounce can kidney beans, rinsed and drained", 
            "2 green bell peppers, chopped", 
            "Sour Cream and Cheddar Biscuits, below", 
            "Sour cream and pickled jalapeños (optional, to finish)", 
            "1 1/2 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "2 tablespoons cold unsalted butter, cut into bits", 
            "1/4 pound sharp Cheddar cheese, coarsely grated (about 1 1/2 cups)", 
            "Drained and chopped pickled jalapeños, to taste (I used about 2 tablespoons)", 
            "1 cup sour cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/beef-chili-sour-cream-and-cheddar-biscuits1.jpg?w=500", 
        "tags": [
            "Beef", 
            "Freezer Friendly", 
            "Photo", 
            "Scones/Biscuits", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2010/09/beef-chili-sour-cream-and-cheddar-biscuits/", 
        "title": "beef chili + sour cream and cheddar biscuits", 
        "directions": [
            "Preheat oven to 425°F. Whisk together the flour, baking powder, baking soda and salt in a large bowl. Either cut the butter pieces into the flour mixture with a pastry blender or rub them in with your fingertips until well-combined. Stir in the cheddar, jalapeños and sour cream until the mixture forms a sticky dough. Pat it out to a 1/2-inch thickness on a very well-floured counter and use a 3 1/2-inch biscuit cutter to cut six rounds. Bake on an ungreased (or parchment-lined, if your baking sheets are as “weathered” as mine are) for 15 to 17 minutes, until golden on top.", 
            "Do ahead: If you’d like to serve them over a couple days, I recommend freezing already formed but unbaked biscuits until you are ready to bake them — you can bake them directly from the freezer, adding just a minute or two to the baking time."
        ], 
        "date": "2010-09-27T14:35:19+00:00"
    }, 
    {
        "ingredient_list": [
            "2 hard-boiled large eggs, chopped into bits", 
            "1/2 medium onion, finely chopped", 
            "1 tablespoon olive oil", 
            "1 garlic clove, finely chopped", 
            "1 teaspoon ground cumin", 
            "3/4 teaspoon dried oregano", 
            "3/4 pound ground beef chuck", 
            "2 tablespoons raisins (optional)", 
            "1 1/2 tablespoons chopped pimiento-stuffed olives", 
            "1 (14-ounce) can whole tomatoes in juice, drained, reserving 2 tablespoons juice, and chopped", 
            "1 package frozen empanada pastry disks, thawed (or homemade, recipe follows)", 
            "4 1/2 cups unbleached all-purpose flour (I used 1 1/2 cups whole wheat flour + 3 cups all-purpose)", 
            "3 teaspoons salt", 
            "2 sticks (1 cup or 8 ounces) cold unsalted butter, cut into 1/2-inch cubes", 
            "2 large eggs", 
            "2/3 cup ice water", 
            "2 tablespoons distilled white vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/beef-empanadas1.jpg?w=500", 
        "tags": [
            "Beef", 
            "Freezer Friendly", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/03/beef-empanadas/", 
        "title": "beef empanadas", 
        "directions": [
            "Sift flour with salt into a large bowl and blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal with some (roughly pea-size) butter lumps. Beat together egg, water, and vinegar in a small bowl with a fork. Add to flour mixture, stirring with fork until just incorporated. (Mixture will look shaggy.) Turn out mixture onto a lightly floured surface and gather together, then knead gently with heel of your hand once or twice, just enough to bring dough together. Form dough into two flat rectangles and chill them, each wrapped in plastic wrap, at least 1 hour. Dough can be chilled up to 6 hours total."
        ], 
        "date": "2009-03-23T16:45:52+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour plus additional for kneading and rolling", 
            "3/4 cup cake flour (not self-rising)", 
            "2 large eggs", 
            "3/4 teaspoon salt", 
            "1/4 cup water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/best-things-in-small-packages1.jpg?w=500", 
        "tags": [
            "Dumplings", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/best-things-in-small-packages/", 
        "title": "wild mushroom pirogies", 
        "directions": [
            "Stir together flours in a bowl. Make a well in flour and add eggs, salt, and water, then stir together with a fork without touching flour. Continue stirring, gradually incorporating flour into well until a soft dough forms. Transfer dough to a lightly floured work surface and knead, adding only as much additional flour as needed to keep dough from sticking, until smooth and elastic, about 8 minutes. (Dough will be soft.) Cover with plastic wrap and let rest at room temperature at least 30 minutes.", 
            "Do ahead: Dough may be made 2 hours ahead, wrapped well in plastic wrap and chilled. Bring to room temperature before using."
        ], 
        "date": "2006-11-22T00:38:47+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups all-purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "2 teaspoons sugar", 
            "3/4 teaspoon baking soda", 
            "1 teaspoon salt", 
            "6 tablespoons (3/4 stick or 3 ounces) cold unsalted butter, cut into 1/2-inch cubes", 
            "1 1/2 cups crumbled blue cheese", 
            "4 scallions, finely chopped", 
            "1 cup well-shaken buttermilk (or, you can make your own)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/blue-cheese-scallion-drop-biscuits1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Cheese", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2010/04/blue-cheese-scallion-drop-biscuits/", 
        "title": "blue cheese scallion drop biscuits", 
        "directions": [
            "Preheat oven to 450°F. Whisk together flour, baking powder, sugar, baking soda, and salt in a bowl, then blend in butter with your fingertips until mixture resembles coarse meal. Stir in blue cheese and scallions. Add buttermilk and stir until just combined.", 
            "Drop dough in 12 equal mounds about 2 inches apart onto a buttered large baking sheet, or one lined with parchment paper. Bake in middle of oven until golden, 16 to 20 minutes. ", 
            "Do ahead: Biscuits are always best the day they are baked. However, if you wish to get a lead on them, you can make them, drop them onto your baking sheet, freeze them until they are firm, and place them in a freezer bag or container until you’re ready to bake them. They can be baked while still frozen (straight from the freezer), you’ll just want to add a few minutes to the baking time."
        ], 
        "date": "2010-04-21T16:51:30+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound broccolini or regular broccoli", 
            "2 tablespoons olive oil", 
            "3 cloves garlic, minced", 
            "A few pinches red pepper flakes, to taste", 
            "Finely grated zest, then juice, of 1/2 lemon (juice before zesting only if you enjoy being grumpy)", 
            "Coarse salt, to taste", 
            "1/2 cup finely grated aged pecorino romano cheese", 
            "8 thin slices totally unfancy deli provolone", 
            "8 slices bread of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/broccoli-melts1.jpg?w=640", 
        "tags": [
            "Broccoli", 
            "Cheese", 
            "Photo", 
            "Sandwich", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/02/broccoli-melts/", 
        "title": "broccoli melts", 
        "directions": [
            "If using broccolini, cut it into 2-inch segments. If regular broccoli, peel the stems with a vegetable peeler first so that they cook evenly, and cut the rest into large chunks.", 
            "Pour about 1-inch puddle of salted water into a large sauté pan and bring to a boil. Add broccoli and cover with a lid and boil/steam for 2 minutes. Drain well and pat dry on paper towels, wringing out as much extra liquid as possible. Chop into small (roughly 1/2-inch) bits.", 
            "Wipe sauté pan dry and heat over medium. Add olive oil and let it heat for a full minute. Add garlic and pepper flakes, cooking for 1 minutes, or until the garlic is just beginning to turn golden. Add the broccoli and cook 1 to 2 minutes more, seasoning with salt. Transfer mixture to a bowl and add lemon zest, juice, pecorino and more salt and pepper flakes to taste.", 
            "Heat broiler. Arrange slices of bread on a tray and lightly toast on both sides. Scoop broccoli mixture onto each slice of bread, lay a slice of provolone over it and run under the broiler until cheese has melted and begun to blister. Eat. Repeat. Don’t forget to share, or at least hide the evidence if you decide not to."
        ], 
        "date": "2016-02-16T12:02:07+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds mussels", 
            "1 cup white wine (they suggest 1/2 cup but I need more to steam that volume)", 
            "4 tablespoons butter, softened", 
            "1 handful fresh flat-leaf parsley leaves, minced", 
            "1 small clove garlic, minced", 
            "4 pinches smoked paprika (pimenton)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/broiled-mussels1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Seafood"
        ], 
        "url": "https://smittenkitchen.com/2010/12/broiled-mussels/", 
        "title": "broiled mussels", 
        "directions": [
            "Clean your mussels. There are a zillion ways to do this, this is mine: I put them in a big bowl of very cold water for about 10 minutes. This encourages them to expel their sand. Scoop them out (not dump, if you dump the sandy water over them, it defeats the purpose) one by one and scrub them under running water. Most cultivated mussels have the bissus (beard) removed but if one lingers, yank it toward the hinge (if you do it away from the hinge, it can kill the mussel prematurely) or cut it with a knife. Discard any mussels with chipped shells or that are not completely shut; they are more than likely dead and it’s not worth finding out if it may or may not make you sick, right?", 
            "Boil your wine in a medium pot. Add the mussels, cover and steam them open over high heat until they open. You can start checking at 3 minutes, but it can take up to 6. I like to use the lid and potholders and shake them around a little from time to time, to make sure they’re getting equal access to the wine and heat.", 
            "Once open, let the mussels cool. Twist off and discard one of the shells from each mussels (discard any that didn’t open), making sure that the remaining shell contains the mussel. Reserve the mussel broth for another use. Mash butter, parsley, garlic, pimenton and salt to taste in a small bowl and slather each mussel with the compound butter. Arrange them in a broiler-safe tray and chill them in the fridge until the butter is hard. [This is a great do-ahead interval, if you’d like to prepare these for when you entertain.]", 
            "Preheat the broiler (or your oven to 500, if you don’t have a broiler). Broil the mussels until the butter is bubbling hot, about 2 minutes (or up to 4 in an oven). Serve immediately, with crusty bread or my favorite, baked pommes frites."
        ], 
        "date": "2010-12-20T19:50:17+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups (160 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "8 tablespoons (4 ounces or 113 grams) cold unsalted butter, cut into pieces and chill again", 
            "1/4 cup (60 grams) plain yogurt or sour cream", 
            "2 teaspoons (10 ml) fresh lemon juice", 
            "1/4 cup (60 ml) ice water", 
            "For the filling:", 
            "1 tablespoon (15 ml) olive oil", 
            "1/4 teaspoon coarse Kosher or sea salt", 
            "3 cups (about 450 grams) cherry or grape tomatoes", 
            "1 ear corn, cut from the cob (about 1 cup)", 
            "1 small (8 ounces or 225 grams) zucchini or summer squash, diced", 
            "1 bundle (3 to 4 ounces or 85 to 115 grams) scallions, thinly sliced", 
            "1/2 cup (2 ounces or 55 grams) grated parmesan", 
            "Glaze:", 
            "1 egg yolk beaten with 1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/burst-tomato-zucchini-and-corn-galette.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Corn", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Quiche", 
            "Tomatoes", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2013/08/burst-tomato-galette-with-corn-and-zucchini/", 
        "title": "burst tomato galette with corn and zucchini", 
        "directions": [
            "Make dough: Whisk stir the flour and salt in a large bowl. Sprinkle bits of butter over dough and using a pastry blender or your fingertips, work it into the flour until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, stir together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball. Wrap with plastic and refrigerate for 1 hour, or up to 2 days.", 
            "Make filling: Get down the saute pan with the lid. If you don’t have one, any large lid will do. Add olive oil, tomatoes, salt and a pinch of red pepper flakes (if that’s your thing) to your saute pan then cover and heat over high heat. Roll the tomatoes around from time to time so that they’ll cook evenly. In a few minutes, you’ll hear some putts and pops as the tomatoes burst a little. When most have, remove lid, turn heat down to medium and add zucchini chunks. Saute for two minutes, until they soften. Add corn and cook one minute. Add scallions, just stirring them in, then turn off heat. Adjust seasonings if needed. Transfer mixture to a large plate and spread it out, so that it will cool faster. You want it cooled to at least lukewarm before assembling the galette.", 
            "Assemble galette: Heat oven to 400 degrees. On a floured counter, roll the dough out into a 12-inch round and it really doesn’t need to be perfectly shaped. Transfer to a parchment-lined baking sheet; I like to fold my dough gently, without creasing, in quarters then unfold it onto the baking pan. Sprinkle tomato-zucchini-corn mixture with half of parmesan and spoon the mixture into the center of the dough, leaving a 2-inch border. If any liquid has puddle in plate, try to leave it there as you spoon. Sprinkle with almost all of remaining parmesan, leaving a pinch or two behind for the crust. Fold the border over the filling, pleating the edge to make it fit. The center will be open. Brush crust with egg yolk glaze. Sprinkle glaze with last pinches of parmesan.", 
            "Bake the galette: For 30 to 40 minutes, or until puffed and golden brown. Remove from the oven and let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature."
        ], 
        "date": "2013-08-05T12:19:43+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups all-purpose flour", 
            "1/4 teaspoon salt", 
            "8 tablespoons (1 stick) unsalted butter, cut into", 
            "pieces", 
            "1/4 cup sour cream or plain yogurt", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup ice water", 
            "For the filling:", 
            "1 small butternut squash (about one pound)", 
            "2 tablespoons olive oil", 
            "1 to 2 tablespoons butter (if you have only non-stick, the smaller amount will do)", 
            "1 large onion, halved and thinly sliced in half-moons", 
            "1 teaspoon salt", 
            "Pinch of sugar", 
            "1/4 teaspoon cayenne, or to taste", 
            "3/4 cup fontina cheese (about 2 1/2 ounces), grated or cut into small bits", 
            "1 1/2 teaspoons chopped fresh sage leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/10/butternut-squash-and-caramelized-onion-galette.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Onions", 
            "Photo", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2007/10/butternut-squash-and-caramelized-onion-galette/", 
        "title": "butternut squash and caramelized onion galette", 
        "directions": [
            "1.\tMake pastry: In a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour.", 
            "2.\tPrepare squash: Preheat oven to 375 degrees F. Peel squash, then halve and scoop out seeds. Cut into a 1/2-inch dice. Toss pieces with olive oil and a half-teaspoon of the salt and roast on foil lined (for neatness sake) sheet for 30 minutes or until pieces are tender, turning it midway if your oven bakes unevenly. Set aside to cool slightly. ", 
            "3.\tCaramelize onions: While squash is roasting, melt butter in a heavy skillet and cook onion over low heat with the remaining half-teaspoon of salt and pinch of sugar, stirring occasionally, until soft and lightly golden brown, about 20 minutes. Stir in cayenne. ", 
            "4.\tRaise the oven temperature to 400 degrees. Mix squash, caramelized onions, cheese and herbs together in a bowl.", 
            "5.\tAssemble galette: On a floured work surface, roll the dough out into a 12-inch round. Transfer to an ungreased baking sheet. Spread squash, onions, cheese and herb mixture over the dough, leaving a 1 1/2-inch border. Fold the border over the squash, onion and cheese mixture, pleating the edge to make it fit. The center will be open.", 
            "6.\tBake until golden brown, 30 to 40 minutes. Remove from the oven, let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature. Serves 6."
        ], 
        "date": "2007-10-11T09:30:00+00:00"
    }, 
    {
        "ingredient_list": [
            "6 large eggs", 
            "12 small romaine lettuce leaves", 
            "2 to 3 tablespoons mayo (2 is suggested but 3 will make a creamier filling)", 
            "2 teaspoons smooth Dijon mustard", 
            "1/4 teaspoon Worcestershire sauce (optional)", 
            "1/2 teaspoon lemon juice", 
            "2 tablespoons chopped fresh flat-leaf parsley", 
            "Salt and freshly ground black pepper", 
            "1 tablespoon olive oil", 
            "1 anchovy fillet, minced", 
            "1 small clove garlic, minced", 
            "1/4 teaspoon grated lemon zest", 
            "1/4 cups (30 grams) panko bread crumbs", 
            "2 tablespoons freshly grated Parmesan cheese or more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/caesar-salad-deviled-eggs.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Easter", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2011/12/caesar-salad-deviled-eggs/", 
        "title": "caesar salad deviled eggs", 
        "directions": [
            "Place the eggs in a saucepan and cover with water. Bring to a boil over high heat. Once water begins to boil, reduce it to medium-low and simmer eggs for exactly 10 minutes. Drain eggs and cover with cold water. Sitting them in ice water will help the eggs chill more quickly.", 
            "Do ahead: As I discovered giving your eggs two to four days to rest in the fridge ensures that they peel more easily. If you’ve got time, do this now.", 
            "Arrange 12 small lettuce leaves on a serving platter. Carefully peel the eggs and cut in half lengthwise. Remove the yolks and place them in a small bowl. Arrange the whites on leaves. Mash the yolks with the mayo, Dijon, Worcestershire (if using), lemon juice and 1 tablespoon of the parsley until smooth. Season generously with salt and freshly ground black pepper. Set the filling aside.", 
            "In a small skillet, heat the olive oil over medium heat. Add the anchovy and garlic and cook, stirring, until the anchovy begins to dissolve into the oil, about 1 minute. Add the lemon zest and bread crumbs and saute them until golden, about 2 to 3 minutes. Stir in Parmesan and set crumbs aside.", 
            "When you’re ready to serve the eggs, spoon the yolk mixture back into the cavities of the egg whites, mounding it slightly in the center. (To make extra-cute eggs, you can pipe the filling with a star tip.) Sprinkle each egg with some of the crumb mixture (about 1 teaspoon), allowing some to spill onto the lettuce cups. Garnish with remaining chopped parsley and serve."
        ], 
        "date": "2011-12-12T13:57:38+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/caponata1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Celery", 
            "Eggplant", 
            "Italian", 
            "Photo", 
            "Put An Egg On It", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/09/caponata/", 
        "title": "caponata", 
        "directions": [
            "In a large skillet (12 inches is ideal), heat oil over medium-high heat. Once very hot, working in batches, fry eggplant cubes in one layer at a time, stirring and turning occasionally until golden brown, about 3 to 5 minutes. Use a slotted spoon to drain eggplant over skillet, then transfer to a paper towel-lined plate and immediately season with salt. Repeat with remaining eggplant. Transfer drained and mostly cooled eggplant to a large bowl.", 
            "Pour off all but 3 tablespoons olive oil, and reserve the rest for another use. Cook onions and and celery with salt and pepper over medium-high heat until beginning to brown, about 10 minutes. Reduce heat to medium, add tomato paste and water and cook, stirring, until caramelized and almost evaporated, 2 minutes. Reduce heat to medium and add crushed tomatoes; cook for 10 minutes. Stir in olives, vinegar, raisins, capers, and sugar and cook, stirring occasionally, until thickened, about 15 minutes more. Transfer to bowl with eggplant, along with basil and pine nuts, and stir to combine. Season with salt and pepper to taste, and let cool to room temperature before serving. ", 
            "Do ahead: If you have time to spare, covering your cooling bowl of caponata with plastic and letting it sit for at least 2 hours gives an even more developed flavor. It’s even better on the second day. Keep it in the fridge and bring it out an hour before you plan to eat it to take the chill off. Caponata keeps for one week in the fridge."
        ], 
        "date": "2015-09-08T12:00:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small head cauliflower (1 pound florets, i.e. stems and leaves removed), cut into generous 1 to 2 inch chunks", 
            "1 large egg", 
            "1 garlic clove, minced", 
            "Few gratings of fresh lemon zest", 
            "3 ounces crumbled feta (about 1/2 cup)", 
            "1/2 cup all-purpose flour", 
            "1/4 teaspoon Aleppo pepper flakes; less if using regular red pepper flakes, which are hotter", 
            "3/4 teaspoon table salt or more to taste", 
            "1/2 teaspoon baking powder", 
            "Olive oil for frying", 
            "To serve", 
            "3/4 cup yogurt", 
            "1/2 teaspoon ground cumin", 
            "Salt and pepper to taste", 
            "Handful pomegranate arils"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/12/cauliflower-feta-fritters-with-pomegranate.jpg?w=751", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cauliflower", 
            "Lunch", 
            "Photo", 
            "Pomegranate", 
            "Snack", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/12/cauliflower-feta-fritters-with-pomegranate/", 
        "title": "cauliflower-feta fritters with pomegranate", 
        "directions": [
            "Cook cauliflower in simmering salted water, uncovered, until tender, about 5 to 6 minutes, until firm but tender. Using a slotted spoon, transfer to a bowl of ice water to stop cooking. Drain well. Spread on towels to dry as much as possible.", 
            "In the bottom of a large bowl, whisk together egg, garlic and lemon zest. Add cauliflower florets and mash with a potato masher until they’re crushed into an average of pea-sized pieces (i.e. some will be bigger, some smaller, but most will be little nubs). Sprinkle in feta and stir to combine egg mixture, cauliflower and feta. In a small dish, whisk flour, salt, pepper and baking powder until evenly combined. Sprinkle over cauliflower batter and stir just until combined.", 
            "Heat oven to 200 degrees F and place a tray inside. On the stove, heat a large, heavy skillet over moderate heat. Once hot, add a good slick of oil, about 2 to 3 tablespoons. Once the oil is hot (you can test it by flicking a droplet of water into it; it should hiss and sputter), scoop a two tablespoon-size mound of the batter and drop it into the pan, then flatten it slightly with your spoon or spatula. Repeat with additional batter, leaving a couple inches between each. Once brown underneath, about 2 to 3 minutes, flip each fritter and cook on the other side until equally golden, about another 1 to 2 minutes.", 
            "Transfer briefly to paper towels to drain, then the tray in the oven to keep them warm until needed. Once all fritters are cooked, mix yogurt with cumin, salt and pepper. Spread fritters on serving platter. Dollop each with cumin yogurt and sprinkle with pomegranate arils.", 
            "Do ahead: Fritters both freeze and reheat well. To warm and recrisp them, lay them on a tray and toast them at 400 degrees in the oven until crisp again."
        ], 
        "date": "2012-12-04T10:13:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups (about 6 ounces) grated extra-sharp Cheddar cheese", 
            "4 tablespoons (1/2 stick or 2 ounces) unsalted butter, softened and cut into 4 pieces", 
            "3/4 cup flour, plus more for dusting", 
            "1/2 teaspoon kosher salt", 
            "1/2 teaspoon crushed red pepper flakes", 
            "1 tablespoon half-and-half (I used cream, because I had it on hand; suspect milk would work just as well)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/cheese-straws.jpg?w=753", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cheese", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/06/cheese-straws/", 
        "title": "cheese straws", 
        "directions": [
            "1.    Preheat oven to 350°F.", 
            "2.    In a food processor, combine the cheese, butter, flour, salt and red pepper in five 5-second pulses until the mixture resembles coarse crumbs. Add the half-and-half and process until the dough forms a ball, about 10 seconds.", 
            "3.    On a lightly floured surface, using a lightly floured rolling pin, roll the dough into an 8- by 10-inch rectangle that is 1/8-inch thick. With a sharp knife (or a pizza or pastry wheel; both worked great), cut the dough into thin 8-inch strips, each 1/4- to 1/3-inch wide (dipping the knife in flour after every few inches ensures a clean cut). Gently transfer the strips to an ungreased cookie sheet (though I lined mine with parchment), leaving at least 1/4-inch between them. The dough may sag or may break occasionally in the transfer, but don’t be concerned — just do your best. The straws can be any length, from 2 to 10 inches.", 
            "4.    Bake the straws on the middle rack for 12 to 15 minutes, or until the ends are barely browned. Remove from the oven and set the cookie sheet on a rack to cool.", 
            "5.    Serve at room temperature. Cheese straws will keep in the refrigerator, in a sealed container, for two days. They will not last an hour at a party.", 
            "Variation: One adaptation I am curious to try would be to roll these into thin, round crackers. Because they puff a bit, I’d roll them as thin as possible, and use a fork or skewer to make some holes to keep the expansion in check. If you try this, I’d love to hear how it went for you."
        ], 
        "date": "2009-06-16T15:19:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound cremini mushrooms, or a mix of wild mushrooms such as morels, shiitakes, oysters or chanterellas", 
            "2 tablespoons unsalted butter, more for toast", 
            "1 large or 2 small shallots, chopped", 
            "2 tablespoons dry white wine or white vermouth", 
            "1/4 cup heavy cream", 
            "Kosher salt and freshly ground black pepper", 
            "Slices brioche or good white bread, crusts cut off if desired", 
            "1 tablespoon fresh chopped chives", 
            "Coarse sea salt such as fleur de sel or Maldon, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/12/creamed-mushrooms-on-butter-chive-toast.jpg?w=753", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Herbs", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/12/creamed-mushrooms-on-chive-butter-toast/", 
        "title": "creamed mushrooms on chive butter toast", 
        "directions": [
            "Clean excess dirt from mushrooms. Slice mushrooms in half lengthwise and brush away any grit; chop into 1/4-inch pieces.", 
            "Melt butter in a large skillet over medium-high heat. Add shallots and sauté until very limp, about three minutes. Add mushrooms and cook, stirring, for about five minutes. Add wine, reduce heat to medium, cover, and cook for about five minutes more. (There are a lot of “abouts” on the cooking times because I found that mine took less time at each step; however, I also may have chopped my mushrooms and shallots smaller than the recommended size.)", 
            "Uncover pot and continue cooking, stirring occasionally, until most of the liquid has evaporated, about two minutes. Stir in cream; simmer until slightly thickened, two minutes longer. Season with salt and pepper to taste. ", 
            "Toast bread and spread with butter. (Clark recommended four slices of brioche, to make eight toasts, but I had enough mushrooms for almost triple that.) Cut each slice in half diagonally and sprinkle lightly with chives. Top each toast triangle with some mushroom mixture. Sprinkle with additional chives, garnish with sea salt, and serve.", 
            "Other uses for these mushrooms: I’d imagine they’d make a wonderful simple pasta sauce or, of course, something delicious to prop a poached egg upon, toast and all.", 
            "[Update: Thanks to the six (!) people who have noted that the theory that mushrooms absorb too much water to be washed has been rejected over time. They do absorb water, but not enough that they should throw off a dish. Wash away!]"
        ], 
        "date": "2009-12-13T10:39:57+00:00"
    }, 
    {
        "ingredient_list": [
            "For polenta", 
            "4 1/2 cups water", 
            "1 cup coarse stone-ground white grits (preferably organic)", 
            "1/4 cup heavy cream", 
            "2 tablespoons finely grated Parmigiano-Reggiano", 
            "1 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "For mushrooms", 
            "1 pound assorted fresh exotic mushrooms such as porcini, oyster, chanterelle, lobster, and hedgehog", 
            "3 tablespoons extra-virgin olive oil", 
            "1 garlic clove, smashed", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "1/4 cup water", 
            "3 tablespoons cold unsalted butter", 
            "1 1/2 tablespoons fresh lemon juice", 
            "1 tablespoon chopped fresh flat-leaf parsley (we used chives)", 
            "For serving", 
            "1/2 cup mascarpone (though we used crème fraîche, and just a tad)", 
            "2 tablespoons finely grated Parmigiano-Reggiano "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creamy-white-polenta-with-mushrooms1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/creamy-white-polenta-with-mushrooms/", 
        "title": "creamy white polenta with mushrooms", 
        "directions": [
            "Make polenta: Bring water to a simmer in a 3- to 4-quart heavy saucepan. Add grits in a slow stream, whisking until incorporated. Simmer, stirring occasionally with a long-handled whisk or wooden spoon, until liquid is absorbed and polenta is thick and soft, about 30 minutes. (Grits will have a loose, risotto-like consistency.) Remove from heat and stir in cream, cheese, salt, and pepper. Keep warm, covered.", 
            "Saute mushrooms while polenta simmers: If using porcini, halve if large, then slice lengthwise into 1/4-inch thick slices. If using oysters, trim spongy base if necessary and slice caps into 1/2-inch-wide strips. If using chanterelles, leave small mushrooms whole, halve if medium, and quarter if large. If using lobsters, cut into 1/2-inch pieces. If using hedgehogs, trim base of stems and halve caps if large.", 
            "Heat oil in a 10-inch heavy skillet over moderately high heat until hot but not smoking, then saute mushrooms, garlic, salt, and pepper, stirring occasionally, until mushrooms are golden and any liquid they give off is evaporated, 6 to 8 minutes.", 
            "Add water, butter, lemon juice, and parsley and heat, swirling skillet, until butter melts and liquid forms a sauce.", 
            "To serve: Top each serving of polenta with mushrooms and mascarpone. Serve immediately (polenta stiffens as it cools), sprinkled with Parmigiano-Reggiano.", 
            "Note: Mushroom sauce can be made 1 hour ahead and kept, covered, at room temperature. Reheat before using. "
        ], 
        "date": "2007-11-12T23:50:32+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups (230 grams) unbleached all-purpose flour", 
            "1 tablespoon chopped rosemary plus 2 (6-inch) sprigs", 
            "1 teaspoon baking powder", 
            "3/4 teaspoon salt", 
            "1/2 cup (120 ml) water", 
            "1/3 cup (80 ml) olive oil plus more for brushing", 
            "Flaky sea salt such as Maldon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/crisp-rosemary-flatbread1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/08/crisp-rosemary-flatbread/", 
        "title": "crisp rosemary flatbread", 
        "directions": [
            "Preheat oven to 450°F with a heavy baking sheet on rack in middle.", 
            "Stir together flour, chopped rosemary, baking powder, and salt in a medium bowl. Make a well in center, then add water and oil and gradually stir into flour with a wooden spoon until a dough forms. Knead dough gently on a work surface 4 or 5 times.", 
            "Divide dough into 3 pieces and roll out 1 piece (keep remaining pieces covered with plastic wrap) on a sheet of parchment paper into a 10-inch round (shape can be rustic; dough should be thin).", 
            "Lightly brush top with additional oil and scatter small clusters of rosemary leaves on top, pressing in slightly. Sprinkle with sea salt. Slide round (still on parchment) onto preheated baking sheet and bake until pale golden and browned in spots, 8 to 10 minutes. Transfer flatbread (discard parchment) to a rack to cool, then make 2 more rounds (1 at a time) on fresh parchment (do not oil or salt until just before baking). Break into pieces.", 
            "Flatbread can be made 2 days ahead and cooled completely, then kept in an airtight container at room temperature."
        ], 
        "date": "2008-08-22T11:38:22+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/crispy-frizzled-artichokes1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Artichokes", 
            "Gluten-Free", 
            "Grilling", 
            "Italian", 
            "Photo", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/06/crispy-frizzled-artichokes/", 
        "title": "crispy frizzled artichokes", 
        "directions": [
            "Prepare artichokes: Snap back toughest and unevenly sized outer leaves, peeling and plucking until you get to the paler yellowish leaves that are all the full length of the artichoke. Be careful of thorns; almost every leaf ends in one. If they’re particularly bothersome, you can lop off the bottom third of the artichoke at this point. (We will otherwise do it next.) For baby artichokes, cut off bottom 1/3 of leaves. For full-sized artichokes, cut off bottom 2/3 of leaves (more than you see in my photos), leaving only the top parts attached to the stem and heart. Rub all cut sides with lemon. ", 
            "Use a knife to pare down rough spots where leaves met the heart. Use a vegetable peeler to remove the outermost layer of the stem and “neck” of the artichoke. With tiny artichokes, the stems are sometimes too small or in bad shape to be used, in which case, feel free to trim them off. Rub exposed sides with lemon.", 
            "Halve baby artichokes lengthwise through the stem; for full-sized artichokes, quarter them through the stem. Rub cut sides with lemon.", 
            "If you’re using baby artichokes, you’re done with prep. If you’re using full-sized artichokes, you’ll need to take the additional step of cutting out and discarding the fibrous fuzzy (and unpleasant to eat) choke and the wiry (often purple) inner leaves. [See photos above for a visual aid.]", 
            "Heat oven or grill: Heat oven to 400 degrees, a gas grill to its highest setting or a charcoal grill to a very high temperature.  ", 
            "Par-boil artichokes: Bring a pot of salted water to a boil. Add trimmed artichokes and the halved lemon you’ve been using to prevent browning. Boil them for 5 minutes (for baby artichokes) or 10 to 15 minutes (for full-sized artichokes), until a knife point inserted into the neck of the artichoke pierces easily to the center. Drain artichokes well; discard lemon half.", 
            "If roasting artichokes: Drizzle roasting pan with olive oil, spread drained artichokes in a single layer, drizzle with a little additional olive oil and shower with coarse salt. Roast baby artichokes for 15 minutes, then flip, and roast for another 10 to 15 minutes, until crisp and browned. Roast full-sized artichokes for 20 to 25 minutes, then flip, and roast for another 15 to 20, also until crisp and browned.  ", 
            "If grilling artichokes: In a large bowl, toss drained artichokes with a glug or so of olive oil, enough that they all glisten. Season with salt. If the grill grates are close enough together, I use tongs to arrange the artichokes in one layer. If not, you might need to use a vegetable tray to keep the artichokes from falling through. Grill until artichokes are crisp and brown.", 
            "To serve: Shower with additional lemon juice (from second half of lemon), any extra salt (if needed) and parsley. Eat soon, or someone else will."
        ], 
        "date": "2015-06-02T12:00:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds fresh peas in pods or about 1 1/2 cups already shelled or frozen and defrosted", 
            "1/4 cup plain yogurt", 
            "2 tablespoons tahini (sesame seed paste)", 
            "1 tablespoon lemon juice", 
            "2 tablespoons water", 
            "1/4 teaspoon ground cumin", 
            "1/4 teaspoon paprika, smoked if you have it", 
            "1/4 teaspoon salt", 
            "1 scallions, thinly sliced", 
            "Toasted pitas, cut into wedges, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/4682924368_cce5a4dd30_o.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Peas", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/06/crushed-peas-with-smoky-sesame-dressing/", 
        "title": "crushed peas with smoky sesame dressing", 
        "directions": [
            "Cook peas: Have ready a colander and an ice bath, and bring a medium pot of lightly salted water to a boil. Blanche peas for 30 seconds (if you like them with a real residual snap) to 1 minute (for a slightly more yielding pea) and drain them, then immediately shocking them in the ice water. Drain the peas again and pat them dry on a large towel.", 
            "Crush peas:  Using a potato or egg-masher (and hopefully not an annoying one like mine, with holes the exact size of peas!), muddler or meat pounder (be gentle!), lightly crush the peas. Aim for mixed textures, some left whole, most in halves and a few a little more broken up. Put them in a large bowl.", 
            "Make dressing:  Whisk together tahini, yogurt, lemon juice, water, cumin, paprika and salt. You might be tempted, as I was, to swap the water with olive oil but don’t do it — it makes a horrible curdled mess you will be sad to have to toss.", 
            "Assemble: Mix peas with about 3 tablespoons of the dressing, to start, then add more to taste. Sprinkle with scallions. Heap pea mixture on toasted pita wedges."
        ], 
        "date": "2010-06-11T11:56:25+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "3/4 pound (12 ounces, 340 grams or about 2 1/4 cups) dried dates", 
            "2 1/4 cups (530 ml) boiling water", 
            "1 1/2 teaspoons baking soda", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "3/4 cup (150 grams) granulated sugar", 
            "2 tablespoons (25 grams) light or dark brown sugar", 
            "2 large eggs", 
            "1/4 teaspoon fine sea or table salt", 
            "1 2/3 cups (210 grams) all-purpose flour", 
            "Sauce", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "1 cup (235 ml) heavy or whipping cream", 
            "1 cup plus 2 tablespoons (215 grams) brown sugar (light is called for, but I’d like to use dark next time)", 
            "2 teaspoons vanilla extract", 
            "To serve", 
            "Unsweetened whipped cream (optional, but please don’t skip it)", 
            "A few flakes of sea salt", 
            "Fresh mint leaves (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/date-cake-with-toffee-sauce-31.jpg?w=640", 
        "tags": [
            "Cake", 
            "Christmas", 
            "Dates", 
            "English", 
            "Everyday Cakes", 
            "Photo", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/11/date-cake-with-toffee-sauce/", 
        "title": "sticky toffee pudding", 
        "directions": [
            "Make the cake: Pit and roughly chop dates and place them in a heatproof bowl. Pour boiling water over them and stir in the baking soda. Cover the bowl and set it aside for 30 minutes.", 
            "Meanwhile, heat oven to 350°F (175°C). Butter a 9×13-inch baking pan. As an extra precaution, if you’re nervous about sticking (although this cake should not), you can line the bottom with a fitted rectangle of parchment paper.", 
            "Blend date-water mixture in a blender or food processor until smooth. In a large bowl, combine the melted butter and sugars. Whisk in eggs, then salt. Stir in the flour, then date puree. Pour the batter into the prepared pan and bake for 25 to 30 minutes, until a toothpick inserted into the center comes out clean. ", 
            "To serve it rustic-style, as we did, let it cool in the pan on a cooling rack. If you’d like to transfer it later to a serving plate, let cool in the pan for 20 minutes, then flip it out onto a cooling rack, removing the parchment paper if you used it.", 
            "Make the sauce: Combine butter, cream, sugar and vanilla in a larger saucepan than you think you’ll need (I vote for 2 1/2 to 3 quarts) over medium heat and bring to a simmer. Whisk for about 10 minutes, until the mixture thickens slightly. ", 
            "To serve: Cut the cake into squares (still warm is just fine). Drizzle each slice with toffee sauce, a pinch of sea salt, and top with a dollop of whipped cream, if desired. If your mint plant has survived the fall better than mine has, a leaf or two would be lovely here, too."
        ], 
        "date": "2014-11-06T12:06:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound salt pork, pancetta or bacon, diced", 
            "1 large onion, finely diced", 
            "3 shallots, chopped", 
            "4 tablespoons butter, as needed", 
            "2 pounds beef chuck, in 1-inch cubes", 
            "2 tablespoons flour", 
            "Salt and freshly ground black pepper", 
            "1/2 cup Cognac (see Note)", 
            "2 cups unsalted beef stock", 
            "1/2 cup smooth Dijon mustard", 
            "4 tablespoons coarse Dijon or Pommery mustard (see Note)", 
            "4 medium carrots, peeled and cut into half-moon slices", 
            "1/2 pound mushrooms, stemmed, cleaned and quartered", 
            "1/4 cup red wine (see Note)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/dijon-and-cognac-beef-stew.jpg?w=750", 
        "tags": [
            "Beef", 
            "Date Night", 
            "French", 
            "Photo", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/02/dijon-and-cognac-beef-stew/", 
        "title": "dijon and cognac beef stew", 
        "directions": [
            "Place salt pork in a Dutch oven or a large heavy kettle over low heat, and cook until fat is rendered. Remove solid pieces with a slotted spoon, and save for another use, like your salad, vegetables or, uh, snacking. Raise heat to medium-low, and add onion and shallots. Cook until softened but not browned, about 10 to 15 minutes. Use a slotted spoon to transfer to a large bowl.", 
            "If necessary, add 2 tablespoons butter to the pan to augment fat. Dust beef cubes with flour, and season lightly with salt and more generously with pepper. Shake off excess flour, and place half the cubes in the pan. Cook over medium-high heat until well browned, almost crusty, on all sides, then transfer to a bowl with onions. Repeat with remaining beef.", 
            "Add Cognac to the empty pan, and cook, stirring, until the bottom is deglazed and any crusted-on bits come loose. Add stock, smooth Dijon mustard and 1 tablespoon coarse or Pommery mustard. Whisk to blend, then return meat and onion mixture to pan. Lower heat, cover pan partway, and simmer gently until meat is very tender, about 1 1/4 hours.", 
            "Add carrots, and continue simmering for 40 minutes, or until slices are tender. As they cook, heat 2 tablespoons butter in medium skillet over medium-high heat, and sauté mushrooms until browned and tender. Stir mushrooms into stew along with remaining mustard and red wine. Simmer 5 minutes, then taste, and adjust seasoning. Serve hot."
        ], 
        "date": "2014-02-24T12:16:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 15-ounce can of white cannelini or navy beans, drained and rinsed", 
            "1 small jar roasted red peppers, or about 1 cup, drained", 
            "3 ounces cream cheese, softened", 
            "1 clove garlic, minced", 
            "Juice from half a lemon", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/08/alex-deb-wedding.jpg?w=700", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Beans", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/08/dorkalicious/", 
        "title": "white bean roasted red pepper dip", 
        "directions": [
            "Puree everything in a food processor until smooth. Bachelors, your margarita blender will work, too. ", 
            "Serve with baked pita chips. "
        ], 
        "date": "2007-08-28T13:52:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound feta (cow’s milk)", 
            "2/3 cup sundried tomatoes in oil", 
            "1/2 cup pitted Kalamata olives", 
            "2 tablespoons fresh dill", 
            "3 tablespoons flat-leaf parsley", 
            "2 scallions", 
            "1/4 cup olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/feta-salsa1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Salad", 
            "Savory Sauces and Condiments"
        ], 
        "url": "https://smittenkitchen.com/2008/12/feta-salsa/", 
        "title": "feta salsa", 
        "directions": [
            "Crumble the feta into a bowl. Chop the tomatoes and olives, dill and parsley and thinly slice the scallions. Gently mix the ingredients together and drizzle with a few tablespoons of olive oi, or to taste."
        ], 
        "date": "2008-12-05T17:36:49+00:00"
    }, 
    {
        "ingredient_list": [
            "Filling", 
            "1/2 cup sundried tomatoes in oil, drained", 
            "1/3 cup pitted kalamata olives", 
            "1 teaspoon dried oregano or 2 teaspoons chopped fresh oregano leaves; thyme and rosemary would work too", 
            "1 large garlic clove, peeled", 
            "1 tablespoon olive oil or reserved oil from tomatoes, plus more to loosen if needed", 
            "Salt and freshly ground black pepper or red pepper flakes to taste", 
            "Assembly", 
            "2 packages puffed pastry (leave in fridge overnight to thaw)", 
            "1 egg yolk beaten with 1 teaspoon water (for egg wash)", 
            "1 tablespoon sesame or poppy seeds to sprinkle (optional)", 
            "Dip", 
            "6 ounces feta, crumbled", 
            "2 ounces cream cheese, cold is fine", 
            "1/3 cup olive oil", 
            "2 tablespoons lemon juice", 
            "Coarse or kosher salt, to taste (changed from 1/2 teaspoon, which could be overkill if your feta is very salty)", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/feta-tapenade-tarte-soleil1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "French", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2015/12/feta-tapenade-tarte-soleil/", 
        "title": "feta tapenade tarte soleil", 
        "directions": [
            "Make the filling: Blend ingredients in a food processor until finely chopped and spreadable. Mixture will be thick. You can thin it with more olive oil if needed, but no need to make this thin like a sauce. Adjust seasonings to taste. Set aside.", 
            "Heat oven to 350 degrees. ", 
            "Assemble the tart: Roll first package puffed pastry flat on a large piece of parchment paper or reusable baking mat into a 12-inch circle; use a 12-inch round plate or bowl to mark the size for a clean cut. Repeat with second dough, setting one aside in the fridge until needed. ", 
            "Place first round on a parchment- or nonstick mat-lined baking sheet. Spread with filling to all but 1-inch from edge. Dab edges with water and place second round on top. Set a small glass upside down in the middle. Being careful not to cut through parchment paper or baking mat, cut away from glass (i.e. not through center) in quarters, or at the 3-, 6-, 9- and 12 o’clock marks. Cut through each quarter again, making 8 strips, and again, making 16 strips, and one last time so that you have 32  “rays” of pastry emanating from the center. If at any point in the cutting the pastry feels annoyingly soft and hard to cut, just pop the tray in the freezer for a few minutes to firm it back up.", 
            "Remove glass. Place finger near center of each ray (where it is most likely to break off prematurely) and gently twist each strand a few times. Beat egg yolk with 1 teaspoon water; brush it over pastry and sprinkle with seeds, if desired. ", 
            "Bake for 30 to 35 minutes, until golden brown all over. ", 
            "Meanwhile, make whipped feta dip: Blend all filling ingredients in a blender or food processor until smooth. Adjust seasonings to taste. Place in bowl for dipping.", 
            "Remove tart from oven, let cool on baking sheet for 10 minutes then transfer to a serving platter. Tear off rays of sun, dip in whipped feta; repeat as needed."
        ], 
        "date": "2015-12-29T12:01:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups (7 3/4 ounces or 220 grams) all-purpose flour", 
            "1 teaspoon baking powder", 
            "3/4 teaspoon table salt", 
            "1/2 cup (118 ml) water", 
            "1/3 cup (79 ml) olive oil", 
            "2/3 to 3/4 cup (about 3 ounces or 85 grams) grated Mahon cheese (see above for replacements)", 
            "1/3 to 1/2 cup (79 to 118 ml) honey", 
            "1 tablespoon fresh thyme", 
            "Flaky sea salt such as Maldon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/flatbreads-with-honey-thyme-and-sea-salt1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Bread", 
            "Quick", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2011/07/flatbreads-with-honey-thyme-and-sea-salt/", 
        "title": "flatbreads with honey, thyme and sea salt", 
        "directions": [
            "Preheat oven to 450°F with a heavy baking sheet or pizza stone on a middle rack.", 
            "Whisk together flour, baking powder, and salt in a medium bowl. Make a well in center, then add water and oil and gradually stir into flour with a wooden spoon until a dough forms. Knead dough gently on a work surface 4 or 5 times. It will feel quite oily (but just think of how great your hands will look later!). ", 
            "Divide dough into 4 pieces and roll out 1 piece at on a sheet of parchment paper into a longish irregular rustic shape; mine were about 12″x6″. The dough should be rolled thin and it be crazy oily and you’ll think I’ve lost my mind suggesting that it will make anything but a mess, but you’ll see in a few minutes how perfectly ungreasy it bakes up, promise.", 
            "Slide rolled out dough and parchment paper together onto the preheated baking sheet or stone, and bake about 5 minutes, until lightly golden. Leaving the oven on, remove tray from oven and quickly sprinkle with 1/4 of grated cheese. Bake an additional 3 to 4 minutes, until browned at edges and in thinner spots. Remove flatbreads from oven a final time, quickly drizzle each with honey (1 used about a tablespoon per flatbread, but the restaurant used more; they were truly flooded with honey and it was delicious), sprinkle with sea salt and garnish with thyme leaves. Cut each cracker width-wise into 4 sections (about 3″x6″ each) with a sharp knife. Repeat with remaining pieces of dough. Serve warm.", 
            "Do ahead: Should you want to prepare these ahead of time for a party, I’d bake them including the cheese about 1 minute less than needed. Shortly before you’re ready to serve them, re-toast them in the oven and then drizzle on the honey/thyme/sea salt. "
        ], 
        "date": "2011-07-10T18:39:42+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds baking potatoes, peeled and cut into chunks", 
            "4 to 5 tablespoons unsalted butter + a little extra to melt and drizzle over the dumplings (Deb note: I was able to make do with just 2 T butter in a non-stick)", 
            "3 onions, finely chopped", 
            "Salt and black pepper to taste", 
            "1 to 2 packages of gyoza (pot sticker) wrappers", 
            "3 to 5 green onions, thinly sliced or 1/4 cup chopped chives or 2 tablespoons chopped parsley or additional fried onions (see note), to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/from-insert-your-origin-here-with-love1.jpg?w=500", 
        "tags": [
            "Dumplings", 
            "Photo", 
            "Potatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/07/from-insert-your-origin-here-with-love/", 
        "title": "quick potato pierogi", 
        "directions": [
            "Sour cream, melted butter or vinegar to serve ", 
            "Cook the potatoes in a large pot of salted boiling water until just tender. Drain and set aside. ", 
            "Melt the butter in a large heavy frying pan and cook the onions until they soften then lightly brown, darkly browned in spots. ", 
            "Mash the potatoes in a bowl then mix in the onions and their cooking butter. Season generously with salt and pepper. ", 
            "Using a round cookie or biscuit cutter the width of the smaller side of the dumpling wrapper, cut 10 to 12 wrappers at a time into circles, discarding the extra. Working on at a time, brush the edge of the round wrapper with water and place a spoonful of filling in the center. Fold dumpling in half, pressing the edges together to thoroughly seal. ", 
            "Place each dumpling on a parchment or waxed paper lined baking sheet and repeat until all filling has been used. ", 
            "Chill in the refrigerator if you are making them ahead of time. If you wish to freeze the dumplings for later use, make sure they are not touching, then freeze them until solid and later gather them into a freezer bag. This ensures that you will avoid having one mega-pierogi clump when you are ready to cook them.", 
            "To cook the pierogi: Bring a large pot of salted water to a boil and add the dumplings one at a time, until the surface of the pan is covered with dumplings. Do not overcrowd; you’ll have to work in batches. When they are done, about 2-3 minutes, remove with a slotted spoon. ", 
            "Transfer to bowls and serve sprinkled with green onions, parsley or chives, drizzled with a little melted butter or vinegar or topped with a deb of sour cream. ", 
            "Alternatively, you can pan-brown the pierogi. Heat some oil in a heavy frying pan and add dumplings in a single layer. When they are golden and in spots, browned, turn and brown other side. Add enough water to reach about 1/4-1/2 inch in depth. Cover and cook 3-4 minutes; remove lid and check for doneness. When pierogi are tender but not mushy to the tooth, and the liquid is evaporated, they are ready. ", 
            "Note: To make fried onions, saute 2 to 3 thinly sliced onions, in butter in a heavy frying pan until they are limp and lightly browned; add several tablespoons water and cook until the onions are soft and silky, the liquid mostly evaporated. Season with salt and pepper. "
        ], 
        "date": "2007-07-08T13:54:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound mix leftover cheese, harder cheeses grated, softer ones cut into chunks", 
            "A couple pats of butter, if using mostly firm cheese varieties", 
            "1 small clove garlic, minced, or more to taste", 
            "1/2 to 1 cup leftover white wine", 
            "1 to 2 tablespoons finely chopped fresh herbs, such as parsley, thyme, rosemary or chives", 
            "Salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/12/fromage-fort.jpg?w=751", 
        "tags": [
            "Appetizers + Party Snacks", 
            "French", 
            "Photo", 
            "Quick", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2012/12/fromage-fort/", 
        "title": "fromage fort", 
        "directions": [
            "Blend cheese, butter (if using) and garlic in food processer until combined. Drizzle in wine with the motor running until you get your desired consistency — some like it completely smooth, others prefer chunks. Add herbs, pulsing the machine until just combined. Season to taste with salt and pepper.", 
            "Fromage fort can be used right away, or kept in the fridge until needed. In the fridge, it will thicken and age a little; the flavors will mingle and deepen."
        ], 
        "date": "2012-12-28T11:32:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound mushrooms such as cremini or white, halved lengthwise if large", 
            "2 tablespoons capers, rinsed and chopped", 
            "3 large garlic cloves, minced", 
            "2 tablespoons vegetable oil", 
            "3 tablespoons unsalted butter, cut into pieces", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup chopped flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/12/garlic-butter-roasted-mushrooms.jpg?w=749", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/12/garlic-butter-roasted-mushrooms/", 
        "title": "garlic butter roasted mushrooms", 
        "directions": [
            "Preheat oven to 450°F with rack in middle. Toss mushrooms with capers, garlic, oil, 1/8 teaspoon salt and several grinds of pepper in a 1 1/2- to 2-qt shallow baking dish. Top with butter and roast, stirring occasionally, until mushrooms are tender and golden and bubbly garlic sauce forms below, 15 to 20 minutes. Stir in lemon juice and parsley. Serve immediately, with crusty bread on the side for swiping up the juices."
        ], 
        "date": "2010-12-12T14:34:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 round (about 1 pound) loaf firm sourdough bread", 
            "1/2 cup (4 ounces or 115 grams) salted or unsalted butter", 
            "1/2 teaspoon coarse or flaky salt, or 1/4 teaspoon table salt (if butter is unsalted)", 
            "4 medium cloves garlic, minced", 
            "Pinch or two of red pepper flakes or freshly ground black pepper to taste", 
            "1 cup finely grated cheese (I used a mix of 2/3 firm aged cheeses — pecorino and asiago — and 1/3 fontina for meltiness)", 
            "1 teaspoon finely minced fresh herbs (I used 1/2 each rosemary and oregano; use more to taste)", 
            "1 tablespoon extra fresh herbs (such as chives or parsley) to finish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/garlicky-party-bread-with-herbs-and-cheese1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Bread", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2014/01/garlicky-party-bread-with-cheese-and-herbs/", 
        "title": "garlicky party bread with cheese and herbs", 
        "directions": [
            "Heat oven to 350°F. Being careful not to cut through the bottom crust (i.e., leave slices attached), cut bread loaf into 1-inch slices in one direction, then perpendicular, forming porcupine-like bread fingers. Transfer to baking sheet or roasting pan. In a small saucepan or your microwave, combine butter, salt and garlic until butter is melted and sizzling. Pour over bread, making sure to separate any fingers leaning on each other to ensure the bread is evenly butter-soaked. Scatter with grated cheese, again making sure to get cheese all the way to the bottom crust too (helps finger separation, too) with a spoon. Sprinkle with first teaspoon of herbs. Cover dish with foil and bake loaf for 15 minutes, until warmed through. Remove foil and bake another 15 to 20 minutes, until edges of loaf are toasty and cheese has melted. Scatter with any additional green herbs for garnish and serve warm."
        ], 
        "date": "2014-01-30T12:12:20+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 ounce dried tomatoes (about 5, not packed in oil)", 
            "2 tablespoons olive oil", 
            "18 white mushrooms, stems pulled out and chopped fine and caps reserved", 
            "1/2 cup finely chopped shallots", 
            "2 garlic cloves, minced", 
            "1/3 cup fine dry bread crumbs", 
            "1 large egg yolk, beaten lightly", 
            "1/4 cup fresh parsley leaves, washed well, spun dry, and minced", 
            "1/2 teaspoon dried basil, crumbled", 
            "2 tablespoons freshly grated Parmesan "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/sundried-tomato-stuffed-mushrooms.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2006/11/grievances-aired-caps-stuffed/", 
        "title": "sundried tomato stuffed mushrooms", 
        "directions": [
            "Preheat oven to 400°F.", 
            "In a small bowl soak tomatoes in hot water to cover 5 minutes. Reserving 1 tablespoon soaking liquid, drain tomatoes well and chop fine.* ", 
            "Lay mushroom caps, stems removed, face down on baking sheet either lightly sprayed with cooking spray or parchment paper. Bake them approximately 10 minutes, or until their liquid puddles underneath. Remove from the oven. Carefully pour off liquid that has gathered in the bottom of the pan, and then again, carefully, turn mushroom caps over so they are ready to be filled.", 
            "In a small skillet heat oil over moderate heat until hot but not smoking and cook chopped mushrooms stems, shallots and garlic, stirring until shallots are softened. In a bowl stir together mushrooms mixture, bread crumbs, tomatoes, reserved soaking liquid, yolk, parsley, basil, and salt and pepper to taste. Mound stuffing in reserved mushroom caps and arrange caps in a lightly greased shallow baking dish, or the same parchment-lined pan you’ve roasted your mushrooms in. Sprinkle mushrooms with Parmesan and bake in middle of oven 15 minutes.", 
            "Makes 18 hors d’oeuvres.", 
            "* Can skip this step if using oil-packed tomatoes, as I did."
        ], 
        "date": "2006-11-15T18:12:05+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces arugula", 
            "8 ounces of thick-cut bacon", 
            "Handful of grape tomatoes, halved or quartered (optional)", 
            "Small amount of parmesan cheese, shaved with a vegetable peeler (optional)", 
            "Aged balsamic vinegar", 
            "Drizzle of olive oil", 
            "Sea salt", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/grilled-bacon-salad-with-arugula-and-balsamic1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Arugula", 
            "Grilling", 
            "Meat", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/07/grilled-bacon-salad-with-arugula-and-balsamic/", 
        "title": "grilled bacon salad with arugula and balsamic", 
        "directions": [
            "Arugula is grown in dark, sandy soil and almost always arrives gritty. Don’t skimp on washing it. I like to fill a large bowl or basin with very cold water and drop the arugula into it, pumping it up and down a few times with your hands to allow any dirt and grit to fall to the bottom. Pull it out of the water, being careful not to drag any grit from the bottom of the bowl with it. Spread out on towels to dry it.", 
            "Meanwhile, get you grill very hot. Lay out all of your bacon slices and grill them* until browned underneath, which will take all of two minutes. Flip them with tongs; another minute should finish them on the second side. Transfer them to a platter. Tear your arugula into bite-sized pieces over it. Scatter with tomatoes and peels of parmesan, if using. Drizzle very thinly with olive oil and sprinkle with a few, spare droplets of balsamic vinegar. Season with salt and black pepper. Serve immediately, just as some of the arugula begins to sigh over the hot bacon.", 
            "* As I’ve already received a few comments about flare-ups on the grill from bacon grease, I want to add before you start that you should definitely use your judgement here; the recipe is not the law. Ours flared a little, but not so much that it worried me. If it’s flaring too much on a high heat, lower it or move it to a cooler part of the grill. You can also close the lid for a minute, or do fewer strips at a time. You know your grill best. Be safe."
        ], 
        "date": "2013-07-11T12:03:54+00:00"
    }, 
    {
        "ingredient_list": [
            "1 12-ounce container grape or cherry tomatoes, quartered lengthwise", 
            "2 celery stalks, finely diced", 
            "1/2 cup chopped Vidalia or Maui onion", 
            "5 large green olives, pitted, thinly sliced (about 2 tablespoons)", 
            "2 tablespoons coarsely chopped fresh oregano plus sprigs for garnish (woops, we forgot this)", 
            "1 tablespoon drained capers, rinsed", 
            "1 garlic clove, minced", 
            "Pinch of dried crushed red pepper", 
            "3 tablespoons red wine vinegar", 
            "1 tablespoon extra-virgin olive oil plus additional for brushing", 
            "1 large eggplant (1 1/2 to 13/4 pounds), trimmed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/grilled-eggplant-with-caponata-salsa1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Grilling", 
            "Photo", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/08/grilled-eggplant-with-caponata-salsa/", 
        "title": "grilled eggplant with caponata salsa", 
        "directions": [
            "Mix tomatoes, celery, onion, olives, chopped oregano, capers, garlic, and crushed red pepper in medium bowl. Whisk red wine vinegar and 1 tablespoon extra-virgin olive oil in small bowl; pour over tomato mixture and toss to coat. Season caponata to taste with salt and pepper. (Caponata can be prepared 2 hours ahead. Let stand at room temperature.)", 
            "Prepare barbecue (medium-high heat). Peel eggplant lengthwise to create alternating 2-inch-wide intervals of peeled and unpeeled skin. Cut eggplant crosswise into 6 slices, each about 1 inch thick. Brush eggplant slices with oil; sprinkle with salt and pepper. Grill eggplant slices until slightly charred and very tender when pierced with knife, about 8 minutes per side.", 
            "Place one grilled eggplant slice on each of six plates. Spoon caponata over, garnish with oregano sprigs, and serve warm or at room temperature."
        ], 
        "date": "2008-08-06T16:19:04+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons minced white onion (from about 1/8 large one)", 
            "1 1/2 tablespoons minced, seeded jalapeño (from about half a medium one)", 
            "2 tablespoons cilantro leaves, minced, plus more to taste", 
            "Juice of half a lime", 
            "1/4 teaspoon coarse or kosher salt, plus more to taste", 
            "2 medium-large ripe avocados"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/guacamole.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Avocado", 
            "Photo", 
            "Snack", 
            "Tex-Mex", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/02/guacamole/", 
        "title": "guacamole", 
        "directions": [
            "\nMix the onion, jalapeño and cilantro in the bottom of a medium bowl. Add lime and salt. Cut avocado in half and remove the pit. Use a knife to score each half in a grid pattern, being careful not to cut through the skin of the avocado. Run a soup  spoon between the avocado and skin to scoop the chunks cleanly into the bowl. Turn them over a few times to coat them with the dressing. Taste mixture, adding more of other ingredients to taste. Use a fork to mash chunks to desired consistency, or not at all. Try not to eat this bowl by yourself, although it will be hard.\n"
        ], 
        "date": "2017-02-03T13:16:54+00:00"
    }, 
    {
        "ingredient_list": [
            "1 bunch green onions, thinly sliced", 
            "1 cup grated Parmesan cheese", 
            "2 tablespoons all-purpose flour", 
            "1 tablespoon chopped fresh thyme leaves", 
            "1 1/2 teaspoons salt", 
            "3/4 teaspoon ground black pepper", 
            "2 pounds Yukon Gold potatoes, peeled, cut into 1/8-inch-thick rounds", 
            "12 ounces yellow crookneck squash or regular yellow or green summer squash, cut into 1/8-inch-thick rounds", 
            "6 teaspoons olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/herbed-summer-squash-and-potato-torte.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Potatoes", 
            "Summer", 
            "Summer Squash", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/07/herbed-summer-squash-and-potato-torte/", 
        "title": "herbed summer squash and potato torte", 
        "directions": [
            "Preheat oven to 375°F. Butter two 8-inch-diameter cake pans. (Deb note: I had only a 9-inch pan around, so what you see in my pictures is slightly thinner.) Set aside 1/4 cup sliced green onions. Toss remaining green onions, cheese, flour, thyme, salt and pepper in medium bowl to blend.", 
            "Layer 1/6 of potatoes in concentric circles in bottom of 1 prepared pan, overlapping slightly. Layer 1/4 of squash in concentric circles atop potatoes. Drizzle with 1 teaspoon oil. Sprinkle with 1/6 of cheese mixture. Repeat with 1/6 of potatoes, then 1/4 of squash and 1 teaspoon oil. Sprinkle with 1/6 of cheese mixture. Top with 1/6 of potatoes. Drizzle with 1 teaspoon oil. Sprinkle with 1/6 of cheese mixture and press gently to flatten. Repeat procedure with second cake pan and remaining potatoes, squash, oil, and cheese mixture.", 
            "Cover pans with foil. Bake until potatoes are almost tender, about 40 minutes. Remove foil; bake uncovered until tortes begin to brown and potatoes are tender, about 25 minutes longer. (Can be made 6 hours ahead. Cool. Cover with foil and chill. Rewarm, covered with foil, in 350°F oven until heated through, about 30 minutes.)", 
            "Cut each torte into wedges. Sprinkle wedges with 1/4 cup green onions; serve."
        ], 
        "date": "2008-07-23T11:44:03+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small head garlic", 
            "2 tablespoons olive oil, plus an extra drizzle for the garlic", 
            "1 9″x13″ sheet frozen puffed pastry*, thawed in fridge for several hours", 
            "1/3 cup finely grated Parmesan cheese", 
            "Kosher salt and freshly ground black pepper or red pepper flakes, to taste", 
            "1 tablespoon capers, drained and rinsed, if salted (or 1 to 2 anchovies, finely chopped)", 
            "1 1/2 pounds (about 4 cups) small cherry or grape tomatoes, the sweetest you can find", 
            "2 tablespoons finely chopped flat-leaf parsley", 
            "1 tablespoons finely chopped fresh chives", 
            "1 tablespoons finely chopped fresh oregano"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/herbed-tomato-and-roasted-garlic-tart1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Photo", 
            "Summer", 
            "Tarts/Quiche", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/herbed-tomato-and-roasted-garlic-tart/", 
        "title": "herbed tomato and roasted garlic tart", 
        "directions": [
            "Roast garlic: Heat oven to 350°F. Cut head of garlic in half crosswise; drizzle cut ends with a few drops of olive oil, then wrap in tightly foil and bake, directly on oven rack, for 45 minutes, until garlic cloves are completely soft. Set aside. [Note: Heads of garlic can also be roasted whole, but I find it easier to remove the cloves without getting any stuck in the skin when it’s halved. Garlic can be roasted up to two days in advance; just keep in the fridge until needed. It will smell exactly like a toasted everything bagel.]", 
            "Prepare crust: Increase oven temperature to 375°F. 9″x13″-inch baking sheet (or quarter-sheet pan) with parchment paper. Fit pastry sheet into pan, pressing it against the bottom and sides. Trim pastry hanging over sides of pan, if there is any. Prick bottom of pastry all over with a fork. Lay parchment paper over crust and fill with pie weights, which can be storebought, or you can use dried beans, rice or even pennies. Bake until edges of tart are golden, 25 minutes. Carefully remove weights and parchment. If any parts have bubbled up, poke them with a knife point and they should deflate.", 
            "Squeeze roasted garlic cloves out into a bowl and mash with a fork until smooth. Spread over baked par-baked crust with a knife, as if you were buttering bread. Sprinkle with Parmesan, salt and pepper. Return to oven bake until tart shell is golden all over, 12 to 15 minutes. Set aside on a cooling rack.", 
            "Heat broiler. In a large bowl, mix tomatoes, capers, olive oil, salt and pepper. Transfer to a baking sheet and broil, shaking pan once or twice, until tomatoes are blistered and have begun to release their juices, 12 to 14 minutes. This may seem a pesky step but getting the juiciness out of the tomatoes will keep the tart crust from getting soggy.", 
            "Increase oven heat to 425°F. Use a slotted spoon to transfer the tomato mixture to the prepared tart shell; distribute tomatoes evenly, in one layer. Sprinkle with the three herbs. Return the tart to the oven and bake it until hot, about 15 minutes. Let cool slightly before cutting into it. ", 
            "Tart can be served hot or closer to room temperature. Store leftovers in fridge. Reheat in 325°F oven for 5 to 10 minutes.", 
            "* My favorite frozen puffed pastry is DuFour — definitely not cheap, but absolutely delicious, made only with butter, flour, salt and a little lemon juice. 1 14-ounce package unfolds to just about 9″x13″, which means I just pressed/stretched it a tiny bit with my fingertips to fit it in the pan — no rolling required (yay). You can also reuse the parchment it comes wrapped into line your crust as you par-bake it."
        ], 
        "date": "2014-09-11T11:52:57+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups all-purpose flour", 
            "1 tablespoon baking powder", 
            "1 teaspoon salt", 
            "8 tablespoons (1 stick or 4 ounces) cold butter, diced", 
            "1/2 cup heavy cream", 
            "3 eggs, divided", 
            "1/4 pound sharp Cheddar cheese, diced", 
            "2 small jalapeños pepper, minced (I wimped out and used only one only to find my scones entirely heat-free)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/jalapeno-cheddar-scones.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Cheese", 
            "Peppers", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2009/10/jalapeo-cheddar-scones/", 
        "title": "jalapeño-cheddar scones", 
        "directions": [
            "Preheat oven to 400°F. In a small skillet, melt 1/2 tablespoon of butter and sauté the jalapeños in it until soft, about two minutes. Let them cool, then place them in a small bowl with the cheddar cheese and coat them with one tablespoon of the flour. Combine the remaining flour with the baking powder and salt. Cut in the remaining butter with a pastry blender, fork or two knives, until the butter bits are pea sized.", 
            "Lightly whip two of the eggs and cream and add to the flour-butter mixture. Using a wooden spoon, fold mixture until it begins to come together. Add the cheddar-jalapeño mixture to the dough and mix until everything is incorporated.", 
            "Turn out the dough onto a well-floured surface and knead gently for less than one minute. Pat dough out to a 3/4- to 1-inch thickness and either cut into 8 triangles or the shape of your choice with a biscuit cutter. Make an egg wash by beating the remaining egg with a teaspoon of water. Brush the scones with egg wash and place on a parchment-lined (or well-oiled) baking sheet. Bake for 25 minutes or until golden brown.", 
            "Scones are always best the first day.", 
            "Want to flash-freeze yours, as I did? Brief directions, here."
        ], 
        "date": "2009-10-15T13:41:15+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1/2 small head cabbage, very thinly sliced (1 pound or 5 to 6 cups shreds) which will be easiest on a mandoline if you have one", 
            "4 medium carrots, peeled into ribbons with a vegetable peeler", 
            "5 lacinato kale leaves, ribs removed, leaves cut into thin ribbons", 
            "4 scallions, thinly sliced on an angle", 
            "1 teaspoon kosher salt", 
            "1/2 cup all-purpose flour", 
            "6 large eggs, lightly beaten", 
            "Canola, safflower or peanut oil for frying", 
            "Tangy Sauce", 
            "1/4 cup ketchup", 
            "1 1/2 tablespoons Worcestershire sauce (note: this is not vegetarian)", 
            "1/4 teaspoon dijon mustard", 
            "1 tablespoon rice cooking wine or sake", 
            "1 teaspoon soy sauce", 
            "1 tablespoon honey (use 2 if you like a sweeter sauce)", 
            "1/8 teaspoon ground ginger"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/japanese-vegetable-pancakes.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cabbage", 
            "Carrots", 
            "Japanese", 
            "Kale", 
            "Lunch", 
            "Pancakes", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/05/japanese-cabbage-and-vegetable-pancakes/", 
        "title": "japanese vegetable pancakes", 
        "directions": [
            "Make the pancakes: Toss cabbage, carrot, kale, scallions and salt together in a large bowl. Toss mixture with flour so it coats all of the vegetables. Stir in the eggs. Heat a large heavy skillet on medium-high heat. Coat the bottom with oil and heat that too. ", 
            "To make a large pancake, add 1/4 of the vegetable mixture to the skillet, pressing it out into a 1/2- to 3/4-inch pancake. Gently press the pancake down flat. Cook until the edges beging to brown, about 3 minutes. 30 seconds to 1 minute later, flip the pancake with a large spatula. (If this is terrifying, you can first slide the pancake onto a plate, and, using potholders, reverse it back into the hot skillet.) Cook on the other side until the edges brown, and then again up to a minute more (you can peek to make sure the color is right underneath).", 
            "To make small pancakes, you can use tongs but I seriously find using my fingers and grabbing little piles, letting a little batter drip back into the bowl, and depositing them in piles on the skillet easier, to form 3 to 4 pancakes. Press down gently with a spatula to they flatten slightly, but no need to spread them much. Cook for 3 minutes, or until the edges brown. Flip the pancakes and cook them again until brown underneath. ", 
            "Regardless of pancake size, you can keep them warm on a tray in the oven at 200 to 250 degrees until needed. ", 
            "If desired, make okonomiyaki sauce: Combine all sauce ingredients in a small saucepan and let simmer for 3 to 5 minutes, until smooth and thick. ", 
            "Serve pancakes with sauce and any of the other fixings listed above, from Japanese mayo to scallions and toasted sesame seeds. ", 
            "Do ahead: Extra pancakes will keep in the fridge for a couple days, or can be spread on a tray in the freezer until frozen, then combined in a freezer bag to be stored until needed. Reheat on a baking sheet in a hot oven until crisp again."
        ], 
        "date": "2013-05-15T11:01:47+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup milk", 
            "4 tablespoons unsalted butter (1/2 stick)", 
            "1/4 teaspoon salt", 
            "Dash cayenne pepper", 
            "1 cup all-purpose flour", 
            "3 large eggs", 
            "1/2 teaspoon paprika", 
            "1/2 cup grated Parmesan cheese", 
            "1 1/2 cups grated Swiss cheese (Emmenthaler or Gruyere)", 
            "Coarse salt (fleur de sel or kosher salt) to sprinkle on top ", 
            "8 ounces bacon slices", 
            "1 cup chopped onion", 
            "1 10-ounce package chopped frozen spinach, thawed, squeezed dry", 
            "4 ounces feta cheese, crumbled (about 3/4 cup)", 
            "4 ounces cream cheese, room temperature", 
            "1/4 teaspoon dried crushed red pepper", 
            "2 3/4 pounds button mushrooms (about 48; each about 1 1/2 inches in diameter), stemmed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/just-a-few-bites1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/12/just-a-few-bites/", 
        "title": "gougères + stuffed mushrooms", 
        "directions": [
            "Preheat oven to 375°F. Cook bacon in heavy large skillet until crisp, about 8 minutes. Transfer bacon to paper towels to drain. Coarsely crumble bacon. Discard all but 1/4 cup plus 2 teaspoons bacon fat (adding olive oil if necessary to equal that amount).", 
            "Heat 2 teaspoons reserved bacon fat in heavy medium skillet over medium heat. Add chopped onion and saute until tender, about 5 minutes. Transfer to medium bowl and cool; mix in bacon, spinach, feta, cream cheese, and crushed red pepper. Season filling to taste with salt and pepper.", 
            "Line 2 large rimmed baking sheets with foil. Toss mushrooms and reserved 1/4 cup bacon fat in large bowl to coat. Sprinkle mushrooms with salt and pepper. Place mushrooms, rounded side down, in single layer on prepared baking sheets. Bake mushrooms until centers fill with liquid, about 25 minutes. Turn mushrooms over. Bake mushrooms until brown and liquid evaporates, about 20 minutes longer. Turn mushrooms over again. Spoon 1 heaping teaspoon filling into each mushroom cavity. (Filled mushrooms can be prepared 1 day ahead. Cover and refrigerate.)", 
            "Preheat oven to 375°F. Bake mushrooms until heated through, about 10 minutes. Transfer mushrooms to platter and serve warm."
        ], 
        "date": "2006-12-26T13:39:32+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound medium zucchini", 
            "1 large baking potato (3/4 pound), peeled", 
            "1 small onion (4 ounces), peeled", 
            "1/2 cup matzo meal", 
            "1 large egg, lightly beaten", 
            "1 teaspoon fresh lemon juice", 
            "1 1/2 teaspoons salt", 
            "1/2 teaspoon freshly ground pepper", 
            "Vegetable oil, for frying "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/latke-minus-vodka1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Photo", 
            "Summer", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2006/12/latke-minus-vodka/", 
        "title": "zucchini latkes", 
        "directions": [
            "Halve the zucchini crosswise. Cut the zucchini flesh off the seedy center and coarsely grate it in a food processor. Or grate it on a box grater until you reach the seedy center. Discard the center. In a food processor or on a box grater, coarsely grate the potato and onion. Transfer the grated zucchini, potato and onion to a colander and squeeze dry. Let stand for 2 minutes, then squeeze again. Transfer the vegetable mixture to a large bowl. Add the matzo meal, egg, lemon juice, salt and pepper and stir to combine.", 
            "In a medium skillet, heat 2 tablespoons of vegetable oil until shimmering. Drop packed teaspoons of the zucchini mixture into the skillet and flatten them with the back of a spoon. Cook the latkes over moderately high heat until the edges are golden, about 1 1/2 minutes; flip and cook until golden on the bottom, about 1 minute. Drain on paper towels. Repeat with the remaining zucchini mixture, adding more oil to the skillet as needed.", 
            "Do ahead: The fried latkes can be kept at room temperature for up to 4 hours. Reheat them on a dark baking sheet in a 375°F oven for about 5 minutes, or until warmed through and crisp."
        ], 
        "date": "2006-12-16T11:45:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds leeks (about 3 big leeks), lengthwise and white and pale green parts sliced 1/4-inch thick (about 3 generous cups of slices)", 
            "2 tablespoons unsalted butter", 
            "1 tablespoon olive oil, plus extra for brushing toasts", 
            "Coarse salt", 
            "Freshly ground black pepper", 
            "6 medium-sized or 12 baguette-sized 1/2-inch slices of bread of your choice (I used a light sourdough)", 
            "2 ounces blue cheese, crumbled (a soft or crumbly goat cheese would also work)", 
            "Few drops of lemon juice (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/leeks-toasts-with-blue-cheese1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Leeks", 
            "Photo", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/05/leeks-toasts-with-blue-cheese/", 
        "title": "leek toasts with blue cheese", 
        "directions": [
            "Fill a large bowl with cold water. Add leeks and use your hands to pump them up and down in the water a bit, separating the rings and letting the dirt and grit fall to the bottom. Transfer to a dish or plate for a minute; no need to dry them.", 
            "Meanwhile, heat a large, heavy skillet over medium. Once hot, add butter and olive oil and once they’re fully melted and a bit sizzly, add the leek slices, still wet. Sprinkle with 1/2 teaspoon coarse salt and a few grinds of black pepper. Reduce heat to low, cover with a lid and cook leeks for 25 minutes, stirring them occasionally. Adjust seasoning to taste.", 
            "While leeks cook, brush bread slices with olive oil and sprinkle with coarse salt. Run under broiler until lightly toasted. You may either spread the cheese you’re using on now, while the toasts are hot, or sprinkle it on at the end. Divide leeks among toasts. Sprinkle with cheese, if you haven’t spread it underneath. Add a few drops of lemon juice, if desired. Eat at once or gently rewarm a bit later."
        ], 
        "date": "2011-05-11T09:43:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound thin Italian or Asian eggplants (2 to 3), cut into 1/4-inch-thick rounds", 
            "5 tablespoons extra-virgin olive oil, divided", 
            "2 tablespoons red-wine vinegar", 
            "1/4 cup chopped mint", 
            "2 tablespoons small capers, rinsed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/marinated-eggplant-with-capers-and-mint1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Eggplant", 
            "Photo", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/08/marinated-eggplant-with-capers-and-mint/", 
        "title": "marinated eggplant with capers and mint", 
        "directions": [
            "Preheat broiler. Arrange eggplant in 1 layer on a large baking sheet and brush both sides with 2 tablespoons oil (total). Broil about 4 inches from heat, turning once, until golden, 8 to 12 minutes total.", 
            "Stir together vinegar, mint, capers, 1/4 teaspoon salt, 1/2 teaspoon pepper, and remaining 3 tablespoons oil and toss with warm eggplant. Marinate at least 20 minutes.", 
            "Marinated eggplant can be made 1 day ahead and chilled. Bring to room temperature before serving."
        ], 
        "date": "2008-08-24T14:17:34+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick) unsalted butter, plus more for casserole", 
            "6 slices white bread, crusts removed, torn into 1/4- to l/2-inch pieces", 
            "5 1/2 cups milk", 
            "1/2 cup all-purpose flour", 
            "2 teaspoons coarse salt, plus more for water", 
            "1/4 teaspoon ground nutmeg", 
            "1/4 teaspoon freshly ground black pepper", 
            "1/4 teaspoon cayenne pepper", 
            "4 1/2 cups (about 18 ounces) grated sharp white cheddar cheese", 
            "2 cups (about 8 ounces) grated Gruyère or 1 1/4 cups (about 5 ounces) grated Pecorino Romano cheese", 
            "1 pound elbow macaroni"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/marthas-macaroni-cheese1.jpg?w=640", 
        "tags": [
            "Cheese", 
            "Freezer Friendly", 
            "Pasta", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/05/marthas-macaroni-and-cheese/", 
        "title": "martha’s macaroni-and-cheese", 
        "directions": [
            "1. Preheat oven to 375°F. Butter a 3-quart casserole dish; set aside. Place the bread in a medium bowl. In a small saucepan over medium heat, melt 2 tablespoons butter. Pour the melted butter into the bowl with the bread, and toss. Set the breadcrumbs aside.", 
            "2. Warm the milk in a medium saucepan over medium heat. Melt the remaining 6 tablespoons butter in a high-sided skillet over medium heat. When the butter bubbles, add the flour. Cook, stirring, 1 minute.", 
            "3. While whisking, slowly pour in the hot milk a little at a time to keep mixture smooth. Continue cooking, whisking constantly, until the mixture bubbles and becomes thick, 8 to 12 minutes.", 
            "4. Remove the pan from the heat. Stir in salt, nutmeg, black pepper, cayenne pepper, 3 cups cheddar cheese, and 1 1/2 cups Gruyère (or 1 cup Pecorino Romano); set the cheese sauce aside.", 
            "5. Cover a large pot of salted water, and bring to a boil. Cook the macaroni until the outside of pasta is cooked and the inside is underdone, 2 to 3 minutes. Transfer the macaroni to a colander, rinse under cold running water, and drain well. Stir the macaroni into the reserved cheese sauce.", 
            "6. Pour the mixture into the prepared dish. Sprinkle the remaining 1 1/2 cups cheddar cheese, 1/2 cup Gruyère (or 1/4 cup Pecorino Romano), and the breadcrumbs over the top. Bake until golden brown, about 30 minutes (though we needed a bit more time to get it brown, but your oven may vary). Transfer the dish to a wire rack for 5 minutes; serve."
        ], 
        "date": "2008-05-07T11:15:54+00:00"
    }, 
    {
        "ingredient_list": [
            "3 1/2 to 4 1/2 pounds chicken necks, backs and wings", 
            "3 celery ribs, cut into big chunks", 
            "3 carrots, scrubbed and cut into big chunks", 
            "2 parsnips, scrubbed and cut into big chunks", 
            "2 onions, unpeeled and quartered", 
            "1 head garlic, cut horizontally in half", 
            "1 Turkish or 1/2 California bay leaf", 
            "1 tablespoon black peppercorns", 
            "1 tablespoon Kosher salt", 
            "4 quarts cold water", 
            "–and/or–", 
            "Any vegetables you have stashed in your Stock Bag (described above) ", 
            "Matzo Balls", 
            "1/2 cup matzo meal", 
            "2 eggs, lightly beaten", 
            "2 tablespoons reserved chicken fat or vegetable oil", 
            "1 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "2 tablespoons chicken stock or seltzer (which both of our mothers swear by for making the balls extra light)", 
            "For soup", 
            "2 to 3 quarts prepared chicken stock (recipe above)", 
            "1 carrot, thinly sliced", 
            "A few sprigs of dill"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/matzo-ball-soup.jpg?w=750", 
        "tags": [
            "Dumplings", 
            "Jewish", 
            "Passover", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/02/matzo-ball-soup/", 
        "title": "matzo ball soup", 
        "directions": [
            "Mix all matzo ball ingredients in a bowl. Cover and place in the refrigerator for 30 minutes. ", 
            "Bring 1 1/2 quarts of well-salted water to a brisk boil in a medium sized pot.", 
            "Reduce the flame. Run your hands under water so they are thoroughly wet. Form matzo balls by dropping spoonfuls of matzo ball batter approximately 1-inch in diameter into the palm of your wet hands and rolling them loosely into balls. Drop them into the simmering salt water one at a time. Cover the pot and cook them for 30 to 40 minutes.", 
            "About ten minutes before the matzo balls are ready, bring prepared chicken stock to a simmer with the sliced carrot in it. Ladle some soup and a couple matzo balls into each bowl and top with a couple snips of dill. Eat immediately. "
        ], 
        "date": "2008-02-04T16:08:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup cherry tomatoes, halved", 
            "1/3 cup chopped, pitted Kalmata olives", 
            "1 clove garlic, minced", 
            "1/4 cup thinly sliced red onion (oops, I forgot this)", 
            "2 tablespoons finely-chopped fresh flat-leaf parsley, divided", 
            "1 teaspoon dried oregano", 
            "1 teaspoon olive oil", 
            "Freshly ground black pepper", 
            "1 8- to 10-ounce block feta", 
            "Crackers, flatbread*, pita chips, or crostini, for dipping "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/08/mediterranean-baked-feta-with-tomatoes.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/08/mediterranean-baked-feta-with-tomatoes/", 
        "title": "mediterranean baked feta with tomatoes", 
        "directions": [
            "In a bowl, mix the tomatoes, olives, onion, garlic, 1 tablespoon of the parsley, oregano, olive oil and a few grinds of pepper. ", 
            "On a grill: Heat your grill to medium-high. Set the feta block in the middle of a piece of foil. Pile the tomato mixture on top of the feta. Fold up the edges of the foil so that it will hold in any liquid as it cooks. Place the packet straight on a grill for 15 minutes to warm it through. Remove from grill and transfer to plate or serving dish.", 
            "In the oven: Heat oven to 400°F. Check to see that your dish is oven-proof. (I didn’t!) Place the block of feta in the middle of your dish. Pile the tomato mixture on top of the feta. Bake for 15 minutes. ", 
            "Both methods: The feta will not melt, just warm and soften. Garnish with parsley and serve with crackers; eat immediately. As it cools, the feta will firm up again. We found that the dish could be returned to the oven to soften it again. We did this with leftovers, too.", 
            "* I made these. These days, I’ve been running a pizza wheel over the rolled-out pieces to pre-cut it into rough rectangles before baking it, like so."
        ], 
        "date": "2012-08-24T15:33:36+00:00"
    }, 
    {
        "ingredient_list": [
            "12 to 18 sheets phyllo pastry (12 to make four large strudel, 18 to make smaller triangles)", 
            "1/4 to 1/2 cup butter, melted (1/4 cup to make large strudel, 1/2 cup to make smaller triangles; alternately, you could use olive oil for a different flavor profile)", 
            "1 egg, beaten (for large strudel; I did not see the need to seal the small ones)", 
            "1 pound mixed, fresh, wild and cultivated mushrooms (we used only creminis, and ended up with plenty of flavor. If you omit the stems, start with 1.5 pounds)", 
            "1 medium onion, minced", 
            "3 tablespoons butter", 
            "Freshly grated nutmeg (optional, we skipped it)", 
            "1 tablespoon dry sherry", 
            "1 tablespoon all-purpose flour", 
            "Leaves from 1 sprig marjoram or thyme", 
            "4 to 6 tablespoons freshly grated Parmesan, plus extra for sprinkling, if you wish (the latter amount for the minis)", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-streudels1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/05/mushroom-streudels/", 
        "title": "mushroom strudel", 
        "directions": [
            "Preheat the oven to 400°F (200°C). Line a baking sheet with parchment paper. Clear a large work surface for this, big enough for two full sheets of phllyo, your egg wash, parmesan and filling–trust me, you’ll need it.", 
            "Make the filling: Make sure the mushrooms are dust- and sand-free, wash if necessary, and trim if need be. Cook the onion in the butter and, when soft, add the mushrooms with the nutmeg. Saute for 5 to 7 minutes, until liquid has been released and has partially evaporated. Add the sherry and evaporate the alcohol by cooking over low heat for 2 to 3 minutes. Stir in the flour, herbs, and some salt and pepper, and let cool. The mixture will be moist.", 
            "To make small, triangular strudel: Take one sheet of phyllo at a time from their package; cover the remaining sheets with plastic and then a damp towel, ensuring they are completely covered. Brush one half of the sheet lengthwise with butter. Fold the unbuttered side over the buttered side, carefully, smoothing out any wrinkles and bubbles but not worrying if you can’t get them all. Again, brush one half of this lengthwise (a few inch-wide column) with butter, and fold the unbuttered side over it again. You’ll end up with one long column.", 
            "Dollop a spoonful of the mushroom filling near the end and sprinkle a teaspoon of parmesan over it. Begin folding one bottom corner of the phyllo strip over the filling until it meets the opposite edge, forming a triangle, as if you were folding a flag. Place the triangle seam side down on the baking sheet, brush lightly with egg wash and sprinkle with parmesan.", 
            "Bake in the preheated oven for 15 minutes. Serve warm.", 
            "To make four larger strudel: Take 3 sheets of phyllo at a time from their package; cover the remaining sheets with plastic and then a damp towel, ensuring they are completely covered. Brush 1 sheet on both sides with melted butter, then place it on top of another sheet, and cover with a third. Repeat 3 times, to make 4 stacks of triple-layer phyllo.", 
            "Lay one of the 4 stacks of phyllo on the parchment-lined baking sheet. Brush the edges with beaten egg. Put one-fourth of the mushroom mixture on the center of the phyllo and add 1 tablespoon Parmesan. Fold in the sides, then fold over and over into a neat parcel. Brush with beaten egg, turn over very carefully so that the seam is on the bottom, and brush with egg again. Repeat to make 3 more strudels.", 
            "Bake in the preheated oven for 15 minutes. Serve warm."
        ], 
        "date": "2008-05-19T11:27:37+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons (30 grams) unsalted butter", 
            "2 tablespoons (15 grams) all-purpose flour", 
            "3/4 cup (175 ml) milk, ideally whole but lowfat should work", 
            "A few gratings fresh nutmeg", 
            "Salt and black pepper to taste", 
            "1 tablespoon (15 grams) smooth Dijon mustard", 
            "1 1/2 pounds (680 grams) fresh mushrooms (cremini, white or a mix of wild all work), thinly sliced", 
            "Olive oil and butter as needed", 
            "2 teaspoons minced mixed fresh herbs such as rosemary, thyme and sage", 
            "Salt and black pepper to taste", 
            "1 pound loaf of a hearty white or whole wheat sourdough bread, in 3/4-inch slices", 
            "8 ounces (225 grams) coarsely grated gruyere or comte", 
            "Chopped fresh flat-leaf parsley, to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/mushroom-tartines.jpg?w=750", 
        "tags": [
            "Cheese", 
            "Mushrooms", 
            "Photo", 
            "Put An Egg On It", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/03/mushroom-tartines/", 
        "title": "mushroom tartines", 
        "directions": [
            "Make the sauce: In a large skillet (so you can use it again for the mushrooms), melt butter over medium heat and then stir in flour until a paste forms. Very slowly drizzle in milk, whisking the whole time to keep the mixture smooth. Add nutmeg, salt and pepper and cook, stirring, until mixture has simmered for a couple minutes. It will be thick and get thicker as it cools; this makes for a better spread. Scrape into a bowl and stir in Dijon. Adjust seasonings if needed. Set aside.\nHeat oven: To 425 degrees F. Line your largest baking sheet with foil.\n\nCook the mushrooms: Wipe out skillet and heat over medium-high. Add a glug of olive oil or a mix of olive oil and butter. Once it is very hot, add 1/3 to 1/2 of mushrooms, 1/3 to 1/2 of herbs and let sear in pan until brown underneath, about 2 to 3 minutes, before stirring and continuing to cook until tender and any liquid in the pan has cooked off, about 5 minutes. Season well with salt and pepper. Repeat with remaining mushrooms.", 
            "Assemble and bake: Spread bread in one layer on prepared baking sheet. Schmear each all the way to the edges with sauce; you should have exactly enough for a thin coat on each. Heap each slice with mushrooms; use them all. Sprinkle cheese over and since the mushrooms are heaped so high, you’ll probably have to press it in a bit with your hand. You’ll be glad you got all the cheese on there.", 
            "Bake for 10 minutes, until cheese is melted all over, then transfer to the broiler and cook until tops are browned, a few minutes more (but keep an eye on it because broilers vary wildly and mine is rather weak).", 
            "To serve: Scatter with parsley and eat with a knife and fork, preferably with a big green salad on the side."
        ], 
        "date": "2017-03-29T12:21:56+00:00"
    }, 
    {
        "ingredient_list": [
            "Oregano dressing", 
            "4 cloves garlic", 
            "1 to 2 tablespoons dried oregano (Nancy recommends 2; I got nervous and used 1, but might not have minded more)", 
            "2 teaspoons kosher salt", 
            "Freshly ground black pepper", 
            "2 tablespoons lemon juice, or juice of 1 lemon", 
            "1/4 cup red wine vinegar", 
            "1/4 cup olive oil, ideally extra-virgin", 
            "Salad and assembly", 
            "1 (15-ounce) can chickpeas or 1 3/4 cups cooked chickpeas, drained", 
            "1 small red onion, peeled and sliced into paper-thin rings", 
            "1/2 pound provolone (see Note about varieties), sliced 1/8-inch thick then cut into 1/4-inch ribbons", 
            "1/2 pound salami, peeled, sliced 1/8-inch thick then cut into 1/4-inch ribbons", 
            "4 medium or 8 small pickled pepperoncini, sliced into rings", 
            "3/4 pound cherry tomatoes", 
            "Sea salt", 
            "1 head iceberg lettuce (see Note about size), halved, cored, and cut in 1/2-inch ribbons", 
            "1 head radicchio, halved, cored and cut in 1/4-inch ribbons", 
            "2 tablespoons dried oregano for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/nancys-chopped-salad1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Gluten-Free", 
            "Italian", 
            "Lunch", 
            "Photo", 
            "Radicchio", 
            "Salad", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/06/nancys-chopped-salad/", 
        "title": "nancy’s chopped salad", 
        "directions": [
            "Make dressing: Roughly chop the garlic and then add the oregano, salt and up to 1/2 teaspoon ground pepper. Chop the mixture together and use the side of a knife or a mortar and pestle to make a grainy herb paste. Transfer the paste to a large salad bowl, and add the lemon juice and vinegar. Mix with a fork allowing the salt to dissolve, then add the oil and whisk with a fork until well combined. The dressing should be thick with garlic and oregano. If you’re using a small head of iceberg, transfer 1/3 the dressing into a small bowl to be used only if needed. For a larger head of iceberg, you’ll want it all.", 
            "Assemble salad: Gently fold the chickpeas, red onion, provolone, salami, pepperoncini (including seeds and juice) into the dressing, one at a time. Halve the tomatoes lengthwise and season with 1 1/2 teaspoons sea salt. Set aside until ready to serve.", 
            "To serve: When ready to serve, gently add the tomatoes, lettuce and radicchio to the salad bowl, along with a couple of generous pinches of oregano, and toss to combine with the dressing. Adjust seasonings to taste, adding any reserved dressing if needed. Serve immediately.", 
            "Sicilian Oregano Sources: It’s definitely available online here and here. If you’re in NYC, I bought the jar you see here at Brooklyn Larder a year or two ago for about $7. However, I was over at Buon Italia in Chelsea Market today (6/5) and they sell, well, almost a tree of the stuff, easily 10 times what was in that jar, for all of $4.50. Buy it and share it with all of your friends! "
        ], 
        "date": "2014-06-02T12:24:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound firm tofu", 
            "1/2 cup coarsely grated carrots", 
            "1/2 cup shredded Napa cabbage", 
            "2 tablespoons finely chopped red pepper", 
            "2 tablespoons finely chopped scallions", 
            "2 teaspoons finely minced fresh ginger", 
            "1 tablespoon chopped cilantro leaves", 
            "2 minced cloves garlic (Deb addition)", 
            "1 tablespoon soy sauce", 
            "1 tablespoon hoisin sauce", 
            "2 teaspoons toasted sesame oil (I replace 1 teaspoon with hot sesame oil — delicious)", 
            "1 egg, lightly beaten", 
            "1 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "35 to 40 small wonton wrappers", 
            "1/3 cup chicken stock or water", 
            "1/4 cup soy sauce", 
            "1 tablespoon rice vinegar", 
            "1 tablespoon dark sesame oil or 1/2 tablespoon dark, 1/2 tablespoon hot sesame oil", 
            "1 small clove garlic, minced (optional)", 
            "1 (1/2-inch-thick) slice peeled fresh ginger", 
            "1/4 cup Asian sesame paste or smooth peanut butter", 
            "3 tablespoons Asian sesame oil", 
            "1/4 cup rice vinegar (not seasoned)", 
            "1 1/2 tablespoons sugar", 
            "2 tablespoons water", 
            "1 teaspoon Asian chile paste with garlic*", 
            "1/2 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/on-obsessiveness-and-ollies1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Chinese", 
            "Dumplings", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2007/02/on-obsessiveness-and-ollies/", 
        "title": "vegetable dumplings", 
        "directions": [
            "Blend all dressing ingredients in a blender until smooth. Dressing keeps, covered tightly and chilled, 1 week. "
        ], 
        "date": "2007-02-19T21:04:34+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 teaspoons active dry yeast (a 1/4-ounce package)", 
            "1/2 cup warm water (105 to 115°F)", 
            "1 1/2 to 1 3/4 cups all-purpose flour", 
            "1 large egg", 
            "1/3 cup plus 1 tablespoon extra-virgin olive oil, divided", 
            "2 1/2 teaspoons salt, divided", 
            "2 teaspoons fennel seeds", 
            "3 pound yellow onions, halved and thinly sliced", 
            "1 tablespoon Dijon mustard (I use a bit more)", 
            "1/2 cup grated Parmigiano-Reggiano (I like it coarsely grated for this)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/onion-tart-with-mustard-and-fennel1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Onions", 
            "Photo", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2008/11/onion-tart-with-mustard-and-fennel/", 
        "title": "onion tart with mustard and fennel", 
        "directions": [
            "Stir together yeast and warm water in a small bowl and let stand until foamy, about 5 minutes. (If mixture doesn’t foam, start over with new yeast.)", 
            "Put 1 1/2 cups flour in a medium bowl, then make a well in center of flour and add yeast mixture to well. Stir together egg, 1 tablespoon oil, and 1 1/2 teaspoons salt with a fork. Add egg mixture to yeast mixture and mix with a wooden spoon or your fingertips, gradually incorporating flour, until a soft dough forms. Transfer dough to a floured surface and knead, working in additional flour (up to 1/4 cup) as necessary, until smooth and elastic, about 5 minutes. Transfer dough to an oiled bowl and turn to coat. Cover with plastic wrap and let rise in a draft-free place at warm room temperature until doubled, 1 to 1 1/2 hours.", 
            "While dough rises, heat remaining 1/3 cup oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then sauté fennel seeds until a shade darker, about 30 seconds. Stir in onions, remaining teaspoon salt, and 1/2 teaspoon pepper, then reduce heat to medium-low and cover onions directly with a round of parchment paper. Cook, stirring occasionally, until onions are very tender and golden brown, 1 to 1 1/4 hours.", 
            "[Do ahead: I made the dough several hours in advance and let it rise in the fridge, and the onions too, which I let sit covered at room temperture until I was ready to assemble and bake the tart.]", 
            "Preheat oven to 375°F with rack in middle.", 
            "Knead dough gently on a floured surface with floured hands to deflate. Pat out dough on a large heavy baking sheet (preferably blue steel) into a 15- by 12-inch rectangle, turning up or crimping edge, then brush mustard evenly over dough, leaving a 1/2-inch border around edge. Spread onions evenly over mustard, then sprinkle evenly with cheese.", 
            "Bake tart until crust is golden brown, 30 to 35 minutes. Cut into 2-inch squares or diamonds and serve warm or at room temperature."
        ], 
        "date": "2008-11-06T16:59:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1 28-ounce can whole tomatoes", 
            "1 (3 to 3 1/2 pound) boneless beef chuck roast, tied with a string", 
            "1 head garlic, separated into cloves, left unpeeled"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic1.jpg?w=750", 
        "tags": [
            "Beef", 
            "Budget", 
            "Date Night", 
            "Gluten-Free", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic/", 
        "title": "oven-braised beef with tomatoes and garlic", 
        "directions": [
            "Heat oven to 300°F (150°C). Coarsely chop tomatoes with their juice in a food processor (Gourmet’s suggestion) or go at them in their can with kitchen shears (my lazy preference) to break them up. Put roast in an ovenproof 4- to 5-quart heavy pot or a casserole dish with a lid — a tight fit is just fine, as it will shrink very soon. Pour tomatoes over roast and scatter garlic around it. Season generously with salt and pepper. Braise in middle of oven, covered, until very tender, 3 to 4 hours. Cut roast into 1/4-inch-thick slices and serve with sauce, garlic, squeezed from its peels (or you can leave others to do this) and orzo (Gourmet’s suggestion, of course not gluten-free), mashed potatoes (recipe at the end) or crusty bread. Leftovers shredded over egg noodles sound wonderful as well.", 
            "Do ahead: Like almost all braises, this is even better on the second day, which means it’s a dream of a dinner party dish. Let it cool to room temperature, then chill it in the fridge until needed. Defat the sauce before warming (it will be a cinch once solidified on top) and rewarm at 300 for 30 to 45 minutes. ", 
            "Notes:"
        ], 
        "date": "2015-02-09T11:59:10+00:00"
    }, 
    {
        "ingredient_list": [
            "Broth", 
            "8 ounces cheese rinds, any paper at the ends removed", 
            "6 cups water", 
            "1 large onion, peeled and quartered", 
            "3 cloves garlic, peeled and smashed", 
            "1/2 teaspoon whole peppercorns", 
            "Handful of flat-leaf parsley", 
            "Salt, to taste", 
            "To serve", 
            "2 to 3 ounces tuscan kale (also known as black or lacinato kale; this is the thinner, flatter leaf variety), washed and patted dry (updated measurement)", 
            "1 1/4 cups cooked white beans (from about 1/4 pound dried), with their cooking liquid if fresh (usually about 1 1/2 cups) (updated measurement)", 
            "Thin slices of baguette, toasted", 
            "Olive oil and parmesan for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/parmesan-broth-with-kale-and-white-beans1.jpg?w=500", 
        "tags": [
            "Announcements", 
            "Appetizers + Party Snacks", 
            "Beans", 
            "Italian", 
            "Kale", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2014/01/parmesan-broth-with-kale-and-white-beans/", 
        "title": "parmesan broth with kale and white beans", 
        "directions": [
            "Beans: I used cannelini beans for this the first time, but I spied some of Rancho Gordo’s Yellow-Eye beans in my cabinet (which are a great swap for white beans, wherever you use them) and had to use them instead, as it was just a day or two after New Years and I hadn’t gotten my black-eyed pea fix. The only downside of using a non-white bean such as this is that if you want to add the bean broth to your soup, it will change the color to something even less pretty.", 
            "How to cook dried beans: I promise, a separate post is coming on this. In the meanwhile, if you have time to soak your beans (cover them with way more water in a bigger bowl than you think you’ll need and leave them to soak for 8 hours or up to 24), do it, I find that it cuts stovetop time in half, or at least down by 1 hour. I dump it, soaking liquid and all, into a heavy pot, add more water (plus any aromatics you’d want, herbs, bay leaves, spice, onions, or garlic, but hold off on the salt for now) and bring the pot to a full boil. Boil it for one full minute, skimming any foam or, ahem, “scum” that floats, then reduce the heat to the lowest simmer possible, checking it from time to time and adding more liquid if needed. Your beans, depending on variety/age/if you soaked them, will take 1 to 3 hours to cook from here. My soaked-overnight white beans took just 1 hour. Once they are mostly softened, you can add salt to taste. Store them in their cooking liquid, which you should seriously consider adding to any/all soups as extra broth. Don’t dump all the flavor down the drain. I’ve also cooked beans many times, usually without bothering to soak, in a slow-cooker, for anywhere from 2 1/2 to 5 hours on HIGH (or longer on LOW). Yes, it takes longer, but the beauty of the slow-cooker is that it’s hands-off, while a stovetop needs to be somewhat monitored.", 
            "Not technically vegetarian: Strict vegetarians do not eat Parmesan as calf rennet is used in production. (More here.)"
        ], 
        "date": "2014-01-06T12:15:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour, more as needed", 
            "1/2 teaspoon salt", 
            "1/2 cup finely grated fresh Parmesan cheese (alternate: I think Romano could also work well here)", 
            "4 tablespoons unsalted butter", 
            "1/4 cup cream or half-and-half, more as needed", 
            "Coarse salt, pepper, sesame or poppy seeds or whatever you like for sprinkling (optional)."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/parmesan-cream-crackers1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cheese", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/12/parmesan-cream-crackers/", 
        "title": "parmesan cream crackers", 
        "directions": [
            "Heat oven to 400°F. Line a baking sheet with parchment paper or lightly dust with flour. Put flour, salt, cheese and butter in bowl of a food processor. Pulse until flour and butter are combined. Add about 1/4 cup cream or half-and-half and let machine run for a bit until a dough forms. If it does not come together, add more liquid a teaspoon at a time, until mixture holds together but is not sticky. (I only needed the ingredient levels as listed to pull the dough together.)", 
            "Roll out dough on a lightly floured surface until 1/4-inch thick or even thinner, adding flour as needed. From here, you can either form them into individual crackers (I went for 1 1/2-inch squares cut with a fluted pastry wheel) and bake them an inch apart on your baking sheet (the method I used) or transfer the entire rolled-out sheet to your baking sheet (draping it over the rolling pin will make it easier) and score them lightly with a knife, pizza or pastry wheel to break into crackers after they are baked. For either method, dock all over with a fork and sprinkle with salt or any other toppings you are using.", 
            "Bake until moderately browned, about 12 minutes. Cool on a rack; serve warm or at room temperature or store in a tin for a few days.", 
            "Note: Mine were the most crisp before they’d been kept in a container. If you’re baking them less than a day in advance, I think they can be left uncovered to maintain their best texture."
        ], 
        "date": "2009-12-27T23:05:19+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups all-purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "3/4 teaspoon baking soda", 
            "1/2 teaspoon fine sea salt", 
            "6 tablespoons cold unsalted butter, diced", 
            "1 1/4 cups (2 7/8 ounces) finely grated aged pecorino or parmesan cheese", 
            "2 slim scallions, minced (optional)", 
            "2 tablespoons flat-leaf parsley, chopped small plus 16 extra leaves for garnish", 
            "1 cup well-shaken buttermilk", 
            "1 large egg, lightly beaten with 1 teaspoon water for wash"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/parsley-pecorino-biscuits1.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Breakfast", 
            "Brunch", 
            "Herbs", 
            "Photo", 
            "Put An Egg On It", 
            "Scones/Biscuits", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2015/11/parsley-pecorino-biscuits/", 
        "title": "parsley pecorino biscuits", 
        "directions": [
            "Heat oven to 425 degrees F. Stir together flour, baking powder, baking soda, and salt in the bottom of a large bowl, then use your fingertips or a pastry blender to work the butter into the dry mixture, until the largest chunks are the size of tiny peas. Stir in cheese, scallions and chopped parsley, then buttermilk, stirring just until combined. Knead once or twice right inside the bowl to form into a rough dough.", 
            "Pat or roll it out to a 1/2-inch thickness on a floured counter. Cut into 2-inch rounds, pressing straight down and not twisting the cutter. Place on an parchment-lined baking sheet. Brush the tops of each with egg wash, then place one leaf at the center of each biscuit top. Use brush to dab leaf with egg wash.", 
            "Bake biscuits for 11 to 13 minutes, until golden brown. Eat right away, or at least before the day is out. ", 
            "Because biscuits are best on the first day, if planning ahead, I like to make the dough, cut in into rounds and freeze it until needed. Biscuits can be baked right from the freezer and will only require about 2 minutes extra. Brush egg wash and leaf on right before baking. "
        ], 
        "date": "2015-11-24T12:08:24+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1/2 pound (about 1 large) Russet potato", 
            "1 tablespoon fresh lemon juice", 
            "1 pound parsnips (about 2 large or 4 medium)", 
            "1/4 cup all-purpose flour", 
            "1 teaspoon baking powder", 
            "2 large eggs, lightly beaten", 
            "2 tablespoons chopped fresh dill", 
            "1 teaspoon table salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "Olive oil (or a mix of olive and vegetable or peanut oil) for frying", 
            "Sauce", 
            "1 cup sour cream", 
            "1 tablespoon lemon juice", 
            "1/2 teaspoon table salt", 
            "1 tablespoon freshly grated or prepared horseradish", 
            "1 tablespoon chopped dill"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/parsnip-latkes-with-horseradish-and-dill.jpg?w=749", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Parsnips", 
            "Photo", 
            "Potatoes", 
            "Snack", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/12/parsnip-latkes-with-horseradish-and-dill/", 
        "title": "parsnip latkes with horseradish and dill", 
        "directions": [
            "Preheat: Oven to 250 degrees. Line one large or two smaller baking sheets with foil and leave them in the oven until needed.", 
            "Prepare vegetables: Peel vegetables and grate them on the large holes of a box grater or (my preferred method) using the shredding blade of a food processor. If using the food processor, I like to lay the vegetables sideways in the chute, in an attempt to get the longest strands of vegetables. This creates latkes that look like little piles of mops, which is my goal.", 
            "Transfer shredded vegetables to a lint-free dishtowel or square of cheesecloth, and wring out as much liquid as possible. Let stand for two minutes, then wring again. Wetness is the enemy of crisp, light latkes, so we want to get rid of as much as possible.", 
            "Make batter: Transfer wrung-out vegetables to a large bowl. Add lemon juice. In a tiny dish, stir together the flour, baking powder, salt, pepper and any herbs or additional seasonings and toss with vegetables, evenly coating the strands. In the same tiny dish, whisk your egg(s) and then stir this into the vegetable-flour mixture, evenly coating the strands.", 
            "Prepare pan: Heat a large, heavy skillet, preferably cast iron, over medium heat. Once skillet is hot, add 3 tablespoons oil and heat oil until shimmering. If you’re unsure, you can flick a droplet of water onto the oil; if it hisses and sputters, you’re good to go.", 
            "Cook: Using a fork or your fingertips (letting the eggy batter drain off a little is good), gather spoonful-sized mounds of battered vegetables and drop them onto the heated skillet. When golden underneath, 3 to 4 minutes later, flip pancakes. [If you’re using a gas range, you’ll likely have to rotate your pancakes 180 degrees halfway through the cooking time so that they color evenly underneath.] Cook on the other side until nicely bronzed underneath, another 2 to 3 minutes, and transfer to paper towels briefly to drain pancakes, before transferring them again to tray(s) in warm oven. If latkes cook too quickly or slowly on the stove, adjust the heat accordingly.", 
            "Add more oil if needed (you want to keep the pan at that 3 tablespoon level), being sure it is heated before adding more pancakes to the skillet. Repeat with remaining batter.  I like to keep the latkes in the oven for at least 10 minutes to ensure they’ve cooked through before serving them. This gives you time to…", 
            "Make sauce: Mix sauce ingredients in a small dish. Adjust seasonings to taste.", 
            "Serve: Warm with a dollop of the sauce."
        ], 
        "date": "2011-12-22T13:13:41+00:00"
    }, 
    {
        "ingredient_list": [
            "Brine", 
            "1 1/2 cups white vinegar", 
            "1 1/2 cups water", 
            "1/3 cup granulated sugar", 
            "1/2 teaspoon celery seed", 
            "1 tablespoon plus 2 teaspoons kosher salt* plus more to taste  ", 
            "Salad", 
            "1 small head (2 pounds) green cabbage", 
            "1 red bell pepper", 
            "1 carrot (I used only 1/2 my very thick one)", 
            "1 kirby cucumber"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/pickled-cabbage-salad1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cabbage", 
            "Gluten-Free", 
            "Photo", 
            "Pickled", 
            "Salad", 
            "Side Dish", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/11/pickled-cabbage-salad/", 
        "title": "pickled cabbage salad", 
        "directions": [
            "Mix brine ingredients in the bottom of a medium bowl and set aside. ", 
            "Prepare your vegetables: Trim and core cabbage and slice thinly with a knife, food processor slicing blade or adjustable-blade slicer. Place in a large bowl. Core, seed and thinly slice red pepper; peel and thinly slice or julienne carrot; thinly slice cucumber (I quartered mine first). Add vegetables to cabbage bowl.", 
            "By the time you’re done preparing your vegetables, the sugar and salt should in the pickling mixture should have dissolved. If not, whisk a few times until they do. Taste and adjust if you’d like it a little saltier — I added 1 more teaspoon of kosher salt in the end. ", 
            "Pour pickling brine over vegetables and cover bowl with a lid or plastic wrap. Refrigerate for 1 hour or up to 1 week. Salad becomes more pickled as it rests. Eat with everything. ", 
            "* Not all salts are weighted equally: Read more here. I used Morton brand, which for 1 tablespoon plus 2 teaspoons clocks in at 24 grams. If using table or fine sea salt, use only 4 teaspoons. "
        ], 
        "date": "2014-11-10T11:46:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound carrots, cut into 3 1/2- by 1/3-inch sticks", 
            "1 1/4 cups water", 
            "1 cup cider or plain vinegar (the former makes a sweeter, milder brine)", 
            "1/4 cup sugar", 
            "2 garlic cloves, lightly crushed", 
            "1 1/2 tablespoons dill seeds*", 
            "1 1/2 tablespoons salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pickled-carrot-sticks1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Carrots", 
            "Photo", 
            "Pickled", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/01/pickled-carrot-sticks/", 
        "title": "pickled carrot sticks", 
        "directions": [
            "Place carrots in a heatproof bowl. Bring remaining ingredients to a boil in saucepan, then reduce heat and simmer 2 minutes. Pour pickling liquid over carrots and cool, uncovered. Chill carrots, covered, at least 1 day for flavors to develop.", 
            "Carrots keep, chilled in an airtight container, 1 month.", 
            "* From my own experience, and from comments I have received, I’ve learned that dill seeds aren’t always the easiest thing to find. Mine are from McCormick, but they were also the only bottle I could find in the two different stores I went to. If you can’t find them, use fresh or dried dill instead. You can put the dried dill in with the brine as you boil it. If fresh dill, I would drop it in the container your are storing the carrots in, just before you put them in the fridge."
        ], 
        "date": "2008-01-11T15:29:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound red or black grapes, preferably seedless", 
            "1 cup white wine vinegar", 
            "1 cup granulated sugar", 
            "1 1/2 teaspoons brown mustard seeds (hm, mine might have been yellow? I was unconcerned.)", 
            "1 teaspoon whole black peppercorns", 
            "1 (2 1/2-inch) cinnamon stick, cut in half (if using two jars, otherwise leave whole)", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/04/3447237193_064b81a107_b.jpg?w=753", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Fruit", 
            "Grapes", 
            "Photo", 
            "Pickled", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/04/pickled-grapes-with-cinnamon-and-black-pepper/", 
        "title": "pickled grapes with cinnamon and black pepper", 
        "directions": [
            "Rinse and dry the grapes, and pull them carefully from their stems. Using a small sharp knife, trim away the “belly button” at the stem end of the grape (and try not to eat all of the belly buttons at once, m’kay?), exposing a bit of the flesh inside. Divide the grapes among 2 pint-sized clean, dry canning jars.", 
            "In a medium saucepan, combine the remaining ingredients. Bring to a boil over medium heat and then you have two choices. The original recipe has you pour the bring mixture over the grapes and let them cool together. I personally prefer a cold brine on certain foods, not wanting to wilt the fresh fruit, so I cool the brine completely before pouring it over. The former will yield a more tender pickle, and it will pick up the brine’s flavor faster. The latter will take a bit longer to souse, but the grapes will stay more firm. Both will be delicious.", 
            "Once cool, chill the grape and brine mixture in their jars in the refrigerator for at least eight hours or overnight. Serve cold, perhaps at a cheese course, and I say you should let people figure out for themselves what they’re eating."
        ], 
        "date": "2009-04-17T10:35:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds (680 grams) baby potatoes (I used a mix of red and yellow)", 
            "2 heaped cups (8 ounces or 225 grams) coarsely grated sharp cheddar cheese, ideally a mix of yellow and white", 
            "1/2 cup (2.75 ounces) finely chopped drained pimentos or roasted red peppers (from 1 4-ounce jar of pimentos)", 
            "1/4 cup (50 grams) mayonnaise", 
            "1 to 2 scallions, finely minced", 
            "1/4 teaspoon celery salt", 
            "Cayenne or hot sauce, to taste", 
            "Salt and freshly ground pepper", 
            "Smoked hot or sweet paprika, more cayenne, chipotle powder and/or minced chives to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/12/pimento-cheese-potato-bites.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/12/pimento-cheese-potato-bites/", 
        "title": "pimento cheese potato bites", 
        "directions": [
            "Put potatoes in a large pot, cover them with two inches of water, set them over high heat and set your time — as soon as you turn on the flame — for 25 minutes and bring to a boil. When the timer rings, the potatoes are either done or need up to 5 minutes more. If a skewer goes in them easily, they’re done. Drain and let cool until you can pick them up. Or, you can chill them for up to 2 days, until needed.\nMeanwhile, make the pimento cheese by mixing the cheddar(s), pimentos, mayo, scallions, celery salt and cayenne or hot sauce together until evenly combined. Season to taste with salt and freshly ground black pepper. Either use this right away or keep it chilled for a week, until needed.\nCover a large baking sheet with foil and lightly coat foil with nonstick spray. Heat oven to 425 degrees.\nWhen potatoes are cool enough to handle, halve lengthwise and scoop out all but the last 1/4-inch thickness of skin and potato (essentially, you want to leave a shell inside for stability). A melon baller makes easy work of this. Arrange potatoes on prepared baking sheet. Season cavities with salt and pepper. Mash the potato centers in a bowl until smooth and mix with half (3/4 cup plus 1 tablespoon) of prepared pimento cheese. Season with more salt and pepper to taste. Use a small spoon, butter knife or small offset spatula to press/pack filling back into emptied potatoes, smoothing the tops. Nestle them in the pan tightly to discourage them from toppling and spilling their contents.\nBake 15 to 20 minutes, until melty and sizzling, then run under broiler until lightly browned on top. Let cool 5 to 10 minutes before serving, garnishing with paprika and/or chives when you do.\n"
        ], 
        "date": "2016-12-29T12:57:09+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound pizza dough", 
            "Olive oil, for oiling baking sheets", 
            "1/2 cup fromage blanc or ricotta", 
            "1/2 cup crème fraîche or sour cream", 
            "1 tablespoon all-purpose flour", 
            "Salt and freshly ground pepper", 
            "1/4 pound thickly sliced smoky bacon, cut crosswise into 1/4-inch strips", 
            "1 medium onion, thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pizza-with-bacon-onions-and-cream1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Onions", 
            "Photo", 
            "Pizza"
        ], 
        "url": "https://smittenkitchen.com/2011/01/pizza-with-bacon-onions-and-cream/", 
        "title": "pizza with bacon, onions and cream", 
        "directions": [
            "Preheat oven to 450°F. In a medium skillet, cook the bacon over medium heat until the fat is rendered and the bacon crisps up. Remove with a slotted spoon and drain on paper towels. Add onion to skillet and cook until softened and beginning to caramelize, an amount of time I forgot to write down but would estimate at 7 to 10 minutes.", 
            "Whisk together (or blend together in a food processor, if you want it silky-smooth) fromage blanc and crème fraîche with flour, then season with salt and freshly ground black pepper.", 
            "Divide the dough into 4 pieces. Roll each piece out to a rough 8-inch round, about 1/8 inch thick. If the dough becomes difficult to roll, let it rest for 10 minutes, then continue.", 
            "Oil two large baking sheets. Transfer two dough rounds to each. Spread the fromage blanc mixture over the rounds to within 1/4 inch of the edge. Sprinkle with the bacon and onion. Bake on the bottom shelf of the oven for about 12 minutes, or until the crust is golden brown. Cut into wedges and serve."
        ], 
        "date": "2011-01-13T20:59:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large baking potato (1 pound), peeled", 
            "1 small onion (4 ounces), peeled", 
            "1/4 cup all-purpose flour", 
            "1 large egg, lightly beaten", 
            "1 teaspoon salt", 
            "1/4 teaspoon freshly ground pepper", 
            "Peanut oil, for frying"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/potato-latkes1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/12/potato-pancakes-even-better/", 
        "title": "potato pancakes, even better", 
        "directions": [
            "In a food processor or on a box grater, coarsely shred the potato and onion. For longer strands, lay the potato sideways in the chute of your food processor. Transfer to a colander or wrap in a cheesecloth sling, and squeeze as dry as possible. Let stand for 2 minutes, then squeeze dry again.", 
            "In a large bowl, whisk the flour, egg, salt and pepper together. Stir in the potato onion mixture until all pieces are evenly coated.", 
            "In a medium skillet, heat 2 tablespoons of vegetable oil until shimmering. Drop packed tablespoons of the potato mixture into the skillet and flatten them with the back of a spoon. Cook the latkes over moderately high heat until the edges are golden, about 1 1/2 minutes; flip and cook until golden on the bottom, about 1 minute. Drain on paper towels. Repeat with the remaining potato mixture, adding more oil to the skillet as needed.", 
            "Do ahead: Latkes are a do-ahead-er’s dream. You can also keep latkes warm in the oven for an hour or more, if you’re waiting for stragglers to arrive. Cooked, they keep well in the fridge for a day or two, or in the freezer, well wrapped, for up to two weeks. Reheat them in a single layer on a cookie sheet in a 400 degree oven until they’re crisp again. Bonus: If you undercooked them a bit or didn’t get the browning on them you’d hoped for, you can compensate for this in the oven. "
        ], 
        "date": "2008-12-21T20:54:03+00:00"
    }, 
    {
        "ingredient_list": [
            "Rolls", 
            "3/4 cup plus 2 tablespoons milk", 
            "1 1/2 tablespoons granulated sugar", 
            "1 1/4 teaspoons (half a 1/4-ounce or 7-gram packet) active dry yeast", 
            "3 tablespoons unsalted butter, melted, plus extra to coat bowl", 
            "2 cups flour, either all-purpose or bread flour, or a mix thereof, plus extra for dusting", 
            "1 teaspoon fine sea or table salt", 
            "To finish", 
            "1/2 cup water", 
            "1 1/2 teaspoons baking soda or food-grade lye (see Notes below)", 
            "1 egg, beaten with 1 teaspoon water", 
            "Pretzel salt, coarse salt or sesame seeds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/pretzel-parker-house-rolls1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Bread", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2014/11/pretzel-parker-house-rolls/", 
        "title": "pretzel parker house rolls", 
        "directions": [
            "Make dough: Warm milk and sugar together until they’re about 105 to 110°F (41 to 44°C) in the bottom of a large mixing bowl. If you don’t have a thermometer, the correct temperature is when you can dip your finger into the liquid without noticing any temperature change (i.e. not warmer or cooler than your finger). Add yeast to milk-sugar mixture and let stand for 5 to 7 minutes. It should dissolve and become slightly foamy. ", 
            "Stir in butter, then 3/4 of flour, the salt, then remaining flour. Using spoon (for manual mixing) or dough hook (of a stand mixer), mix the dough until it forms a slightly sticky dough that balls together. If making by hand, turn out onto a floured counter and knead until smooth and elastic, about 10 minutes. If using a machine, let the dough hook do the work, running it for 5 minutes on low. If, at the end of the kneading process, the dough still feels quite sticky (a little sticky is good; more tips here), add 1 more tablespoon flour.", 
            "First rise: With kneaded dough on counter, butter or oil your mixing bowl. Return dough to bowl, cover with plastic wrap and place in a draft-free warmish spot for 1 hour, or until doubled in bulk.", 
            "Second rise: Butter an 8×8-inch square or equivalent size baking pan (such as a 9-inch round cake pan or deep-dish pie plate). Flour your counter and let dough fall out onto it. I like to take advantage of the round shape left by the bowl to divide my dough into even-enough wedges, like slices of a pie. Divide into 16 pieces. Form each into a round. Arrange seam side-down in prepared pan, with an even amount of space between rolls. Cover loosely with plastic wrap and let rise for another hour. About 10 minutes before the hour is up, begin the next step to heat the oven and prep pretzel wash.", 
            "Pretzel it! Heat oven to 375°F (190°C). If using the baking soda option, bring your water to a boil and slowly stir in baking soda — it will foam up. If using the food-grade lye option, do not heat your water, just stir the lye into the water in a sink, wearing gloves (see more precautions in Notes below). ", 
            "Thoroughly brush tops and creases between rolls (as best as your brush can get in) with the lye or soda pretzel wash. Rinse brush and beat your egg with 1 teaspoon water. Brush the rolls a second time, this time with the egg wash. Sprinkle rolls with either sesame seeds or coarse salt. Use a sharp paring knife to make +-sign slashes in the top of each roll; you want to cut at least 1/2-inch down (I always make my cuts too shallow and they get lost when baked). ", 
            "Bake: Bake rolls for 20 to 25 minutes, until a lovely brown on top. Let cool in pan on rack. Salt-topped rolls are best on the first day. Sesame-topped rolls keep better, and can easily be frozen and stashed for future bread emergencies urgencies.", 
            "Notes:"
        ], 
        "date": "2014-11-13T11:46:18+00:00"
    }, 
    {
        "ingredient_list": [
            "1 to 2 tablespoons olive oil", 
            "2 tablespoons thinly sliced almonds", 
            "1 medium or 2 small zucchinis, cut into 1/8-inch matchsticks", 
            "Salt and freshly ground pepper", 
            "Peelings of pecorino romano or parmesan cheese, to taste (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/08/quick-zucchini-saute.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Budget", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2007/08/quick-zucchini-saute/", 
        "title": "quick zucchini sauté", 
        "directions": [
            "Heat a large skillet over medium-high and add enough oil to coat the pan well. Heat the oil until hot but not smoking, then add the almonds to the pan. Cook them, stirring, until the almonds are golden-brown, approximately a minute or two. Don’t skimp on this step; they provide a depth of flavor that carries the whole dish. Add the zucchini to the pan, tossing it with the oil and almonds until it just begins to glisten, about one minute. The idea is not to cook the zucchini so much as warm it so it begins to soften. Season well with salt and pepper, slide onto a plate, top with cheese (if using) and immediately dig in."
        ], 
        "date": "2007-08-02T16:50:40+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups whole milk", 
            "1 cup heavy cream (see Note above about using less)", 
            "1/2 teaspoon coarse sea salt", 
            "3 tablespoons freshly squeezed lemon juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/06/rich-homemade-ricotta.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cheese", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/06/rich-homemade-ricotta/", 
        "title": "rich homemade ricotta", 
        "directions": [
            "Pour the milk, cream and salt into a 3-quart nonreactive saucepan. Attach a candy or deep-fry thermometer. Heat the milk to 190°F, stirring it occasionally to keep it from scorching on the bottom. Turn off the heat [Updated] Remove from heat and add the lemon juice, then stir it once or twice, gently and slowly. Let the pot sit undisturbed for 5 minutes.", 
            "Line a colander with a few layers of cheesecloth and place it over a large bowl (to catch the whey). Pour the curds and whey into the colander and let the curds strain for at least an hour. At an hour, you’ll have a tender, spreadable ricotta. At two hours, it will be spreadable but a bit firmer, almost like cream cheese. (It will firm as it cools, so do not judge its final texture by what you have in your cheesecloth.) Discard the whey, or, if you’re one of those crafty people who use it for other things, of course, save it. Eat the ricotta right away or transfer it to an airtight container and refrigerate until ready to use.", 
            "Serve: On 1/2-inch slices of baguette that have been run under the broiler until lightly bronzed. Serve it simply [as shown in the top photo, left to right] with honey and a pinch of flaky sea salt, a couple grinds of black pepper, pinch of salt and drizzle of olive oil, and/or a few droplets of an aged balsamic. Or with zucchini ribbons [as shown in the last photo], I started with about half a pound of miniature zucchini my mother-in-law had found at Trader Joes. Larger ones will work just fine, but you might want to first cut a big one in half lengthwise. Peel them into ribbons and toss them with 1/4 teaspoon of salt and let them drain in a colander for a while (this wilts them), about 20 minutes. Rinse and pat them dry. Toss with lemon juice, olive oil, salt and black pepper to taste. Arrange in piles on ricotta crostini.", 
            "Do ahead: I keep mine only 3 to 4 days; the really fresh milk I used doesn’t last long. However, Salvatore also uses really fresh milk, and theirs appears to keep closer to two weeks. In conclusion? Shelf lives will vary. Use your nose to judge freshness. Or your partner’s nose, because who doesn’t like hearing “Hey honey, sniff this for me?”"
        ], 
        "date": "2011-06-18T09:48:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1 to 2 tablespoons plus 4 teaspoons olive oil", 
            "1 1/2 pounds eggplant (about 2 medium), in 3/4- to 1-inch slices", 
            "2 ounces (1/2 cup) chopped or crumbled ricotta salata", 
            "2 tablespoons capers, drained", 
            "1/3 cup finely diced red onion", 
            "3 seeded, diced medium tomatoes (1 1/2 cups)", 
            "3 tablespoons minced fresh mint leaves", 
            "2 teaspoon red wine vinegar", 
            "Freshly ground black pepper."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-eggplant-with-tomatoes-and-mint1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Eggplant", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/09/roasted-eggplant-with-tomatoes-and-mint/", 
        "title": "roasted eggplant with tomatoes and mint", 
        "directions": [
            "Preheat oven to 425 degrees. Coat a large baking sheet generously with olive oil, about 1 to 2 tablespoons. Arrange eggplant rounds in a single layer. Sprinkle with salt and freshly ground black pepper. Roast, without disturbing, for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release from the pan with no effort. If they’re not, let it cook longer. Once flipped, sprinkle them with additional salt and freshly ground black pepper and return the pan to the oven for another 10 to 12 minutes or so, until the undersides match the tops.", 
            "[Alternatively, on the grill: Brush eggplant slices with oil; sprinkle with salt and pepper. Grill eggplant slices until slightly charred and tender when pierced with knife, about 5 to 7 minutes per side.]", 
            "Meanwhile, mix your ricotta, capers, onion, tomatoes, mint, vinegar and remaining 4 teaspoons olive oil in a small bowl. Taste for seasoning; ricotta salata tends to be quite salty so I don’t find that this dish needs more than a pinch of salt, if that. Add more vinegar, if desired. Add freshly ground black pepper, to taste.", 
            "When the eggplant discs are done, arrange them on a serving platter. Scoop a spoonful of the salad over each round. Eat immediately."
        ], 
        "date": "2011-09-08T22:11:12+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive oil", 
            "1 cup grapes, seedless purple ones are my first choice, all will work", 
            "1 cup olives, pitted kalamata are my first choice, all will work", 
            "1 1/2 teaspoons finely chopped rosemary, divided", 
            "Sea salt and red pepper flakes", 
            "About 12 baguette slices, toasted", 
            "3/4 cup ricotta"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/roasted-grape-and-olive-crostini1.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/12/roasted-grape-and-olive-crostini/", 
        "title": "roasted grape and olive crostini", 
        "directions": [
            "Heat oven to 400°F (205°C). Combine olive oil, grapes, olives, 1 teaspoon rosemary, a couple pinches of sea salt and pepper flakes in a baking dish or roasting pan. Roast until grapes are wilted and leaking juices, about 35 to 55 minutes, rolling ingredients around in pan a few times throughout roasting time to encourage even cooking.", 
            "Slather each toast with ricotta, then heap each with grapes, olives and their pan juices. Finish with remaining rosemary and eat immediately."
        ], 
        "date": "2014-12-29T11:58:03+00:00"
    }, 
    {
        "ingredient_list": [
            "Sauce", 
            "1/2 cup dark brown sugar", 
            "1/2 cup water", 
            "1/2 cup soy sauce, preferably Japanese or reduced sodium", 
            "1/2 cup mirin (sweet rice wine), or 1/2 cup sake with 1/4 cup sugar", 
            "1/4 cup peeled, chopped ginger (I used half and it tasted like plenty to me; adjust to your preference)", 
            "1 teaspoon ground coriander", 
            "4 whole black peppercorns (no, I did not count how many I put in there)", 
            "Meatballs", 
            "1 pound ground turkey", 
            "4 large or 6 small scallions, finely chopped", 
            "Half bunch cilantro, finely chopped (about 1/2 cup) (the cilantro-averse can use flat-leaf parsley)", 
            "1 large egg", 
            "2 tablespoons sesame oil, toasted if you can find it", 
            "2 tablespoons soy sauce", 
            "Freshly ground black pepper", 
            "Vegetable oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/scallion-meatballs-with-soy-ginger-glaze.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Chinese", 
            "Gluten-Free", 
            "Meat", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/12/scallion-meatballs-with-soy-ginger-glaze/", 
        "title": "scallion meatballs with soy-ginger glaze", 
        "directions": [
            "Make sauce: Bring sugar and water to a boil in a small saucepan over medium-high heat, stirring until sugar melts completely. Reduce heat to a medium-low and add soy sauce, mirin, ginger, coriander and peppercorns. Simmer, stirring occasionally, until reduced by half, about 30 minutes, though this took me a bit longer to reduce it until it was syrupy enough that I thought it would coat, and not just dribble off the meatballs. You can keep it on a back burner, stirring it frequently, while browning the meatballs in the next step. Once it has reduced to your satisfaction, strain through a sieve.", 
            "Make meatballs: Mix turkey, scallions, cilantro, egg, sesame oil, soy sauce and several grindings of black pepper in a bowl. I like mixing meatballs with a fork; it seems to work the ingredients into each other well. Roll tablespoon-sized knobs of the mixture into balls. The mixture is pretty soft; I find it easiest to roll — eh, more like toss the meatballs from palm to palm until they’re roundish — meatballs with damp hands.", 
            "In a skillet over medium-high heat, generously cover bottom of pan with vegetable oil. Working in batches to avoid crowding, place meatballs in pan and cook, turning, until browned all over and cooked inside, about 8 minutes per batch. Arrange on a platter (a heated one will keep them warm longer), spoon a little sauce over each meatball, and serve with toothpicks. Alternatively, you can serve the glaze on the side, to dip the meatballs. ", 
            "Do ahead: The sauce can be made up to 2 days in advance and refrigerated until needed. If needed, you can rewarm or keep the meatballs warm in a 200-degree oven until ready to serve. I’m storing mine in the fridge overnight and crossing my fingers they’ll taste fresh tomorrow."
        ], 
        "date": "2011-12-30T21:43:13+00:00"
    }, 
    {
        "ingredient_list": [
            "2/3 cup water", 
            "1 tablespoon butter", 
            "1/2 teaspoon salt", 
            "1/2 cup semolina", 
            "1 tablespoon Parmesan cheese", 
            "1 egg, lightly beaten", 
            "1 tablespoon chopped parsley or chives (optional)", 
            "1 carrot, peeled, cut into short, fat matchsticks", 
            "1 parsnip, peeled, cut the same as the carrot", 
            "Few tablespoons snipped chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/semolina-dumpling-soup1.jpg?w=500", 
        "tags": [
            "Dumplings", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/05/semolina-dumpling-soup/", 
        "title": "semolina dumpling soup", 
        "directions": [
            "Once your stock is ready, add the carrots and parnsips and simmer them until they’re almost cooked, about five minutes. You can make the dumplings while you wait. Once everything is cooked, garnish (or forget to, in our case) and serve quickly."
        ], 
        "date": "2008-05-21T15:49:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup self-raising (self-rising) flour, sifted", 
            "2 eggs", 
            "20 grams (3/4 ounces) butter, melted [I translated this as 1 1/2 tablespoons]", 
            "1/3 cup (2 1/2 fluid ounces) milk", 
            "Sea salt and cracked black pepper", 
            "1/2 cup fresh ricotta cheese", 
            "1/4 cup torn basil leaves", 
            "75 grams (2 2/3 ounces) leg ham, torn", 
            "1 zucchini (courgette), cut into long, thin strips", 
            "Vegetable oil for shallow frying"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/shes-finally-lost-it1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Pancakes", 
            "Photo", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2006/11/shes-finally-lost-it/", 
        "title": "zucchini, ham and ricotta fritters", 
        "directions": [
            "Place the flour eggs, butter, milk, salt and pepper in a large bowl and whisk to combine. Fold through the ricotta, basil, ham and zucchini. Place two tablespoon of the oil in a small frying pan [I used a light coating of olive oil spray] and heat over medium heat. Add half of the mixture to the pan and cook for 2-3 minutes each side or until bubbles appear on the surface. Set aside.", 
            "Add another two tablespoons of the oil and repeat with the remaining batter. Cut into wedges to serve. Serves [at least] 2. "
        ], 
        "date": "2006-11-29T23:25:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup mayonnaise", 
            "1/2 cup sour cream", 
            "1 tablespoon prepared horseradish", 
            "1 tablespoon Worcestershire sauce", 
            "2 tablespoons Creole mustard, or a mustard that you prefer", 
            "1 teaspoon smoked paprika", 
            "Zest and juice from 2 lemons", 
            "2 tablespoons Tabasco sauce (see Note; I skipped this)", 
            "1 teaspoon cayenne powder (I used much less)", 
            "3 green onions, thinly sliced (white and green parts)", 
            "1 stalk celery, finely diced", 
            "1/2 jalapeño, finely chopped (I skipped this)", 
            "1/2 medium yellow onion, finely diced (and this)", 
            "1 pound skinned and flaked smoked whitefish", 
            "Salt and pepper, to taste", 
            "Saltine crackers to serve", 
            "1 tablespoons finely chopped chives, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/smoked-whitefish-dip-horseradish1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Photo", 
            "Recipes", 
            "Salad", 
            "Seafood", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2014/11/smoked-whitefish-dip-with-horseradish/", 
        "title": "smoked whitefish dip with horseradish", 
        "directions": [
            "Make the dressing by mixing mayonnaise, sour cream, horseradish, Worcestershire, mustard, paprika, zest and lemon juice, hot sauce (if using), cayenne (to taste), green onions, celery, jalapeño (if using) and onion in a medium bowl. Season with salt and pepper to taste.\nPlace skinned and flaked whitefish in a larger bowl. Add dressing to taste (we used about 3/4 of it total) and adjust seasonings with salt and pepper. Serve with crackers, garnished with chives.\n"
        ], 
        "date": "2014-11-03T11:53:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon unsalted butter", 
            "1/2 cup sliced green onions", 
            "1 clove garlic, minced", 
            "1 pound fresh spinach (coarse stems removed if ‘grown-up’ spinach; baby spinach can be used in full)", 
            "3/4 pound feta, crumbled", 
            "1 tablespoon lemon juice", 
            "Salt and pepper to taste", 
            "1/4 ounce dried wild mushrooms, such as chanterelles, porcini or shiitakes", 
            "1 cup boiling water", 
            "2 tablespoons unsalted butter", 
            "3/4 cup sliced green onions", 
            "1 garlic clove, minced", 
            "1/2 teaspoon chopped fresh rosemary", 
            "1/2 teaspoon chopped fresh thyme", 
            "1/2 pound assorted fresh wild mushrooms, such as chanterelles, porcini and shiitakes, brushed clean and chopped small", 
            "1/2 pound fresh button mushrooms, brushed clean and chopped small", 
            "5 ounces blue cheese crumbles", 
            "Salt and pepper to taste", 
            "3 tablespoons olive oil", 
            "1 teaspoon fennel seeds", 
            "2 large yellow onions, chopped small", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper", 
            "1 heaping tablespoon Dijon mustard", 
            "4 ounces goat cheese, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/spanikopita-triangles.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/06/spanakopita-triangles-then-some/", 
        "title": "spanakopita triangles + then some", 
        "directions": [
            "Preheat oven to 375°F. Melt butter in a small saucepan, then cool. Cover phyllo stack with 2 overlapping sheets of plastic wrap and then a dampened kitchen towel. [I won’t lie, as I got more confident with the phyllo I sorta skipped this part, opting instead to work quickly. Proceed at your own risk, however!]", 
            "Take one phyllo sheet from stack and arrange on a work surface with a long side nearest you (keeping remaining sheets covered) and brush with some butter. Top with another phyllo sheet and brush with more butter. Cut buttered phyllo stack crosswise into 6 (roughly 12- by 2 3/4-inch) strips.", 
            "Put a heaping teaspoon of filling near one corner of a strip on end nearest you, then fold corner of phyllo over to enclose filling and form a triangle. Continue folding strip (like a flag), maintaining triangle shape. Put triangle, seam side down, on a large baking sheet and brush top with butter. Make more triangles in same manner, using all of phyllo.", 
            "Bake triangles in middle of oven until golden brown, 20 to 25 minutes, then transfer to a rack to cool slightly.", 
            "Do ahead: Pastry triangles can be formed, but not baked, three days ahead. Arrange in one layer in heavy-duty sealed plastic bags, then freeze. Bake frozen pastries (do not thaw) in same manner as above."
        ], 
        "date": "2009-06-10T08:43:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 teaspoon salt", 
            "1 1/2 cups white spelt flour, plus more for flouring surface", 
            "Coarse sea salt, dried onion bits, poppy seeds and sesame seeds (for the everything bagel effect) or a seed combination of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spelt-everything-crackers1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/12/spelt-everything-crackers/", 
        "title": "spelt everything crackers", 
        "directions": [
            "1. Preheat the oven to 350 degrees. Dissolve the salt in 1/2 cup of cold water. Stir in the spelt flour until combined. Knead the dough a few turns until a ball forms.", 
            "2. Flour an overturned 12-by-17-inch cookie sheet and roll out the dough on top of it, using as much flour as needed to prevent sticking, until the dough covers the sheet from edge to edge. Do your best to get them as thin as possible, because the thicker parts become quite hard when baked. Using a spray bottle filled with water, spray the dough to give it a glossy finish. Prick the dough all over with a fork. If you choose, sprinkle with sea salt or seeds. For neat crackers, score the dough into grids.", 
            "3. Bake until the dough is crisp and golden and snaps apart, 15 to 25 minutes. (Check after 10 minutes to make sure it does not overcook.) Break into pieces and serve. "
        ], 
        "date": "2008-12-04T19:20:49+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound (230 grams) dried chickpeas, cooked until soft and tender* or two 15-ounce cans of chickpeas, drained and rinsed", 
            "6 tablespoon olive oil", 
            "1 pound (450 grams) spinach, washed", 
            "A hefty 1-inch slice from a country loaf or about 2 slices from sandwich loaf bread (2.5 ounces or 75 grams), crusts removed and cut inset small cubes", 
            "1/2 cup (4 ounces) tomato sauce (I used canned stuff I keep around)", 
            "3 garlic cloves, thinly sliced", 
            "1/2 teaspoon ground cumin", 
            "Pinch of red pepper flakes", 
            "1 1/2 tablespoons red wine vinegar", 
            "1/2 teaspoon smoked paprika**", 
            "Salt and freshly ground black pepper", 
            "Lemon juice, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/03/spinach-and-chickpeas.jpg?w=752", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Beans", 
            "Photo", 
            "Put An Egg On It", 
            "Spanish", 
            "Spinach", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/03/spinach-and-chickpeas/", 
        "title": "spinach and chickpeas", 
        "directions": [
            "Place a large saucepan over medium heat and add half the olive oil. When it is hot, add the spinach with a pinch of salt (in batches, if necessary) and stir well. Remove when the leaves are just tender, drain in a colander and set aside.", 
            "Heat 2 more tablespoons olive oil in a frying pan over medium heat. Fry the bread for about 5 minutes or until golden brown all over, then the remaining tablespoon of oil and the garlic, cumin and pepper. Cook for 1 minute more or until the garlic is nutty brown.", 
            "Transfer to a food processor, blender or mortar and pestle along with the vinegar, and mash to a paste. Return the mixture to the pan and add the drained chickpeas and tomato sauce. Stir until the chickpeas have absorbed the flavors and are hot. Season with salt and pepper.", 
            "If the consistency is a little thick, add some water. Add the spinach and cook until it is hot. Check for seasoning and serve with paprika on top, or on fried bread toasts (as the Spanish do).", 
            "* I make all of my dried beans in the slow-cooker these days. They are perfect every time, and the flavor of fresh beans — even the sad-looking ones from grocery store bins I used — is incomparable. No presoaking, just cover them 2 to 3 inches of water and cook them 3 hours on high. (I have learned that cooking time can vary widely in slow-cookers so allot more time than you might need. I often make mine in the day or days before and let them cool in their cooking water, which is then by then very flavorful.)", 
            "** This might be my favorite ingredient on earth — it’s amazing on eggs and potatoes, too. If you can’t find it locally, Amazon and Penzeys are among a bunch of places that sell it online."
        ], 
        "date": "2010-03-17T11:26:41+00:00"
    }, 
    {
        "ingredient_list": [
            "Potstickers", 
            "3 to 3 1/4 cups chopped spring vegetables (such as asparagus, favas, peas, lima beans or more) (I used 2 1/4 cups chopped asparagus from 12 ounces stalks plus 1 cup cooked favas from about 1 pound fresh in their pods)", 
            "1 tablespoon neutral cooking oil, such as safflower, canola or peanut", 
            "3/4 cup thinly sliced scallions (from about 3/4 of a bundle, about 3 ounces)", 
            "1 tablespoon minced ginger", 
            "1 clove garlic, peeled minced (if using garlic chives, omit)", 
            "1 cup (about 6 ounces) firm tofu, chopped small (see Note up top for alternative)", 
            "1/2 cup garlic or regular chives", 
            "1 teaspoon toasted sesame oil", 
            "1/4 teaspoon kosher salt, or more to taste", 
            "To assemble", 
            "1 tablespoon cornstarch", 
            "1/2 cup water", 
            "50 round dumpling wrappers (most packages contain 50)", 
            "Scallion dipping sauce", 
            "2 to 3 scallions (or, remainder of bundle used for potstickers), thinly sliced (use some in sauce, some for garnish)", 
            "1/4 cup rice vinegar", 
            "1/4 cup soy sauce", 
            "1 tablespoon regular or spicy toasted sesame oil ", 
            "To cook", 
            "1 to 2 tablespoons neutral cooking oil", 
            "1/4 to 1/2 cup water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/spring-vegetables-potstickers.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Dumplings", 
            "Peas", 
            "Photo", 
            "Spring", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/05/spring-vegetable-potstickers/", 
        "title": "spring vegetable potstickers", 
        "directions": [
            "Prepare vegetables: If using asparagus, cut off tough ends and sliced stalks into 1/2-inch segments. If using fava, remove them from their pods. Boil favas for 3 minutes, then drain, and press them out of their opaque skins (if difficult, first make a small slit on one end with a paring knife). To prepare peas, simply remove them from their pods. To prepare lima beans, remove them from their pods and simmer them for about 5 minutes to soften.  ", 
            "Make filling: Heat a wok or large saute pan over medium heat. Add a tablespoon of oil and heat, then add scallions, ginger and garlic, if using. Cook for one minute, then add vegetables in the order of the time they need to cook until crisp-tender. Asparagus will need about 4 minutes, peas about 2 to 3, and favas and limas will already be tender, so just a minute to warm them. Add tofu and chives and cook just until chives wilt, about 1 minute more. Season with salt and transfer to a fine-mesh colander, to drain off any excess liquid. Let cool in colander for 15 minutes. ", 
            "If mixture is still on the chunky side, either chop it finely on a cutting board or pulse it a few times in a food processor. You don’t want to puree it; bits of vegetable should still be recognizable, but it will be easier to mound in dumplings if chopped well. Adjust seasonings if needed and mix with sesame oil.", 
            "Assemble potstickers: Line two baking sheets with parchment paper or very lightly oil them. Mix cornstarch and water in a small bowl; this will act as your “glue.” Most dumpling wrappers come dusted with a little starch, so you’ll be okay if you want to skip the cornstarch, but I always feel safer having a little extra as an insurance plan.", 
            "Remove first wrapper from package and put it on a plate; place a damp towel or piece of plastic wrap over the unused ones to keep them from drying out. Brush wrapper with cornstarch-water mixture. Mound 1 to 2 teaspoons filling in the center. Fold the wrapper in half over the filling, sealing the center edge shut. Make a few small pleats down each sides to seal in the rest of the filling, while trying to press out as much air as possible (a process that looks difficult but is so easy, I think you’ll find it intuitive — use the photos in the post as guidance). Rest the dumpling, pleats up, on prepared tray and repeat with remaining wrappers and filling. When you’re all done, look over your potstickers; use the cornstarch mixture and pinching to seal any open sides or loosened pleats.", 
            "You can now freeze the dumplings on their trays, then transfer them to a freezer bag once they will no longer stick together, or cook them right away.", 
            "Make dipping sauce: Mix ingredients and adjust levels to taste. For a sweeter sauce, add a 1/2 teaspoon honey or brown sugar.", 
            "Cook potstickers: Heat a large skillet (I really like to use a nonstick here) over medium-high heat. Once hot, add the oil and heat this too. Once the oil is hot, arrange potstickers in a single layer and cook until browned at the bottom. This will take about 1 minute for fresh ones and up to 5 minutes for frozen ones. Add water; it will hiss and sputter, so move quickly. You’ll want the smaller amount of water for a smaller batch and the larger if you’re cooking more. Put a lid on the pot and cook dumplings for 2 to 3 minutes more (plus an additional minute if your dumplings were frozen to begin with). Remove lid and simmer until any remaining water has cooked off. ", 
            "Transfer to serving plate; garnish with scallion greens. Serve with dipping sauce."
        ], 
        "date": "2013-05-01T11:21:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 2 1/2- to 3-pound kabocha or other yellow-fleshed squash (such as delicata, acorn or butternut, which I used)", 
            "1/2 to 3/4 cup olive oil", 
            "1/2 teaspoon dried chile flakes, more or less to taste", 
            "Coarse sea or kosher salt", 
            "1 yellow onion, peeled and thinly sliced", 
            "1/3 cup apple cider vinegar", 
            "1/4 cup maple syrup (though I’ll probably use 3 tablespoons next time)", 
            "4 slices country bread, 1-inch thick", 
            "1/2 cup (4 ounces) ricotta, goat cheese, feta or mascarpone", 
            "4 tablespoons chopped mint leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/squash-toasts-with-ricotta-and-cider-vinegar1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Fall", 
            "Photo", 
            "Thanksgiving", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2014/10/squash-toasts-with-ricotta-and-cider-vinegar/", 
        "title": "squash toasts with ricotta and cider vinegar", 
        "directions": [
            "Heat oven to 450. Line large baking sheet with parchment paper. No need to peel your squash (as shown above), just halved, seed and cut your squash into 1/4-inch thick slices. Toss with 3 tablespoons olive oil, 1 to 2 teaspoons salt (Vongerichten recommends 2 teaspoons; I used a bit less) and chile flakes until evenly coated. Transfer mixture to prepared sheet and roast until tender and slightly colored, anywhere from 15 to 30 minutes (depending on the density of the squash you use), flipping once about 2/3 of the way through. Once tender, you can cut the flesh from the skin and discard it. Leave roasted squash on the tray.", 
            "Meanwhile, heat 3 tablespoons olive oil in large skillet over medium-high heat. Add the onions and 1 teaspoon salt and cook, stirring frequently, until onions are softened and beginning to brown, about 10 to 15 minutes. Add vinegar and syrup and reduce heat to medium. Cook, stirring, until onions are jammy and broken down, another 10 to 15 minutes.", 
            "Pile onions on top of roasted squash, still on their baking sheet. Use a fork to gently half-mash the mixture; I like this best when the mixture is not uniformly combined. Taste and adjust seasonings if needed.", 
            "Heat a large skillet over medium-high heat. Add 1 tablespoon olive oil per slice of bread, and cook bread until just golden brown on both sides. Drain on paper towels. Spread cheese on toasts, heap with the squash-onion mixture, sprinkle with coarse salt and garnish with mint. ", 
            "Do ahead: Now that we’ve finished lunch, I can note with great confidence that these reheat wonderfully, even fully assembled, with none of the sog you’d expect from day-old stuff on bread. (It helps if you use a sturdy bread, of course.) Reheat on a baking sheet in a 300 degree oven for 15 minutes. "
        ], 
        "date": "2014-10-29T11:39:08+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/taco-torte1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Beans", 
            "Photo", 
            "Tex-Mex", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/02/taco-torte/", 
        "title": "taco torte", 
        "directions": [
            "Heat the oven to 400°F. Line a 9-inch round cake pan or cast-iron skillet tightly with foil and spray it with a nonstick spray. Or, you can coat a 9-inch springform with nonstick spray and skip the foil, since it’s easier to remove from a springform.", 
            "Heat the oil in a large skillet over medium heat. Add the onion, garlic, fresh chile pepper (if using), cumin, chili powder, and and cook until you can smell the spices and the onion is softened, about 3 minutes. Stir in the tomatoes with the 1/3 cup of reserved juice and the tomato paste, then stir in the beans. Season with salt and pepper to taste. Let the bean mixture simmer until everything is hot, about 3 minutes. Add the corn and spinach and stir until the spinach has wilted and everything is well blended and hot, about 3 minutes. Taste for seasoning, adding more salt and/or pepper as necessary.", 
            "Place 1 tortilla in the prepared cake pan. Spread one-sixth (just eyeball it) of the bean and vegetable mixture evenly over the tortilla, then sprinkle 1/4 to 1/3 cup of the shredded cheese evenly over the top. Repeat with 5 more layers, ending with the last of the bean mixture and shredded cheese.", 
            "Bake the tortilla stack until it is hot throughout and the top is lightly browned, about 20 minutes. You can run it under the broiler for extra color on top, if you wish. Let the it sit at room temperature for 5 minutes, before removing it from the pan, either by carefully lifting the foil that lines the pan or by opening the sprinform sides. Cut it into wedges using a sharp knife and serve it with a spatula or better yet a pie server. Sprinkle the top with cilantro, if desired, and serve with sour cream and/or salsa on the side, if you like.", 
            "Do ahead: You can make this ahead of time, cover it in the fridge overnight then leave it at room temperature for 20 to 30 minutes before baking it. The torte also reheats well."
        ], 
        "date": "2016-02-01T12:03:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 tablespoons whole black peppercorns", 
            "4 cups all-purpose flour plus additional for dusting", 
            "2 teaspoons baking powder", 
            "2 teaspoons salt", 
            "4 1/2 oz Parmigiano-Reggiano, finely grated (2 1/4 cups)", 
            "1 1/2 sticks (3/4 cup) cold unsalted butter, cut into 1/2-inch cubes", 
            "4 large eggs", 
            "1 cup whole milk"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-anticandy1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/12/the-anticandy/", 
        "title": "parmesan black pepper biscotti", 
        "directions": [
            "Special equipment: an electric coffee/spice grinder ", 
            "Put oven racks in upper and lower thirds of oven and preheat oven to 350°F. Pulse peppercorns in grinder until coarsely ground.", 
            "Whisk together flour, baking powder, salt, 2 cups cheese, and 1 tablespoon ground black pepper in a large bowl. Blend in butter with a pastry blender or your fingertips until mixture resembles coarse meal. Whisk 3 eggs with milk and add to flour mixture, stirring with a fork until a soft dough forms.", 
            "Turn dough out onto a lightly floured surface and quarter dough. Using well-floured hands, form each piece into a slightly flattened 12-inch-long log (about 2 inches wide and 3/4 inch high). Transfer logs to 2 ungreased large baking sheets, arranging logs about 3 inches apart.", 
            "Whisk remaining egg and brush some over logs, then sprinkle tops of logs evenly with remaining 1/4 cup cheese and 1/2 tablespoon ground pepper. Bake, rotating sheets 180 degrees and switching position of sheets halfway through baking, until logs are pale golden and firm, about 30 minutes total. Cool logs to warm on sheets on a rack, about 10 minutes.", 
            "Reduce oven temperature to 300°F.", 
            "Carefully transfer 1 warm log to a cutting board and cut diagonally into 1/2-inch-thick slices with a serrated knife. Arrange slices, cut sides down, in 1 layer on a baking sheet. Repeat with remaining logs, transferring slices to sheets. Bake, turning over once, until golden and crisp, 35 to 45 minutes total. Cool biscotti on baking sheets on racks, about 15 minutes.", 
            "Do ahead: Biscotti keep in an airtight container at room temperature 2 weeks. "
        ], 
        "date": "2006-12-20T17:14:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups distilled white vinegar", 
            "3 cups water", 
            "2/3 to 3/4 cup sugar", 
            "5 tablespoons kosher salt or 1/4 cup table salt*", 
            "10 bell peppers, all red or a mix of red, orange and yellow (the sweet varieties)", 
            "4 large cloves of garlic, coarsely chopped**"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-road-to-pickle-proficiency1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Peppers", 
            "Photo", 
            "Pickled", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2007/05/the-road-to-pickle-proficiency/", 
        "title": "pickled garlicky red peppers", 
        "directions": [], 
        "date": "2007-05-09T13:31:50+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup frozen peas", 
            "1 medium onion, peeled", 
            "1 large russet or Idaho potato, peeled", 
            "1 yam or sweet potato, peeled", 
            "1 large or 2 thin carrots, peeled", 
            "1 zucchini", 
            "4 large eggs", 
            "4 tablespoons all-purpose flour", 
            "1/2 teaspoon ground coriander", 
            "1/2 teaspoon ground turmeric", 
            "1 teaspoon ground cumin", 
            "A pinch of cayenne", 
            "2 tablespoons minced peeled fresh ginger", 
            "2 tablespoons minced fresh cilantro"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/throwing-pancakes-to-the-wind1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Indian", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/throwing-pancakes-to-the-wind/", 
        "title": "indian-spiced vegetable fritters", 
        "directions": [
            "Preheat oven to 200°F. Place two nonstick baking sheets in oven.", 
            "In small saucepan, bring salted water to boil. Add peas and cook, uncovered, until heated through, about 2 to 3 minutes. Drain, then rinse in colander under cool, running water. Set aside in colander to drain completely.", 
            "Using box grater or food processor² fitted with grating disc, coarsely grate onion, potatoes, carrot and zucchini and place in colander set in sink, setting aside to drain.", 
            "In large mixing bowl, lightly beat eggs. Whisk in flour, coriander, turmeric, and cumin. Mix in ginger, cilantro, and peas.", 
            "Press potatoes and onion to extract as much liquid as possible, then add to bowl. Season mixture with salt and freshly ground black pepper. Using wooden spoon or hands, mix well, but do not overwork.", 
            "In heavy-bottomed, 12-inch non-stick³ skillet over moderately high heat, heat 1-2 tablespoons oil (I used an extra-virgin olive oil spray I’d found to lightly coat the pan); until hot but not smoking. Drop 4 scant 1/4-cup portions of potato mixture into pan and flatten with spatula to form four 3-inch pancakes.", 
            "Fry until bottoms are golden-brown (the color really counts on this; the darker you let it go, the more the pancake holds together  – this goes for both sides.), 4 to 5 minutes, then turn over and fry until golden-brown and crisp, an additional 4 to 5 minutes. Transfer to paper towels to drain; season immediately with salt and pepper. Keep warm on baking sheets in oven while making remaining pancakes.", 
            "Using paper towels, carefully wipe out pan. And 1 tablespoon oil to the pan and fry 4 more pancakes. Repeat with remaining batter, wiping out pan and adding 1 to 2 tablespoons oil before each batch.", 
            "Serve pancakes hot with Curry-Lime Yogurt.", 
            "¹Or, you could do this step in the microwave, and save yourself a good bit of effort.", 
            "²Yet another recipe that yes, if you have a food processor, it takes no time at all to put this together. That said, it makes for more coarsely-grated vegetables than doing it by hand, so they are slightly harder to assemble into pancakes. ", 
            "³I know there is a lot of head-shaking at nonstick these days, and I, too, try to avoid it when possible. Still, pancakes like this are much, much more difficult to make without non-stick, as you’ll end up using tablespoon after tablespoon of oil to keep the fritters from sticking. "
        ], 
        "date": "2006-11-02T14:19:43+00:00"
    }, 
    {
        "ingredient_list": [
            "4 teaspoons vegetable oil", 
            "1/4 cup (60 grams) tomato paste", 
            "2 tablespoons cider vinegar", 
            "2 teaspoons honey", 
            "2 teaspoons Worcestershire sauce", 
            "2 teaspoons smooth dijon mustard", 
            "1/4 teaspoon table salt", 
            "2 slices sandwich bread", 
            "1/2 medium onion, roughly chopped", 
            "1 garlic clove, chopped", 
            "1 medium stalk celery, roughly chopped", 
            "1 medium carrot, roughly chopped", 
            "Olive oil, for cooking", 
            "1 teaspoon fine sea or table table salt, plus more for vegetables", 
            "Freshly ground black pepper", 
            "2 pounds ground beef", 
            "2 large eggs", 
            "1 tablespoon tomato paste", 
            "1 teaspoon dijon mustard", 
            "1 teaspoon smoked paprika", 
            "2 tablespoons Worcestershire sauce", 
            "1/4 cup chopped fresh flat-leaf parsley", 
            "1/2 cup (120 grams) milk", 
            "2 pounds (905 grams) yukon gold potatoes (about 6)", 
            "8 tablespoons (4 ounces or 115 grams) unsalted butter", 
            "1 cup (235 ml) buttermilk", 
            "1 teaspoon fine sea or table salt", 
            "Finely ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/tomato-glazed-meatloaves-with-brown-butter-mashed-potatoes.jpg?w=750", 
        "tags": [
            "Beef", 
            "Freezer Friendly", 
            "Meat", 
            "Photo", 
            "Potatoes", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2017/02/tomato-glazed-meatloaves-with-brown-butter-mashed-potatoes/", 
        "title": "tomato-glazed meatloaves with brown butter mashed potatoes", 
        "directions": [
            "Make the glaze: Combine glaze ingredients in a small saucepan, and simmer, whisking constantly, for 2 minutes until and glaze is satiny smooth. Set aside.\nPrepare the meatloaves: Heat your oven to 350 degrees F. Lightly coat 2 9×13-inch baking dishes with nonstick spray or oil. Tear the bread into chunks and then blend it, in a food processor, into breadcrumbs. Place the breadcrumbs in a large bowl. You should have about 1 cup.\nAdd the onion, garlic, celery, and carrot to the food processor, and pulse it until they are finely chopped. Heat a large skillet over medium heat. Once the skillet is hot, coat the bottom with olive oil, and heat the oil for a minute; add the finely chopped vegetables. Season with salt and pepper, and cook, stirring frequently, until they begin to brown, about 10 minutes.\nAdd the vegetables to the large bowl with breadcrumbs, then add the remaining ingredients. Stir the ingredients together with a fork or your hands until evenly blended.\nPause for a moment to start mashed potatoes: Place the potatoes in a medium pot, and cover with a couple inches of cold water. Bring to a boil over high heat, and once it’s boiling, reduce the heat to a simmer. Cook for about 20 minutes once the simmering begins; the potatoes are ready when a paring knife or fork can be inserted into the center with little resistance. Drain potatoes, then wipe the pot dry.", 
            "Resume your meatloaves while the potatoes boil: Form the meatloaf mixture into twelve 3-inch meatballs; each will weigh about 4 ounces. Arrange 6 in each prepared baking pan, evenly. Drizzle or brush each meatball with a teaspoon or so of the tomato glaze you made earlier, and bake until cooked through, about 20 to 25 minutes (an instant-read thermometer inserted into the center of a cooked meatball will register 160 to 165F).\nFinish mashed potatoes: As soon as you can hold them (I use potholders), peel your potatoes. The skins should come right off with a paring knife. Run the potatoes through a potato ricer or mash them with a masher until smooth. In your empty potato pot, melt butter over medium heat and continue cooking once it has melted, stirring almost constantly, until brown bits form around edge and bottom and it smells nutty. Pour the hot butter and any browned bits over the potatoes. Add buttermilk to pot and warm it gently (so it doesn’t cool down your potatoes when you add it). Pour this over the potatoes too. Add salt and pepper and stir to combine.\nTo serve: Place a dollop of potatoes in the bottom of a plate or shallow bowl. Top with a meatloaf. Garnish with extra chopped parsley, if desired.\n"
        ], 
        "date": "2017-02-16T13:08:33+00:00"
    }, 
    {
        "ingredient_list": [
            "18 ounces (3 2/3 cups) assorted unsalted nuts or 2 1/3 cups mixed nuts and 1 1/3 cups pretzel nuggets", 
            "1 tablespoon butter, melted", 
            "2 tablespoons fresh rosemary, coarsely chopped", 
            "1/4 to 1/2 teaspoon cayenne (see note up top)", 
            "2 teaspoons dark brown sugar", 
            "1 teaspoon kosher salt (see note up top)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/12/union-square-cafes-bar-nuts.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Quick", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2016/12/union-square-cafes-bar-nuts/", 
        "title": "union square cafe’s bar nuts", 
        "directions": [
            "Heat oven to 350 degrees. Spread nuts (if using pretzels, don’t add them yet) on a tray and toast for 10 to 15 minutes, until lightly golden and fragrant. While they’re toasting, whisk butter, rosemary, cayenne, sugar and salt in the bottom of a large bowl. When nuts are toasted, add them to bowl and stir to evenly coat. Add pretzels, if using, and coat again. Spread back on tray and toast for another 5 to 10 minutes. Let cool slightly, then serve warm in bowls. Nuts are also good at room temperature, and keep for weeks in airtight jars."
        ], 
        "date": "2016-12-09T13:15:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup shelled walnuts, even better if you toast and cool them first", 
            "1/4 cup grated Parmesan cheese", 
            "1 small garlic clove, peeled and crushed", 
            "3 sprigs of thyme, cleaned", 
            "Salt", 
            "Small splash of sherry vinegar (I used a generous splash and felt it dominated too much; go easy)", 
            "1/3 cup extra virgin olive oil", 
            "2 tablespoons minced sun-dried tomatoes (oil or dry-packed will both work)", 
            "1 loaf country bread, or a baguette, sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/12/walnut-pesto.jpg?w=752", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Quick", 
            "Savory Sauces and Condiments"
        ], 
        "url": "https://smittenkitchen.com/2009/12/walnut-pesto/", 
        "title": "walnut pesto", 
        "directions": [
            "In food processor, coarsely grind walnuts, cheese, garlic, thyme, salt and vinegar. Stir in oil and tomatoes.", 
            "Grill or toast bread. While hot, top each slice with a heaping teaspoon of pesto. "
        ], 
        "date": "2009-12-29T11:24:05+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces goat milk Gouda, coarsely grated*", 
            "4 ounces fresh goat cheese, softened", 
            "1 tablespoon all-purpose flour", 
            "1 large egg", 
            "1/4 cup Panko** breadcrumbs", 
            "1/2 teaspoon coarse or sea salt", 
            "Olive oil, for frying", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/warm-crisp-and-a-little-melty-salad-croutons1.jpg?w=500", 
        "tags": [
            "Cheese", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/05/warm-crisp-and-a-little-melty-salad-croutons/", 
        "title": "warm, crisp and a little melty salad croutons", 
        "directions": [
            "Mash together cheeses in a bowl, mixing until combined. Form the mixture into four balls then smoosh each slightly into thick patties. Arrange three small dishes for dredging stations: Place the flour in the first one, beat the egg lightly in the second, and mix the breadcrumbs and salt in the last one. Heat a healthy slick of olive oil (the original recipe suggested 3 tablespoons; in a tiny skillet, I used closer to 2) in a small skillet over medium heat. Once hot, fry each patty until golden and crispy, about two minutes per side. It’s going to get melty (I’m not sorry) and seem pesky to flip once warm. I found using two forks made this easy-peasy. Briefly pause the crouton on paper towels to drain excess oil, before landing it on top of your salad of choice, then finish the whole thing with freshly ground black pepper. Repeat with remaining croutons. Eat at once. ", 
            "* Gouda, a Dutch cheese, is traditionally made with cow’s milk. You can buy it young (smooth, semi-firm and mild flavored), or aged (harder, darker, stronger-flavored with crunchy flecks), smoked, light, and even more ways. However, if you can find the goat milk gouda suggested here, perfect for goat cheese-phobes, it’s really amazing in these croutons, absolutely worth swinging by a cheese shop or grocery store with a great cheese counter for. (It’s also sold online from a variety of stores.) If you cannot get it, you could replace the gouda with another semi-firm cheese good for grating and melting, like a young cow’s milk gouda, gruyere, etc.", 
            "** If you can’t find or don’t want to buy Panko, here’s how I fake it: Preheat oven to 350 degrees. Tear one to two slices of soft, crustless white bread into 1-inch pieces and pulse them in the food processor until coarsely ground. This will make a generous half cup. Transfer crumbs to a rimmed baking sheet and bake until just barely golden brown and dry, about 15 minutes, stirring occasionally. Cool. Use."
        ], 
        "date": "2012-05-11T14:13:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound very large (16 to 20 per pound) shrimp, peeled, de-veined, and rinsed, shells reserved", 
            "1 teaspoon salt", 
            "1 cup dry white wine", 
            "4 peppercorns", 
            "5 coriander seeds", 
            "1/2 bay leaf", 
            "5 sprigs fresh parsley", 
            "1 sprig fresh tarragon", 
            "1teaspoon juice from 1 small lemon", 
            "1 cup ketchup", 
            "2 1/2 teaspoons prepared horseradish (I believed we used slightly more)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "1 teaspoon ancho or other mild chili powder", 
            "Pinch cayenne pepper", 
            "1 tablespoon juice from 1 small lemon", 
            "3 tablespoons good olive oil", 
            "1 small French bread or boule, cut into 1-inch cubes (6 cups)", 
            "1 teaspoon kosher salt", 
            "2 large ripe tomatoes, cut into 1-inch cubes", 
            "1 hothouse cucumber, unpeeled, seeded, and sliced 1/2 inch thick", 
            "1 red bell pepper, seeded and cut into 1-inch cubes", 
            "1 yellow bell pepper, seeded and cut into 1-inch cubes", 
            "1/2 red onion, cut in half and thinly sliced", 
            "20 large basil leaves, coarsely chopped", 
            "3 tablespoons capers, drained", 
            "1 lemon", 
            "4 small\tartichokes", 
            "2/3 cup\theavy cream", 
            "1 teaspoon garlic, finely chopped (about 1 medium clove)", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon ground white pepper", 
            "2 tablespoons olive oil", 
            "6 medium Yukon Gold potatoes", 
            "4 ounces Asiago cheese, grated (I used cave-aged Gruyere, because it’s my favorite)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/when-the-stars-make-you-drool1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Artichokes", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Seafood", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2006/11/when-the-stars-make-you-drool/", 
        "title": "shrimp cocktail + artichoke-potato gratin", 
        "directions": [
            "1.\tBring reserved shells, 3 cups water and salt to boil in medium saucepan over medium-high head; reduced heat to low; cover, and simmer until fragrant, about 20 minutes. Strain stock through sieve, pressing on shells to extract all liquid.", 
            "2.\tBring stock and remaining ingredients except shrimp to boil in 3- or 4-quart saucepan over high heat; boil 2 minutes. Turn off heat and stir in shrimp; cover and let stand until firm and pink, 8 to 10 minutes. Drain shrimp, reserving stock for another use. Plunge shrimp into ice water to stop coking, then draining again. Serve shrimp chilled with cocktail sauce.", 
            "1. Heat the oil in a large saute pan. Add the bread and salt; cook over low to medium heat, tossing frequently, for 10 minutes, or until nicely browned. Add more oil as needed.", 
            "2. For the vinaigrette, whisk together the ingredients.", 
            "3. In a large bowl, mix the tomatoes, cucumber, red pepper, yellow pepper, red onion, basil, and capers. Add the bread cubes and toss with the vinaigrette. Season liberally with salt and pepper.", 
            "4. Serve immediately, or allow the salad to sit for about half an hour for the flavors to blend."
        ], 
        "date": "2006-11-06T17:25:43+00:00"
    }, 
    {
        "ingredient_list": [
            "6 ounces (1 1/2 cups coarsely grated) sharp cheddar, orange if you can find one you like", 
            "4 tablespoons (2 ounces or 57 grams) butter", 
            "1/2 cup (2 1/2 ounces or 62 grams) whole wheat flour", 
            "1/4 cup (1 1/8 ounces or 31 grams) all-purpose flour", 
            "1/8 teaspoon onion powder", 
            "1/8 to 1/4 teaspoon table salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/03/whole-wheat-goldfish-crackers.jpg?w=750", 
        "tags": [
            "Cheese", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2011/03/whole-wheat-goldfish-crackers/", 
        "title": "whole wheat goldfish crackers", 
        "directions": [
            "Preheat oven to 350°F. Combine all ingredients in a food processor, running the machine until the dough forms a ball, about two minutes.", 
            "If the dough feels warm or worrisome-ly soft, wrap it in waxed paper or plastic wrap and chill it in the fridge for 30 to 45 minutes. This also makes it easier to transfer shapes once they are rolled out.", 
            "On a lightly floured surface, using a lightly floured rolling pin, roll the dough out 1/8-inch thick. Form shapes with a cookie cutter, dipping it in flour from time to time to ensure a clean cut. Gently transfer crackers to an ungreased (though mine were parchment-lined, because they are in despicable shape) cookie sheet with a 1/2 inch between them. Bake the crackers on the middle rack for 12 to 15 minutes, or until they are barely browned at the edges. Remove from the oven and set the cookie sheet on a rack to cool.", 
            "Tiny Goldfish Cookie Cutter: I bought mine here."
        ], 
        "date": "2011-03-03T15:53:44+00:00"
    }, 
    {
        "ingredient_list": [
            "Pâté", 
            "1 ounce dried porcini or cepe mushrooms", 
            "1 cup boiling water", 
            "1/4 cup olive oil", 
            "3 tablespoons butter, divided", 
            "1 1/2 cups diced yellow onion or a combination of chopped onions and shallots (I used 1 cup onion, 1/2 cup shallots)", 
            "Coarse salt and freshly ground black pepper to taste", 
            "1 1/2 pounds mixed fresh mushrooms, any tough stems discarded and roughly chopped", 
            "1 teaspoon fresh thyme leaves (use half if dry)", 
            "1/4 cup Madeira, Marsala or sherry, or 1/2 cup white wine", 
            "To serve", 
            "Crackers or matzo, sieved hard-boiled egg, chopped flat-leaf parsley and/or chives, small pickles or cornichons, additional caramelized onions or pickled shallots or red onions (recipe below) "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/wild-mushroom-pc3a2tc3a91.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Passover", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/03/wild-mushroom-pate/", 
        "title": "wild mushroom pâté", 
        "directions": [
            "Combine dried mushrooms and boiling water in a small bowl and let soak for 30 minutes. Remove mushrooms, finely chop and set aside. Strain soaking liquid through a paper towel or coffee filter to remove any grit and set it aside.", 
            "Heat olive oil and 2 tablespoons butter over medium-high heat. Add onions and shallots, if using, and cook for 7 to 8 minutes, until they brown at the edges. Raise heat to high and add fresh mushrooms, thyme, salt and pepper. Cook, sauteeing, until mushrooms brown further and release their liquid. Cook until all of the liquid has evaporated, then add Madeira, Marsala, sherry or wine and do the same. Add rehydrated mushrooms and their soaking liquid, and cook this almost completely off. No liquid should run into the center if you drag your spoon through the mushrooms, clearing a path. Adjust seasonings to taste — seasoning is everything here — then stir in last tablespoon of butter. ", 
            "Let mixture cool to lukewarm, then blend in a food processor or blender until desired consistency — I like mine almost but not completely smooth, although pâté is traditionally very smooth. Let chill in fridge for a few hours before serving, giving the flavors a chance to settle. Pâté keep in fridge for 5 days, in an airtight container.", 
            "Serve with crackers and garnishes of your choice. To make an egg “mimosa”, peel a fully cooled hard-boiled egg. I like to cut mine into quarters and press each quarter, yolk side down, through a fine-mesh sieve until the flecks of egg fall decoratively on top. To pickle red onions or shallots, combine 1/4 cup red wine vinegar, 1/4 cup cold water, 1 tablespoon kosher salt and 1 tablespoon granulated sugar in a jar. Add thinly sliced onion or shallot and cover with lid; let pickle in fridge ideally for at least an hour. Pickled onions will keep for two weeks in the fridge."
        ], 
        "date": "2015-03-31T12:02:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (about 2 medium) zucchini", 
            "1 teaspoon coarse or Kosher salt, plus extra to taste", 
            "2 scallions, split lengthwise and sliced thin", 
            "1 large egg, lightly beaten", 
            "Freshly ground black pepper", 
            "1/2 cup all-purpose flour", 
            "1/2 teaspoon baking powder", 
            "Olive or another oil of your choice, for frying", 
            "To serve (optional)", 
            "1 cup sour cream or plain, full-fat yogurt", 
            "1 to 2 tablespoon lemon juice", 
            "1/4 teaspoon lemon zest", 
            "Pinches of salt", 
            "1 small minced or crushed clove of garlic"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/08/zucchini-fritters.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Pancakes", 
            "Photo", 
            "Put An Egg On It", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2011/08/zucchini-fritters/", 
        "title": "zucchini fritters", 
        "directions": [
            "Preheat oven to 200 degrees. Have a baking sheet ready.", 
            "Trim ends off zucchini and grate them either on the large holes of a box grater or, if you have one, using the shredding blade of a food processor. The latter is my favorite as I’m convinced it creates the coarsest and most rope-like strands and frankly, I like my fritters to look like mops.", 
            "In a large bowl, toss zucchini with 1 teaspoon coarse salt and set aside for 10 minutes. Wring out the zucchini in one of the following ways: pressing it against the holes of a colander with a wooden spoon to extract the water, squeezing out small handfuls at a time, or wrapping it up in a clean dishtowel or piece of cheese cloth and wringing away. You’ll be shocked (I was!) by the amount of liquid you’ll lose, but this is a good thing as it will save the fritters from sogginess.", 
            "Return deflated mass of zucchini shreds to bowl. Taste and if you think it could benefit from more salt (most rinses down the drain), add a little bit more; we found 1/4 teaspoon more just right. Stir in scallions, egg and some freshly ground black pepper. In a tiny dish, stir together flour and baking powder, then stir the mixture into the zucchini batter.", 
            "In a large heavy skillet — cast iron is dreamy here — heat 2 tablespoons of oil over medium-high heat until shimmering. Drop small bunches of the zucchini mixture onto the skillet only a few at a time so they don’t become crowded and lightly nudge them flatter with the back of your spatula. Cook the fritters over moderately high heat until the edges underneath are golden, about 3 to 4 minutes. If you find this happening too quickly,  reduce the heat to medium. Flip the fritters and fry them on the other side until browned underneath again, about 2 to 3 minutes more. Drain briefly on paper towels then transfer to baking sheet and then into the warm oven until needed. Repeat process, keeping the pan well-oiled, with remaining batter. I like to make sure that the fritters have at least 10 minutes in the oven to finish setting and getting extra crisp.", 
            "For the topping, if using, stir together the sour cream, lemon juice, zest, salt and garlic and adjust the flavors to your taste. Dollop on each fritter before serving. These fritters are also delicious with a poached or fried egg on top, trust me.", 
            "Do ahead: These fritters keep well, either chilled in the fridge for the better part of a week and or frozen in a well-sealed package for months. When you’re ready to use them, simply spread them out on a tray in a 325 degree oven until they’re hot and crisp again."
        ], 
        "date": "2011-08-25T15:47:52+00:00"
    }
]