{
  "date": "2017-02-16T13:08:33+00:00",
  "directions": [
    "Make the glaze: Combine glaze ingredients in a small saucepan, and simmer, whisking constantly, for 2 minutes until and glaze is satiny smooth. Set aside.\nPrepare the meatloaves: Heat your oven to 350 degrees F. Lightly coat 2 9×13-inch baking dishes with nonstick spray or oil. Tear the bread into chunks and then blend it, in a food processor, into breadcrumbs. Place the breadcrumbs in a large bowl. You should have about 1 cup.\nAdd the onion, garlic, celery, and carrot to the food processor, and pulse it until they are finely chopped. Heat a large skillet over medium heat. Once the skillet is hot, coat the bottom with olive oil, and heat the oil for a minute; add the finely chopped vegetables. Season with salt and pepper, and cook, stirring frequently, until they begin to brown, about 10 minutes.\nAdd the vegetables to the large bowl with breadcrumbs, then add the remaining ingredients. Stir the ingredients together with a fork or your hands until evenly blended.\nPause for a moment to start mashed potatoes: Place the potatoes in a medium pot, and cover with a couple inches of cold water. Bring to a boil over high heat, and once it’s boiling, reduce the heat to a simmer. Cook for about 20 minutes once the simmering begins; the potatoes are ready when a paring knife or fork can be inserted into the center with little resistance. Drain potatoes, then wipe the pot dry.",
    "Resume your meatloaves while the potatoes boil: Form the meatloaf mixture into twelve 3-inch meatballs; each will weigh about 4 ounces. Arrange 6 in each prepared baking pan, evenly. Drizzle or brush each meatball with a teaspoon or so of the tomato glaze you made earlier, and bake until cooked through, about 20 to 25 minutes (an instant-read thermometer inserted into the center of a cooked meatball will register 160 to 165F).\nFinish mashed potatoes: As soon as you can hold them (I use potholders), peel your potatoes. The skins should come right off with a paring knife. Run the potatoes through a potato ricer or mash them with a masher until smooth. In your empty potato pot, melt butter over medium heat and continue cooking once it has melted, stirring almost constantly, until brown bits form around edge and bottom and it smells nutty. Pour the hot butter and any browned bits over the potatoes. Add buttermilk to pot and warm it gently (so it doesn’t cool down your potatoes when you add it). Pour this over the potatoes too. Add salt and pepper and stir to combine.\nTo serve: Place a dollop of potatoes in the bottom of a plate or shallow bowl. Top with a meatloaf. Garnish with extra chopped parsley, if desired.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/tomato-glazed-meatloaves-with-brown-butter-mashed-potatoes.jpg?w=750",
  "ingredient_list": [
    "4 teaspoons vegetable oil",
    "1/4 cup (60 grams) tomato paste",
    "2 tablespoons cider vinegar",
    "2 teaspoons honey",
    "2 teaspoons Worcestershire sauce",
    "2 teaspoons smooth dijon mustard",
    "1/4 teaspoon table salt",
    "2 slices sandwich bread",
    "1/2 medium onion, roughly chopped",
    "1 garlic clove, chopped",
    "1 medium stalk celery, roughly chopped",
    "1 medium carrot, roughly chopped",
    "Olive oil, for cooking",
    "1 teaspoon fine sea or table table salt, plus more for vegetables",
    "Freshly ground black pepper",
    "2 pounds ground beef",
    "2 large eggs",
    "1 tablespoon tomato paste",
    "1 teaspoon dijon mustard",
    "1 teaspoon smoked paprika",
    "2 tablespoons Worcestershire sauce",
    "1/4 cup chopped fresh flat-leaf parsley",
    "1/2 cup (120 grams) milk",
    "2 pounds (905 grams) yukon gold potatoes (about 6)",
    "8 tablespoons (4 ounces or 115 grams) unsalted butter",
    "1 cup (235 ml) buttermilk",
    "1 teaspoon fine sea or table salt",
    "Finely ground black pepper"
  ],
  "tags": [
    "Beef",
    "Freezer Friendly",
    "Meat",
    "Photo",
    "Potatoes",
    "Winter"
  ],
  "title": "tomato-glazed meatloaves with brown butter mashed potatoes",
  "url": "https://smittenkitchen.com/2017/02/tomato-glazed-meatloaves-with-brown-butter-mashed-potatoes/"
}