{
  "date": "2016-12-05T13:02:12+00:00",
  "directions": [
    "To coat almonds in caramel: Line a large baking sheet with parchment paper or a silicone baking mat. Set aside. Have potholders handy, either on your hands or close by; you don’t want your skin anywhere near melted sugar.\nIn a heavy-bottomed 3 to 4-quart saucepan, bring sugar and water to a simmer. Add almonds and stir to coat them in the syrup.\nVery brief instructions: You are going to simmer the almonds in the sugar syrup over medium heat until it caramelizes.\nDetailed instructions/descriptions: As the water evaporates in the sugar syrup, it will become thicker and soap-like bubbles will form. Once the liquid has fully evaporated, it will become sandy and you will think something has gone wrong; it has not. Continue stirring and the sandiness will dissolve into a bronzed but clear liquid; this is the caramel. At this point, you can remove the pan from the heat and the residual heat in the pot should be enough to finish melting the sugar again as you continue stirring. Should it not be melting, however, just put it back over the flame for 20 to 30 seconds while you stir. Repeat as needed. In a couple minutes, the melted sugar will coat the almonds completely.\nStir in salt and spread almonds in a single layer on prepared sheet, separating them as much as possible.\nSet in freezer — or, outside, if it’s really cold — for a few minutes until cold and hard. This will take all of 5 minutes in the freezer. Break caramel into individual nuts; don’t worry about rough edges.\nYou can go ahead and use this parchment or baking mat-covered tray again. Place cocoa, sugars, sprinkles and any other coatings in individual bowls. Have a few forks around to help roll the almonds through it.\nTo coat caramelized almonds in chocolate: Melt chocolate 3/4 of the way in a large bowl, then stir to let it melt the rest of the way using the residual heat in the bowl.\nPour caramel-coating almonds into melted chocolate and stir several times to coat evenly. Use forks to pluck almonds one by one out of chocolate bowl and drop into coating of choice. Roll almonds until coated and spread out to set on prepared baking sheet. Repeat with remaining almonds.\nOnce again, you can set these quickly in the freezer (or outside, on a very cold day), this time give it 10 to 15 minutes.\nTo finish/pack up: Once almonds are set, they’re ready to be boxed or bagged. These keep months at room temperature.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/12/chocolate-caramel-crunch-almonds.jpg?w=750",
  "ingredient_list": [
    "1 cup (200 grams) granulated sugar",
    "1/2 cup (120 grams) water",
    "1 1/2 cup (205 grams or 7 1/4 ounces) whole almonds",
    "1/2 teaspoon flaky salt",
    "8 ounces (225 grams) semi- or bittersweet chocolate, chopped, or 1 1/3 cups chocolate chips",
    "Approximately 1/2 cup cocoa powder, sanding or coarse sugar or sprinkles to coat"
  ],
  "tags": [
    "Candy",
    "Chocolate",
    "Gift Guides",
    "Photo"
  ],
  "title": "chocolate caramel crunch almonds + new kitchen favorites",
  "url": "https://smittenkitchen.com/2016/12/chocolate-caramel-crunch-almonds-new-kitchen-favorites/"
}