{
  "date": "2009-06-07T09:05:15+00:00",
  "directions": [
    "Oil bottom and sides of a 13- by 9- by 2-inch rectangular metal baking pan and dust bottom and sides with some confectioners’ sugar.",
    "In bowl of a standing electric mixer or in a large bowl sprinkle gelatin over 1/2 cup cold cold water, and let stand to soften.",
    "In a 3-quart heavy saucepan cook granulated sugar, corn syrup, second 1/2 cup of cold water, and salt over low heat, stirring with a wooden spoon, until sugar is dissolved. Increase heat to moderate and boil mixture, without stirring, until a candy or digital thermometer registers 240°F, about 12 minutes. Remove pan from heat and pour sugar mixture over gelatin mixture, stirring until gelatin is dissolved.",
    "With standing or a hand-held electric mixer beat mixture on high speed until white, thick, and nearly tripled in volume, about six minutes if using standing mixer or about 10 minutes if using hand-held mixer. (Some reviewers felt this took even longer with a hand mixer, but still eventually whipped up nicely.)",
    "In separate medium bowl with cleaned beaters beat egg whites (or reconstituted powdered whites) until they just hold stiff peaks. Beat whites and vanilla (or your choice of flavoring) into sugar mixture until just combined. Pour mixture into baking pan and don’t fret if you don’t get it all out (learning from my mess of a first round). Sift 1/4 cup confectioners sugar evenly over top. Chill marshmallow, uncovered, until firm, at least three hours, and up to one day.",
    "Run a thin knife around edges of pan and invert pan onto a large cutting board. Lifting up one corner of inverted pan, with fingers loosen marshmallow and ease onto cutting board. With a large knife trim edges of marshmallow and cut marshmallow into roughly one-inch cubes. (An oiled pizza cutter works well here too.) Sift remaining confectioners’ sugar back into your now-empty baking pan, and roll the marshmallows through it, on all six sides, before shaking off the excess and packing them away.",
    "Do ahead: Marshmallows keep in an airtight container at cool room temperature 1 week."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/springy-fluffy-marshmallows1.jpg?w=500",
  "ingredient_list": [],
  "tags": [
    "Candy",
    "Photo"
  ],
  "title": "springy, fluffy marshmallows",
  "url": "https://smittenkitchen.com/2009/06/springy-fluffy-marshmallows/"
}