{
  "date": "2013-08-01T11:46:05+00:00",
  "directions": [
    "To char corn: Shuck your corn but leave the “stem” on if you can; it makes a great handle. Remove small children from the area. Over a hot grill or an open gas-stove flame, char the corn until well-blackened but not completely burnt. It tends to snap, crackle and yes, pop a little making terrifying noises (hence, the removal of small people) but will smell amazing (like popcorn and fireplaces and summer camp). Remove cob from heat, and when cool enough to handle, shave off kernels using a large knife. You should have about 1 cup kernels. Transfer to a bowl and pour melted butter over it; let cool to lukewarm.",
    "Make crepe batter: Place corn-butter mixture in a blender with flour, milk, eggs and salt. Blend until mostly smooth (a few bits and coarse piece of corn are awesome but too many will make the batter hard to pour and spread in the pan). Cover and refrigerate for 1 hour or two days; this resting time really, really makes it easier to make crepes that don’t fall apart.",
    "Cook crepes: Heat an 8- to 9-inch skillet (nonstick makes things even easier here) over medium heat. Coat very lightly with butter or oil. Pour 3 (for an 8-inch skillet) to 4 tablespoons (for a larger size) batter into the center of the skillet and roll it around so that it evenly coats the bottom. Cook until edges appear lightly brown, then flip the crepe* and cook it on the reverse side for another 30 seconds.",
    "Slide crepe onto a paper towel-coated plate or counter. Repeat with remaining crepe batter, re-buttering pan as needed. Cooling crepes can overlap on the towels. Cooled crepes can be stacked and will not stick to each other.",
    "Mexican Street Corn Crepe Stack: I spread about 1 teaspoon mayonnaise (which is very scant and you can definitely use more; use yogurt or sour cream if you dislike mayo) between each crepe, then sprinkled about 2 teaspoons crumbled cotija cheese (but you can use ricotta salata, feta or another crumbly salty cheese if you cannot find it), a couple shakes of chili powder and a small amount of chopped cilantro (but you can use flat-leaf parsley if you’re not into cilantro). The toppings add up quickly as you stack the crepes, so don’t be afraid to go easy on them; you’ll still get a full amount of topping with each bite. Serve with lime wedges, squeezing some lime juice over each wedge.",
    "* Flipping crepes is scary! Here are some tips: 1. Crepes fall apart quite easily when they’re pale and undercooked. The ones with slightly more brown spots are easier to flip, for the same reason that toast is firmer than fresh bread. As you get more confident, you can aim for paler crepes. 2. I use a weird, need-to-show-with-a-video-one-day two spatula flipping technique, usually use one offset frosting spatula (I have this one) and one flexible fish spatula (I have this one and is one of my most favorite kitchen tools, ever, the only thing I use for 99% lifting/turning kitchen tasks). I use the smaller one to get underneath the crepe enough that I can lift it enough that I can slide the larger one far underneath it, making flipping it a cinch. I promise. Once you get the hang of it, you’ll be a crepe-making junkie like me."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/charred-corn-crepes1.jpg?w=500",
  "ingredient_list": [
    "1 large fresh corn cob",
    "2 tablespoons butter, melted",
    "1/2 cup flour",
    "1 cup milk, any fat level will do",
    "2 large eggs",
    "1/2 teaspoon table salt",
    "Butter or oil for pan"
  ],
  "tags": [
    "Corn",
    "Pancakes",
    "Photo",
    "Summer",
    "Tex-Mex",
    "Vegetarian"
  ],
  "title": "charred corn crepes",
  "url": "https://smittenkitchen.com/2013/08/charred-corn-crepes/"
}