{
  "date": "2014-09-03T11:00:41+00:00",
  "directions": [
    "Generously butter a 3-quart baking dish (a lasagna or 9×13-inch pan works well here too). Toss corn and scallions together in a medium bowl. Combine cheeses in another bowl. In a large bowl, gently beat eggs and mayo together, then whisk in milk, salt and lots (or, if measuring, 1/2 teaspoon) of freshly ground black pepper. Spread one-third of bread cubes in prepared baking dish — it will not fully cover bottom of dish; this is fine. Add one-third of corn, then cheese mixture. Repeat layering twice with remaining bread, corn and cheese. Pour egg mixture evenly over strata. Cover with plastic wrap and refrigerate for at least 8 hours or up to 1 day.",
    "When ready to bake, heat oven to 350 degrees F. Bake strata, uncovered, until puffed, golden brown and cooked through, about 45 to 55 minutes. Let stand 5 minutes before serving. ",
    "Do ahead: Strata keeps baked in the fridge for 4 days or longer in the freezer, wrapped well. It reheats wonderfully, either from the fridge or freezer and holds up well in lunch boxes."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/corn-cheddar-and-scallion-strata1.jpg?w=640",
  "ingredient_list": [
    "1 tablespoon butter",
    "3 cups fresh corn (cut from 3 small-to-average cobs)",
    "1 1/2 cup thinly sliced scallions (both white and green parts from a 4-ounce bundle)",
    "8 cups whole wheat, country or French bread in 1-inch cubes (weight will vary from 10 to 14 ounces, depending on bread type)",
    "2 cups (6 ounces) coarsely grated sharp cheddar",
    "1 cup (2 ounces) finely grated parmesan",
    "9 large eggs",
    "2 tablespoons mayonnaise (optional, see Note up top)",
    "2 3/4 cups milk",
    "1 teaspoon table salt or 2 teaspoons of a coarse sea salt",
    "Freshly ground black pepper"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Casserole",
    "Corn",
    "Eggs",
    "Freezer Friendly",
    "Lunch",
    "Photo",
    "Summer",
    "Vegetarian"
  ],
  "title": "corn, cheddar and scallion strata",
  "url": "https://smittenkitchen.com/2014/09/corn-cheddar-and-scallion-strata/"
}