{
  "date": "2015-04-13T12:05:48+00:00",
  "directions": [
    "Cook frozen artichokes on the stove artichokes in simmering water until firm-tender, which took 4 to 5 minutes for the brand I used. Drain well in a colander, then spread out on layers of paper towels and do you best to press all of the water out. You can keep them on towels while you prepare the other ingredients.",
    "Cover diced potatoes with in inch of cold water and a few pinches of salt (using the same pot as the artichokes, because doing dishes is the worst) and set a timer for 8 minutes. Bring to a simmer and cook until potatoes are tender but not falling apart, usually about the allotted 8 minutes but go by texture, not timer. Drain potatoes, wipe out pot, and put cream, garlic, lemon zest, salt and pepper back in. Bring to a simmer and cook for one minute, stirring because this will be a tiny amount in a bigger pot. Add drained potatoes and cook together for 1 to 2 minutes more. ",
    "Chop drained and patted dry artichokes into bite-sized (about 1/2-inch) chunks and place in a large bowl. Season with salt and lemon juice to taste. Add potato-cream mixture and 3/4 cup grated cheese and stir to combine. Taste for seasoning and adjust salt and pepper if needed (will probably be needed). Add up to 2 extra tablespoons heavy cream if the mixture seems a little dry. ",
    "Heat the broiler on your oven, or simply your oven itself to 450°F. Arrange slices of bread on a foil-lined tray (for easy clean up) and heap artichoke-potato mixture evenly over slices. Sprinkle with reserved cheese, and bake or broil until browned and melty, anywhere from 5 minutes under a good broiler to 10 to 15 minutes in a less-intense oven. Eat hot and repeat again tomorrow."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/16947742118_f951543925_k.jpg?w=751",
  "ingredient_list": [
    "2 cups cooked, drained and chopped artichoke hearts (will start as 3 cups from a 12-ounce frozen bag, prep directions below)",
    "1 medium (about 6 ounces) Yukon gold potato, peeled and diced very small (1/4 to 1/2-inch pieces)",
    "1/4 cup heavy cream, plus up to 2 tablespoons more to taste",
    "1 small clove garlic, minced",
    "Kosher salt and freshly ground black pepper",
    "Few gratings of lemon zest",
    "Juice of half a lemon",
    "1 cup (2 1/2 ounces) finely grated aged Asiago cheese, though Parmesan or Pecorino should work well here too",
    "6 slices hearty bread, your favorite kind (see Note up top for mine)",
    "Parsley to garnish"
  ],
  "tags": [
    "Artichokes",
    "Photo",
    "Potatoes",
    "Spring",
    "Vegetarian"
  ],
  "title": "artichoke gratin toasts",
  "url": "https://smittenkitchen.com/2015/04/artichoke-gratin-toasts/"
}