{
  "date": "2014-11-06T12:06:14+00:00",
  "directions": [
    "Make the cake: Pit and roughly chop dates and place them in a heatproof bowl. Pour boiling water over them and stir in the baking soda. Cover the bowl and set it aside for 30 minutes.",
    "Meanwhile, heat oven to 350°F (175°C). Butter a 9×13-inch baking pan. As an extra precaution, if you’re nervous about sticking (although this cake should not), you can line the bottom with a fitted rectangle of parchment paper.",
    "Blend date-water mixture in a blender or food processor until smooth. In a large bowl, combine the melted butter and sugars. Whisk in eggs, then salt. Stir in the flour, then date puree. Pour the batter into the prepared pan and bake for 25 to 30 minutes, until a toothpick inserted into the center comes out clean. ",
    "To serve it rustic-style, as we did, let it cool in the pan on a cooling rack. If you’d like to transfer it later to a serving plate, let cool in the pan for 20 minutes, then flip it out onto a cooling rack, removing the parchment paper if you used it.",
    "Make the sauce: Combine butter, cream, sugar and vanilla in a larger saucepan than you think you’ll need (I vote for 2 1/2 to 3 quarts) over medium heat and bring to a simmer. Whisk for about 10 minutes, until the mixture thickens slightly. ",
    "To serve: Cut the cake into squares (still warm is just fine). Drizzle each slice with toffee sauce, a pinch of sea salt, and top with a dollop of whipped cream, if desired. If your mint plant has survived the fall better than mine has, a leaf or two would be lovely here, too."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/date-cake-with-toffee-sauce-31.jpg?w=640",
  "ingredient_list": [
    "Cake",
    "3/4 pound (12 ounces, 340 grams or about 2 1/4 cups) dried dates",
    "2 1/4 cups (530 ml) boiling water",
    "1 1/2 teaspoons baking soda",
    "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted",
    "3/4 cup (150 grams) granulated sugar",
    "2 tablespoons (25 grams) light or dark brown sugar",
    "2 large eggs",
    "1/4 teaspoon fine sea or table salt",
    "1 2/3 cups (210 grams) all-purpose flour",
    "Sauce",
    "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted",
    "1 cup (235 ml) heavy or whipping cream",
    "1 cup plus 2 tablespoons (215 grams) brown sugar (light is called for, but I’d like to use dark next time)",
    "2 teaspoons vanilla extract",
    "To serve",
    "Unsweetened whipped cream (optional, but please don’t skip it)",
    "A few flakes of sea salt",
    "Fresh mint leaves (optional)"
  ],
  "tags": [
    "Cake",
    "Christmas",
    "Dates",
    "English",
    "Everyday Cakes",
    "Photo",
    "Thanksgiving",
    "Winter"
  ],
  "title": "sticky toffee pudding",
  "url": "https://smittenkitchen.com/2014/11/date-cake-with-toffee-sauce/"
}