{
  "date": "2015-10-30T12:01:58+00:00",
  "directions": [
    "Either grease a large cookie sheet or line it with parchment paper or a nonstick baking mat. Get all of your other ingredients ready; you’re going to need to add them quickly in a few minutes, and you won’t have time to hunt and measure.",
    "Combine sugar, corn or golden syrup and water in a medium saucepan, stirring just until sugar is wet. Attach a candy thermometer and heat over medium-high heat, without stirring, until mixture reaches between 300 and 305 degrees F. If you don’t have a candy thermometer, you’re looking for a small amount of the mixture dropped into cold water to separate into hard, brittle threads. This takes exactly 9 minutes on my stove. ",
    "Remove from heat and quickly stir in butter (until it melts), baking soda, peanuts and pretzels until all are coated. Pour quickly out onto prepared pan. Use a spatula or, even better, two forks to pull and stretch the mixture as flat as you can get it, working quickly. Sprinkle with chocolate chips and let rest for 5 minutes so that they soften. Once they are all soft, use a spatula to spread them over the brittle.",
    "None of us has time or patience for waiting for these to cool, right? I put them directly in the freezer for 20 minutes, after which point the chocolate is firm, the base is cold and I get to bash the brittle into bite-sized chunks. (I like to lift pieces up onto the rim of the baking sheet and use something heavy to break them from there. I do not advise breaking it up with your hands, the warmth of which will make a mushy mess of the chocolate.)",
    "Store in a container at room temperature, far out of your own reach."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/chocolate-peanut-and-pretzel-brittle1.jpg?w=750",
  "ingredient_list": [
    "1 cup granulated sugar",
    "2 tablespoons light corn syrup or golden syrup",
    "1/4 cup water",
    "2 tablespoons butter",
    "1/2 teaspoon baking soda",
    "3/4 cup broken-up chunks of thin salted pretzels",
    "3/4 cup roasted salted peanuts",
    "3/4 to 1 cup semisweet chocolate chips"
  ],
  "tags": [
    "Candy",
    "Chocolate",
    "Photo"
  ],
  "title": "chocolate peanut and pretzel brittle",
  "url": "https://smittenkitchen.com/2015/10/chocolate-peanut-and-pretzel-brittle/"
}