[
    {
        "ingredient_list": [
            "For the compote", 
            "1 pound strawberries, rinsed and hulled", 
            "1 pound rhubarb, trimmed", 
            "1 lemon", 
            "3/4 cup granulated sugar", 
            "For the almond cake", 
            "Butter and flour for the pan(s)", 
            "7 ounces almond paste", 
            "1/4 cup granulated sugar", 
            "4 ounces unsalted butter, cut into small pieces and chilled", 
            "2 tablespoons honey", 
            "3 large eggs", 
            "2 tablespoons amaretto, plus additional for brushing", 
            "1/3 cup all-purpose flour, sifted (we used matzo meal with success, though finely grinding it first would have been a better idea)", 
            "Kosher salt", 
            "1/3 to 1/2 cup sliced almonds, toasted", 
            "Confectioners’ sugar", 
            "3/4 cup crème fraîche, whipped to soft peaks     ", 
            "Make the compote", 
            "1. Select about 4 ounces of the smallest strawberries and cut lengthwise into quarters. These will be added raw to the cooked compote; set aside.", 
            "Make the cake", 
            "1. Preheat the oven to 350°F (175°C). Butter and flour four 4-by-1 3/4-inch-high miniature springform pans or butter and flour the bottom and sides of an 8-inch round cake pan. If using the 8-inch pan, line its bottom with a circle of parchment paper; this isn’t necessary with the small pans."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/almond-cake-with-strawberry-rhubarb-compote1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Easter", 
            "Everyday Cakes", 
            "Fruit", 
            "Passover", 
            "Photo", 
            "Rhubarb", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2008/04/almond-cake-with-strawberry-rhubarb-compote/", 
        "title": "almond cake with strawberry-rhubarb compote", 
        "directions": [
            "2. Place the almond paste and sugar in the bowl of a heavy-duty mixer fitted with the paddle attachment, or in another large bowl if using a handheld mixer. Begin to cream the mixture on low speed to break up the almond paste, then increase the speed to medium for about 2 minutes, or until the paste is broken into fine particles.", 
            "3. Add the butter and mix for 4 to 5 minutes, or until the mixture is light in color and airy; stop the machine and scrape down the sides as necessary. It is important to mix long enough or the cake will have a dense texture.", 
            "4. Mix in the honey, then add the eggs one at a time, beating until each one is fully incorporated before adding the next. Add the amaretto, flour, and a pinch of salt and mix just to combine.", 
            "5. Scrape the batter into the prepared pan(s) and smooth the top. Bake the small cakes for about 15 minutes, the large one for about 25 minutes, or until the cake is golden and springs back when pressed. Transfer to a rack to cool.", 
            "6. Unmold the small cakes or invert the large cake onto the rack, remove the parchment paper, and invert the cake again so that the top is once again facing upward. Brush the top of the cake(s) with amaretto and sprinkle with the toasted almonds. Dust with confectioners’ sugar. (The large and small cakes can be stored, well wrapped, at room temperature for up to 2 days.) To serve, cut the small cakes in half or the large cake into wedges. Serve with a dollop of whipped crème fraîche and the strawberry-rhubarb compote."
        ], 
        "date": "2008-04-21T16:27:14+00:00"
    }, 
    {
        "ingredient_list": [
            "8 ounces blanched almonds", 
            "1 3/4 cups confectioners’ sugar", 
            "1 tablespoon almond extract", 
            "4 tablespoons corn syrup "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/almond-joy1.jpg?w=500", 
        "tags": [
            "Candy", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/12/almond-joy/", 
        "title": "marzipan", 
        "directions": [
            "Grind the almonds in a food processor for about two minutes: it will first become crumbly, and the crumbs will get successively smaller until it is more of a fine powder. Keep it going through this stage, and when it nearly forms clumps, that’s when you’ve got it right. ", 
            "Add the confectioners’ sugar and almond extract, then the corn syrup, processing until well-combined.", 
            "Turn the mixture out onto a work surface and knead until it makes a smooth dough. If the dough seems too sticky, knead in a little more confectioners’ sugar. If it seems too dry, add more corn syrup. At this point, the dough can be tightly wrapped in foil and refrigerated until needed. "
        ], 
        "date": "2006-12-19T21:32:05+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "3/4 cup (75 grams or 2 1/2 to 2 3/4 ounces) sliced almonds, ideally toasted and cooled", 
            "1 tablespoon (10 grams) all purpose flour", 
            "A few pinches of sea salt", 
            "6 tablespoons (75 grams) plus 1 teaspoon (5 grams) granulated sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/2 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1/2 pound rhubarb", 
            "To finish", 
            "Powdered sugar or 1/4 cup jam of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/almond-rhubarb-picnic-bars-e14640188536441.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2016/05/almond-rhubarb-picnic-bars/", 
        "title": "almond rhubarb picnic bars", 
        "directions": [
            "Heat oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] ", 
            "Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind almonds, 6 tablespoons sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. ", 
            "Arrange the fruit: Trim rhubarb and cut it half horizontally top to bottom, i.e. like splitting a hamburger bun, with the flatter part on the bottom. [Update: Does this diagram help?] Keep tops and bottoms matched/stacked and cut stalks on the diagonal into about 1 1/4-inch lengths. The top and bottom of each segment should nicely “V” together, color side up, in a chevron pattern. If you mostly reach for the more green segments first and the pink-er segments second, you’ll end up with an ombré look on top. Sprinkle fruit with 1 teaspoon granulated sugar.", 
            "Bake the bars: For 45 to 55 minutes, until they’re golden on top and a toothpick inserted into the almond cream underneath comes out cream-free. The rhubarb pieces are going to move around a little as it bakes so don’t be surprised if the pattern looks a little different when it’s done. ", 
            "Let cool in pan on a rack, or in the fridge, or even in the freezer. You can decorate the bars with a little powdered sugar, or warm some jam and brush it over for a glossier finish. I find it easiest to get very clean cuts when the bars are very cold. A serrated knife, used gently, can ensure the rhubarb stays perfectly put if it’s not cold enough. While bars do not need to be refrigerated if it will just be a day or so, they keep longer and (I think) more nicely chilled."
        ], 
        "date": "2016-05-23T11:56:10+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups (945 ml) apple cider", 
            "1/2 teaspoon ground cinnamon", 
            "2 teaspoons flaky sea salt, such as Maldon, or less of a finer one", 
            "8 tablespoons (115 grams or 1 stick) unsalted butter, cut into chunks", 
            "1 cup (200 grams) granulated sugar", 
            "1/2 cup (110 grams) packed light brown sugar", 
            "1/3 cup (80 ml) heavy cream", 
            "Neutral oil for the knife"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-cider-caramels-the-book-is-here1.jpg?w=640", 
        "tags": [
            "Announcements", 
            "Candy", 
            "Cookbooks", 
            "Fall", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/10/apple-cider-caramels-the-book-is-here/", 
        "title": "apple cider caramels + the book is here!", 
        "directions": [
            "Boil the apple cider in a 3- to- 4- quart saucepan over high heat until it is reduced to a dark, thick syrup, between 1/3 and 1/2 cup in volume. This takes about 35 to 40 minutes on my stove. Stir occasionally.", 
            "Meanwhile, get your other ingredients in order, because you won’t have time to spare once the candy is cooking. Line the bottom and sides of an 8- inch straight- sided square metal baking pan with 2 long sheets of crisscrossed parchment. Set it aside. Stir the cinnamon and flaky salt together in a small dish.", 
            "Once you are finished reducing the apple cider, remove it from the heat and stir in the butter, sugars, and heavy cream. Return the pot to medium- high heat with a candy thermometer attached to the side, and let it boil until the thermometer reads 252 degrees, only about 5 minutes. Keep a close eye on it.", 
            "(Don’t have a candy or deep- fry thermometer? Have a bowl of very cold water ready, and cook the caramel until a tiny spoonful dropped into the water becomes firm, chewy, and able to be plied into a ball.)", 
            "Immediately remove caramel from heat, add the cinnamon- salt mixture, and give the caramel several stirs to distribute it evenly. Pour caramel into the prepared pan. Let it sit until cool and firm—about 2 hours, though it goes faster in the fridge. Once caramel is firm, use your parchment paper sling to transfer the block to a cutting board. Use a well- oiled knife, oiling it after each cut (trust me!), to cut the caramel into 1-by-1-inch squares. Wrap each one in a 4-inch square of waxed paper, twisting the sides to close. Caramels will be somewhat on the soft side at room temperature, and chewy/firm from the fridge.", 
            "Do ahead: Caramels keep, in an airtight container at room temperature, for two weeks, but really, good luck with that."
        ], 
        "date": "2012-10-31T09:43:22+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/01/apple-sharlotka.jpg?w=750", 
        "tags": [
            "Apple", 
            "Everyday Cakes", 
            "Photo", 
            "Russian"
        ], 
        "url": "https://smittenkitchen.com/2012/01/apple-sharlotka/", 
        "title": "apple sharlotka", 
        "directions": [
            "Preheat oven to 350 degrees. Line the bottom of a 9-inch springform pan with parchment paper. Butter the paper and the sides of the pan. Peel, halve and core your apples, then chop them into medium-sized chunks. (I cut each half into four “strips” then sliced them fairly thinly — about 1/4-inch — in the other direction.) Pile the cut apples directly in the prepared pan. Meanwhile, in a large bowl, using an electric mixer or whisk, beat eggs with sugar until thick and ribbons form on the surface of the beaten eggs. Beat in vanilla, then stir in flour with a spoon until just combined. The batter will be very thick.", 
            "Pour over apples in pan, using a spoon or spatula to spread the batter so that it covers all exposed apples. (Updated to clarify: Spread the batter and press it down into the apple pile. The top of the batter should end up level with the top of the apples.) Bake in preheated oven for 55 to 60 minutes, or until a tester comes out free of batter. Cool in pan for 10 minutes on rack, then flip out onto another rack, peel off the parchment paper, and flip it back onto a serving platter. Dust lightly with ground cinnamon.", 
            "Serve warm or cooled, dusted with powdered sugar. Alex’s family eats it plain, but imagine it would be delicious with a dollop of barely sweetened whipped or sour cream."
        ], 
        "date": "2012-01-06T15:05:00+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine ", 
            "Filling", 
            "3/4 cup (a scant 4 ounces or 110 grams) shelled unsalted pistachios", 
            "1 tablespoon (10 grams) all purpose flour", 
            "Few pinches of sea salt", 
            "6 tablespoons (75 grams) sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/4 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1 pound firm-ripe apricots", 
            "To finish", 
            "Powdered sugar or 1/4 cup apricot jam"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/apricot-pistachio-squares1.jpg?w=640", 
        "tags": [
            "Apricots", 
            "Bars", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/08/apricot-pistachio-squares/", 
        "title": "apricot pistachio squares", 
        "directions": [
            "Heat your oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (If you have an 8-inch square springform, you can skip this and just butter it well.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. Transfer the dough clumps to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "(Don’t have a food processor? You might have an easier time using softened butter and preparing this cookie-style: cream it with the sugar with a hand mixer, then spoon in the salt and flour, beating until just combined. It might help to chill this mixture a bit before pressing it into the pan, or it might feel too greasy to easily spread.)", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind your pistachios, sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. ", 
            "Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. Cut apricots in half (or, you might find that you can tear them open at the seams with your fingers) and remove pits. From here, you have a few decoration options: you can place the apricot halves in facedown or up all over the pistachio base. You can do as I did, which is cut them into strips, then slide each cut half onto a butter knife or offset spatula, tilt it so that it fans a little, and slide it onto your pistachio filling decoratively. (With this method, I ended up not using all of my apricots.) You could also arrange the strips like petals of flower around the pan, for maximum pretties.]]", 
            "Bake the bars for 60 minutes, or until they are golden and a toothpick inserted into the pistachio portion comes out batter-free. This might take up to 10 minutes longer depending on the juiciness of your apricots and the amount you were able to nestle in. Let cool completely in pan; you can hasten this along in the fridge. ", 
            "To finish, you can make a shiny glaze for your tart by warming the jam in a small saucepan until it thins, and brushing this mixture over the top of the cooled tart. Or, you can keep it rustic with just a dusting of powdered sugar, as I did. ", 
            "Cut bars into squares — chilled bars will give you the cleanest cuts. Keep leftover bars chilled. "
        ], 
        "date": "2014-08-07T12:18:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (4 sticks) unsalted butter, slightly softened", 
            "4 egg yolks", 
            "2 cups granulated sugar", 
            "4 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/4 teaspoon salt", 
            "Optional additions: 1 teaspoon vanilla extract or 1 teaspoon lemon zest", 
            "1 cup raspberry jam, at room temperature", 
            "1/4 cup confectioners’ sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/12/austrian-raspberry-shortbread.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/austrian-raspberry-shortbread/", 
        "title": "austrian raspberry shortbread", 
        "directions": [
            "Cream the butter in a mixer fitted with a paddle attachment (or using a hand mixer) until soft and fluffy. Add the egg yolks and mix well.", 
            "Mix the granulated sugar, flour, baking powder, and salt together. Add to the butter and egg yolk mixture and mix just until incorporated and the dough starts to come together. Turn the dough out onto a floured work surface and form into two balls. Wrap each ball in plastic wrap and freeze at least 2 hours or overnight (or as long as a month, if you like).", 
            "Heat the oven to 350 degrees.", 
            "Remove one ball of dough from the freezer and coarsely grate it by hand or with the grating disk in a food processor into the bottom of a 9×13-inch baking pan or a 10-inch tart pan with a removable bottom (oops, sorry, no). Make sure the surface is covered evenly with shreds of dough.", 
            "With a piping bag with a wide tip or a zip-lock bag with the corner cut off, squeeze the jam over the surface as evenly as possible, to within 1/2 inch of the edge all the way around. Remove the remaining dough from the freezer and coarsely grate it over the entire surface.", 
            "Bake until lightly golden brown and the center no longer wiggles, 50 to 60 minutes. As soon as the shortbread comes out of the oven, dust with confectioners’ sugar. ", 
            "Cool on a wire rack, then cut in the pan with a serrated knife. I find that for this an all bar cookies, chilling the pan in the fridge makes it a lot easier to get clean cuts. "
        ], 
        "date": "2007-12-19T09:00:32+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust: ", 
            "1 1/4 pounds unsalted butter, room temperature", 
            "3/4 cup granulated sugar", 
            "3 extra-large eggs", 
            "3/4 teaspoon pure vanilla extract", 
            "4 1/2 cups all-purpose flour", 
            "1/2 teaspoon baking powder", 
            "1/4 teaspoon salt ", 
            "Topping: ", 
            "1 pound unsalted butter", 
            "1 cup good honey", 
            "3 cups light brown sugar, packed", 
            "1 teaspoon grated lemon zest", 
            "1 teaspoon grated orange zest", 
            "1/4 cup heavy cream", 
            "2 pounds pecans, coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/aww-yeah-1017-grams-of-butter1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/12/aww-yeah-1017-grams-of-butter/", 
        "title": "pecan squares", 
        "directions": [
            "Preheat the oven to 350°F. ", 
            "For the crust: Beat the butter and granulated sugar in the bowl of an electric mixer fitted with a paddle attachment, until light, approximately 3 minutes. Add the eggs and the vanilla and mix well. Sift together the flour, baking powder, and salt. Mix the dry ingredients into the batter with the mixer on low speed until just combined. Press the dough evenly into an ungreased 18 by 12 by 1-inch baking sheet, making an edge around the outside. It will be very sticky; sprinkle the dough and your hands lightly with flour. Bake for 15 minutes, until the crust is set but not browned. Allow to cool. ", 
            "For the topping: Combine the butter, honey, brown sugar, and zests in a large, heavy-bottomed saucepan. Cook over low heat until the butter is melted, using a wooden spoon to stir. Raise the heat and boil for 3 minutes. Remove from the heat. Stir in the heavy cream and pecans. Pour over the crust, trying not to get the filling between the crust and the pan. Bake for 25 to 30 minutes, until the filling is set. Remove from the oven and allow to cool. Wrap in plastic wrap and refrigerate until cold. Cut into bars and serve."
        ], 
        "date": "2006-12-08T14:07:31+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "2 1/4 teaspoons (or 1 1/4-ounce package) instant yeast (not active dry) (also sold as rapid rise or bread machine yeast)", 
            "3/4 cup whole milk, ideally at room temperature", 
            "1/4 cup granulated sugar", 
            "2 cups all-purpose flour", 
            "3/4 teaspoon table salt", 
            "2 large eggs, ideally at room temperature", 
            "4 tablespoons unsalted butter, at room temperature", 
            "Honey-Almond-Crunch Topping", 
            "6 tablespoons unsalted butter, cold is fine", 
            "1/3 cup granulated sugar", 
            "3 tablespoons honey", 
            "2 tablespoons heavy cream", 
            "1 1/2 cups (4 3/4 ounces) sliced almonds", 
            "Two pinches of sea salt", 
            "Pastry Cream Filling", 
            "1 cup whole milk", 
            "Seeds from 1/4 to 1/2 vanilla bean, 1 teaspoon pure vanilla extract or 1/4 teaspoon almond extract", 
            "3 large egg yolks", 
            "1/4 cup granulated sugar", 
            "3 tablespoons all-purpose flour or cornstarch [updated]", 
            "2 pinches sea salt", 
            "2 tablespoons unsalted butter, cold is fine "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/bee-sting-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Everyday Cakes", 
            "German", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/04/bee-sting-cake/", 
        "title": "bee sting cake", 
        "directions": [
            "Make the cake: Combine all of the cake ingredients in a medium-sized mixing bowl, stirring till the mixture becomes cohesive, then stirring for two minutes more. In a stand mixer, you can mix this with the paddle attachment (no dough hook needed; batter is thin) at low-medium speed for 2 to 3 minutes. Scrape down sides, cover with plastic wrap and let rise in a draft-free place for 60 minutes, till it’s a little puffy. (It won’t fully double; this is fine.)", 
            "Butter a 9-inch round cake pan. Stir the batter a few times to deflate it slightly, then scrape it into the prepared pan and nudge it until it fills the bottom. Cover again with plastic wrap (don’t let it drape in and touch the top) and set aside for another 30 minutes. ", 
            "Meanwhile, make the honey-almond-crunch topping: In a small or medium saucepan over medium heat, heat the butter, sugar, honey, cream and salt until the butter is melted. Bring to a simmer and let it boil for 3 to 5 minutes, until the mixture becomes a shade darker (it should go from a yellowish tone to a light beige), stirring frequently. Stir in the almonds. You will probably panic because this mixture is going to get very thick — but don’t. Set it aside to cool slightly. ", 
            "Heat your oven to 350 degrees.", 
            "Once the cake has finished its second rise (again, it’s not going to rise a lot; don’t sweat it) use a small spoon to scoop out small amounts of the almond topping and distribute it over the top of the cake. It’s going to be a little pesky because it is firm, but I promise (see above: multiple photos of this process to ease your worry), even if it’s not perfectly evenly distributed, it will all smooth out gorgeously in the oven.", 
            "Bake cake on a foil-lined tray to catch any caramel drips, for 20 to 25 minutes, until top is bronzed and toothpick inserted into the center comes out batter-free. (Caramel on it is fine, and should be tasted.) Transfer to a cooling rack and let it sit in the pan for 10 minutes. After 10 minutes, run a knife along the outside of the cake, making sure no places are stuck and invert the cake onto the cooling rack. If you’re like me, you’ll be positive that all of the almonds will fall off, but shockingly, in five rounds, I only lost one or two. Reverse it back onto another rack to finish cooling, replacing any almonds that fell off right back on top. They’ll merge back with the caramel as it cools; nobody will know. ", 
            "Make pastry cream: Warm milk and vanilla bean scrapings (if using; if using an extract, don’t add yet) in a medium saucepan. Pour into a small bowl or cup, ideally with a spout. Set aside. Rinse saucepan with cool water, to rinse and cool; wipe to dry. Off the heat, whisk the yolks and sugar vigorously together for a minute, until pale and ribbony. Whisk in flour and salt until smooth. Drizzle in warm milk mixture, a spoonful at a time, whisking the whole time. Once you’ve add half of it, you can add the rest in a more steady stream, again whisking the whole time. Return the saucepan to the stove and cook on medium-high heat until it bubble, then simmer for one to two minutes, more whisking the whole time. Off the heat, whisk in the butter and any extracts you may be using. Cool custard completely before using, a process that can be sped up in the fridge or whisking it over a bowl over ice water. ", 
            "Finally, assemble the cake: Once both the cake and pastry cream are fully cooled, place the cake on a serving platter and divide it horizontally into two layers with a long serrated knife. Spread pastry cream over bottom half. Place top half on pastry cream. Serve in wedges; watch out for bees. Refrigerate any leftovers."
        ], 
        "date": "2013-04-17T11:40:10+00:00"
    }, 
    {
        "ingredient_list": [
            "7 ounces (200 grams) bittersweet chocolate (70 or 72%), roughly chopped", 
            "7 ounces (200 grams or 14 tablespoons) unsalted butter, cut into chunks", 
            "1 cup (200 grams) granulated sugar", 
            "1/4 teaspoon fine sea salt", 
            "4 large eggs", 
            "2 tablespoons plus 1 teaspoon (20 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/belgian-brownie-cakelets1.jpg?w=640", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/02/belgian-brownie-cakelets/", 
        "title": "belgian brownie cakelets", 
        "directions": [
            "Place chocolate and butter in a large heatproof bowl. Either over a saucepan of simmering water or in the microwave in 15- to 30-second bursts, stirring frequently, melt the two together. Off the heat, whisk in sugar, which should cool the mixture down significantly. Whisk in salt, then eggs, one at a time. Stir in flour. ", 
            "Cover bowl with plastic wrap and let sit at room temperature for 30 minutes. The batter will thicken a bit as it stands.", 
            "Heat oven to 325°F (165°C). ", 
            "Either coat a 12-cup muffin tin with nonstick spray or line it with cupcake papers. Spoon batter halfway into each cup and bake for 25 to 30 minutes (20 minutes in the mini-tart pans I show), or until a toothpick inserted into the center of cakelets comes out batter-free. (Fudgy crumbs are to be expected.) ", 
            "Let cool on a rack for 5 to 10 minutes before unmolding. Puffed tops will fall a little as they cool."
        ], 
        "date": "2016-02-11T11:59:48+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/big-crumb-coffee-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Rhubarb"
        ], 
        "url": "https://smittenkitchen.com/2008/02/big-crumb-coffee-cake/", 
        "title": "big crumb coffee cake", 
        "directions": [
            "1. Preheat oven to 325 degrees. Grease an 8-inch-square baking pan. For filling, slice rhubarb 1/2 inch thick and toss with sugar, cornstarch and ginger. Set aside.", 
            "2. To make crumbs in a large bowl, whisk sugars, spices and salt into melted butter until smooth. Then, add flour with a spatula or wooden spoon. It will look and feel like a solid dough. Leave it pressed together in the bottom of the bowl and set aside.", 
            "3. To prepare cake, in a small bowl, stir together the sour cream, egg, egg yolk and vanilla. Using a mixer fitted with paddle attachment, mix together flour, sugar, baking soda, baking powder and salt. Add butter and a spoonful of sour cream mixture and mix on medium speed until flour is moistened. Increase speed and beat for 30 seconds. Add remaining sour cream mixture in two batches, beating for 20 seconds after each addition, and scraping down the sides of bowl with a spatula. Scoop out about 1/2 cup batter and set aside.", 
            "4. Scrape remaining batter into prepared pan. Spoon rhubarb over batter. Dollop set-aside batter over rhubarb; it does not have to be even.", 
            "5. Using your fingers, break topping mixture into big crumbs, about 1/2 inch to 3/4 inch in size. They do not have to be uniform, but make sure most are around that size. Sprinkle over cake. Bake cake until a toothpick inserted into center comes out clean of batter (it might be moist from rhubarb), 45 to 55 minutes. Cool completely before serving.", 
            "Yield: 6 to 8 servings."
        ], 
        "date": "2008-02-29T17:28:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour", 
            "1 tablespoon baking powder", 
            "1/4 teaspoon salt", 
            "3 eggs, at room-temperature", 
            "4 ounces (1 stick) unsalted butter", 
            "3/4 cup sugar", 
            "3 pears, peeled, in a small dice (I used anjou, but would recommend a softer variety, like a bosc or any other of your favorites)", 
            "3/4 cup bittersweet chocolate chunks"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/bittersweet-chocolate-and-pear-cake1.jpg?w=500", 
        "tags": [
            "Brown Butter", 
            "Cake", 
            "Chocolate", 
            "Everyday Cakes", 
            "Fall", 
            "Fruit", 
            "Italian", 
            "Pear", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/01/bittersweet-chocolate-and-pear-cake/", 
        "title": "bittersweet chocolate and pear cake", 
        "directions": [
            "Preheat the oven to 350°F. Butter a 9-inch springform pan and dust with breadcrumbs (I cheated and used flour), set aside.", 
            "Sift the flour, baking powder and salt together, set aside.", 
            "Using a mixer fitted with the whisk attachment, whip the eggs on high speed until pale and very thick. (In a professional Kitchen Aid, it takes at least five minutes; on a home machine, it will take nine minutes to get sufficient volume)", 
            "While the eggs are whipping, brown the butter. Melt the butter in a medium saucepan (because it will foam a lot) and cook it until the butter browns and smells nutty (about 6 to 8 minutes). It helps to frequently scrape the solids off the bottom of the pan in the last couple minutes to ensure even browning. Remove from the flame but keep in a warm spot.", 
            "Add the sugar to the eggs and whip a few minutes more.", 
            "Just as the egg-sugar mixture is starting to lose volume, turn the mixture down to stir, and add the flour mixture and brown butter. Add one third of the flour mixture, then half of the butter, a third of the flour, the remaining butter, and the rest of flour. Whisk until just barely combined — no more than a minute from when the flour is first added — and then use a spatula to gently fold the batter until the ingredients are combined. It is very important not to over-whisk or fold the batter or it will lose volume.", 
            "Pour into prepared pan. Sprinkle the pear and chocolate chunks over the top, and bake until the cake is golden brown and springs back to the touch, about 40 to 50 minutes [updated, thanks for your responses], or a tester comes out clean.", 
            "We served it with barely whipped whipped cream with a drop of almond extract in it, but I believe Anna serves it with buttermilk ice cream at the restaurant, which is, the best thing in the entire world, something I have the recipe for and promise to tell you about soon. (I’m just scared to make it because I ate the entire pint she gave me last time by myself. In three days.)", 
            "Update 1/27/09: I’ve added more baking suggestions in the comments: in short, please, don’t take your cake out before it is done. Doneness is much more important than baking times. "
        ], 
        "date": "2009-01-22T10:32:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup brown sugar", 
            "1 tablespoon water", 
            "3 large eggs, separated", 
            "2/3 cup (135 grams) granulated sugar", 
            "2 blood oranges, or another orange of your choice", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, softened", 
            "2/3 cup (165 grams) ricotta", 
            "1/3 cup (45 grams) cornmeal", 
            "1 cup (135 grams) firm-packed almond flour or meal", 
            "1/2 teaspoon fine sea salt", 
            "1/4 cup apple, quince or apricot jam (optional, for glossy finish)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/blood-orange-almond-and-ricotta-cake1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Citrus", 
            "Everyday Cakes", 
            "Gluten-Free", 
            "Italian", 
            "Orange", 
            "Passover", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/01/blood-orange-almond-and-ricotta-cake/", 
        "title": "blood orange, almond and ricotta cake", 
        "directions": [
            "Heat oven to 300 degrees F. Butter a 9-inch round cake pan and line the bottom with a round of parchment paper. ", 
            "Stir brown sugar and water together so they form a thick slurry. Pour into prepared cake pan and spread thin. Set aside.", 
            "Whip egg whites in a medium bowl with an electric mixer until they hold thick peaks. Set aside.", 
            "Place granulated sugar in a large mixing bowl. Finely zest both oranges over it. ", 
            "Cut both oranges in half. Cut one of the halves into paper-thin slices and arrange slices over brown sugar base in cake pan. Juice other three halves (I had about 1/3 cup juice) and set juice aside.", 
            "Add butter to zest and granulated sugar in large mixing bowl and beat with an electric mixer (you can use same beaters you just did for egg whites) until light and fluffy. Add egg yolks, one at a time, and beat to combine. Add juice and ricotta; mix until smooth. Sprinkle salt over batter, then add almond flour and cornmeal and mix until just combined. Gently fold in egg whites. ", 
            "Scoop batter in large dollops over prepared cake pan base. Gently spread batter flat, trying not to disturb orange slices underneath. Bake in heated oven for 35 to 40 minutes [updated to warn that this took longer for many people, but remains accurate for my oven– better to check early than late], or until a toothpick inserted into the center comes out clean and then (my preference) for 5 more minutes. The final cake is so moist, almost damp, I found the extra baking time beneficial. ", 
            "Cool cake in pan on rack for 5 minutes, and then run a knife around the side and invert onto a cake plate. If any orange slices don’t come out easily, just gently arrange them on the top of the cake. If desired, heat jam until loose and brush over cake top for a glossier finish. Let cool and cut into slices. This would be delicious served with an extra dollop of ricotta, creme fraiche or barely sweetened whipped cream. The cake keeps at room temperature, but we prefer it from the fridge."
        ], 
        "date": "2016-01-14T12:05:43+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups (250 grams) plus 1 teaspoon all-purpose flour", 
            "1 tablespoon baking powder", 
            "1 teaspoon table salt", 
            "16 tablespoons unsalted butter (2 sticks, 8 ounces or 225 grams), softened", 
            "3/4 cup (145 grams) packed light brown sugar", 
            "1/2 cup (100 grams) granulated sugar", 
            "3 large eggs", 
            "1 cup (235 ml) whole milk (though buttermilk, which was all I had on hand, worked just great)", 
            "1/2 cup (about 85 grams) blueberries, fresh or frozen (if frozen, do not defrost first as it tends to muddle in the batter)", 
            "Topping", 
            "1/2 cup (about 85 grams) blueberries, fresh or frozen (do not defrost)", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 teaspoon ground cinnamon", 
            "For the topping:", 
            "Scatter blueberries over top of batter. Stir sugar and cinnamon together in small bowl and sprinkle over batter. Bake until toothpick inserted in center of cake comes out clean, 45 to 50 minutes. Cool in pan 20 minutes, then turn out and place on serving platter (topping side up). Serve warm or at room temperature. (Cake can be stored in airtight container at room temperature up to 3 days.)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/blueberry-boy-bait.jpg?w=752", 
        "tags": [
            "Blueberries", 
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/07/blueberry-boy-bait/", 
        "title": "blueberry boy bait", 
        "directions": [], 
        "date": "2009-07-06T16:13:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (200 grams) granulated sugar", 
            "1 teaspoon baking powder", 
            "3 cups (390 grams) all-purpose flour", 
            "1/4 teaspoon salt", 
            "Zest of one lemon", 
            "1 cup (8 ounces or 225 grams) cold unsalted butter, cut into chunks", 
            "1 large egg", 
            "Juice of 1 lemon", 
            "1/2 cup (100 grams) granulated sugar", 
            "4 teaspoons cornstarch", 
            "4 cups fresh blueberries"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2710636010_a64fe15ab8_o.jpg?w=750", 
        "tags": [
            "Bars", 
            "Blueberries", 
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/07/blueberry-crumb-bars/", 
        "title": "blueberry crumb bars", 
        "directions": [
            "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9×13 inch pan.\nIn a medium bowl, stir together 1 cup sugar, 3 cups flour, baking powder, salt, and lemon zest. Use a fork or pastry cutter to blend in the butter and egg. Dough will be crumbly. Pat half of dough into the prepared pan.\nIn another bowl, stir together the sugar, cornstarch and lemon juice. Gently mix in the blueberries. Sprinkle the blueberry mixture evenly over the crust. Crumble remaining dough over the berry layer.\nBake in preheated oven for 45 minutes, or until top is slightly brown. (This took an extra 10 to 15 minutes in my oven.) Cool completely before cutting into squares.\n"
        ], 
        "date": "2008-07-29T15:25:26+00:00"
    }, 
    {
        "ingredient_list": [
            "Topping:", 
            "5 tablespoons (40 grams) all-purpose flour", 
            "1/2 cup (100 grams) granulated sugar", 
            "1 teaspoon ground cinnamon", 
            "4 tablespoons (1/4 cup, 2 ounces or 55 grams) unsalted butter, cold is fine", 
            "Pinch of salt", 
            "Cake:", 
            "2 cups minus 1 tablespoon (i.e. 1 3/4 cups + 3 tablespoons or 240 grams) all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon table salt", 
            "4 tablespoons (1/4 cup, 2 ounces or 55 grams) unsalted butter, softened", 
            "3/4 cup (150 grams) granulated sugar", 
            "Zest of 1 lemon", 
            "1 large egg", 
            "1 teaspoon vanilla extract", 
            "1 pint (2 to 2 2/3 cups, 12 to 16 ounces, or 340 to 455 grams; see Note) fresh blueberries, clean and dry", 
            "1/2 cup milk, whole is ideal, any kind should work", 
            "1/2 cup (55 grams) walnuts, chopped medium fine (optional)", 
            "Confectioners’ sugar, for dusting (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/blueberry-crumb-cake1.jpg?w=640", 
        "tags": [
            "Blueberries", 
            "Everyday Cakes", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/07/blueberry-crumb-cake/", 
        "title": "blueberry crumb cake", 
        "directions": [
            "Heat oven to 375°F. Butter a 9-inch round baking pan (with at least 2″ sides) and dust it lightly with flour; line it with a round of parchment paper. ", 
            "Prepare the topping by mixing the flour, sugar, cinnamon and salt, then cutting the butter in with a pastry blender, fork or your fingertips until the mixture resembles coarse crumbs. Set aside.", 
            "In a medium bowl, whisk flour, baking powder, and salt until combined. In a large bowl, beat butter, sugar and zest together until light and fluffy. Add egg and vanilla and beat until combined. Beat in 1/3 of the dry ingredient mixture until just combined, followed by 1/2 the milk; repeat with remaining dry ingredients and milk, finishing with the dry mixture. The batter will be very stiff, but don’t fret. Fold blueberries into cake batter until evenly distributed.", 
            "Scoop cake batter into prepared pan and smooth so that it is flat. If using walnuts, scatter them on top. Sprinkle with prepared streusel. Bake in heated oven for 40 minutes, or until a toothpick inserted into the middle of the cake comes out batter-free. You can let the cake cool complete in the pan on a rack, or just cool it in the pan for 20 minutes before flipping it out onto a cooling rack, removing the parchment paper lining, and flipping it back onto a plate. Dust with confectioners’ sugar, if using. ", 
            "Do ahead: Cake keeps covered with plastic or foil at room temperature for three days. If longer, it might be best to keep it in the fridge. It gets more moist each day."
        ], 
        "date": "2014-07-31T12:20:32+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (2 ounces or 55 grams) cream cheese, softened", 
            "1 1/2 cups (190 grams) peanut butter (I use smooth, but you can use chunky if you are looking for more texture) (previous weight was 145 grams, which is too low)", 
            "1 cup (about 130 grams) graham cracker crumbs (from about 14 graham crackers)", 
            "Salt (optional, see note up top)", 
            "3 cups (360 grams) confectioners’ (powdered) sugar", 
            "10 tablespoons (5 ounces or 140 grams) unsalted butter, melted and cooled", 
            "12 ounces (340 grams) dark chocolate (60 to 72%), coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/buckeyes.jpg?w=749", 
        "tags": [
            "Candy", 
            "Chocolate", 
            "Peanut Butter", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/10/buckeyes/", 
        "title": "buckeyes", 
        "directions": [
            "Make the filling: In the bowl of an electric mixer, beat the cream cheese and peanut butter together until combined. Add the graham cracker crumbs and beat for 10 seconds. Add the sugar and butter, and mix on the lowest speed until it stops floating off everywhere, then increase the speed until the ingredients are combined. Scrape down the whole bowl well, then mix again. The mixture will be quite sturdy and a little dry — perfect for shaping. Set it aside while you prepare the coating.", 
            "Make the coating: Melt the chocolate either over a double boiler, stirring until it is completely smooth or in a microwave in 30 then 10 second increments, stirring before you start it again until it is completely smooth. Let it cool to tepid (about 100 degrees, though I’d go a little cooler next time for a thicker coating; I had a few ounces of chocolate leftover) while you shape the peanut butter centers. [Alternately, you can temper the chocolate (fairly simply instructions here) for a perfect showy finish.]", 
            "Assemble the candies: Line a sheet pan with parchment paper. Scoop out slightly more than one tablespoon’s worth of filling (their suggestion; I used a scoop that made them a little smaller) and use your hands to form it into a ball. Place the ball on the prepared sheet and repeat the process until all of the candies have been shaped. They can sit close to each other but make sure they are not touching.", 
            "Using a fork or large skewer, dip each ball into the chocolate and roll it about so that almost the entire candy is coating, leaving a small circle uncoated. Play around with a few practice pieces; I found it easiest to stick the skewer in the side, angle the bowl I was using towards it and make sure it became submerged as I rolled the candy around. But don’t fuss too much; even the “ugly” ones won’t go to waste.", 
            "Chill the buckeyes until they are set, about 30 minutes.", 
            "Do ahead: Buckeyes will keep in the fridge for what the book says is 3 days, but I’d say at least a week, should you keep them in a lockbox and hide the key."
        ], 
        "date": "2010-10-30T10:17:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups (190 grams) all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon kosher salt", 
            "1 cup (230 grams) plain whole-milk yogurt", 
            "1 cup (200 grams) plus 1 tablespoon (13 grams) sugar", 
            "3 extra-large eggs", 
            "1 tablespoon grated grapefruit zest (approximately one large grapefruit)", 
            "1/2 teaspoon pure vanilla extract", 
            "1/2 cup (120 ml) vegetable oil", 
            "1/3 cup (80 ml) freshly squeezed grapefruit juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/01/grapefruit-yogurt-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Citrus", 
            "Everyday Cakes", 
            "Fruit", 
            "Grapefruit", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2007/01/cake-paradisi/", 
        "title": "grapefruit yogurt cake", 
        "directions": [
            "Preheat the oven to 350°F. Grease an 8 1/2 by 4 1/4 by 2 1/2-inch loaf pan. Line the bottom with parchment paper. Grease and flour the pan.", 
            "Sift together the flour, baking powder, and salt into 1 bowl. In another bowl, whisk together the yogurt, 1 cup sugar, the eggs, grapefruit zest, and vanilla. Slowly whisk the dry ingredients into the wet ingredients. With a rubber spatula, fold the vegetable oil into the batter, making sure it’s all incorporated. Pour the batter into the prepared pan and bake for about 50 minutes, or until a cake tester placed in the center of the loaf comes out clean.", 
            "Meanwhile, cook the 1/3 cup grapefruit juice and remaining 1 tablespoon sugar in a small pan until the sugar dissolves and the mixture is clear. Set aside.", 
            "When the cake is done, allow it to cool in the pan for 10 minutes. Carefully place on a baking rack over a sheet pan. While the cake is still warm, pour the grapefruit-sugar mixture over the cake and allow it to soak in. Cool.", 
            "For the glaze, combine the confectioners’ sugar and grapefruit juice and pour over the cake."
        ], 
        "date": "2007-01-19T12:53:44+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/candied-grapefruit-peels1.jpg?w=500", 
        "tags": [
            "Candy", 
            "Citrus", 
            "Disasters", 
            "Fruit", 
            "Grapefruit", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/01/candied-grapefruit-peels/", 
        "title": "candied grapefruit peels", 
        "directions": [], 
        "date": "2008-01-31T09:11:16+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/candy-girl1.jpg?w=500", 
        "tags": [
            "Candy", 
            "Chocolate", 
            "Citrus", 
            "Fruit", 
            "Orange", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/candy-girl/", 
        "title": "orangettes", 
        "directions": [], 
        "date": "2006-11-18T20:07:28+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/21416752703_3fe5712d86_o.jpg?w=750", 
        "tags": [
            "Cake", 
            "Chocolate", 
            "Everyday Cakes", 
            "Fall", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/10/cannoli-pound-cake/", 
        "title": "cannoli pound cake", 
        "directions": [
            "Heat oven to 350°F (175°C). Coat a standard (8 1/2-x-4 1/4″) loaf pan with butter or a nonstick spray. ", 
            "Place sugar in a large bowl, and add zest. Use your fingertips to rub the zest into the sugar, scenting it througout. Whisk in olive oil, wine (if using), ricotta and eggs. Sprinkle baking powder, salt, cinnamon and allspice over wet ingredients, then whisk to combine. Gently stir in flour, then chocolate and pistachios until just combined.", 
            "Scrape into prepared loaf. Bake oven for 55 to 65 minutes, until a skewer inserted into the center of the cake comes out-batter free. Let cool on wire rack in pan for 15 minutes, then invert out onto rack to finish cooling. Cake is great the first day, and even more amazingly moist on the second and third, so feel free to plan ahead. Store at room temperature, covered with foil or plastic."
        ], 
        "date": "2015-10-08T12:03:24+00:00"
    }, 
    {
        "ingredient_list": [
            "For the cake", 
            "2 cups plus 2 tablespoons sifted cake flour (not self-rising; sift before measuring)", 
            "1 teaspoon baking powder", 
            "3/4 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "1 stick unsalted butter, softened", 
            "1 cup sugar", 
            "1 teaspoon pure vanilla extract", 
            "2 large eggs, at room temperature 30 minutes", 
            "1 cup well-shaken buttermilk", 
            "For caramel glaze", 
            "1 cup heavy cream", 
            "1/2 cup packed light brown sugar", 
            "1 tablespoon light corn syrup", 
            "1 teaspoon pure vanilla extract", 
            "Equipment: a candy thermometer"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/caramel-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Round-Up"
        ], 
        "url": "https://smittenkitchen.com/2007/12/caramel-cake/", 
        "title": "caramel cake", 
        "directions": [
            "Make the cake:  Preheat oven to 350°F with rack in middle. Butter an 8-inch square cake pan and line with a square of parchment paper, then butter parchment. Sift together flour, baking powder, baking soda, and salt. ", 
            "Beat butter and sugar in a large bowl with an electric mixer at medium speed until pale and fluffy, then beat in vanilla. Add eggs 1 at a time, beating well after each addition. At low speed, beat in buttermilk until just combined (mixture may look curdled). Add flour mixture in 3 batches, mixing until each addition is just incorporated.", 
            "Spread batter evenly in cake pan, then rap pan on counter several times to eliminate air bubbles. Bake until golden and a wooden pick inserted in center of cake comes out clean, 35 to 40 minutes. Cool in pan on a rack 10 minutes, then run a knife around edge of pan. Invert onto rack and discard parchment, then cool completely, about 1 hour.", 
            "Make the glaze: Bring cream, brown sugar, corn syrup, and a pinch of salt to a boil in a 1 1/2-quart heavy saucepan over medium heat, stirring until sugar has dissolved. Boil until glaze registers 210 to 212°F on thermometer, 12 to 14 minutes, then stir in vanilla.  ", 
            "Put rack with cake in a shallow baking pan and pour hot glaze over top of cake, allowing it to run down sides. Cool until glaze is set, about 30 minutes.", 
            "Do ahead: Cake (before glazing) can be made 1 day ahead and kept in an airtight container at room temperature."
        ], 
        "date": "2007-12-30T17:04:24+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/03/caramel-walnut-upside-down-banana-cake.jpg?w=749", 
        "tags": [
            "Bananas", 
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/03/caramel-walnut-upside-down-banana-cake/", 
        "title": "caramel walnut upside down banana cake", 
        "directions": [
            "For topping: Spray 9-inch round cake pan with 2-inch-high sides with nonstick spray. Bring butter, sugar, and corn syrup to boil in medium saucepan, stirring constantly until butter melts. Boil syrup 1 minute. Stir in nuts. Spread topping in prepared pan. Let topping cool completely.", 
            "For cake: Preheat oven to 350°F. Sift first 4 ingredients into medium bowl. Using electric mixer, beat butter and both sugars in large bowl until blended. Beat in eggs 1 at a time, then mashed bananas, sour cream, rum, and vanilla. Beat in dry ingredients in 2 additions just until combined. Spoon batter into pan.", 
            "Bake cake until tester inserted into center comes out clean, about 40 to 45 minutes. Cool 15 minutes. Cut around cake. Place platter over pan. Holding pan and platter together, turn over. Let stand 5 minutes, then gently lift off pan. Cool at least 15 minutes for topping to set. Serve warm or at room temperature with whipped cream or vanilla ice cream."
        ], 
        "date": "2008-03-20T08:10:57+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/3 cups (290 grams) all-purpose flour", 
            "3/4 teaspoon (5 grams) table or fine sea salt", 
            "2 teaspoons (10 grams) baking powder (I prefer aluminum-free)", 
            "1 1/4 teaspoon ground cinnamon", 
            "1/4 teaspoon ground or a bunch of gratings of whole nutmeg", 
            "1/8 teaspoon ground cloves", 
            "1/2 cup (120 ml) olive oil", 
            "3/4 cup (145 grams) dark brown sugar", 
            "2 large eggs", 
            "1 cup cider (235 ml, see buying suggestions below)", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 1/2 cups packed coarsely grated carrots from about 9 ounces (2 to 2 1/2 meaty/large or 4 to 5 slim; about 255 grams) whole carrots", 
            "Olive oil or nonstick cooking spray for baking pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/carrot-cake-with-cider-and-olive-oil1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Carrots", 
            "Dairy-Free", 
            "Everyday Cakes", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/10/carrot-cake-with-cider-and-olive-oil/", 
        "title": "carrot cake with cider and olive oil", 
        "directions": [
            "Heat oven to 350 degrees. Coat a 9×5-inch loaf pan* with olive oil or a nonstick cooking spray. If yours is old and you’re nervous about the cake sticking, it cannot hurt to line yours with a fitted rectangle of parchment paper.", 
            "In a large bowl, whisk together flour, salt, baking powder, cinnamon, nutmeg and cloves. In a medium bowl, whisk together olive oil, brown sugar, eggs, cider and vanilla. Stir grated carrots into wet ingredients until evenly coated, then stir wet ingredients into dry just until no floury bits remain. ", 
            "Pour into prepared pan and bake for 60 to 70 minutes, until a skewer inserted into the center comes out batter-free. Let cool in loaf pan for 20 to 30 minutes, then remove from pan and cool the rest of the way on a rack. Loaf should keep at room temperature for a few days, and longer in the fridge. It’s even more moist on the second day.", 
            "Whatever you do, definitely avoid making a cream cheese frosting-like spread whipped together from 4 ounces of softened cream cheese, 2 tablespoons softened unsalted butter, 1/2 teaspoon vanilla extra and 6 tablespoons powdered sugar, some of which can be replaced with honey or maple syrup but will make for a softer spread. It will unquestionably compromise this cake’s dairy-free status. It might be dangerously good.", 
            "Notes: "
        ], 
        "date": "2014-10-16T11:58:27+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust:", 
            "7 tablespoons unsalted butter, melted", 
            "1/3 cup sugar", 
            "1/4 teaspoon vanilla extract", 
            "1 cup plus 1 tablespoon all purpose flour", 
            "Pinch of salt", 
            "Filling:", 
            "1/2 cup sugar", 
            "2 large eggs", 
            "Pinch of salt", 
            "1/4 cup all purpose flour", 
            "1 teaspoon vanilla extract", 
            "1/2 cup (1 stick) unsalted butter, diced", 
            "1 pound sweet cherries, which will yield 12 ounces of pitted cherries, which yielded some leftovers, perfect for snacking (alternately, you can use 12 ounces of the berry of your choice)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/3664441408_6dbba66669_b.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cherries", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/06/cherry-brown-butter-bars/", 
        "title": "cherry brown butter bars", 
        "directions": [
            "Make crust: Preheat over to 375°F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (It should look like this.) Congratulations! You’ve just faked a square tart pan.", 
            "Using rubber spatula or fork, mix melted butter, sugar, and vanilla in medium bowl, or if you’re Deb, in the bottom of the small saucepan you used to melt the butter. Add flour and salt and stir until incorporated. Transfer dough to your prepared pan, and use your fingertips to press the dough evenly across the bottom of the pan. Bake the crust until golden, about 18 minutes (it will puff slightly while baking). Transfer crust to rack and cool in pan. Maintain oven temperature.", 
            "Make the filling: Cook butter in heavy small saucepan (a lighter-colored one will make it easier to see the color changing, which happens quickly) over medium heat until deep nutty brown (do not burn), stirring often and watching carefully, about six minutes. Immediately pour browned butter into glass measuring cup to cool slightly.", 
            "Whisk sugar, eggs, and salt in medium bowl to blend. Add flour and vanilla and whisk until smooth. Gradually whisk browned butter into sugar-egg mixture; whisk until well blended.", 
            "Arrange pitted cherries, or the berries of your choice, in bottom of cooled crust. Carefully pour browned butter mixture evenly over the fruit. Bake bars until filling is puffed and golden and tester inserted into center comes out clean, about 40 minutes (though, of course, this took less time in my hyperactive oven so please watch your baking times carefully). Cool bars completely in pan on rack.", 
            "Use the parchment paper overhang to carefully remove cooled bars from pan and place them on a cutting board and cut them into squares with a very sharp knife. The cherries, if they fall over your slicing lines, will want to give you trouble but if you saw a sharp knife into them slowly before pressing down, they’ll cut neatly and with minimum carnage.", 
            "Do ahead: Can be made at least a day ahead, and stored at room temperature. Any longer, keep them cool in the fridge."
        ], 
        "date": "2009-06-29T13:07:57+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (1 1/2 sticks) unsalted butter, room temperature, divided", 
            "1/4 cup (packed) dark brown sugar", 
            "2 teaspoons balsamic vinegar", 
            "3 cups whole pitted fresh Bing cherries or other dark sweet cherries (about 21 ounces whole unpitted cherries)", 
            "1 1/4 cups all purpose flour", 
            "1/4 cup yellow cornmeal (preferably stone-ground medium grind)", 
            "2 teaspoons baking powder", 
            "1/4 teaspoon salt", 
            "1 cup sugar", 
            "2 large eggs, separated", 
            "3/4 teaspoon vanilla extract", 
            "1/2 cup whole milk", 
            "1/4 teaspoon cream of tartar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cherry-cornmeal-upside-down-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Cherries", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/05/cherry-cornmeal-upside-down-cake/", 
        "title": "cherry cornmeal upside-down cake", 
        "directions": [
            "Position rack in center of oven; preheat to 350°F. Combine 1/4 cup butter with brown sugar and vinegar in 10- to 11-inch ovenproof skillet with 2-inch-high sides. Stir over medium heat until butter melts and sugar dissolves, about 2 minutes. Increase heat to high; add cherries and bring to boil. Remove from heat.", 
            "Whisk flour, cornmeal, baking powder, and salt in medium bowl to blend. Using electric mixer, beat 1/2 cup butter in large bowl. Add sugar; beat until pale and fluffy, about 3 minutes. Beat in egg yolks and vanilla. Add flour mixture alternately with milk in 2 additions each, beating just until blended and occasionally scraping down sides of bowl. Using clean dry beaters, beat egg whites in another medium bowl until foamy. Add cream of tartar and beat until whites are stiff but not dry. Using rubber spatula, fold 1/4 of whites into batter to lighten slightly. Fold in remaining whites in 3 additions (batter will be thick). Spoon batter over cherries in skillet, then spread evenly with offset spatula to cover cherries.", 
            "Bake cake until top is golden brown and tester inserted into center comes out clean, about 45 minutes. Cool in skillet on rack 5 minutes. Run spatula around edges of cake to loosen. Place large serving platter upside down atop skillet. Using pot holders or oven mitts, firmly hold platter and skillet together and invert. Leave skillet atop cake 5 minutes. Remove skillet. If necessary, rearrange any cherries that may have become dislodged. Let cake cool at least 45 minutes. Cut cake into wedges and serve slightly warm or at room temperature."
        ], 
        "date": "2008-05-15T10:39:25+00:00"
    }, 
    {
        "ingredient_list": [
            "4 to 6 sheets matzo or approximately 40 Saltine crackers or crackers of your choice", 
            "1 cup (2 sticks or 8 ounces) unsalted butter, cut into a few large pieces", 
            "1 cup packed light brown sugar", 
            "A big pinch of sea salt", 
            "1/2 teaspoon pure vanilla extract", 
            "1 1/2 cups semi- or bittersweet chocolate chips (or chopped bittersweet or semisweet chocolate)", 
            "1 cup toasted chopped almonds, pecans, walnuts or a nut of your choice (optional)", 
            "Extra sea salt for sprinkling (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/04/chocolate-caramel-crackers.jpg?w=752", 
        "tags": [
            "Candy", 
            "Chocolate", 
            "Passover", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/04/chocolate-caramel-crackers/", 
        "title": "chocolate caramel crack(ers)", 
        "directions": [
            "Preheat the oven to 350°F. Line an 11-by-17-inch baking sheet completely with foil, and then line the base of the foil with parchment paper, cut to fit.", 
            "Line the bottom of the baking sheet with matzo or crackers, covering all parts. [If using matzo, you’ll need to break pieces to fit any extra spaces, which will be annoying because despite being perforated, it does not actually break in straight lines. I have some luck pressing a serrated knife straight down along a section between perforations, if that (hopefully) makes sense.]", 
            "In a medium heavy-duty saucepan, melt the butter and brown sugar together, and stir it over medium heat until it begins to boil. Once it has begun boiling, let it bubble for three more minutes, stirring it well. It will thicken a bit as it cooks. Remove from the heat and add the salt and vanilla, and then quickly pour it over the matzo or crackers. You’ll want to spread it quickly, as it will begin to set as soon as it is poured.", 
            "Bake the caramel-covered crackers for 15 minutes, watching carefully as it will bubble and the corners might darken too quickly and/or burn. You can reduce the heat if you see this happening. ", 
            "Remove from oven and immediately cover with chocolate chips. Let stand five minutes, and then spread them evenly across the caramel. An offset spatula works great here. If you’re using them, sprinkle the chocolate with toasted chopped nuts and/or sea salt. (The sea salt is great on matzo. On Saltines, it’s really not necessary.)", 
            "Once completely cool — I sometimes speed this process up in the fridge, impatient as should be expected in the face of caramel crack(ers) — break it into pieces and store it in a container. It should keep for a week but I’ve never seen it last that long."
        ], 
        "date": "2009-04-09T20:34:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (200 grams) granulated sugar", 
            "1/2 cup (120 grams) water", 
            "1 1/2 cup (205 grams or 7 1/4 ounces) whole almonds", 
            "1/2 teaspoon flaky salt", 
            "8 ounces (225 grams) semi- or bittersweet chocolate, chopped, or 1 1/3 cups chocolate chips", 
            "Approximately 1/2 cup cocoa powder, sanding or coarse sugar or sprinkles to coat"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/12/chocolate-caramel-crunch-almonds.jpg?w=750", 
        "tags": [
            "Candy", 
            "Chocolate", 
            "Gift Guides", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/12/chocolate-caramel-crunch-almonds-new-kitchen-favorites/", 
        "title": "chocolate caramel crunch almonds + new kitchen favorites", 
        "directions": [
            "To coat almonds in caramel: Line a large baking sheet with parchment paper or a silicone baking mat. Set aside. Have potholders handy, either on your hands or close by; you don’t want your skin anywhere near melted sugar.\nIn a heavy-bottomed 3 to 4-quart saucepan, bring sugar and water to a simmer. Add almonds and stir to coat them in the syrup.\nVery brief instructions: You are going to simmer the almonds in the sugar syrup over medium heat until it caramelizes.\nDetailed instructions/descriptions: As the water evaporates in the sugar syrup, it will become thicker and soap-like bubbles will form. Once the liquid has fully evaporated, it will become sandy and you will think something has gone wrong; it has not. Continue stirring and the sandiness will dissolve into a bronzed but clear liquid; this is the caramel. At this point, you can remove the pan from the heat and the residual heat in the pot should be enough to finish melting the sugar again as you continue stirring. Should it not be melting, however, just put it back over the flame for 20 to 30 seconds while you stir. Repeat as needed. In a couple minutes, the melted sugar will coat the almonds completely.\nStir in salt and spread almonds in a single layer on prepared sheet, separating them as much as possible.\nSet in freezer — or, outside, if it’s really cold — for a few minutes until cold and hard. This will take all of 5 minutes in the freezer. Break caramel into individual nuts; don’t worry about rough edges.\nYou can go ahead and use this parchment or baking mat-covered tray again. Place cocoa, sugars, sprinkles and any other coatings in individual bowls. Have a few forks around to help roll the almonds through it.\nTo coat caramelized almonds in chocolate: Melt chocolate 3/4 of the way in a large bowl, then stir to let it melt the rest of the way using the residual heat in the bowl.\nPour caramel-coating almonds into melted chocolate and stir several times to coat evenly. Use forks to pluck almonds one by one out of chocolate bowl and drop into coating of choice. Roll almonds until coated and spread out to set on prepared baking sheet. Repeat with remaining almonds.\nOnce again, you can set these quickly in the freezer (or outside, on a very cold day), this time give it 10 to 15 minutes.\nTo finish/pack up: Once almonds are set, they’re ready to be boxed or bagged. These keep months at room temperature.\n"
        ], 
        "date": "2016-12-05T13:02:12+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup granulated sugar", 
            "2 tablespoons light corn syrup or golden syrup", 
            "1/4 cup water", 
            "2 tablespoons butter", 
            "1/2 teaspoon baking soda", 
            "3/4 cup broken-up chunks of thin salted pretzels", 
            "3/4 cup roasted salted peanuts", 
            "3/4 to 1 cup semisweet chocolate chips"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/chocolate-peanut-and-pretzel-brittle1.jpg?w=750", 
        "tags": [
            "Candy", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/10/chocolate-peanut-and-pretzel-brittle/", 
        "title": "chocolate peanut and pretzel brittle", 
        "directions": [
            "Either grease a large cookie sheet or line it with parchment paper or a nonstick baking mat. Get all of your other ingredients ready; you’re going to need to add them quickly in a few minutes, and you won’t have time to hunt and measure.", 
            "Combine sugar, corn or golden syrup and water in a medium saucepan, stirring just until sugar is wet. Attach a candy thermometer and heat over medium-high heat, without stirring, until mixture reaches between 300 and 305 degrees F. If you don’t have a candy thermometer, you’re looking for a small amount of the mixture dropped into cold water to separate into hard, brittle threads. This takes exactly 9 minutes on my stove. ", 
            "Remove from heat and quickly stir in butter (until it melts), baking soda, peanuts and pretzels until all are coated. Pour quickly out onto prepared pan. Use a spatula or, even better, two forks to pull and stretch the mixture as flat as you can get it, working quickly. Sprinkle with chocolate chips and let rest for 5 minutes so that they soften. Once they are all soft, use a spatula to spread them over the brittle.", 
            "None of us has time or patience for waiting for these to cool, right? I put them directly in the freezer for 20 minutes, after which point the chocolate is firm, the base is cold and I get to bash the brittle into bite-sized chunks. (I like to lift pieces up onto the rim of the baking sheet and use something heavy to break them from there. I do not advise breaking it up with your hands, the warmth of which will make a mushy mess of the chocolate.)", 
            "Store in a container at room temperature, far out of your own reach."
        ], 
        "date": "2015-10-30T12:01:58+00:00"
    }, 
    {
        "ingredient_list": [
            "7 ounces (200 grams) bittersweet or semisweet chocolate, coarsely chopped", 
            "1/2 cup (125 ml) vegetable oil", 
            "1/2 cup (125 ml) plain, whole-milk yogurt", 
            "1 cup (200 grams) sugar", 
            "3 large eggs, at room temperature", 
            "1 teaspoon vanilla extract", 
            "1/2 teaspoon almond extract", 
            "1 1/2 cups (200 grams) flour", 
            "1 1/2 teaspoons baking powder (David recommends aluminum-free baking powders, such as Rumford or Bob’s Red Mill, as do I)", 
            "1/2 teaspoon coarse salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/chocolate-yogurt-snack-cakes.jpg?w=753", 
        "tags": [
            "Cake", 
            "Chocolate", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/06/chocolate-yogurt-snack-cakes/", 
        "title": "chocolate yogurt snack cakes", 
        "directions": [
            "1. Preheat the oven to 350°F (180°C). Line a 12-cup muffin tin with paper cupcake liners or lightly butter the pan. Or, if you’re Deb and have to be fancy dust off that much-neglected mini-springform pan and coat it with a nonstick spray.", 
            "2. In a heatproof bowl set over simmering water, melt the chocolate with 1/4 cup of the oil.  Once melted and smooth, remove from the heat. (Alternately, you can do this in the microwave on high for 30 seconds, then in 15 second increments, stirring well between each until smooth.)", 
            "3. In another bowl, mix the remaining 1/4 cup oil with yogurt, sugar, eggs and vanilla and almond extracts.", 
            "4. In a large bowl, whisk the flour, baking powder, and salt. Make a well in the center of the flour mixture and pour in the yogurt mixture. Stir lightly a couple times, then add the melted chocolate and stir until just smooth.", 
            "5. Divide the batter among the muffin or springform cups and bake for 20 to 25 minutes (less for mini-springforms, more for muffins, though your oven may vary) or until they feel barely set in the middle and a tester or toothpick comes out clean.", 
            "6. Remove from the oven and cool on a wire rack before serving with coffee and a nice dollop of lightly sweetened whipped cream and any berries you can scrounge up in your fridge. Or, you know, as is.", 
            "Do ahead: These cakes can be stored in an airtight container at room temperature for four days. "
        ], 
        "date": "2009-06-23T12:55:38+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "1 1/4 cups (295 ml) milk", 
            "1 teaspoon (5 ml) vanilla extract", 
            "2 1/2 cups (315 grams) all-purpose flour", 
            "1/4 teaspoon table salt (see Note)", 
            "2 teaspoons (10 grams) baking powder", 
            "1 to 2 teaspoons ground cinnamon (Bill calls for 2 but I preferred 1, so that it didn’t dominate)", 
            "1 cup (200 grams) granulated sugar", 
            "5 ounces (140 grams) sweetened flaked coconut (about 1 1/2 cups)", 
            "6 tablespoons (85 grams) unsalted butter, melted or melted and browned, if desired", 
            "Vegetable oil or nonstick cooking spray for baking pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/03/coconut-bread.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brown Butter", 
            "Brunch", 
            "Coconut", 
            "Everyday Cakes", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/03/coconut-bread/", 
        "title": "coconut bread", 
        "directions": [
            "Heat oven to 350 degrees. In a small bowl, whisk together eggs, milk and vanilla.", 
            "In a medium bowl, sift together flour, salt, baking powder and cinnamon. Add sugar and coconut, and stir to mix. Make a well in the center, and pour in egg mixture, then stir wet and dry ingredients together until just combined. Add butter, and stir until just smooth — be careful not to overmix.", 
            "Butter and flour a 9×5-inch loaf pan, or coat it with a nonstick spray. Spread batter in pan and bake until a toothpick inserted into the center comes out clean, anywhere from 1 to 1 1/4 hours. Cool in pan five minutes, before turning out onto a cooling rack. ", 
            "Serve in thick slices, toasted, with butter and confectioners’ sugar or salted honey brown butter spread."
        ], 
        "date": "2013-03-18T10:26:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup sweetened condensed milk", 
            "1/2 cup unsweetened coconut milk", 
            "2 tablespoons salted or unsalted butter (salted will give the candy more contrast)", 
            "2 teaspoons light corn syrup", 
            "1/3 cup finely shredded unsweetened coconut (I lightly toasted mine, for crunch)", 
            "1/3 cup ground pistachios (see Note below)", 
            "1/3 cup chocolate sprinkles or “vermicelli” (see Note below)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/coconut-milk-fudge1.jpg?w=500", 
        "tags": [
            "Brazilian", 
            "Candy", 
            "Coconut", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/03/coconut-milk-fudge/", 
        "title": "coconut milk fudge", 
        "directions": [
            "In a medium-size heavy saucepan, combine condensed milk, coconut milk, butter and corn syrup. Bring to a boil over medium heat. Reduce heat to low and whisk constantly until fudgy. The recipe notes that when mixture is ready, it will pull together into one soft piece, leaving browned residue on bottom of pan and that this should take 8 to 10 minutes. This took me 20 to 25 minutes, and the candy began taking on a beige, caramelized color.", 
            "Slide mixture into a bowl. (Don’t scrape the pan; leave any residue behind.) Let cool to room temperature, then refrigerate until very firm, at least 4 hours. Or, you could realize that the nanny has to leave in an hour, chill it for only 30 and discover that nothing bad will happen if you don’t wait the whole cooling time. You’ll have to be more careful if you use “real” i.e. meltable chocolate sprinkles but otherwise it will have no ill-effect to speed the process up.) ", 
            "Scoop out teaspoonfuls of the mixture (I used my one teaspoon measure) and use your hands to roll into balls, about 3/4-inch in diameter. I found having just a drop or two of water in my palms — not wet, just a little moist — helped form them. Set aside on a baking sheet.", 
            "Place toppings in wide bowls and roll brigadeiros through them, covering the surface completely.  Store in an airtight container at room temperature for 2 days, or refrigerate for up to 1 month. Serve at room temperature.", 
            "Chocolate “vermicelli”: I got a little freaked out when I saw the ingredient list on the chocolate sprinkles I had brought home from the store. Look, I don’t need to pretend that chocolate sprinkles are health food, but I like to imagine I’m eating something with at least a minute smidgen of chocolate in it. I ended up spending way too much on a bottle of “chocolate vermicelli” (they look like chocolate sprinkles but are almost 100% pure chocolate, and delightfully, taste that way too) but I’d buy them next time from Amazon or King Arthur Flour’s Baker’s Catalog for much less.", 
            "Pistachios: Since toasted nuts always, always taste better than raw ones, I toasted and ground a batch to coat the candy only to find the brown/green shade… um, a little unpretty. Looks won out and I used ground raw pistachios in the end. I actually ended up preferring the softness of the coating.", 
            "Those tiny cups: I know someone is going to ask me where I bought those colorful little candy cups and I’m sorry, as my answer could not be more inconvenient: Vienna. A grocery store. I’m kind of obsessed with going to grocery stores in foreign countries and always walk out with random stuff like this. Anyway, Amazon sells #4 size cups (1-inch base) in brown and white; however, mine are actually #3 size (3/4 to 7/8-inch base) which I found online at a smaller store."
        ], 
        "date": "2010-03-08T13:02:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (2 sticks or 8 ounces) butter", 
            "1/2 cup light brown sugar", 
            "1/2 cup white sugar", 
            "1 1/2 teaspoons molasses (can swap corn syrup or honey)", 
            "1/4 teaspoon salt (or a heaping 1/4 teaspoon flaky sea salt)", 
            "1 1/2 teaspoons instant espresso powder", 
            "1 cup semisweet chocolate chips, or 6 ounces semisweet chocolate, chopped", 
            "1/2 cup chopped hazelnuts (toasted, skinned and cooled) or another nut of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/12/coffee-toffee.jpg?w=753", 
        "tags": [
            "Candy", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/12/coffee-toffee/", 
        "title": "coffee toffee", 
        "directions": [
            "Line a small baking sheet (mine are 9×13, to fit in my puny oven) with parchment paper or a silicon mat and set aside.", 
            "In medium heavy saucepan (I used a 3-quart) with a candy thermometer attached, melt butter, brown sugar, white sugar, molasses, salt and espresso together over together. Cook over medium heat, stirring occasionally with a whisk (one that reaches into the corners is especially helpful here) until the temperature approaches 250¯F, at which point you should stir constantly until it reaches 300¯F.", 
            "Pour immediately into the prepared baking sheet — you can spread it more evenly with a offset or silicon spatula but don’t worry if you have neither. Sprinkle the chocolate chips over the toffee and let them sit for a minute until soft, then spread the chocolate evenly over the candy base. Sprinkle the chocolate with chopped hazelnuts and then, if you’re as impatient as we are, you can slide the sheet onto a cooling rack in the freezer until the toffee is set.", 
            "Break into pieces and store in an airtight container. If you’re kitchen runs warm, you might prefer to keep it in the fridge so the chocolate doesn’t get soft."
        ], 
        "date": "2009-12-05T22:19:48+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/corfu-sils-and-timelines1.jpg?w=500", 
        "tags": [
            "Apple", 
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Spanish"
        ], 
        "url": "https://smittenkitchen.com/2007/09/corfu-sils-and-timelines/", 
        "title": "grandmothers of sils’ apple-yogurt cake", 
        "directions": [
            "1. Position rack in the center of the oven and preheat the oven to 350°F. Butter and flour and 9-inch springform pan.", 
            "2. Sift the flour and baking powder together in a bowl. Place the eggs and granulated sugar in a large mixing bowl and, using an electric mixer, beat until fluffy and pale yellow, about 1 minute. Beat in the yogurt and liqueur until completely smooth. Working in batches, beat in the sifted flour, alternating it with the olive oil. Gently but thoroughly fold in the apples.", 
            "3. Scrape the batter into the prepared springform pan, tap it on a counter to level the batter, then smooth the top with an offset spatula. Bake the cake on the center rack until the top is golden, a cake tester or toothpick inserted into the center comes out clean**, and the cake springs back when you touch it, 55 to 65 minutes. Let the cake cool on a rack.", 
            "4. Run a thin knife around the side of the cake to loosen it. Remove the side and the bottom of the pan, then place the cake on a cake platter. (The cake can be baked up to 3 days ahead.) Wrap it loosely in plastic until ready to use. Serve the cake sprinkled with confectioners’ sugar, accompanied by creme fraiche, if desired. ", 
            "* For serious! I can’t tell you how many lemon yogurts I picked up at my totally yuppie gourmet grocery store before finding a single one with real, actual lemon in it and not artificial flavoring. I’m not naming names, but there were brands that I really expected better from. I finally landed on Stoneybrook Farms low-fat with lemon puree on the bottom. Why I went through this trouble when I could have just, uh, squeeze lemon juice into a plain yogurt, I don’t know. But just to warn that if you’re going through the effort of making a cake from scratch, you might want to make sure your lemon yogurt is the real deal. ", 
            "** For some reason, this never happened for me. Well beyond the baking time (though my oven runs a little cool) the toothpick was still coming out with some damp crumbs attached while the top was golden and springy, so I took it out. It was cooked just fine in the center, so if this happens to you, don’t worry. "
        ], 
        "date": "2007-09-12T17:12:30+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup sugar", 
            "3/4 cup fresh or thawed frozen cranberries, chopped", 
            "1/2 cup water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/intensely-almond-cake-with-cranberry-syrup1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Cranberries", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/01/cranberry-syrup-and-an-intensely-almond-cake/", 
        "title": "cranberry syrup (and an intensely almond cake)", 
        "directions": [
            "Cook sugar in a dry 1 1/2-quart heavy saucepan over moderate heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally with a fork or flat whisk, until sugar is melted and turns a deep golden caramel. Tilt pan and carefully add cranberries and water (caramel will harden and vigorously steam). Simmer over moderately low heat, stirring, until caramel is completely dissolved, then pour syrup through a very fine sieve into a heatproof bowl, pressing hard on solids. Let cool.", 
            "To use: Stir into sparkling water, sparkling wine, drizzle over ice cream or yogurt or puddle underneath an intense almond cake.", 
            "Play around: Stir in a couple inches of scraped vanilla bean pulp with the cranberries for a cranberry-vanilla syrup. Add a tablespoon of orange zest in with the cranberries for an orange-hinted cranberry syrup."
        ], 
        "date": "2010-01-14T22:44:47+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 vanilla bean, split lengthwise", 
            "1 3/4 cups sugar", 
            "2 cups fresh or thawed frozen cranberries (6 ounces)", 
            "2 cups plus 1 tablespoon all-purpose flour, divided", 
            "2 teaspoons baking powder", 
            "3/4 teaspoon salt", 
            "1 stick plus 1 tablespoon unsalted butter, softened, divided", 
            "2 large eggs", 
            "1/2 cup whole milk", 
            "Confectioners sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cranberry-vanilla-coffee-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Cranberries", 
            "Everyday Cakes", 
            "Fall", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/12/cranberry-vanilla-coffee-cake/", 
        "title": "cranberry vanilla coffee cake", 
        "directions": [
            "Preheat oven to 375°F with rack in middle. Generously butter a 9- by 2-inch round cake pan. Line bottom with a round of parchment paper and butter parchment.", 
            "Scrape seeds from vanilla bean into a food processor with tip of a paring knife (reserve pod for another use if desired). Add sugar and pulse to combine. Transfer to a bowl.", 
            "Pulse cranberries with 1/2 cup vanilla sugar in processor until finely chopped (do not purée).", 
            "Whisk together 2 cups flour, baking powder, and salt. Beat together 1 stick butter and 1 cup vanilla sugar in a bowl with an electric mixer at medium-high speed until pale and fluffy. Add eggs 1 at a time, beating well after each addition. Scrape down side and bottom of bowl. Reduce speed to low and mix in flour mixture and milk alternately in batches, beginning and ending with flour, until just combined.", 
            "Spread half of batter in pan, then spoon cranberries over it, leaving a 1/2-inch border around edge. Spoon small bits of the remaining batter over the top of the cranberries and smooth them with as gentle of a hand as possible.", 
            "Blend remaining 1/4 cup vanilla sugar with remaining tablespoon each of butter and flour using your fingertips. Crumble over top of cake.", 
            "Bake until a wooden pick inserted into cake (not into cranberry filling) comes out clean and side begins to pull away from pan, 45 to 50 minutes. Cool in pan 30 minutes, then remove from pan and cool completely, crumb side up.", 
            "Do ahead: Coffee cake can be made 1 day ahead and kept, tightly wrapped, at room temperature."
        ], 
        "date": "2008-12-12T19:51:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups (12 ounces or 340 grams) unsalted butter, at room temperature", 
            "1 package (8 ounces or 225 grams) Philadelphia brand cream cheese*, at room temperature", 
            "3 cups (595 grams) granulated sugar", 
            "6 large eggs", 
            "1 1/2 teaspoons pure vanilla extract plus 1/2 teaspoon almond extract (original recipe calls for 2 teaspoons vanilla but I liked this mix better)", 
            "3 cups (375 grams) all purpose flour", 
            "1 teaspoon salt", 
            "2 cups quartered hulled strawberries (about 12 ounces or 340 grams)", 
            "1/4 cup (60 ml) water", 
            "3 tablespoons (35 grams) sugar", 
            "1 tablespoon (15 ml) fresh lemon juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/03/cream-cheese-pound-cake-with-strawberry-coulis.jpg?w=753", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Everyday Cakes", 
            "Photo", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2009/03/cream-cheese-pound-cake-strawberry-coulis/", 
        "title": "cream cheese pound cake + strawberry coulis", 
        "directions": [
            "Combine strawberries, water, sugar and lemon juice in blender. Purée until very smooth, then press through a fine mesh strainer to remove the seeds. Cover and refrigerate until cold. Coulis can be prepared one day ahead."
        ], 
        "date": "2009-03-20T15:38:45+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "1/2 cup unsalted butter (1 stick, 4 ounces or 113 grams) at room temperature", 
            "1 1/2 cups (300 grams) granulated sugar", 
            "3 large eggs, separated", 
            "1 1/2 teaspoons vanilla extract", 
            "2 cups (16 ounces) sour cream", 
            "3 cups (375 grams) all-purpose flour", 
            "1 teaspoon baking powder", 
            "1 1/2 teaspoons baking soda", 
            "3/4 teaspoon table salt", 
            "Filling and Topping", 
            "2 cups or 12 ounces semi- or bittersweet chocolate chips or coarsely chopped chocolate bars", 
            "1/2 cup (100 grams) granulated sugar", 
            "1 teaspoon cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/sour-cream-chocolate-chip-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Chocolate", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/cubes-of-colossal-cheer/", 
        "title": "chocolate chip sour cream coffee cake", 
        "directions": [
            "Preheat oven to 350°F (175°C). Butter a 9-x-13-inch baking pan. If not nonstick coated, cover the bottom with a rectangle of parchment paper. Set pan aside.", 
            "In a large bowl, cream butter and 1 1/2 cups sugar. Beat in egg yolks and vanilla. Sift flour, baking soda, baking powder and salt together into a separate bowl. Alternately mix in sour cream and then dry ingredients into butter mixture until both are used up and the batter is smooth and very thick. In a medium bowl, beat eggs whites until stiff, then fold into batter.", 
            "In a small dish, whisk together sugar and cinnamon for filling and topping.", 
            "Spread half the cake batter in the bottom of prepared pan. Sprinkle with half of cinnamon-sugar mixture and 1 cup of chocolate chips. Dollop remaining cake batter over filling in spoonfuls. Use a rubber or offset spatula to gently spread it over the filling and smooth the top. Sprinkle batter with remaining cinnamon-sugar and remaining chocolate chips. With the palm of your hand, ever-so-gently press the chocolate chips a bit into the batter. No need to submerge them, you just want to make sure they adhere bit.", 
            "Bake for 40 to 50 minutes, rotating halfway through, until a tester inserted into the center of the cake comes out clean.", 
            "Updated 5/2/11: I made some small updates to this recipe’s instructions, adding a few details and weights and the missing salt measurement. I also swapped the first photo in the post with one that more accurately reflects the cakes final appearance (billowy, bronzed and strewn with button-like chocolate chips, sigh)."
        ], 
        "date": "2006-11-21T00:25:04+00:00"
    }, 
    {
        "ingredient_list": [
            "For the filling", 
            "1 1/2 cups (8 ounces) pitted dates, chopped", 
            "3/4 cup water", 
            "1 teaspoon finely grated orange (or mandarin or clementine) zest", 
            "For the crumbs", 
            "2 tablespoons packed brown sugar", 
            "1/4 cup raw or turbinado sugar", 
            "1/2 cup olive oil, coconut oil, melted butter or a mix of the above", 
            "3/4 cups rolled oats, I used quick-cooking but old-fashioned should work just fine", 
            "3/4 cup plus 2 tablespoons whole wheat flour, or a wholegrain flour mix of your choice", 
            "1/2 teaspoon ground cinnamon", 
            "A few gratings of fresh nutmeg", 
            "A pinch or two of ground cloves", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon coarse sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-breakfast-squares1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Dates", 
            "Photo", 
            "Snack", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2015/11/date-breakfast-squares/", 
        "title": "date breakfast squares", 
        "directions": [
            "Heat oven to 400 degrees. Either grease bottom and sides of an 8×8-inch pan or line the bottom and sides with parchment paper. ", 
            "In a small saucepan, combine dates, water and zest over low heat, simmering for 5 to 10 minutes, until liquid has absorbed and mixture has thickened. Set aside while you make the crumbs.", 
            "In a large bowl, mix the sugars and oil or butter together. Add the oats, flour, spices, baking soda and salt and stir to combine; the mixture should form a coarse rubble. ", 
            "Press half into the bottom of your prepared pan. Dollop the date mixture over it and use a small offset spatula (or whatever you have on hand) to spread the mixture smoothly over the crumbs. Don’t worry if the crumbs move around a little underneath; these bars don’t require perfection. Sprinkle remaining crumbs over date layer and press lightly to cover. ", 
            "Bake bars for 25 minutes, or until light brown at the edges. Cool in pan. Cut into squares. They’ll keep just fine at room temperature but will last up to a week in the fridge and longer in the freezer."
        ], 
        "date": "2015-11-20T11:50:15+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "3/4 pound (12 ounces, 340 grams or about 2 1/4 cups) dried dates", 
            "2 1/4 cups (530 ml) boiling water", 
            "1 1/2 teaspoons baking soda", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "3/4 cup (150 grams) granulated sugar", 
            "2 tablespoons (25 grams) light or dark brown sugar", 
            "2 large eggs", 
            "1/4 teaspoon fine sea or table salt", 
            "1 2/3 cups (210 grams) all-purpose flour", 
            "Sauce", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "1 cup (235 ml) heavy or whipping cream", 
            "1 cup plus 2 tablespoons (215 grams) brown sugar (light is called for, but I’d like to use dark next time)", 
            "2 teaspoons vanilla extract", 
            "To serve", 
            "Unsweetened whipped cream (optional, but please don’t skip it)", 
            "A few flakes of sea salt", 
            "Fresh mint leaves (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/date-cake-with-toffee-sauce-31.jpg?w=640", 
        "tags": [
            "Cake", 
            "Christmas", 
            "Dates", 
            "English", 
            "Everyday Cakes", 
            "Photo", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/11/date-cake-with-toffee-sauce/", 
        "title": "sticky toffee pudding", 
        "directions": [
            "Make the cake: Pit and roughly chop dates and place them in a heatproof bowl. Pour boiling water over them and stir in the baking soda. Cover the bowl and set it aside for 30 minutes.", 
            "Meanwhile, heat oven to 350°F (175°C). Butter a 9×13-inch baking pan. As an extra precaution, if you’re nervous about sticking (although this cake should not), you can line the bottom with a fitted rectangle of parchment paper.", 
            "Blend date-water mixture in a blender or food processor until smooth. In a large bowl, combine the melted butter and sugars. Whisk in eggs, then salt. Stir in the flour, then date puree. Pour the batter into the prepared pan and bake for 25 to 30 minutes, until a toothpick inserted into the center comes out clean. ", 
            "To serve it rustic-style, as we did, let it cool in the pan on a cooling rack. If you’d like to transfer it later to a serving plate, let cool in the pan for 20 minutes, then flip it out onto a cooling rack, removing the parchment paper if you used it.", 
            "Make the sauce: Combine butter, cream, sugar and vanilla in a larger saucepan than you think you’ll need (I vote for 2 1/2 to 3 quarts) over medium heat and bring to a simmer. Whisk for about 10 minutes, until the mixture thickens slightly. ", 
            "To serve: Cut the cake into squares (still warm is just fine). Drizzle each slice with toffee sauce, a pinch of sea salt, and top with a dollop of whipped cream, if desired. If your mint plant has survived the fall better than mine has, a leaf or two would be lovely here, too."
        ], 
        "date": "2014-11-06T12:06:14+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups coarsely chopped dates (10 ounces or 285 grams pitted)", 
            "1/3 cup orange liqueur such as Cointreau or Triple Sec", 
            "4 tablespoons (2 ounces or 55 grams) unsalted butter, at room temperature", 
            "3/4 cup (145 grams) light brown sugar, lightly packed", 
            "1 large egg", 
            "1 teaspoon pure vanilla extract", 
            "1 tablespoon grated orange zest (2 oranges)", 
            "2 cups (250 grams) all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1 teaspoon ground cinnamon", 
            "1 teaspoon ground nutmeg", 
            "1/4 teaspoon ground cloves", 
            "1 teaspoon kosher salt", 
            "3/4 cup freshly squeezed orange juice (3 oranges)", 
            "3/4 cup (3 ounces or 85 grams) coarsely chopped pecans"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/09/date-spice-loaf.jpg?w=750", 
        "tags": [
            "Cake", 
            "Dates", 
            "Everyday Cakes", 
            "Fruit", 
            "Orange", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/09/date-spice-loaf/", 
        "title": "date spice loaf", 
        "directions": [
            "Preheat the oven to 350°F. Butter the bottom of an 8 1/2 by 4 1/2 by 2 1/2-inch loaf pan. Line the bottom with parchment paper, then butter and flour the pan.", 
            "Combine the dates and orange liqueur in a small bowl and set aside for 30 minutes. Stir occasionally.", 
            "In the bowl of an electric mixer fitted with the paddle attachment, beat the butter and brown sugar together on medium speed for one minute. Scrape down the bowl. With the mixer on low, add the egg, vanilla, and orange zest. Sift together the flour, baking powder, baking soda, cinnamon, nutmeg, cloves, and salt. With the mixer still on low, add the flour mixture alternately with the orange juice to the creamed mixture, beating only until combined. By hand, stir in the dates with their liquid, and the pecans.", 
            "Pour the batter into the prepared loaf pan and smooth the top. Bake for 50 to 60 minutes, until a toothpick comes out clean. Cool in the pan for 10 minutes, then turn out onto a wire rack and cool completely.", 
            "Serving: Ina suggests you serve this bread with an orange cream cheese spread, which you can make by creaming 6 ounces of room temperature cream cheese with 1/3 cup sugar and one tablespoon orange zest in an electric mixer until just combined. "
        ], 
        "date": "2009-09-25T20:15:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/4 teaspoon salt", 
            "Scant 1/4 teaspoon ground cinnamon", 
            "5 tablespoons unsalted butter, at room temperature", 
            "3/4 cup (packed) light brown sugar", 
            "2 large eggs", 
            "1/3 cup flavorless oil, such as canola or safflower", 
            "Grated zest of 1 orange", 
            "1 1/2 teaspoons pure vanilla extract", 
            "8 purple or red plums (or even Italian prune plums, when they are in season), halved and pitted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/dimply-plum-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/08/dimply-plum-cake/", 
        "title": "dimply plum cake", 
        "directions": [
            "Center a rack in the oven and preheat the oven to 350°F. Butter an 8-inch square baking pan, dust the inside with flour, tap out the excess and put the pan on a baking sheet. (Alternately, you can use this spray to butter and flour, which is indeed my greatest baking Joy.)", 
            "Whisk the flour, baking powder, salt and cinnamon together.", 
            "Working with a mixer, beat the butter at medium speed until it’s soft and creamy, about 3 minutes. Add the sugar and beat for another 3 minutes, then add the eggs, one at a time, and beat for a minute after each egg goes in. Still working on medium speed, beat in the oil, zest and vanilla; the batter will look smooth and creamy, almost satiny. Reduce the mixer speed to low and add the dry ingredients, mixing only until they are incorporated.", 
            "Run a spatula around the bowl and under the batter, just to make sure there are no dry spots, then scrape the batter into the pan and smooth the top. Arrange the plums cut side up in the batter–Dorie says she usually makes four rows of four plum halves each–jiggling the plums a tad just so they settle comfortably into the batter.", 
            "Bake for about 30 to 40 minutes (Dorie says 40, mine was done in 30 so check early and often), or until the top is honey brown and puffed around the plums and a thin knife inserted into the center of the cake comes out clean. Transfer the cake to a rack and cool for 15 minutes during which time the plums juices will seep back into the cake then run a knife around the sides of the pan and unmold the cake. Invert and cool right side up.", 
            "Once cool, I dusted mine with powdered sugar. (It soaks into the plums, but keeps the cake a speckly white.)", 
            "You can wrap the cake and keep it at room temperature for up to 2 days, during which time it will get softer and moister."
        ], 
        "date": "2008-08-21T08:54:58+00:00"
    }, 
    {
        "ingredient_list": [
            "3 medium-to-large very ripe bananas", 
            "1/2 cup (115 grams) butter, melted", 
            "3/4 cup (145 grams) brown sugar (I use dark here; either light or dark work)", 
            "1 large egg", 
            "1 teaspoon pure vanilla extract", 
            "1 teaspoon baking soda", 
            "1/4 teaspoon table salt", 
            "1/2 teaspoon ground cinnamon (optional; I skip it)", 
            "1 cup (125 grams) all-purpose flour", 
            "1/2 cup Dutch-process cocoa powder", 
            "1 cup (about 6 ounces or 170 grams) semisweet or bittersweet chocolate chunks or chips"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/double-chocolate-banana-bread1.jpg?w=640", 
        "tags": [
            "Bananas", 
            "Chocolate", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/03/double-chocolate-banana-bread/", 
        "title": "double chocolate banana bread", 
        "directions": [
            "Heat your oven to 350°F. Butter a 9×5-inch loaf pan, or spray it with a nonstick baking spray.", 
            "Mash bananas in the bottom of a large bowl. (You’ll have a little over 1 cup mashed banana total.) Whisk in melted butter, then brown sugar, egg, and vanilla. Place baking soda, salt, cinnamon (if using), flour and cocoa powder in a sifter or fine-mesh strainer and sift over wet ingredients. (My cocoa is almost always lumpy, so this is essential for me.) Stir dry and wet ingredients with a spoon until just combined. Stir in chocolate chunks or chips.", 
            "Pour into prepared pan and bake 55 to 65 minutes, until a tester or toothpick inserted into the center of the cake comes out batter-free. (A melted chocolate chip smear is expected, however.) Cool in pan for 10 to 15 minutes, then run a knife around the edge and invert it out onto a cooling rack. Serve warm or at room temperature. ", 
            "The banana bread will keep for up to 4 days at room temperature. I keep mine wrapped in foil. It goes without saying that it has never actually lasted that long."
        ], 
        "date": "2014-03-17T12:33:32+00:00"
    }, 
    {
        "ingredient_list": [
            "For crust", 
            "3 1/2 ounces (100 grams or 1 cup) graham crackers, crumbled", 
            "2 tablespoons (25 grams) sugar", 
            "3 tablespoons (45 grams) unsalted butter, melted", 
            "For filling", 
            "1 teaspoon unflavored gelatin (from a 1/4-ounce or 7-gram envelope, will be just about half an envelope)", 
            "1/4 cup (60 ml) whole milk", 
            "8 ounces (225 grams) cream cheese, softened", 
            "2 large eggs", 
            "3/8 teaspoon salt", 
            "1 cup dulce de leche (12 1/2-ounce or 355-gram can) (recipe follows)", 
            "For glaze", 
            "3 ounces (85 grams) fine-quality bittersweet chocolate (not unsweetened), coarsely chopped", 
            "1/2 stick (2 ounces or 55 grams) unsalted butter, cut into pieces", 
            "2 teaspoons light corn syrup"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/dulce-de-leche-cheesecake-squares.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cake", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/02/dulce-de-leche-cheesecake-squares/", 
        "title": "dulce de leche cheesecake squares", 
        "directions": [
            "Make crust: Put oven rack in middle position and preheat oven to 325°F. Line bottom and sides of an 8-inch square baking pan with 2 sheets of foil (crisscrossed), leaving a 2-inch overhang on all sides.", 
            "Finely grind crackers with sugar and a pinch of salt in a food processor. With motor running, add butter, blending until combined. Press mixture evenly onto bottom of baking pan. Bake 10 minutes, then cool in pan on a rack 5 minutes.", 
            "Make filling: Sprinkle gelatin over milk in a small bowl and let stand 2 minutes to soften. Beat together cream cheese, eggs, salt, and gelatin mixture in a bowl with an electric mixer at medium speed until well combined, about 2 minutes, then stir in dulce de leche gently but thoroughly. Pour filling over crust, smoothing top, then bake in a hot water bath (I was able to fit mine in a 9×13-inch baking pan) in oven until center is just set, about 45 minutes. Cool cheesecake completely in pan on rack, about 2 hours. Chill, covered, at least 6 hours.", 
            "Glaze cake within 2 hours of serving: Heat all glaze ingredients in a double boiler or a small metal bowl set over a saucepan of barely simmering water, stirring until smooth, then pour over cheesecake, tilting baking pan to coat top evenly. Chill, uncovered, 30 minutes.", 
            "Lift cheesecake from pan using foil overhang and cut into 1-inch squares with a thin knife, wiping off knife after each cut. (Don’t skip this step! A clean knife is essential for uber-neat squares.)", 
            "Note: Cheesecake (without glaze) can be chilled up to 3 days.", 
            "Dulce de Leche (Milk Caramel)", 
            "I know that most of the world makes this by boiling the milk inside a closed can, but honestly, that scares the bejesus out of me and according to the Carnation can label I pulled this technique from, is not recommended by them (likely because they do not want to get sued, but still). This method works just as well.", 
            "Pour one can (14 ounce) sweetened condensed milk into top of double-boiler pan; cover. Place over boiling water. Cook over low heat, stirring occasionally, for 40 to 50 minutes, or until thick and light caramel-colored.", 
            "Remove from heat. Whisk until smooth."
        ], 
        "date": "2008-02-06T13:08:40+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups (295 grams) all-purpose flour", 
            "2 1/4 teaspoons baking powder", 
            "3/4 teaspoon baking soda", 
            "3 tablespoons (40 grams) granulated sugar", 
            "1/4 teaspoon fine sea or table salt", 
            "6 tablespoons (85 grams or 3 ounces) unsalted butter, cold, cut into chunks", 
            "2 large egg yolks", 
            "3/4 cup plus 2 tablespoons (205 ml) heavy cream", 
            "3 tablespoons (35 grams) raw or turbinado sugar", 
            "1 pound (455 grams) strawberries or mixed berries, hulled and halved if large", 
            "2 tablespoons (25 grams) granulated sugar, or more to taste", 
            "1 tablespoon (15 ml) fresh lemon juice (optional)", 
            "1 cup (235 ml) heavy or whipping cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/easy-drop-berry-shortcakes-1.jpg?w=750", 
        "tags": [
            "Blackberries", 
            "Blueberries", 
            "Everyday Cakes", 
            "Photo", 
            "Quick", 
            "Raspberries", 
            "Scones/Biscuits", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2017/06/easy-drop-berry-shortcakes/", 
        "title": "easy drop berry shortcakes", 
        "directions": [
            "Make shortcakes: Heat oven to 400 degrees F. Line a large baking sheet with parchment paper.\nIn a large bowl, whisk together flour, baking powder, baking soda, granulated sugar, and salt until thoroughly combined. Add butter and using your fingertips or a pastry blender, break it into small bits, the largest should be no bigger than a small pea. In a small bowl, whisk yolks with a splash of cream, then pour rest of cream in and whisk to combine. Pour into butter-flour mixture and use a rubber spatula to mix and mash it together into one cohesive dough.", 
            "Divide dough into 6 (for large, 3 1/2 to 3 3/4-inch wide and up to 2-inch tall) shortcakes or 8 smaller ones. I do this by pressing the dough somewhat flat into the bottom of the bowl (to form a circle) and using a knife to divide it into pie-like wedges. Place raw or turbinado sugar in a small bowl. Roll each wedge of shortcake into a ball in your hands and roll it through the raw/turbinado sugar, coating it in all but a small area that you should leave bare. (I found that the sugar underneath the shortcakes would burn, so better to leave it off.)\nPlace it, bare spot down, on the prepared baking sheet. Repeat with remaining wedges of dough. Bake for 15 minutes, until lightly golden all over. Let cool completely on tray or on a cooling rack.\nWhile cooling, prepare fruit and cream:  Mix berries, 2 tablespoons sugar (more or less to taste), and lemon juice, if desired, in a bowl and let macerate so that the juices run out.\nIn a larger bowl, beat cream until soft peaks form. Add sugar to taste, or leave unsweetened, if that’s your preference.\nTo serve: Carefully split each cooled shortcake with a serrated knife. Spoon berries and their juices over bottom half. Heap generously with whipped cream. Place shortcake “lid” on top. Eat immediately and don’t forget to share.\nDo ahead: Shortcakes keep well for a day at room temperature. I prefer to keep them uncovered. I found on the second day, they were a little more firm but not half-bad, but they’re definitely “best” on day one.\n"
        ], 
        "date": "2017-06-13T11:56:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (115 grams or 4 ounces) unsalted butter, softened", 
            "1 cup (190 grams) firmly packed light brown sugar", 
            "1/2 cup (100 grams) granulated sugar", 
            "1 large egg, at room temperature", 
            "1 cup (235 ml) buttermilk", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 1/2 cups (195 grams) all-purpose flour", 
            "3/4 cup (60 grams) dutch-processed cocoa powder (see above for a natural cocoa adjustment)", 
            "1/4 teaspoon baking soda", 
            "1/2 teaspoon baking powder", 
            "1/4 teaspoon fine sea or table salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/08/4857648803_f2a2ba9aee_b.jpg?w=750", 
        "tags": [
            "Cake", 
            "Chocolate", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/08/everyday-chocolate-cake/", 
        "title": "everyday chocolate cake", 
        "directions": [
            "Preheat the oven to 325°F. Butter and lightly flour a 9x5x3-inch loaf pan, or spray it with a butter-flour spray. In a large bowl, on the medium speed of an electric mixer, cream the butter until smooth. Add the sugars and beat until fluffy, about 3 minutes. Add the egg and beat well, then the buttermilk and vanilla. Don’t worry if the batter looks a little uneven. Sift the flour, cocoa, baking soda, baking powder and salt together right into your wet ingredients. Stir together with a spoon until well-blended but do not overmix. Scrape down the batter in the bowl, making sure the ingredients are well blended.", 
            "Pour the batter into the prepared loaf pan. Bake for 60 to 70 minutes, or until a cake tester inserted into the center of the loaf comes out clean. Cool in pan on a rack for about 10 to 15 minutes, at which point you can cool it the rest of the way out of the pan. Serve with whipped cream and fresh berries, if you’re feeling fancy."
        ], 
        "date": "2010-08-03T21:19:05+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups chocolate cookie crumbs or about 260 grams chocolate cookies", 
            "1 1/2 cups pecans, toasted and cooled", 
            "1/2 cup bourbon", 
            "1 cup powdered sugar", 
            "3 tablespoons unsweetened cocoa powder", 
            "1 1/2 tablespoons honey or molasses", 
            "Sprinkles, sanding or coarse sugar, additional chopped nuts, extra cookie crumbs or coconut to roll balls in"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/fudgy-bourbon-balls1.jpg?w=640", 
        "tags": [
            "Bourbon", 
            "Candy", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/12/fudgy-bourbon-balls/", 
        "title": "fudgy bourbon balls", 
        "directions": [
            "In the bowl of a food processor, pulse together the cookies, whole or already in crumbs, and pecans until the nuts are finely ground. In small dish, whisk together the bourbon, powdered sugar, cocoa and honey until smooth. Add to the food processor bowl and pulse until just combined. ", 
            "Set aside at room temperature, uncovered, for 30 minutes to 1 hour, or up to 4 hours, to give the crumbs a chance to absorb the liquid and become more fudgy and easier to roll.", 
            "Scoop dough into about 1-inch or 1 tablespoon-sized balls and roll them in toppings of your choice. The balls can be stored at room temperature or in the fridge. If at room temperature, you can leave them covered for more moisture or uncovered if you like them with more of a crust. Balls will keep for as long as you can hide them from people. ", 
            "Notes: I’m going to do a little Q&A with the comment section that lives in my head. :) "
        ], 
        "date": "2015-12-31T11:25:56+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, cut into chunks, plus more for pan", 
            "1 cup water", 
            "1 1/2 teaspoons baking soda", 
            "2/3 cup packed dark-brown sugar", 
            "1 cup unsulfured molasses", 
            "1 tablespoon freshly grated ginger (optional)", 
            "2 large eggs, room temperature, lightly beaten", 
            "2 1/2 cups all-purpose flour, plus more for pan", 
            "2 teaspoons ground ginger", 
            "1 1/2 teaspoons ground cinnamon", 
            "1/2 teaspoon ground cloves", 
            "1/2 teaspoon ground or freshly grated nutmeg", 
            "1/2 teaspoon salt", 
            "2 teaspoons baking powder", 
            "Confectioners’ sugar, for dusting finished cake", 
            "Lightly sweetened whipped cream, essential for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/gingerbread-snacking-cake1.jpg?w=640", 
        "tags": [
            "Christmas", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/12/gingerbread-snacking-cake/", 
        "title": "gingerbread snacking cake", 
        "directions": [
            "Heat oven to 350 degrees. Line a 9×13-inch baking pan with parchment paper. Butter and flour parchment and sides of cake pan, or spray both with a nonstick baking spray.", 
            "Bring water to a boil in a medium saucepan (or large one, if you’d like to make the cake entirely in there) and add baking soda — it will foam up! this is fun! Let stand for 5 minutes, then stir in butter until melted. Whisk in dark brown sugar, molasses and fresh ginger, if using. Mixture is usually just lukewarm by now, but if it still feels quite hot to the touch, set it aside to 10 to 15 minutes to cool further before using.", 
            "Place flour, ground ginger, cinnamon, cloves, nutmeg, salt and baking powder in a fine-mesh strainer or sifter so that you can sift them over the wet ones in a minute. ", 
            "Transfer molasses mixture to a large mixing bowl if your saucepan isn’t large enough to make the batter in. Whisk in eggs until just combined. Sift dry ingredients over wet, then stir the wet and dry ingredients together until just combined.", 
            "Pour batter into prepared pan; bake for 30 to 35 minutes, until a toothpick inserted into the center of the cake comes out clean. Transfer cake to a wire rack and let cool completely. Once fully cool, cut around cake to make sure no parts are sticking to the side and invert cake out onto a rack, then onto a serving plate. Dust with confectioners’ sugar and cut into squares. Please, promise you’ll serve this with lightly sweetened, softly whipped cream. They’re made for each other.", 
            "Do ahead: Whipped cream needs to be stored in the fridge, of course. Cake keeps at room temperature for up to a week in an airtight container. It gets better with age, just like you, babe. "
        ], 
        "date": "2013-12-23T12:27:19+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups old-fashioned oatmeal", 
            "1 cup sliced almonds", 
            "1 cup shredded coconut, loosely packed (I used unsweetened)", 
            "1/2 cup toasted wheat germ", 
            "2/3 cup honey", 
            "1 1/2 teaspoons pure vanilla extract", 
            "1/4 teaspoon kosher salt", 
            "1 1/2 cup dried fruit, or a mix of dried fruit (I used chopped apricots, cranberries and raisins)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/granola-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Coconut", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/09/granola-bars/", 
        "title": "granola bars", 
        "directions": [
            "Preheat your oven to 350°F. Butter an 8×12-inch baking dish (lacking this, I used a 9×13-inch) and line it with parchment paper.", 
            "Toss the oatmeal, almonds, and coconut together on a sheet pan and bake for 10 to 12 minutes, stirring occasionally, until lightly browned. Transfer the mixture to a large mixing bowl and stir in the wheat germ. Reduce the oven temperature to 300°F.", 
            "While the mixture is still warm, stir in the honey, vanilla and salt until the mixture is well coated, then the dried fruit. Pour the mixture into your prepared baking dish and press, press, press it in (wet fingers and/or a silicon spatula work great for this) until the mixture is packed as tightly as possible.", 
            "Bake for 25 to 30 minutes, until light golden brown. Cool for 2 to 3 hours before cutting into squares — your best serrated knife is great for this.", 
            "You can store these in an airtight container at room temperature for a week or two, as you would cookies, however, I prefer to store mine in the freezer. I find that they stay the most crisp this way as all granola tends to soften at room temperature after a day or more. "
        ], 
        "date": "2009-09-02T11:24:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 to 2-inch segment of vanilla bean (optional)", 
            "1 quart whole milk (cow or goat, or a combination thereof)", 
            "1 cup granulated or raw sugar", 
            "2-inch segment of cinnamon stick (optional)", 
            "1/4 teaspoon coarse or flaky sea salt (optional, but ooh, it’s good here)", 
            "1/4 teaspoon baking soda dissolved in 2 teaspoons water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/01/homemade-dulce-de-leche-or-cajeta.jpg?w=750", 
        "tags": [
            "Candy", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/01/homemade-dulce-de-leche/", 
        "title": "homemade dulce de leche", 
        "directions": [
            "Split vanilla bean lengthwise. Scrape out seeds and place them, along with the empty vanilla pods, milk, sugar, cinnamon and salt (if using) in a medium-sized (err slightly on the large side) pot. Bring mixture to a simmer, stirring occasionally. Remove the pot from the heat and slowly stir in the baking soda-water mixture — it’s going to foam up if using goats milk, due to the acidity. This is why we use a larger pot; you might want to do this in the sink. ", 
            "Return the mixture to the stove and keep it at a brisk simmer; if too hot, the mixture will boil over, if too low, it will take forever. Cook, checking in on it occasionally (every 15 minutes) to give it a stir to make sure nothing is sticking to the bottom, until the mixture turns a light brown, about 1 hour.", 
            "Check in on and stir the mixture more frequently (about every 5 minutes) as it begins to take on a caramel-brown color and thickens to the consistency of maple syrup, then plant yourself in front of the stove and stir the mixture until it reaches a deeper copper color. ", 
            "Pour the mixture through a fine-mesh strainer [updated to note: it’s rather thick and this step can be more trouble than it’s worth; feel free to skip it and just fish the cinnamon and/or bean pods out] and into jars. Use immediately, or cool completely, storing in the fridge for up to one month with an airtight lid. Rewarm as needed to soften the caramel; a microwave is efficient but you can also warm the jar in a 1- to 2-inch puddle (shorter than the jar lid, of course) of simmering water in a saucepan until it re-liquefies. If mixture seems too thick to pour even after fully reheating, you can stir in a little water, 1 teaspoon at a time.", 
            "Serve it: Over everything. Here, I drizzled it on some leftover part-whole wheat crepes from a blintz project (cheese blintz recipe, anyone?) filled with sliced bananas and mango, but it’s also wonderful on ice cream, cakes, churros, or a spoon."
        ], 
        "date": "2014-01-24T11:22:49+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 ripe bananas, smashed", 
            "1/3 cup (75 grams) melted salted butter", 
            "3/4 to 1 cup (145 to 190 grams) light brown sugar (depending on the level of sweetness you prefer, I always use the smaller amount)", 
            "1 egg, beaten", 
            "1 teaspoon (5 ml) vanilla", 
            "1 tablespoon (15 ml) bourbon (optional)", 
            "1 teaspoon (5 grams) baking soda", 
            "Pinch of salt", 
            "1 teaspoon (3 grams) cinnamon", 
            "Up to 1/2 teaspoon (1) nutmeg", 
            "Pinch of ground cloves", 
            "1 1/2 cups (190 grams) flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/jacked-up-banana-bread.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Bourbon", 
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/jacked-up-banana-bread/", 
        "title": "jacked-up banana bread", 
        "directions": [
            "Preheat the oven to 350°F. With a wooden spoon, mix butter into the mashed bananas in a large mixing bowl. Mix in the sugar, egg, vanilla and bourbon, then the spices. Sprinkle the baking soda and salt over the mixture and mix in. Add the flour last, mix. Pour mixture into a buttered 4×8 inch loaf pan. Bake for 50 minutes to one hour, or until a tester comes out clean. Cool on a rack. Remove from pan and slice to serve.", 
            "Note: Due to my unhealthy obsession with tiny things, I split this into two mini-loaf pans. It took 45 minutes to bake two perfect halves, but of course, may run longer or shorter in your oven."
        ], 
        "date": "2006-11-16T18:00:50+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup sweetened flaked coconut", 
            "1 stick unsalted butter, softened", 
            "1 1/4 cups granulated sugar", 
            "1 tablespoon grated Key lime zest", 
            "2 large eggs", 
            "1 3/4 cups self-rising flour*", 
            "3/4 cup whole milk", 
            "1/4 cup fresh Key lime juice, divided", 
            "1 cup confectioners sugar", 
            "1 tablespoon rum (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/02/key-lime-coconut-cake.jpg?w=751", 
        "tags": [
            "Cake", 
            "Citrus", 
            "Coconut", 
            "Everyday Cakes", 
            "Lime", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/02/key-lime-coconut-cake/", 
        "title": "key lime coconut cake", 
        "directions": [
            "Preheat oven to 350°F with rack in middle. Generously butter an 8- by 8-inch square or 9- by 2-inch round cake pan and line bottom with a round of parchment paper.", 
            "Toast coconut in a small baking pan in oven, stirring once or twice, until golden, 8 to 12 minutes. Cool. Leave oven on.", 
            "Beat together butter, granulated sugar, and zest with an electric mixer until fluffy. Beat in eggs one at a time. Stir together flour and 1/2 cup coconut (reserve remainder for topping). Stir together milk and 2 tablespoons lime juice. At low speed, mix flour and milk mixtures into egg mixture alternately in batches, beginning and ending with flour.", 
            "Spoon batter into pan and smooth top. Bake until golden and a wooden pick inserted into center comes out clean, 40 to 45 minutes. Cool to warm, then turn out of pan and discard parchment.", 
            "Whisk together confectioners sugar, remaining 2 tablespoons lime juice, and rum (if using) and pour over cake. Sprinkle with remaining coconut.", 
            "* Make your own: You can make your own self-rising flour — I did, when I realized I had self-rising flour in the pantry but my last known use of it was nearly three years ago. Unfortunately, there are many recipes out there and they don’t all agree. The most common one has you add for each cup of flour 1/2 teaspoon of salt and 1 1/2 teaspoons baking powder but some also suggest 1 teaspoon baking powder instead. I’m going to suggest that you use the 1 teaspoon level because I used the higher one and my cake sunk ever so slightly in the center, a suggestion that it had too much leavening in it. So: For every cup of flour, add a 1/2 teaspoon of salt and 1 teaspoon of baking powder, whisk together very well and sift the mixture. Measure your self-rising flour from there."
        ], 
        "date": "2009-02-27T00:23:10+00:00"
    }, 
    {
        "ingredient_list": [
            "For the crust: ", 
            "1/2 pound unsalted butter, at room temperature", 
            "1/2 cup granulated sugar", 
            "2 cups flour", 
            "1/8 teaspoon kosher salt", 
            "For the full-size lemon layer: ", 
            "6 extra-large eggs at room temperature", 
            "2 1/2 cups granulated sugar", 
            "2 tablespoons grated lemon zest (4 to 6 lemons)", 
            "1 cup freshly squeezed lemon juice", 
            "1 cup flour", 
            "4 extra-large eggs at room temperature", 
            "1 2/3 cups granulated sugar", 
            "1 tablespoon + 1 teaspoon grated lemon zest (3 to 4 lemons)", 
            "2/3 cup freshly squeezed lemon juice", 
            "2/3 cup flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/01/lemon-bars.jpg?w=750", 
        "tags": [
            "Bars", 
            "Citrus", 
            "Cookie", 
            "Fruit", 
            "Lemon", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/01/lemon-bars/", 
        "title": "lemon bars", 
        "directions": [
            "Confectioners’ sugar, for dusting", 
            "Preheat the oven to 350°F and grease a 9 by 13 by 2-inch baking sheet.", 
            "For the crust, cream the butter and sugar until light in the bowl of an electric mixer fitted with the paddle attachment. Combine the flour and salt and, with the mixer on low, add to the butter until just mixed. Dump the dough onto a well-floured board and gather into a ball. Flatten the dough with floured hands and press it into the greased baking sheet, building up a 1/2-inch edge on all sides. Chill.", 
            "Bake the crust for 15 to 20 minutes, until very lightly browned. Let cool on a wire rack. Leave the oven on.", 
            "For the lemon layer, whisk together the eggs, sugar, lemon zest, lemon juice, and flour. Pour over the crust and bake for 30 to 35 minutes (less if you are using the thinner topping), or about five minutes beyond the point where the filling is set. Let cool to room temperature.", 
            "Cut into rectangles and dust with confectioners’ sugar."
        ], 
        "date": "2008-01-07T23:12:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups (190 grams) + 1 tablespoon (10 grams) all-purpose flour (if you’re skipping the fruit, you can also skip the last tablespoon of flour)", 
            "2 teaspoons (10 grams) baking powder", 
            "1/2 teaspoon kosher salt", 
            "1 cup (230 grams) plain whole-milk yogurt", 
            "1 cup plus 1 tablespoon (215 grams) sugar", 
            "3 extra-large eggs", 
            "2 teaspoons grated lemon zest (approximately 2 lemons)", 
            "1/2 teaspoon pure vanilla extract", 
            "1/2 cup (120 ml) vegetable oil", 
            "1 1/2 cups (about 255 grams) blueberries, fresh or frozen, [updated to note] no need to thaw (I used wild blueberries, hence the tiny size)", 
            "1/3 cup (80 ml) freshly squeezed lemon juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/04/lemon-yogurt-anything-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Citrus", 
            "Everyday Cakes", 
            "Fruit", 
            "Lemon", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/04/lemon-yogurt-anything-cake/", 
        "title": "lemon yogurt anything cake", 
        "directions": [
            "Preheat the oven to 350°F. Grease an 8 1/2 by 4 1/4 by 2 1/2-inch loaf pan. Line the bottom with parchment paper. Grease and flour the pan.", 
            "Sift together 1 1/2 cups flour, baking powder, and salt into 1 bowl. In another bowl, whisk together the yogurt, 1 cup sugar, the eggs, lemon zest, vanilla and oil. Slowly whisk the dry ingredients into the wet ingredients. Mix the blueberries with the remaining tablespoon of flour, and fold them very gently into the batter. Pour the batter into the prepared pan and bake for about 50 (+) minutes, or until a cake tester placed in the center of the loaf comes out clean.", 
            "Meanwhile, cook the 1/3 cup lemon juice and remaining 1 tablespoon sugar in a small pan until the sugar dissolves and the mixture is clear. Set aside.", 
            "When the cake is done, allow it to cool in the pan for 10 minutes before flipping out onto a cooling rack. Carefully place on a baking rack over a sheet pan. While the cake is still warm, pour the lemon-sugar mixture over the cake and allow it to soak in (a pastry brush works great for this, as does using a toothpick to make tiny holes that draw the syrup in better). Cool."
        ], 
        "date": "2008-04-07T11:50:17+00:00"
    }, 
    {
        "ingredient_list": [
            "2 sticks (225 grams or 8 ounces) unsalted butter, at room temperature", 
            "2 1/2 cups (500 grams) sugar", 
            "4 extra-large eggs, at room temperature", 
            "1/3 cup grated lemon zest (6 to 8 large lemons)", 
            "3 cups (375 grams) all-purpose flour", 
            "1/2 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1 teaspoon (5 grams) kosher salt", 
            "3/4 cup (175 ml) plus 3 1/2 tablespoons (50 ml) freshly squeezed lemon juice", 
            "3/4 cup (175 ml) buttermilk, at room temperature", 
            "1 teaspoon (5 ml) vanilla extract", 
            "2 cups (240 grams) confectioners’ sugar, sifted."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/10/lemon-cake.jpg?w=750", 
        "tags": [
            "Celebration Cakes", 
            "Citrus", 
            "Easter", 
            "Everyday Cakes", 
            "Lemon", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/10/lemony-persnick/", 
        "title": "lemon cake", 
        "directions": [
            "1. Heat oven to 350 degrees F (175 degrees C). Grease and flour two 8 1/2-by-4 1/4-by-2 1/2-inch loaf pans, and line the bottoms with parchment paper.", 
            "2. Cream butter and 2 cups sugar in the bowl of an electric mixer fitted with a paddle attachment for about 5 minutes, or until light and fluffy. Mixing at medium speed, add eggs, one at a time, and lemon zest.", 
            "3. Sift together flour, baking powder, baking soda and salt in a bowl. In another bowl, combine 1/4 cup lemon juice, buttermilk and vanilla. Add flour and buttermilk mixtures alternately to butter and sugar mixture, beginning and ending with flour. Divide batter evenly between pans, smooth tops, and bake for 45 minutes to 1 hour, until a cake tester comes out clean.", 
            "4. Combine 1/2 cup sugar with 1/2 cup lemon juice in a small saucepan, and cook over low heat until sugar dissolves.", 
            "5. When cakes are done, let them cool 10 minutes. Invert them onto a rack set over a tray, and spoon lemon syrup over cakes. Let cakes cool completely.", 
            "6. For glaze, combine confectioners’ sugar and remaining 3 1/2 tablespoons lemon juice in a bowl, mixing with a whisk until smooth. Pour over top of cakes, and allow glaze to drizzle down the sides."
        ], 
        "date": "2006-10-09T09:18:58+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound (2 sticks or 8 ounces or 226 grams) butter, at room temperature, plus more for greasing the pan", 
            "1 1/2 cups (200 grams) all-purpose flour, plus more for dusting the pan", 
            "1/2 teaspoon (3 grams) baking powder", 
            "Salt", 
            "4 large eggs, separated", 
            "3/4 cup plus 2 tablespoons (186 grams) sugar", 
            "1 tablespoon Cognac [brandy works as well, as does rum, as would one teaspoon of an extract of your choice]", 
            "1 1/2 teaspoons grated lemon zest."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/08/3786776229_18db5a68fe_b.jpg?w=753", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/08/lighter-airy-pound-cake/", 
        "title": "lighter, airy pound cake", 
        "directions": [
            "1. Preheat the oven to 350 degrees. Butter and flour a loaf pan. Sift the flour onto waxed paper and then spoon it gently back into the sifter, adding the baking powder and a good pinch of salt. Sift the mixture twice more, each time spooning it lightly into the sifter. [I know what you must be thinking: Beard expect me to sift my dry ingredients three times? But oh, it lends to the most delicate, light crumb and texture. Don’t skimp!]", 
            "2. Using an electric mixer, whip the egg whites until they hold soft peaks and then gradually beat in 1/2 cup (100 grams) of the sugar, two tablespoons at a time. Transfer to a bowl.", 
            "3. Fit the electric mixer with a paddle attachment and cream the butter until light and fluffy. Beat in the remaining six tablespoons (86 grams) of sugar until fluffy. Beat in the egg yolks until light and lemon-colored and then add the Cognac and zest.", 
            "4. Gradually fold the sifted flour mixture into the butter-egg mixture. Fold in the beaten egg whites just until the batter is smooth. Pour batter into the prepared pan and bake in the oven for 35 to 45 minutes or until a toothpick pierced in the center comes up clean. Cool in pan ten minutes on a rack, then cool the rest of the way out of the pan."
        ], 
        "date": "2009-08-05T12:25:47+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "1 cup whole milk plain unsweetened yogurt (this is the ideal; however, I had success with 2% Greek yogurt)", 
            "1/3 cup vegetable oil (olive oil works as well, for a slightly different flavor profile)", 
            "1 cup sugar", 
            "zest of one lime", 
            "1/4 cup lime juice", 
            "2 eggs", 
            "1 2/3 cups all-purpose flour", 
            "1 1/2 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1/8 teaspoon salt", 
            "Sauce", 
            "12 ounces fresh blackberries (frozen should work as well, but you should start with half the water)", 
            "1/4 cup water", 
            "3 tablespoons sugar", 
            "1 tablespoon fresh lime juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/lime-yogurt-cake-with-blackberry-sauce1.jpg?w=500", 
        "tags": [
            "Blackberries", 
            "Cake", 
            "Citrus", 
            "Everyday Cakes", 
            "Lime", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/04/lime-yogurt-cake-with-blackberry-sauce/", 
        "title": "lime yogurt cake with blackberry sauce", 
        "directions": [
            "Make the cake: Preheat the oven to 350 degrees. Grease the sides of a 9-inch round cake pan or springform pan with oil (I used a butter and flour spray out of habit, which works as well) and line the bottom with parchment paper if the pan is not springform.", 
            "In a large mixing bowl, whisk together the yogurt, oil, sugar, lime zest and juice. Add the eggs one by one, whisking well after each addition. Sift flour, baking powder, baking soda and salt together, right over your yogurt batter. Stir with a spoon until just combined.", 
            "Pour the batter into the prepared cake pan and bake for 35 to 40 minutes, until the top is golden brown and a knife inserted in the center comes out clean. Transfer the pan to a cooling rack and let stand for 10 minutes. Run a knife around the pan to loosen. If you’re using the springform pan, unclasp the sides. Otherwise, flip the cake onto a plate and flip it back on the rack. Serve slightly warm or at room temperature.", 
            "Make sauce: Combine blackberries, water, sugar and lime juice in blender or food processor. Purée until very smooth, then press through a fine mesh strainer to remove the seeds. Cover and refrigerate until cold.", 
            "Do ahead: This cake keeps very well for up to three days (or so I hear, but have not practiced), wrapped in plastic at room temperature. The sauce can be made up three days in advance, as well. It can also be frozen for future uses."
        ], 
        "date": "2010-04-18T10:49:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (1 stick) salted butter, cut into large pieces", 
            "1 1/2 cups graham crackers crumbs (about 8 graham crackers, pulsed in a food processor)", 
            "1 1/2 cups chocolate chips", 
            "1 cup butterscotch chips", 
            "1 cup shredded coconut", 
            "1 cup pecans, coarsely chopped", 
            "1/3 cup sweetened condensed milk (just under half a small can)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/lookin-swell-dolly1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Candy", 
            "Chocolate", 
            "Coconut", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/10/lookin-swell-dolly/", 
        "title": "hello dolly bars", 
        "directions": [
            "Preheat oven to 350 degrees.", 
            "Melt butter in microwave in heatproof bowl until just melted when stirred. Add graham cracker crumbs. Mix and then press evenly into the bottom of 8×8 baking pan. ", 
            "Layer coconut, pecans, butterscotch and chocolate chips on top of graham cracker base. Pour sweetened condensed milk over whole mixture. ", 
            "Bake in oven for 25 to 30 minutes, or until the top is light brown.", 
            "Like all brownie and cookie bars, I find them easier to cut cleanly once they’ve been thoroughly cooled in the fridge, but I also don’t expect you to be able to wait that long. ", 
            "Because they’re so sweet, I like to cut them into really tiny squares. Those mini-cupcake liners come in handy as well, too, so they don’t all cluster together, not that anyone would mind. "
        ], 
        "date": "2007-10-08T21:07:08+00:00"
    }, 
    {
        "ingredient_list": [
            "3 1/2 cups (440 grams) all-purpose flour", 
            "1 tablespoon (15 grams) teaspoon (5 grams) baking powder [see explanation above]", 
            "1 teaspoon (5 grams) baking soda", 
            "1/2 teaspoon kosher salt", 
            "4 teaspoons (about 8 grams) ground cinnamon", 
            "1/2 teaspoon ground cloves", 
            "1/2 teaspoon ground allspice", 
            "1 cup (235 ml) vegetable oil", 
            "1 cup (340 grams) honey", 
            "1 1/2 cups (300 grams) granulated sugar", 
            "1/2 cup (95 grams) brown sugar", 
            "3 large eggs at room temperature", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 cup warm (235 ml) coffee or strong tea", 
            "1/2 cup (120 ml) fresh orange juice", 
            "1/4 cup (60 ml) rye or whiskey", 
            "1/2 cup (45 to 55 grams) slivered or sliced almonds (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/majestic-and-moist-honey-cake.jpg?w=753", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/09/majestic-and-moist-honey-cake/", 
        "title": "majestic and moist honey cake", 
        "directions": [
            "Fits in three loaf pans, two 9-inch square or round cake pans, one 9 or 10 inch tube or bundt cake pan, or one 9 by 13 inch sheet cake. I made mine in two full-size loaf pans plus two miniature ones.", 
            "Preheat oven to 350°F. Generously grease pan(s) with non-stick cooking spray. For tube or angel food pans, line the bottom with lightly greased parchment paper, cut to fit.", 
            "In a large bowl, whisk together the flour, baking powder, baking soda, salt, cinnamon, cloves and allspice. Make a well in the center, and add oil, honey, white sugar, brown sugars, eggs, vanilla, coffee or tea, orange juice and rye or whiskey, if using. (If you measure your oil before the honey, it will be easier to get all of the honey out.)", 
            "Using a strong wire whisk or in an electric mixer on slow speed, stir together well to make a thick, well-blended batter, making sure that no ingredients are stuck to the bottom.", 
            "Spoon batter into prepared pan(s). Sprinkle top of cake(s) evenly with almonds, if using. Place cake pan(s) on two baking sheets, stacked together (this will ensure the cakes bake properly with the bottom baking faster than the cake interior and top).", 
            "Bake until cake tests done, that is, it springs back when you gently touch the cake center. For angel and tube cake pans, this will take 60 to 75 minutes, loaf cakes, about 45 to 55 minutes. For sheet style cakes, baking time is 40 to 45 minutes.", 
            "Let cake stand fifteen minutes before removing from pan."
        ], 
        "date": "2008-09-24T14:24:43+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/miso-black-sesame-caramel-corn1.jpg?w=640", 
        "tags": [
            "Candy", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2016/02/miso-black-sesame-caramel-corn/", 
        "title": "miso black sesame caramel corn", 
        "directions": [
            "Heat oven to 300°F. Line a rimmed baking sheet with parchment paper; set aside. Lightly coat parchment and a the very largest bowl you own with nonstick spray. ", 
            "Place 2 tablespoons oil and 2 to 3 kernels in a 3-quart or larger pot. Turn heat to medium-high and cover with a lid. When you hear these first kernels pop, add the remaining kernels and replace the lid. Using potholders, shimmy the pot around to keep the kernels moving as they pop. When several seconds pass between pops, remove from heat. Transfer to coated bowl. You should have about 8 cups popcorn. ", 
            "Wipe out pot you used to pop corn. Add sugar and water to it, and bring to a boil over medium-high heat, only stirring until sugar has dissolved. Boil, swirling pan around (wear potholders) until caramel is a deep amber color, which took about 8 to 9 minutes in my already-heated-from-the-popcorn pot. Remove from heat and stir in butter (mixture will hiss and bubble furiously). Return to stove, reduce heat to medium-low, and cook for another 2 to 3 minutes, removing from the stove if it appears smoky sooner. Remove from heat and whisk (a whisk will best break it up) in the salt, baking soda and miso. ", 
            "Quickly pour it over the prepared popcorn and toss to coat. You’ll be glad you used a gigantic bowl. I use two silicone spatulas to mix it up because it’s a messy project and popcorn will want to fall out. Whatever you do, do not pick up any caramel-coated popcorn that falls out unless you like burned fingertips. (Wait until it cools.) Coat popcorn as best as you can, but don’t fret if there are gaps. ", 
            "Spread popcorn on prepared baking sheet. Sprinkle sesame seeds over. Bake in oven, tossing occasionally (which will also help coat any scantily-clad popped kernels) until mixture is dry, about 15 to 20 minutes. Let cool completely on baking sheet, then break it up into a large bowl. ", 
            "Do ahead: Keeps at its very best for 4 hours. Longer, it can be stored in containers or bags at room temperature, but if the day is humid, it might get just a tiny bit sticky. Nobody will care.", 
            " "
        ], 
        "date": "2016-02-04T12:07:49+00:00"
    }, 
    {
        "ingredient_list": [
            "For the apples", 
            "6 apples, Mom uses McIntosh apples, I use a mix of whatever looks good", 
            "1 tablespoon ground cinnamon", 
            "5 tablespoons (65 grams) granulated sugar", 
            "For the cake", 
            "2 3/4 cups (360 grams) flour", 
            "1 tablespoon baking powder", 
            "1 teaspoon fine sea or table salt", 
            "1 cup (235 ml) vegetable oil (safflower, sunflower, olive and coconut oil also work, as does melted butter)", 
            "2 cups (400 grams) granulated sugar", 
            "1/4 cup (60 ml) orange juice", 
            "2 1/2 (13 ml) teaspoons vanilla extract", 
            "4 large eggs", 
            "1 cup (130 grams) walnuts, chopped (optional and to be honest, we never use them)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/moms-apple-cake11.jpg?w=640", 
        "tags": [
            "Apple", 
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/09/moms-apple-cake/", 
        "title": "mom’s apple cake", 
        "directions": [
            "Heat oven to 350°F (175°C). Grease a tube pan. (I use this one or an equivalent one-piece tube.) Peel, core and chop apples into 1-inch chunks.Toss with cinnamon and 5 tablespoons sugar and set aside.", 
            "Stir together flour, baking powder and salt in a large mixing bowl. In a separate bowl, whisk together oil, orange juice, sugar, vanilla and eggs. Mix wet ingredients into dry ones; scrape down the bowl to ensure all ingredients are incorporated.", 
            "Pour half of batter into prepared pan. Spread half of apples (and their juices) over it. Pour the remaining batter over the apples and arrange the remaining apples on top. Bake for about 1 1/2 hours, or until a tester comes out clean.*", 
            "Cool completely before running knife between cake and pan, and unmolding onto a platter.", 
            "Do ahead: This cake is awesome on the first day but absolutely glorious and pudding-like on the days that follow, so feel free to get an early start on it. I keep it at room temperature covered with foil. ", 
            "* Tip: The apples love to hide uncooked pockets of batter, especially near the top. Make sure your testing skewer or toothpick goes not just all the way down to the bottom, but does a shallow dip below the top layer of apples to make sure it comes out batter-free. Should your cake be browning too fast, before the center is baked through, cover it with foil for all but the last few minutes in the oven."
        ], 
        "date": "2008-09-30T15:04:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup hazelnuts", 
            "3 1/2 ounces bittersweet chocolate", 
            "3 1/2 ounces semisweet chocolate", 
            "1/2 cup heavy cream", 
            "1 1/2 tablespoons hazelnut liqueur (such as Frangelico)", 
            "1 tablespoon freshly brewed coffee", 
            "1/2 teaspoon good vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mounds-of-awesome1.jpg?w=500", 
        "tags": [
            "Candy", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/12/mounds-of-awesome/", 
        "title": "hazelnut truffles", 
        "directions": [
            "Preheat the oven to 325 degrees F. ", 
            "Chop the hazelnuts and place them on a sheet pan. Roast them in the oven for 10 minutes. (If the hazelnuts have skin on them, roast them for 25 minutes.) Set aside to cool. ", 
            "Chop the chocolates finely and place in a bowl. ", 
            "Heat the cream in a small saucepan until it boils. Immediately pour the hot cream through a fine-meshed sieve into the bowl with the chocolates. With a wire whisk, slowly stir the cream and chocolates together until the chocolate is completely melted. (If the chocolate doesn’t melt completely, place the bowl over a pan of simmering water and stir for a few minutes just until it melts.) Whisk in the hazelnut liqueur, coffee, and vanilla. Cover and chill for 45 minutes to 1 hour until pliable but firm enough to scoop. ", 
            "With 2 teaspoons or a 1 1/4-inch ice cream scoop, make dollops of the chocolate mixture and place on a baking sheet lined with parchment paper. Refrigerate for about 15 minutes, until firm enough to roll into rough spheres. Roll the chocolate in the chopped hazelnuts and chill again. ", 
            "Do ahead: Truffles are best when they’re allowed to set overnight in the refrigerator. "
        ], 
        "date": "2006-12-22T15:46:44+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (6 ounces or 170 grams) unsalted butter, plus additional for greasing pan", 
            "1 1/2 cups (6 3/4 ounces or 190 grams) all purpose flour", 
            "2 teaspoons (9 grams) baking powder", 
            "3/4 teaspoon (4 grams) salt", 
            "Pinch of allspice", 
            "1 cup (7 ounces or 200 grams) sugar", 
            "2 large eggs", 
            "2/3 cup whole milk or buttermilk", 
            "1 1/2 pounds nectarines, halved, pitted and cut into 1/2-inch thick wedges (about 4 cups)", 
            "1 tablespoon lemon juice", 
            "Streusel", 
            "Reserved butter from cake (above)", 
            "1/2 cup (3 1/2 ounces or 100 grams) sugar", 
            "1/2 cup (2 1/4 ounces or 64 grams) all purpose flour", 
            "1/4 teaspoon cinnamon", 
            "Pinch of salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/4833941545_0c7c5409a1_o-1.jpg?w=751", 
        "tags": [
            "Brown Butter", 
            "Cake", 
            "Cookbooks", 
            "Everyday Cakes", 
            "Nectarine", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/07/nectarine-brown-butter-buckle/", 
        "title": "nectarine brown butter buckle", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns. Set aside and let cool (the fridge will hasten this along).", 
            "Prepare you pan: Preheat oven to 350°F. Line the bottom of a 10-inch round cake pan, springform or cast iron skillet with parchment paper and butter the paper and rest of the pan generously; set aside.", 
            "Make the cake: Whisk flour, baking powder, salt and allspice in medium bowl to blend. In a large bowl, whisk together 1/2 cup cooled browned butter (set aside remaining 1/4 cup for topping), sugar and then eggs, one at  a time. Stir in milk or buttermilk. Stir dry ingredients into this wet mixture; mix until just combined and spread batter in prepared pan. Toss nectarine wedges with lemon juice and arrange them in a single layer on top of the batter.", 
            "Make the streusel and bake the cake: Stir remaining brown butter, sugar, flour, cinnamon and salt together until large crumbs form. Sprinkle the nectarine-topped batter with crumbs. Bake until top is golden brown and tester inserted into center comes out with moist crumbs, about 40 to 45 minutes. Let cool in pan for 5 minutes before flipping out onto a cooling rack."
        ], 
        "date": "2010-07-28T10:13:53+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup granulated (50 grams) or powdered (30 grams) sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "6 tablespoons (85 grams) unsalted butter", 
            "1/3 cup dark brown sugar", 
            "1/3 cup granulated sugar", 
            "1 large egg", 
            "1 large egg yolk", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 tablespoon bourbon (optional)", 
            "1 teaspoon vanilla extract", 
            "6 tablespoons all-purpose flour", 
            "3/4 cup (4 1/2 ounces or 130 grams) chocolate chips or chopped chocolate", 
            "3/4 cup toasted (always) and coarsely chopped walnuts or pecans", 
            "Flaky sea salt on top, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/not-derby-pie-bars1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Bourbon", 
            "Chocolate", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2015/04/not-derby-pie-bars/", 
        "title": "not derby pie bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. A little nonstick spray underneath helps keep the strips in place. (If you have an 8-inch square springform, you can skip this and just butter it lightly.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take another 30 seconds for it to come together, but it will. Transfer the dough clumps to prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. Meanwhile, prepare the filling.", 
            "Make the filling: Melt your butter and, if desired, brown it too, by continuing to cook the butter in a small saucepan over medium heat, stirring frequently, until golden brown bits form at the bottom, about 5 minutes. Transfer butter to a large bowl and let it cool; you can hasten this along by setting it in the freezer for a couple minutes or stirring it over an ice water bath.", 
            "Whisk sugars into butter until smooth, then egg, (edited to add) yolk, salt, bourbon (if using) and vanilla. Stir in flour until just combined, then mix in chocolate and nuts. Pour over par-baked crust, spreading evenly. Sprinkle lightly with sea salt before baking, if desired. ", 
            "Bake bars: For 20 to 25 minutes, until top is firm and golden. Bars are much easier to cut if you let them cool almost completely, but I suspect there’s little fun in that. Once they’re cool, however, you can easily transfer them from the pan to a cutting board with the parchment paper sling you created. Serve plain, with whipped cream or a tiny scoop of vanilla ice cream. Can dust with powdered sugar for extra pretties. ", 
            "Store at room temperature for up to 3 days, or in the fridge for longer."
        ], 
        "date": "2015-04-30T12:00:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (7 ounces or 200 grams) white sugar", 
            "1 teaspoon (5 grams) baking powder", 
            "2 3/4 cups plus 2 tablespoons (12 5/8 ounces or 359 grams) cups all-purpose flour (or you can measure 3 cups and remove 2 tablespoons flour)", 
            "1/4 teaspoon cinnamon", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1/4 teaspoon (2 grams) salt", 
            "1 cup (2 sticks or 8 ounces or 227 grams) cold unsalted butter", 
            "1 large egg", 
            "2 peaches, pitted and thinly sliced (between 1/8 and 1/4-inch thick)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/09/4950027940_b3512efca3_o.jpg?w=749", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cookie", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/09/peach-shortbread/", 
        "title": "peach shortbread", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns and the very second that you turn around to do something else. Set it in the freezer until solid (about 30 minutes).", 
            "[Don’t have time for all this brown butter madness? Check the head notes to use regular softened butter instead.]", 
            "Preheat the oven to 375°F (190°C). Butter a 9×13 inch pan, or spray it with a nonstick spray. In a medium bowl, stir together sugar, baking powder, flour, salt and spices with a whisk.  Use a pastry blender, fork or your fingertips, blend the solidified brown butter and egg into the flour mixture. It will be crumbly. Pat 3/4 of the crumbs into the bottom of the prepared pan, pressing firmly. Tile peach slices over crumb base in a single layer. Scatter remaining crumbs evenly over peaches and bake in preheated oven for 30 minutes, until top is slightly brown and you can see a little color around the edges. Cool completely in pan before cutting into squares.", 
            "Keeping: I’ve kept mine in the fridge and they’ve held up great there since Monday. I imagine that these would freeze well, between layers of waxed paper, with the container sealed well in plastic wr"
        ], 
        "date": "2010-09-02T15:58:05+00:00"
    }, 
    {
        "ingredient_list": [
            "", 
            "\t\t", 
            "\t", 
            "\t\tPeople, these things are nothing but trouble, so whatever you do, don’t do this:", 
            "", 
            "", 
            "Do not start with a bowl of vaguely healthful and intensely fortified bowl of Snap, Crackle and Pop.", 
            "", 
            "Do not boil some sugar, because obviously unsweetened cereal will not do.", 
            "", 
            "(Try not to do this to your lens, either, when you take a picture.)", 
            "", 
            "Do not mix the caramel with the Krispies and press them into a pan.", 
            "", 
            "", 
            "Definitely don’t melt some chocolate and peanut butter together. ", 
            "", 
            "Or do this.", 
            "", 
            "And this.", 
            "", 
            "Then this.", 
            "", 
            "Or sit back and scratch your head as they disappear, because there’s only two of you at home. Just don’t, okay?", 
            "I’m sorry, are you still there? I figure that by now, half of you rebels have already run to the grocery store to buy your first box of Rice Krispies in half a lifetime, and the other half of you are appalled, simply appalled, at the syrupy, overindulgent, processed and fattening “treats” we Americans are so fond of.", 
            "Well, here’s a warning to those of you in the latter camp (those of you in the former one already know this): these bars will win you over. I wholly admit that as awesome as they sound, I really made them because I live with a 3rd grader 34 year old that has only one reaction to the suggestion of chocolate and peanut butter: WANT. ", 
            "But when I first tried them, I was a little taken aback. The crispy layer crumbled to the point that I couldn’t get a clean cut and I thought the peanut butter layer was too thick and sweet. Were I a more patient cook this week–you see, I am quietly considering partaking in this NaBloPoMo madness again this year, because I never learn, which would mean that I should preserve my cooking energy–I might have tried it over again with a few tweaks…", 
            "But a day or two later now, they’ve completely won me over and I now realize why the Baked boys say that this is, hands down, the most popular refrigerated bar they make at the bakery. Curious about the others? The Rasberry Breakfast Bars and Baked Brownies weren’t enough for you? (And how could they be, with as yet un-auditioned recipes for Pumpkin Whoopie Pies and S’more Nut Bars and Butterscotch Pudding Tarts?) You’ve got to get your own copy.", 
            "Chocolate and peanut butter, previously: Chocolate and Peanut Butter Cake, Peanut Butter Brownies and Peanut Butter Cookies", 
            "One year ago: Sweet Potato and Sausage Soup", 
            "Two years ago Bretzel Rolls", 
            "\t", 
            "", 
            "\t", 
            "Peanut Butter Crispy Bars", 
            "Adapted from Baked: New Frontiers in Baking", 
            "These bars are sticky and indulgent and not good for you in any way, so before you even ask, perhaps you can make them with organic, low-fat peanut butter, whole grain bio-crisped rice cereal or a sugar substitute but you shouldn’t. Nobody likes a party pooper.", 
            "For the crispy crust", 
            "1 3/4 cups crisped rice cereal", 
            "1/4 cup sugar", 
            "3 tablespoons light corn syrup", 
            "3 tablespoons unsalted (their recommendation) or salted (what I used, and liked) butter, melted", 
            "For the milk chocolate peanut butter layer", 
            "5 ounces good-quality milk (their recommendation) or semi-sweet (what I’d use next time) chocolate, coarsely chopped", 
            "1 cup creamy peanut butter", 
            "For the chocolate icing", 
            "3 ounces dark chocolate (60 to 72 percent cocoa), coarsely chopped", 
            "1/2 teaspoon light corn syrup", 
            "4 tablespoons (1/2 stick or 2 ounces) unsalted (their recommendation) or salted (what I used, and liked) butter", 
            "Make the crispy crust: Lightly spray a paper towel with nonstick cooking spray and use it to rub the bottom and sides of an 8-inch square baking pan.", 
            "Put the cereal in a large bowl and set aside.", 
            "Pour 1/4 cup water into a small saucepan. Gently add the sugar and corn syrup (do not let any sugar or syrup get on the sides of the pan) and use a small wooden spoon to stir the mixture until just combined. Put a candy thermometer in the saucepan. Cook over medium-high heat and bring to a boil; cook until the mixture reaches the soft ball stage, 235 degrees F.", 
            "Remove from the heat, stir in the butter, and pour the mixture over the cereal. Working quickly, stir until the cereal is thoroughly coated, then pour it into the prepared pan. Using your hands, press the mixture into the bottom of the pan (do not press up the sides). Let the crust cool to room temperature while you make the next layer.", 
            "Make the milk chocolate peanut butter layer: In a large nonreactive metal bowl, stir together the chocolate and the peanut butter. Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is smooth. Remove the bowl from the pan and stir for about 30 seconds to cool slightly. Pour the mixture over the cooled crust. Put the pan in the refridgerator for 1 hour, or until the top layer hardens.", 
            "Make the chocolate icing: In a large nonreactive metal bowl, combine the chocolate, corn syrup, and butter.", 
            "Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is completely smooth. Remove the bowl from the pan and stir for 30 seconds to cool slightly. Pour the mixture over the chilled milk chocolate peanut butter layer and spread (actually, I found it easier to just roll it around until it coated smoothly, avoiding the risk of picking up any of the peanut butter layer with it) into an even layer. Put the pan into the refrigerator for 1 hour, or until the topping hardens.", 
            "Cut into 9 (they say, I say 16, at least!) squares and serve. The bars can be stored in the refrigerator, covered tightly, for up to 4 days.", 
            "Rate this:Do More:TwitterFacebookPinterestPrintEmail\t\t\t", 
            "For the crispy crust", 
            "1 3/4 cups crisped rice cereal", 
            "1/4 cup sugar", 
            "3 tablespoons light corn syrup", 
            "3 tablespoons unsalted (their recommendation) or salted (what I used, and liked) butter, melted", 
            "For the milk chocolate peanut butter layer", 
            "5 ounces good-quality milk (their recommendation) or semi-sweet (what I’d use next time) chocolate, coarsely chopped", 
            "1 cup creamy peanut butter", 
            "For the chocolate icing", 
            "3 ounces dark chocolate (60 to 72 percent cocoa), coarsely chopped", 
            "1/2 teaspoon light corn syrup", 
            "4 tablespoons (1/2 stick or 2 ounces) unsalted (their recommendation) or salted (what I used, and liked) butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peanut-butter-crispy-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Candy", 
            "Peanut Butter", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/10/peanut-butter-crispy-bars/", 
        "title": "peanut butter crispy bars", 
        "directions": [
            "Make the crispy crust: Lightly spray a paper towel with nonstick cooking spray and use it to rub the bottom and sides of an 8-inch square baking pan.", 
            "Put the cereal in a large bowl and set aside.", 
            "Pour 1/4 cup water into a small saucepan. Gently add the sugar and corn syrup (do not let any sugar or syrup get on the sides of the pan) and use a small wooden spoon to stir the mixture until just combined. Put a candy thermometer in the saucepan. Cook over medium-high heat and bring to a boil; cook until the mixture reaches the soft ball stage, 235 degrees F.", 
            "Remove from the heat, stir in the butter, and pour the mixture over the cereal. Working quickly, stir until the cereal is thoroughly coated, then pour it into the prepared pan. Using your hands, press the mixture into the bottom of the pan (do not press up the sides). Let the crust cool to room temperature while you make the next layer.", 
            "Make the milk chocolate peanut butter layer: In a large nonreactive metal bowl, stir together the chocolate and the peanut butter. Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is smooth. Remove the bowl from the pan and stir for about 30 seconds to cool slightly. Pour the mixture over the cooled crust. Put the pan in the refridgerator for 1 hour, or until the top layer hardens.", 
            "Make the chocolate icing: In a large nonreactive metal bowl, combine the chocolate, corn syrup, and butter.", 
            "Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is completely smooth. Remove the bowl from the pan and stir for 30 seconds to cool slightly. Pour the mixture over the chilled milk chocolate peanut butter layer and spread (actually, I found it easier to just roll it around until it coated smoothly, avoiding the risk of picking up any of the peanut butter layer with it) into an even layer. Put the pan into the refrigerator for 1 hour, or until the topping hardens.", 
            "Cut into 9 (they say, I say 16, at least!) squares and serve. The bars can be stored in the refrigerator, covered tightly, for up to 4 days."
        ], 
        "date": "2008-10-28T15:39:11+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (190 grams) smooth peanut butter", 
            "2/3 (135 grams) cup granulated sugar", 
            "1 large egg", 
            "1/4 teaspoon vanilla extra", 
            "A few pinches of flaky or coarse sea salt", 
            "3 ounces (85 grams) unsweetened chocolate, roughly chopped", 
            "1/2 cup (115 grams or 4 ounces) unsalted butter, plus extra for pan", 
            "1 1/4 cups (250 grams) granulated sugar", 
            "2 large eggs", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1/2 teaspoon flaky or heaped 1/4 teaspoon of coarse sea salt", 
            "2/3 cup (85 grams) all-purpose flour", 
            "1/4 cup (40 grams) semi- or bittersweet chocolate chips"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/peanut-butter-swirled-brownies.jpg?w=750", 
        "tags": [
            "Bars", 
            "Brownies/Blondies", 
            "Chocolate", 
            "Peanut Butter", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2017/03/peanut-butter-swirled-brownies/", 
        "title": "peanut butter swirled brownies", 
        "directions": [
            "Heat oven: To 350°F (175°C).", 
            "Line an 8-inch square baking pan with parchment and coat the bottom and sides with nonstick cooking spray or butter.", 
            "Make peanut butter batter: Whisk all ingredients in a bowl until smooth.\nMake brownie batter: In a medium heatproof bowl over gently simmering water, melt chocolate and butter together until only a couple unmelted bits remain. Off the heat, stir until smooth and fully melted. You can also do this in the microwave in 30-second bursts, stirring between each. Whisk in sugar, then eggs, one at a time, then vanilla and salt. Stir in flour with a spoon or flexible spatula.\nAssemble brownies: Spread a thin layer of brownie batter (about 1/3 of total batter, but no need to be exact) in bottom of prepared baking pan. Dollop peanut butter batter all over in big spoonfuls. Dollop remaining brownie batter in pan, aiming, if you can, between the peanut butter dollops. Use a butter knife to swirl the batters together in loose figure-8s. Sprinkle chips all over.\nBake: For 30 to 35 minutes, or until a toothpick inserted into the center comes out batter-free.\nTo keep: Brownies keep well at room temperature, in the fridge or freezer."
        ], 
        "date": "2017-03-17T11:46:13+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups all-purpose flour", 
            "1 teaspoon baking soda", 
            "1/4 teaspoon baking powder", 
            "1 teaspoon salt", 
            "1 tablespoon ground cinnamon", 
            "1 cup chopped walnuts (optional)", 
            "3/4 cup butter, softened, or 3/4 cup vegetable oil", 
            "3 eggs, lightly beaten", 
            "2 cups sugar", 
            "2 to 4 pears firm, ripe pears, depending on size (you’ll need 2 grated cups total, but I don’t recommend you grate them until you are about to use them, so they don’t brown)", 
            "2 teaspoons vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pear-bread1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Cake", 
            "Everyday Cakes", 
            "Pear", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/12/pear-bread/", 
        "title": "pear bread", 
        "directions": [
            "Heat your oven to 350°F (175°C) and lightly grease and flour a 10-inch tube pan or two 9-by-5-inch loaf pans.", 
            "Combine the flour, baking soda, baking powder, salt, and cinnamon in a large mixing bowl, and stir with a fork to mix everything well. If you’re using nuts, scoop out about 1/4 cup of the flour mixture and combine it in a small bowl with the chopped walnuts, stirring and tossing to coat the nuts with the flour.", 
            "Peel and core pears, then grate them. You’ll want two grated cups total; set them briefly aside. In a medium bowl, combine the butter or oil, eggs, sugar, grated pear, nuts (if using), and vanilla, and stir to mix everything well. Scrape the pear mixture into the flour mixture and stir just until the flour disappears and the batter is evenly moistened.", 
            "Quickly scrape the batter into the prepared pans and bake at 350°F (175°C) for 60 to 70 minutes, or until the bread is handsomely browned and firm on top and a wooden skewer inserted in the center comes out clean.", 
            "Cool the bread in the pan on a wire rack or folded kitchen towel for about 10 minutes. Then turn it out onto a plate or a wire rack to cool completely, top side up. Serve it as is, sprinkle it with confectioners sugar or drizzle it with a simple glaze made from whisking 3 tablespoons buttermilk, a dash of vanilla and 2 cups of confectioners’ sugar together."
        ], 
        "date": "2009-12-25T19:59:19+00:00"
    }, 
    {
        "ingredient_list": [
            "9 tablespoons (4.5 ounces) unsalted butter, plus extra for pans", 
            "1/2 cup pecans, toasted (350°F for 10 to 13 minutes, or until browned) and cooled", 
            "1 cup confectioners’ sugar", 
            "2 tablespoons granulated sugar, plus extra for berries (optional)", 
            "3 tablespoons all-purpose flour", 
            "1 teaspoon baking powder", 
            "7 tablespoons white or yellow cornmeal", 
            "1/4 teaspoon kosher salt", 
            "4 egg whites", 
            "1 teaspoon vanilla extract", 
            "Berries, for serving", 
            "Ice cream or whipped cream, for serving."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pecan-cornmeal-butter-cake1.jpg?w=500", 
        "tags": [
            "Brown Butter", 
            "Cake", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/05/pecan-cornmeal-butter-cake/", 
        "title": "pecan cornmeal butter cake", 
        "directions": [
            "In a small pan, cook the butter until it browns and smells nutty (about 6 to 8 minutes). It helps to frequently scrape the solids off the bottom of the pan in the last couple minutes to ensure even browning. Strain and set aside to cool.", 
            "In a food processor, pulse pecans, confectioners’ and granulated sugar until powdery. Whisk together flour, baking powder, cornmeal and salt in a large bowl and add pecan-sugar mixture to this.", 
            "In a small bowl, whisk the egg whites and vanilla together, just to combine. Whisk this and the browned butter into the dry ingredients. Refrigerate batter at least three hours or overnight.", 
            "Heat oven to 325 degrees. Thickly butter the sides of a 9-inch round fluted tart pan, or 9-inch springform. Line the bottom with a circle of parchment paper. Please. My gut told me to do this and I ignored it, following the recipe, and the cake stuck terribly. ", 
            "Bake until golden and a tester comes out clean, about 25 minutes. Cool 10 to 15 minutes in pan, then turn out on a rack. Serve topped with berries (which you can macerate with a little sugar for a few minutes) and softly whipped cream."
        ], 
        "date": "2010-05-07T15:54:24+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pepita-brittle1.jpg?w=500", 
        "tags": [
            "Candy", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/11/pepita-brittle/", 
        "title": "pepita brittle", 
        "directions": [
            "Line a 12x16x1/2-inch sheet baking pan with parchment paper and lightly coat it with vegetable spray or butter.", 
            "Put the sugar, butter, corn syrup, and 1/2 cup plus 2 tablespoons water to a large saucepan, and stir together until all the sugar is wet. Cook over high medium-high, but watch it carefully as it will foam up quite a bit and you might need to dial back the heat to medium until it begins to thicken.", 
            "Once the mixture turns a medium golden (takes at least 10 minutes) immediately remove from the heat, and carefully whisk in the baking soda followed by the salt (taking care, as the caramel will rise in the pan and bubble some more). Switch to a wooden or metal spoon, and fold in the pepitas or nuts.", 
            "Quickly pour the mixture onto the sheet pan, and spread it out over the pan using the back of the spoon before it starts to harden. Alternately, you can slide the parchment paper out of the baking pan and onto a counter, cover it with another sheet, and use a rolling pin, pressing down hard, to roll it out as flat and thin as you would like.", 
            "At this point you can either let it cool completely (pulling off the top sheet of parchment, if you use the rolling pin technique) and break it into bite-size pieces with the back of a knife or other blunt object or, while it is still fairly hot and pliable, cut it into a shape of your choice (I went for long, thinnish strips) and let the pieces cool, separated on parchment paper.", 
            "The brittle can be stored at room temperature, in an airtight container, for up to two weeks. I like to separate the pieces between layers of parchment or waxed paper, as a little humidity can cause them to stick together."
        ], 
        "date": "2008-11-01T11:16:20+00:00"
    }, 
    {
        "ingredient_list": [
            "2/3 cup heavy or whipping cream", 
            "1/2 cup light corn syrup or golden syrup (see Note above)", 
            "1/3 cup packed dark brown sugar", 
            "1/4 cup unsweetened cocoa powder, ideally Dutch-processed", 
            "Heaping 1/4 teaspoon fine sea salt or level 1/4 teaspoon table salt", 
            "6 ounces bittersweet chocolate, chopped (or, about 1 cup bittersweet chocolate chips), divided", 
            "2 tablespoons unsalted butter", 
            "1/4 teaspoon peppermint extract, or to taste", 
            "Crushed candy canes, for serving (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/peppermint-hot-fudge-sauce.jpg?w=750", 
        "tags": [
            "Candy", 
            "Chocolate", 
            "Ice Cream/Sorbet", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/12/peppermint-hot-fudge-sauce/", 
        "title": "peppermint hot fudge sauce", 
        "directions": [
            "In a 1 1/2 to 2-quart heavy saucepan, bring cream, syrup, sugar, cocoa, salt (if you’d like the salt to remain slightly textured, add it with the butter and extract at the end) and half the chocolate to a boil. Reduce to a low simmer and cook for 5 minutes, stirring occasionally. Remove from heat and stir in remaining chocolate, butter and extract and stir until smooth. Cool the sauce to warm before serving it so that it can thicken up. While very hot, it will only slide off the ice cream and pool in the alleys of the bowl and that would be tragic, right?", 
            "Do ahead: Sauce keeps in fridge for a week (according to Gourmet), though we’ve kept it longer, closer to two weeks, and lived to tell about it. Reheat gently before serving, so that it is still thick but just loose enough to pour."
        ], 
        "date": "2011-12-19T20:34:11+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "2 cups (250 grams or 8 3/4 ounces) all-purpose flour", 
            "1 teaspoon baking powder", 
            "3/4 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "1 stick (113 grams or 4 ounces) unsalted butter, softened", 
            "1/4 cup light (55 grams or 2 ounces) brown sugar", 
            "1 tablespoon (15 ml) dark rum", 
            "2 large eggs, at room temperature", 
            "1 cup (237 ml) cream of coconut", 
            "1/2 cup (72 grams or 2 1/2 ounces) finely chopped fresh pineapple (or pineapple from a can, strained, juice reserved)", 
            "To brush over the cake", 
            "1 to 2 tablespoons rum (optional)", 
            "2 tablespoons pineapple juice (optional)", 
            "Glaze", 
            "1 cup (120 grams or 4 ounces) powdered sugar", 
            "Pinch of table or fine sea salt", 
            "1 1/2 to 3 tablespoons pineapple juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pina-colada-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Coconut", 
            "Everyday Cakes", 
            "Photo", 
            "Pineapple"
        ], 
        "url": "https://smittenkitchen.com/2011/02/pina-colada-cake/", 
        "title": "piña colada cake", 
        "directions": [
            "2 tablespoons dark rum for sprinkling over cake (optional)", 
            "Preheat oven to 350°F. Butter a 9-inch round cake pan and line the bottom with a circle of parchment paper, then butter parchment. (Alternately, you can use a cooking spray, either with just butter or butter and flour to speed this process up.)", 
            "Whisk together flour, baking powder, baking soda, and salt in a medium bowl. In a large mixing bowl, beat butter and brown sugar with an electric mixer at medium speed until pale and fluffy, then beat eggs, one at a time, and rum. Add cream of coconut and mix; the batter will look curdly and worrisome but will all work out in the end. Add dry ingredients, half at a time, mixing and scraping down bowl between additions. Mix only until flour is just incorporated. Using a rubber spatula, fold in bits of pineapple.", 
            "Spread batter evenly in prepared pan. Bake until golden and a wooden pick inserted in center of cake comes out clean, 35 to 40 minutes. Cool in pan on a rack 10 minutes, then run a knife around edge of pan. Invert onto rack and discard parchment.", 
            "For extra flavor, while the cake is still hot you can brush it with rum or pineapple juice.", 
            "Cool cake completely at room temperature, or in the fridge if you are impatient for cake (who isn’t?). Once completely cool, place powdered sugar and salt in a small bowl with 1 1/2 tablespoons pineapple juice and whisk until a thick glaze forms. Thin glaze only as needed, adding additional pineapple juice a teaspoon at a time until glaze is just thick enough to pour. Pour glaze into middle of cake and if it’s too thick to crawl to the edges itself, nudge it with a spatula until the top is covered. Serve immediately or let it set in the fridge for 20 minutes or so."
        ], 
        "date": "2011-02-28T12:24:53+00:00"
    }, 
    {
        "ingredient_list": [
            "For the base:", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 teaspoon freshly grated lemon zest", 
            "1/8 teaspoon table salt", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cut into chunks", 
            "1 cup (125 grams) flour", 
            "For the lemonade layer", 
            "1 cup (about 5 ounces or 140 grams) raspberries", 
            "2 large eggs", 
            "3/4 cup (150 grams) granulated sugar", 
            "1/4 cup freshly squeezed lemon juice; this should only require 2 lemons", 
            "1/3 cup (40 grams) all-purpose flour", 
            "Confectioners’ sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Citrus", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/08/pink-lemonade-bars/", 
        "title": "pink lemonade bars", 
        "directions": [
            "Preheat your oven to 350°F (180°C) and line an 8x8x2-inch baking pan with parchment, letting it extend up two sides. Butter or coat the bottom and sides with a nonstick spray and set the pan aside.", 
            "Make the base: In a food processor, pulse together the sugar, zest and salt until combined. Add the butter and pulse until it is evenly dispersed in the dough. Add the flour and pulse the machine until it’s just combined and the mixture is crumbly. Press the dough into the prepared pan and about 1/2-inch up the sides. Don’t worry about making this perfect; mine was an uneven mess and nobody can tell. Bake for 15 minutes, until lightly browned at edges. Let cool on a rack while you prepare the filling (though no need for it to be completely cool when you fill it). Leave oven on.", 
            "Make the pink lemonade layer: Puree the raspberries in your food processor until they’re as liquefied as they’ll get. I don’t even bother cleaning mine between steps, but I’m also probably lazier than you. Run the puree through a fine-mesh sieve, trying to press out all the raspberry puree that you can, leaving the seeds behind. I ended up with 1/3 cup strained puree; don’t worry if you get a smidge less.", 
            "In a medium bowl, whisk together the eggs, sugar and lemon juice until smooth. Whisk in 3 tablespoons of raspberry puree. Stir in flour. Pour into cooling crust and return pan to the oven, baking the bars until they’re set (they’ll barely jiggle) and slightly golden at the edges, about 25 to 30 minutes. Cool completely before cutting into rectangles. (You can speed this up in the fridge.)", 
            "I intended to cut mine into 32 2×1-inch rectangles but actually cut them into 28 2×1-ish rectangles. I like lemony bars small but you could also cut them into 16 2×2-inch squares. Dust with powdered sugar before serving. Store in fridge for up to a week."
        ], 
        "date": "2012-08-03T13:26:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup plus 2 tablespoons (140 grams) roasted, shelled, and unsalted pistachios", 
            "1 cup (200 grams) granulated sugar", 
            "1/2 teaspoon fine sea salt", 
            "10 tablespoons (5 ounces or 145 grams) unsalted butter, cold is fine", 
            "3 large eggs", 
            "1/4 cup milk", 
            "1/2 teaspoon vanilla extract", 
            "1/2 teaspoon almond extract", 
            "Slightly heaped 1/2 teaspoon baking powder", 
            "3/4 cup plus 2 tablespoons (115 grams) all-purpose flour", 
            "1/3 cup (40 grams) roasted, shelled, and unsalted pistachios", 
            "1/4 cup (50 grams) granulated sugar", 
            "Finely grated zest and juice of 1 lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/04/pistachio-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2017/04/pistachio-cake/", 
        "title": "pistachio cake", 
        "directions": [
            "Heat oven: To 325 degrees F. Line the bottom and long sides of a loaf pan with a sling of parchment paper. Coat paper and exposed short sides of loaf pan with nonstick spray or butter.", 
            "With a food processor: In the work bowl of your food processor, grind pistachios, sugar and salt together until as powdery as you can get them without it turning to paste. Cut butter into small chunks and blend with pistachio mixture. It’s going to be lumpy at first, and then balled for a minute, but keep running the machine until the mixture loosens up into a frosting-like consistency, i.e. smooth and shiny. Add eggs, one at time, blending briefly between each, scraping down sides as needed. Add milk, blend to combine. Add extracts and baking powder and blend to fully combine, scraping down workbowl. Add flour and pulse just until it disappears. ", 
            "Without a food processor: You’re going to want to start with 140 grams pistachio meal or flour and softened butter and can proceed as with a traditional cake. Beat butter and sugar until fluffy, then beat in eggs, one at a time. Beat in milk, then extracts until smooth. Beat in salt and baking powder until fully combined, scraping down bowl well. Add flour and mix just until it disappears.\nTo bake: Scrape batter into prepared pan and spread top smooth. Bake for 60 to 70 minutes (see note up top by way of explanation/apology). Mine took 70, but it’s safest to check sooner. Look for a toothpick inserted into the center of the cake to come out clean and then, do a second check near the top. I find with loaf cakes that the undercooked batter likes to hover right below the top crust. It often takes 10 minutes extra (built into this baking time already) just for that to set for me.\nLet cake cool in pan on rack for 10 to 15 minutes, then run a knife around cake and transfer to cooling rack. Let cool completely.\nTo make glaze (optional): Bring pistachios, sugar, zest, and juice to a simmer in a small saucepan; simmer for 2 to 3 minutes then pour over cooled cake.", 
            "To serve: Cut into slices. Cake is great on the first day but even better on the second, as the ingredients settle. Keep at room temperature for several days, wrapped in foil, or longer in freezer."
        ], 
        "date": "2017-04-21T12:02:59+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 teaspoons or 1 (1/4-ounce) package active dry yeast", 
            "1/4 cup warm water (105–110°F)", 
            "2 cups (267 grams) plus 2 tablespoons (18 grams) all-purpose flour, divided", 
            "1 cup sugar (220 grams), divided", 
            "1/2 teaspoon salt", 
            "1/2 cup plain whole-milk yogurt (124 grams) (preferably Greek-style, but I used regular yogurt and it worked just fine) at room temperature", 
            "1 large egg, warmed in shell in warm water five minutes", 
            "1 1/2 teaspoons grated lemon zest", 
            "1 teaspoon pure vanilla extract", 
            "1 1/4 sticks (5 ounces or 142 grams) unsalted butter, cut into tablespoons and softened, divided", 
            "3/4 pound firm-ripe plums (about 4 small), halved and pitted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/plum-kuchen1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/07/plum-kuchen/", 
        "title": "plum kuchen", 
        "directions": [
            "Stir together yeast and warm water in mixer bowl and let stand until foamy, about five minutes. (If mixture doesn’t foam, start over with new yeast.)", 
            "Add two cups flour, 2/3 cup sugar, salt, yogurt, egg, zest, and vanilla to yeast mixture and mix at medium-low speed 1 minute. Beat in one stick of the butter, one tablespoon at a time, until incorporated. Beat at medium speed until dough is smooth and shiny, about five minutes. (Dough will be very sticky.) Scrape down side of bowl and sprinkle dough with remaining two tablespoons flour. Cover bowl loosely with a kitchen towel or plastic wrap and let dough rise in a draft-free place at warm room temperature until doubled, 1 1/2 to 2 hours.", 
            "Spread remaining two tablespoons butter in bottom of an 8- or 9-inch square baking pan and sprinkle with remaining 1/3 cup sugar. Cut each plum half into five or six slices and arrange in one layer in pan. (I had quite a bit of extra plum slices to snack on, but my plums were also giants.)", 
            "Stir dough until flour is incorporated, then spread evenly over plums. Loosely cover with buttered plastic wrap, then kitchen towel. Let rise in a draft-free place at warm room temperature until almost doubled, about 1 1/2 hours.", 
            "Preheat oven to 375°F with rack in middle. Bake until kuchen is golden-brown and a wooden pick inserted into center comes out clean, 30 to 35 minutes. Cool in pan five minutes, then invert and unmold onto a rack to cool completely.", 
            "Serve with additional yogurt, lightly sweetened, or sweetened crème fraîche."
        ], 
        "date": "2009-07-31T13:35:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (130 grams) all-purpose flour", 
            "1/2 cup (55 grams) sliced almonds, toasted or equivalent weight almond flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 teaspoon almond extract", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "2/3 cup (85 grams) all purpose flour", 
            "1/3 cup (packed) almond paste (about 3.5 ounces or half a 7-ounce tube)", 
            "1/3 cup (65 grams) light brown sugar", 
            "1/4 teaspoon fine sea or table salt", 
            "4 tablespoons (2 ounces or 55 grams) chilled unsalted butter, cut into cubes", 
            "1/4 cup (30 grams) sliced, toasted almonds", 
            "1 pounds plums (about 6 to 7), halved, pitted, thinly sliced", 
            "3 tablespoons granulated sugar", 
            "1 1/2 tablespoons cornstarch"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/plum-squares-with-marzipan-crumble.jpg?w=750", 
        "tags": [
            "Bars", 
            "Crumbles/Crisps", 
            "Photo", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/09/plum-squares-with-marzipan-crumble/", 
        "title": "plum squares with marzipan crumble", 
        "directions": [
            "Heat oven to 375 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.\nMake the crust: Combine the flour, almonds, salt, sugar and extract in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.\nMake crumble: Blend flour, almond paste, sugar and salt in processor until almond paste is finely ground. Add butter and blend, using on/off turns, until coarse crumbs form. Transfer crumble to bowl; mix in almonds.\nMake filling: Combine all ingredients in medium bowl; toss to coat well.\nAssemble squares: Sprinkle 1/2 cup prepared crumble over cooled crust. Top with plum mixture. Sprinkle with remaining crumble.", 
            "Bake: Until filling bubbles thickly and top is golden, about 35 to 40 minutes. If the bars brown too quickly, cover them with foil for the remaining baking time. Cool in pan. I like to hurry this (too) along in the fridge or freezer. Once firm, I’ll use the parchment sling to remove the bars and cut them more cleanly on a cutting board. Dust with powdered sugar, if desired, before serving.\nDo ahead: These bars keep for up to a week in the fridge, longer in the freezer."
        ], 
        "date": "2016-09-01T07:33:56+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/project-wedding-cake-an-introduction1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Photo", 
            "Wedding Cake"
        ], 
        "url": "https://smittenkitchen.com/2008/06/project-wedding-cake-an-introduction/", 
        "title": "project wedding cake: an introduction", 
        "directions": [], 
        "date": "2008-06-24T22:01:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1 15-ounce ripe mango, peeled, pitted, cut into 1/2-inch pieces", 
            "1/2 cup sugar (might reduce this to 1/3 cup next time, to keep the curd more tart)", 
            "3 tablespoons fresh lime juice", 
            "Pinch of salt", 
            "4 large egg yolks", 
            "1/4 cup (1/2 stick) unsalted butter, cut into small pieces"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/project-wedding-cake-mango-curd1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Fruit", 
            "Mango", 
            "Photo", 
            "Wedding Cake"
        ], 
        "url": "https://smittenkitchen.com/2008/06/project-wedding-cake-mango-curd/", 
        "title": "project wedding cake: mango curd", 
        "directions": [
            "Puree mango, sugar, lime juice and salt in processor, scraping down sides of work bowl occasionally. Add yolks; puree 15 seconds longer. Strain through sieve set over large metal bowl, pressing on solids with back of spatula to release as much puree as possible. Discard solids in sieve.", 
            "Set metal bowl over saucepan of simmering water (do not allow bottom of bowl to touch water); whisk puree until thickened and thermometer registers 170°F., about 10 minutes. Remove from over water. Whisk in butter 1 piece at a time. Cover and refrigerate overnight."
        ], 
        "date": "2008-06-29T10:17:52+00:00"
    }, 
    {
        "ingredient_list": [
            "For a wedding cake (or most of one, depending on the size)", 
            "2 cups of egg whites (approx. 12 large)", 
            "3 cups sugar", 
            "5 cups unsalted butter, softened (2 1/2 pounds, 10 sticks)", 
            "1 tablespoon vanilla extract", 
            "For a 9-inch cake (plus filling, or some to spare)", 
            "1 cup sugar", 
            "4 large egg whites", 
            "26 tablespoons unsalted butter, softened (3 sticks plus 2 tablespoons)", 
            "1 teaspoon vanilla extract", 
            "For the tiniest amount, if you’re just practicing (or enough to cover and fill the 4-inch cake pictured)", 
            "1/4 cup sugar", 
            "1 large egg white", 
            "6 tablespoons unsalted butter, softened", 
            "1/4 teaspoon vanilla"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/project-wedding-cake-swiss-buttercream1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Photo", 
            "Wedding Cake"
        ], 
        "url": "https://smittenkitchen.com/2008/07/project-wedding-cake-swiss-buttercream/", 
        "title": "project wedding cake: swiss buttercream", 
        "directions": [
            "Whisk egg whites and sugar together in a big metal bowl over a pot of simmering water. Whisk occasionally until you can’t feel the sugar granules when you rub the mixture between your fingers.", 
            "Transfer mixture into the mixer and whip until it turns white and about doubles in size. (Here’s a tip: when you transfer to the mixer, make sure you wipe the condensation off the bottom of the bowl so that no water gets into the egg whites. This can keep them from whipping up properly.)", 
            "Add the vanilla.", 
            "Finally, add the butter a stick at a time and whip, whip, whip.", 
            "Deb note: Do not have a panic attack when this takes a while to come together (though I did every time). One super-large batch took 15 minutes, but it did and will come together. Patience, young Jedis."
        ], 
        "date": "2008-07-05T22:50:07+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/project-wedding-cake-ta-da1.jpg?w=240", 
        "tags": [
            "Cake", 
            "Photo", 
            "Wedding Cake"
        ], 
        "url": "https://smittenkitchen.com/2008/07/project-wedding-cake-ta-da/", 
        "title": "project wedding cake: ta-da!", 
        "directions": [], 
        "date": "2008-07-08T12:02:47+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups cake flour", 
            "3 cups sugar", 
            "1 1/2 cups unsweetened cocoa powder (not Dutch process)", 
            "3 teaspoons baking soda", 
            "3/4 teaspoon ground cinnamon", 
            "3/4 teaspoon salt", 
            "3 sticks (12 ounces) unsalted butter, at room temperature", 
            "1 1/2 cups buttermilk", 
            "3 eggs", 
            "1 1/2 cups freshly brewed coffee, cooled to room temperature", 
            "3 3/4 cups cake flour", 
            "2 1/2 cups sugar", 
            "1 tablespoon plus 2 3/4 teaspoons baking powder", 
            "1/2 teaspoon salt", 
            "2 1/2 sticks (10 ounces) unsalted butter, at room temperature", 
            "1 1/4 cups plus 1/3 cup buttermilk", 
            "5 whole eggs", 
            "2 egg yolks", 
            "2 1/2 teaspoons vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/project-wedding-cake-the-cake-is-baked1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Chocolate", 
            "Photo", 
            "Wedding Cake"
        ], 
        "url": "https://smittenkitchen.com/2008/07/project-wedding-cake-the-cake-is-baked/", 
        "title": "project wedding cake: the cake is baked", 
        "directions": [
            "1. Preheat the oven to 325°F. Butter three 9-inch round cake pans. Line the bottom of each pan with a round of parchment or waxed paper and butter the paper.", 
            "2. Combine the cake flour, sugar, baking powder, and salt in a large mixer bowl. With the mixer on low speed, blend for 30 seconds. Add the butter and 1 1/4 cup of the buttermilk. Mix on low speed briefly to blend; then raise the speed to medium and beat until light and fluffy, 2 to 3 minutes. ", 
            "3. In a smaller bowl, whisk together the whole eggs, egg yolks, vanilla, and the remaining 1/3 cup buttermilk until well blended. Pour one-third of the egg mixture into the cake batter at a time, folding it in completely after each addition. There will be 9 cups of batter; our 3 cups batter into each pan.", 
            "4. Bake for 26 to 28 minutes, or until a cake tester or wooden toothpick inserted in the center comes out clean.", 
            "5. Turn the layers out onto wire racks by placing a rack on top of a pan, inverting it, and lifting off the pan.  Peel off the paper liners and let cool completely. When the layers have cooled, place a cardboard cake board on top of  a layer, invert again, and lift off the rack. To make the layers easier to handle, wrap them on their boards completely in plastic, so they don’t dry out, and refrigerate them. "
        ], 
        "date": "2008-07-01T23:51:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 15-ounce can (1 3/4 cups) pumpkin puree", 
            "1/2 cup (120 ml) vegetable or another neutral cooking oil or melted butter (115 grams)", 
            "3 large eggs", 
            "1 2/3 (330 grams) cups granulated sugar", 
            "1 1/2 teaspoons baking powder", 
            "3/4 teaspoon baking soda", 
            "3/4 teaspoon fine sea or table salt", 
            "3/4 teaspoon ground cinnamon", 
            "Heaped 1/4 teaspoon fresh grated nutmeg", 
            "Heaped 1/4 teaspoon ground ginger", 
            "Two pinches of ground cloves", 
            "2 1/4 cups (295 grams) all-purpose flour", 
            "1 tablespoon (12 grams) granulated sugar", 
            "1 teaspoon ground cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/pumpkin-bread.jpg?w=750", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fall", 
            "Photo", 
            "Pumpkin", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2016/10/pumpkin-bread/", 
        "title": "pumpkin bread", 
        "directions": [
            "Heat oven to 350 degrees F. Butter a 6-cup loaf pan or coat it with nonstick spray.\nIn a large bowl, whisk together pumpkin, oil, eggs and sugar until smooth. Sprinkle baking powder, baking soda, salt, cinanmon, nutmeg, ginger and cloves over batter and whisk until well-combined. Add flour and stir with a spoon, just until mixed. Scrape into prepared pan and smooth the top. In a small dish, or empty measuring cup, stir sugar and cinnamon together. Sprinkle over top of batter.\nBake bread for 65 to 75 minutes until a tester poked into all parts of cake (both the top and center will want to hide pockets of uncooked batter) come out batter-free, turning the cake once during the baking time for even coloring.\nYou can cool it in the pan for 10 minutes and then remove it, or cool it completely in there. The latter provides the advantage of letting more of the loose cinnamon sugar on top adhere before being knocked off.", 
            "Cake keeps at room temperature as long as you can hide it. I like to keep mine in the tin with a piece of foil or plastic just over the cut end and the top exposed to best keep the lid crisp as long as possible."
        ], 
        "date": "2016-10-13T12:01:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (125 grams) all-purpose flour", 
            "1 teaspoon (5 grams) baking powder (the aluminum-free kind, if you can find it)", 
            "Large pinch of salt", 
            "1 cup (200 grams) granulated sugar plus 1 to 2 tablespoon (depending on sweetness of plums)", 
            "1/2 cup (115 grams or 8 tablespoons) unsalted butter, softened", 
            "2 large eggs", 
            "12 smallish purple Italian purple plums, halved and pitted", 
            "2 teaspoons (10 ml) fresh lemon juice", 
            "1 teaspoon or tablespoon ground cinnamon (see Note up top for explanation)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/purple-plum-torte11.jpg?w=640", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fall", 
            "Photo", 
            "Picnics", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/10/purple-plum-torte/", 
        "title": "purple plum torte", 
        "directions": [
            "Heat oven to 350°F. Sift or whisk together flour, baking powder and salt in a medium bowl. In a larger bowl, cream butter and 1 cup sugar together with an electric mixer until fluffy and light in color. Add the eggs, one at a time and scraping down the bowl, then the dry ingredients, mixing until just combined. ", 
            "Spoon batter into an ungreased 9-inch springform pan (but if you’re worried, you can always lightly coat it first with butter or a nonstick spray) and smooth the top. Arrange the plums, skin side up, all over the batter, covering it. Sprinkle the top with lemon juice, then cinnamon, then remaining sugar. ", 
            "Bake until cake is golden and a toothpick inserted into a center part of the cake comes out free of batter (but of course not plum juice), about 45 to 50 minutes. Cool on rack. ", 
            "Once cool, if you can stand it, and I highly recommend trying, leave it covered at room temperature overnight as this cake is even better on the second day, when those plum juices further release into the cake around it, becoming not just “cake with plum,” but cakeplumughyum (official terminology, there). "
        ], 
        "date": "2013-10-11T10:50:35+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/raspberry-breakfast-bars.jpg?w=753", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Raspberries", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/09/raspberry-breakfast-bars/", 
        "title": "raspberry breakfast bars", 
        "directions": [
            "Make the crust and crumb: Preheat the oven to 350°F. Butter the bottom and sides of a 9-by-13-inch glass or light-colored metal baking pan. Put a long piece of parchment paper in the bottom of the pan, letting the parchment extend up the two short sides of the pan and overhang slightly on both ends. (This will make it easy to remove the bars from the pan after they have baked.) Butter the parchment.", 
            "Put the flour, brown sugar, oats, salt, baking powder, baking soda, and cinnamon in a food processor. Pulse in short bursts until combined. Add the butter and pulse until loose crumbs form.", 
            "Reserve 1 1/2 cup of the mixture and set aside. (Note: The book suggests you reserve one cup only. My gut told me that was too little, and I upped it. I wanted to make sure the top of the raspberries were mostly covered, at least for packing purposes, and was glad I had changed it.) Pour the rest of the mixture into the prepared pan and use your hans or the back of a large wooden spoon to push the crust into an even layer at the bottom of the pan. The crust should touch the sides of the pan. Bake until golden brown, 12 to 15 minutes. Transfer to a wire rack and let the crust cool. Keep the oven on while you make the raspberry filling.", 
            "Make the raspberry filling: In a medium bowl, whisk the sugar, lemon zest, cinnamon and flour together. Add the raspberries, lemon juice and butter and use your hands to toss gently until the raspberries are evenly coated.", 
            "Assemble and bake the bars: Spread the raspberry filling evenly on top of the cooled crust. Sprinkle the reserved crust mixture evenly on top of the filling.", 
            "Bake for 35 to 45 minutes, rotating the pan every 15 minutes, until the top is golden brown and the filling starts to bubble around the edges.", 
            "Transfer to a wire rack to cool completely, then cut into squares and serve. The bars can be stored in the refrigerator in an airtight container for up to two days."
        ], 
        "date": "2008-09-02T15:50:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (130 grams) all-purpose flour", 
            "1/2 teaspoon (2 grams) baking powder", 
            "1/2 teaspoon (2 grams) baking soda", 
            "1/4 teaspoon salt", 
            "1/2 stick (56 grams) unsalted butter, softened", 
            "2/3 cup (146 grams) plus 1 1/2 tablespoons (22 grams) sugar, divided", 
            "1/2 teaspoon pure vanilla extract", 
            "1/2 teaspoon finely grated lemon zest (optional)", 
            "1 large (57 grams) egg", 
            "1/2 cup (118 ml) well-shaken buttermilk", 
            "1 cup (5 ounces or 140 grams) fresh raspberries "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/raspberry-buttermilk-cake.jpg?w=753", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/05/raspberry-buttermilk-cake/", 
        "title": "raspberry buttermilk cake", 
        "directions": [
            "Preheat oven to 400°F with rack in middle. Butter and flour a 9-inch round cake pan.", 
            "Whisk together flour, baking powder, baking soda, and salt and set aside. In a larger bowl, beat butter and 2/3 cup (146 grams) sugar with an electric mixer at medium-high speed until pale and fluffy, then beat in vanilla and zest, if using. Add egg and beat well.", 
            "At low speed, mix in flour mixture in three batches, alternating with buttermilk, beginning and ending with flour, and mixing until just combined.Spoon batter into cake pan, smoothing top. Scatter (see Note) raspberries evenly over top and sprinkle with remaining 1 1/2 tablespoons (22 grams) sugar.", 
            "Bake until cake is golden and a wooden pick inserted into center comes out clean, 20 to 25 minutes.  Cool in pan 10 minutes, then turn out onto a rack and cool to warm, 10 to 15 minutes more. Invert onto a plate.", 
            "[Baking time updated, shortened, after so many of you concurred that this cake bakes crazy quickly.]", 
            "Note: Directions like “scatter” always scare me. Where’s the science? Here’s what my neuroses taught us: the ones that were downward were almost all swallowed by the batter. The \"o\" ones stayed empty, like cups. Both were delicious.", 
            "Make your own almost-buttermilk: No need to buy buttermilk especially for this or any recipe. Add one teaspoon tablespoon [updated, as an astute reader pointed out that the larger amount is more common] of vinegar or lemon juice to one cup of milk and let it sit until it clabbers, about 10 minutes. Voila, buttermilk!"
        ], 
        "date": "2009-05-19T15:40:42+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon unsalted butter", 
            "3 1/2 cups cake flour", 
            "1/2 cup unsweetened cocoa (not Dutch process)", 
            "1 1/2 teaspoons salt", 
            "2 cups canola oil", 
            "2 1/4 cups granulated sugar", 
            "3 large eggs", 
            "6 tablespoons (3 ounces) red food coloring or 1 teaspoon red gel food coloring dissolved in 6 tablespoons of water", 
            "1 1/2 teaspoons vanilla", 
            "1 1/4 cup buttermilk", 
            "2 teaspoons baking soda", 
            "2 1/2 teaspoons white vinegar.", 
            "8 ounces cream cheese, room temperature", 
            "1/2 cup (1 stick) butter room temperature", 
            "3 cups confectioner’s sugar, sifted", 
            "1 teaspoon pure vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/red-velvet-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/09/red-velvet-cake/", 
        "title": "red velvet cake", 
        "directions": [
            "Place cream cheese and butter in a medium bowl. With a handheld electric mixer, beat until light and fluffy, about 2 minutes. Add sugar and vanilla. Beat, on low speed to combine. If too soft, chill until slightly stiff, about 10 minutes, before using.", 
            "Icing Notes: "
        ], 
        "date": "2007-09-17T20:05:39+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "6 tablespoons (85 grams) unsalted butter, at room temperature", 
            "3/4 cup (145 grams) firmly packed dark brown sugar", 
            "1/4 cup (50 grams) white granulated sugar", 
            "1 large egg + 1 large egg yolk, at room temperature", 
            "3/4 cup (177 ml) red wine, any kind you like*", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 cup + 1 tablespoon (133 grams) all-purpose flour", 
            "1/2 cup (41 grams) Dutch cocoa powder", 
            "1/8 teaspoon baking soda", 
            "1/2 teaspoon baking powder", 
            "1/4 teaspoon table salt", 
            "1/4 teaspoon ground cinnamon (this is a great place for that fancy Vietnamese stuff you stashed away)", 
            "Topping", 
            "1/2 cup mascarpone cheese", 
            "1/2 cup (118 grams) chilled heavy or whipping cream", 
            "2 tablespoons (25 grams) granulated sugar", 
            "1/4 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/09/red-wine-chocolate-cake.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Everyday Cakes", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2011/09/red-wine-chocolate-cake/", 
        "title": "red wine chocolate cake", 
        "directions": [
            "Make the cake: Preheat the oven to 325°F. Line the bottom of a 9-inch round cake pan with parchment, and either butter and lightly flour the parchment and exposed sides of the pan, or spray the interior with a nonstick spray. In a large bowl, on the medium speed of an electric mixer, cream the butter until smooth. Add the sugars and beat until fluffy, about 3 minutes. Add the egg and yolk and beat well, then the red wine and vanilla. Don’t worry if the batter looks a little uneven. Sift the flour, cocoa, baking soda, baking powder, cinnamon and salt together, right over your wet ingredients. Mix until 3/4 combined, then fold the rest together with a rubber spatula. Spread batter in prepared pan. Bake for 25 to 30 minutes, or until a cake tester inserted into the center comes out clean. The top of the cake should be shiny and smooth, like a puddle of chocolate. Cool in pan on a rack for about 10 minutes, then flip out of pan and cool the rest of the way on a cooling rack. This cake keeps well at room temperature or in the fridge. It looks pretty dusted with powdered sugar.", 
            "Make the topping: Whip mascarpone, cream, sugar and vanilla together until soft peaks form — don’t overwhip. Dollop generously on each slice of cake. It can also be covered and refrigerated for up to 4 hours.", 
            "* I used Bedell First Crush Red, one of our North Fork favorites."
        ], 
        "date": "2011-09-12T10:06:31+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "1 1/4 pound (565 grams) rhubarb, trimmed and cut into 1/2-inch lengths on the diagonal", 
            "1 1/3 cup (265 grams) granulated sugar, divided", 
            "1 tablespoon lemon juice (psst, skip ahead and zest it for the cake before you cut it)", 
            "1/2 cup (1 stick, 4 ounces or 115 grams) unsalted butter, softened", 
            "1/2 teaspoon finely grated lemon zest", 
            "2 large eggs", 
            "1 1/3 cups (165 grams) all-purpose flour", 
            "1 teaspoon baking powder", 
            "3/4 teaspoon table salt", 
            "1/4 teaspoon ground ginger", 
            "1/3 cup (80 grams) sour cream", 
            "Crumb", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 cup (50 grams) light brown sugar", 
            "1/8 teaspoon table salt", 
            "1/4 teaspoon ground cinnamon", 
            "4 tablespoons (1/2 stick, 2 ounces, or 55 grams) unsalted butter, melted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/rhubarb-snacking-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/05/rhubarb-snacking-cake/", 
        "title": "rhubarb snacking cake", 
        "directions": [
            "Make the cake: Preheat your oven to 350°F. Coat the bottom and sides of a 9×13-inch baking pan with butter or a nonstick cooking spray, then line the bottom with parchment paper, extending the lengths up two sides. (It will look like a sling). Stir together rhubarb, lemon juice and 2/3 cup sugar and set aside. Beat butter, remaining sugar and lemon zest with an electric mixer until light and fluffy. Add eggs, one at at time, scraping down the sides after each addition. Whisk together flour, baking powder, 3/4 teaspoon table salt and ground ginger together in a small bowl. Add one-third of this mixture to the batter, mixing until just combined. Continue, adding half the sour cream, the second third of the flour mixture, the remaining sour cream, and then the remaining flour mixture, mixing between each addition until just combined. ", 
            "Dollop batter over prepared pan, then use a spatula — offset, if you have one, makes this easiest — to spread the cake into an even, thin layer. Pour the rhubarb mixture over the cake, spreading it into an even layer (most pieces should fit in a tight, single layer). ", 
            "Stir together the crumb mixture, first whisking the flour, brown sugar, table salt and cinnamon together, then stirring in the melted butter with a spoon or fork. Scatter evenly over rhubarb layer. Bake cake in preheated oven for 50 to 60 minutes. The cake is done when a tester comes out free of the wet cake batter below. It will be golden on top. Cool completely in the pan on a rack. ", 
            "Cut the two exposed sides of the cake free of the pan, if needed, then use the parchment “sling” to remove the cake from the pan. Cut into 2-inch squares and go ahead and eat the first one standing up. (If it’s written into the recipe, it’s not “sneaking” a piece but, in fact, following orders, right?) Share the rest with friends. Cake keeps at room temperature for a few days, but I didn’t mind it at all from the fridge, where I kept it covered tightly. "
        ], 
        "date": "2012-05-29T12:28:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (450 grams) rhubarb, trimmed", 
            "3/4 cup (150 grams) granulated sugar", 
            "Finely grated zest from half a lemon", 
            "4 tablespoons (2 ounces or 55 grams) unsalted butter, cold is fine", 
            "Two pinches of salt", 
            "6 tablespoons (85 grams) unsalted butter, softened", 
            "2/3 cup (125 grams) light or dark brown sugar", 
            "1/4 cup (50 grams) granulated sugar", 
            "2 large eggs", 
            "1/2 teaspoon vanilla extract", 
            "2 teaspoons baking powder", 
            "1/4 teaspoon fine sea salt", 
            "1 teaspoon ground cinnamon", 
            "1/2 teaspoon ground ginger", 
            "1/8 teaspoon ground cloves", 
            "A few gratings of fresh nutmeg", 
            "1/2 cup (120 ml) buttermilk", 
            "1 1/2 cups (195 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/rhubarb-upside-down-spice-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Rhubarb", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2017/05/rhubarb-upside-down-spice-cake/", 
        "title": "rhubarb upside-down spice cake", 
        "directions": [
            "Heat oven: To 350°F.", 
            "Make topping: In a 10-inch ovenproof skillet, trim your rhubarb to lengths that will fit across the bottom in one direction, i.e. some short and some taller. Remove rhubarb and cut each stalk lengthwise into thin (about 1/4-inch thick) ribbons. If your rhubarb is already quite thin, you might just want to halve each piece lengthwise.\nSprinkle sugar into skillet and add lemon zest; use your fingers to mix the zest into the sugar; the grit of the sugar will help release the most flavor from it. Add butter and salt and heat skillet over medium until butter has melted, stirring frequently. Add rhubarb and cook, turning gently, for 3 to 4 minutes, until it has softened slightly and released some of its liquid. Remove from heat and set skillet aside.\nMake cake: In a large bowl, beat butter and sugars until light and fluffy. Add eggs, one at a time, beating until combined, then vanilla. Sprinkle mixture with baking powder, salt, and all the spices and beat well to thoroughly mix them in. Add buttermilk; mixture will have a curdly texture but don’t worry, it’s all going to even out. Scrape down bowl and add flour; beat only until it disappears.\nCheck your rhubarb base to make sure all the pieces are in the order you’d like them to be; nudge around any that are not, then dollop cake batter over rhubarb mixture in small spoonfuls and smooth top as best as you can. As the rhubarb mixture will be very wet, this will seem almost impossible. I actually gave up and just put it in the oven, where the cake spread into one even layer on its own. (Thank you, cake.)\nBake cake: For about 35 minutes, until a toothpick inserted deep into the cake (but not the topping underneath) comes out batter-free. Transfer to a cooling rack and let cool for 5 minutes, then run a knife around the edges to loosen. Place a larger plate upside down over the skillet and use two potholdered hands to flip cake out onto it. If any rhubarb is stuck in the pan or slides down the side, just return it to the top of the cake cake.\nServe: Warm or at room temperature. Cake keeps for a couple days at room temperature and up to a week in the fridge, or so I hear."
        ], 
        "date": "2017-05-05T11:56:47+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (4 tablespoons, 2 ounces or 1/2 stick) unsalted butter", 
            "1/2 cup (about 109 grams) packed dark or light brown sugar (I used dark)", 
            "1/2 cup (118 ml)  heavy cream", 
            "1/2 teaspoon (2 grams) flaky sea salt (or 1/4 teaspoon regular salt), plus more to taste", 
            "1 1/2 teaspoons (8 ml) vanilla extract, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/12/ridiculously-easy-butterscotch-sauce.jpg?w=753", 
        "tags": [
            "Candy", 
            "Ice Cream/Sorbet", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2009/12/ridiculously-easy-butterscotch-sauce/", 
        "title": "ridiculously easy butterscotch sauce", 
        "directions": [
            "Melt butter in a medium heavy-bottomed saucepan over medium heat. Add the sugar, cream and salt and whisk until well blended. [A flat whisk works great here.] Bring to a very gentle boil and cook for about five minutes, whisking occasionally.", 
            "Remove from heat and add one teaspoon of the vanilla extract, stirring to combine and this is where, despite the simplicity of the recipe, you get to feel all “chef-y”. Dip a spoon in the sauce and carefully taste the sauce (without burning your tongue!) to see if you want to add additional pinches or salt or splashes of vanilla. Tweak it to your taste, whisking well after each addition. I ended up using a full teaspoon of flaky salt and the listed amount of vanilla to get a butterscotch sauce with a very loud, impressive butterscotch flavor but the strength of your vanilla and intensity of your salt may vary.", 
            "Serve cold or warm over vanilla ice cream, roasted pears or pound cake. The sauce will thicken as it cools. It can be refrigerated in an airtight container and reheated in a microwave or small saucepan.", 
            "To do ahead: This sauce will keep at least two weeks in an airtight container in the fridge. ", 
            "To gift this up: I’d go the canning route in small jars. (You’ll want to scale the recipe a bit, as it makes less than a cup.) I am not practiced enough in canning to give advice but you should most definitely check out the awesome Food in Jars blog for tips. Whoops! A few readers have warned that butter-and-cream-type confections are not safe to can. A big thank you for keeping the Smitten Kitchen botulism-free! (You can still put these in small jars, but warn that they are, indeed, perishable and should be kept in the fridge.)"
        ], 
        "date": "2009-12-15T18:39:55+00:00"
    }, 
    {
        "ingredient_list": [
            "11 ounces Valrhona chocolate (56% cacao)", 
            "2/3 cup heavy cream", 
            "Valrhona cocoa powder for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/robert-linxes-chocolate-truffles1.jpg?w=500", 
        "tags": [
            "Candy", 
            "Chocolate", 
            "Elsewhere", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/robert-linxes-chocolate-truffles/", 
        "title": "robert linxe’s chocolate truffles", 
        "directions": [
            "Finely chop 8 ounces of the chocolate and put in a bowl. Bring heavy cream to a boil in a small heavy saucepan. Make sure your pan is small, so you’ll lose the least amount of cream to evaporation, and heavy, which will keep the cream from scorching. Linxe boils his cream three times — he believes that makes the ganache last longer. If you do this, compensate for the extra evaporation by starting with a little more cream.", 
            "Pour the cream over the chocolate, mashing any big pieces with a wooden spoon.", 
            "Then stir with a whisk in concentric circles (don’t beat or you’ll incorporate air), starting in the center and working your way to the edge, until the ganache is smooth.", 
            "Let stand at room temperature until thick enough to hold a shape, about 1 hour, then, using a pastry bag with a 3/8-inch opening or tip, pipe into mounds (about 3/4 inch high and 1 inch wide) on parchment-lined baking sheets. When piping, finish off each mound with a flick of the wrist to soften and angle the point tip. Freeze until firm, about 15 minutes.", 
            "Meanwhile, melt 3 more ounces of the same Valrhona and smear some on a gloved hand. Gently rub each chilled truffle to coat lightly with chocolate.  (The secret to a delicate coating of chocolate is to roll each truffle in a smear of melted chocolate in your hand. Linxe always uses gloves.)", 
            "Toss the truffles in unsweetened Valrhona cocoa powder so they look like their namesakes, freshly dug from the earth. A fork is the best tool for tossing truffles in cacao. Shake truffles in a sieve to eliminate excess cacao. ", 
            "Store truffles in the refrigerator. "
        ], 
        "date": "2007-12-27T15:19:58+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces (113 grams) unsalted butter, plus extra for the pan", 
            "1 10-ounce (285-gram) bag marshmallows", 
            "Heaping 1/4 teaspoon coarse sea salt", 
            "6 cups (160 grams) crispy rice cereal (about half a 12-ounce box)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/salted-brown-butter-crispy-treats.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Candy", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2009/11/salted-brown-butter-crispy-treats/", 
        "title": "salted brown butter crispy treats", 
        "directions": [
            "Butter (or coat with non-stick spray) an 8-inch square cake pan with 2-inch sides.", 
            "In a large pot, melt butter over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as while you may be impatient for it to start browning, the period between the time the butter begins to take on color and the point where it burns is often less than a minute.", 
            "As soon as the butter takes on a nutty color, turn the heat off and stir in the marshmallows. The residual heat from the melted butter should be enough to melt them, but if it is not, turn it back on low until the marshmallows are smooth.", 
            "Remove the pot from the stove and stir in the salt and cereal together. Quickly spread into prepared pan. I liked to use a piece of waxed or parchment paper that I’ve sprayed with oil to press it firmly and evenly into the edges and corners, though a silicon spatula works almost as well.", 
            "Let cool, cut into squares and get ready to make new friends. "
        ], 
        "date": "2009-11-02T13:52:13+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups heavy cream", 
            "10 1/2 oz fine-quality bittersweet chocolate (no more than 60% cacao if marked), finely chopped [Deb note: my in-house options were Toll House chocolate chips or high-quality 72% chocolate. I went with the 72 percent. The slight extra bitterness is fantastic.]", 
            "1 3/4 cups sugar", 
            "1/2 cup light corn syrup", 
            "1/4 cup water", 
            "1/4 teaspoon salt", 
            "3 tablespoons unsalted butter, cut into tablespoon pieces", 
            "2 teaspoons flaky sea salt such as Maldon", 
            "Vegetable oil for greasing"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/salty-and-sublime1.jpg?w=500", 
        "tags": [
            "Candy", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/salty-and-sublime/", 
        "title": "salted chocolate caramels", 
        "directions": [
            "Special equipment: parchment paper; a candy thermometer", 
            "Line bottom and sides of an 8-inch straight-sided square metal baking pan with 2 long sheets of crisscrossed parchment.", 
            "Bring cream just to a boil in a 1- to 1 1/2-quart heavy saucepan over moderately high heat, then reduce heat to low and add chocolate. Let stand 1 minute, then stir until chocolate is completely melted. Remove from heat.", 
            "Bring sugar, corn syrup, water, and salt to a boil in a 5- to 6-quart heavy pot over moderate heat, stirring until sugar is dissolved. Boil, uncovered, without stirring but gently swirling pan occasionally, until sugar is deep golden, about 10 minutes. Tilt pan and carefully pour in chocolate mixture (mixture will bubble and steam vigorously). Continue to boil over moderate heat, stirring frequently, until mixture registers 255°F on thermometer, about 15 minutes. Add butter, stirring until completely melted, then immediately pour into lined baking pan (do not scrape any caramel clinging to bottom or side of saucepan). Let caramel stand 10 minutes, then sprinkle evenly with sea salt. Cool completely in pan on a rack, about 2 hours.", 
            "Carefully invert caramel onto a clean, dry cutting board, then peel off parchment. Turn caramel salt side up. Lightly oil blade of a large heavy knife and cut into 1-inch squares.  (If desired, additional sea salt can be pressed onto caramels after cutting.)", 
            "Caramels keep, layered between sheets of parchment or wax paper, in an airtight container at cool room temperature 2 weeks. To package them up pretty, the caramels can be wrapped in 4-inch squares of wax paper; twist ends to close."
        ], 
        "date": "2006-11-28T11:50:40+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup light brown sugar, packed", 
            "1/3 cup vegetable oil", 
            "1 egg", 
            "1/2 teaspoon vanilla", 
            "1 tablespoon rum", 
            "1 cup flour", 
            "1/4 cup whole wheat flour", 
            "1/2 teaspoon salt", 
            "1 teaspoon baking soda", 
            "1/4 cup sour cream", 
            "1/2 cup diced rhubarb", 
            "1/2 cup sliced strawberries", 
            "1/4 cup chopped pecans", 
            "Topping (Optional)", 
            "1 tablespoons granulated sugar", 
            "1/4 teaspoon cinnamon", 
            "3 to 3 1/2 tablespoons flour", 
            "2 tablespoons butter, melted", 
            "1/4 cup chopped pecans or walnuts"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/some-south-in-your-mouth1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Rhubarb", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2007/03/some-south-in-your-mouth/", 
        "title": "strawberry rhubarb pecan loaf", 
        "directions": [
            "Beat together the brown sugar, vegetable oil, egg, vanilla and rum. Combine the flours, salt and baking soda; stir. Add dry ingredients to first mixture with the sour cream. Stir in strawberries, rhubarb and pecans. ", 
            "Spread into a greased 9×5-inch loaf pan — the batter will be very thick. Combine topping ingredients except the pecans, they should be thick and clumpy; add the pecans last and sprinkle over the loaf.", 
            "Bake at 350° for about 55 to 65 minutes, or until a wooden pick or cake tester inserted in center comes out clean."
        ], 
        "date": "2007-03-10T13:44:53+00:00"
    }, 
    {
        "ingredient_list": [
            "For cake", 
            "2 cups (8 3/4 ounces or 250 grams) all-purpose flour", 
            "2 teaspoons (10 grams) baking powder", 
            "1/2 teaspoon (3 grams) baking soda", 
            "1/2 teaspoon (3 grams) salt", 
            "3/4 teaspoon (2 grams) cinnamon", 
            "1/2 teaspoon (1 gram) ground ginger", 
            "1/8 teaspoon ground cloves", 
            "1 stick (4 ounces or 113 grams) unsalted butter, softened", 
            "1 cup (6 7/8 ounces or 195 grams) packed light brown sugar (updated weight)", 
            "1 teaspoon (5 ml) pure vanilla extract", 
            "2 large eggs", 
            "1 1/2 cups (about 13 ounces or 365 grams) unsweetened applesauce", 
            "1/2 cup (about 1 3/4 ounces or 50 grams) walnuts (optional), toasted, cooled, and chopped", 
            "For frosting", 
            "5 ounces (142 grams) cream cheese, softened", 
            "3 tablespoons (1 1/2 ounces or 42 grams) unsalted butter, softened", 
            "1/4 teaspoon pure vanilla extract", 
            "1 cup (4 ounces or 120 grams) confectioners sugar", 
            "1/2 (1 teaspoon) teaspoon cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/spiced-applesauce-cake.jpg?w=749", 
        "tags": [
            "Apple", 
            "Cake", 
            "Everyday Cakes", 
            "Fall", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/10/spiced-applesauce-cake/", 
        "title": "spiced applesauce cake", 
        "directions": [
            "Preheat oven to 350°F with rack in middle. Butter an 8- or 9-inch square cake pan. I had no trouble getting my cake out of a nonstick pan by just buttering it, but if you don’t have a nonstick cake pan or are a little nervous, line the bottom with parchment paper and butter that too.", 
            "Make cake: Whisk together flour, baking powder, baking soda, salt, and spices. Beat butter, brown sugar, and vanilla with an electric mixer at high speed until pale and fluffy, 2 to 3 minutes. Add eggs one at a time, beating well after each addition, then beat in applesauce. At low speed, mix in flour mixture until just combined, then stir in walnuts (if using). The batter will look a little curdly and uneven but don’t worry, it will all bake up perfectly in the end.", 
            "Spread batter evenly in pan and bake until golden-brown and a wooden pick inserted into center comes out clean, about 35 to 40 minutes. Cool in pan 15 minutes. Run a knife around edge of cake to loosen, then invert onto a plate. Reinvert cake onto a rack to cool completely. You can speed this up, as I always do, in the fridge.", 
            "Make frosting: Beat cream cheese, butter, and vanilla with an electric mixer at high speed until fluffy. Sift confectioners sugar and cinnamon over cream cheese mixture, then beat at medium speed until incorporated. Spread frosting over top of cooled cake.", 
            "Do ahead: We were impressed with how well this cake kept for three days but were unable to “research” if it lasted longer. Keep frosted cake in the fridge. If you’d like to bake the cake further in advance, I’d wrap it well and freeze it until the day you need it. Leave it out on the counter to defrost and frost it up to a day in advance."
        ], 
        "date": "2010-10-25T11:48:25+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/spicy-caramel-popcorn1.jpg?w=640", 
        "tags": [
            "Candy", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/12/spicy-caramel-popcorn/", 
        "title": "spicy caramel popcorn", 
        "directions": [
            "Lightly coat two large, heatproof rubber spatulas, a very large mixing bowl and two large baking sheets with nonstick cooking spray or a thin slick of oil.", 
            "In a large saucepan or pot with a lid, heat the oil over medium-high heat. Add the popcorn kernels, cover and keep the saucepan moving until all of the kernels have popped, about 5 minutes. Transfer to the prepared bowl, removing any unpopped kernels. Toss with salted peanuts, if using.", 
            "In a small bowl, whisk together the baking soda and cayenne pepper.", 
            "Have the two large baking sheets ready. In a medium saucepan, combine the sugar, butter, salt and 1/2 cup water. Cook over high heat, without stirring, until the mixture becomes a light golden-yellow caramel, 10 to 14 minutes. Remove from the heat and carefully whisk in the baking-soda mixture (the mixture will bubble up).", 
            "Immediately pour the caramel mixture over the popcorn and don’t fuss if it doesn’t all come out of the pot — you’ll have plenty. Working quickly and carefully, use the prepared spatulas to toss the caramel and popcorn together, as if you were tossing a salad, until the popcorn is well coated.", 
            "Spread the popcorn onto the baking sheets and quickly separate them into small pieces while still warm. Cool to room temperature, about 15 minutes. Once cool, store in an airtight container for up to two weeks or two minutes, if you’ve got a family like mine."
        ], 
        "date": "2009-12-30T13:31:46+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/springy-fluffy-marshmallows1.jpg?w=500", 
        "tags": [
            "Candy", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/06/springy-fluffy-marshmallows/", 
        "title": "springy, fluffy marshmallows", 
        "directions": [
            "Oil bottom and sides of a 13- by 9- by 2-inch rectangular metal baking pan and dust bottom and sides with some confectioners’ sugar.", 
            "In bowl of a standing electric mixer or in a large bowl sprinkle gelatin over 1/2 cup cold cold water, and let stand to soften.", 
            "In a 3-quart heavy saucepan cook granulated sugar, corn syrup, second 1/2 cup of cold water, and salt over low heat, stirring with a wooden spoon, until sugar is dissolved. Increase heat to moderate and boil mixture, without stirring, until a candy or digital thermometer registers 240°F, about 12 minutes. Remove pan from heat and pour sugar mixture over gelatin mixture, stirring until gelatin is dissolved.", 
            "With standing or a hand-held electric mixer beat mixture on high speed until white, thick, and nearly tripled in volume, about six minutes if using standing mixer or about 10 minutes if using hand-held mixer. (Some reviewers felt this took even longer with a hand mixer, but still eventually whipped up nicely.)", 
            "In separate medium bowl with cleaned beaters beat egg whites (or reconstituted powdered whites) until they just hold stiff peaks. Beat whites and vanilla (or your choice of flavoring) into sugar mixture until just combined. Pour mixture into baking pan and don’t fret if you don’t get it all out (learning from my mess of a first round). Sift 1/4 cup confectioners sugar evenly over top. Chill marshmallow, uncovered, until firm, at least three hours, and up to one day.", 
            "Run a thin knife around edges of pan and invert pan onto a large cutting board. Lifting up one corner of inverted pan, with fingers loosen marshmallow and ease onto cutting board. With a large knife trim edges of marshmallow and cut marshmallow into roughly one-inch cubes. (An oiled pizza cutter works well here too.) Sift remaining confectioners’ sugar back into your now-empty baking pan, and roll the marshmallows through it, on all six sides, before shaking off the excess and packing them away.", 
            "Do ahead: Marshmallows keep in an airtight container at cool room temperature 1 week."
        ], 
        "date": "2009-06-07T09:05:15+00:00"
    }, 
    {
        "ingredient_list": [
            "For the cake", 
            "3 tablespoons milk at room temperature", 
            "1 3/4 teaspoons active dry yeast", 
            "6 tablespoons unsalted butter at room temperature", 
            "3 tablespoons sugar", 
            "1 teaspoon kosher salt", 
            "1 large egg", 
            "1 3/4 cups all-purpose flour", 
            "For the topping", 
            "3 tablespoons plus 1 teaspoon light corn syrup", 
            "2 1/2 teaspoons vanilla extract", 
            "12 tablespoons (1 1/2 sticks) unsalted butter, at room temperature", 
            "1 1/2 cups sugar", 
            "1/2 teaspoon kosher salt", 
            "1 large egg", 
            "1 cup plus 3 tablespoons all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/st-louis-gooey-butter-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/03/st-louis-gooey-butter-cake/", 
        "title": "st. louis gooey butter cake", 
        "directions": [
            "Confectioners’ sugar, for sprinkling.", 
            "Make the cake dough: In a small bowl, mix milk with 2 tablespoons warm water. Add yeast and whisk gently until it dissolves. Mixture should foam slightly. (Very slightly in my case.)", 
            "Using an electric mixer with paddle attachment, cream butter, sugar and salt. Scrape down sides of bowl and beat in the egg. Alternately add flour and the milk mixture, scraping down sides of bowl between each addition. Clark doesn’t say to do this, but I switched to a dough hook at this point to beat dough on medium speed until it formed a smooth mass and pulled away (just a little, my dough was still very soft) from sides of bowl, 7 to 10 minutes.", 
            "Press, stretch and nudge dough into an ungreased (original recipe suggests this; I found that my topping stuck a lot and I really had to cut around it with a sharp knife; I will grease mine next time) 9-by 13-inch baking dish (see Note above about baking dishes) at least 2 inches deep. Cover dish with plastic wrap or clean tea towel, put in a warm place, and allow to rise until doubled, 2 1/2 to 3 hours.", 
            "Make the gooey topping: Heat oven to 350 degrees. To prepare topping, in a small bowl, whisk corn syrup with 2 tablespoons water and the vanilla. Using an electric mixer with paddle attachment, cream butter, sugar and salt until light and fluffy, 5 to 7 minutes. Scrape down sides of bowl and beat in the egg. Alternately add flour and corn syrup mixture, scraping down sides of bowl between each addition.", 
            "Spoon topping in large dollops over risen cake and use an offset spatula to gently spread it in an even layer. Bake for 30 to 45 minutes (see Note above about wide range); cake will rise and fall in waves and have a golden brown top, but will still be liquid in center when done. Allow to cool in pan before sprinkling with confectioners’ sugar for serving."
        ], 
        "date": "2010-03-01T23:56:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (80 grams) rolled oats", 
            "3/4 cup (95 grams) plus up to 2 tablespoons (15 grams) extra all-purpose flour", 
            "1/2 cup (95 grams) light brown sugar", 
            "Heaped 1/4 teaspoon table salt", 
            "6 tablespoons (85 grams) unsalted butter, melted", 
            "1 teaspoon cornstarch (optional, but helps firm up the filling)", 
            "1 tablespoon (15 ml) lemon juice", 
            "1 tablespoon (15 grams) granulated sugar, divided", 
            "1 cup (125 grams) small-diced rhubarb (from about 1 1/2 medium stalks)", 
            "1 cup (155 grams) small-diced strawberries", 
            "Powdered sugar, for decoration, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/strawberry-rhubarb-crisp-bars1.jpg?w=640", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Crumbles/Crisps", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Rhubarb", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/05/strawberry-rhubarb-crisp-bars/", 
        "title": "strawberry rhubarb crisp bars", 
        "directions": [
            "Heat oven to 375 degrees F. For easy removal, line bottom and two sides of 8-by-8-inch square baking pan with parchment paper. No need to bother (and no greasing needed) if you plan to serve them right in the pan, as I did. ", 
            "Place oats, 3/4 cup flour, brown sugar and salt in bottom of baking pan and mix. Pour melted butter over, and stir until clumps form. If the clumps feel soft or look overly damp, add the remaining 2 tablespoons flour. Set aside 1/2 cup of the crumble mixture. Press the rest of the crumb mixture evenly in the bottom of the pan.", 
            "Spread half the fruit over the crust. Sprinkle it evenly with cornstarch, then lemon juice, and 1/2 tablespoon of granulated sugar. Spread remaining fruit over this, and top with second 1/2 tablespoon sugar. Scatter reserved crumbs over fruit and bake bars for 30 to 40 minutes (firmer fruits will take longer), until fruit is bubbly and crisp portion is golden and smells toasty and amazing. ", 
            "Let cool in pan; I do this in the fridge, where they become crisp once chilled (less so at room temperature). Cut into squares and sprinkle with powdered sugar before serving. Store leftovers in fridge."
        ], 
        "date": "2014-05-09T11:20:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 2/3 cups (224 grams) all-purpose flour", 
            "3 1/2 tablespoons (50 grams) sugar", 
            "1 tablespoon plus 1/2 teaspoon (20 grams) baking powder", 
            "2 hard-boiled egg yolks", 
            "1/8 teaspoon salt", 
            "6 tablespoons (84 grams) cold unsalted butter, cut into 1/2-inch cubes", 
            "2 teaspoons lemon or orange zest (optional)", 
            "2/3 cup (168 grams) plus 1 tablespoon heavy cream", 
            "Shortcake assembly", 
            "1/2 pound strawberries, washed, hulled and quartered", 
            "2 tablespoons (25 grams) sugar", 
            "1 tablespoon lemon juice", 
            "1 cup whipping cream, beaten to soft peaks"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/3552480009_66d3866192_o.jpg?w=753", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Scones/Biscuits", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/05/strawberry-shortcakes/", 
        "title": "strawberry shortcakes", 
        "directions": [
            "In the bowl of a food processor, combine the flour, sugar, baking powder, egg yolks, and salt. Pulse to combine. Add the butter and zest, if using, and pulse until the flour resembles coarse meal. Add 2/3 cup of cream and pulse until the dough comes together.", 
            "Turn the dough out onto a lightly floured work surface and gather into a shaggy mass. Knead a couple times to make it into a cohesive mass and then pat it into a rough circle about 6 to 7 inches in diameter, and 3/4 to 1-inch thick.", 
            "Using a sharp knife, cut the circle into 6 wedges and arrange on a parchment-lined baking sheet. Alternately, you can use a cookie cutter to make shapes of your choice. Chill for 20 minutes (and up to 2 hours).", 
            "Preheat oven to 350°F. Brush the tops of the shortcakes very lightly with heavy cream and sprinkle lightly with the coarse sugar. Bake until risen and golden brown, 18 to 20 minutes. Turn the pan around halfway through to ensure even cooking.", 
            "While the shortcakes are baking, toss the strawberries, sugar and lemon juice together in a bowl. Let stand several minutes. (If the strawberries are extremely firm, do this 30 minutes in advance.)", 
            "Split the shortcakes in half horizontally and set the tops aside. Place the bottoms on dessert plates and heap strawberries over them. Spoon whipped cream generously over the strawberries and replace the shortcake tops. Serve immediately with any remaining whipped cream on the side."
        ], 
        "date": "2009-05-24T13:11:15+00:00"
    }, 
    {
        "ingredient_list": [
            "6 tablespoons (85 grams) unsalted butter, at room temperature, plus extra for pie plate", 
            "1 1/2 cups (188 grams) all-purpose flour (can swap 3/4 cup or 94 grams all-purpose flour with 3/4 cup or 75 grams of barley flour, see Note)", 
            "1 1/2 teaspoons baking powder", 
            "1/2 teaspoon table salt", 
            "1 cup (200 grams) plus 2 tablespoons (25 grams) granulated sugar", 
            "1 large egg", 
            "1/2 cup (118 ml) milk", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 pound (450 grams) strawberries, hulled and halved"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/5752837495_242b649dbf_o.jpg?w=750", 
        "tags": [
            "Everyday Cakes", 
            "Photo", 
            "Picnics", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2011/05/strawberry-summer-cake/", 
        "title": "strawberry summer cake", 
        "directions": [
            "Preheat oven to 350°F (180°C). Butter a 10-inch pie pan or 9-inch deep-dish pie pan (what I used). I did not test this with a standard 9-inch pie plate but looking at the margin of space leftover in my deep-dish pan after baking the cake, I suspect you’d be safe. Updated 6/13/11: This cake does not work in a standard 9-inch pie pan; it will overflow. Big apologies to anyone who learned the hard way! This cake would work, however, in a 9- or 10-inch springform or cake pan. The 10-inch would make a thinner cake than pictured.\nWhisk flour or flours, baking powder and salt together in a small bowl. In a larger bowl, beat butter and 1 cup sugar until pale and fluffy with an electric mixer, about 3 minutes. Mix in egg, milk and vanilla until just combined. Add dry mixture gradually, mixing until just smooth.\nPour into prepared pie plate. Arrange strawberries, cut side down, on top of batter, as closely as possible in a single layer (though I had to overlap a few to get them all in). Sprinkle remaining 2 tablespoons sugar over berries.\nBake cake for 10 minutes then reduce oven temperature to 325°F and bake cake until golden brown and a tester comes out free of wet batter, about 50 minutes to 60 minutes. (Gooey strawberries on the tester are a given.) Let cool in pan on a rack. Cut into wedges. Serve with lightly whipped cream.\nDo ahead: Cake can be stored at room temperature for up to 2 days, loosely covered, but good luck with that.\n"
        ], 
        "date": "2011-05-23T22:01:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup dark-brown sugar", 
            "2/3 cup white granulated sugar", 
            "1 teaspoon kosher salt (I might up this by a 1/2 tsp. next time for more of a sweet/salty balance)", 
            "Generous pinch of cayenne pepper (I swapped this with 1/4 teaspoon of hot smoked paprika)", 
            "1 teaspoon ground cinnamon", 
            "1 pound walnut or pecan halves or whole peeled hazelnuts", 
            "1 egg white, room temperature", 
            "1 tablespoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/sugar-and-spice-candied-nuts1.jpg?w=640", 
        "tags": [
            "Candy", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/12/sugar-and-spice-candied-nuts/", 
        "title": "sugar-and-spice candied nuts", 
        "directions": [
            "Preheat oven to 300 degrees. Mix sugars, salt, cayenne, and cinnamon, making sure there are no lumps; set aside. Beat egg white and water until frothy but not stiff. Add walnuts, and stir to coat evenly. Sprinkle nuts with sugar mixture, and toss until evenly coated. Spread sugared nuts in a single layer on a cookie sheet fitted with parchment paper. Bake for 30 minutes, stirring occasionally. Remove from oven, and separate nuts as they cool. When completely cool, pour the nuts into a bowl, breaking up any that stick together. "
        ], 
        "date": "2008-12-31T11:47:46+00:00"
    }, 
    {
        "ingredient_list": [
            "Topping", 
            "4 tiny-to-small apples, halved, peeled and cored", 
            "2 tablespoons fresh lemon juice", 
            "2 tablespoons granulated sugar", 
            "Batter", 
            "1/2 cup plus 1 tablespoon (125 grams) unsalted butter, at room temperature", 
            "1/4 cup plus 2 tablespoons (6 tablespoons) granulated sugar", 
            "1/4 cup honey (any variety you like to eat)", 
            "1 teaspoon vanilla extract", 
            "3 large eggs, separated", 
            "2 good pinches of salt", 
            "2 teaspoons baking powder", 
            "1 1/4 cups all-purpose flour", 
            "Glaze", 
            "1/4 cup honey", 
            "A good pinch of sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/sunken-apple-cake-with-salted-honey-glaze1.jpg?w=640", 
        "tags": [
            "Apple", 
            "Cake", 
            "Everyday Cakes", 
            "Fall", 
            "German", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/09/sunken-apple-and-honey-cake/", 
        "title": "sunken apple and honey cake", 
        "directions": [
            "Heat oven: To 350°F. Coat a 9-inch springform with butter or a nonstick spray. Line the bottom of the pan with a round of parchment paper. ", 
            "Prepare apples: Place peeled, halved and cored apples cut-side-down on a cutting board. Use a knife to create parallel thin slices, but only cut halfway through each apple so that the apples stay intact. Don’t fret if you cut through, however; you can just reassemble the halves on the cake in a few minutes.", 
            "In a bowl, toss apples with lemon juice and 2 tablespoon granulated sugar.", 
            "Prepare cake base: Beat butter and 1/4 cup plus 2 tablespoons granulated sugar together in a bowl with electric beaters until fluffy. Add honey and beat until combined. Add vanilla and egg yolks, beating until just combined. Sprinkle salt and baking powder over cake batter, and mix for just 5 seconds, until they disappear. Add flour, half at a time, mixing only until just combined.", 
            "In a separate bowl with cleaned beaters, beat egg whites until stiff. Stir 1/4 of them into the cake batter, to lighten it a little. Fold in the rest in three additions. It will seem impossible to fold in at first because the batter is so stiff, but it will loosen with careful folding. Only fold the last addition of egg whites until it has mostly disappeared (a couple faint streaks of egg white are fine). ", 
            "Spread cake batter in prepared cake pan, smoothing the top. Arrange apple halves facedown over the cake batter. To warn, 4 tiny/small apples will definitely fit over the cake batter. When I made it with 4 small-almost-medium apples, I could only fit 3 1/2 of them. No need to press the apples into the batter. You can pour any extra lemon juice and sugar in the bowl over the apples.", 
            "Bake cake: 35 to 40 minutes, until a toothpick or skewer inserted into the center of the cake comes out clean. Let rest on a cooling rack for 5 minutes, then cut around the cake to make sure it’s not sticking to the pan at all, and unhinge the sides. Let cake cool completely. You can store it at room temperature at this point, or after you add the honey, for up to 5 days 3 days at room temperature. After that, a fridge is best for longevity. The cake is lovelier on day 2 than day 1.", 
            "Before serving, if you’d like the glaze to look glossy, or whenever the cake is cool, if you don’t mind if the honey sinks into the cake: Warm 1/4 cup honey and a good pinch of sea salt until it liquefies to the point where it makes a thin glaze — this will take less than 30 seconds. Brush honey-salt mixture over cooled cake. "
        ], 
        "date": "2014-09-22T12:17:45+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "1 1/2 pounds sweet potatoes (about 2 to 3 medium or 2 large)", 
            "2 cups (250 grams) all-purpose flour", 
            "1 3/4 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon table salt", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon (more to taste) ground ginger", 
            "Two pinches (more to taste) ground cloves", 
            "1/2 cup (1 stick or 115 grams) unsalted butter, at room temperature", 
            "1 cup (190 grams) packed light brown sugar", 
            "1/2 teaspoon vanilla extract", 
            "2 large eggs", 
            "Frosting", 
            "3 large egg whites", 
            "3/4 cup granulated sugar", 
            "Pinch of salt", 
            "1/4 teaspoon cream of tartar (will help stabilize egg whites, don’t worry if you don’t have it)", 
            "1/2 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/sweet-potato-cake-with-toasted-marshmallow-frosting1.jpg?w=640", 
        "tags": [
            "Celebration Cakes", 
            "Everyday Cakes", 
            "Fall", 
            "Photo", 
            "Potatoes", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2013/11/sweet-potato-cake-with-marshmallow-frosting/", 
        "title": "sweet potato cake with marshmallow frosting", 
        "directions": [
            "Roast sweet potatoes: Heat oven to 375 degrees. Prick potatoes all over with a fork. Rest on a baking sheet. Roast for 45 minutes to 1 hour, turning once or twice, until soft. Let cool completely. Can be kept in fridge for up to 3 days, if baked in advance.", 
            "Make cake: Heat oven to 350 degrees F. Line the bottom of an 8- to 9-inch square pan with parchment paper, then butter the paper and sides of the pan. [If you trust your nonstick pan, you might be able to skip the parchment, but I don’t like to live on the edge when it comes to getting cakes out of a pan.]", 
            "Peel cooled sweet potatoes and run flesh through a potato ricer, or mash until very smooth. (Do not blend in a blender or food processor.) Measure 1 1/2 packed cups (about 12 to 13 ounces) from sweet potato mash; you may have a little extra, which you should warm up with a pat of butter and sprinkle of sea salt and not share with anyone.", 
            "Whisk flour, baking powder, baking soda, salt and spices together in a medium bowl. In a large bowl, beat butter and brown sugar together with an electric mixer until light and fluffy, about 2 to 3 minutes. Add vanilla and eggs, and beat until just combined. Mix in sweet potato puree, then stir in dry ingredients just until they disappear. ", 
            "Spread batter in prepared pan, and bake cake until a toothpick inserted into the center comes out clean, about 35 to 40 minutes. Let cake rest in pan for 5 minutes on a cooling rack, then invert onto cooling rack, and let cool completely. You can speed this up, as I always do, in the fridge.", 
            "Make frosting: Place egg whites, granulated sugar, a pinch of salt and cream of tartar in a heatproof bowl set over a saucepan of gently simmering water. Whisk mixture for 3 minutes, until whites are warmed and sugar granules feels mostly dissolved. Remove bowl from top of saucepan, then, with an electric mixer, beat egg white mixture on high speed until stiff, glossy peaks form, about 4 to 7 minutes longer. Add vanilla and mix until combined.", 
            "Frost and decorate: If you’d like to make huge, marshmallow-like dollops, spread a bit of frosting thinly over cooled sweet potato cake. Then, using a very large round piping tip (I have an almost comically large one with a 1/2-inch opening) or the corner snipped off a freezer bag, pipe large dollops of frosting all over thin frosting layer. If you’d like to skip the dollops, you can just spread the frosting, thick and swirly, all over.", 
            "Using a kitchen torch, lightly brown the dollops so that they look (and smell!) like toasted marshmallows. ", 
            "Serve: At room temperature cut into squares. Cake keeps at room temperature for two days; any longer, I like to keep it in the fridge."
        ], 
        "date": "2013-11-26T12:51:34+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "6 tablespoons (85 grams) unsalted butter, at room temperature", 
            "3/4 cup (145 grams) firmly packed dark brown sugar", 
            "2 tablespoons (25 grams) granulated sugar", 
            "1 large egg", 
            "1 large egg yolk", 
            "3/4 cup (175 ml) buttermilk (see Notes for other options)", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1/2 cup (41 grams) Dutch cocoa powder", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon baking soda", 
            "1/2 teaspoon baking powder", 
            "1/2 teaspoon table or fine sea salt", 
            "Frosting", 
            "2 ounces (55 grams) unsweetened chocolate, melted and cooled", 
            "1 1/2 cups (180 grams) powdered sugar (sifted if lumpy)", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, at room temperature", 
            "Pinch of fine sea salt (optional)", 
            "1 tablespoons cream or whole milk", 
            "1/2 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/the-i-want-chocolate-cake-cake1.jpg?w=750", 
        "tags": [
            "Cake", 
            "Chocolate", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/02/the-i-want-chocolate-cake-cake/", 
        "title": "the ‘i want chocolate cake’ cake", 
        "directions": [
            "I don’t have Dutched cocoa: Dutch-process cocoa (generally speaking, it’s the standard in European brands) differs from natural cocoa (what you have if your cocoa isn’t labeled Dutch, or if it’s an American brand) in that its acidity has been neutralized to form a darker, nuttier cocoa that I prefer. That said, if you don’t have Dutched but only a regular or natural cocoa, I haven’t tested this cake with it but suspect that you’ll be just fine, although the cake may be less dark in color.", 
            "How I like to swirl frosting: I always use a small offset spatula (have I convinced you to buy one yet? Seriously, $4. Do it.) and I think the secret is to always push the frosting from the center out, not pull it back. So, push and then make an S-swirl, push and S-swirl, repeat and always quit while you’re ahead (hard, because it’s so fun). ", 
            "Confetti sprinkles: I got mine from New York Cake on 22nd Street but, of course, Amazon sells them as well. "
        ], 
        "date": "2015-02-26T11:48:11+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-sunny-day-yawn1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Pineapple"
        ], 
        "url": "https://smittenkitchen.com/2007/05/the-sunny-day-yawn/", 
        "title": "pineapple upside-down cake", 
        "directions": [
            "Special equipment: A well-seasoned 10-inch cast-iron skillet. If you lack a cast-iron skillet of this size, make the caramel in a small pot and scrape it into the bottom of a similarly-sized cake pan.  (I used a 9″ cake pan in the pictures above.)", 
            "Preheat oven to 350°F (175°C).", 
            "Make topping: Cut pineapple crosswise into 3/8-inch-thick pieces. Melt butter in skillet. Add brown sugar and simmer over moderate heat, stirring, four minutes. Remove from heat. Arrange pineapple on top of sugar mixture in concentric circles, overlapping pieces slightly.", 
            "Make batter: Sift together flour, baking powder, and salt. Beat butter in a large bowl with an electric mixer until light and fluffy, then gradually beat in granulated sugar. Add eggs, one at a time, beating well after each addition. Beat in vanilla and rum. Add half of flour mixture and beat on low speed just until blended. Beat in pineapple juice, then add remaining flour mixture, beating just until blended. (Batter may appear slightly curdled.) ", 
            "Spoon batter over pineapple topping and spread evenly. Bake cake in middle of oven until golden and a tester comes out clean, about 45 minutes. Let cake stand in skillet five minutes. Invert a plate over skillet and invert cake onto plate (keeping plate and skillet firmly pressed together). Replace any pineapple stuck to bottom of skillet. Sprinkle rum over cake and cool on plate on a rack. ", 
            "Serve cake just warm or at room temperature.", 
            "Do ahead: Cake may be made one day ahead and chilled, covered. Bring to room temperature before serving."
        ], 
        "date": "2007-05-07T14:38:35+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/tres-leches-cake1.jpg?w=750", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Everyday Cakes", 
            "Photo", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2015/12/tres-leches-cake-a-taco-party/", 
        "title": "tres leches cake + a taco party", 
        "directions": [
            "Heat oven to 350 degrees F. Butter and flour a 9×13 baking pan, or coat it with a nonstick cooking spray.", 
            "In a small bowl, whisk together flour, cornstarch (together, these make “cake flour” without you having to buy it), salt and baking powder. If using a fresh vanilla bean, rub seeds into 1 1/4 cups granulated sugar to disperse them and help release the most flavor. In the bowl of an electric mixer fitted with the whisk attachment, beat egg whites on medium speed until soft peaks form. With the machine still running, gradually add the sugar (vanilla bean-infused or plain) and beat on medium-high until stiff peaks form. If you haven’t used a vanilla bean, now add your vanilla extract and beat to combine.", 
            "Add yolks one at at time, beating thoroughly after each addition. Add milk and beat just to combine. Add flour mixture, one-third at at time, folding in each addition gently by hand. ", 
            "Pour batter in prepared pan and smooth top. Bake for 18 to 24 minutes, or until a tester inserted into cake comes out clean. Let completely cool in pan on a rack. ", 
            "In a large bowl, preferably one with a pouring spout, whisk together evaporated milk, condensed milk and 1 1/2 cups heavy or light cream. Add rum, if using.  Use a wooden skewer to poke holes all over cake. Pour all but 1/2 cup milk mixture over cake and transfer to fridge, giving the cake several hours but ideally overnight to soak it up. (Save last bit of milk mixture for serving.)", 
            "Before serving, beat 2 cups heavy cream with 2 tablespoons powdered or granulated sugar until soft peaks form. Spread over top of cake. ", 
            "Serve cake in squares, first pouring a little puddle of reserved three-milk mixture at the bottom of plate. "
        ], 
        "date": "2015-12-09T12:05:09+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "2 1/2 cups (355 grams) plus 2 tablespoons (20 grams) all-purpose flour", 
            "2 teaspoons (10 grams) baking powder", 
            "1 teaspoon fine sea salt or table salt", 
            "1 cup (8 ounces or 225 grams) unsalted butter, at room temperature", 
            "1 3/4 cups (340 grams) granulated sugar", 
            "Zest of 1 lemon", 
            "3 large eggs, at room temperature", 
            "1/2 teaspoon vanilla extract", 
            "3/4 cup (175 ml) buttermilk", 
            "3 cups (350 to 450 grams) mixed berries", 
            "Glaze", 
            "2 cups (240 grams) powdered or confections’ sugar", 
            "Juice of 1 lemon", 
            "1 tablespoon (15 grams) unsalted butter, very, very soft"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/06/triple-berry-summer-buttermilk-bundt.jpg?w=750", 
        "tags": [
            "Blackberries", 
            "Blueberries", 
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/06/triple-berry-summer-buttermilk-bundt/", 
        "title": "triple berry summer buttermilk bundt", 
        "directions": [
            "Preheat your oven to 350°F. Generously grease a 10-cup Bundt pan, either with butter or a nonstick spray.* Set aside.", 
            "In a medium bowl, whisk or sift 2 1/2 cups flour (leaving 2 tablespoons back), baking powder and salt together and set aside. In the bowl of a stand mixer or large mixing bowl, cream together the butter, sugar and lemon zest until light and impossibly fluffy, about 3 to 5 minutes. Then, with the mixer on a low speed, add your eggs one at a time, scraping down the bowl between each addition. Beat in vanilla, briefly. Add 1/3 flour mixture to batter, beating until just combined, followed by half the buttermilk, another 1/3 of the flour mixture, the remaining buttermilk and remaining flour mixture. Scrape down from time to time and don’t mix any more than you need to. In the bowl where you’d mixed your dry ingredients, toss the berries with the remaining 2 tablespoons of flour. With a silicon spatula, gently fold the berries into the cake batter. The batter will be very thick and this will seem impossible without squishing the berries a little, but just do your best and remember that squished berries do indeed make for a pretty batter.", 
            "Spread cake batter — you might find it easier to plop it in the pan in large spoonfuls, because it’s so thick — in the prepared baking pan and spread the top smooth. Bake for 55 to 60 minutes, rotating the cake 180 degrees after 30 (to make sure it browns evenly). The cake is done as soon as a tester comes out clean of batter. At 10 minutes before my baking time was up, a tester was totally wet with batter and I was certain it would never be done in the estimated time. 7 minutes later, the same tester was clean as a whistle, so fret not.", 
            "Set cake pan on a wire rack to cool for 30 minutes, before inverting the cake onto a serving platter to cool the rest of the way. Cool completely. Once cool, whisk together the powdered sugar, lemon juice and butter until smooth and very, very thick. (If you’d like it thinner, add more juice, but I like the thick drippiness of it, seen above.) Spread carefully over top of cake, letting it trickle down the sides when and where it wishes. Serve at once or keep it covered at room temperature for 3 to 4 days. ", 
            "* Updated note, due to comments about cake sticking: If you have a nonstick Bundt, just a coat of butter or nonstick spray should do. However, if you have a regular Bundt, not nonstick coated, you’re really going to want to make sure every nook and cranny is well-coated with butter or even shortening (the solidity of both helps them stick to the cake walls), and then dust the inside with flour. Setting your cake pan in the fridge or freezer (to set the coating even further) while you make the cake batter will provide even more insurance. I hope this improves the release rate of the cake! "
        ], 
        "date": "2012-06-25T16:02:43+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake ", 
            "1 1/4 cups walnuts (4 1/2 ounces or 130 grams), toasted (in a shallow baking pan at 350°F for 10 minutes) and cooled", 
            "2/3 cup (150 grams) sugar", 
            "1 stick unsalted butter (4 ounces or 113 grams), cut into pieces", 
            "4 large eggs", 
            "1 teaspoon pure vanilla extract", 
            "1/2 cup (2 1/4 ounces or 65 grams) all-purpose flour", 
            "1/2 teaspoon (2 grams) baking powder", 
            "1/2 teaspoon (3 grams) salt", 
            "Topping", 
            "1 teaspoon fresh lemon juice (optional)", 
            "1/2 cup (150 grams) jam or preserves (apricot or raspberry are recommended; I used black currant)", 
            "2/3 cup (160 grams) chilled heavy cream", 
            "1/4 cup (60 grams) sour cream", 
            "1 teaspoon sugar", 
            "1/2 teaspoon pure vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/walnut-jam-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/02/walnut-jam-cake/", 
        "title": "walnut jam cake", 
        "directions": [
            "Preheat oven to 350°F with rack in middle. Butter and flour an 8-inch round cake pan, or hit it up with the butter-and-flour spray of your choice.", 
            "Pulse cooled walnuts and sugar in a food processor until finely chopped. Add butter and process until combined, then add eggs and vanilla and process until combined. Add flour, baking powder, and salt and pulse just until incorporated. Spread batter in cake pan.", 
            "Bake until cake is just firm to the touch and a wooden pick inserted into center comes out clean, 30 to 35 minutes. Cool 15 minutes in pan, then turn out onto a rack and cool completely.", 
            "Whisk lemon juice (if using) into jam. Spoon jam over cake.", 
            "Beat heavy cream with sour cream, sugar, and vanilla until it holds soft peaks, then spoon over jam", 
            "Do ahead: Cake (without topping) keeps, well-wrapped, at room temperature for 4 days. With topping, it has kept so far in the fridge quite nicely for over a day. "
        ], 
        "date": "2010-02-03T12:13:42+00:00"
    }, 
    {
        "ingredient_list": [
            "3 large eggs", 
            "1 cup (235 ml) olive, vegetable oil or melted butter (I use a mix)", 
            "1 1/3 to 1 3/4 cups granulated or turbinado sugar (the latter is the original amount)", 
            "2 teaspoons (10 ml) vanilla extract", 
            "2 teaspoons ground cinnamon", 
            "1/8 teaspoon ground or freshly grated nutmeg", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon baking powder", 
            "1 teaspoon fine sea or table salt", 
            null, 
            "3 cups (390 grams) all-purpose flour", 
            "1/2 cup (55 grams) chopped walnuts or pecans (optional)", 
            "1 to 2 cups dried cranberries, raisins or chocolate chips or a combination thereof (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/zucchini-bread.jpg?w=750", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Summer", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2007/07/zucchini-bread/", 
        "title": "zucchini bread", 
        "directions": [
            "Heat your oven to 350°F. Generously grease and flour or (coat with a nonstick spray) two loaf pans (8×4 or 9×5; this doesn’t fill the pans so smaller is fine). Alternatively, you can grease 24 standard muffin cups or line them with paper liners.", 
            "Whisk eggs, oil or butter, sugar and vanilla in the bottom of a large bowl. Sprinkle cinnamon, nutmeg, baking soda, baking powder and salt over wet ingredients and whisk them in well. Stir in zucchini. Gently stir in flour, mixing only until flour disappears. Stir in any add-ins, from nuts to chocolate.\nDivide between prepared pans and bake for 55 to 65 minutes, until a toothpick inserted into the center comes out clean. [Muffins will bake far more quickly, approximately 20 to 25 minutes.] You can let them cool for 10 minutes on a rack before inverting and removing cakes from pans, or just let them cool completely in pans. Store it wrapped in foil at room temperature for up to 5 days."
        ], 
        "date": "2007-07-26T12:54:30+00:00"
    }
]