{
  "date": "2008-09-30T15:04:48+00:00",
  "directions": [
    "Heat oven to 350°F (175°C). Grease a tube pan. (I use this one or an equivalent one-piece tube.) Peel, core and chop apples into 1-inch chunks.Toss with cinnamon and 5 tablespoons sugar and set aside.",
    "Stir together flour, baking powder and salt in a large mixing bowl. In a separate bowl, whisk together oil, orange juice, sugar, vanilla and eggs. Mix wet ingredients into dry ones; scrape down the bowl to ensure all ingredients are incorporated.",
    "Pour half of batter into prepared pan. Spread half of apples (and their juices) over it. Pour the remaining batter over the apples and arrange the remaining apples on top. Bake for about 1 1/2 hours, or until a tester comes out clean.*",
    "Cool completely before running knife between cake and pan, and unmolding onto a platter.",
    "Do ahead: This cake is awesome on the first day but absolutely glorious and pudding-like on the days that follow, so feel free to get an early start on it. I keep it at room temperature covered with foil. ",
    "* Tip: The apples love to hide uncooked pockets of batter, especially near the top. Make sure your testing skewer or toothpick goes not just all the way down to the bottom, but does a shallow dip below the top layer of apples to make sure it comes out batter-free. Should your cake be browning too fast, before the center is baked through, cover it with foil for all but the last few minutes in the oven."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/moms-apple-cake11.jpg?w=640",
  "ingredient_list": [
    "For the apples",
    "6 apples, Mom uses McIntosh apples, I use a mix of whatever looks good",
    "1 tablespoon ground cinnamon",
    "5 tablespoons (65 grams) granulated sugar",
    "For the cake",
    "2 3/4 cups (360 grams) flour",
    "1 tablespoon baking powder",
    "1 teaspoon fine sea or table salt",
    "1 cup (235 ml) vegetable oil (safflower, sunflower, olive and coconut oil also work, as does melted butter)",
    "2 cups (400 grams) granulated sugar",
    "1/4 cup (60 ml) orange juice",
    "2 1/2 (13 ml) teaspoons vanilla extract",
    "4 large eggs",
    "1 cup (130 grams) walnuts, chopped (optional and to be honest, we never use them)"
  ],
  "tags": [
    "Apple",
    "Cake",
    "Everyday Cakes",
    "Fruit",
    "Photo"
  ],
  "title": "mom’s apple cake",
  "url": "https://smittenkitchen.com/2008/09/moms-apple-cake/"
}