{
  "date": "2008-07-01T23:51:08+00:00",
  "directions": [
    "1. Preheat the oven to 325°F. Butter three 9-inch round cake pans. Line the bottom of each pan with a round of parchment or waxed paper and butter the paper.",
    "2. Combine the cake flour, sugar, baking powder, and salt in a large mixer bowl. With the mixer on low speed, blend for 30 seconds. Add the butter and 1 1/4 cup of the buttermilk. Mix on low speed briefly to blend; then raise the speed to medium and beat until light and fluffy, 2 to 3 minutes. ",
    "3. In a smaller bowl, whisk together the whole eggs, egg yolks, vanilla, and the remaining 1/3 cup buttermilk until well blended. Pour one-third of the egg mixture into the cake batter at a time, folding it in completely after each addition. There will be 9 cups of batter; our 3 cups batter into each pan.",
    "4. Bake for 26 to 28 minutes, or until a cake tester or wooden toothpick inserted in the center comes out clean.",
    "5. Turn the layers out onto wire racks by placing a rack on top of a pan, inverting it, and lifting off the pan.  Peel off the paper liners and let cool completely. When the layers have cooled, place a cardboard cake board on top of  a layer, invert again, and lift off the rack. To make the layers easier to handle, wrap them on their boards completely in plastic, so they don’t dry out, and refrigerate them. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/project-wedding-cake-the-cake-is-baked1.jpg?w=500",
  "ingredient_list": [
    "3 cups cake flour",
    "3 cups sugar",
    "1 1/2 cups unsweetened cocoa powder (not Dutch process)",
    "3 teaspoons baking soda",
    "3/4 teaspoon ground cinnamon",
    "3/4 teaspoon salt",
    "3 sticks (12 ounces) unsalted butter, at room temperature",
    "1 1/2 cups buttermilk",
    "3 eggs",
    "1 1/2 cups freshly brewed coffee, cooled to room temperature",
    "3 3/4 cups cake flour",
    "2 1/2 cups sugar",
    "1 tablespoon plus 2 3/4 teaspoons baking powder",
    "1/2 teaspoon salt",
    "2 1/2 sticks (10 ounces) unsalted butter, at room temperature",
    "1 1/4 cups plus 1/3 cup buttermilk",
    "5 whole eggs",
    "2 egg yolks",
    "2 1/2 teaspoons vanilla extract"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Chocolate",
    "Photo",
    "Wedding Cake"
  ],
  "title": "project wedding cake: the cake is baked",
  "url": "https://smittenkitchen.com/2008/07/project-wedding-cake-the-cake-is-baked/"
}