{
  "date": "2017-05-05T11:56:47+00:00",
  "directions": [
    "Heat oven: To 350°F.",
    "Make topping: In a 10-inch ovenproof skillet, trim your rhubarb to lengths that will fit across the bottom in one direction, i.e. some short and some taller. Remove rhubarb and cut each stalk lengthwise into thin (about 1/4-inch thick) ribbons. If your rhubarb is already quite thin, you might just want to halve each piece lengthwise.\nSprinkle sugar into skillet and add lemon zest; use your fingers to mix the zest into the sugar; the grit of the sugar will help release the most flavor from it. Add butter and salt and heat skillet over medium until butter has melted, stirring frequently. Add rhubarb and cook, turning gently, for 3 to 4 minutes, until it has softened slightly and released some of its liquid. Remove from heat and set skillet aside.\nMake cake: In a large bowl, beat butter and sugars until light and fluffy. Add eggs, one at a time, beating until combined, then vanilla. Sprinkle mixture with baking powder, salt, and all the spices and beat well to thoroughly mix them in. Add buttermilk; mixture will have a curdly texture but don’t worry, it’s all going to even out. Scrape down bowl and add flour; beat only until it disappears.\nCheck your rhubarb base to make sure all the pieces are in the order you’d like them to be; nudge around any that are not, then dollop cake batter over rhubarb mixture in small spoonfuls and smooth top as best as you can. As the rhubarb mixture will be very wet, this will seem almost impossible. I actually gave up and just put it in the oven, where the cake spread into one even layer on its own. (Thank you, cake.)\nBake cake: For about 35 minutes, until a toothpick inserted deep into the cake (but not the topping underneath) comes out batter-free. Transfer to a cooling rack and let cool for 5 minutes, then run a knife around the edges to loosen. Place a larger plate upside down over the skillet and use two potholdered hands to flip cake out onto it. If any rhubarb is stuck in the pan or slides down the side, just return it to the top of the cake cake.\nServe: Warm or at room temperature. Cake keeps for a couple days at room temperature and up to a week in the fridge, or so I hear."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/rhubarb-upside-down-spice-cake.jpg?w=750",
  "ingredient_list": [
    "1 pound (450 grams) rhubarb, trimmed",
    "3/4 cup (150 grams) granulated sugar",
    "Finely grated zest from half a lemon",
    "4 tablespoons (2 ounces or 55 grams) unsalted butter, cold is fine",
    "Two pinches of salt",
    "6 tablespoons (85 grams) unsalted butter, softened",
    "2/3 cup (125 grams) light or dark brown sugar",
    "1/4 cup (50 grams) granulated sugar",
    "2 large eggs",
    "1/2 teaspoon vanilla extract",
    "2 teaspoons baking powder",
    "1/4 teaspoon fine sea salt",
    "1 teaspoon ground cinnamon",
    "1/2 teaspoon ground ginger",
    "1/8 teaspoon ground cloves",
    "A few gratings of fresh nutmeg",
    "1/2 cup (120 ml) buttermilk",
    "1 1/2 cups (195 grams) all-purpose flour"
  ],
  "tags": [
    "Cake",
    "Everyday Cakes",
    "Photo",
    "Rhubarb",
    "Spring"
  ],
  "title": "rhubarb upside-down spice cake",
  "url": "https://smittenkitchen.com/2017/05/rhubarb-upside-down-spice-cake/"
}