{
  "date": "2010-02-03T12:13:42+00:00",
  "directions": [
    "Preheat oven to 350°F with rack in middle. Butter and flour an 8-inch round cake pan, or hit it up with the butter-and-flour spray of your choice.",
    "Pulse cooled walnuts and sugar in a food processor until finely chopped. Add butter and process until combined, then add eggs and vanilla and process until combined. Add flour, baking powder, and salt and pulse just until incorporated. Spread batter in cake pan.",
    "Bake until cake is just firm to the touch and a wooden pick inserted into center comes out clean, 30 to 35 minutes. Cool 15 minutes in pan, then turn out onto a rack and cool completely.",
    "Whisk lemon juice (if using) into jam. Spoon jam over cake.",
    "Beat heavy cream with sour cream, sugar, and vanilla until it holds soft peaks, then spoon over jam",
    "Do ahead: Cake (without topping) keeps, well-wrapped, at room temperature for 4 days. With topping, it has kept so far in the fridge quite nicely for over a day. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/walnut-jam-cake1.jpg?w=500",
  "ingredient_list": [
    "Cake ",
    "1 1/4 cups walnuts (4 1/2 ounces or 130 grams), toasted (in a shallow baking pan at 350°F for 10 minutes) and cooled",
    "2/3 cup (150 grams) sugar",
    "1 stick unsalted butter (4 ounces or 113 grams), cut into pieces",
    "4 large eggs",
    "1 teaspoon pure vanilla extract",
    "1/2 cup (2 1/4 ounces or 65 grams) all-purpose flour",
    "1/2 teaspoon (2 grams) baking powder",
    "1/2 teaspoon (3 grams) salt",
    "Topping",
    "1 teaspoon fresh lemon juice (optional)",
    "1/2 cup (150 grams) jam or preserves (apricot or raspberry are recommended; I used black currant)",
    "2/3 cup (160 grams) chilled heavy cream",
    "1/4 cup (60 grams) sour cream",
    "1 teaspoon sugar",
    "1/2 teaspoon pure vanilla extract"
  ],
  "tags": [
    "Cake",
    "Everyday Cakes",
    "Photo"
  ],
  "title": "walnut jam cake",
  "url": "https://smittenkitchen.com/2010/02/walnut-jam-cake/"
}