{
  "date": "2009-01-13T16:40:50+00:00",
  "directions": [
    "Optional: Powdered sugar for dusting, or for making a glaze",
    "Put the clementines in a pot with cold water to cover, bring to the boil, and cook for 2 hours. Drain and, when cool, cut each clementine in half and remove the seeds. Then finely chop the skins, pith, and fruit in the processor (or by hand, of course).",
    "Preheat the oven to 375°F (190°C).",
    "Butter and line an 8-inch (21 centimeter) springform pan with parchment paper. (I used a 9-inch, it worked fine.)",
    "Beat the eggs. Add the sugar, almonds, and baking powder. Mix well, adding the chopped clementines.",
    "Pour the cake mixture into the prepared pan and bake for 30 to 50 minutes*, when a skewer will come out clean; you might have to cover the cake with foil after about 20 to 30 minutes to stop the top from over-browning.",
    "Remove from the oven and leave to cool, in the pan on a rack. When the cake is cold, you can take it out of the pan and dust it with powdered sugar. I made a glaze of powdered sugar and a tablespoon of clementine juice because I was convinced the cake would be too bitter. It was not necessary. Nigella says the cake is best on the second day, but ours never made it that long.",
    "Variations: Nigella says she’s also made this with an equal weight of oranges and lemons, in which case the sugar is increased to 1 1/4 cups.",
    "* I am very unclear on the correct baking time, as you can see. Nigella’s recipe says it will 60 minutes. When I checked on it at 40 minutes (because I think you should start checking on any baked good at the 2/3 mark) it was done. Very done. Dark-brown edge-level done. And my oven runs cool. But I had made the cake in a one-inch larger pan, which made it slightly thinner. Which is all to say: Start checking at 30 minutes. Better to check too often than char your cake."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/clementine-cake1.jpg?w=500",
  "ingredient_list": [
    "4 to 5 clementines (about 375grams/slightly less than 1 pound total weight)",
    "6 eggs",
    "1 cup plus 2 tablespoons (225 grams) sugar",
    "2 1/3 cups (250 grams) ground almonds",
    "1 heaping teaspoon baking powder"
  ],
  "tags": [
    "Cake",
    "Gluten-Free",
    "Photo",
    "Winter"
  ],
  "title": "clementine cake",
  "url": "https://smittenkitchen.com/2009/01/clementine-cake/"
}