{
  "date": "2013-10-07T12:03:49+00:00",
  "directions": [
    "Heat oven to 400 degrees. Place rice or grain and cooking liquid in a rice cooker or on the stove. Cook according to package directions.",
    "Peel sweet potatoes and cut into 1-inch cubes. Cut tops off broccoli and separate into bite-sized florets. If your broccoli stems feel especially woody, I like to peel them (with the same vegetable peeler), then cut them into 1/2- to 1-inch segments. ",
    "Coat one large or two smaller trays with a thin slick of olive oil. Layer sweet potatoes on tray(s) and sprinkle with salt and pepper. Roast for 20 minutes, until browning underneath. Flip and toss chunks around, then add broccoli to the tray(s), season again with salt and pepper, and roast for another 10 to 20 minutes, until broccoli is lightly charred at edges and sweet potato is fully bronzed and tender. Toss chunks around one more time if it looks like they’re cooking unevenly.",
    "In a small skillet, toast black and white sesame seeds until fragrant. (You can do this in the oven if using an oven-proof skillet.) Let cool.",
    "While vegetables roast, prepare sesame-miso dressing: Combine everything in a blender and run until smooth, scraping down sides once. Taste and adjust ingredients if needed, but try to resist adding more honey if it tastes salty, as that extra pop of saltiness is exactly what I think sweet potato needs.",
    "Assemble bowls: Scoop some rice/grains into each, then pile on the roasted sweet potatoes and broccoli. Coat lightly with sesame-miso dressing and finish with toasted sesame seed duo. Serve with extra dressing on the side."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/10/10129849956_5b4c826237_o.jpg?w=750",
  "ingredient_list": [
    "For the bowl",
    "1 cup dried rice or another cooking grain of your choice",
    "1 to 2 sweet potatoes (about 1.5 pounds)",
    "1 large bundle broccoli (about 1 pound)",
    "1 to 2 tablespoons olive oil",
    "Coarse or kosher salt",
    "Freshly ground black pepper",
    "1 teaspoon white sesame seeds",
    "1 teaspoon black sesame seeds",
    "For the miso-sesame dressing",
    "1 tablespoon minced fresh ginger",
    "1 small garlic clove, minced",
    "2 tablespoons white miso (the mildest kind)",
    "2 tablespoons tahini (other nut butters can work in a pinch)",
    "1 tablespoon honey",
    "1/4 cup rice vinegar",
    "2 tablespoons toasted sesame oil",
    "2 tablespoons olive oil"
  ],
  "tags": [
    "Broccoli",
    "Budget",
    "Fall",
    "Grain/Rice",
    "Lunch",
    "Photo",
    "Potatoes",
    "Vegan",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "miso sweet potato and broccoli bowl",
  "url": "https://smittenkitchen.com/2013/10/miso-sweet-potato-and-broccoli-bowl/"
}