{
  "date": "2012-10-16T11:18:35+00:00",
  "directions": [
    "Make lids: In a large, wide bowl (preferably one that you can get your hands into), combine the fl our and salt. Add the butter and, using a pastry blender or your fingertips, cut them up and into the flour mixture until it resembles little pebbles. Keep breaking up the bits of butter until the texture is like uncooked couscous. In a small dish, whisk together the sour cream, vinegar, and water, and combine it with the butter-flour mixture. Using a flexible spatula, stir the wet and the dry together until a craggy dough forms. If needed, get your hands into the bowl to knead it a few times into one big ball. Pat it into a flattish ball, wrap it in plastic wrap, and chill it in the fridge for 1 hour or up to 2 days.",
    "Make filling: Heat 1 tablespoon olive oil over medium- high heat in a large, wide saucepan, and then add the pancetta. Brown the pancetta, turning it frequently, so that it colors and crisps on all sides; this takes about 10 minutes. Remove it with a slotted spoon, and drain it on paper towels before transferring to a medium bowl. Leave the heat on and the renderings in the pan. Add an additional tablespoon of olive oil if needed and heat it until it is shimmering. Add onions, carrot, celery, red pepper flakes, and a few pinches of salt, and cook over medium heat until the vegetables are softened and begin to take on color, about 7 to 8 minutes. Add the garlic, and cook for 1 minute more. Add the greens and cook until wilted, about 2 to 3 minutes. Season with the additional salt and freshly ground black pepper to taste. Transfer all of the cooked vegetables to the bowl with the pancetta, and set aside.",
    "Make sauce: Wipe out the large saucepan; don’t worry if any bits remain stuck to the bottom. Then melt the butter in the saucepan over medium- low heat. Add the flour, and stir with a whisk until combined. Continue cooking for 2 minutes, stirring the whole time, until it begins to take on a little color. Whisk in the broth, one ladleful at a time, mixing completely between additions. Once you’ve added one- third of the broth, you can begin to add the rest more quickly, two to three ladlefuls at a time; at this point you can scrape up any bits that were stuck to the bottom — they’ll add great flavor.",
    "Once all of the broth is added, stirring the whole time, bring the mixture to a boil and reduce it to a simmer. Cook the sauce until it is thickened and gravylike, about 10 minutes. Season with salt and pepper. Stir the white beans and reserved vegetables into the sauce. ",
    "Preheat your oven to 375 degrees.",
    "Assemble and cook pot pies: Divide the filling between four ovenproof 2-cup bowls. (You’ll have about 1 1/2 cups filling in each.) Set the bowls on a baking pan. Divide the dough into four pieces, and roll it out into rounds that will cover your bowls with an overhang, or about 1 inch wider in diameter than your bowls. Whisk the egg wash and brush it lightly around the top rim of your bowls (to keep the lid glued on; nobody likes losing their lid!) and drape the pastry over each, pressing gently to adhere it. Brush the lids with egg wash, then cut decorative vents (smaller than mine, please, as they led to lots of draping) in each to help steam escape. Bake until crust is lightly bronzed and filling is bubbling, about 30 to 35 minutes.",
    "Do ahead: The dough, wrapped twice in plastic wrap and slipped into a freezer bag, will keep for up to 2 days in the fridge, and for a couple months in the freezer. The filling can be made up to a day in advance and stored in a covered container in the fridge."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/10/pancetta-swiss-chard-and-white-bean-pot-pies.jpg?w=750",
  "ingredient_list": [
    "Lid",
    "2 cups (250 grams) all- purpose flour",
    "1/2 teaspoon table salt",
    "13 tablespoons (185 grams or 1 stick plus 5 tablespoons) cold unsalted butter, diced",
    "6 tablespoons (90 grams) sour cream or whole Greek yogurt (i.e., a strained",
    "yogurt)",
    "1 tablespoon (15 ml) white wine vinegar",
    "1/4 cup (60 ml) ice water",
    "1 egg, beaten with 1 tablespoon water, for egg wash",
    "Filling",
    "2 tablespoons (30 ml) olive oil",
    "4 ounces (115 grams or 3/4 to 1 cup) 1/4-inch-diced pancetta",
    "1 large or 2 small onions, finely chopped",
    "1 large carrot, finely chopped",
    "1 large stalk celery, finely chopped",
    "Pinch of red pepper flakes",
    "Salt and freshly ground black pepper",
    "2 garlic cloves, minced",
    "Thinly sliced Swiss chard leaves from an 8- to 10-ounce (225- to 285-gram)",
    "bundle (4 cups); if leaves are very wide, you can halve them lengthwise",
    "3 1/2 tablespoons (50 grams) butter",
    "3 1/2 tablespoons (25 grams) all- purpose flour",
    "3 1/2 cups (765 ml) sodium- free or low- sodium chicken or vegetable broth",
    "2 cups white beans, cooked and drained, or from one and a third 15.5- ounce",
    "(440-gram) cans"
  ],
  "tags": [
    "Beans",
    "Cookbooks",
    "Fall",
    "Photo",
    "Swiss Chard",
    "Thanksgiving",
    "Winter"
  ],
  "title": "pancetta, white bean and chard pot pies",
  "url": "https://smittenkitchen.com/2012/10/pancetta-white-bean-and-swiss-chard-pot-pies/"
}