[
    {
        "ingredient_list": [
            "4 ounces unsweetened chocolate (Baker’s chocolate, optional of course)", 
            "3/4 cup (1 1/2 sticks) butter", 
            "1 3/4 cups sugar", 
            "3 eggs", 
            "1 teaspoon vanilla", 
            "1/2 teaspoon salt", 
            "1 cup flour", 
            "1 1/2 cups or 5 ounces (3 cups or 10 ounces to double) finely ground cookies such as chocolate wafers. Or Chocolate Teddy Grahams.", 
            "5 tablespoons (10 tablespoons to double) unsalted butter, melted", 
            "1/3 cup (2/3 cup to double) sugar", 
            "1/8 (1/4 teaspoon to double) teaspoon salt", 
            "3 (8 ounce) packages cream cheese, softened", 
            "4 large eggs", 
            "1 teaspoon vanilla", 
            "1 cup sugar", 
            "2 cups brownie cubes (from recipe above)", 
            "3 ounces bittersweet chocolate, broken up, or 1/2 cup chocolate morsels", 
            "2 ounces butter", 
            "1/4 cup heavy cream", 
            "1/2 teaspoon vanilla extract", 
            "1 tablespoon confectioners sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/alexs-choice1.jpg?w=500", 
        "tags": [
            "Brownies/Blondies", 
            "Cake", 
            "Celebration Cakes", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/08/alexs-choice/", 
        "title": "brownie mosaic cheesecake", 
        "directions": [
            "Grind the chocolate into powder in the food processor, scald the butter and cream in a saucepan (or in a Pyrex cup in the microwave). With the machine running, pour the hot cream/butter mixture slowly through the feed tube onto the chocolate. Blend until completely smooth, stopping machine to scrape down sides once or twice. Add the extract and sugar and process until smooth. Spread over cheesecake while ganache is still warm. Chill until ready to serve."
        ], 
        "date": "2007-08-12T14:37:45+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "3/4 cup (75 grams or 2 1/2 to 2 3/4 ounces) sliced almonds, ideally toasted and cooled", 
            "1 tablespoon (10 grams) all purpose flour", 
            "A few pinches of sea salt", 
            "6 tablespoons (75 grams) plus 1 teaspoon (5 grams) granulated sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/2 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1/2 pound rhubarb", 
            "To finish", 
            "Powdered sugar or 1/4 cup jam of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/almond-rhubarb-picnic-bars-e14640188536441.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2016/05/almond-rhubarb-picnic-bars/", 
        "title": "almond rhubarb picnic bars", 
        "directions": [
            "Heat oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] ", 
            "Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind almonds, 6 tablespoons sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. ", 
            "Arrange the fruit: Trim rhubarb and cut it half horizontally top to bottom, i.e. like splitting a hamburger bun, with the flatter part on the bottom. [Update: Does this diagram help?] Keep tops and bottoms matched/stacked and cut stalks on the diagonal into about 1 1/4-inch lengths. The top and bottom of each segment should nicely “V” together, color side up, in a chevron pattern. If you mostly reach for the more green segments first and the pink-er segments second, you’ll end up with an ombré look on top. Sprinkle fruit with 1 teaspoon granulated sugar.", 
            "Bake the bars: For 45 to 55 minutes, until they’re golden on top and a toothpick inserted into the almond cream underneath comes out cream-free. The rhubarb pieces are going to move around a little as it bakes so don’t be surprised if the pattern looks a little different when it’s done. ", 
            "Let cool in pan on a rack, or in the fridge, or even in the freezer. You can decorate the bars with a little powdered sugar, or warm some jam and brush it over for a glossier finish. I find it easiest to get very clean cuts when the bars are very cold. A serrated knife, used gently, can ensure the rhubarb stays perfectly put if it’s not cold enough. While bars do not need to be refrigerated if it will just be a day or so, they keep longer and (I think) more nicely chilled."
        ], 
        "date": "2016-05-23T11:56:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (4 ounces) pecans or walnuts, chopped medium (optional)", 
            "1 1/4 cups (5 ounces) cake flour", 
            "1/2 teaspoon salt", 
            "3/4 teaspoon baking powder", 
            "6 ounces unsweetened chocolate, chopped fine", 
            "12 tablespoons (1 1/2 sticks) unsalted butter, cut into six 1-inch pieces", 
            "2 1/4 cups (15 3/4 ounces) sugar", 
            "4 large eggs", 
            "1 tablespoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/and-then-i-went-shoe-shopping1.jpg?w=500", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/10/and-then-i-went-shoe-shopping/", 
        "title": "classic brownies", 
        "directions": [], 
        "date": "2006-10-13T11:26:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup apple cider", 
            "3 1/2 cups flour, plus additional for the work surface", 
            "2 teaspoons baking powder", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon ground cinnamon", 
            "1/2 teaspoon salt", 
            "1/8 teaspoon ground nutmeg", 
            "4 tablespoons (1/2 stick or 2 ounces) butter, at room temperature", 
            "1 cup granulated sugar", 
            "2 large eggs", 
            "1/2 cup buttermilk", 
            "Vegetable oil or shortening (see my explanation in the post) for frying", 
            "Toppings (optional)", 
            "Glaze (1 cup confectioners’ sugar + 2 tablespoons apple cider)", 
            "Cinnamon sugar (1 cup granulated sugar + 1 1/2 tablespoons cinnamon)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/4014418929_1dd1c25ec9_o.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Cake", 
            "Doughnut", 
            "Fall", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/10/apple-cider-doughnuts/", 
        "title": "apple cider doughnuts", 
        "directions": [
            "Make the doughnuts: In a saucepan over medium or medium-low heat, gently reduce the apple cider to about 1/4 cup, 20 to 30 minutes. Set aside to cool.", 
            "Meanwhile, in a bowl, combine the flour, baking powder and soda, cinnamon, salt and nutmeg. Set aside.", 
            "Using an electric mixer on medium speed (with the paddle attachment, if using a standing mixer) beat the butter and granulated sugar until the mixture is smooth. Add the eggs, one at a time, and continue to beat until the eggs are completely incorporated. Use a spatula to scrape down the sides of the bowl occasionally. Reduce the speed to low and gradually add the reduced apple cider and the buttermilk, mixing just until combined. Add the flour mixture and continue to mix just until the dough comes together.", 
            "Line two baking sheets with parchment or wax paper and sprinkle them generously with flour. Turn the dough onto one of the sheets and sprinkle the top with flour. Flatten the dough with your hands until it is about 1/2 inch thick. Use more flour if the dough is still wet. Transfer the dough to the freezer until it is slightly hardened, about 20 minutes. Pull the dough out of the freezer. Using a 3-inch or 3 1/2-inch doughnut cutter — or a 3 1/2-inch round cutter for the outer shape and a 1-inch round cutter for the hole from a set like this, as I did — cut out doughnut shapes. Place the cut doughnuts and doughnut holes onto the second sheet pan. Refrigerate the doughnuts for 20 to 30 minutes. (You may re-roll the scraps of dough, refrigerate them briefly and cut additional doughnuts from the dough.)", 
            "Add enough oil or shortening to a deep-sided pan to measure a depth of about 3 inches. Attach a candy thermometer to the side of the pan and heat over medium heat until the oil reaches 350°F*. Have ready a plate lined with several thicknesses of paper towels.", 
            "Make your toppings (if using): While the cut doughnut shapes are in the refrigerator, make the glaze by whisking together the confectioners’ sugar and the cider until the mixture is smooth; make the cinnamon sugar by mixing the two together. Set aside.", 
            "Fry and top the doughnuts: Carefully add a few doughnuts to the oil, being careful not to crowd the pan, and fry until golden brown, about 60 seconds. Turn the doughnuts over and fry until the other side is golden, 30 to 60 seconds. Drain on paper towels for a minute after the doughnuts are fried. Dip the top of the warm doughnuts into the glaze or cinnamon sugar mixture (if using) and serve immediately.", 
            "* Tip: Here’s an easy way to find out if your thermometer’s readings are accurate."
        ], 
        "date": "2009-10-19T10:35:29+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine ", 
            "Filling", 
            "3/4 cup (a scant 4 ounces or 110 grams) shelled unsalted pistachios", 
            "1 tablespoon (10 grams) all purpose flour", 
            "Few pinches of sea salt", 
            "6 tablespoons (75 grams) sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/4 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1 pound firm-ripe apricots", 
            "To finish", 
            "Powdered sugar or 1/4 cup apricot jam"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/apricot-pistachio-squares1.jpg?w=640", 
        "tags": [
            "Apricots", 
            "Bars", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/08/apricot-pistachio-squares/", 
        "title": "apricot pistachio squares", 
        "directions": [
            "Heat your oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (If you have an 8-inch square springform, you can skip this and just butter it well.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. Transfer the dough clumps to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "(Don’t have a food processor? You might have an easier time using softened butter and preparing this cookie-style: cream it with the sugar with a hand mixer, then spoon in the salt and flour, beating until just combined. It might help to chill this mixture a bit before pressing it into the pan, or it might feel too greasy to easily spread.)", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind your pistachios, sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. ", 
            "Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. Cut apricots in half (or, you might find that you can tear them open at the seams with your fingers) and remove pits. From here, you have a few decoration options: you can place the apricot halves in facedown or up all over the pistachio base. You can do as I did, which is cut them into strips, then slide each cut half onto a butter knife or offset spatula, tilt it so that it fans a little, and slide it onto your pistachio filling decoratively. (With this method, I ended up not using all of my apricots.) You could also arrange the strips like petals of flower around the pan, for maximum pretties.]]", 
            "Bake the bars for 60 minutes, or until they are golden and a toothpick inserted into the pistachio portion comes out batter-free. This might take up to 10 minutes longer depending on the juiciness of your apricots and the amount you were able to nestle in. Let cool completely in pan; you can hasten this along in the fridge. ", 
            "To finish, you can make a shiny glaze for your tart by warming the jam in a small saucepan until it thins, and brushing this mixture over the top of the cooled tart. Or, you can keep it rustic with just a dusting of powdered sugar, as I did. ", 
            "Cut bars into squares — chilled bars will give you the cleanest cuts. Keep leftover bars chilled. "
        ], 
        "date": "2014-08-07T12:18:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (4 sticks) unsalted butter, slightly softened", 
            "4 egg yolks", 
            "2 cups granulated sugar", 
            "4 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/4 teaspoon salt", 
            "Optional additions: 1 teaspoon vanilla extract or 1 teaspoon lemon zest", 
            "1 cup raspberry jam, at room temperature", 
            "1/4 cup confectioners’ sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/12/austrian-raspberry-shortbread.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/austrian-raspberry-shortbread/", 
        "title": "austrian raspberry shortbread", 
        "directions": [
            "Cream the butter in a mixer fitted with a paddle attachment (or using a hand mixer) until soft and fluffy. Add the egg yolks and mix well.", 
            "Mix the granulated sugar, flour, baking powder, and salt together. Add to the butter and egg yolk mixture and mix just until incorporated and the dough starts to come together. Turn the dough out onto a floured work surface and form into two balls. Wrap each ball in plastic wrap and freeze at least 2 hours or overnight (or as long as a month, if you like).", 
            "Heat the oven to 350 degrees.", 
            "Remove one ball of dough from the freezer and coarsely grate it by hand or with the grating disk in a food processor into the bottom of a 9×13-inch baking pan or a 10-inch tart pan with a removable bottom (oops, sorry, no). Make sure the surface is covered evenly with shreds of dough.", 
            "With a piping bag with a wide tip or a zip-lock bag with the corner cut off, squeeze the jam over the surface as evenly as possible, to within 1/2 inch of the edge all the way around. Remove the remaining dough from the freezer and coarsely grate it over the entire surface.", 
            "Bake until lightly golden brown and the center no longer wiggles, 50 to 60 minutes. As soon as the shortbread comes out of the oven, dust with confectioners’ sugar. ", 
            "Cool on a wire rack, then cut in the pan with a serrated knife. I find that for this an all bar cookies, chilling the pan in the fridge makes it a lot easier to get clean cuts. "
        ], 
        "date": "2007-12-19T09:00:32+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust: ", 
            "1 1/4 pounds unsalted butter, room temperature", 
            "3/4 cup granulated sugar", 
            "3 extra-large eggs", 
            "3/4 teaspoon pure vanilla extract", 
            "4 1/2 cups all-purpose flour", 
            "1/2 teaspoon baking powder", 
            "1/4 teaspoon salt ", 
            "Topping: ", 
            "1 pound unsalted butter", 
            "1 cup good honey", 
            "3 cups light brown sugar, packed", 
            "1 teaspoon grated lemon zest", 
            "1 teaspoon grated orange zest", 
            "1/4 cup heavy cream", 
            "2 pounds pecans, coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/aww-yeah-1017-grams-of-butter1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/12/aww-yeah-1017-grams-of-butter/", 
        "title": "pecan squares", 
        "directions": [
            "Preheat the oven to 350°F. ", 
            "For the crust: Beat the butter and granulated sugar in the bowl of an electric mixer fitted with a paddle attachment, until light, approximately 3 minutes. Add the eggs and the vanilla and mix well. Sift together the flour, baking powder, and salt. Mix the dry ingredients into the batter with the mixer on low speed until just combined. Press the dough evenly into an ungreased 18 by 12 by 1-inch baking sheet, making an edge around the outside. It will be very sticky; sprinkle the dough and your hands lightly with flour. Bake for 15 minutes, until the crust is set but not browned. Allow to cool. ", 
            "For the topping: Combine the butter, honey, brown sugar, and zests in a large, heavy-bottomed saucepan. Cook over low heat until the butter is melted, using a wooden spoon to stir. Raise the heat and boil for 3 minutes. Remove from the heat. Stir in the heavy cream and pecans. Pour over the crust, trying not to get the filling between the crust and the pan. Bake for 25 to 30 minutes, until the filling is set. Remove from the oven and allow to cool. Wrap in plastic wrap and refrigerate until cold. Cut into bars and serve."
        ], 
        "date": "2006-12-08T14:07:31+00:00"
    }, 
    {
        "ingredient_list": [
            "7 ounces (200 grams) bittersweet chocolate (70 or 72%), roughly chopped", 
            "7 ounces (200 grams or 14 tablespoons) unsalted butter, cut into chunks", 
            "1 cup (200 grams) granulated sugar", 
            "1/4 teaspoon fine sea salt", 
            "4 large eggs", 
            "2 tablespoons plus 1 teaspoon (20 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/belgian-brownie-cakelets1.jpg?w=640", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/02/belgian-brownie-cakelets/", 
        "title": "belgian brownie cakelets", 
        "directions": [
            "Place chocolate and butter in a large heatproof bowl. Either over a saucepan of simmering water or in the microwave in 15- to 30-second bursts, stirring frequently, melt the two together. Off the heat, whisk in sugar, which should cool the mixture down significantly. Whisk in salt, then eggs, one at a time. Stir in flour. ", 
            "Cover bowl with plastic wrap and let sit at room temperature for 30 minutes. The batter will thicken a bit as it stands.", 
            "Heat oven to 325°F (165°C). ", 
            "Either coat a 12-cup muffin tin with nonstick spray or line it with cupcake papers. Spoon batter halfway into each cup and bake for 25 to 30 minutes (20 minutes in the mini-tart pans I show), or until a toothpick inserted into the center of cakelets comes out batter-free. (Fudgy crumbs are to be expected.) ", 
            "Let cool on a rack for 5 to 10 minutes before unmolding. Puffed tops will fall a little as they cool."
        ], 
        "date": "2016-02-11T11:59:48+00:00"
    }, 
    {
        "ingredient_list": [
            "10 tablespoons (140 grams) unsalted butter", 
            "1 1/4 cups (250 grams) granulated sugar", 
            "3/4 cup plus 2 tablespoons (65 grams, may vary by brands) unsweetened cocoa powder (natural or Dutch-process)", 
            "1/4 teaspoon salt (or a heaping 1/4 teaspoon flaky salt, as I used)", 
            "1/2 teaspoon pure vanilla extract", 
            "2 large eggs, cold", 
            "1/2 cup (65 grams) all-purpose flour", 
            "2/3 cup (75 grams) walnut or pecan pieces (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/best-cocoa-brownies.jpg?w=751", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/01/best-cocoa-brownies/", 
        "title": "best cocoa brownies", 
        "directions": [
            "Position a rack in the lower third of the oven and preheat the oven to 325°F. Line the bottom and sides of an 8×8-inch square baking pan with parchment paper or foil, leaving an overhang on two opposite sides.\nCombine the butter, sugar, cocoa, and salt in a medium heatproof bowl and (Medrich’s method) set the bowl in a wide skillet of barely simmering water. Stir from time to time until the butter is melted and the mixture is smooth and hot enough that you want to remove your finger fairly quickly after dipping it in to test. Or (Deb’s method) you can melt the butter with the cocoa in a microwave too.", 
            "Both methods: Set the bowl aside briefly until the mixture is only warm, not hot. It looks fairly gritty at this point, but don’t fret — it smooths out once the eggs and flour are added.", 
            "Stir in the vanilla with a wooden spoon. Add the eggs one at a time, stirring vigorously after each one. When the batter looks thick, shiny, and well blended, add the flour and stir until you cannot see it any longer, then beat vigorously for 40 strokes with the wooden spoon or a rubber spatula. Stir in the nuts, if using. Spread evenly in the lined pan.\nBake until a toothpick plunged into the center emerges slightly moist with batter, 20 to 25 minutes is Medrich’s suggestion but it took me at least 10 minutes longer to get them set. Let cool completely on a rack. (I go further and throw mine in the fridge or freezer for a while; it’s the only way I can get them to cut with clean lines.)\nLift up the ends of the parchment or foil liner, and transfer the brownies to a cutting board. Cut into 16 or 25 squares.\n"
        ], 
        "date": "2010-01-30T10:12:13+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick, 4 ounces or 113 grams) butter, melted", 
            "1 cup (218 grams or 7 3/4 ounces for light; 238 grams or 8 3/8 ounces for dark) brown sugar", 
            "1 large egg", 
            "1 teaspoon vanilla or 1/2 teaspoon almond extract", 
            "Pinch salt", 
            "1 cup (4 3/8 ounces or 125 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/blondies.jpg?w=749", 
        "tags": [
            "Bourbon", 
            "Brown Butter", 
            "Brownies/Blondies", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/blondies/", 
        "title": "blondies, infinitely adaptable", 
        "directions": [
            "Further additions, use one or a combination of: ", 
            "New favorite combination of late (added 5/24/14): We’ve gotten on a kick making these again, but I’ve really wanted to increase the toasty butterscotch flavor and have done so by: browning the butter, using dark brown sugar but only 3/4 cup (I prefer these less sweet these days), increasing the vanilla to 1 1/2 teaspoons and the salt to 1/4 teaspoon fleur de sel or flaky sea salt, plus a few flakes crumbled on top. I use 1 cup chopped bittersweet chocolate and 1/2 cup chopped walnuts or pecans as the mix-ins. Hope this provides some inspiration!"
        ], 
        "date": "2006-11-25T19:37:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (200 grams) granulated sugar", 
            "1 teaspoon baking powder", 
            "3 cups (390 grams) all-purpose flour", 
            "1/4 teaspoon salt", 
            "Zest of one lemon", 
            "1 cup (8 ounces or 225 grams) cold unsalted butter, cut into chunks", 
            "1 large egg", 
            "Juice of 1 lemon", 
            "1/2 cup (100 grams) granulated sugar", 
            "4 teaspoons cornstarch", 
            "4 cups fresh blueberries"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2710636010_a64fe15ab8_o.jpg?w=750", 
        "tags": [
            "Bars", 
            "Blueberries", 
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/07/blueberry-crumb-bars/", 
        "title": "blueberry crumb bars", 
        "directions": [
            "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9×13 inch pan.\nIn a medium bowl, stir together 1 cup sugar, 3 cups flour, baking powder, salt, and lemon zest. Use a fork or pastry cutter to blend in the butter and egg. Dough will be crumbly. Pat half of dough into the prepared pan.\nIn another bowl, stir together the sugar, cornstarch and lemon juice. Gently mix in the blueberries. Sprinkle the blueberry mixture evenly over the crust. Crumble remaining dough over the berry layer.\nBake in preheated oven for 45 minutes, or until top is slightly brown. (This took an extra 10 to 15 minutes in my oven.) Cool completely before cutting into squares.\n"
        ], 
        "date": "2008-07-29T15:25:26+00:00"
    }, 
    {
        "ingredient_list": [
            "", 
            "\t\t", 
            "\t", 
            "\t\tWithin reason, I think if you’re craving something, you should go for it, although this theory is mostly born of my own poor logic. I’ve all too many times craved, say, a brownie but thought I shouldn’t eat a brownie and so instead snacked on (just for a completely random example) 12 almonds, 1 slice of cheese, half an apple, 1 banana and then, oops, a handful of chocolate chips, amounting roughly 3x the calories of a brownie, a brownie that I craved exactly as much as I did 500 calories ago. And so, when I really want a brownie, I make my favorite brownies and we each eat one and then I stash the rest in the freezer, so they are not out on the counter, calling to me that we haven’t been cut in a straight line and you should really even us out or we’re going to go bad soon and you don’t want us to go to waste or any of those things that brownies tell me when we’re alone together.", 
            "", 
            "", 
            "[Hm, here I should probably interject some sort of “sure, okay, brownies talk to me but I’m not like crazy or anything; it’s not weird. Brownies talk to everyone, right? Haha?” reassurance but I’m not going to. I’m going to make this as awkward as possible.]", 
            "", 
            "", 
            "", 
            "", 
            "Unfortunately, or maybe predictably, the only thing years of stashing brownies in the freezer has taught us is that frozen brownies are very, very good. They’re chewy but not hard, fudgy and intense and I know this sounds like madness but I’d take a cold brownie over a freshly baked, warm, squishy, steamy one any day. ", 
            "", 
            "", 
            "", 
            "", 
            "", 
            "Thus, this was inevitable. If brownies are good frozen, they’re even better enlisted as the header and footer of an ice cream cloud. This might actually be both the easiest and winning-est summer dessert. The one-bowl brownies bake in 15 minutes, head directly to the freezer until cold (another 15 minutes), after which they are filled with ice cream (or ice cream combination; I went for Neapolitan because: summer), lidded, and cut into squares. You will be a hero among your people. Most importantly, the ice cream sandwiches are stored in the freezer, away from temptation, and nothing bad ever comes of that.", 
            "", 
            "Ice Cream, Previously: The insane Hot Fudge Sundae Cake I made last summer, Classic Ice Cream Sandwiches, Peppermint Hot Fudge Sauce, Ridiculously Easy Butterscotch Sauce and A Deep Dark Salted Butter Caramel Sauce", 
            "One year ago: Grilled Bacon Salad with Arugula and Balsamic", 
            "Two years ago: Bacon Corn Hash", 
            "Three years ago: Whole Wheat Raspberry Ricotta Scones", 
            "Four years ago: Light Brioche Burger Buns and Blueberry Boy Bait", 
            "Five years ago: Mango Slaw with Cashews and Mint", 
            "Six years ago: Chocolate Sorbet", 
            "Seven years ago: Quick Potato Pierogi ", 
            "\t", 
            "", 
            "\t", 
            "  ", 
            "Brownie Ice Cream Sandwiches", 
            "This uses the recipe for My Favorite Brownies, but I drop the sugar by 1/3 cup for more of a bittersweet contrast with the sweet ice cream; you won’t miss it at all. The batter is divided into two 8×8 pans (although you can use a single 9×13 for a teensy bit thicker brownie that you can later cut in half to form a top and bottom layer) and bakes in half the time. You can tweak the brownie flavor by adding ground cinnamon, mint extract or some espresso powder. I used a little shy of 3 cups ice cream for this (1 1/2 pints, although I took a 1/2 pint from three flavors, chocolate, vanilla and strawberry, to be difficult) though I think they’d be just fine with only 2 cups ice cream filling, and easier to bite into. For extra fanciness, you can swirl in some homemade hot fudge (with or without the mint), butterscotch, or salted caramel sauce, or you can roll the sides of the ice cream sandwiches in colored sprinkles, toasted and chopped nuts or cookie crumbs. ", 
            "For the brownies", 
            "3 ounces (85 grams) unsweetened chocolate, roughly chopped", 
            "1 stick (4 ounces or 115 grams) unsalted butter, plus extra for pan", 
            "1 cup (200 grams) granulated sugar", 
            "2 large eggs", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1/2 teaspoon flaky sea salt or 1/4 teaspoon table salt (about 2 grams)", 
            "2/3 cup (85 grams) all-purpose flour", 
            "For the filling", 
            "2 to 3 cups ice cream (see Note up top)", 
            "Heat oven to 350°F. Line two 8×8-inch square baking pans with parchment paper, extending it up two sides. Butter the parchment and exposed sides of the pan or spray them with a nonstick cooking spray.", 
            "In a medium heatproof bowl over gently simmering water, heat chocolate and butter together until about 3/4 of the way melted.  Remove from heat and stir until smooth. Stir in sugar until fully combined, then eggs, one at a time and vanilla. Stir in salt until combined, then flour, until it just disappears. ", 
            "Divide batter between two prepared pans and spread it evenly — an offset spatula will make this easier. Bake on different racks for 12 to 15 minutes, rotating once top to bottom and front to back, until a toothpick inserted into the center of each pan comes out batter-free. Transfer hot pans directly to freezer (you can put down dish towels or a cooling rack to protect shelves). Chill until cold and firm, about 15 to 20 minutes. ", 
            "Remove first pan from freezer, and, working quickly, cover with ice cream. (I did this in a patchwork 1-tablespoon scoops of each flavor for a mottled look.) Use a spatula to smoosh it down and smooth the top. Remove second brownie pan from freezer. Run a knife between edges of brownie and pan to make sure it’s not sticking anywhere and use parchment sling to life the brownie out of the pan, remove the parchment and place it on top of the ice cream. Place the empty brownie pan on top of the brownie lid, to weight it, and press down a little. Keeping the weighting pan on top, return brownie-ice cream stack to freezer until fully firm, another 30 minutes. Run a knife around brownie stack again to make sure it’s not stuck, and use the parchment sling to transfer the ice cream sandwich block to a cutting bard. Cut into squares — we cut it into 16 (4×4), but I might make 25 (5×5) tinier ones next time instead.", 
            "You can store the cut sandwiches in an airtight container or bag in the freezer as-is, or individually wrapped in squares of waxed paper. They should keep for at least two months in the freezer, but good luck with that.", 
            "Rate this:Do More:TwitterFacebookPinterestPrintEmail\t\t\t", 
            "For the brownies", 
            "3 ounces (85 grams) unsweetened chocolate, roughly chopped", 
            "1 stick (4 ounces or 115 grams) unsalted butter, plus extra for pan", 
            "1 cup (200 grams) granulated sugar", 
            "2 large eggs", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1/2 teaspoon flaky sea salt or 1/4 teaspoon table salt (about 2 grams)", 
            "2/3 cup (85 grams) all-purpose flour", 
            "For the filling", 
            "2 to 3 cups ice cream (see Note up top)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/brownie-ice-cream-sandwiches1.jpg?w=640", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Ice Cream/Sorbet", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/07/brownie-ice-cream-sandwiches/", 
        "title": "brownie ice cream sandwiches", 
        "directions": [
            "Heat oven to 350°F. Line two 8×8-inch square baking pans with parchment paper, extending it up two sides. Butter the parchment and exposed sides of the pan or spray them with a nonstick cooking spray.", 
            "In a medium heatproof bowl over gently simmering water, heat chocolate and butter together until about 3/4 of the way melted.  Remove from heat and stir until smooth. Stir in sugar until fully combined, then eggs, one at a time and vanilla. Stir in salt until combined, then flour, until it just disappears. ", 
            "Divide batter between two prepared pans and spread it evenly — an offset spatula will make this easier. Bake on different racks for 12 to 15 minutes, rotating once top to bottom and front to back, until a toothpick inserted into the center of each pan comes out batter-free. Transfer hot pans directly to freezer (you can put down dish towels or a cooling rack to protect shelves). Chill until cold and firm, about 15 to 20 minutes. ", 
            "Remove first pan from freezer, and, working quickly, cover with ice cream. (I did this in a patchwork 1-tablespoon scoops of each flavor for a mottled look.) Use a spatula to smoosh it down and smooth the top. Remove second brownie pan from freezer. Run a knife between edges of brownie and pan to make sure it’s not sticking anywhere and use parchment sling to life the brownie out of the pan, remove the parchment and place it on top of the ice cream. Place the empty brownie pan on top of the brownie lid, to weight it, and press down a little. Keeping the weighting pan on top, return brownie-ice cream stack to freezer until fully firm, another 30 minutes. Run a knife around brownie stack again to make sure it’s not stuck, and use the parchment sling to transfer the ice cream sandwich block to a cutting bard. Cut into squares — we cut it into 16 (4×4), but I might make 25 (5×5) tinier ones next time instead.", 
            "You can store the cut sandwiches in an airtight container or bag in the freezer as-is, or individually wrapped in squares of waxed paper. They should keep for at least two months in the freezer, but good luck with that."
        ], 
        "date": "2014-07-10T11:09:44+00:00"
    }, 
    {
        "ingredient_list": [
            "Brownie batter", 
            "1 stick (1/2 cup or 4 ounces) unsalted butter, cut into pieces", 
            "3 ounces unsweetened chocolate, chopped", 
            "1 cup sugar", 
            "2 large eggs", 
            "1/2 teaspoon pure vanilla extract", 
            "2/3 cup all-purpose flour", 
            "Cheesecake batter ", 
            "8 ounces cream cheese, well softened", 
            "1/3 cup sugar", 
            "1 large egg yolk", 
            "1/4 teaspoon pure vanilla extract", 
            "Plus", 
            "1/2 cup semisweet chocolate chips"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/cheesecake-marbled-brownies1.jpg?w=640", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/09/cheesecake-swirled-brownies/", 
        "title": "cheesecake-marbled brownies", 
        "directions": [
            "Make brownie batter: Put oven rack in middle position and preheat oven to 350°F. Butter an 8-inch square baking pan. Heat butter and chocolate in a 3-quart heavy saucepan — though I did mine double-boiler style, placing the mixing bowl I was using over simmering water, thereby creating one less dirty dish and melting the chocolate more gently — over moderately low heat, whisking occasionally, just until melted. Remove from heat and whisk in sugar, eggs, vanilla, and a pinch of salt until well combined. Whisk in flour until just combined and spread in baking pan.", 
            "Make cheesecake batter: Whisk together cheesecake batter ingredients in a small bowl until smooth. Dollop over brownie batter, then swirl in with a knife or spatula.", 
            "[I actually like using a butter knife because the tip of it is round enough that you can use it to fold bits of the brownie batter over the cheesecake batter for a more visibly marbled effect. Try it!]", 
            "Sprinkle chocolate chips over cheesecake/brownie batter swirl. Although it might be more logical to just mix them into the cheesecake batter (and feel free to do this, it will have no ill-effect) I thought it might interrupt the swirl-ability of it.", 
            "Bake brownies:  Bake until edges are slightly puffed and center is just set, about 35 minutes. Serve warm or at room temperature.", 
            "Slicing tip: I like to chill my brownies until they’re almost frozen before cutting them. It makes it much easier to get a clean slice. I also like to eat my brownies super-cold, but that’s just personal taste."
        ], 
        "date": "2009-09-11T12:24:40+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust:", 
            "7 tablespoons unsalted butter, melted", 
            "1/3 cup sugar", 
            "1/4 teaspoon vanilla extract", 
            "1 cup plus 1 tablespoon all purpose flour", 
            "Pinch of salt", 
            "Filling:", 
            "1/2 cup sugar", 
            "2 large eggs", 
            "Pinch of salt", 
            "1/4 cup all purpose flour", 
            "1 teaspoon vanilla extract", 
            "1/2 cup (1 stick) unsalted butter, diced", 
            "1 pound sweet cherries, which will yield 12 ounces of pitted cherries, which yielded some leftovers, perfect for snacking (alternately, you can use 12 ounces of the berry of your choice)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/3664441408_6dbba66669_b.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cherries", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/06/cherry-brown-butter-bars/", 
        "title": "cherry brown butter bars", 
        "directions": [
            "Make crust: Preheat over to 375°F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (It should look like this.) Congratulations! You’ve just faked a square tart pan.", 
            "Using rubber spatula or fork, mix melted butter, sugar, and vanilla in medium bowl, or if you’re Deb, in the bottom of the small saucepan you used to melt the butter. Add flour and salt and stir until incorporated. Transfer dough to your prepared pan, and use your fingertips to press the dough evenly across the bottom of the pan. Bake the crust until golden, about 18 minutes (it will puff slightly while baking). Transfer crust to rack and cool in pan. Maintain oven temperature.", 
            "Make the filling: Cook butter in heavy small saucepan (a lighter-colored one will make it easier to see the color changing, which happens quickly) over medium heat until deep nutty brown (do not burn), stirring often and watching carefully, about six minutes. Immediately pour browned butter into glass measuring cup to cool slightly.", 
            "Whisk sugar, eggs, and salt in medium bowl to blend. Add flour and vanilla and whisk until smooth. Gradually whisk browned butter into sugar-egg mixture; whisk until well blended.", 
            "Arrange pitted cherries, or the berries of your choice, in bottom of cooled crust. Carefully pour browned butter mixture evenly over the fruit. Bake bars until filling is puffed and golden and tester inserted into center comes out clean, about 40 minutes (though, of course, this took less time in my hyperactive oven so please watch your baking times carefully). Cool bars completely in pan on rack.", 
            "Use the parchment paper overhang to carefully remove cooled bars from pan and place them on a cutting board and cut them into squares with a very sharp knife. The cherries, if they fall over your slicing lines, will want to give you trouble but if you saw a sharp knife into them slowly before pressing down, they’ll cut neatly and with minimum carnage.", 
            "Do ahead: Can be made at least a day ahead, and stored at room temperature. Any longer, keep them cool in the fridge."
        ], 
        "date": "2009-06-29T13:07:57+00:00"
    }, 
    {
        "ingredient_list": [
            "2 3/4 cups (12 3/8 ounces or 352 grams) all-purpose flour", 
            "1 cup (3 ounces or 90 grams) unsweetened Dutch-process cocoa", 
            "2 teaspoons (about 3/8 ounce or 10 grams) baking powder", 
            "1/2 teaspoon (about 1/8 ounces or 4 grams) salt", 
            "4 large eggs", 
            "1 1/2 (10 5/8 ounces or 300 grams) cups sugar", 
            "1/3 cup (2 7/8 ounce or 84 grams) sour cream (what I used) or buttermilk or you can make your own", 
            "3 tablespoons (1 1/2 ounces or 42 grams) butter, melted and cooled a bit", 
            "Your fat of choice for frying (solid vegetable shortening or canola, peanut or vegetable oil are popular choices)", 
            "8 ounces powdered sugar", 
            "3 tablespoons water, milk or buttermilk (what I used, highly recommended)", 
            "1/8 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/chocolate-doughnut-holes1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Chocolate", 
            "Doughnut", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/06/chocolate-doughnut-holes/", 
        "title": "chocolate doughnut holes", 
        "directions": [
            "Whisk together until smooth. If you need it thinner, add more water, milk or buttermilk, a few drops at a time."
        ], 
        "date": "2010-06-15T14:50:25+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "2 cups (475 ml) water", 
            "3 tablespoons (40 grams) unsalted butter, cold is fine", 
            "2 tablespoons (25 grams) granulated sugar", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1/2 teaspoon fine sea or table salt", 
            "2 cups (260 grams) all-purpose flour", 
            "2 large eggs", 
            "1 1/2 to 2 quarts (about 1 1/2 to 1 2/3 liters) vegetable oil for frying", 
            "Coating", 
            "2/3 cup (130 grams) granulated sugar", 
            "1 1/4 teaspoons ground cinnamon or canela", 
            "Chocolate", 
            "3/4 cup (175 ml) heavy or whipping cream", 
            "5 ounces (140 grams) chopped semi- or bittersweet chocolate or about 1/2 cup chocolate chips", 
            "Pinch salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/churros1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Doughnut", 
            "Photo", 
            "Spanish"
        ], 
        "url": "https://smittenkitchen.com/2016/03/churros/", 
        "title": "churros", 
        "directions": [
            "Make the dough: Heat water, butter, sugar, vanilla and salt in a medium-size saucepan until simmering and butter has melted. Remove from heat and dump in flour all at once. Mix vigorously with a spoon until the mixture forms a smooth ball and no floury bits are visible. ", 
            "Let cool 5 to 10 minutes, then add eggs, one at a time. You can beat them in with a large whisk and strong arm, or use a hand- or stand mixer. Be warned that the dough really likes to ride up the beaters of a handmixer, so keep it pushed down. ", 
            "Transfer churros to a pastry bag or strong gallon ziploc bag with a corner snipped off, fitted with a large closed star tip — Cook’s Country recommends a #8 pastry tip, 5/8-inch in diameter but I might have preferred a slightly smaller one so they were less thick. ", 
            "If you’d like to make them the traditional way, you can skip right to the frying stage and pipe the churros in 6-inch or desired lengths (I played around with some blob-shaped minis) right into the oil, snipping them off with scissors at your desired length. But I found it a little easier to pipe them while still warm onto a large baking sheet that had been lined with parchment paper and sprayed lightly with a nonstick spray, so I was in less of a rush. If using this method, transfer the tray of shaped churros to the fridge for 15 minutes and up to a couple hours to help the shapes set before frying them.", 
            "Cook the churros: Heat oven to 200 degrees to keep churros warm while you fry them in batches. Line a large plate with a couple layers of paper towels. Add oil to Dutch oven or cast iron skillet until it measures about 1 1/2 inches deep and heat over medium/medium-high heat to 375 degrees.", 
            "Gently drop a few churros at a time into the oil and fry until deep golden brown on all sides, which will take about 6 minutes. Turn them frequently so that they cook evenly. Adjust heat as needed so that the oil does not dip below 350 degrees. Once churros are cooked, remove from oil and drain on towels for a minute before transferring to a tray in the oven to keep warm. Return your oil to 375 degrees before adding more churros. Repeat with remaining dough.", 
            "Coat the churros: Once all churros are fried, combine cinnamon and sugar on a plate. Roll warm churros, one by one, in sugar to coat, spooning more cinnamon-sugar on as you do for best coverage. Tap off excess. Do not let warm churros sit in cinnamon sugar for longer than needed to coat or the sugar will get clumpy.", 
            "Make the sauce: Heat cream, chocolate and salt in a bowl in microwave in 30 second bursts, whisking between them, until chocolate has melted. ", 
            "Dip warm churros in warm chocolate sauce, repeat as needed.", 
            "Do ahead: Choux dough, the style of dough used here, can be made and kept in bowl for up to a day before using, but it will be easier to pipe when it’s still warm. Piped raw churros should be good in the fridge for a few hours, but I haven’t tested it for a full day, though it stands to reason they’d keep that long too. Churros can be kept warm in oven before coating with cinnamon sugar for probably up to an hour before they might get dry. They’re best on the first day."
        ], 
        "date": "2016-03-03T12:14:43+00:00"
    }, 
    {
        "ingredient_list": [
            "For the filling", 
            "1 1/2 cups (8 ounces) pitted dates, chopped", 
            "3/4 cup water", 
            "1 teaspoon finely grated orange (or mandarin or clementine) zest", 
            "For the crumbs", 
            "2 tablespoons packed brown sugar", 
            "1/4 cup raw or turbinado sugar", 
            "1/2 cup olive oil, coconut oil, melted butter or a mix of the above", 
            "3/4 cups rolled oats, I used quick-cooking but old-fashioned should work just fine", 
            "3/4 cup plus 2 tablespoons whole wheat flour, or a wholegrain flour mix of your choice", 
            "1/2 teaspoon ground cinnamon", 
            "A few gratings of fresh nutmeg", 
            "A pinch or two of ground cloves", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon coarse sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-breakfast-squares1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Dates", 
            "Photo", 
            "Snack", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2015/11/date-breakfast-squares/", 
        "title": "date breakfast squares", 
        "directions": [
            "Heat oven to 400 degrees. Either grease bottom and sides of an 8×8-inch pan or line the bottom and sides with parchment paper. ", 
            "In a small saucepan, combine dates, water and zest over low heat, simmering for 5 to 10 minutes, until liquid has absorbed and mixture has thickened. Set aside while you make the crumbs.", 
            "In a large bowl, mix the sugars and oil or butter together. Add the oats, flour, spices, baking soda and salt and stir to combine; the mixture should form a coarse rubble. ", 
            "Press half into the bottom of your prepared pan. Dollop the date mixture over it and use a small offset spatula (or whatever you have on hand) to spread the mixture smoothly over the crumbs. Don’t worry if the crumbs move around a little underneath; these bars don’t require perfection. Sprinkle remaining crumbs over date layer and press lightly to cover. ", 
            "Bake bars for 25 minutes, or until light brown at the edges. Cool in pan. Cut into squares. They’ll keep just fine at room temperature but will last up to a week in the fridge and longer in the freezer."
        ], 
        "date": "2015-11-20T11:50:15+00:00"
    }, 
    {
        "ingredient_list": [
            "For crust", 
            "3 1/2 ounces (100 grams or 1 cup) graham crackers, crumbled", 
            "2 tablespoons (25 grams) sugar", 
            "3 tablespoons (45 grams) unsalted butter, melted", 
            "For filling", 
            "1 teaspoon unflavored gelatin (from a 1/4-ounce or 7-gram envelope, will be just about half an envelope)", 
            "1/4 cup (60 ml) whole milk", 
            "8 ounces (225 grams) cream cheese, softened", 
            "2 large eggs", 
            "3/8 teaspoon salt", 
            "1 cup dulce de leche (12 1/2-ounce or 355-gram can) (recipe follows)", 
            "For glaze", 
            "3 ounces (85 grams) fine-quality bittersweet chocolate (not unsweetened), coarsely chopped", 
            "1/2 stick (2 ounces or 55 grams) unsalted butter, cut into pieces", 
            "2 teaspoons light corn syrup"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/dulce-de-leche-cheesecake-squares.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cake", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/02/dulce-de-leche-cheesecake-squares/", 
        "title": "dulce de leche cheesecake squares", 
        "directions": [
            "Make crust: Put oven rack in middle position and preheat oven to 325°F. Line bottom and sides of an 8-inch square baking pan with 2 sheets of foil (crisscrossed), leaving a 2-inch overhang on all sides.", 
            "Finely grind crackers with sugar and a pinch of salt in a food processor. With motor running, add butter, blending until combined. Press mixture evenly onto bottom of baking pan. Bake 10 minutes, then cool in pan on a rack 5 minutes.", 
            "Make filling: Sprinkle gelatin over milk in a small bowl and let stand 2 minutes to soften. Beat together cream cheese, eggs, salt, and gelatin mixture in a bowl with an electric mixer at medium speed until well combined, about 2 minutes, then stir in dulce de leche gently but thoroughly. Pour filling over crust, smoothing top, then bake in a hot water bath (I was able to fit mine in a 9×13-inch baking pan) in oven until center is just set, about 45 minutes. Cool cheesecake completely in pan on rack, about 2 hours. Chill, covered, at least 6 hours.", 
            "Glaze cake within 2 hours of serving: Heat all glaze ingredients in a double boiler or a small metal bowl set over a saucepan of barely simmering water, stirring until smooth, then pour over cheesecake, tilting baking pan to coat top evenly. Chill, uncovered, 30 minutes.", 
            "Lift cheesecake from pan using foil overhang and cut into 1-inch squares with a thin knife, wiping off knife after each cut. (Don’t skip this step! A clean knife is essential for uber-neat squares.)", 
            "Note: Cheesecake (without glaze) can be chilled up to 3 days.", 
            "Dulce de Leche (Milk Caramel)", 
            "I know that most of the world makes this by boiling the milk inside a closed can, but honestly, that scares the bejesus out of me and according to the Carnation can label I pulled this technique from, is not recommended by them (likely because they do not want to get sued, but still). This method works just as well.", 
            "Pour one can (14 ounce) sweetened condensed milk into top of double-boiler pan; cover. Place over boiling water. Cook over low heat, stirring occasionally, for 40 to 50 minutes, or until thick and light caramel-colored.", 
            "Remove from heat. Whisk until smooth."
        ], 
        "date": "2008-02-06T13:08:40+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "3 tablespoons granulated sugar", 
            "1 cup milk (non-dairy milks could easily be subbed here)", 
            "1 cup water", 
            "1/2 teaspoon vanilla extract or a small scraping of fresh vanilla bean seeds", 
            "3 cups all-purpose flour", 
            "1 tablespoon baking powder", 
            "1/2 teaspoon coarse or kosher salt", 
            "Oil for deep-fat frying (I needed about 1 1/2 cups for an 9-inch skillet)", 
            "Confectioners’ sugar to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/06/funnel-cake1.jpg?w=750", 
        "tags": [
            "Doughnut", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/06/funnel-cake/", 
        "title": "funnel cake", 
        "directions": [
            "\nIn a large bowl, whisk eggs with sugar, milk, water and vanilla. Sprinkle salt and baking powder over the batter, then flour, and whisk it until batter is smooth.\nYou can use a funnel, pitcher, squeeze bottle or plastic bag with the corner snipped off to pour your batter into the oil in a thin stream.Are you going to use a funnel? If so, check to make sure your batter is the right consistency to fall through by holding it over your bowl and ladling a little in. I was using one with a 1/2-inch opening and my batter was a tad thick. If yours is, whisk in extra water, 1 tablespoon at a time, until it’s right. You might need 2 or 3.Are you going to use a plastic bag with the corner snipped off? Don’t worry about it then, you can always cut the hole a little bigger if the batter doesn’t fall through easily.\nHeat 1-inch of oil in a heavy skillet that’s the size you want your cakes to be to between 350 and 375 degrees F. With your finger over the opening so it doesn’t fall out, ladle batter into your funnel or a plastic bag. I like to put in only as much batter as I’ll need for each cake (1/2 cup for the 8-inch round size) so I can put the funnel down without having to stop it up somehow between uses.\nLet batter squiggle and scribble all over oil. Fry for 1 to 2 minutes on first side, until golden underneath. Flip with tongs and fry on the second side for about 1 minute, until golden all over. Remove from oil and blot briefly on paper towels. Ensure that the oil temperature is still correct, then fry remaining cakes. Transfer each to a double layer of paper plates and blizzard on the powdered sugar. Eat with your fingers."
        ], 
        "date": "2016-06-21T11:32:24+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups old-fashioned oatmeal", 
            "1 cup sliced almonds", 
            "1 cup shredded coconut, loosely packed (I used unsweetened)", 
            "1/2 cup toasted wheat germ", 
            "2/3 cup honey", 
            "1 1/2 teaspoons pure vanilla extract", 
            "1/4 teaspoon kosher salt", 
            "1 1/2 cup dried fruit, or a mix of dried fruit (I used chopped apricots, cranberries and raisins)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/granola-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Coconut", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/09/granola-bars/", 
        "title": "granola bars", 
        "directions": [
            "Preheat your oven to 350°F. Butter an 8×12-inch baking dish (lacking this, I used a 9×13-inch) and line it with parchment paper.", 
            "Toss the oatmeal, almonds, and coconut together on a sheet pan and bake for 10 to 12 minutes, stirring occasionally, until lightly browned. Transfer the mixture to a large mixing bowl and stir in the wheat germ. Reduce the oven temperature to 300°F.", 
            "While the mixture is still warm, stir in the honey, vanilla and salt until the mixture is well coated, then the dried fruit. Pour the mixture into your prepared baking dish and press, press, press it in (wet fingers and/or a silicon spatula work great for this) until the mixture is packed as tightly as possible.", 
            "Bake for 25 to 30 minutes, until light golden brown. Cool for 2 to 3 hours before cutting into squares — your best serrated knife is great for this.", 
            "You can store these in an airtight container at room temperature for a week or two, as you would cookies, however, I prefer to store mine in the freezer. I find that they stay the most crisp this way as all granola tends to soften at room temperature after a day or more. "
        ], 
        "date": "2009-09-02T11:24:48+00:00"
    }, 
    {
        "ingredient_list": [
            "For brownie layer", 
            "1 1/2 sticks (3/4 cup) unsalted butter", 
            "10 1/2 oz fine-quality bittersweet chocolate (not extra-bitter or unsweetened and no more than 60% cacao if marked), finely chopped", 
            "1 1/2 cups packed light brown sugar", 
            "3 large eggs, lightly beaten", 
            "1 1/4 teaspoons vanilla", 
            "3/4 cup all-purpose flour", 
            "1/4 cup plus 2 tablespoons unsweetened Dutch-process cocoa powder", 
            "3/4 teaspoon salt", 
            "For mint ganache", 
            "1/2 cup heavy cream (see recipe notes)", 
            "10 oz fine-quality white chocolate, chopped (see recipe notes)", 
            "2 tablespoons green crème de menthe (I skipped this and found the mint flavor strong enough; compensated for the tinting with a single drop of green color)", 
            "1 teaspoon peppermint extract", 
            "For chocolate ganache", 
            "1 cup heavy cream (see recipe notes)", 
            "10 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped", 
            "Make brownie layer:", 
            "Put oven rack in middle position and preheat oven to 375°F. Lightly butter a 13- by 9-inch baking pan and line with 2 crisscrossed sheets of foil, leaving a 2 inch overhang on all sides. Butter foil.", 
            "Make mint ganache:", 
            "Bring cream to a simmer in a 2- to 3-quart saucepan and remove from heat. Pour over white chocolate in a bowl. Let stand 1 minute, then whisk until smooth. Stir in crème de menthe and extract and chill, covered, stirring occasionally, until thick, about 1 hour.", 
            "Make chocolate ganache:", 
            "Bring cream to a simmer in a 2- to 3-quart saucepan and remove from heat. Pour over bittersweet chocolate in a bowl. Let stand 1 minute, then whisk until smooth. Chill, covered, stirring occasionally, until thick, about 30 minutes.", 
            "Assemble layers:", 
            "Spread mint ganache over top of cooled brownie in a thin even layer using offset spatula, then chill until firm but still slightly sticky, about 30 minutes."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/12/grasshopper-brownies.jpg?w=750", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/12/grasshopper-brownies/", 
        "title": "grasshopper brownies", 
        "directions": [
            "Spread chocolate ganache over mint and chill until firm, about 2 hours.", 
            "Lift dessert out of pan using foil overhang. Run a heavy knife under hot water and wipe dry, then trim edges of dessert (1/4 inch off each side). Cut dessert into squares and peel from foil."
        ], 
        "date": "2008-12-19T19:23:25+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/i-blame-babies-for-this1.jpg?w=500", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/01/i-blame-babies-for-this/", 
        "title": "cream cheese marbled brownies", 
        "directions": [
            "1. Adjust oven rack to middle position; heat oven to 325°F. Cut 18-inch length foil and fold lengthwise to 8-inch width. Fit foil into length of 13 by 9-inch baking dish, pushing it into corners and up sides of pan; allow excess to overhand pan edges. Cut 14-inch length foil and, if using extra-wide foil, fold lengthwise to 12-inch width; fit into width of baking pan in same manner, perpendicular to first sheet. Spray foil-lined pan with nonstick cooking spray.", 
            "2. Beat cream cheese and two tablespoons butter in medium bowl until light and fluffy. Gradually add 1/4 cup sugar and beat until well blended. Beat in egg. Mix in one tablespoon flour. Set mixture aside.", 
            "3. If using nuts, spread nuts evenly on rimmed baking sheet and toast in oven until fragrant, 5 to 8 minutes. Set aside to cool.", 
            "4. Whisk to combine flour, salt, and baking powder in medium bowl; set aside.", 
            "5. Melt chocolate and butter in large heatproof bowl set over saucepan of almost-simmering water, stirring occasionally, until smooth. (Alternatively, in microwave, heat butter and chocolate in large microwave-safe bowl on high for 45 seconds, then stir and heat for 30 seconds more. Stir again, and, if necessary, repeat in 15-second increments; do not let chocolate burn.) When chocolate mixture is completely smooth, remove bowl from saucepan and gradually whisk in sugar. Add eggs on at a time, whisking after each addition until thoroughly combined. Whisk in vanilla. Add flour mixture in three additions, folding with rubber spatula until batter is completely smooth and homogeneous.", 
            "6. Transfer half of batter to prepared pan; using spatula, spread batter into corners of pan and smooth surface. Pour cream cheese mixture over, then second half of brownie batter. Swirl the batters together decoratively with the tip of a knife. Sprinkle toasted nuts (if using) evenly over batter and bake until toothpick or wooden skewer inserted into center of brownies comes out with few moist crumbs attached, 35 to 45 minutes, watching carefully for overcooking. Cool on wire rack to room temperature, about 2 hours, then remove brownies from pan by lifting foil overhang. Cut brownies into 2-inch squares and serve. (Store leftovers in airtight container at room temperature, for up to 3 days, or, ahem, in the freezer until your resistance gets the better of you.)"
        ], 
        "date": "2007-01-12T14:11:26+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 teaspoons (1 7-gram or 1/4-ounce packet) active dry yeast", 
            "1/4 cup (50 grams) granulated sugar", 
            "3/4 cup (180 ml) lukewarm (not hot) milk", 
            "2 large egg yolks", 
            "Few gratings of orange or lemon zest, 1 teaspoon vanilla or 1/2 teaspoon almond extract", 
            "2 tablespoons (1 ounce or 30 grams) butter softened", 
            "2 1/3 cups (290 grams) all-purpose flour", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 egg white, whisked until frothy (for peskier filling method)", 
            "Vegetable oil for deep-frying, and coating bowl", 
            "1/2 to 2/3 cup jam or preserves of your choice", 
            "Powdered sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/jelly-doughnuts1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Doughnut", 
            "Hanukah", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/12/jelly-doughnuts/", 
        "title": "jelly doughnuts", 
        "directions": [
            "Make the dough: In the bottom of a large mixing bowl, combine the yeast, sugar and milk. Let stand for 5 minutes; it should become a little foamy. Whisk in yolks, any zest or extracts you’d like to use, then butter. Don’t worry if the butter doesn’t fully combine. ", 
            "— By hand: Add half of flour and stir with a spoon until combined. Add second half of flour and salt and stir as best as you can with a spoon, then use your hands to knead the dough until it forms a smooth, elastic round, about 5 minutes. Try, if you can, to resist adding extra flour, even if it’s sticky. Extra flour always makes for tougher/dryer doughnuts and breads. Sticky hands and counters are always washable!", 
            "— With a stand mixer: Add half the flour and let the dough hook mix it in slowly, on a low speed. Add second half of flour and salt and let the dough hook bring it together into a rough dough. Run machine for 3 to 4 minutes, letting it knead the dough into a smooth, cohesive mass.", 
            "Both methods: If the dough is already in the bowl, remove it just long enough to lightly oil the bowl. Return dough to bowl, cover with plastic wrap and let rest at room temperature for 1 hour, or in the fridge overnight.", 
            "There are two ways to fill doughnuts: In the easiest method, you fill them after they’re cooked with a piping bag. The filling is usually a little imperfect, off-center or slightly messy, but it takes the least effort by far. With the peskier method, you pre-fill the doughnuts, sealing the edges; the centers will be picture-perfect and neat, but it does take longer to assemble. Both will make you a hero to anyone you make these for, promise.", 
            "— Easiest method: On a lightly floured counter, roll dough to a 1/2-inch thickness. Cut into 2-inch rounds; no need to re-roll scraps unless you wish; I like to keep the odd shapes for getting the hang of frying before cooking the final doughnuts. Or, if you’re vehemently against scraps and re-rolling, you can make small square doughnuts, which are surprisingly cute. Let cut dough rise for another 30 minutes at room temperature, loosely covered with a towel at room temperature, or in the fridge overnight, on an oiled tray, covered loosely with oiled plastic wrap (use this longer rise only if did the 1-hour rise the first time; two overnights is too much for this dough). ", 
            "— Peskier method:  On a lightly floured counter, roll dough to a 1/4-inch thickness. Cut into 2-inch rounds; no need to re-roll scraps unless you wish; I like to keep the odd shapes for getting the hang of frying before cooking the final doughnuts. Or, if you’re vehemently against scraps and re-rolling, you can make small square doughnuts, which are surprisingly cute. Brush the edges of half the cut-outs with egg white, and in the center of each, add a tiny dollop (much less than you think you’ll need) of jam. Use the remaining cut-outs to form lids. Pinch every speck of the edges together tightly, almost as if you were making ravioli; you’ll want to seal these spectacularly well. Let filled doughnuts rise for another 30 minutes at room temperature, loosely covered with a towel at room temperature, or in the fridge overnight, on an oiled tray, covered loosely with oiled plastic wrap (use this longer rise only if did the 1-hour rise the first time; two overnights is too much for this dough). ", 
            "Both methods, fry the doughnuts: Heat 2 inches of oil to 350°F (175°C) in a cast-iron frying pan (I like using one because it so delightfully re-seasons them) or heavy pot. Use your dough scraps to practice and get an idea of how quickly the doughnuts will cook. Then add about 4 doughnuts at a time to the oil, cooking on the first side until golden brown underneath, about 1 to 2 minutes, but often less so keep a close eye on them. Flip doughnuts and cook on the other side, until it, too, is golden brown underneath, about another minute. Drain doughnuts, then spread them on a paper towel-lined plate to absorb extra oil. Repeat with remaining doughnuts.", 
            "– If you haven’t filled your doughnuts yet, i.e. you’re using the easier method: When doughnuts are cool enough to handle, place jelly or jam in a piping bag with a round tip with a 1/4- to 1/2-inch opening. You can fill doughnuts from the tops or sides; I did half with each. Press the tip of the jam bag halfway into the doughnut, and squeeze in the jam until it dollops out a little from the hole. Repeat with remaining doughnuts. ", 
            "Finish doughnuts: Either generously shower doughnuts with powdered sugar on either side, shaken from a fine-mesh strainer, or roll the doughnuts gently in a bowl of powdered sugar.", 
            "Eat at once. Don’t forget to share. If eating these on the first day, leave any remaining doughnuts uncovered on a plate. These are best on the first day, but my son did not (shockingly) say no to one that had been in an airtight container at room temperature overnight for breakfast this morning, so I guess they’re not inedible on the second day. They will need to be re-powdered, however, as it absorbs into the doughnuts when they’re in a covered container. ", 
            "To make these dairy-free: You can use warm water, soy, almond or coconut milk instead of the dairy milk, and coconut oil, shortening or margarine for the butter. I made a version with both coconut milk and coconut oil, orange zest and a bit of almond extract that were a big hit."
        ], 
        "date": "2014-12-11T11:59:16+00:00"
    }, 
    {
        "ingredient_list": [
            "For the crust: ", 
            "1/2 pound unsalted butter, at room temperature", 
            "1/2 cup granulated sugar", 
            "2 cups flour", 
            "1/8 teaspoon kosher salt", 
            "For the full-size lemon layer: ", 
            "6 extra-large eggs at room temperature", 
            "2 1/2 cups granulated sugar", 
            "2 tablespoons grated lemon zest (4 to 6 lemons)", 
            "1 cup freshly squeezed lemon juice", 
            "1 cup flour", 
            "4 extra-large eggs at room temperature", 
            "1 2/3 cups granulated sugar", 
            "1 tablespoon + 1 teaspoon grated lemon zest (3 to 4 lemons)", 
            "2/3 cup freshly squeezed lemon juice", 
            "2/3 cup flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/01/lemon-bars.jpg?w=750", 
        "tags": [
            "Bars", 
            "Citrus", 
            "Cookie", 
            "Fruit", 
            "Lemon", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/01/lemon-bars/", 
        "title": "lemon bars", 
        "directions": [
            "Confectioners’ sugar, for dusting", 
            "Preheat the oven to 350°F and grease a 9 by 13 by 2-inch baking sheet.", 
            "For the crust, cream the butter and sugar until light in the bowl of an electric mixer fitted with the paddle attachment. Combine the flour and salt and, with the mixer on low, add to the butter until just mixed. Dump the dough onto a well-floured board and gather into a ball. Flatten the dough with floured hands and press it into the greased baking sheet, building up a 1/2-inch edge on all sides. Chill.", 
            "Bake the crust for 15 to 20 minutes, until very lightly browned. Let cool on a wire rack. Leave the oven on.", 
            "For the lemon layer, whisk together the eggs, sugar, lemon zest, lemon juice, and flour. Pour over the crust and bake for 30 to 35 minutes (less if you are using the thinner topping), or about five minutes beyond the point where the filling is set. Let cool to room temperature.", 
            "Cut into rectangles and dust with confectioners’ sugar."
        ], 
        "date": "2008-01-07T23:12:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (1 stick) salted butter, cut into large pieces", 
            "1 1/2 cups graham crackers crumbs (about 8 graham crackers, pulsed in a food processor)", 
            "1 1/2 cups chocolate chips", 
            "1 cup butterscotch chips", 
            "1 cup shredded coconut", 
            "1 cup pecans, coarsely chopped", 
            "1/3 cup sweetened condensed milk (just under half a small can)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/lookin-swell-dolly1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Candy", 
            "Chocolate", 
            "Coconut", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/10/lookin-swell-dolly/", 
        "title": "hello dolly bars", 
        "directions": [
            "Preheat oven to 350 degrees.", 
            "Melt butter in microwave in heatproof bowl until just melted when stirred. Add graham cracker crumbs. Mix and then press evenly into the bottom of 8×8 baking pan. ", 
            "Layer coconut, pecans, butterscotch and chocolate chips on top of graham cracker base. Pour sweetened condensed milk over whole mixture. ", 
            "Bake in oven for 25 to 30 minutes, or until the top is light brown.", 
            "Like all brownie and cookie bars, I find them easier to cut cleanly once they’ve been thoroughly cooled in the fridge, but I also don’t expect you to be able to wait that long. ", 
            "Because they’re so sweet, I like to cut them into really tiny squares. Those mini-cupcake liners come in handy as well, too, so they don’t all cluster together, not that anyone would mind. "
        ], 
        "date": "2007-10-08T21:07:08+00:00"
    }, 
    {
        "ingredient_list": [
            "3 ounces (85 grams) unsweetened chocolate, roughly chopped", 
            "1 stick (4 ounces or 115 grams) unsalted butter, plus extra for pan", 
            "1 1/3 cups (265 grams) granulated sugar", 
            "2 large eggs", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1/2 teaspoon flaky sea salt or 1/4 teaspoon table salt (about 2 grams)", 
            "2/3 cup (85 grams) all-purpose flour "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/08/my-favorite-brownies.jpg?w=750", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2012/08/my-favorite-brownies/", 
        "title": "my favorite brownies", 
        "directions": [
            "Heat oven to 350°F. Line an 8×8-inch square baking pan with parchment, extending it up two sides, or foil. Butter the parchment or foil or spray it with a nonstick cooking spray. ", 
            "In a medium heatproof bowl over gently simmering water, melt chocolate and butter together until only a couple unmelted bits remain. Off the heat, stir until smooth and fully melted. You can also do this in the microwave in 30-second bursts, stirring between each. Whisk in sugar, then eggs, one at a time, then vanilla and salt. Stir in flour with a spoon or flexible spatula and scrape batter into prepared pan, spread until even. Bake for 25 to 30 minutes, or until a toothpick inserted into the center comes out batter-free. ", 
            "Let cool and cut into desired size. If you’re like me, you will prefer these and all brownies, cold or even frozen. But I bet you’re normal and will just eat them hot from the pan. If desired, dust the brownies with powdered sugar before serving."
        ], 
        "date": "2012-08-20T14:31:09+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup granulated (50 grams) or powdered (30 grams) sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "6 tablespoons (85 grams) unsalted butter", 
            "1/3 cup dark brown sugar", 
            "1/3 cup granulated sugar", 
            "1 large egg", 
            "1 large egg yolk", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 tablespoon bourbon (optional)", 
            "1 teaspoon vanilla extract", 
            "6 tablespoons all-purpose flour", 
            "3/4 cup (4 1/2 ounces or 130 grams) chocolate chips or chopped chocolate", 
            "3/4 cup toasted (always) and coarsely chopped walnuts or pecans", 
            "Flaky sea salt on top, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/not-derby-pie-bars1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Bourbon", 
            "Chocolate", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2015/04/not-derby-pie-bars/", 
        "title": "not derby pie bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. A little nonstick spray underneath helps keep the strips in place. (If you have an 8-inch square springform, you can skip this and just butter it lightly.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take another 30 seconds for it to come together, but it will. Transfer the dough clumps to prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. Meanwhile, prepare the filling.", 
            "Make the filling: Melt your butter and, if desired, brown it too, by continuing to cook the butter in a small saucepan over medium heat, stirring frequently, until golden brown bits form at the bottom, about 5 minutes. Transfer butter to a large bowl and let it cool; you can hasten this along by setting it in the freezer for a couple minutes or stirring it over an ice water bath.", 
            "Whisk sugars into butter until smooth, then egg, (edited to add) yolk, salt, bourbon (if using) and vanilla. Stir in flour until just combined, then mix in chocolate and nuts. Pour over par-baked crust, spreading evenly. Sprinkle lightly with sea salt before baking, if desired. ", 
            "Bake bars: For 20 to 25 minutes, until top is firm and golden. Bars are much easier to cut if you let them cool almost completely, but I suspect there’s little fun in that. Once they’re cool, however, you can easily transfer them from the pan to a cutting board with the parchment paper sling you created. Serve plain, with whipped cream or a tiny scoop of vanilla ice cream. Can dust with powdered sugar for extra pretties. ", 
            "Store at room temperature for up to 3 days, or in the fridge for longer."
        ], 
        "date": "2015-04-30T12:00:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 \tpound unsalted butter", 
            "28 \tounces semi-sweet chocolate chips, divided", 
            "6 \tounces unsweetened chocolate", 
            "6 \textra large eggs", 
            "3 \ttablespoons instant coffee granules", 
            "2 \ttablespoons pure vanilla extract", 
            "2 1/4 \tcups sugar", 
            "1 1/4 \tcups all-purpose flour, divided", 
            "1 \ttablespoon baking powder", 
            "1 \tteaspoon salt", 
            "3 \tcups chopped walnuts ", 
            "Ina’s notes: Flouring the chips and walnuts keeps them from sinking to the bottom.", 
            "It is very important to allow the batter to cool well before adding the chips, or the chips will melt and ruin the brownies. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/outrageously-good-well-intentions1.jpg?w=500", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/09/outrageously-good-well-intentions/", 
        "title": "outrageous brownies", 
        "directions": [
            "Do ahead: This recipe can be baked up to a week in advance, wrapped in plastic, and refrigerated."
        ], 
        "date": "2006-09-14T08:42:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (7 ounces or 200 grams) white sugar", 
            "1 teaspoon (5 grams) baking powder", 
            "2 3/4 cups plus 2 tablespoons (12 5/8 ounces or 359 grams) cups all-purpose flour (or you can measure 3 cups and remove 2 tablespoons flour)", 
            "1/4 teaspoon cinnamon", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1/4 teaspoon (2 grams) salt", 
            "1 cup (2 sticks or 8 ounces or 227 grams) cold unsalted butter", 
            "1 large egg", 
            "2 peaches, pitted and thinly sliced (between 1/8 and 1/4-inch thick)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/09/4950027940_b3512efca3_o.jpg?w=749", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cookie", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/09/peach-shortbread/", 
        "title": "peach shortbread", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns and the very second that you turn around to do something else. Set it in the freezer until solid (about 30 minutes).", 
            "[Don’t have time for all this brown butter madness? Check the head notes to use regular softened butter instead.]", 
            "Preheat the oven to 375°F (190°C). Butter a 9×13 inch pan, or spray it with a nonstick spray. In a medium bowl, stir together sugar, baking powder, flour, salt and spices with a whisk.  Use a pastry blender, fork or your fingertips, blend the solidified brown butter and egg into the flour mixture. It will be crumbly. Pat 3/4 of the crumbs into the bottom of the prepared pan, pressing firmly. Tile peach slices over crumb base in a single layer. Scatter remaining crumbs evenly over peaches and bake in preheated oven for 30 minutes, until top is slightly brown and you can see a little color around the edges. Cool completely in pan before cutting into squares.", 
            "Keeping: I’ve kept mine in the fridge and they’ve held up great there since Monday. I imagine that these would freeze well, between layers of waxed paper, with the container sealed well in plastic wr"
        ], 
        "date": "2010-09-02T15:58:05+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peanut-butter-brownies1.jpg?w=500", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Peanut Butter", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/10/peanut-butter-brownies/", 
        "title": "peanut butter brownies", 
        "directions": [
            "Make brownies: Preheat oven to 350 degrees F with rack in middle. Butter a 13- by 9- by 2-inch baking pan, then line bottom of pan with parchment paper and butter parchment. ", 
            "Beat together butter and sugar with an electric mixer at medium-high speed until mixture is light and fluffy, then add peanut butter and beat until incorporated. Beat in whole eggs, egg yolk, and vanilla. Reduce mixer sped to low, then mix in flour until just combined. ", 
            "Mix in chocolate chips (1 1/2 cups) then spread batter in baking pan, smoothing top. (It will be thick, almost like cookie batter.)", 
            "Bake until brownies are deep golden, puffed on top and a wooden pick inserted in center come out with some crumbs adhering, 40 to 45 minutes. ", 
            "Cool completely in pan on a rack, about 1 1/2 hours.", 
            "Make ganache: Put chocolate chips (1 1/2 cups) in a heatproof bowl. ", 
            "Bring cream to a boil in a small saucepan, then pour over chocolate chips and let mixture stand for one minute. ", 
            "Gently whisk in butter until it is incorporated, chocolate is melted, and a smooth mixture forms. ", 
            "Spread ganache on cooled brownies and let stand until set, about 15 minutes. ", 
            "Brownies keep in one layer in an airtight container three days, and we hope much longer if hidden waaay in the back of the freezer. ", 
            "* I swapped bittersweet chips for the semisweet by accident, but really liked that bitter, grown-up kick.", 
            "** Our store only sells some all natural hipppy-dippy peanut butter. It worked fine but I couldn’t help but feel this recipe needed a bit of salt. It could be that, uh, it needs some salt, or that traditional peanut butter (IstillheartyouSkippy!) has more salt in it. I’d suggest you try the dough/batter (because you’re going to anyway) before you bake it and judge for yourself whether it needs a little more flavor balance."
        ], 
        "date": "2007-10-01T17:44:47+00:00"
    }, 
    {
        "ingredient_list": [
            "", 
            "\t\t", 
            "\t", 
            "\t\tPeople, these things are nothing but trouble, so whatever you do, don’t do this:", 
            "", 
            "", 
            "Do not start with a bowl of vaguely healthful and intensely fortified bowl of Snap, Crackle and Pop.", 
            "", 
            "Do not boil some sugar, because obviously unsweetened cereal will not do.", 
            "", 
            "(Try not to do this to your lens, either, when you take a picture.)", 
            "", 
            "Do not mix the caramel with the Krispies and press them into a pan.", 
            "", 
            "", 
            "Definitely don’t melt some chocolate and peanut butter together. ", 
            "", 
            "Or do this.", 
            "", 
            "And this.", 
            "", 
            "Then this.", 
            "", 
            "Or sit back and scratch your head as they disappear, because there’s only two of you at home. Just don’t, okay?", 
            "I’m sorry, are you still there? I figure that by now, half of you rebels have already run to the grocery store to buy your first box of Rice Krispies in half a lifetime, and the other half of you are appalled, simply appalled, at the syrupy, overindulgent, processed and fattening “treats” we Americans are so fond of.", 
            "Well, here’s a warning to those of you in the latter camp (those of you in the former one already know this): these bars will win you over. I wholly admit that as awesome as they sound, I really made them because I live with a 3rd grader 34 year old that has only one reaction to the suggestion of chocolate and peanut butter: WANT. ", 
            "But when I first tried them, I was a little taken aback. The crispy layer crumbled to the point that I couldn’t get a clean cut and I thought the peanut butter layer was too thick and sweet. Were I a more patient cook this week–you see, I am quietly considering partaking in this NaBloPoMo madness again this year, because I never learn, which would mean that I should preserve my cooking energy–I might have tried it over again with a few tweaks…", 
            "But a day or two later now, they’ve completely won me over and I now realize why the Baked boys say that this is, hands down, the most popular refrigerated bar they make at the bakery. Curious about the others? The Rasberry Breakfast Bars and Baked Brownies weren’t enough for you? (And how could they be, with as yet un-auditioned recipes for Pumpkin Whoopie Pies and S’more Nut Bars and Butterscotch Pudding Tarts?) You’ve got to get your own copy.", 
            "Chocolate and peanut butter, previously: Chocolate and Peanut Butter Cake, Peanut Butter Brownies and Peanut Butter Cookies", 
            "One year ago: Sweet Potato and Sausage Soup", 
            "Two years ago Bretzel Rolls", 
            "\t", 
            "", 
            "\t", 
            "Peanut Butter Crispy Bars", 
            "Adapted from Baked: New Frontiers in Baking", 
            "These bars are sticky and indulgent and not good for you in any way, so before you even ask, perhaps you can make them with organic, low-fat peanut butter, whole grain bio-crisped rice cereal or a sugar substitute but you shouldn’t. Nobody likes a party pooper.", 
            "For the crispy crust", 
            "1 3/4 cups crisped rice cereal", 
            "1/4 cup sugar", 
            "3 tablespoons light corn syrup", 
            "3 tablespoons unsalted (their recommendation) or salted (what I used, and liked) butter, melted", 
            "For the milk chocolate peanut butter layer", 
            "5 ounces good-quality milk (their recommendation) or semi-sweet (what I’d use next time) chocolate, coarsely chopped", 
            "1 cup creamy peanut butter", 
            "For the chocolate icing", 
            "3 ounces dark chocolate (60 to 72 percent cocoa), coarsely chopped", 
            "1/2 teaspoon light corn syrup", 
            "4 tablespoons (1/2 stick or 2 ounces) unsalted (their recommendation) or salted (what I used, and liked) butter", 
            "Make the crispy crust: Lightly spray a paper towel with nonstick cooking spray and use it to rub the bottom and sides of an 8-inch square baking pan.", 
            "Put the cereal in a large bowl and set aside.", 
            "Pour 1/4 cup water into a small saucepan. Gently add the sugar and corn syrup (do not let any sugar or syrup get on the sides of the pan) and use a small wooden spoon to stir the mixture until just combined. Put a candy thermometer in the saucepan. Cook over medium-high heat and bring to a boil; cook until the mixture reaches the soft ball stage, 235 degrees F.", 
            "Remove from the heat, stir in the butter, and pour the mixture over the cereal. Working quickly, stir until the cereal is thoroughly coated, then pour it into the prepared pan. Using your hands, press the mixture into the bottom of the pan (do not press up the sides). Let the crust cool to room temperature while you make the next layer.", 
            "Make the milk chocolate peanut butter layer: In a large nonreactive metal bowl, stir together the chocolate and the peanut butter. Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is smooth. Remove the bowl from the pan and stir for about 30 seconds to cool slightly. Pour the mixture over the cooled crust. Put the pan in the refridgerator for 1 hour, or until the top layer hardens.", 
            "Make the chocolate icing: In a large nonreactive metal bowl, combine the chocolate, corn syrup, and butter.", 
            "Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is completely smooth. Remove the bowl from the pan and stir for 30 seconds to cool slightly. Pour the mixture over the chilled milk chocolate peanut butter layer and spread (actually, I found it easier to just roll it around until it coated smoothly, avoiding the risk of picking up any of the peanut butter layer with it) into an even layer. Put the pan into the refrigerator for 1 hour, or until the topping hardens.", 
            "Cut into 9 (they say, I say 16, at least!) squares and serve. The bars can be stored in the refrigerator, covered tightly, for up to 4 days.", 
            "Rate this:Do More:TwitterFacebookPinterestPrintEmail\t\t\t", 
            "For the crispy crust", 
            "1 3/4 cups crisped rice cereal", 
            "1/4 cup sugar", 
            "3 tablespoons light corn syrup", 
            "3 tablespoons unsalted (their recommendation) or salted (what I used, and liked) butter, melted", 
            "For the milk chocolate peanut butter layer", 
            "5 ounces good-quality milk (their recommendation) or semi-sweet (what I’d use next time) chocolate, coarsely chopped", 
            "1 cup creamy peanut butter", 
            "For the chocolate icing", 
            "3 ounces dark chocolate (60 to 72 percent cocoa), coarsely chopped", 
            "1/2 teaspoon light corn syrup", 
            "4 tablespoons (1/2 stick or 2 ounces) unsalted (their recommendation) or salted (what I used, and liked) butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peanut-butter-crispy-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Candy", 
            "Peanut Butter", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/10/peanut-butter-crispy-bars/", 
        "title": "peanut butter crispy bars", 
        "directions": [
            "Make the crispy crust: Lightly spray a paper towel with nonstick cooking spray and use it to rub the bottom and sides of an 8-inch square baking pan.", 
            "Put the cereal in a large bowl and set aside.", 
            "Pour 1/4 cup water into a small saucepan. Gently add the sugar and corn syrup (do not let any sugar or syrup get on the sides of the pan) and use a small wooden spoon to stir the mixture until just combined. Put a candy thermometer in the saucepan. Cook over medium-high heat and bring to a boil; cook until the mixture reaches the soft ball stage, 235 degrees F.", 
            "Remove from the heat, stir in the butter, and pour the mixture over the cereal. Working quickly, stir until the cereal is thoroughly coated, then pour it into the prepared pan. Using your hands, press the mixture into the bottom of the pan (do not press up the sides). Let the crust cool to room temperature while you make the next layer.", 
            "Make the milk chocolate peanut butter layer: In a large nonreactive metal bowl, stir together the chocolate and the peanut butter. Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is smooth. Remove the bowl from the pan and stir for about 30 seconds to cool slightly. Pour the mixture over the cooled crust. Put the pan in the refridgerator for 1 hour, or until the top layer hardens.", 
            "Make the chocolate icing: In a large nonreactive metal bowl, combine the chocolate, corn syrup, and butter.", 
            "Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is completely smooth. Remove the bowl from the pan and stir for 30 seconds to cool slightly. Pour the mixture over the chilled milk chocolate peanut butter layer and spread (actually, I found it easier to just roll it around until it coated smoothly, avoiding the risk of picking up any of the peanut butter layer with it) into an even layer. Put the pan into the refrigerator for 1 hour, or until the topping hardens.", 
            "Cut into 9 (they say, I say 16, at least!) squares and serve. The bars can be stored in the refrigerator, covered tightly, for up to 4 days."
        ], 
        "date": "2008-10-28T15:39:11+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (190 grams) smooth peanut butter", 
            "2/3 (135 grams) cup granulated sugar", 
            "1 large egg", 
            "1/4 teaspoon vanilla extra", 
            "A few pinches of flaky or coarse sea salt", 
            "3 ounces (85 grams) unsweetened chocolate, roughly chopped", 
            "1/2 cup (115 grams or 4 ounces) unsalted butter, plus extra for pan", 
            "1 1/4 cups (250 grams) granulated sugar", 
            "2 large eggs", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1/2 teaspoon flaky or heaped 1/4 teaspoon of coarse sea salt", 
            "2/3 cup (85 grams) all-purpose flour", 
            "1/4 cup (40 grams) semi- or bittersweet chocolate chips"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/peanut-butter-swirled-brownies.jpg?w=750", 
        "tags": [
            "Bars", 
            "Brownies/Blondies", 
            "Chocolate", 
            "Peanut Butter", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2017/03/peanut-butter-swirled-brownies/", 
        "title": "peanut butter swirled brownies", 
        "directions": [
            "Heat oven: To 350°F (175°C).", 
            "Line an 8-inch square baking pan with parchment and coat the bottom and sides with nonstick cooking spray or butter.", 
            "Make peanut butter batter: Whisk all ingredients in a bowl until smooth.\nMake brownie batter: In a medium heatproof bowl over gently simmering water, melt chocolate and butter together until only a couple unmelted bits remain. Off the heat, stir until smooth and fully melted. You can also do this in the microwave in 30-second bursts, stirring between each. Whisk in sugar, then eggs, one at a time, then vanilla and salt. Stir in flour with a spoon or flexible spatula.\nAssemble brownies: Spread a thin layer of brownie batter (about 1/3 of total batter, but no need to be exact) in bottom of prepared baking pan. Dollop peanut butter batter all over in big spoonfuls. Dollop remaining brownie batter in pan, aiming, if you can, between the peanut butter dollops. Use a butter knife to swirl the batters together in loose figure-8s. Sprinkle chips all over.\nBake: For 30 to 35 minutes, or until a toothpick inserted into the center comes out batter-free.\nTo keep: Brownies keep well at room temperature, in the fridge or freezer."
        ], 
        "date": "2017-03-17T11:46:13+00:00"
    }, 
    {
        "ingredient_list": [
            "For the base:", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 teaspoon freshly grated lemon zest", 
            "1/8 teaspoon table salt", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cut into chunks", 
            "1 cup (125 grams) flour", 
            "For the lemonade layer", 
            "1 cup (about 5 ounces or 140 grams) raspberries", 
            "2 large eggs", 
            "3/4 cup (150 grams) granulated sugar", 
            "1/4 cup freshly squeezed lemon juice; this should only require 2 lemons", 
            "1/3 cup (40 grams) all-purpose flour", 
            "Confectioners’ sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Citrus", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/08/pink-lemonade-bars/", 
        "title": "pink lemonade bars", 
        "directions": [
            "Preheat your oven to 350°F (180°C) and line an 8x8x2-inch baking pan with parchment, letting it extend up two sides. Butter or coat the bottom and sides with a nonstick spray and set the pan aside.", 
            "Make the base: In a food processor, pulse together the sugar, zest and salt until combined. Add the butter and pulse until it is evenly dispersed in the dough. Add the flour and pulse the machine until it’s just combined and the mixture is crumbly. Press the dough into the prepared pan and about 1/2-inch up the sides. Don’t worry about making this perfect; mine was an uneven mess and nobody can tell. Bake for 15 minutes, until lightly browned at edges. Let cool on a rack while you prepare the filling (though no need for it to be completely cool when you fill it). Leave oven on.", 
            "Make the pink lemonade layer: Puree the raspberries in your food processor until they’re as liquefied as they’ll get. I don’t even bother cleaning mine between steps, but I’m also probably lazier than you. Run the puree through a fine-mesh sieve, trying to press out all the raspberry puree that you can, leaving the seeds behind. I ended up with 1/3 cup strained puree; don’t worry if you get a smidge less.", 
            "In a medium bowl, whisk together the eggs, sugar and lemon juice until smooth. Whisk in 3 tablespoons of raspberry puree. Stir in flour. Pour into cooling crust and return pan to the oven, baking the bars until they’re set (they’ll barely jiggle) and slightly golden at the edges, about 25 to 30 minutes. Cool completely before cutting into rectangles. (You can speed this up in the fridge.)", 
            "I intended to cut mine into 32 2×1-inch rectangles but actually cut them into 28 2×1-ish rectangles. I like lemony bars small but you could also cut them into 16 2×2-inch squares. Dust with powdered sugar before serving. Store in fridge for up to a week."
        ], 
        "date": "2012-08-03T13:26:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (130 grams) all-purpose flour", 
            "1/2 cup (55 grams) sliced almonds, toasted or equivalent weight almond flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 teaspoon almond extract", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "2/3 cup (85 grams) all purpose flour", 
            "1/3 cup (packed) almond paste (about 3.5 ounces or half a 7-ounce tube)", 
            "1/3 cup (65 grams) light brown sugar", 
            "1/4 teaspoon fine sea or table salt", 
            "4 tablespoons (2 ounces or 55 grams) chilled unsalted butter, cut into cubes", 
            "1/4 cup (30 grams) sliced, toasted almonds", 
            "1 pounds plums (about 6 to 7), halved, pitted, thinly sliced", 
            "3 tablespoons granulated sugar", 
            "1 1/2 tablespoons cornstarch"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/plum-squares-with-marzipan-crumble.jpg?w=750", 
        "tags": [
            "Bars", 
            "Crumbles/Crisps", 
            "Photo", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/09/plum-squares-with-marzipan-crumble/", 
        "title": "plum squares with marzipan crumble", 
        "directions": [
            "Heat oven to 375 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.\nMake the crust: Combine the flour, almonds, salt, sugar and extract in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.\nMake crumble: Blend flour, almond paste, sugar and salt in processor until almond paste is finely ground. Add butter and blend, using on/off turns, until coarse crumbs form. Transfer crumble to bowl; mix in almonds.\nMake filling: Combine all ingredients in medium bowl; toss to coat well.\nAssemble squares: Sprinkle 1/2 cup prepared crumble over cooled crust. Top with plum mixture. Sprinkle with remaining crumble.", 
            "Bake: Until filling bubbles thickly and top is golden, about 35 to 40 minutes. If the bars brown too quickly, cover them with foil for the remaining baking time. Cool in pan. I like to hurry this (too) along in the fridge or freezer. Once firm, I’ll use the parchment sling to remove the bars and cut them more cleanly on a cutting board. Dust with powdered sugar, if desired, before serving.\nDo ahead: These bars keep for up to a week in the fridge, longer in the freezer."
        ], 
        "date": "2016-09-01T07:33:56+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick) unsalted butter, plus more for pan", 
            "6 ounces bittersweet chocolate, chopped", 
            "2 cups all-purpose flour", 
            "1 teaspoon baking powder", 
            "1/8 teaspoon cayenne pepper", 
            "1/2 teaspoon salt", 
            "1 1/2 to 3/4 cups sugar (the original recipe calls for the larger amount; I think it could be dialed down a bit)", 
            "4 large eggs", 
            "1 tablespoon pure vanilla extract", 
            "1 1/4 cups solid-pack pumpkin", 
            "1/4 cup vegetable oil", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon ground nutmeg", 
            "1/2 cup chopped hazelnuts or other nuts (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pumpkin-swirl-brownies1.jpg?w=500", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Fall", 
            "Photo", 
            "Pumpkin"
        ], 
        "url": "https://smittenkitchen.com/2008/10/pumpkin-swirl-brownies/", 
        "title": "pumpkin swirl brownies", 
        "directions": [
            "1. Preheat oven to 350 degrees. Butter a 9-inch square baking pan or dish.  Cut a length of parchment that will cover the bottom and two sides (makes it much easier to remove), and line the pan with it. Butter the lining as well. (Deb note: I used an 8-inch square, because it was what I had. It works, too, but the brownies are crazy thick and take much longer to bake, just to give you a heads-up.)", 
            "2. Melt chocolate and butter in a heatproof bowl set over a pan of simmering water, stirring occasionally until smooth.", 
            "3. Whisk together flour, baking powder, cayenne, and salt in a large bowl; set aside. Put sugar, eggs, and vanilla in the bowl of an electric mixer fitted with the paddle attachment; beat until fluffy and well combined, 3 to 5 minutes. Beat in flour mixture.", 
            "4. Pour half of batter (about two cups) into a separate bowl and stir chocolate mixture into it. If you find that it is a little thick (as mine was) add a little more batter (a few tablespoons or so) until it is more pourable. This is important because mine was quite thick, and the pumpkin half was quite thin, so I had trouble swirling the two together. ", 
            "5. In other bowl, stir in the pumpkin, oil, cinnamon, and nutmeg. Transfer half of chocolate batter to prepared pan smoothing top with a rubber spatula. Top with half of pumpkin batter. Repeat to make one more chocolate layer and one more pumpkin layer. Work quickly so batters don’t set.", 
            "6. With a small spatula or a table knife, gently swirl the two batters to create a marbled effect. Be sure to get your knife all the way to the bottom of the pan–I didn’t, and ended up with a chocolate base, not that it is such a bad thing. Sprinkle with nuts, if using.", 
            "7. Bake until set, 40 to 45 minutes. Let cool in pan on a wire rack. Cut into 16 squares. "
        ], 
        "date": "2008-10-17T12:00:57+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/raspberry-breakfast-bars.jpg?w=753", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Raspberries", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/09/raspberry-breakfast-bars/", 
        "title": "raspberry breakfast bars", 
        "directions": [
            "Make the crust and crumb: Preheat the oven to 350°F. Butter the bottom and sides of a 9-by-13-inch glass or light-colored metal baking pan. Put a long piece of parchment paper in the bottom of the pan, letting the parchment extend up the two short sides of the pan and overhang slightly on both ends. (This will make it easy to remove the bars from the pan after they have baked.) Butter the parchment.", 
            "Put the flour, brown sugar, oats, salt, baking powder, baking soda, and cinnamon in a food processor. Pulse in short bursts until combined. Add the butter and pulse until loose crumbs form.", 
            "Reserve 1 1/2 cup of the mixture and set aside. (Note: The book suggests you reserve one cup only. My gut told me that was too little, and I upped it. I wanted to make sure the top of the raspberries were mostly covered, at least for packing purposes, and was glad I had changed it.) Pour the rest of the mixture into the prepared pan and use your hans or the back of a large wooden spoon to push the crust into an even layer at the bottom of the pan. The crust should touch the sides of the pan. Bake until golden brown, 12 to 15 minutes. Transfer to a wire rack and let the crust cool. Keep the oven on while you make the raspberry filling.", 
            "Make the raspberry filling: In a medium bowl, whisk the sugar, lemon zest, cinnamon and flour together. Add the raspberries, lemon juice and butter and use your hands to toss gently until the raspberries are evenly coated.", 
            "Assemble and bake the bars: Spread the raspberry filling evenly on top of the cooled crust. Sprinkle the reserved crust mixture evenly on top of the filling.", 
            "Bake for 35 to 45 minutes, rotating the pan every 15 minutes, until the top is golden brown and the filling starts to bubble around the edges.", 
            "Transfer to a wire rack to cool completely, then cut into squares and serve. The bars can be stored in the refrigerator in an airtight container for up to two days."
        ], 
        "date": "2008-09-02T15:50:41+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces (113 grams) unsalted butter, plus extra for the pan", 
            "1 10-ounce (285-gram) bag marshmallows", 
            "Heaping 1/4 teaspoon coarse sea salt", 
            "6 cups (160 grams) crispy rice cereal (about half a 12-ounce box)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/salted-brown-butter-crispy-treats.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Candy", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2009/11/salted-brown-butter-crispy-treats/", 
        "title": "salted brown butter crispy treats", 
        "directions": [
            "Butter (or coat with non-stick spray) an 8-inch square cake pan with 2-inch sides.", 
            "In a large pot, melt butter over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as while you may be impatient for it to start browning, the period between the time the butter begins to take on color and the point where it burns is often less than a minute.", 
            "As soon as the butter takes on a nutty color, turn the heat off and stir in the marshmallows. The residual heat from the melted butter should be enough to melt them, but if it is not, turn it back on low until the marshmallows are smooth.", 
            "Remove the pot from the stove and stir in the salt and cereal together. Quickly spread into prepared pan. I liked to use a piece of waxed or parchment paper that I’ve sprayed with oil to press it firmly and evenly into the edges and corners, though a silicon spatula works almost as well.", 
            "Let cool, cut into squares and get ready to make new friends. "
        ], 
        "date": "2009-11-02T13:52:13+00:00"
    }, 
    {
        "ingredient_list": [
            "Caramel", 
            "1/2 cup granulated sugar", 
            "4 tablespoons unsalted butter (or salted, but then ease up on the sea salt)", 
            "Heaped 1/4 teaspoon flaky sea salt (or 1/8 teaspoon table salt, more to taste)", 
            "3 tablespoons heavy cream", 
            "Brownie", 
            "3 ounces (85 grams) unsweetened chocolate, roughly chopped", 
            "1 stick (4 ounces or 115 grams) unsalted butter, plus extra for pan", 
            "1 cup (200 grams) granulated sugar", 
            "2 large eggs", 
            "1 teaspoon (5 ml) vanilla extract", 
            "Heaped 1/4 teaspoon flaky sea salt or 1/8 teaspoon table salt", 
            "2/3 cup (85 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/02/salted-caramel-brownies1.jpg?w=750", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/02/salted-caramel-brownies/", 
        "title": "salted caramel brownies", 
        "directions": [
            "Make caramel: Set a square of parchment paper over a medium-sized plate. Lightly butter or coat the parchment with a spray oil, just as an added security measure. ", 
            "In a medium, dry saucepan over medium-high heat, melt your sugar; this will take about 5 minutes, stirring if necessary to break up large chunks. By the time it is all melted, if should be a nice copper color; if not, cook until it is. Remove from heat and stir in butter. It may not incorporate entirely but do your best. Stir in cream and salt and return saucepan to the stove over medium-high heat, bringing it back to a simmer and melted again any sugar that solidified. Cook bubbling caramel for a few minutes more, until it is a shade darker. ", 
            "Pour out onto parchment-covered plate and transfer plate to your freezer. Freeze until solidified, which can take anywhere from 20 to 30 minutes in a decent freezer to 40 minutes in my terrible one.", 
            "Meanwhile, or when your caramel is almost firm, make your brownies: Heat oven to 350°F. Line an 8×8-inch square baking pan with parchment, extending it up two sides. Butter the parchment or spray it with a nonstick cooking spray.", 
            "In a medium heatproof bowl over gently simmering water, melt chocolate and butter together until only a couple unmelted bits remain. Off the heat, stir until smooth and fully melted. You can also do this in the microwave in 30-second bursts, stirring between each. Whisk in sugar, then eggs, one at a time, then vanilla and salt. Stir in flour with a spoon or flexible spatula.", 
            "Assemble brownies: When caramel is firm, remove it from the freezer and chop it into rough 1-inch squares. Gently fold all but a small amount of caramel bits into batter. Scrape batter into prepared pan, spreading until mostly even. Scatter remaining caramel bits on top. Bake in heated oven for 30 minutes, until a toothpick inserted into the center comes out clean. ", 
            "Cool thoroughly — a process that can be hastened in the freezer, which will also produce cleaner cuts — and cut into squares or other desired shapes."
        ], 
        "date": "2013-02-07T11:33:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (80 grams) rolled oats", 
            "3/4 cup (95 grams) plus up to 2 tablespoons (15 grams) extra all-purpose flour", 
            "1/2 cup (95 grams) light brown sugar", 
            "Heaped 1/4 teaspoon table salt", 
            "6 tablespoons (85 grams) unsalted butter, melted", 
            "1 teaspoon cornstarch (optional, but helps firm up the filling)", 
            "1 tablespoon (15 ml) lemon juice", 
            "1 tablespoon (15 grams) granulated sugar, divided", 
            "1 cup (125 grams) small-diced rhubarb (from about 1 1/2 medium stalks)", 
            "1 cup (155 grams) small-diced strawberries", 
            "Powdered sugar, for decoration, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/strawberry-rhubarb-crisp-bars1.jpg?w=640", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Crumbles/Crisps", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Rhubarb", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/05/strawberry-rhubarb-crisp-bars/", 
        "title": "strawberry rhubarb crisp bars", 
        "directions": [
            "Heat oven to 375 degrees F. For easy removal, line bottom and two sides of 8-by-8-inch square baking pan with parchment paper. No need to bother (and no greasing needed) if you plan to serve them right in the pan, as I did. ", 
            "Place oats, 3/4 cup flour, brown sugar and salt in bottom of baking pan and mix. Pour melted butter over, and stir until clumps form. If the clumps feel soft or look overly damp, add the remaining 2 tablespoons flour. Set aside 1/2 cup of the crumble mixture. Press the rest of the crumb mixture evenly in the bottom of the pan.", 
            "Spread half the fruit over the crust. Sprinkle it evenly with cornstarch, then lemon juice, and 1/2 tablespoon of granulated sugar. Spread remaining fruit over this, and top with second 1/2 tablespoon sugar. Scatter reserved crumbs over fruit and bake bars for 30 to 40 minutes (firmer fruits will take longer), until fruit is bubbly and crisp portion is golden and smells toasty and amazing. ", 
            "Let cool in pan; I do this in the fridge, where they become crisp once chilled (less so at room temperature). Cut into squares and sprinkle with powdered sugar before serving. Store leftovers in fridge."
        ], 
        "date": "2014-05-09T11:20:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon extra-virgin olive oil, once around the pan in a slow stream", 
            "1 tablespoon butter", 
            "2 cloves garlic, minced", 
            "2 shallots, minced", 
            "1 cup vodka", 
            "1 cup chicken stock", 
            "1 can crushed tomatoes (32 ounces)", 
            "Coarse salt and pepper", 
            "16 ounces pasta, such as penne rigate", 
            "1/2 cup heavy cream", 
            "20 leaves fresh basil, shredded or torn ", 
            "9 ounces bittersweet chocolate (60 – 64% cacao)", 
            "1 cup plus 2 tablespoons butter, cut into small pieces", 
            "5 eggs, beaten lightly with a fork", 
            "1 1/3 cups superfine sugar", 
            "3 tablespoons pastry flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-abhorred-and-the-adored1.jpg?w=500", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Pasta", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/08/the-abhorred-and-the-adored/", 
        "title": "penne à la vodka + belgian brownies", 
        "directions": [
            "1. Roughly chop the chocolate into pieces. Transfer to a medium-sized bowl and add the butter. Place the bowl over a saucepan of simmering water, until the two ingredients have melted. Mix well and transfer to a large bowl; set aside.", 
            "2. Preheat the oven to 325°F. Sift the sugar and flour together, then stir into the chocolate. Add the eggs and mix well. Cover and let rest at room temperature for 30 minutes. The batter will thicken as it stands.", 
            "3. Line a muffin tin with cupcake papers. Spoon one-fourth cup batter into each paper-lined cup. Bake 30 to 35 minutes. The brownies will still be moist when done; they will puff up and fall slightly as they cool."
        ], 
        "date": "2006-08-29T15:58:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/4 cups (155 grams) all-purpose flour", 
            "1 teaspoon (5 grams) table salt", 
            "2 tablespoons (10 grams) dark unsweetened cocoa powder", 
            "1 to 1 1/2 teaspoons chipotle powder (I didn’t have this and used smoky spicy paprika, with a very similiar flavor profile, instead) (for the spicy version)", 
            "3/4 teaspoon cinnamon (for the spicy version)", 
            "1/4 teaspoon cardamom (for the spicy version)", 
            "11 ounces (310 grams) dark chocolate (60 to 72% cacao), coarsely chopped", 
            "1 cup (2 sticks, 8 ounces or 225 grams) unsalted butter, cut into 1-inch pieces", 
            "1 teaspoon instant espresso powder", 
            "1 1/2 cups (300 grams) granulated sugar", 
            "1/2 cup (105 grams) firmly packed light brown sugar", 
            "5 large eggs, at room temperature", 
            "2 teaspoons (10 ml) pure vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-baked-brownie-spiced-up1.jpg?w=500", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/09/the-baked-brownie-spiced-up/", 
        "title": "the baked brownie, spiced up", 
        "directions": [
            "Preheat the oven to 350 degrees F. Butter the sides and bottom of a 9 x 13 glass or light-colored metal baking pan.", 
            "In a medium bowl, whisk the flour, salt, cocoa powder and spices (chipotle, cinnamon and cardamom), if you’re using them,  together.", 
            "Put the chocolate, butter, and instant espresso powder in a large bowl and set it over a saucepan of simmering water, stirring occasionally, until the chocolate and butter are completely melted and smooth.  Turn off the heat, but keep the bowl over the water and add the sugars. Whisk until completely combined, then remove the bowl from the pan. The mixture should be room temperature.", 
            "Add 3 eggs to the chocolate mixture and whisk until combined. Add the remaining eggs and whisk until combined. Add the vanilla and stir until combined. Do not overbeat the batter at this stage or your brownies will be cakey.", 
            "Sprinkle the flour mixture over the chocolate mixture. Using a spatula (not a whisk), fold the flour mixture into the chocolate until just a bit of the flour mixture is visible.", 
            "Pour the batter into the prepared pan and smooth the top. Bake in the center of the oven for 30 minutes, rotating the pan halfway through the baking time, until a toothpick inserted into the center of the brownies comes out with a few moist crumbs sticking to it. Let the brownies cool completely, then cut them int osquares and serve.", 
            "Tightly covered with plastic wrap, the brownies keep at room temperature for up to 3 days."
        ], 
        "date": "2008-09-05T09:11:42+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (4 ounces or 115 grams) unsalted butter", 
            "4 ounces (115 grams) unsweetened chocolate, chopped", 
            "1 cup (190 grams) dark or light brown sugar", 
            "2 tablespoons (25 grams) granulated sugar", 
            "2 large eggs", 
            "1 teaspoon vanilla extract", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon fine sea or table salt", 
            "1/2 cup (45 grams) unsweetened cocoa powder, any kind will work", 
            "1 cup (130 grams) all-purpose flour", 
            "2/3 cup (115 grams) chocolate chips or bitter- or semisweet chocolate, chopped into chunks"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/the-browniest-cookies1.jpg?w=640", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/12/the-browniest-cookies/", 
        "title": "the browniest cookies", 
        "directions": [
            "Melt butter and unsweetened chocolate together — you can do this on the stove over very low heat, stirring constantly, in a double-boiler or in the microwave in 30-second bursts, stirring between each — and taking the chocolate out when it’s almost, but not fully, melted. Off the heat, stir until it is. ", 
            "Whisk sugars into melted butter and chocolate, then eggs, one at a time, then vanilla. Whisk in baking soda and salt. If your cocoa powder is lumpy, sift it right onto the surface of the batter, other wise, just add it to the bowl. Add flour, too, and then stir until just combined. Add chips or chocolate chunks and stir until combined.", 
            "Place bowl in the fridge for about 30 minutes, and up to a few days. Shorter than 30 minutes, you can bake it right away but they keep better shape once chilled and are easier to scoop. Longer than 30 minutes, they become difficult to scoop, but you can let them warm up slightly before you do.", 
            "Heat oven to 350°F (175°C). ", 
            "Scoop into about 1 1/2- to 2-tablespoon sized mounds and space evenly on parchment- or nonstick baking mat-lined baking sheets, allowing room for them to spread a little. Bake for 11 to 12 minutes, at which point they will still definitely look underbaked, but you should take them out if a fudgy-centered cookie is your goal. (Of course it is!) Let set on baking sheets for a few minutes before carefully transferring to a rack to cool the rest of the way before eating. Ha ha, just kidding. You can eat one right away, but you’ll probably want a glass of milk nearby.", 
            "Do ahead: The cookie dough keeps in the fridge for up to a week and longer in the freezer. If you’d like to turn these into a slice-and-bake cookie, after 20 to 30 minutes in the fridge, scrape dough onto a sheet of parchment or waxed paper and form into a 1 1/2- to 2-inch thick log. Wrap in plastic and freeze until needed. Be sure to cut them on the thick side before baking, so your cookie isn’t too flat. "
        ], 
        "date": "2015-12-16T14:59:33+00:00"
    }, 
    {
        "ingredient_list": [
            "3 ounces (85 grams) semisweet or good white chocolate*, coarsely chopped", 
            "1 stick (4 ounces or 113 grams) unsalted butter, plus extra for greasing pan", 
            "3/4 cup plus 2 tablespoons (6 1/8 ounces or 175 grams) sugar", 
            "2 large eggs", 
            "1 teaspoon (5 ml) vanilla", 
            "1/4 teaspoon table salt or 1/2 teaspoon flaky salt (about 2 grams)", 
            "2/3 cup (83 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/white-and-dark-hearted-brownies.jpg?w=750", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Elsewhere", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/02/white-and-dark-hearted-brownies/", 
        "title": "white and dark hearted brownies", 
        "directions": [
            "1-inch heart or other shaped cookie cutter", 
            "Preheat oven to 350°F. Line an 8×8-inch square baking pan with foil, with ends of foil extending over opposite sides of pan. Repeat with second piece of foil in opposite direction. Butter foil.", 
            "Melt white or dark chocolate and butter together in a large bowl over a simmering pot of water (or in the microwave in 30 second bursts, stirring between each) until it is 90% melted; remove from heat and stir the mixture until it is smooth. (I do this too keep things from getting too hot.) Whisk in sugar. Whisk in eggs, one at a time, then vanilla. Add flour and salt together, stirring until just combined. Spread into prepared pan and bake for 25 to 30 minutes (for the dark chocolate version) and 30 to 35 minutes (for the white chocolate version).", 
            "Repeat this recipe with the other kind of chocolate and a second 8×8-inch square pan. If you don’t have two matching square pans (understandably) simply wait until you can remove your brownies from the pan as directed in the next step, and start again.", 
            "Cool pans on a wire rack in the freezer if you’re going to make cut-outs; frozen brownies are much easier to  make clean cuts from. Once solid, transfer brownies in their foil “sling” to a large cutting board and cut each pan of brownies into 16 even squares, about 2×2 inches each. Still cold (and if they warm up and soften too quickly, pop them back in the freezer for 5 minutes), carefully, slowly, gently, press your cookie cutter into the center of each brownie and set the cut-out aside. Insert the dark cut-outs into the centers of the light brownies, and vice-versa. From here, you can let them warm up to room temperature or wrap them up in the freezer until you will need them.", 
            "* I generally dislike the qualifier “good” in recipes; it suggests that if you don’t use the very! best! olive oil, butter, wine, etc. your recipe will be terrible. Feh. But good white chocolate is a world apart from the cheap stuff. Namely, it is white chocolate, and not “white baking chips” which will melt into a yellow-oiled chunky… ugh, trust me. You’ll be glad you used something better. "
        ], 
        "date": "2011-02-11T10:25:26+00:00"
    }
]