{
  "date": "2006-11-06T17:25:43+00:00",
  "directions": [
    "1.\tBring reserved shells, 3 cups water and salt to boil in medium saucepan over medium-high head; reduced heat to low; cover, and simmer until fragrant, about 20 minutes. Strain stock through sieve, pressing on shells to extract all liquid.",
    "2.\tBring stock and remaining ingredients except shrimp to boil in 3- or 4-quart saucepan over high heat; boil 2 minutes. Turn off heat and stir in shrimp; cover and let stand until firm and pink, 8 to 10 minutes. Drain shrimp, reserving stock for another use. Plunge shrimp into ice water to stop coking, then draining again. Serve shrimp chilled with cocktail sauce.",
    "1. Heat the oil in a large saute pan. Add the bread and salt; cook over low to medium heat, tossing frequently, for 10 minutes, or until nicely browned. Add more oil as needed.",
    "2. For the vinaigrette, whisk together the ingredients.",
    "3. In a large bowl, mix the tomatoes, cucumber, red pepper, yellow pepper, red onion, basil, and capers. Add the bread cubes and toss with the vinaigrette. Season liberally with salt and pepper.",
    "4. Serve immediately, or allow the salad to sit for about half an hour for the flavors to blend."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/when-the-stars-make-you-drool1.jpg?w=500",
  "ingredient_list": [
    "1 pound very large (16 to 20 per pound) shrimp, peeled, de-veined, and rinsed, shells reserved",
    "1 teaspoon salt",
    "1 cup dry white wine",
    "4 peppercorns",
    "5 coriander seeds",
    "1/2 bay leaf",
    "5 sprigs fresh parsley",
    "1 sprig fresh tarragon",
    "1teaspoon juice from 1 small lemon",
    "1 cup ketchup",
    "2 1/2 teaspoons prepared horseradish (I believed we used slightly more)",
    "1/4 teaspoon salt",
    "1/4 teaspoon ground black pepper",
    "1 teaspoon ancho or other mild chili powder",
    "Pinch cayenne pepper",
    "1 tablespoon juice from 1 small lemon",
    "3 tablespoons good olive oil",
    "1 small French bread or boule, cut into 1-inch cubes (6 cups)",
    "1 teaspoon kosher salt",
    "2 large ripe tomatoes, cut into 1-inch cubes",
    "1 hothouse cucumber, unpeeled, seeded, and sliced 1/2 inch thick",
    "1 red bell pepper, seeded and cut into 1-inch cubes",
    "1 yellow bell pepper, seeded and cut into 1-inch cubes",
    "1/2 red onion, cut in half and thinly sliced",
    "20 large basil leaves, coarsely chopped",
    "3 tablespoons capers, drained",
    "1 lemon",
    "4 small\tartichokes",
    "2/3 cup\theavy cream",
    "1 teaspoon garlic, finely chopped (about 1 medium clove)",
    "1 teaspoon kosher salt",
    "1/2 teaspoon ground white pepper",
    "2 tablespoons olive oil",
    "6 medium Yukon Gold potatoes",
    "4 ounces Asiago cheese, grated (I used cave-aged Gruyere, because it’s my favorite)"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Artichokes",
    "Photo",
    "Potatoes",
    "Salad",
    "Seafood",
    "Side Dish"
  ],
  "title": "shrimp cocktail + artichoke-potato gratin",
  "url": "https://smittenkitchen.com/2006/11/when-the-stars-make-you-drool/"
}