{
  "date": "2015-10-19T12:07:15+00:00",
  "directions": [
    "Heat oven to 425°F. Pierce potatoes all over with a fork and rub with 1 tablespoon olive oil. Place on rack and bake for 1 hour, or until tender in center when pierce with a skewer.",
    "Meanwhile, in a large, deep skillet, melt the 2 tablespoons butter with 2 tablespoons olive oil over medium heat. Add the onion and garlic and sauté until softened, about 8 minutes. Turn heat to high, add mushrooms, salt and pepper and cook until the mushrooms brown, then release their juices and cook them off, about 10 minutes. Add wine, if using, scrape up any bits stuck to pan. Cook until evaporated. Add broth and thyme and bring to a simmer. Stir in final tablespoon of butter until melted. Adjust seasonings to taste.",
    "Slit the potatoes and fluff the insides with a fork. Sprinkle with a little salt and pepper, a few goat cheese crumbles, a ladleful of the mushrooms and chives. Serve with extra mushrooms and goat cheese on the side."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/baked-potatoes-with-wild-mushroom-ragu1.jpg?w=750",
  "ingredient_list": [
    "4 baking potatoes (about 2 pounds)",
    "3 tablespoons olive oil, divided",
    "3 tablespoons butter, divided",
    "1 small white onion, finely chopped",
    "2 garlic cloves minced",
    "1 1/2 pounds mixed mushrooms, wild are wonderful, but sliced cremini or white mushrooms will also work",
    "Salt and freshly ground pepper",
    "1/2 cup white wine or vermouth, or 1/4 cup sherry or marsala (optional)",
    "1/2 cup vegetable or beef broth, plus a splash or two extra if needed",
    "1/2 teaspoon chopped thyme",
    "4 ounce-log soft goat cheese",
    "1 tablespoon minced fresh chives or flat-leaf parsley, to finish"
  ],
  "tags": [
    "Fall",
    "Mushrooms",
    "Photo",
    "Potatoes",
    "Side Dish",
    "Vegetarian",
    "Weeknight Favorite",
    "Winter"
  ],
  "title": "baked potatoes with wild mushroom ragù",
  "url": "https://smittenkitchen.com/2015/10/baked-potatoes-with-wild-mushroom-ragu/"
}