{
  "date": "2014-10-23T12:03:07+00:00",
  "directions": [
    "Heat oven to 400 degrees.",
    "Trim cauliflower and remove tough core. Cut into 1 to 2-inch florets. Steam (for about 10 minutes) or par-boil (6 to 7 minutes) florets until firm but tender. Drain, if needed, and spread florets on a towel so that it can wick out as much moisture as possible",
    "Meanwhile, in a medium saucepan, melt butter over medium-high heat. Add flour and whisk to combine; cook for 1 minute to ensure you get rid of the floury taste. Add mustard powder and a pinch of cayenne or few grinds of black pepper, and stir to combine. Drizzle in milk in a thin, steady stream, whisking the whole time so that no lumps form. Season with salt and bring mixture to a simmer, stirring with a spoon; mixture should thicken. Stir in 1 1/4 cups cheddar, a handful at a time, letting each handful melt before adding the next. Taste sauce and adjust seasonings if needed.",
    "Spread cauliflower florets in a 2-quart baking ovenproof baking dish. Spoon sauce over florets and sprinkle with remaining 2 tablespoons cheese. Bake until until bronzed and bubbly, about 30 minutes. For reference, f I wasn’t in such a rush to get dinner out on the table, I’d have baked mine a minute or two longer, up to 35 minutes.",
    "Sprinkle with herbs, if desired. Eat with abandon.",
    "P.S. A hat tip to Kate, who reminded me earlier this week that this site is way overdue for cauliflower cheese, and immediately solving my what-to-make-for-dinner crisis du jour."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-cheese1.jpg?w=640",
  "ingredient_list": [
    "1 medium head (about 2 to 2 1/4 pounds) cauliflower",
    "4 tablespoons (55 grams or 2 ounces) unsalted butter",
    "4 tablespoons (30 grams or 1 ounce) all-purpose flour",
    "2 teaspoons mustard powder",
    "Salt, to taste",
    "Freshly ground black pepper or ground cayenne",
    "2 cups (475 ml) milk, whole is best but low-fat will probably work just fine",
    "1 1/4 cups plus 2 tablespoons (about 155 grams or 5 1/2 ounces total) grated cheddar, the strongest you can get, preferably English or Irish",
    "Chopped chives or flat-leaf parsley, for garnish (optional)"
  ],
  "tags": [
    "British",
    "Cauliflower",
    "Photo",
    "Side Dish",
    "Thanksgiving",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "cauliflower cheese",
  "url": "https://smittenkitchen.com/2014/10/cauliflower-cheese/"
}