{
  "date": "2016-08-02T12:03:04+00:00",
  "directions": [
    "Heat your oven to 500°F with a rack in the center. Brush either 1 13×18-inch rimmed half-sheet pan or 2 9×13-inch quarter-sheet pans (as I do) with olive oil. Divide your dough in half and use oiled fingertips to pull, stretch, nudge and press the dough across the bottom of the pan. The dough will be thin and imperfect; just try to get it even. If holes form, just pinch them together.",
    "Use a food processor with a grater attachment or the large holes of a box grater to grate the zucchini. In a large bowl, toss together the zucchini and salt. Let stand for 20 to 30 minutes (more, if you have the time), until the zucchini has wilted and released its water. Drain the zucchini in a colander and then use your hands to squeeze out as much water as possible, a fistful at a time. Back in the large bowl (wiped out if still wet), toss the zucchini with the gruyere shreds, being sure to break up any clumps of zucchini. Taste the mixture; it should be seasoned enough from the salt, but you can add more, plus ground pepper or pepper flakes if desired.\nSpread the zucchini mixture over the dough(s), going all the way to the edges of the pan and piling it a bit thicker at the edges, where it will brown first. Sprinkle messily with the bread crumbs.\nBake for 20 to 25 minutes, until the topping is golden. Remove from oven, cut into squares and dig in."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_4477.jpg?w=750",
  "ingredient_list": [
    "1 tablespoon olive oil, plus more for fingertips",
    null,
    "2 1/2 pounds (about 5 small-medium or 3 large) zucchini or other summer squash, trimmed",
    "1 1/2 teaspoons fine sea salt",
    "2 cups (8 ounces) coarsely grated gruyere cheese",
    "2 to 3 tablespoons plain breadcrumbs"
  ],
  "tags": [
    "Photo",
    "Pizza",
    "Summer",
    "Summer Squash",
    "Vegetarian",
    "Weeknight Favorite",
    "Zucchini"
  ],
  "title": "summer squash pizza",
  "url": "https://smittenkitchen.com/2016/08/summer-squash-pizza/"
}