{
  "date": "2008-04-21T16:27:14+00:00",
  "directions": [
    "2. Place the almond paste and sugar in the bowl of a heavy-duty mixer fitted with the paddle attachment, or in another large bowl if using a handheld mixer. Begin to cream the mixture on low speed to break up the almond paste, then increase the speed to medium for about 2 minutes, or until the paste is broken into fine particles.",
    "3. Add the butter and mix for 4 to 5 minutes, or until the mixture is light in color and airy; stop the machine and scrape down the sides as necessary. It is important to mix long enough or the cake will have a dense texture.",
    "4. Mix in the honey, then add the eggs one at a time, beating until each one is fully incorporated before adding the next. Add the amaretto, flour, and a pinch of salt and mix just to combine.",
    "5. Scrape the batter into the prepared pan(s) and smooth the top. Bake the small cakes for about 15 minutes, the large one for about 25 minutes, or until the cake is golden and springs back when pressed. Transfer to a rack to cool.",
    "6. Unmold the small cakes or invert the large cake onto the rack, remove the parchment paper, and invert the cake again so that the top is once again facing upward. Brush the top of the cake(s) with amaretto and sprinkle with the toasted almonds. Dust with confectioners’ sugar. (The large and small cakes can be stored, well wrapped, at room temperature for up to 2 days.) To serve, cut the small cakes in half or the large cake into wedges. Serve with a dollop of whipped crème fraîche and the strawberry-rhubarb compote."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/almond-cake-with-strawberry-rhubarb-compote1.jpg?w=500",
  "ingredient_list": [
    "For the compote",
    "1 pound strawberries, rinsed and hulled",
    "1 pound rhubarb, trimmed",
    "1 lemon",
    "3/4 cup granulated sugar",
    "For the almond cake",
    "Butter and flour for the pan(s)",
    "7 ounces almond paste",
    "1/4 cup granulated sugar",
    "4 ounces unsalted butter, cut into small pieces and chilled",
    "2 tablespoons honey",
    "3 large eggs",
    "2 tablespoons amaretto, plus additional for brushing",
    "1/3 cup all-purpose flour, sifted (we used matzo meal with success, though finely grinding it first would have been a better idea)",
    "Kosher salt",
    "1/3 to 1/2 cup sliced almonds, toasted",
    "Confectioners’ sugar",
    "3/4 cup crème fraîche, whipped to soft peaks     ",
    "Make the compote",
    "1. Select about 4 ounces of the smallest strawberries and cut lengthwise into quarters. These will be added raw to the cooked compote; set aside.",
    "Make the cake",
    "1. Preheat the oven to 350°F (175°C). Butter and flour four 4-by-1 3/4-inch-high miniature springform pans or butter and flour the bottom and sides of an 8-inch round cake pan. If using the 8-inch pan, line its bottom with a circle of parchment paper; this isn’t necessary with the small pans."
  ],
  "tags": [
    "Cake",
    "Easter",
    "Everyday Cakes",
    "Fruit",
    "Passover",
    "Photo",
    "Rhubarb",
    "Strawberries"
  ],
  "title": "almond cake with strawberry-rhubarb compote",
  "url": "https://smittenkitchen.com/2008/04/almond-cake-with-strawberry-rhubarb-compote/"
}