{
  "date": "2009-05-08T14:14:38+00:00",
  "directions": [
    "In the bowl of a food processor, combine the flour, sugar, baking powder, egg yolks, and salt. Pulse to combine. Add the butter and pulse until the flour resembles coarse meal. Add 2/3 cup of cream and pulse until the dough comes together. Turn the dough onto a lightly floured surface and gently pat it together, incorporating any stray crumbs.",
    "Using a small ice cream scoop or a large spoon*, form the dough into 2-inch balls, then flatten them slightly into thick rounds. Chill for 20 minutes (and up to 2 hours). Preheat oven to 350 degrees. Put the rhubarb in a shallow 21/2- quart casserole dish and toss with sugar, vanilla, and cornstarch. Allow to macerate 15 minutes.",
    "Arrange the biscuit rounds on top, leaving about an inch between them. Brush the biscuits with cream and sprinkle with turbinado sugar. Bake the cobbler until the rhubarb is bubbling and the biscuits are golden brown, about 40 to 45 minutes. Serve with ice cream or crème fraîche.",
    "* I haven’t unearthed my scoops yet, but I did find some cookie cutters, so I simply patted my dough out on a floured surface and cut them instead. Besides, who doesn’t like flower-shaped biscuits?"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/rhubarb-cobbler1.jpg?w=500",
  "ingredient_list": [
    "For dough",
    "1 2/3 cups all-purpose flour",
    "3 1/2 tablespoons sugar",
    "1 tablespoon plus 1/2 teaspoon baking powder",
    "2 hard-boiled egg yolks",
    "1/8 teaspoon salt",
    "6 tablespoons cold unsalted butter, cut into 1/2-inch cubes",
    "2/3 cup plus 1 tablespoon heavy cream",
    "For rhubarb",
    "2 pounds rhubarb, trimmed and cut into 1/2-inch pieces (about 6 cups)",
    "1/2 cup sugar",
    "1-inch piece of vanilla bean, split lengthwise, pulp scraped",
    "2 tablespoons cornstarch",
    "1 tablespoon turbinado sugar"
  ],
  "tags": [
    "Crumbles/Crisps",
    "Fruit",
    "Photo",
    "Rhubarb"
  ],
  "title": "rhubarb cobbler",
  "url": "https://smittenkitchen.com/2009/05/rhubarb-cobbler/"
}