{
  "date": "2010-06-24T14:59:40+00:00",
  "directions": [
    "Preheat oven to 400 degrees. On a well-floured counter, roll half of pie dough into a 12-inch circle and carefully transfer to a 9-inch pie plate.  (I like to fold my gently into quarters, to transfer it more easily, then unfold it in the pie plate.)",
    "Stir together rhubarb, strawberries, sugars, lemon, salt and tapioca in a large bowl. Mound filling inside bottom pie crust and dot with bits of unsalted butter. Roll second half of pie dough into an 11-inch circle and cut decorative slits in it. Transfer it to center over the pie filling. Trim top and bottom pie dough so that their overhang beyond the pie plate lip is only 1/2-inch.  Tuck rim of dough underneath itself and crimp it decoratively.",
    "Transfer pie to a baking sheet and brush egg yolk mixture over dough. Bake for 20 minutes then reduce temperature to 350 degrees and bake for an additional 25 to 30 minutes, until the pie is golden and the juices bubble visibly.",
    "Transfer pie to wire rack to cool. When full cool (several hours later) the juices gel.",
    "Do ahead:  Pie should keep for up to three days at room temperature but I have never, ever seen one last that long."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/strawberry-rhubarb-pie.jpg?w=750",
  "ingredient_list": [
    "1 recipe All Butter, Really Flaky Pie Dough or double-crust pie dough of your choice",
    "3 1/2 cups (about 1 1/2 pounds, untrimmed) rhubarb, in 1/2-inch thick slices",
    "3 1/2 cups (about 1 pound) strawberries, hulled and sliced if big, halved if tiny",
    "1/2 cup granulated sugar",
    "1/4 cup light brown sugar",
    "1 tablespoon lemon juice",
    "1/4 teaspoon salt",
    "1/4 cup quick-cooking tapioca",
    "2 tablespoons unsalted butter, cut into small pieces",
    "1 large egg yolk beaten to blend with 1 teaspoon water (for glaze)"
  ],
  "tags": [
    "Photo",
    "Rhubarb",
    "Spring",
    "Strawberries",
    "Tarts/Pies"
  ],
  "title": "strawberry-rhubarb pie, improved",
  "url": "https://smittenkitchen.com/2010/06/strawberry-rhubarb-pie-improved/"
}