{
  "date": "2007-06-26T18:46:18+00:00",
  "directions": [
    "1. Make cake layers: Preheat the oven to 325°F. Have two 9-inch round cake pans ready, lined with parchment paper that has been lightly sprayed with cooking spray, but otherwise ungreased. (Alternatively, this recipe yields on classic tube chiffon cake. Leave the cake pan ungreased, and use one with a removable bottom.)",
    "2. Sift the flour, 1 1/4 cups sugar, baking powder and salt together twice into a large bowl. ",
    "3. In a another bowl, beat the yolks, water, oil, zest and vanilla on high speed until smooth. Stir into the flour mixture until smooth. In another large bowl, or the bowl of your stand mixer, beat the egg whites with the cream of tartar until soft peaks are formed. Add the remaining 1/4 cup sugar, and beat on high speed until the peaks are stiff but not dry. ",
    "4. Use a rubber spatula to fold one-quarter of the egg whites into the egg yolk mixture, then fold in the remaining whites. Do so gently, only until the egg whites are no longer visible. Overdoing it will deflate the egg whites, and yield a denser, shorter cake. ",
    "5. Scrape the batter into the two prepared pans and spread evenly. (If you are needling and fussy, you can weigh them to make sure they are even, something I would never do, oh no.) Bake them until the top springs back when lightly pressed and a toothpick inserted into the center comes out clean 40 to 50 minutes (or 55 to 65 for the tube pan). (Please, do me a favor and check your cake every five minutes or so from the 30 minute mark on, as I confess I never wrote down the exact baking time for the 9″ circles, but am pretty sure it was 45 minutes in my oven. M’kay?)",
    "6. Let cakes cool on a cooling rack for at least an hour (or, if in a tube pan, upside down over a bottleneck or resting the pan on four glasses for at least 1 1/2 hours).  When completely cool, run a knife around the sides to release, then flip out onto a plate (or your hand, if you’re daring) and then another plate. ",
    "7. Make the whipped cream: Beat heavy cream, powdered sugar and vanilla extract in a clean mixing bowl until it holds stiff peaks.",
    "8. Assemble the cake: Carefully split each cake layer in half, leaving you with four cake surfaces. One by one, scoop one-quarter of the whipped cream onto the surface of the cake and spread it evenly to the edges, without going over, with an offset spatula. Arrange one-quarter of the sliced strawberries over the whipped cream in one or two layers, depending on your preference. (If you use only one layer, you’ll likely have leftovers.) Repeat with the remaining three layers. If you have any leftover whipped cream, you can pipe it decoratively over the top, or, uh, scoop it up with those leftover strawberries. I won’t tell.",
    "9. The cake can refrigerated for a few hours before eating it. In fact, as some of the moisture from the whipped cream and berries seeps into the cake, I think the texture is improved.  ",
    "* In the comments, we’ve gotten into another approach to the strawberry filling part: macerating them for one hour with a couple tablespoons of sugar and 1 tablespoon of either creme de cassis or fresh lemon juice. This softens the strawberries and creates more of the saucy variety you’d get in a bakery cake. To create the cake layers this way, spread the strawberry mixture then the whipped cream over each layer, proceeding otherwise as directed above. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/skyscraper-cakes1.jpg?w=500",
  "ingredient_list": [
    "Cake layers: ",
    "2 1/4 cups sifted cake flour",
    "1 1/2 cups superfine or regular sugar, divided",
    "1 tablespoon baking powder",
    "1 teaspoon salt",
    "3/4 cup cold water",
    "1/2 cup vegetable oil",
    "1 teaspoon lemon zest",
    "1 teaspoon vanilla extract",
    "5 large egg yolks at room temperature",
    "8 large egg whites at room temperature",
    "1/2 teaspoon cream of tartar",
    "Filling: ",
    "2 cups heavy cream",
    "6 tablespoons confectioners sugar",
    "1 tablespoon vanilla extract",
    "2 quarts strawberries, hulled and sliced (I sliced mine very thinly, but would do so more thickly next time, or double-layer the strawberries so that you get a higher fruit-to-bite ratio.)*"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Fruit",
    "Photo",
    "Strawberries"
  ],
  "title": "strawberry chiffon shortcake",
  "url": "https://smittenkitchen.com/2007/06/skyscraper-cakes/"
}