{
  "date": "2009-05-24T13:11:15+00:00",
  "directions": [
    "In the bowl of a food processor, combine the flour, sugar, baking powder, egg yolks, and salt. Pulse to combine. Add the butter and zest, if using, and pulse until the flour resembles coarse meal. Add 2/3 cup of cream and pulse until the dough comes together.",
    "Turn the dough out onto a lightly floured work surface and gather into a shaggy mass. Knead a couple times to make it into a cohesive mass and then pat it into a rough circle about 6 to 7 inches in diameter, and 3/4 to 1-inch thick.",
    "Using a sharp knife, cut the circle into 6 wedges and arrange on a parchment-lined baking sheet. Alternately, you can use a cookie cutter to make shapes of your choice. Chill for 20 minutes (and up to 2 hours).",
    "Preheat oven to 350°F. Brush the tops of the shortcakes very lightly with heavy cream and sprinkle lightly with the coarse sugar. Bake until risen and golden brown, 18 to 20 minutes. Turn the pan around halfway through to ensure even cooking.",
    "While the shortcakes are baking, toss the strawberries, sugar and lemon juice together in a bowl. Let stand several minutes. (If the strawberries are extremely firm, do this 30 minutes in advance.)",
    "Split the shortcakes in half horizontally and set the tops aside. Place the bottoms on dessert plates and heap strawberries over them. Spoon whipped cream generously over the strawberries and replace the shortcake tops. Serve immediately with any remaining whipped cream on the side."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/3552480009_66d3866192_o.jpg?w=753",
  "ingredient_list": [
    "1 2/3 cups (224 grams) all-purpose flour",
    "3 1/2 tablespoons (50 grams) sugar",
    "1 tablespoon plus 1/2 teaspoon (20 grams) baking powder",
    "2 hard-boiled egg yolks",
    "1/8 teaspoon salt",
    "6 tablespoons (84 grams) cold unsalted butter, cut into 1/2-inch cubes",
    "2 teaspoons lemon or orange zest (optional)",
    "2/3 cup (168 grams) plus 1 tablespoon heavy cream",
    "Shortcake assembly",
    "1/2 pound strawberries, washed, hulled and quartered",
    "2 tablespoons (25 grams) sugar",
    "1 tablespoon lemon juice",
    "1 cup whipping cream, beaten to soft peaks"
  ],
  "tags": [
    "Cake",
    "Everyday Cakes",
    "Fruit",
    "Photo",
    "Scones/Biscuits",
    "Strawberries",
    "Summer"
  ],
  "title": "strawberry shortcakes",
  "url": "https://smittenkitchen.com/2009/05/strawberry-shortcakes/"
}