{
  "date": "2010-04-28T22:35:23+00:00",
  "directions": [
    "In a large bowl, toss the shredded red and green cabbage with the salt. Transfer the cabbage to a colander and let it drain for two hours. (I was in a rush and did this in one. It was still nicely wilted, but of course could have been even softer.)",
    "If you’re worried about the cabbage being too salty when you’re done with the salting process, taste a piece of cabbage and if it concerns you, rinse and drain the cabbage well. This is not a suggestion in the original recipe, but something I suspect might bother some people.",
    "Put the salted, drained cabbage back into your (rinsed and dried) large bowl and add the spinach. In a medium bowl, whisk the lime juice, mustard and cumin together. Add the peanut oil in a thin stream, whisking constantly until the ingredients are thoroughly emulsified. Toss the salad with the dressing and add the roasted peanuts. Season to taste with salt and pepper.",
    "This salad is best served immediately, but it does keep surprisingly well in the fridge for a day or two. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-and-lime-salad-with-roasted-peanuts1.jpg?w=500",
  "ingredient_list": [
    "1/2 small red cabbage, trimmed, cored, and shredded (about 6 cups)",
    "1/2 small green cabbage, trimmed, cored, and shredded (about 6 cups)",
    "1 tablespoon kosher salt, plus more to taste",
    "1 bunch fresh baby spinach, stemmed and cut into 1/2-inch wide ribbons (about 4 cups loosely packed)",
    "1/4 cup fresh lime juice (from about 2 small limes)",
    "1 tablespoon Dijon or other salty prepared mustard",
    "1/2 teaspoon ground cumin",
    "1/4 cup peanut oil",
    "1/2 cup roasted unsalted peanuts, coarsely chopped",
    "Freshly ground black pepper"
  ],
  "tags": [
    "Cabbage",
    "Citrus",
    "Photo",
    "Picnics",
    "Salad",
    "Spinach",
    "Summer"
  ],
  "title": "cabbage and lime salad with roasted peanuts",
  "url": "https://smittenkitchen.com/2010/04/cabbage-and-lime-salad-with-roasted-peanuts/"
}