[
    {
        "ingredient_list": [
            "1 cup black beans, cooked, drained (about 2/3 of a 15-ounce can)", 
            "1 large bell pepper, finely diced (I used a mix of colors because we keep them around for the kid)", 
            "1/4 cup finely diced white or red onion", 
            "1 small jalapeno, seeded and minced", 
            "1/4 cup olive oil", 
            "2 tablespoons freshly squeezed lime juice (from about 1 lime)", 
            "1/4 teaspoon coarse salt, plus more to taste", 
            "1/2 teaspoon ground cumin", 
            "Dashes of hot sauce or pinches of cayenne, to taste", 
            "Chopped cilantro for garnish", 
            "4 ripe avocados", 
            "1 cup finely diced cucumber (from about half a long English or 2 small Persian cukes), seeds removed", 
            "1 cup finely diced radishes (from about 4 large red ones)", 
            "2 scallions, finely chopped", 
            "4 tablespoons toasted sesame oil", 
            "2 teaspoons white miso (shiromiso, which is more mild/less salty)", 
            "2 tablespoons rice vinegar", 
            "1/2 teaspoon finely grated or minced fresh ginger root (or more to taste)", 
            "1 teaspoon white sesame seeds, toasted", 
            "1 teaspoon black sesame seeds", 
            "4 ripe avocados"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/avocado-cup-salads-two-ways1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Avocado", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/04/avocado-cup-salads-two-ways/", 
        "title": "avocado cup salads, two ways", 
        "directions": [
            "Mix cucumber, radishes and scallions in a medium bowl. In a small dish, whisk sesame oil, miso, rice vinegar and ginger. Add dressing flavor and seasonings to taste. Halve avocados and remove pits. Score avocado halves with a knife, cutting lines in both directions to form a grid, but being careful not to through the skin. ", 
            "If you’re serving all four avocados right away, go ahead and mix the dressing and salad ingredients together, then heap each avocado half with salad and dressing and garnish with mix of sesame seeds. If you’d like to stretch this over several days of lunches or the like, keep the mixed salad ingredients and dressing in separate dishes. When you’re ready to eat, cut and score your avocado, dot a little dressing directly on each half, heap with salad filling and drizzle with more dressing. Garnish with mix of seeds. ", 
            "Eat with a spoon. "
        ], 
        "date": "2014-04-23T12:13:24+00:00"
    }, 
    {
        "ingredient_list": [
            "8 ounces (1 small-to-medium bundle, 225 grams) fresh broccoli (3 cups chopped)", 
            "1 large egg", 
            "1/2 cup (65 grams) all-purpose flour", 
            "1/3 cup (30 grams) finely grated parmesan cheese", 
            "1 small clove garlic, minced", 
            "1/2 teaspoon Kosher salt, plus more to taste", 
            "A pinch of red pepper flakes or several grinds of black pepper", 
            "Olive or vegetable oil for frying"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/broccoli-parmesan-fritters1.jpg?w=640", 
        "tags": [
            "Broccoli", 
            "Lunch", 
            "Pancakes", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Snack", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/06/broccoli-parmesan-fritters/", 
        "title": "broccoli parmesan fritters", 
        "directions": [
            "Prepare your broccoli: Separate the florets from the biggest stem(s). Cut the florets into 1-inch chunks. To prepare the stems, I like to peel them, as the skin can be thick and doesn’t cook quickly, then slice them into 1/2-inch lengths. You should have about 3 cups of chopped broccoli total.", 
            "Steam your broccoli until tender but not mushy: Use whatever method you prefer. My quickie, lazy method is to bring a 1/2-inch or so of water to a boil in a small saucepan, then add the broccoli, place a lid on it and simmer it for 5 to 6 minutes. Drain the broccoli, then set it aside to cool slightly.", 
            "In the bottom of a large bowl, lightly beat your egg. Add the flour, cheese, garlic, salt and pepper. Then, add the somewhat cooled broccoli and, using a potato masher, mash the broccoli just a bit. You’re looking to keep the bits recognizable, but small enough (1/4- to 1/2-inch chunks) that you can press a mound of the batter into a fritter in the pan. Once mashed a bit, stir or fold the ingredients together the rest of the way with a spoon. Adjust seasonings to taste.", 
            "Heat a large, heavy skillet over moderate heat. Once hot, add a good slick of oil (I usually use a mix of olive and vegetable oil), about 2 to 3 tablespoons. Once the oil is hot (you can test it by flicking a droplet of water into it; it should hiss and sputter), scoop a two tablespoon-size mound of the batter and drop it into the pan, then flatten it slightly with your spoon or spatula. Repeat with additional batter, leaving a couple inches between each. Once brown underneath, about 2 to 3 minutes, flip each fritter and cook on the other side until equally golden, about another 1 to 2 minutes.", 
            "Transfer briefly to paper towels to drain, then to a serving plate if you’ll be eating them shortly or a baking sheet in a 200 degree oven if you’d like to keep them warm for a while until needed. Repeat with remaining batter, adding more oil as needed. Serve with some of the suggestions listed in the head notes, above."
        ], 
        "date": "2012-06-12T12:25:02+00:00"
    }, 
    {
        "ingredient_list": [
            "Salt", 
            "1 cup semi-pearled farro", 
            "1 pound broccolini or regular broccoli (previously: 2 pounds, see note)", 
            "4 tablespoons olive oil", 
            "2 cloves garlic, minced", 
            "Red pepper flakes, to taste", 
            "Finely grated zest, then juice, of 1 lemon (juice before zesting only if you enjoy being grumpy)", 
            "Freshly ground black pepper", 
            "4 ounces pecorino romano, grated or ground in a food processor"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/broccoli-rubble-farro-salad.jpg?w=750", 
        "tags": [
            "Broccoli", 
            "Grain/Rice", 
            "Lunch", 
            "Picnics", 
            "Put An Egg On It", 
            "Recipes", 
            "Salad", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2017/05/broccoli-rubble-farro-salad/", 
        "title": "broccoli rubble farro salad", 
        "directions": [
            "Bring a medium/large pot of salted water to boil. Once boiling, add broccoli and boil for 2 to 2 1/2 minutes, until slightly softened but still crisp overall. Scoop out with slotted spoon or tongs, then drain.", 
            "Add farro back to same pot (I’m totally okay with some errant leftover broccoli flecks and vitamins here, if you’re not, use another pot of salted water) and cook, simmering, for 25 to 30 minutes, until tender. (Since there are so many varieties of farro, however, if your package suggests otherwise, it’s best to defer to its cooking suggestion.) Drain and tip into a large mixing bowl; cool to lukewarm.\nPat drained broccoli dry on towels, trying to remove as much excess moisture as possible. Chop into small (roughly 1/2-inch) bits. In a large sauté pan, heat olive oil over medium-high heat until hot. Add garlic and pepper flakes, to taste, and cook for 1 minute, until garlic is faintly golden. Add chopped broccoli, lemon zest, and salt (I use a full teaspoon kosher salt here, but adjust the amount to your taste) and cook, stirring, for 3 to 4 more minutes, until broccoli is well-seasoned and slightly more tender.\nAdd broccoli and every bit of garlic and oil from the pan to the bowl of farro and stir to combine. Add lemon juice, black pepper and more salt to taste (but 1/2 teaspoon of each is what we used) and stir to combine. Stir in cheese.", 
            "Serve warm or at room temperature as-in, with an egg on top, burrata, and/or seasoned breadcrumbs."
        ], 
        "date": "2017-05-24T12:05:32+00:00"
    }, 
    {
        "ingredient_list": [
            "2 heads of broccoli", 
            "1/2 cup thinly sliced almonds, toasted", 
            "1/3 cup dried cranberries", 
            "1/2 small red onion, finely chopped", 
            "Buttermilk Dressing (Adapted from this salad.)", 
            "1/2 cup buttermilk, well-shaken", 
            "1/3 cup mayonnaise (this is more than is in the original, to thicken the dressing further)", 
            "2 tablespoons cider vinegar", 
            "1 tablespoon sugar", 
            "3 tablespoons finely chopped shallot (or, you could just use a little extra red onion to simplify it)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/broccoli-slaw.jpg?w=753", 
        "tags": [
            "Broccoli", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2009/05/broccoli-slaw/", 
        "title": "broccoli slaw", 
        "directions": [
            "Trim broccoli and cut it into large chunks. From here, you can either feed it through your food processor’s slicing blade, use a mandoline to cut it into thin slices, or simply had chop it into smaller pieces. I used the stem and the flowerets, but if you have a broccoli stem aversion you can just use the tops. (P.S. My favorite way to prep the stems is to peel them — the tough skin is why most people think they don’t like broccoli stems; the broccoli underneath is juicy and crisp — then use the mandoline or a knife to cut them into thin slices.)", 
            "Toss the sliced broccoli with the almonds, cranberries and red onion in a large bowl. Meanwhile, whisk the dressing ingredients in a smaller one, with a good pinch of salt and black pepper. Pour the dressing over the broccoli (if you’ve skipped the stems, you might not want it all; I otherwise found this to be the perfect amount) and toss it well. Season well with salt and pepper to taste.", 
            "Should keep up to a week in the fridge, if you don’t have any pregnant women nearby.", 
            "Variation: I bet this slaw would be equally good with cauliflower. I might use dried currants instead of cranberries, walnuts instead of almonds and maybe even some celery slices thrown in. Have fun with it."
        ], 
        "date": "2009-05-11T14:22:16+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium butternut squash (about 2 pounds)", 
            "5 to 6 tablespoons olive oil, divided", 
            "Salt and freshly ground black pepper, to taste", 
            "1 cup semi-pearled farro (see Note up top)", 
            "1/3 cup toasted pepitas (I used, and love, the salted ones)", 
            "3 ounces ricotta salata or another salty cheese, crumbled or coarsely grated (about 3/4 cup)(omit to make vegan)", 
            "1 tablespoon sherry vinegar", 
            "1 tablespoon water", 
            "1/2 teaspoon table salt", 
            "1/2 teaspoon granulated sugar", 
            "1/2 small red onion, finely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/butternut-squash-salad-with-farro-and-pepitas1.jpg?w=500", 
        "tags": [
            "Fall", 
            "Grain/Rice", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Vegan", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2012/10/butternut-squash-salad-with-farro-and-pepitas/", 
        "title": "butternut squash salad with farro and pepitas", 
        "directions": [
            "Preheat oven to 375 degrees F. ", 
            "Peel squash, then halve lengthwise and scoop out seeds. Cut squash into approximately 3/4-inch chunks. Coat one large or two small baking sheets with 2 tablespoons oil total. Spread squash out in single layer on sheet. Sprinkle with salt and freshly ground black pepper. Roast until pieces are tender, about 30 to 40 minutes, turning them over halfway through the cooking time. Set aside to cool slightly.", 
            "While squash is roasting, cook farro in a large pot of simmering salted water until the grains are tender but chewy, about 30 minutes. (Since there are so many varieties of farro, however, if your package suggests otherwise, it’s best to defer to its cooking suggestion.) Drain and cool slightly.", 
            "While squash is roasting and farro is simmering, in a small bowl, whisk together sherry vinegar, water, 1/2 teaspoon table salt and granulated sugar until sugar and salt dissolve. Stir in onion; it will barely be covered by vinegar mixture but don’t worry. Cover and set in fridge until needed; 30 minutes is ideal but less time will still make a lovely, lightly pickled onion.", 
            "In a large bowl, mix together butternut squash, farro, red onion and its vinegar brine, the crumbled cheese and pepitas. Toss with 3 tablespoons of the remaining olive oil, use the 4th one only if needed. Taste and adjust seasonings. Eat now or later. Salad keeps in the fridge for up to a week."
        ], 
        "date": "2012-10-23T11:28:02+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small head cauliflower (1 pound florets, i.e. stems and leaves removed), cut into generous 1 to 2 inch chunks", 
            "1 large egg", 
            "1 garlic clove, minced", 
            "Few gratings of fresh lemon zest", 
            "3 ounces crumbled feta (about 1/2 cup)", 
            "1/2 cup all-purpose flour", 
            "1/4 teaspoon Aleppo pepper flakes; less if using regular red pepper flakes, which are hotter", 
            "3/4 teaspoon table salt or more to taste", 
            "1/2 teaspoon baking powder", 
            "Olive oil for frying", 
            "To serve", 
            "3/4 cup yogurt", 
            "1/2 teaspoon ground cumin", 
            "Salt and pepper to taste", 
            "Handful pomegranate arils"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/12/cauliflower-feta-fritters-with-pomegranate.jpg?w=751", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cauliflower", 
            "Lunch", 
            "Photo", 
            "Pomegranate", 
            "Snack", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/12/cauliflower-feta-fritters-with-pomegranate/", 
        "title": "cauliflower-feta fritters with pomegranate", 
        "directions": [
            "Cook cauliflower in simmering salted water, uncovered, until tender, about 5 to 6 minutes, until firm but tender. Using a slotted spoon, transfer to a bowl of ice water to stop cooking. Drain well. Spread on towels to dry as much as possible.", 
            "In the bottom of a large bowl, whisk together egg, garlic and lemon zest. Add cauliflower florets and mash with a potato masher until they’re crushed into an average of pea-sized pieces (i.e. some will be bigger, some smaller, but most will be little nubs). Sprinkle in feta and stir to combine egg mixture, cauliflower and feta. In a small dish, whisk flour, salt, pepper and baking powder until evenly combined. Sprinkle over cauliflower batter and stir just until combined.", 
            "Heat oven to 200 degrees F and place a tray inside. On the stove, heat a large, heavy skillet over moderate heat. Once hot, add a good slick of oil, about 2 to 3 tablespoons. Once the oil is hot (you can test it by flicking a droplet of water into it; it should hiss and sputter), scoop a two tablespoon-size mound of the batter and drop it into the pan, then flatten it slightly with your spoon or spatula. Repeat with additional batter, leaving a couple inches between each. Once brown underneath, about 2 to 3 minutes, flip each fritter and cook on the other side until equally golden, about another 1 to 2 minutes.", 
            "Transfer briefly to paper towels to drain, then the tray in the oven to keep them warm until needed. Once all fritters are cooked, mix yogurt with cumin, salt and pepper. Spread fritters on serving platter. Dollop each with cumin yogurt and sprinkle with pomegranate arils.", 
            "Do ahead: Fritters both freeze and reheat well. To warm and recrisp them, lay them on a tray and toast them at 400 degrees in the oven until crisp again."
        ], 
        "date": "2012-12-04T10:13:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup thinly sliced almonds", 
            "Juice of half a lemon (about 1 tablespoon), plus more to taste", 
            "1 tablespoon white wine vinegar", 
            "1/4 teaspoon fine sea salt or table salt, then more to taste", 
            "3 tablespoons (30 grams) dried currants", 
            "5 tablespoons olive oil, plus more for frying", 
            "2 tablespoons (about 25 grams) brined or salt-packed capers", 
            "oil for frying", 
            "1 small, compact-looking head of cauliflower (about 1 1/4 pounds)", 
            "Freshly ground black pepper", 
            "3 scallions, thinly sliced (use green and white parts)", 
            "2 tablespoons chopped flat-leaf parsley (optional, mostly for color)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-slaw1.jpg?w=640", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/cauliflower-slaw/", 
        "title": "cauliflower slaw", 
        "directions": [
            "Heat oven to 350 degrees F. Spread almonds on a tray and toast them until they’re a deep golden color, tossing them once or twice to ensure even cooking. This will take 10 to 14 minutes. Set aside to cool.** ", 
            "Meanwhile, place lemon juice, vinegar and 1/4 teaspoon salt in a small bowl. Add currants; set aside and let them soak while you prepare the other ingredients. ", 
            "If using brined capers, drain and spread them on paper towels until most of their moisture has wicked out, about 5 minutes. If using salt-packed capers, soak them in water for 10 minutes to remove the saltiness, then drain, rinse and pat dry on paper towels. Pour a 1/2-inch of olive oil or another oil that you prefer to fry in in a small skillet or saucepan. Heat it over medium-high. When hot enough that a droplet of water added to the oil hisses, carefully add the capers and step back — they’re going to sputter a bit for the first 10 seconds. Once it’s safe to get closer, give them a stir. Depending on how dry they were, it can take 1 to 2 minutes for them to get lightly golden at the edges and then crisp. Remove with a slotted spoon. Drain on paper towels.", 
            "Trim cauliflower leaves and cut head into quarters. Using an adjustable-blade slicer (this is mine; it takes up very little room) to cut cauliflower, stem and florets, into 1/4-inch slices. Add to a large bowl. ", 
            "Scoop currants from vinegar mixture with a slotted spoon and add to bowl with cauliflower, along with almonds, capers, scallions and parsley. Slowly whisk 5 tablespoons olive oil into remaining vinegar mixture in a thin stream. Add several turns of freshly ground black pepper. Pour over cauliflower and other ingredients and turn gently to coat all pieces. Taste and adjust seasonings, adding more lemon juice, salt or pepper to taste. Dig in!", 
            "** P.S. I really tried to avoid this pesky oven step by toasting mine in a skillet, the one I’d use to fry the capers in a few minutes. Twice, I failed because the little bits got black and smoky before the larger ones toasted, no matter how much I kept them moving. I’m pretty sure I could do better in the future, but I was running out of almonds. If you trust your pan-toasting skills, feel free to cook the almonds there instead."
        ], 
        "date": "2014-09-16T11:56:06+00:00"
    }, 
    {
        "ingredient_list": [
            "Noodles and vegetables", 
            "8 ounces buckwheat noodles", 
            "A mixture of raw vegetables of your choice (such as carrots, cucumbers, radishes or daikon; see Note for more suggestions)", 
            "Sauce", 
            "2 to 3 tablespoons miso (red is recommend; white would be just fine)", 
            "1 2-inch piece ginger, finely grated", 
            "2 teaspoons granulated sugar", 
            "1/8 teaspoon ground cayenne, or to taste", 
            "2 tablespoons mirin", 
            "1 tablespoon soy sauce", 
            "2 tablespoons lime juice (from about 1 lime), plus lime wedges for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/cold-noodles-with-miso-lime-and-ginger1.jpg?w=640", 
        "tags": [
            "Citrus", 
            "Cucumber", 
            "Japanese", 
            "Lunch", 
            "Pasta", 
            "Photo", 
            "Radishes", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/08/cold-noodles-with-miso-lime-and-ginger/", 
        "title": "cold noodles with miso, lime and ginger", 
        "directions": [
            "Cook the noodles in well-salted water until tender but firm for the time recommended on your package of noodles. What, your package is only in Japanese, like mine? Most are cooked between 5 and 8 minutes, so test at 5 and add more minutes if needed.", 
            "Meanwhile, grate, julienne or thinly slice vegetables of your choice.", 
            "Drain noodles and run cold water over them to cool. Drain again, shaking out excess water.", 
            "Make the dressing by whisking the smaller amount of miso plus the remaining sauce ingredients in a bowl. Taste and adjust to make sweeter (with more sugar) or more intense and salty (with the last tablespoon of miso) if desired. ", 
            "Divide noodles among four bowls; toss each with a tablespoon of the sauce, plus more to taste. Top with vegetables and extra droplets of sauce. Serve with lime wedges.", 
            "The leftovers won’t keep well with the sauce on. It’s best to keep it in one container and the noodles and vegetables in another, combining when needed, if you have extras. ", 
            "Notes:"
        ], 
        "date": "2014-08-04T12:14:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon butter", 
            "3 cups fresh corn (cut from 3 small-to-average cobs)", 
            "1 1/2 cup thinly sliced scallions (both white and green parts from a 4-ounce bundle)", 
            "8 cups whole wheat, country or French bread in 1-inch cubes (weight will vary from 10 to 14 ounces, depending on bread type)", 
            "2 cups (6 ounces) coarsely grated sharp cheddar", 
            "1 cup (2 ounces) finely grated parmesan", 
            "9 large eggs", 
            "2 tablespoons mayonnaise (optional, see Note up top)", 
            "2 3/4 cups milk", 
            "1 teaspoon table salt or 2 teaspoons of a coarse sea salt", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/corn-cheddar-and-scallion-strata1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Corn", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/corn-cheddar-and-scallion-strata/", 
        "title": "corn, cheddar and scallion strata", 
        "directions": [
            "Generously butter a 3-quart baking dish (a lasagna or 9×13-inch pan works well here too). Toss corn and scallions together in a medium bowl. Combine cheeses in another bowl. In a large bowl, gently beat eggs and mayo together, then whisk in milk, salt and lots (or, if measuring, 1/2 teaspoon) of freshly ground black pepper. Spread one-third of bread cubes in prepared baking dish — it will not fully cover bottom of dish; this is fine. Add one-third of corn, then cheese mixture. Repeat layering twice with remaining bread, corn and cheese. Pour egg mixture evenly over strata. Cover with plastic wrap and refrigerate for at least 8 hours or up to 1 day.", 
            "When ready to bake, heat oven to 350 degrees F. Bake strata, uncovered, until puffed, golden brown and cooked through, about 45 to 55 minutes. Let stand 5 minutes before serving. ", 
            "Do ahead: Strata keeps baked in the fridge for 4 days or longer in the freezer, wrapped well. It reheats wonderfully, either from the fridge or freezer and holds up well in lunch boxes."
        ], 
        "date": "2014-09-03T11:00:41+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups cubed (1/2 inch) cooked chicken (about 1 3/4 lb) (I like to brine mine first, then poach it in water for 15 to 20 minutes because I am completely neurotic about chicken getting dried out in any way.)", 
            "1 cup walnuts, toasted and chopped", 
            "1 celery rib, diced into small bits (1 cup)", 
            "2 or more tablespoons finely chopped shallot", 
            "1 cup dried cranberries", 
            "2/3 to 3/4 cup mayonnaise", 
            "3 tablespoons tarragon vinegar, if you have it, or champagne or white wine vinegar works well, too", 
            "2 tablespoons finely chopped fresh tarragon or herb or your choice", 
            "1/2 teaspoon salt", 
            "1/2 teaspoon black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/10/cranberry-walnut-chicken-salad.jpg?w=753", 
        "tags": [
            "Chicken", 
            "Lunch", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/10/cranberry-walnut-chicken-salad/", 
        "title": "cranberry-walnut chicken salad", 
        "directions": [
            "Really complicated directions: Toss together all ingredients in a large bowl until combined well.", 
            "I like to eat mine on top of chopped Romaine lettuce, or with toasted pocketless pita wedges.", 
            "Variations: Are almost endless, but this is particularly good with leftover Thanksgiving turkey and chopped pecans."
        ], 
        "date": "2008-10-15T01:00:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup white wine vinegar", 
            "1/4 cup water", 
            "2 teaspoons Kosher salt (you can go up to 1 tablespoon if using the lighter weight Diamond brand; here’s why)", 
            "1 1/2 teaspoons granulated sugar", 
            "2 stalks celery, trimmed, diced tiny", 
            "4 large eggs", 
            "1 heaped teaspoon whole-grain Dijon", 
            "2 teaspoons minced shallot or red onion (or more to taste)", 
            "2 tablespoons mayonnaise or full-fat plain yogurt", 
            "Salt and freshly ground pepper to taste", 
            "Chopped flat-leaf parsley or fresh dill (to garnish, optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/02/egg-salad-with-pickled-celery-and-coarse-dijon.jpg?w=750", 
        "tags": [
            "Celery", 
            "Eggs", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/02/egg-salad-with-pickled-celery-and-coarse-dijon/", 
        "title": "egg salad with pickled celery and coarse dijon", 
        "directions": [
            "Pickle your celery: Combine vinegar, water, Kosher salt and sugar in a jar and shake it until the salt and sugar dissolve. Add diced celery to jar, cover it and place in the fridge for at least 30 minutes, ideally one hour and up to one week.", 
            "Cook your eggs: Place eggs in a saucepan and cover with an inch of cold water. Bring to a boil over high heat, and once boiling, reduce the heat to medium and set your timer for 10 minutes (for perfectly cooked through eggs), or 9 minutes (if you like them just-barely-set in the center, like mine above). Once the timer rings, drain eggs and rinse under cold water to stop cooking. To quickly chill them so you can use them right away, cover them in ice water for 10 to 15 minutes.", 
            "Make your salad: Peel your eggs and chop them, placing them in a medium bowl. Add 1 heaped tablespoon of pickled celery (more to taste), Dijon, shallot, mayo, salt and pepper and mix. Season to taste with salt and pepper. Serve on toasted whole grain bread, garnished with fresh herbs. "
        ], 
        "date": "2013-02-05T11:35:43+00:00"
    }, 
    {
        "ingredient_list": [
            "Salad", 
            "3 tablespoons olive oil, possibly plus another spoonful", 
            "1 1/4 pound delicata squash (one medium)", 
            "1/2 pound brussels sprouts", 
            "Salt and freshly ground black pepper or Aleppo pepper flakes to taste", 
            "1 large pita bread", 
            "Kosher salt", 
            "2 scallions, thinly sliced", 
            "About 1 tablespoon mint leaves, finely chopped", 
            "About 1 tablespoon flat-leaf parsley or cilantro leaves, finely chopped", 
            "Additional ground sumac or paprika, to finish", 
            "Dressing", 
            "2 teaspoons ground sumac or paprika (see Note above)", 
            "2 teaspoons warm water", 
            "1 to 2 tablespoons lemon juice", 
            "1 small garlic clove, minced", 
            "1 teaspoon white wine vinegar", 
            "4 tablespoons olive oil", 
            "Salt and freshly ground black pepper or Aleppo pepper flakes to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/fall-toush-salad-with-delicata-and-brussels1.jpg?w=640", 
        "tags": [
            "Brussels Sprouts", 
            "Fall", 
            "Lunch", 
            "Middle Eastern", 
            "Photo", 
            "Vegan", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2014/10/fall-toush-salad/", 
        "title": "fall-toush salad", 
        "directions": [
            "Prepare vegetables:  Heat oven to 400F.  Coat two baking sheets with a tablespoon or so of olive oil each. ", 
            "Cut ends off delicata squash and scrape out seeds with a spoon. [Did you know you can toast these like pumpkin seeds for a crispy garnish? You can!] Slice squash into 1/2-inch rings, then cut each ring into 1 to 2-inch chunks (I cut each ring into 1/6ths). Spread on first baking sheet in one layer; sprinkle with salt and pepper. Roast for 20 to 25 minutes, until bronzed underneath, then flip and roast for another 10 to 13 minutes, until browned at the edges and tender in the center. Set aside to cool slightly.", 
            "Meanwhile, trim ends and any discolored leaves from brussels sprouts and halve them lengthwise.   Spread cut-side-down on second baking sheet; sprinkle with salt and pepper. Roast for 15 minutes, then flip sprouts and roast them for another 5 to 10 minutes, until toasty and crisp. Set aside to cool slightly.", 
            "Prepare pita chips:  Split pita into two layers and cut or tear into large bite-sized chunks. Toss in a bowl with a little less than 1 remaining tablespoon olive oil and a couple pinches of salt. Spread on a baking sheet (I reused my brussels sheet, because they were done first) and toast in oven with vegetables for 5 to 8 minutes, until golden and crisp.", 
            "Make dressing:  Soak sumac in water for 5 minutes, then whisk in remaining dressing ingredients. Adjust seasonings to taste; you may find you need more lemon juice or vinegar.", 
            "Assemble salad:  In a medium-large bowl, combine warm roasted vegetables and scallions. Toss with 1/2 to 2/3 dressing, or to taste. Stir in chopped herbs, then pita chips; add more dressing and adjust salt and pepper levels if needed. Sprinkle with sumac to finish, and serve.", 
            "To do ahead: I’d keep the roasted vegetables separate from the pita chips so they don’t get soggy. I’d expect the roasted vegetables to hold up pretty well with the dressing (although it’s going to mostly absorb) but if you’re worried, you can keep that separate until serving, too."
        ], 
        "date": "2014-10-13T19:52:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small head garlic", 
            "2 tablespoons olive oil, plus an extra drizzle for the garlic", 
            "1 9″x13″ sheet frozen puffed pastry*, thawed in fridge for several hours", 
            "1/3 cup finely grated Parmesan cheese", 
            "Kosher salt and freshly ground black pepper or red pepper flakes, to taste", 
            "1 tablespoon capers, drained and rinsed, if salted (or 1 to 2 anchovies, finely chopped)", 
            "1 1/2 pounds (about 4 cups) small cherry or grape tomatoes, the sweetest you can find", 
            "2 tablespoons finely chopped flat-leaf parsley", 
            "1 tablespoons finely chopped fresh chives", 
            "1 tablespoons finely chopped fresh oregano"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/herbed-tomato-and-roasted-garlic-tart1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Photo", 
            "Summer", 
            "Tarts/Quiche", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/herbed-tomato-and-roasted-garlic-tart/", 
        "title": "herbed tomato and roasted garlic tart", 
        "directions": [
            "Roast garlic: Heat oven to 350°F. Cut head of garlic in half crosswise; drizzle cut ends with a few drops of olive oil, then wrap in tightly foil and bake, directly on oven rack, for 45 minutes, until garlic cloves are completely soft. Set aside. [Note: Heads of garlic can also be roasted whole, but I find it easier to remove the cloves without getting any stuck in the skin when it’s halved. Garlic can be roasted up to two days in advance; just keep in the fridge until needed. It will smell exactly like a toasted everything bagel.]", 
            "Prepare crust: Increase oven temperature to 375°F. 9″x13″-inch baking sheet (or quarter-sheet pan) with parchment paper. Fit pastry sheet into pan, pressing it against the bottom and sides. Trim pastry hanging over sides of pan, if there is any. Prick bottom of pastry all over with a fork. Lay parchment paper over crust and fill with pie weights, which can be storebought, or you can use dried beans, rice or even pennies. Bake until edges of tart are golden, 25 minutes. Carefully remove weights and parchment. If any parts have bubbled up, poke them with a knife point and they should deflate.", 
            "Squeeze roasted garlic cloves out into a bowl and mash with a fork until smooth. Spread over baked par-baked crust with a knife, as if you were buttering bread. Sprinkle with Parmesan, salt and pepper. Return to oven bake until tart shell is golden all over, 12 to 15 minutes. Set aside on a cooling rack.", 
            "Heat broiler. In a large bowl, mix tomatoes, capers, olive oil, salt and pepper. Transfer to a baking sheet and broil, shaking pan once or twice, until tomatoes are blistered and have begun to release their juices, 12 to 14 minutes. This may seem a pesky step but getting the juiciness out of the tomatoes will keep the tart crust from getting soggy.", 
            "Increase oven heat to 425°F. Use a slotted spoon to transfer the tomato mixture to the prepared tart shell; distribute tomatoes evenly, in one layer. Sprinkle with the three herbs. Return the tart to the oven and bake it until hot, about 15 minutes. Let cool slightly before cutting into it. ", 
            "Tart can be served hot or closer to room temperature. Store leftovers in fridge. Reheat in 325°F oven for 5 to 10 minutes.", 
            "* My favorite frozen puffed pastry is DuFour — definitely not cheap, but absolutely delicious, made only with butter, flour, salt and a little lemon juice. 1 14-ounce package unfolds to just about 9″x13″, which means I just pressed/stretched it a tiny bit with my fingertips to fit it in the pan — no rolling required (yay). You can also reuse the parchment it comes wrapped into line your crust as you par-bake it."
        ], 
        "date": "2014-09-11T11:52:57+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1/2 small head cabbage, very thinly sliced (1 pound or 5 to 6 cups shreds) which will be easiest on a mandoline if you have one", 
            "4 medium carrots, peeled into ribbons with a vegetable peeler", 
            "5 lacinato kale leaves, ribs removed, leaves cut into thin ribbons", 
            "4 scallions, thinly sliced on an angle", 
            "1 teaspoon kosher salt", 
            "1/2 cup all-purpose flour", 
            "6 large eggs, lightly beaten", 
            "Canola, safflower or peanut oil for frying", 
            "Tangy Sauce", 
            "1/4 cup ketchup", 
            "1 1/2 tablespoons Worcestershire sauce (note: this is not vegetarian)", 
            "1/4 teaspoon dijon mustard", 
            "1 tablespoon rice cooking wine or sake", 
            "1 teaspoon soy sauce", 
            "1 tablespoon honey (use 2 if you like a sweeter sauce)", 
            "1/8 teaspoon ground ginger"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/japanese-vegetable-pancakes.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cabbage", 
            "Carrots", 
            "Japanese", 
            "Kale", 
            "Lunch", 
            "Pancakes", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/05/japanese-cabbage-and-vegetable-pancakes/", 
        "title": "japanese vegetable pancakes", 
        "directions": [
            "Make the pancakes: Toss cabbage, carrot, kale, scallions and salt together in a large bowl. Toss mixture with flour so it coats all of the vegetables. Stir in the eggs. Heat a large heavy skillet on medium-high heat. Coat the bottom with oil and heat that too. ", 
            "To make a large pancake, add 1/4 of the vegetable mixture to the skillet, pressing it out into a 1/2- to 3/4-inch pancake. Gently press the pancake down flat. Cook until the edges beging to brown, about 3 minutes. 30 seconds to 1 minute later, flip the pancake with a large spatula. (If this is terrifying, you can first slide the pancake onto a plate, and, using potholders, reverse it back into the hot skillet.) Cook on the other side until the edges brown, and then again up to a minute more (you can peek to make sure the color is right underneath).", 
            "To make small pancakes, you can use tongs but I seriously find using my fingers and grabbing little piles, letting a little batter drip back into the bowl, and depositing them in piles on the skillet easier, to form 3 to 4 pancakes. Press down gently with a spatula to they flatten slightly, but no need to spread them much. Cook for 3 minutes, or until the edges brown. Flip the pancakes and cook them again until brown underneath. ", 
            "Regardless of pancake size, you can keep them warm on a tray in the oven at 200 to 250 degrees until needed. ", 
            "If desired, make okonomiyaki sauce: Combine all sauce ingredients in a small saucepan and let simmer for 3 to 5 minutes, until smooth and thick. ", 
            "Serve pancakes with sauce and any of the other fixings listed above, from Japanese mayo to scallions and toasted sesame seeds. ", 
            "Do ahead: Extra pancakes will keep in the fridge for a couple days, or can be spread on a tray in the freezer until frozen, then combined in a freezer bag to be stored until needed. Reheat on a baking sheet in a hot oven until crisp again."
        ], 
        "date": "2013-05-15T11:01:47+00:00"
    }, 
    {
        "ingredient_list": [
            "Salad", 
            "1/2 cup uncooked quinoa (or 1 1/2 cups cooked)", 
            "8 ounces Black Kale, also known as Cavolo Nero, or Lacinato, Dinosaur, or Tuscan Kale", 
            "1/2 cup slivered almonds, very well toasted and cooled", 
            "1/3 cup dried cherries, chopped a bit", 
            "2 to 3 scallions, thinly sliced", 
            "2 teaspoons chopped fresh dill", 
            "2 ounces ricotta salata, crumbled or finely grated", 
            "Few gratings of fresh lemon zest", 
            "Dressing", 
            "3 tablespoons olive oil", 
            "1 1/2 tablespoons white wine vinegar", 
            "2 teaspoons smooth Dijon mustard", 
            "1 teaspoon coarse Dijon mustard", 
            "Just shy of 1 teaspoon honey", 
            "Salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/03/kale-and-quinoa-salad-with-ricotta-salata.jpg?w=750", 
        "tags": [
            "Grain/Rice", 
            "Kale", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/03/kale-and-quinoa-salad-with-ricotta-salata/", 
        "title": "kale and quinoa salad with ricotta salata", 
        "directions": [
            "Rinse quinoa well in a small colander. This is essential to remove bitterness. Place quinoa and 1 1/2 cups water in a small saucepan and bring to a simmer with a couple pinches of salt. Simmer at a very low temperature for 15 to 20 minutes, until tender. Drain any un-absorbed liquid from cooked quinoa. Spread quinoa on a plate to cool quickly.", 
            "Wash your kale and dry it well. Then, with a knife, remove the rib from each stalk, leaving long strips of kale leaves. Stack the leaves in small batches, roll them tightly the long way, and cut the roll crosswise into thin ribbons. Add the kale ribbons to a large salad bowl. Add remaining salad ingredients to kale and toss to mix.", 
            "Whisk dressing ingredients together in a small dish, and pour the dressing over the salad. Season with salt and pepper to taste, then dig in."
        ], 
        "date": "2014-03-06T11:56:31+00:00"
    }, 
    {
        "ingredient_list": [
            "Lentils", 
            "Scant 1 cup dried green lentils (Puy or Casteluccio, if you can find them) lentils, picked and rinsed over", 
            "2 large garlic cloves, halved lengthwise", 
            "2 fresh sage sprigs", 
            "2 tablespoons olive oil", 
            "For the dressing and salad", 
            "2 teaspoons coriander seeds, toasted and ground**", 
            "1 teaspoon cumin seeds, toasted and ground**", 
            "1/2 large garlic clove", 
            "Salt (Maldon or another flaky sea salt if you’ve got it)", 
            "2 tablespoons well-stirred tahini paste", 
            "1/4 cup freshly squeezed lemon juice, plus more to taste", 
            "2 tablespoons plus 2 teaspoons olive oil", 
            "1 and 3/4 cups drained chickpeas (from a 15-ounce can), low sodium if you can find them", 
            "1/2 small preserved lemon, pith and flesh discarded, rind finely diced (optional)", 
            "1 very small red onion, thinly sliced into half-moons", 
            "A handful of small, delicate cilantro or flat-leaf parsley sprigs", 
            "A scant 1/4 cup feta (goat’s milk if you can find it, otherwise use what you can get)", 
            "1 and 1/2 tablespoons raw sesame seeds, toasted in a dry pan until a shade or two darker"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/lentil-and-chickpea-salad.jpg?w=750", 
        "tags": [
            "Beans", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/04/lentil-and-chickpea-salad-with-feta-and-tahini/", 
        "title": "lentil and chickpea salad with feta and tahini", 
        "directions": [
            "Make the lentils: Put the lentils, garlic, sage, and olive oil in a small pot, along with 2 cups cold water, and set it over medium heat. Let the water come to a simmer (not boiling), then turn the heat to low and cook the lentils in a very gentle simmer just until they are tender  — April recommends 25 minutes, but mine took 35 and needed a touch more water at the end. Take the pan off the heat and let the lentils cool a bit before draining them. Pick out and discard the sage and garlic. You’ll have about 2 cups cooked lentils.", 
            "Make the dressing: Mix together the ground coriander and cumin in a small bowl. Mash the garlic clove to a paste with 1 teaspoon salt (use half as much Kosher salt, even less table salt) on a cutting board or in a mortar. In a small bowl for your dressing, combined the mashed garlic, tahini, 3 tablespoons of the lemon juice, 2 tablespoons of the olive oil, 1 teaspoon of the ground coriander-and-cumin mixture and 2 tablespoons water. Stir well, then taste. Add more lemon if desired.", 
            "Assemble the salad: Place onion slices in a medium bowl and break them up with your fingers. Sprinkle in two good pinches of salt, then two teaspoons of lemon juice, two remaining teaspoons of olive oil and the cilantro or parsley. Toss well, then crumble in the cheese and gently toss again.", 
            "Toss the lentils with the drained chickpeas, preserved lemon rind (if using), and 1 teaspoon flaky sea salt (use half as much Kosher salt, even less table salt) in a large mixing bowl. Pour in the tahini dressing and toss it all together really well, then stir in the onion-feta mixture.", 
            "Arrange the salad in bowl or platter. Sprinkle the mixture with the sesame seeds and some of the remaining spices. Serve, and don’t forget to share.", 
            "P.S. We had this with a Simple Potato Gratin (a post I’m itching to update even more simply, and less hideously, but the important stuff is there) and lamb chops (may I recommend these?). ", 
            "** To toast and grind spices: Put the spices, one at a time, in a small dry pan over medium-high heat. Toast, shaking the pan frequently, until the spices become very sweet and fragrant, anywhere from 2 to 4 minutes. Let them cool in a bowl or on a small plate and grind in a mortar and pestle or in a coffee grinder."
        ], 
        "date": "2013-04-01T12:27:09+00:00"
    }, 
    {
        "ingredient_list": [
            "For the bowl", 
            "1 cup dried rice or another cooking grain of your choice", 
            "1 to 2 sweet potatoes (about 1.5 pounds)", 
            "1 large bundle broccoli (about 1 pound)", 
            "1 to 2 tablespoons olive oil", 
            "Coarse or kosher salt", 
            "Freshly ground black pepper", 
            "1 teaspoon white sesame seeds", 
            "1 teaspoon black sesame seeds", 
            "For the miso-sesame dressing", 
            "1 tablespoon minced fresh ginger", 
            "1 small garlic clove, minced", 
            "2 tablespoons white miso (the mildest kind)", 
            "2 tablespoons tahini (other nut butters can work in a pinch)", 
            "1 tablespoon honey", 
            "1/4 cup rice vinegar", 
            "2 tablespoons toasted sesame oil", 
            "2 tablespoons olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/10/10129849956_5b4c826237_o.jpg?w=750", 
        "tags": [
            "Broccoli", 
            "Budget", 
            "Fall", 
            "Grain/Rice", 
            "Lunch", 
            "Photo", 
            "Potatoes", 
            "Vegan", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/10/miso-sweet-potato-and-broccoli-bowl/", 
        "title": "miso sweet potato and broccoli bowl", 
        "directions": [
            "Heat oven to 400 degrees. Place rice or grain and cooking liquid in a rice cooker or on the stove. Cook according to package directions.", 
            "Peel sweet potatoes and cut into 1-inch cubes. Cut tops off broccoli and separate into bite-sized florets. If your broccoli stems feel especially woody, I like to peel them (with the same vegetable peeler), then cut them into 1/2- to 1-inch segments. ", 
            "Coat one large or two smaller trays with a thin slick of olive oil. Layer sweet potatoes on tray(s) and sprinkle with salt and pepper. Roast for 20 minutes, until browning underneath. Flip and toss chunks around, then add broccoli to the tray(s), season again with salt and pepper, and roast for another 10 to 20 minutes, until broccoli is lightly charred at edges and sweet potato is fully bronzed and tender. Toss chunks around one more time if it looks like they’re cooking unevenly.", 
            "In a small skillet, toast black and white sesame seeds until fragrant. (You can do this in the oven if using an oven-proof skillet.) Let cool.", 
            "While vegetables roast, prepare sesame-miso dressing: Combine everything in a blender and run until smooth, scraping down sides once. Taste and adjust ingredients if needed, but try to resist adding more honey if it tastes salty, as that extra pop of saltiness is exactly what I think sweet potato needs.", 
            "Assemble bowls: Scoop some rice/grains into each, then pile on the roasted sweet potatoes and broccoli. Coat lightly with sesame-miso dressing and finish with toasted sesame seed duo. Serve with extra dressing on the side."
        ], 
        "date": "2013-10-07T12:03:49+00:00"
    }, 
    {
        "ingredient_list": [
            "Oregano dressing", 
            "4 cloves garlic", 
            "1 to 2 tablespoons dried oregano (Nancy recommends 2; I got nervous and used 1, but might not have minded more)", 
            "2 teaspoons kosher salt", 
            "Freshly ground black pepper", 
            "2 tablespoons lemon juice, or juice of 1 lemon", 
            "1/4 cup red wine vinegar", 
            "1/4 cup olive oil, ideally extra-virgin", 
            "Salad and assembly", 
            "1 (15-ounce) can chickpeas or 1 3/4 cups cooked chickpeas, drained", 
            "1 small red onion, peeled and sliced into paper-thin rings", 
            "1/2 pound provolone (see Note about varieties), sliced 1/8-inch thick then cut into 1/4-inch ribbons", 
            "1/2 pound salami, peeled, sliced 1/8-inch thick then cut into 1/4-inch ribbons", 
            "4 medium or 8 small pickled pepperoncini, sliced into rings", 
            "3/4 pound cherry tomatoes", 
            "Sea salt", 
            "1 head iceberg lettuce (see Note about size), halved, cored, and cut in 1/2-inch ribbons", 
            "1 head radicchio, halved, cored and cut in 1/4-inch ribbons", 
            "2 tablespoons dried oregano for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/nancys-chopped-salad1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Gluten-Free", 
            "Italian", 
            "Lunch", 
            "Photo", 
            "Radicchio", 
            "Salad", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/06/nancys-chopped-salad/", 
        "title": "nancy’s chopped salad", 
        "directions": [
            "Make dressing: Roughly chop the garlic and then add the oregano, salt and up to 1/2 teaspoon ground pepper. Chop the mixture together and use the side of a knife or a mortar and pestle to make a grainy herb paste. Transfer the paste to a large salad bowl, and add the lemon juice and vinegar. Mix with a fork allowing the salt to dissolve, then add the oil and whisk with a fork until well combined. The dressing should be thick with garlic and oregano. If you’re using a small head of iceberg, transfer 1/3 the dressing into a small bowl to be used only if needed. For a larger head of iceberg, you’ll want it all.", 
            "Assemble salad: Gently fold the chickpeas, red onion, provolone, salami, pepperoncini (including seeds and juice) into the dressing, one at a time. Halve the tomatoes lengthwise and season with 1 1/2 teaspoons sea salt. Set aside until ready to serve.", 
            "To serve: When ready to serve, gently add the tomatoes, lettuce and radicchio to the salad bowl, along with a couple of generous pinches of oregano, and toss to combine with the dressing. Adjust seasonings to taste, adding any reserved dressing if needed. Serve immediately.", 
            "Sicilian Oregano Sources: It’s definitely available online here and here. If you’re in NYC, I bought the jar you see here at Brooklyn Larder a year or two ago for about $7. However, I was over at Buon Italia in Chelsea Market today (6/5) and they sell, well, almost a tree of the stuff, easily 10 times what was in that jar, for all of $4.50. Buy it and share it with all of your friends! "
        ], 
        "date": "2014-06-02T12:24:46+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pints (1 1/2 pounds) grape or cherry tomatoes (1 1/2 lb)", 
            "3 large garlic cloves, left unpeeled", 
            "1/4 cup olive oil, plus more for tomatoes", 
            "1/4 cup warm water", 
            "1 teaspoon fresh lemon juice", 
            "1 teaspoon kosher salt", 
            "1/4 teaspoon black pepper", 
            "2 3/4 cups vegetable broth", 
            "2 1/4 cups (12 ounces or 340 grams) pearl couscous, sometimes sold as Israeli couscous", 
            "1/2 cup Kalamata or other brine-cured black olives, pitted and chopped", 
            "1/3 cup chopped fresh flat-leaf parsley", 
            "1/4 cup chopped fresh mint", 
            "1 teaspoon chopped fresh thyme"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/pearl-couscous-with-olives-and-roasted-tomatoes.jpg?w=750", 
        "tags": [
            "Grain/Rice", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tomatoes", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/07/pearl-couscous-with-olives-and-roasted-tomatoes/", 
        "title": "pearl couscous with olives and roasted tomatoes", 
        "directions": [
            "\nPrepare tomatoes:  Heat oven to 300°F. Halve tomatoes through stem ends and arrange, cut sides up, in 1 layer on a large baking sheet. Add garlic to pan and drizzle both tomatoes and garlic lightly with oil (about 1 tablespoon). Sprinkle with salt. Roast in middle of oven until tomatoes are slightly shriveled around edges, about 1 hour. Cool in pan on a rack 20 to 30 minutes.", 
            "Meanwhile, make couscous:  Bring broth to a boil in a 3-quart heavy saucepan and stir in couscous, then simmer, uncovered, 6 minutes. Cover pan and remove from heat. Let stand 10 minutes. Spread couscous in one layer on a baking sheet or plate and cool 15 minutes.", 
            "When tomatoes are done, make dressing:  Peel garlic and puree with 1/4 cup oil, water, lemon juice, 1 teaspoon salt, 1/4 pepper, and 1/2 cup roasted tomatoes in a blender until dressing is very smooth. Adjust seasonings to taste.\nAssemble and serve: Transfer cooled couscous to a bowl and stir in olives, roasted tomatoes, herbs, and dressing. Season to taste with more salt and pepper as needed.\nDo ahead: Roasted tomatoes, dressing, and couscous can be made 1 day ahead and kept separately, covered and chilled. Bring to room temperature before proceeding."
        ], 
        "date": "2007-07-24T14:25:33+00:00"
    }, 
    {
        "ingredient_list": [
            "8 to 10 small waxy potatoes (about 1 ounce each), scrubbed and quartered", 
            "1 cup vegetable or another broth; just use salted water if you don’t have it around", 
            "1/4 cup olive oil", 
            "8 ounces (usually 1 bundle) broccolini, trimmed and halved lengthwise or chopped into 1-inch pieces", 
            "1 small red or white onion, thinly sliced", 
            "8 large eggs", 
            "1 cup (about 3 to 3 1/2 ouncesgrated Parmesan cheese", 
            "Salt and freshly ground black pepper, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/potato-and-broccolini-frittata1.jpg?w=640", 
        "tags": [
            "Broccoli", 
            "Brunch", 
            "Eggs", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Potatoes", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/10/potato-and-broccolini-frittata/", 
        "title": "potato and broccolini frittata", 
        "directions": [
            "Place the potatoes and broth in a large, ovenproof frying pan, ideally one that is 12 inches. Bring to a boil and simmer for 10 minutes, turning the potatoes often, until almost all of the stock has been absorbed and the potatoes are tender. ", 
            "Add olive oil, broccolini and onion to the potatoes in the frying pan and cook over medium heat for 1 minute, turning frequently, just to get everything coated with oil, Then, reduce the heat to medium-low and cover the pan, cooking for 3 to 4 more minutes, or until the broccolini has become mostly tender.", 
            "Heat your broiler.", 
            "Beat eggs with half the parmesan, salt and pepper, and pour it over the vegetables in the frying pan. Cover and cook over medium (or medium-low, if yours seems to be browning too quickly) until the eggs are mostly, set. Sprinkle remaining parmesan over frittata and run the whole pan under the broiler, until the top is bronzed and the eggs are just set throughout, approximately 5 minutes, but this could vary due to how robust your broiler is (mine is terrible; it took longer).", 
            "Let cool slightly before slicing into wedges or squares."
        ], 
        "date": "2013-10-28T12:08:52+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup self-raising (self-rising) flour, sifted", 
            "2 eggs", 
            "20 grams (3/4 ounces) butter, melted [I translated this as 1 1/2 tablespoons]", 
            "1/3 cup (2 1/2 fluid ounces) milk", 
            "Sea salt and cracked black pepper", 
            "1/2 cup fresh ricotta cheese", 
            "1/4 cup torn basil leaves", 
            "75 grams (2 2/3 ounces) leg ham, torn", 
            "1 zucchini (courgette), cut into long, thin strips", 
            "Vegetable oil for shallow frying"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/shes-finally-lost-it1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Pancakes", 
            "Photo", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2006/11/shes-finally-lost-it/", 
        "title": "zucchini, ham and ricotta fritters", 
        "directions": [
            "Place the flour eggs, butter, milk, salt and pepper in a large bowl and whisk to combine. Fold through the ricotta, basil, ham and zucchini. Place two tablespoon of the oil in a small frying pan [I used a light coating of olive oil spray] and heat over medium heat. Add half of the mixture to the pan and cook for 2-3 minutes each side or until bubbles appear on the surface. Set aside.", 
            "Add another two tablespoons of the oil and repeat with the remaining batter. Cut into wedges to serve. Serves [at least] 2. "
        ], 
        "date": "2006-11-29T23:25:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 head cauliflower", 
            "2 tablespoons extra-virgin olive oil", 
            "1 small onion, chopped", 
            "2 cloves garlic, minced", 
            "1 quart low-sodium chicken stock", 
            "1/2 cup finely grated Parmesan", 
            "Salt and freshly ground black pepper ", 
            "2 tablespoons mayonnaise – or – 1 egg", 
            "1 tablespoon fresh lemon juice", 
            "1/2 teaspoon Dijon mustard", 
            "1 small garlic clove, minced", 
            "1/2 teaspoon Worcestershire sauce", 
            "1 oil-packed anchovy fillet, finely chopped (optional)", 
            "1/4 cup extra-virgin olive oil", 
            "10 to 12 ounces good-quality solid tuna packed in olive oil, well drained*", 
            "2 scallions washed, trimmed and chopped fine", 
            "6 pepperoncini peppers, destemmed and julienned", 
            "3 tablespoons chopped fresh dill", 
            "1/4 cup roasted or smoked almonds, chopped roughly, or a small handful toasted pine nuts", 
            "1/4 cup good-quality olive oil (or the oil the tuna was packed in)", 
            "1 tablespoon smooth Dijon mustard", 
            "1 tablespoon whole-grain mustard", 
            "1 teaspoon balsamic vinegar", 
            "1 teaspoon fresh lemon juice or more to taste", 
            "1/4 to 1/2 teaspoon freshly ground black pepper. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/09/silky-cauliflower-soup.jpg?w=749", 
        "tags": [
            "Cauliflower", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Seafood", 
            "Soup", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2006/09/silky-cauliflower-soup/", 
        "title": "silky cauliflower soup", 
        "directions": [
            "Mix all the ingredients well with a fork in a medium-size, nonreactive bowl. Taste and adjust the lemon juice and pepper. The salad can be made up to 3 days in advance and refrigerated. ", 
            "* I’ve done this two ways, with oil-packed and the reserved oil, as well as using drained water-packed and adding in 1/4 cup olive oil, and have to say that I find the latter to be a far less oil-slicked result. You can always add more olive oil, but I found it hard to take away the heaviness the oil-packed came with."
        ], 
        "date": "2006-09-03T11:54:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 15-ounce can chickpeas, drained and rinsed", 
            "2 tablespoons pitted, halved and very thinly sliced black olives", 
            "1 tablespoon finely chopped red onion", 
            "1 tablespoon chopped fresh parsley", 
            "Zest and juice from half a lemon (if you’ve got one of those sad, juiceless lemons, use both sides for juice)", 
            "Couple good pinches of salt", 
            "A few grinds of black pepper", 
            "A few glugs of olive oil (the original is quite oily, like bread-soaking oily, I went a little lighter. Both ways are delicious)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/smashed-chickpea-salad1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Budget", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2009/01/smashed-chickpea-salad/", 
        "title": "smashed chickpea salad", 
        "directions": [
            "Mix everything but the olive oil in a small to midsize bowl. Very lightly smash the chickpea mixture with the back of a fork or a potato masher. You’re not looking for a hummus-like puree but something closer to a coarse chop with a few smaller bits to hold it together. Add the glugs of olive oil, mix it lightly and enjoy.", 
            "This is also awesome as a sandwich on toasted bread, and it needs nothing else on it. But, if you want to doll it up, here are some ideas: A slice of roasted red pepper (as they do at ‘wichcraft), watercress (ditto), a slice of pickled garlicky red pepper (our way). We schmeared the bread with a tahini dressing, which was just tahini, lemon juice and a minced garlic clove thinned with water, but if you’ve got some harissa, I bet that would also be delicious."
        ], 
        "date": "2009-01-19T14:07:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup mayonnaise", 
            "1/2 cup sour cream", 
            "1 tablespoon prepared horseradish", 
            "1 tablespoon Worcestershire sauce", 
            "2 tablespoons Creole mustard, or a mustard that you prefer", 
            "1 teaspoon smoked paprika", 
            "Zest and juice from 2 lemons", 
            "2 tablespoons Tabasco sauce (see Note; I skipped this)", 
            "1 teaspoon cayenne powder (I used much less)", 
            "3 green onions, thinly sliced (white and green parts)", 
            "1 stalk celery, finely diced", 
            "1/2 jalapeño, finely chopped (I skipped this)", 
            "1/2 medium yellow onion, finely diced (and this)", 
            "1 pound skinned and flaked smoked whitefish", 
            "Salt and pepper, to taste", 
            "Saltine crackers to serve", 
            "1 tablespoons finely chopped chives, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/smoked-whitefish-dip-horseradish1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Photo", 
            "Recipes", 
            "Salad", 
            "Seafood", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2014/11/smoked-whitefish-dip-with-horseradish/", 
        "title": "smoked whitefish dip with horseradish", 
        "directions": [
            "Make the dressing by mixing mayonnaise, sour cream, horseradish, Worcestershire, mustard, paprika, zest and lemon juice, hot sauce (if using), cayenne (to taste), green onions, celery, jalapeño (if using) and onion in a medium bowl. Season with salt and pepper to taste.\nPlace skinned and flaked whitefish in a larger bowl. Add dressing to taste (we used about 3/4 of it total) and adjust seasonings with salt and pepper. Serve with crackers, garnished with chives.\n"
        ], 
        "date": "2014-11-03T11:53:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (10 ounce) package frozen spinach, thawed, squeeze of all excess liquid, and chopped", 
            "1 1/2 cups finely chopped onion (1 large)", 
            "3 tablespoons unsalted butter", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper", 
            "1/4 teaspoon freshly grated nutmeg", 
            "8 cups cubed French or Italian bread in 1-inch cubes (1/2 lb)", 
            "6 ounces coarsely grated Gruyère (2 cups)", 
            "2 ounces finely grated parmesan (1 cup)", 
            "2 3/4 cups milk", 
            "9 large eggs", 
            "2 tablespoons Dijon mustard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spinach-and-cheese-strata1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/12/spinach-and-cheese-strata/", 
        "title": "spinach and cheese strata", 
        "directions": [
            "Sauté onion in butter in a large, heavy skillet over medium heat until soft, about 5 minutes. Add 1/2 teaspoon salt, 1/4 teaspoon pepper and nutmeg and continue cooking for one minute. Stir in spinach, remove from heat and set aside.", 
            "Spread one third of the bread cubes in a well-buttered 3-quart gratin dish or other ceramic baking dish. Top with one-third of spinach mixture and one-third of each cheese. Repeat layering twice with remaining bread, spinach and cheese.", 
            "Whisk eggs, milk, mustard and remaining 1/2 teaspoon salt and 1/4 teaspoon pepper together in a large bowl and pour evenly over strata. Cover with plastic wrap and chill strata for eat least 8 hours or up to a day.", 
            "The next day, let it stand at room temperature for 30 minutes while preheating the oven to 350°F. Bake strata, uncovered, in middle of oven until puffed, golden brown, and cooked through, 45 to 55 minutes. Let stand 5 minutes before serving."
        ], 
        "date": "2009-12-22T12:27:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 2/3 cups (215 grams) all-purpose flour", 
            "3/4 teaspoon kosher salt", 
            "12 tablespoons (170 grams) cold unsalted butter, diced", 
            "3 tablespoons (45 grams) very cold water", 
            "Nonstick spray oil, for coating pan", 
            "3/4 cup (176 grams, 6 ounces, or 3/4 of an 8-ounce brick) cream cheese, soft at room temperature", 
            "2/3 cup (155 ml) half-and-half or 1/3 cup each whole milk and heavy cream", 
            "6 large eggs", 
            "2 10-ounce (283-gram) packages frozen chopped spinach, thawed", 
            "1 cup (115 grams or 4 ounces) grated cheddar or gruyere", 
            "1/2 cup (50 grams) finely grated Parmesan", 
            "1 small bundle (2 to 3 ounces or about 8 thin green onions) thinly sliced", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/spinach-sheet-pan-quiche.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Casserole", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Spinach", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/11/spinach-sheet-pan-quiche/", 
        "title": "spinach sheet pan quiche", 
        "directions": [
            "Make crust: In a food processor, blend flour and salt together. Add butter and pulse machine until butter is reduced to a fine meal, or couscous-sized bits. While running machine, drizzle in water; stop when dough has balled, a few seconds later.\nWrap dough in plastic or waxed paper and set in freezer to quick-chill until firm but not rock-hard, about 15 to 20 minutes. You can also chill it in the fridge for 2 hours or up to 1 week until needed.\nLightly coat a 9×13-inch (quarter-sheet) pan with oil. Line bottom with parchment paper.\nTo roll out crust (trickier, but go for it if you’re up for the challenge): Flour your counter well. Remove crust from freezer or fridge, unwrap and flour the top of it. Even if it’s very hard, begin rolling it very gently, in light motions, so it doesn’t crack too much as you stretch it out, to about a 12×16-inch rectangle. Keep flouring top and counter underneath dough as it is prone to sticking. Work as quickly as possible because this dough softens even more than regular pie dough as it warms.\nTransfer dough to prepared pan. Lift overhang to let dough slack/droop into corners so you’re not stretching it a lot to shape it to the pan. Trim overhang to 1/2- to 1-inch, then fold overhang onto sides of dough, pressing all around and letting the dough extend slightly over the edge of the pan.\nTo press in crust (less tricky, and what I always wish I’d done): Press dough in an even layer across bottom of pan; leave it thicker as it goes up the sides; pressing all around and letting the dough extend slightly over the edge of the pan.\nBoth methods: Freeze shaped dough until solid, about 20 minutes. Save your scraps! You can use them to patch any holes or cracks formed when baking.\nMeanwhile, heat oven to 425 degrees F. Coat a large sheet of foil lightly with spray oil. Once crust is solid, prick it all over with a fork and press foil, oiled side down, tightly against dough. Fill foiled crust to the top with pie weights, dried beans or rice (that you don’t plan to eat at any time) or even pennies. Bake for 20 minutes then gently, carefully remove foil and weights and bake for 5 more minutes, unfilled.\nWhile crust par-bakes, make filling: Use an electric mixer or your best whisking skills to beat cream cheese in the bottom of a large bowl until smooth and fluffy. Gradually drizzle in half-and-half, whisking the whole time so that the mixture incorporates smoothly. Whisk in eggs, two at a time, until combined. Squeeze out spinach in handfuls, removing as much extra moisture as possible. Stir in spinach, cheddar, parmesan, scallions, salt and pepper.\nWhen crust has finished parbaking, leave oven on. Inspect crust for cracks or holes and use reserved dough to patch them if necessary. Pour in filling just to the top of the crust. You will probably have about 3/4 cup more filling than you can fit in the crust (not an issue if going crust-less or if you didn’t parbake the crust); you can bake this off in a separate oiled dish for an excellent breakfast on toast tomorrow.\nBake quiche until crust is golden brown and filling is set, about 25 minutes. Cool at least 10 minutes before serving. Quiche keeps in fridge for 4 to 5 days."
        ], 
        "date": "2016-11-28T13:12:54+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 pound dried rice noodles (see notes up top)", 
            "2 tablespoons toasted sesame oil, plus a splash to loosen noodles", 
            "2 tablespoons Chinese sesame paste or tahini (see note up top)", 
            "1 tablespoon smooth peanut butter", 
            "3 1/2 tablespoons soy sauce", 
            "2 tablespoons Chinese rice vinegar", 
            "1 tablespoon granulated or brown sugar", 
            "1 tablespoon finely grated ginger", 
            "2 teaspoons minced garlic (from 1 medium-large clove)", 
            "Chili-garlic paste, to taste", 
            "1/2 pound cucumber, very thinly sliced", 
            "1/2 cup roasted salted peanuts, roughly chopped", 
            "A handful of chopped fresh herbs, such as mint and cilantro, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/08/takeout-style-sesame-noodles-with-cucumber1.jpg?w=640", 
        "tags": [
            "Chinese", 
            "Cucumber", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/08/takeout-style-sesame-noodles-with-cucumber/", 
        "title": "takeout-style sesame noodles with cucumber", 
        "directions": [
            "Cook noodles according to package directions and rinse with cold water to cool. Drain well. Drizzle with a tiny splash of toasted sesame oil to keep them from sticking until dressed.", 
            "Meanwhile, whisk sesame paste and peanut butter in the bottom of a small bowl, then whisk in soy sauce, rice vinegar, remaining 2 tablespoons sesame oil, sugar, ginger, garlic and chile-garlic paste to taste until smooth. Adjust flavors to taste. It might seem a bit salty from the bowl, but should be just right when tossed with noodles.", 
            "Toss sauce with cold noodles. ", 
            "Place a medium-sized knot of dressed noodles in each bowl, followed by a pile of cucumber. Garnish generously with peanuts and herbs. Serve with extra chile-garlic paste on the side. "
        ], 
        "date": "2015-08-04T11:09:20+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large shallots, 1 halved, 1 finely diced,", 
            "4 sprigs of thyme", 
            "1 small bay leaf", 
            "1 cup dry small green lentils (see Note up top for varieties)", 
            "1 small bay leaf", 
            "Salt and pepper", 
            "1 pound fingerling potatoes", 
            "2 tablespoons red wine vinegar", 
            "1 to 2 garlic cloves, minced or smashed to a paste (I use less)", 
            "1 tablespoon smooth Dijon mustard", 
            "1/4 cup of your favorite olive oil", 
            "2 teaspoons capers, rinsed if salted, drained if brined, and roughly chopped", 
            "2 tablespoons cornichons or other sour gherkins, roughly chopped", 
            "1 to 2 scallions, thinly sliced", 
            "1/2 cup chopped flat leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/01/warm-lentil-and-potato-salad.jpg?w=750", 
        "tags": [
            "Beans", 
            "Lunch", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Side Dish", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/01/warm-lentil-and-potato-salad/", 
        "title": "warm lentil and potato salad", 
        "directions": [
            "Cook lentils: Pick over and rinse lentils. Place them in a small/medium saucepan with the halved shallot, thyme branches, bay leaf, some salt and 4 cups of water. Simmer the lentils over medium heat for 25 to 30 minutes, until firm-tender. Drain (discarding shallot, thyme and bay leaf) and keep warm.", 
            "Meanwhile, cook potatoes: In a separate saucepan, cover potatoes with 1 to 2 inches cold water. Set timer for 15 minutes, then bring potatoes to a simmer. When the timer rings, they should be easily pierced with a toothpick or knife. Drain and keep warm. ", 
            "Make the dressing: Place the chopped shallot and red wine vinegar in the bottom of a small bowl and let sit for 5 minutes. Whisk in minced garlic, dijon, a pinch of salt, a few grinds of black pepper and olive oil. Stir in chopped capers, cornichon and scallions. ", 
            "Assemble salad: Slice potatoes into 1/2-inch segments and place in serving bowl. Add lentils, dressing and all but 1 tablespoon parsley and combine. Adjust seasoning with additional salt and pepper if needed. Scatter salad with remaining parsley. ", 
            "Serve alone, with a soft-cooked egg on top, or as a side to a larger roast, chop or sausages. Reheat as needed. If you plan to make this at the outset of several meals and would like to eat it warm, I’d keep the dressing separate, warming only the lentils and potatoes and stirring in the cold dressing to taste.", 
            "Keeps in fridge for up to 5 days."
        ], 
        "date": "2014-01-21T12:32:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (8 to 8 1/4 ounces) roasted and mashed winter squash", 
            "1/3 cup (80 grams) yogurt or sour cream", 
            "2 large eggs", 
            "1/2 cup (about 30 grams) finely grated gruyere, comte or parmesan", 
            "3/4 teaspoon fine sea or table salt", 
            "A few grinds of black pepper", 
            "1 teaspoon baking powder", 
            "1 cup (130 grams) all-purpose flour", 
            "Butter or olive oil for frying pan", 
            "2 to 3 tablespoons butter", 
            "A pinch or two of salt", 
            "A few fresh sage leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/winter-squash-pancakes-with-crispy-sage-and-brown-butter.jpg?w=750", 
        "tags": [
            "Fall", 
            "Freezer Friendly", 
            "Lunch", 
            "Pancakes", 
            "Photo", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2016/10/winter-squash-pancakes-with-crispy-sage-and-brown-butter/", 
        "title": "winter squash pancakes with crispy sage and brown butter", 
        "directions": [
            "In a large bowl, whisk squash, yogurt, eggs, cheese, salt, pepper and baking powder until smooth. Add flour and stir until just combined. Batter will be thick.\nHeat a large frying over medium-low to medium heat. Coat the bottom with butter or olive oil, or a combination thereof, and spoon in pancake batter, a heaped soup spoon or scant 1/4 cup at a time. Press the back of the batter mound to flatten the pancake slightly. Cook until golden brown underneath, flip and then cook until the color until golden brown on the second side. If this is happening very fast, lower your heat. If you’re worried pancakes have not cooked in the center, you can finish them for 10 minutes in a 250 degrees oven. You can also keep your pancakes warm there until needed. Repeat with remaining batter.\nTo finish, wipe out frying pan and place butter, a pinch or two of salt and sage leaves back in it, heating over medium. The sage leaves will crisp and the butter will brown in a minute or two so keep a close watch on it. Pour leaves and butter over pancakes and quickly understand why you’ll never have them another way.\nTo roast squash: For butternut or kabocha, I halve the squash, scoop out the seeds and roast it face-down on an oiled baking sheet that I’ve sprinkled with coarse salt at 375 for 40 to 50 minutes, until tender. I get about 2 cups mashed squash from one 2-pound (i.e. small-medium) whole squash. If yours is already peeled and in, say, 1-inch chunks, it will likely be tender in just 25 minutes (just updated after rechecking my notes)."
        ], 
        "date": "2016-10-17T12:08:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (about 2 medium) zucchini", 
            "1 teaspoon coarse or Kosher salt, plus extra to taste", 
            "2 scallions, split lengthwise and sliced thin", 
            "1 large egg, lightly beaten", 
            "Freshly ground black pepper", 
            "1/2 cup all-purpose flour", 
            "1/2 teaspoon baking powder", 
            "Olive or another oil of your choice, for frying", 
            "To serve (optional)", 
            "1 cup sour cream or plain, full-fat yogurt", 
            "1 to 2 tablespoon lemon juice", 
            "1/4 teaspoon lemon zest", 
            "Pinches of salt", 
            "1 small minced or crushed clove of garlic"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/08/zucchini-fritters.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Pancakes", 
            "Photo", 
            "Put An Egg On It", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2011/08/zucchini-fritters/", 
        "title": "zucchini fritters", 
        "directions": [
            "Preheat oven to 200 degrees. Have a baking sheet ready.", 
            "Trim ends off zucchini and grate them either on the large holes of a box grater or, if you have one, using the shredding blade of a food processor. The latter is my favorite as I’m convinced it creates the coarsest and most rope-like strands and frankly, I like my fritters to look like mops.", 
            "In a large bowl, toss zucchini with 1 teaspoon coarse salt and set aside for 10 minutes. Wring out the zucchini in one of the following ways: pressing it against the holes of a colander with a wooden spoon to extract the water, squeezing out small handfuls at a time, or wrapping it up in a clean dishtowel or piece of cheese cloth and wringing away. You’ll be shocked (I was!) by the amount of liquid you’ll lose, but this is a good thing as it will save the fritters from sogginess.", 
            "Return deflated mass of zucchini shreds to bowl. Taste and if you think it could benefit from more salt (most rinses down the drain), add a little bit more; we found 1/4 teaspoon more just right. Stir in scallions, egg and some freshly ground black pepper. In a tiny dish, stir together flour and baking powder, then stir the mixture into the zucchini batter.", 
            "In a large heavy skillet — cast iron is dreamy here — heat 2 tablespoons of oil over medium-high heat until shimmering. Drop small bunches of the zucchini mixture onto the skillet only a few at a time so they don’t become crowded and lightly nudge them flatter with the back of your spatula. Cook the fritters over moderately high heat until the edges underneath are golden, about 3 to 4 minutes. If you find this happening too quickly,  reduce the heat to medium. Flip the fritters and fry them on the other side until browned underneath again, about 2 to 3 minutes more. Drain briefly on paper towels then transfer to baking sheet and then into the warm oven until needed. Repeat process, keeping the pan well-oiled, with remaining batter. I like to make sure that the fritters have at least 10 minutes in the oven to finish setting and getting extra crisp.", 
            "For the topping, if using, stir together the sour cream, lemon juice, zest, salt and garlic and adjust the flavors to your taste. Dollop on each fritter before serving. These fritters are also delicious with a poached or fried egg on top, trust me.", 
            "Do ahead: These fritters keep well, either chilled in the fridge for the better part of a week and or frozen in a well-sealed package for months. When you’re ready to use them, simply spread them out on a tray in a 325 degree oven until they’re hot and crisp again."
        ], 
        "date": "2011-08-25T15:47:52+00:00"
    }
]