{
  "date": "2016-10-24T12:26:38+00:00",
  "directions": [
    "Prepare pork: Use a sharp knife to remove the thick skin from the pork, but not trimming off all the fat — leave a thin sheen. Season generously with salt and place in fridge until ready to use — overnight is ideal but a few hours will cut it as well.\nBraise the pork: Heat your oven to 350 degrees. Heat a deep saucepan or Dutch oven over medium-high and add 2 tablespoons of the olive oil. When it shimmers, gently cook the onion, celery and fennel until they begin to soften, about 10 minutes. Add the stock and thyme and bring to a simmer, then season well with salt and pepper.",
    "Rinse pork to remove excess salt, dry with a paper towel and add to seasoned broth. Cover and place in the oven for 90 minutes or more, until the meat just begins to pull away from the bone.\nAllow both meat and broth to cool in the braise out of the oven for 30 minutes, or until you can touch the meat with your hands. Remove the pork and gently pull the meat from the bone, then tear the chunks into bite-size shreds. Place these in a large bowl.\nStrain the braising liquid, pouring enough of it over the pork to barely cover it and keep it from drying out.",
    "Pour the rest back into the pot, simmering it until it is reduced by half. Add pork and cooking liquid that has covered it, and warm it back to a simmer. Taste and adjust seasonings, adding more salt and pepper if needed. Add the butter and stir to emulsify.\nBring large pot of well-salted water to boil. Cook pasta until al dente, or usually a minute shy of package directions. Drain and add to the pork ragu, simmering for 1 minute.  Add the lemon juice, half the cheese and parsley, if using. Ladle into wide pasta bowls with and top with arugula and remaining cheese. We enjoyed this with an extra lemon wedge on the side.’\nDo ahead: Should you wish to freeze this — we froze half and I was overjoyed to find it again last month — shred the pork and return it to the reduced cooking liquid, stopping short of the butter; freeze them together in a bag. Once defrosted, rewarm to a simmer, add a splash or two of pasta cooking water if needed to loosen it, and then the butter (this ensures you get the most flavor from it). Add freshly cooked pasta, lemon and parmesan from here."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/broken-pasta-with-pork-ragu.jpg?w=750",
  "ingredient_list": [
    "1 bone-in pork shoulder, about 4 pounds",
    "Kosher salt",
    "2 tablespoons olive oil",
    "1 medium white or yellow onion, peeled and cut into large pieces",
    "1 large rib celery, cut into large pieces",
    "1 small fennel bulb, trimmed and cut into large pieces",
    "1 quart chicken stock, plus a splash or two more, if needed",
    "3 sprigs fresh thyme",
    "Freshly ground black pepper",
    "4 tablespoons unsalted butter",
    "2 9-ounce boxes dry lasagna, broken into 3-inch shards",
    "2 tablespoons fresh lemon juice, or more to taste",
    "2 tablespoons (although I use more) grated or shaved parmesan or grana padano cheese",
    "1 tablespoon chopped parsley (optional)",
    "Large handful arugula leaves, cleaned"
  ],
  "tags": [
    "Arugula",
    "Date Night",
    "Fall",
    "Freezer Friendly",
    "Italian",
    "Meat",
    "Pasta",
    "Photo",
    "Winter"
  ],
  "title": "broken pasta with pork ragu",
  "url": "https://smittenkitchen.com/2016/10/broken-pasta-with-pork-ragu/"
}