{
  "date": "2014-07-10T11:09:44+00:00",
  "directions": [
    "Heat oven to 350°F. Line two 8×8-inch square baking pans with parchment paper, extending it up two sides. Butter the parchment and exposed sides of the pan or spray them with a nonstick cooking spray.",
    "In a medium heatproof bowl over gently simmering water, heat chocolate and butter together until about 3/4 of the way melted.  Remove from heat and stir until smooth. Stir in sugar until fully combined, then eggs, one at a time and vanilla. Stir in salt until combined, then flour, until it just disappears. ",
    "Divide batter between two prepared pans and spread it evenly — an offset spatula will make this easier. Bake on different racks for 12 to 15 minutes, rotating once top to bottom and front to back, until a toothpick inserted into the center of each pan comes out batter-free. Transfer hot pans directly to freezer (you can put down dish towels or a cooling rack to protect shelves). Chill until cold and firm, about 15 to 20 minutes. ",
    "Remove first pan from freezer, and, working quickly, cover with ice cream. (I did this in a patchwork 1-tablespoon scoops of each flavor for a mottled look.) Use a spatula to smoosh it down and smooth the top. Remove second brownie pan from freezer. Run a knife between edges of brownie and pan to make sure it’s not sticking anywhere and use parchment sling to life the brownie out of the pan, remove the parchment and place it on top of the ice cream. Place the empty brownie pan on top of the brownie lid, to weight it, and press down a little. Keeping the weighting pan on top, return brownie-ice cream stack to freezer until fully firm, another 30 minutes. Run a knife around brownie stack again to make sure it’s not stuck, and use the parchment sling to transfer the ice cream sandwich block to a cutting bard. Cut into squares — we cut it into 16 (4×4), but I might make 25 (5×5) tinier ones next time instead.",
    "You can store the cut sandwiches in an airtight container or bag in the freezer as-is, or individually wrapped in squares of waxed paper. They should keep for at least two months in the freezer, but good luck with that."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/brownie-ice-cream-sandwiches1.jpg?w=640",
  "ingredient_list": [
    "",
    "\t\t",
    "\t",
    "\t\tWithin reason, I think if you’re craving something, you should go for it, although this theory is mostly born of my own poor logic. I’ve all too many times craved, say, a brownie but thought I shouldn’t eat a brownie and so instead snacked on (just for a completely random example) 12 almonds, 1 slice of cheese, half an apple, 1 banana and then, oops, a handful of chocolate chips, amounting roughly 3x the calories of a brownie, a brownie that I craved exactly as much as I did 500 calories ago. And so, when I really want a brownie, I make my favorite brownies and we each eat one and then I stash the rest in the freezer, so they are not out on the counter, calling to me that we haven’t been cut in a straight line and you should really even us out or we’re going to go bad soon and you don’t want us to go to waste or any of those things that brownies tell me when we’re alone together.",
    "",
    "",
    "[Hm, here I should probably interject some sort of “sure, okay, brownies talk to me but I’m not like crazy or anything; it’s not weird. Brownies talk to everyone, right? Haha?” reassurance but I’m not going to. I’m going to make this as awkward as possible.]",
    "",
    "",
    "",
    "",
    "Unfortunately, or maybe predictably, the only thing years of stashing brownies in the freezer has taught us is that frozen brownies are very, very good. They’re chewy but not hard, fudgy and intense and I know this sounds like madness but I’d take a cold brownie over a freshly baked, warm, squishy, steamy one any day. ",
    "",
    "",
    "",
    "",
    "",
    "Thus, this was inevitable. If brownies are good frozen, they’re even better enlisted as the header and footer of an ice cream cloud. This might actually be both the easiest and winning-est summer dessert. The one-bowl brownies bake in 15 minutes, head directly to the freezer until cold (another 15 minutes), after which they are filled with ice cream (or ice cream combination; I went for Neapolitan because: summer), lidded, and cut into squares. You will be a hero among your people. Most importantly, the ice cream sandwiches are stored in the freezer, away from temptation, and nothing bad ever comes of that.",
    "",
    "Ice Cream, Previously: The insane Hot Fudge Sundae Cake I made last summer, Classic Ice Cream Sandwiches, Peppermint Hot Fudge Sauce, Ridiculously Easy Butterscotch Sauce and A Deep Dark Salted Butter Caramel Sauce",
    "One year ago: Grilled Bacon Salad with Arugula and Balsamic",
    "Two years ago: Bacon Corn Hash",
    "Three years ago: Whole Wheat Raspberry Ricotta Scones",
    "Four years ago: Light Brioche Burger Buns and Blueberry Boy Bait",
    "Five years ago: Mango Slaw with Cashews and Mint",
    "Six years ago: Chocolate Sorbet",
    "Seven years ago: Quick Potato Pierogi ",
    "\t",
    "",
    "\t",
    "  ",
    "Brownie Ice Cream Sandwiches",
    "This uses the recipe for My Favorite Brownies, but I drop the sugar by 1/3 cup for more of a bittersweet contrast with the sweet ice cream; you won’t miss it at all. The batter is divided into two 8×8 pans (although you can use a single 9×13 for a teensy bit thicker brownie that you can later cut in half to form a top and bottom layer) and bakes in half the time. You can tweak the brownie flavor by adding ground cinnamon, mint extract or some espresso powder. I used a little shy of 3 cups ice cream for this (1 1/2 pints, although I took a 1/2 pint from three flavors, chocolate, vanilla and strawberry, to be difficult) though I think they’d be just fine with only 2 cups ice cream filling, and easier to bite into. For extra fanciness, you can swirl in some homemade hot fudge (with or without the mint), butterscotch, or salted caramel sauce, or you can roll the sides of the ice cream sandwiches in colored sprinkles, toasted and chopped nuts or cookie crumbs. ",
    "For the brownies",
    "3 ounces (85 grams) unsweetened chocolate, roughly chopped",
    "1 stick (4 ounces or 115 grams) unsalted butter, plus extra for pan",
    "1 cup (200 grams) granulated sugar",
    "2 large eggs",
    "1 teaspoon (5 ml) vanilla extract",
    "1/2 teaspoon flaky sea salt or 1/4 teaspoon table salt (about 2 grams)",
    "2/3 cup (85 grams) all-purpose flour",
    "For the filling",
    "2 to 3 cups ice cream (see Note up top)",
    "Heat oven to 350°F. Line two 8×8-inch square baking pans with parchment paper, extending it up two sides. Butter the parchment and exposed sides of the pan or spray them with a nonstick cooking spray.",
    "In a medium heatproof bowl over gently simmering water, heat chocolate and butter together until about 3/4 of the way melted.  Remove from heat and stir until smooth. Stir in sugar until fully combined, then eggs, one at a time and vanilla. Stir in salt until combined, then flour, until it just disappears. ",
    "Divide batter between two prepared pans and spread it evenly — an offset spatula will make this easier. Bake on different racks for 12 to 15 minutes, rotating once top to bottom and front to back, until a toothpick inserted into the center of each pan comes out batter-free. Transfer hot pans directly to freezer (you can put down dish towels or a cooling rack to protect shelves). Chill until cold and firm, about 15 to 20 minutes. ",
    "Remove first pan from freezer, and, working quickly, cover with ice cream. (I did this in a patchwork 1-tablespoon scoops of each flavor for a mottled look.) Use a spatula to smoosh it down and smooth the top. Remove second brownie pan from freezer. Run a knife between edges of brownie and pan to make sure it’s not sticking anywhere and use parchment sling to life the brownie out of the pan, remove the parchment and place it on top of the ice cream. Place the empty brownie pan on top of the brownie lid, to weight it, and press down a little. Keeping the weighting pan on top, return brownie-ice cream stack to freezer until fully firm, another 30 minutes. Run a knife around brownie stack again to make sure it’s not stuck, and use the parchment sling to transfer the ice cream sandwich block to a cutting bard. Cut into squares — we cut it into 16 (4×4), but I might make 25 (5×5) tinier ones next time instead.",
    "You can store the cut sandwiches in an airtight container or bag in the freezer as-is, or individually wrapped in squares of waxed paper. They should keep for at least two months in the freezer, but good luck with that.",
    "Rate this:Do More:TwitterFacebookPinterestPrintEmail\t\t\t",
    "For the brownies",
    "3 ounces (85 grams) unsweetened chocolate, roughly chopped",
    "1 stick (4 ounces or 115 grams) unsalted butter, plus extra for pan",
    "1 cup (200 grams) granulated sugar",
    "2 large eggs",
    "1 teaspoon (5 ml) vanilla extract",
    "1/2 teaspoon flaky sea salt or 1/4 teaspoon table salt (about 2 grams)",
    "2/3 cup (85 grams) all-purpose flour",
    "For the filling",
    "2 to 3 cups ice cream (see Note up top)"
  ],
  "tags": [
    "Brownies/Blondies",
    "Chocolate",
    "Ice Cream/Sorbet",
    "Photo",
    "Summer"
  ],
  "title": "brownie ice cream sandwiches",
  "url": "https://smittenkitchen.com/2014/07/brownie-ice-cream-sandwiches/"
}