{
  "date": "2006-12-18T20:56:54+00:00",
  "directions": [
    "1.\tPut the chocolate in a heatproof bowl and keep it close at hand. In a small bowl, beat 1 tablespoon of the heavy cream with the egg yolks just until the eggs are liquid. Check that the butter is soft but not oily. If necessary, either beat it with a rubber spatula to soften it or smear it against the counter under the heel of your hand.",
    "2.\tPour the remaining cream into a saucepan, toss in the split vanilla bean, and bring the cream to a full boil. Pull out the vanilla bean, then pour the hot cream over the chocolate. Wait for about 30 seconds, then, working with a whisk, gently blend the cream into the chocolate. Still whisking delicately, incorporate the yolks, followed by the butter. Pour the ganache into the crust (if you have a little leftover, you can freeze it or use it to fill sandwich cookies). Jiggle the crust a bit to even out the ganache, and leave the tart on the counter until the filling set, about 20 minutes, depending on the temperature of your kitchen. (If your kitchen is really warm, pop the tart into the refrigerator for 20 minutes, just to set the ganache, then keep it at room temperature after it has set.)",
    "Do ahead: The tart is best served at room temperature the day it is made. If you must keep it, refrigerate it over night, then let it stand at room temperature for about 2 hours before serving."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chocolate-concise1.jpg?w=500",
  "ingredient_list": [
    "2 1/2sticks (10 ounces; 290 grams) unsalted butter, at room temperature",
    "1 1/2cups (150 grams) confectioners’ sugar, sifted",
    "Lightly packed 1/2 cup (2 1/4ounces; 70 grams) ground blanched almonds",
    "1/2 teaspoon salt",
    "1/2 teaspoon pure vanilla extract",
    "2 large eggs, at room temperature",
    "3 1/2 cups (490 grams) all-purpose flour",
    "8 ounces (224 grams) bittersweet chocolate, finely chopped",
    "2/3 cup (160 grams) heavy cream",
    "2 large egg yolks, at room temperature",
    "2 tablespoons (1 ounce; 30 grams) unsalted butter, at room temperature",
    "1/2 moist, plump vanilla bean, split lengthwise",
    "1 fully baked 6 1/2-inch (16-cm) tart shell made from Sweet Tart Dough"
  ],
  "tags": [
    "Chocolate",
    "Photo",
    "Tarts/Pies"
  ],
  "title": "robert linxe’s chocolate tart",
  "url": "https://smittenkitchen.com/2006/12/chocolate-concise/"
}