{
  "date": "2008-11-13T23:26:06+00:00",
  "directions": [
    "Combine flour, baking powder and salt in small bowl; whisk to blend. Stir chocolate and butter in top of double boiler set over simmering water until melted and smooth. Remove from over water. Cool mixture to lukewarm.",
    "Using electric mixer, beat sugar and eggs in bowl until thick, about 5 minutes. Beat in chocolate mixture and vanilla.",
    "Stir in flour mixture, then toffee and nuts. Chill batter until firm, about 45 minutes.",
    "Preheat oven to 350°F. Line 2 large baking sheets with parchment or waxed paper. Drop batter by spoonfuls onto sheets, spacing two inches apart. Sprinkle with a pinch of flaky sea salt, if you’re using it. Bake just until tops are dry and cracked but cookies are still soft to touch, about 12 to 15 minutes. Cool on sheets. (Can be made 2 days ahead. Store airtight at room temperature.)",
    "I know that it will be impossible to let them cool completely, but they really taste a lot better cool, as they continue baking once they come out of the oven.",
    "Slice and bake option: After struggling a bit to scoop these cookies, I rolled the dough into a log 1.5 inches in diameter and chilled it. When I was ready to bake the cookies, I cut it into 1/2-inch slices. You can store the dough log in the freezer, wrapped in waxed paper and then two layers of plastic wrap for up to a month, just baking the cookies off as you need. Cookies baked straight from the freezer may need an additional minute or two in the oven, depending on their thickness. ",
    "* As it turns out, in NYC at least, drug stores such as Duane Reade and Rite Aid are a great–and cheap!–place to find these. We went there after failing to find them in three bodegas."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/chocolate-toffee-cookies1.jpg?w=640",
  "ingredient_list": [
    "1/2 cup all purpose flour",
    "1 teaspoon baking powder",
    "1/2 teaspoon salt",
    "1 pound bittersweet (not unsweetened) or semisweet chocolate, chopped",
    "1/4 cup (1/2 stick) unsalted butter",
    "1 3/4 cups (packed) brown sugar",
    "4 large eggs",
    "1 tablespoon vanilla extract",
    "5 1.4-ounce chocolate-covered English toffee bars (such as Heath), coarsely chopped*",
    "1 cup walnuts, toasted, chopped",
    "Flaky sea salt for sprinkling (optional)"
  ],
  "tags": [
    "Chocolate",
    "Cookie",
    "Photo"
  ],
  "title": "chocolate toffee cookies",
  "url": "https://smittenkitchen.com/2008/11/chocolate-toffee-cookies/"
}