{
  "date": "2014-04-11T11:56:00+00:00",
  "directions": [
    "Heat oven to 325°F. Line two large baking sheets with parchment paper.",
    "Heat approximately half of chocolate chunks in a small saucepan until just melted, then, off the heat, stir in the remaining chunks until they’re smooth. The residual heat should be enough to melt them and leave the mixture lukewarm; if it’s not, heat the mixture again until just melted, but not very hot.",
    "In a food processor, blend the coconut for one full minute. Add sugar and cocoa powder, blend another full minute. Add egg whites, salt and vanilla and blend until combined, then the melted chocolate until smooth. With a tablespoon measure or cookie scoop (I used a #70 scoop), scoop batter into 1-inch mounds. You can arrange the cookies fairly close together as they don’t spread, just puff a bit. ",
    "Bake cookies for 15 minutes, until the macaroons are shiny and just set. Let them rest on the tray for 10 minutes after baking (or you can let them fully cool in place, if you’re not in a rush to use the tray again), as they’ll be hard to move right out of the oven. They’ll firm up as they cool, but still remain softer and less dry inside than traditional macaroons. Thank goodness. ",
    "I like to dust them with a little powdered sugar once they’re cool. They’ll keep in an airtight container until your family finds out about them, or one week, whichever happens first."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/dark-chocolate-macaroons.jpg?w=750",
  "ingredient_list": [
    "4 ounces (115 grams or about 1/3 cup) unsweetened chocolate (sometimes sold as 99%), chopped small",
    "14 ounces (400 grams) sweetened, flaked coconut",
    "2/3 cup (130 grams) granulated sugar",
    "6 tablespoons (30 grams) cocoa powder",
    "3 large egg whites",
    "Heaped 1/4 teaspoon flaked sea salt or level 1/4 teaspoon table salt",
    "1/2 teaspoon vanilla extract "
  ],
  "tags": [
    "Chocolate",
    "Coconut",
    "Cookie",
    "Gluten-Free",
    "Passover",
    "Photo"
  ],
  "title": "dark chocolate coconut macaroons",
  "url": "https://smittenkitchen.com/2014/04/dark-chocolate-coconut-macaroons/"
}