{
  "date": "2007-01-12T14:11:26+00:00",
  "directions": [
    "1. Adjust oven rack to middle position; heat oven to 325°F. Cut 18-inch length foil and fold lengthwise to 8-inch width. Fit foil into length of 13 by 9-inch baking dish, pushing it into corners and up sides of pan; allow excess to overhand pan edges. Cut 14-inch length foil and, if using extra-wide foil, fold lengthwise to 12-inch width; fit into width of baking pan in same manner, perpendicular to first sheet. Spray foil-lined pan with nonstick cooking spray.",
    "2. Beat cream cheese and two tablespoons butter in medium bowl until light and fluffy. Gradually add 1/4 cup sugar and beat until well blended. Beat in egg. Mix in one tablespoon flour. Set mixture aside.",
    "3. If using nuts, spread nuts evenly on rimmed baking sheet and toast in oven until fragrant, 5 to 8 minutes. Set aside to cool.",
    "4. Whisk to combine flour, salt, and baking powder in medium bowl; set aside.",
    "5. Melt chocolate and butter in large heatproof bowl set over saucepan of almost-simmering water, stirring occasionally, until smooth. (Alternatively, in microwave, heat butter and chocolate in large microwave-safe bowl on high for 45 seconds, then stir and heat for 30 seconds more. Stir again, and, if necessary, repeat in 15-second increments; do not let chocolate burn.) When chocolate mixture is completely smooth, remove bowl from saucepan and gradually whisk in sugar. Add eggs on at a time, whisking after each addition until thoroughly combined. Whisk in vanilla. Add flour mixture in three additions, folding with rubber spatula until batter is completely smooth and homogeneous.",
    "6. Transfer half of batter to prepared pan; using spatula, spread batter into corners of pan and smooth surface. Pour cream cheese mixture over, then second half of brownie batter. Swirl the batters together decoratively with the tip of a knife. Sprinkle toasted nuts (if using) evenly over batter and bake until toothpick or wooden skewer inserted into center of brownies comes out with few moist crumbs attached, 35 to 45 minutes, watching carefully for overcooking. Cool on wire rack to room temperature, about 2 hours, then remove brownies from pan by lifting foil overhang. Cut brownies into 2-inch squares and serve. (Store leftovers in airtight container at room temperature, for up to 3 days, or, ahem, in the freezer until your resistance gets the better of you.)"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/i-blame-babies-for-this1.jpg?w=500",
  "ingredient_list": [],
  "tags": [
    "Brownies/Blondies",
    "Chocolate",
    "Photo"
  ],
  "title": "cream cheese marbled brownies",
  "url": "https://smittenkitchen.com/2007/01/i-blame-babies-for-this/"
}