{
  "date": "2007-01-05T14:32:35+00:00",
  "directions": [
    "Sift the flour, cocoa and baking soda together. ",
    "Working with a stand mixer, preferably fitted with a paddle attachment, or with a hand mixer in a large bowl, beat the butter on medium speed until soft and creamy. Add both sugars, the salt and vanilla extract and beat for 2 minutes more. ",
    "Turn off the mixer. Pour in the flour mixture, drape a kitchen towel over the stand mixer to protect yourself and your kitchen from flying flour and pulse the mixer at low speed about 5 times, a second or two each time. Take a peek — if there is still a lot of flour on the surface of the dough, pulse a couple of times more; if not, remove the towel. Continuing at low speed, mix for about 30 seconds more, just until the flour disappears into the dough — for the best texture, work the dough as little as possible once the flour is added, and don’t be concerned if the dough looks a little crumbly. Toss in the chocolate pieces and mix only to incorporate. ",
    "Turn the dough out onto a work surface, gather it together and divide it in half. Working with one half at a time, shape the dough into logs that are 1 1/2 inches in diameter. Wrap the logs in plastic wrap and refrigerate them for at least 3 hours. (The dough can be refrigerated for up to 3 days or frozen for up to 2 months. If you’ve frozen the dough, you needn’t defrost it before baking — just slice the logs into cookies and bake the cookies 1 minute longer.) ",
    "Getting ready to bake: Center a rack in the oven and preheat the oven to 325°F (160°C). Line two baking sheets with parchment or silicone mats. ",
    "Working with a sharp thin knife, slice the logs into rounds that are 1/2 inch thick. (The rounds are likely to crack as you’re cutting them — don’t be concerned, just squeeze the bits back onto each cookie.) Arrange the rounds on the baking sheets, leaving about one inch between them. ",
    "Bake the cookies one sheet at a time for 12 minutes — they won’t look done, nor will they be firm, but that’s just the way they should be. Transfer the baking sheet to a cooling rack and let the cookies rest until they are only just warm, at which point you can serve them or let them reach room temperature. ",
    "Serving: The cookies can be eaten when they are warm or at room temperature — I prefer them at room temperature, when the textural difference between the crumbly cookie and the chocolate bits is greatest — and are best suited to cold milk or hot coffee. ",
    "Do ahead: Packed airtight, cookies will keep at room temperature for up to 3 days (Deb note: not a chance); they can be frozen for up to 2 months. They can also be frozen in log form for months, and can be sliced and baked directly from the freezer, adding a coupld minutes to the baking time.",
    "Updated 12/18/11: Upon realizing that there were a few discrepancies in the gram weights, I’ve removed them until I can retest this and replace them with more accurate numbers. Hopefully, this week. Thank you. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/01/world-peace-cookies.jpg?w=750",
  "ingredient_list": [
    "1 1/4 cups all-purpose flour",
    "1/3 cup unsweetened cocoa powder",
    "1/2 teaspoon baking soda",
    "1 stick plus 3 tablespoons unsalted butter, at room temperature",
    "2/3 cup (packed) light brown sugar",
    "1/4 cup sugar",
    "1/2 teaspoon fleur de sel or 1/4 teaspoon fine sea salt",
    "1 teaspoon vanilla extract",
    "5 ounces bittersweet chocolate, chopped into chips, or a generous 3/4 cup store-bought mini chocolate chips"
  ],
  "tags": [
    "Chocolate",
    "Cookie",
    "Photo"
  ],
  "title": "in which world peace eludes me",
  "url": "https://smittenkitchen.com/2007/01/in-which-world-peace-eludes-me/"
}