{
  "date": "2009-03-14T10:09:34+00:00",
  "directions": [
    "1. Place the chocolate and butter in a large heatproof bowl. Set the bowl over a pot of barely simmering water. As the chocolate and butter melt, stir to blend.",
    "2. When completely melted, remove from the heat and whisk in first the cream and then the brandy. Be sure to scrape down the bowl well and mix thoroughly. Allow to cool and thicken to the consistency of mayonnaise.",
    "Assemble the Cake",
    "1. Place one 12-inch layer on a 14-inch cake board. Use a long serrated knife to level it if has domed a bit on the top. Spread one cup of ganache thinly over cake layer (optional, you can have a raspberry-only filling too). Once it sets (if your cake is cold, this will be quick, otherwise put it in the fridge for a bit) spread the jam over the ganache.",
    "2. Carefully place the second layer on top of the filling. Use the knife to even out any edges that overhang or don’t smoothly meet. Spread a thin layer of ganache over the top and sides of the cake, covering all of the crumbs. Let it set. Once set, spread the remaining ganache over the tops and sides. [I had some extra, and put it in a piping bag with a thin round tip to make the dots. You’ll only need a little.]"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/layer-cake-tips-the-biggest-birthday-cake-yet1.jpg?w=500",
  "ingredient_list": [
    "Cake Layers",
    "5 1/3 cups cake flour",
    "5 1/3 cups sugar",
    "2 2/3 cups unsweetened cocoa powder, not Dutch process",
    "6 1/2 teaspoons baking soda",
    "1 1/4 teaspoons ground cinnamon",
    "1 1/2 teaspoons salt",
    "5 1/3 sticks (20 2/3 ounces) unsalted butter, at room temperature",
    "2 2/3 cups buttermilk",
    "5 large eggs plus 1 large egg yolk",
    "2 2/3 cups freshly brewed coffee, cooled to room temperature",
    "1 cup seedless raspberry jam (for cake assembly)",
    "2 pounds bittersweet chocolate, broken up",
    "2 sticks (8 ounces) unsalted butter, cut up",
    "2 cups heavy cream, heated slightly to remove the chill",
    "1/2 cup brandy or Cognac"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Chocolate",
    "Photo",
    "Tips"
  ],
  "title": "layer cake tips + the biggest birthday cake yet",
  "url": "https://smittenkitchen.com/2009/03/layer-cake-tips-the-biggest-birthday-cake-yet/"
}