{
  "date": "2017-03-17T11:46:13+00:00",
  "directions": [
    "Heat oven: To 350°F (175°C).",
    "Line an 8-inch square baking pan with parchment and coat the bottom and sides with nonstick cooking spray or butter.",
    "Make peanut butter batter: Whisk all ingredients in a bowl until smooth.\nMake brownie batter: In a medium heatproof bowl over gently simmering water, melt chocolate and butter together until only a couple unmelted bits remain. Off the heat, stir until smooth and fully melted. You can also do this in the microwave in 30-second bursts, stirring between each. Whisk in sugar, then eggs, one at a time, then vanilla and salt. Stir in flour with a spoon or flexible spatula.\nAssemble brownies: Spread a thin layer of brownie batter (about 1/3 of total batter, but no need to be exact) in bottom of prepared baking pan. Dollop peanut butter batter all over in big spoonfuls. Dollop remaining brownie batter in pan, aiming, if you can, between the peanut butter dollops. Use a butter knife to swirl the batters together in loose figure-8s. Sprinkle chips all over.\nBake: For 30 to 35 minutes, or until a toothpick inserted into the center comes out batter-free.\nTo keep: Brownies keep well at room temperature, in the fridge or freezer."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/peanut-butter-swirled-brownies.jpg?w=750",
  "ingredient_list": [
    "3/4 cup (190 grams) smooth peanut butter",
    "2/3 (135 grams) cup granulated sugar",
    "1 large egg",
    "1/4 teaspoon vanilla extra",
    "A few pinches of flaky or coarse sea salt",
    "3 ounces (85 grams) unsweetened chocolate, roughly chopped",
    "1/2 cup (115 grams or 4 ounces) unsalted butter, plus extra for pan",
    "1 1/4 cups (250 grams) granulated sugar",
    "2 large eggs",
    "1 teaspoon (5 ml) vanilla extract",
    "1/2 teaspoon flaky or heaped 1/4 teaspoon of coarse sea salt",
    "2/3 cup (85 grams) all-purpose flour",
    "1/4 cup (40 grams) semi- or bittersweet chocolate chips"
  ],
  "tags": [
    "Bars",
    "Brownies/Blondies",
    "Chocolate",
    "Peanut Butter",
    "Photo"
  ],
  "title": "peanut butter swirled brownies",
  "url": "https://smittenkitchen.com/2017/03/peanut-butter-swirled-brownies/"
}