{
  "date": "2006-11-28T11:50:40+00:00",
  "directions": [
    "Special equipment: parchment paper; a candy thermometer",
    "Line bottom and sides of an 8-inch straight-sided square metal baking pan with 2 long sheets of crisscrossed parchment.",
    "Bring cream just to a boil in a 1- to 1 1/2-quart heavy saucepan over moderately high heat, then reduce heat to low and add chocolate. Let stand 1 minute, then stir until chocolate is completely melted. Remove from heat.",
    "Bring sugar, corn syrup, water, and salt to a boil in a 5- to 6-quart heavy pot over moderate heat, stirring until sugar is dissolved. Boil, uncovered, without stirring but gently swirling pan occasionally, until sugar is deep golden, about 10 minutes. Tilt pan and carefully pour in chocolate mixture (mixture will bubble and steam vigorously). Continue to boil over moderate heat, stirring frequently, until mixture registers 255°F on thermometer, about 15 minutes. Add butter, stirring until completely melted, then immediately pour into lined baking pan (do not scrape any caramel clinging to bottom or side of saucepan). Let caramel stand 10 minutes, then sprinkle evenly with sea salt. Cool completely in pan on a rack, about 2 hours.",
    "Carefully invert caramel onto a clean, dry cutting board, then peel off parchment. Turn caramel salt side up. Lightly oil blade of a large heavy knife and cut into 1-inch squares.  (If desired, additional sea salt can be pressed onto caramels after cutting.)",
    "Caramels keep, layered between sheets of parchment or wax paper, in an airtight container at cool room temperature 2 weeks. To package them up pretty, the caramels can be wrapped in 4-inch squares of wax paper; twist ends to close."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/salty-and-sublime1.jpg?w=500",
  "ingredient_list": [
    "2 cups heavy cream",
    "10 1/2 oz fine-quality bittersweet chocolate (no more than 60% cacao if marked), finely chopped [Deb note: my in-house options were Toll House chocolate chips or high-quality 72% chocolate. I went with the 72 percent. The slight extra bitterness is fantastic.]",
    "1 3/4 cups sugar",
    "1/2 cup light corn syrup",
    "1/4 cup water",
    "1/4 teaspoon salt",
    "3 tablespoons unsalted butter, cut into tablespoon pieces",
    "2 teaspoons flaky sea salt such as Maldon",
    "Vegetable oil for greasing"
  ],
  "tags": [
    "Candy",
    "Chocolate",
    "Photo"
  ],
  "title": "salted chocolate caramels",
  "url": "https://smittenkitchen.com/2006/11/salty-and-sublime/"
}