{
  "date": "2015-02-26T11:48:11+00:00",
  "directions": [
    "I don’t have Dutched cocoa: Dutch-process cocoa (generally speaking, it’s the standard in European brands) differs from natural cocoa (what you have if your cocoa isn’t labeled Dutch, or if it’s an American brand) in that its acidity has been neutralized to form a darker, nuttier cocoa that I prefer. That said, if you don’t have Dutched but only a regular or natural cocoa, I haven’t tested this cake with it but suspect that you’ll be just fine, although the cake may be less dark in color.",
    "How I like to swirl frosting: I always use a small offset spatula (have I convinced you to buy one yet? Seriously, $4. Do it.) and I think the secret is to always push the frosting from the center out, not pull it back. So, push and then make an S-swirl, push and S-swirl, repeat and always quit while you’re ahead (hard, because it’s so fun). ",
    "Confetti sprinkles: I got mine from New York Cake on 22nd Street but, of course, Amazon sells them as well. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/the-i-want-chocolate-cake-cake1.jpg?w=750",
  "ingredient_list": [
    "Cake",
    "6 tablespoons (85 grams) unsalted butter, at room temperature",
    "3/4 cup (145 grams) firmly packed dark brown sugar",
    "2 tablespoons (25 grams) granulated sugar",
    "1 large egg",
    "1 large egg yolk",
    "3/4 cup (175 ml) buttermilk (see Notes for other options)",
    "1 teaspoon (5 ml) vanilla extract",
    "1/2 cup (41 grams) Dutch cocoa powder",
    "1 cup (125 grams) all-purpose flour",
    "1/4 teaspoon baking soda",
    "1/2 teaspoon baking powder",
    "1/2 teaspoon table or fine sea salt",
    "Frosting",
    "2 ounces (55 grams) unsweetened chocolate, melted and cooled",
    "1 1/2 cups (180 grams) powdered sugar (sifted if lumpy)",
    "1/2 cup (4 ounces or 115 grams) unsalted butter, at room temperature",
    "Pinch of fine sea salt (optional)",
    "1 tablespoons cream or whole milk",
    "1/2 teaspoon vanilla extract"
  ],
  "tags": [
    "Cake",
    "Chocolate",
    "Everyday Cakes",
    "Photo"
  ],
  "title": "the ‘i want chocolate cake’ cake",
  "url": "https://smittenkitchen.com/2015/02/the-i-want-chocolate-cake-cake/"
}