{
  "date": "2011-07-21T13:58:00+00:00",
  "directions": [
    "Cut radishes and zucchini into tiny matchsticks with a mandoline. If you don’t have a mandoline, you can use a peeler to peel thick ribbons down the long side of the zucchini. Stack the ribbons and cut them crosswise into thin matchsticks. Cut the radishes into a similar shape by hand. Toss radishes and zucchini together. Squeeze the juice of half a lime over the radish and season with salt to taste. Add more lime juice if desired. Set aside.",
    "Remove toddlers from the kitchen. Over a hot grill or an open gas-stove flame char two of the ears of corn until well-blackened but not completely burnt. If you’re using the burner method, you’ll probably, quickly, notice that corn likes to pop and snap, occasionally spraying you with splats of corn. It’s a little scary, which is I why I suggest you remove anyone small and easily harmed before you begin. However, I found the charred corn flavor to be completely worth the scare and hope you do too. ",
    "Remove cobs from heat, and when cool enough to handle, shave off kernels using a large knife and reserve. Remove kernels from remaining two ears of corn.",
    "Heat a large sauté pan over medium heat. Melt the butter and oil together and once hot, add the onion. Cook the onion for about 5 minutes, until softened. Add the garlic and cook another minute. Add the raw corn kernels and sauté until corn is just cooked through, about three to five minutes. Turn heat to high, add the charred kernels of corn to the mixture, and toss to combine until heated through. Squeeze the juice of one lime over the corn mixture, and use the juice to scrape up any stuck bits. Season the corn mixture with salt and chili powder. Stir in chopped herbs, if using.",
    "You can heat your tortillas one of two ways. You can wrap the whole stack in foil and place it in a warm (250 degrees) oven for 15 minutes while you prepare the other ingredients. However, I prefer to get a nice blister on them before filling them. Coat the bottom of a cast-iron skillet with olive oil and wipe it out so on the thinnest slick remains. Heat the skillet on high. Once hot, cook a tortilla for about 30 seconds to 1 minute on each side, until lightly blistered. Repeat with remaining tortillas but if your skillet is well-seasoned, no need to repeat the oiling process.",
    "Fill each taco with a few small spoonfuls of the corn mixture. Top with a spoonful of crumbled cheese and a bit of the radish-zucchini slaw. Serve with an extra lime wedge on the side (you’ll have half a lime left to slice up), and whatever fixings you like (sour cream, avocado wedges, etc. See above)."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/07/charred-corn-tacos-with-zucchini-radish-slaw.jpg?w=750",
  "ingredient_list": [
    "1/2 pound red radishes (from about 2/3 of a bundle with stems and leaves), trimmed",
    "1 small (4 to 5 ounces) zucchini, long and narrow if you can find it",
    "2 limes",
    "Salt",
    "4 ears corn, husks removed",
    "2 tablespoons unsalted butter",
    "1 tablespoon olive oil, plus additional if blistering tacos in skillet",
    "1 medium white onion, finely chopped",
    "2 cloves garlic, minced",
    "3 tablespoons chopped epazote (if you can find it), cilantro or pasley (for the cilantro-averse) leaves (optional)",
    "1/2 cup (2 1/2 ounces or 70 grams) crumbled cotija cheese (or another salty, crumbly cheese such as ricotta salata or feta)",
    "1/4 teaspoon chili powder",
    "10 to 12 small (6-inch) soft corn tortillas"
  ],
  "tags": [
    "Corn",
    "Photo",
    "Radishes",
    "Summer",
    "Tex-Mex",
    "Vegetarian",
    "Zucchini"
  ],
  "title": "charred corn tacos with zucchini-radish slaw",
  "url": "https://smittenkitchen.com/2011/07/charred-corn-tacos-with-zucchini-radish-slaw/"
}