[
    {
        "ingredient_list": [
            "2 medium roma tomatoes, cubed", 
            "1 1-pound English cucumber, cubed", 
            "1/2 medium red onion, cubed, or 4 scallions, finely sliced", 
            "3 tablespoons finely minced fresh, flat-leaf parsley", 
            "Juice of half a lemon", 
            "2 to 3 tablespoons olive oil", 
            "1 1/2 teaspoons sumac powder", 
            "Salt and pepper, to taste", 
            "6 large pitas, cut into eight wedges each, then each wedge split into two layers (for small chips) cut into six wedges and split (for large, scoopable chips)", 
            "Olive oil cooking spray or 2 tablespoons olive oil", 
            "Flaky sea salt", 
            "1 tablespoon za’atar or sumac"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/700544972_564e118f79_b.jpg?w=753", 
        "tags": [
            "Cucumber", 
            "Israeli", 
            "Photo", 
            "Round-Up", 
            "Salad", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/07/a-salad-palette/", 
        "title": "israeli salad + pita chips", 
        "directions": [
            "Preheat oven to 350 degrees. On a large baking sheet lined with parchment paper, arrange all of the pita slices so they do not overlap. Either brush or spray with olive oil, then sprinkle with sea salt and your spice of choice. Bake for 10 to 15 minutes, or until they begin to color. Let them cool completely before using, or bagging for later. "
        ], 
        "date": "2007-07-03T11:53:33+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds fresh, best-quality tomatoes (results are uneven with less fresh ones)", 
            "1 small garlic clove, minced", 
            "2 tablespoons fresh lemon juice or red wine vinegar", 
            "1 teaspoon coarse salt, plus more to taste (I used 2 teaspoons total Diamond kosher salt)", 
            "1 teaspoon sugar (optional, I found this unnecessary)", 
            "1/2 teaspoon freshly ground black pepper", 
            "1 poud dried capellini or angel-hair spaghetti", 
            "1/2 cup chopped fresh basil", 
            "To serve: grated ricotta salata (my choice) or Parmigiano-Reggiano and a drizzle of your favorite olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/08/angel-hair-pasta-with-fresh-tomato-sauce1.jpg?w=640", 
        "tags": [
            "Italian", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/08/angel-hair-pasta-with-raw-tomato-sauce/", 
        "title": "angel hair pasta with raw tomato sauce", 
        "directions": [
            "Halve the first pound of tomatoes crosswise, then rub the cut sides against the large holes of a box grater set in a large bowl, discarding the skin. Core (see note up top) and chop the last two pounds of tomatoes and add to the grated tomato bowl. Add garlic, lemon juice or vinegar, salt, sugar (if using) and pepper and let marinate at room temperature until ready to use, at least 10 minutes but also up to 2 hours if you’re planning ahead. After it has steeped for a while, taste and adjust seasonings as needed.", 
            "Cook pasta in salted boiling water as package time recommends. Drain then toss with fresh sauce and basil. Serve lukewarm (as it is now) or at room temperature with a drizzle of olive oil and freshly grated cheese on top."
        ], 
        "date": "2015-08-24T11:56:28+00:00"
    }, 
    {
        "ingredient_list": [
            "For pasta", 
            "1 1/2 cups all-purpose flour", 
            "2 large eggs", 
            "1/2 teaspoon salt", 
            "2 tablespoons water", 
            "For filling", 
            "2 tablespoons unsalted butter, cut into pieces", 
            "1 small onion, chopped (1/2 cup)", 
            "1 (10-oz) box frozen artichoke hearts, thawed and patted dry", 
            "1 oz finely grated Parmigiano-Reggiano (1/2 cup)", 
            "1/3 cup chopped fresh flat-leaf parsley", 
            "1 large egg yolk", 
            "1/2 teaspoon fresh lemon juice", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "3/4 teaspoon freshly grated nutmeg", 
            "1 large egg white, lightly beaten with 2 teaspoons water (for egg wash)", 
            "For assembly", 
            "1 tablespoon unsalted butter, cut into pieces", 
            "3 medium plum tomatoes, trimmed and cut into 1/4-inch dice (3/4 cup)", 
            "1/4 cup water", 
            "1/3 cup heavy cream", 
            "1 oz finely grated Parmigiano-Reggiano (1/2 cup)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/artichoke-gaga1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Pasta", 
            "Photo", 
            "Spring", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/01/artichoke-gaga/", 
        "title": "artichoke ravioli with tomatoes", 
        "directions": [
            "Special equipment: a pasta machine; a 3-inch round metal cookie cutter; a shallow oval 2-qt ceramic or glass baking dish (12 by 8 1/2 inches) ", 
            "To make pasta dough in a food processor:  Blend flour, eggs, salt, and water in processor until mixture just begins to form a ball, adding more water, drop by drop, if dough is too dry (dough should be firm and not sticky). Process dough for 15 seconds more to knead it. Transfer to a floured surface and let stand, covered with an inverted bowl, 1 hour to let the gluten relax and make rolling easier.", 
            "To make dough by hand:  Mound flour on a work surface, preferably wooden, and make a well in center. Add eggs, salt, and water to well. With a fork, gently beat eggs and water until combined. Gradually stir in enough flour to form a paste, pulling in flour closest to egg mixture and being careful not to make an opening in outer wall of well. Knead remaining flour into mixture with your hands to form a dough, adding more water, drop by drop, if dough is too dry (dough should be firm and not sticky). Knead dough until smooth and elastic, 8 to 10 minutes. Cover with an inverted bowl and let stand 1 hour (to make rolling easier).", 
            "Make filling:  Heat butter in a 12-inch heavy skillet over moderately high heat until foam subsides, then saute onion, stirring occasionally, until golden, about 6 minutes. Add artichoke hearts and saute, stirring occasionally, until tender, 8 to 10 minutes. Remove from heat and cool slightly.", 
            "Transfer all but 3/4 cup artichoke mixture to cleaned bowl of processor (reserve remaining artichoke mixture in skillet), then add cheese, parsley, yolk, lemon juice, salt, pepper, and nutmeg and pulse until mixture is coarsely chopped. ", 
            "Roll pasta and make ravioli:  Cut pasta dough into 4 pieces, then flatten each piece into a rough rectangle and cover rectangles with an inverted large bowl. Set rollers of pasta machine on widest setting.", 
            "Lightly dust 1 rectangle with flour and feed through rollers. (Keep remaining rectangles under bowl.) Fold rectangle in half and feed it, folded end first, through rollers 7 or 8 more times, folding it in half each time and feeding folded end through. Dust with flour if necessary to prevent sticking. Turn dial to next (narrower) setting and feed dough through rollers without folding. Continue to feed dough through rollers once at each setting, without folding, until you reach narrowest setting. Dough will be a smooth sheet (about 24 inches long and 4 inches wide). ", 
            "Put sheet of dough on a floured work surface and drop 6 (1 1/2-teaspoon) mounds of filling 1 1/2 inches apart in a row down center of one half of sheet. Brush egg wash around each mound, then fold other half of sheet over filling. Press down firmly around each mound, forcing out air. (Air pockets increase the chance that ravioli will break during cooking.) Cut pasta (between mounds) with cutter into 3-inch rounds. Line a large shallow baking pan with a clean kitchen towel (not terry cloth) and dust towel with flour, then arrange ravioli in 1 layer in it. Make more ravioli with remaining pasta dough, 1 sheet at a time, and remaining filling, transferring ravioli to lined pan.", 
            "Put oven rack in middle position and preheat oven to 350°F. Lightly butter baking dish.", 
            "Bring a 6- to 8-quart pot of salted water to a boil. Add ravioli, carefully stirring to separate, and, adjusting heat to keep water at a gentle boil, cook until pasta is just tender, about 6 minutes. Transfer with a slotted spoon to a colander.", 
            "Assemble and bake dish:  While ravioli boils, reheat reserved artichoke mixture in skillet with butter over moderately high heat, then add tomatoes and water and cook, stirring, until tomatoes are softened, about 5 minutes.", 
            "Transfer half of ravioli to baking dish and top with half of artichoke mixture, half of cream, and half of cheese. Repeat with remaining ravioli, artichoke mixture, cream, and cheese. Sprinkle with salt and pepper.", 
            "Bake, uncovered, until ravioli is heated through and cream is bubbling, about 15 minutes. ", 
            "Do ahead: Dough can be made (but not rolled out) 4 hours ahead and chilled, tightly wrapped in plastic wrap. Ravioli can be made (but not cooked) 4 hours ahead and chilled in lined baking pan, covered. "
        ], 
        "date": "2007-01-09T17:52:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large (mine was just over 1 1/4 pounds/570 grams) eggplant, cut into 3/4-inch dice", 
            "Salt and black pepper", 
            "1/4 cup (60 ml) olive oil", 
            "1 medium carrot, peeled and cut into 1/4-inch dice", 
            "1 celery stalk, in a 1/4-inch dice", 
            "1 medium onion, finely diced", 
            "3 garlic cloves, minced", 
            "8 ounces (225 grams) orzo, a rice-shaped pasta, rinsed", 
            "1 teaspoon (6 grams) tomato paste", 
            "1 1/2 cups (355 ml) vegetable stock", 
            "1 to 3 tablespoons fresh oregano, chopped", 
            "1 teaspoon grated lemon zest or more to taste, up to the zest of a whole lemon", 
            "4 ounces (115 grams) mozzarella, firmer is better here, cut into 1/3-inch dice", 
            "1 1/2 ounces (a generous 1/2 cup or 45 grams) parmesan, grated", 
            "3 medium tomatoes, diced "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/09/baked-orzo-with-eggplant-and-mozz.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Eggplant", 
            "Pasta", 
            "Photo", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/09/baked-orzo-with-eggplant-and-mozzarella/", 
        "title": "baked orzo with eggplant and mozzarella", 
        "directions": [
            "Sprinkle your eggplant generously with salt and let it drain in a colander for 30 minutes. I used this time to get the rest of my ingredients ready. After 30 minutes, rinse it well and pat it dry on towels. ", 
            "Preheat your oven to 350°F. Heat a large frying pan over medium-high heat. Once hot, add the oil and once the oil is shimmering, add the eggplant. Fry for 8 minutes, stirring pieces occasionally. Using a slotted spoon or spatula, transfer them to paper towels to drain. Add celery and carrots to remaining oil and cook for 3 minutes before adding onion and garlic. Cook together for 5 more minutes on medium heat. Stir in the orzo and tomato paste and cook for two minutes more. Off the heat, add the oregano, mozzarella, parmesan, tomatoes, fried eggplant, lemon zest, 1 teaspoon table salt, many grinds of black pepper and the stock and mix well. ", 
            "Transfer mixture to an 8×11-inch (about 2 quarts) ovenproof baking dish. Cover with foil and bake 20 minutes, then bake 20 minutes without the foil. (You can increase the ration of foil-on to foil-off time if you don’t like a crunchy pasta lid.) Let rest for 5 minutes before serving. "
        ], 
        "date": "2012-09-06T15:02:05+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups (160 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "8 tablespoons (4 ounces or 113 grams) cold unsalted butter, cut into pieces and chill again", 
            "1/4 cup (60 grams) plain yogurt or sour cream", 
            "2 teaspoons (10 ml) fresh lemon juice", 
            "1/4 cup (60 ml) ice water", 
            "For the filling:", 
            "1 tablespoon (15 ml) olive oil", 
            "1/4 teaspoon coarse Kosher or sea salt", 
            "3 cups (about 450 grams) cherry or grape tomatoes", 
            "1 ear corn, cut from the cob (about 1 cup)", 
            "1 small (8 ounces or 225 grams) zucchini or summer squash, diced", 
            "1 bundle (3 to 4 ounces or 85 to 115 grams) scallions, thinly sliced", 
            "1/2 cup (2 ounces or 55 grams) grated parmesan", 
            "Glaze:", 
            "1 egg yolk beaten with 1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/burst-tomato-zucchini-and-corn-galette.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Corn", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Quiche", 
            "Tomatoes", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2013/08/burst-tomato-galette-with-corn-and-zucchini/", 
        "title": "burst tomato galette with corn and zucchini", 
        "directions": [
            "Make dough: Whisk stir the flour and salt in a large bowl. Sprinkle bits of butter over dough and using a pastry blender or your fingertips, work it into the flour until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, stir together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball. Wrap with plastic and refrigerate for 1 hour, or up to 2 days.", 
            "Make filling: Get down the saute pan with the lid. If you don’t have one, any large lid will do. Add olive oil, tomatoes, salt and a pinch of red pepper flakes (if that’s your thing) to your saute pan then cover and heat over high heat. Roll the tomatoes around from time to time so that they’ll cook evenly. In a few minutes, you’ll hear some putts and pops as the tomatoes burst a little. When most have, remove lid, turn heat down to medium and add zucchini chunks. Saute for two minutes, until they soften. Add corn and cook one minute. Add scallions, just stirring them in, then turn off heat. Adjust seasonings if needed. Transfer mixture to a large plate and spread it out, so that it will cool faster. You want it cooled to at least lukewarm before assembling the galette.", 
            "Assemble galette: Heat oven to 400 degrees. On a floured counter, roll the dough out into a 12-inch round and it really doesn’t need to be perfectly shaped. Transfer to a parchment-lined baking sheet; I like to fold my dough gently, without creasing, in quarters then unfold it onto the baking pan. Sprinkle tomato-zucchini-corn mixture with half of parmesan and spoon the mixture into the center of the dough, leaving a 2-inch border. If any liquid has puddle in plate, try to leave it there as you spoon. Sprinkle with almost all of remaining parmesan, leaving a pinch or two behind for the crust. Fold the border over the filling, pleating the edge to make it fit. The center will be open. Brush crust with egg yolk glaze. Sprinkle glaze with last pinches of parmesan.", 
            "Bake the galette: For 30 to 40 minutes, or until puffed and golden brown. Remove from the oven and let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature."
        ], 
        "date": "2013-08-05T12:19:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            "Zest and juice of 1 lemon", 
            "3 cloves garlic, minced", 
            "1 1/2 teaspoon kosher salt", 
            "3/4 teaspoon paprika", 
            "1/4 teaspoon hot smoked paprika, plus more to taste", 
            "1 1/2 teaspoons dried oregano, crumbled", 
            "Freshly ground black pepper", 
            "10 boneless, skinless chicken thighs (about 3 pounds)", 
            "2 cups (554 grams) plain, unsweetened Greek yogurt", 
            "1 hothouse, English or seedless cucumber, unpeeled (about 1 pound)", 
            "2 tablespoons freshly squeezed lemon juice", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon minced fresh dill", 
            "2 medium cloves garlic, minced", 
            "1 1/2 teaspoons kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "1 head romaine lettuce, chopped", 
            "1 red onion, thinly sliced", 
            "About 1 pound small-medium tomatoes, chopped", 
            "1 hothouse, English or seedless cucumber, chopped", 
            "4 large pitas (intending 1/2 per person) or more as needed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/chicken-gyro-salad1.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Cucumber", 
            "Greek", 
            "Greens", 
            "Grilling", 
            "Onions", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/05/chicken-gyro-salad/", 
        "title": "chicken gyro salad", 
        "directions": [
            "Prepare the chicken: Combine all ingredients in a large freezer bag. Rub all around, coating chicken as evenly as possible. Let marinate for 20 minutes or up to 24 hours, whatever time you have.\nMake tzatziki: Place the yogurt in a medium bowl. Quarter your cucumber lengthwise and cut out the seeded area. Coarsely grate your cucumber onto a clean dishcloth and wring it out as well as you can. All of that liquid makes for a soggy sauce. Add wrung-out cucumber to yogurt bowl along with lemon, vinegar, dill, garlic, salt and pepper and stir to combine. Taste and adjust seasonings. Chill until needed.\nPrepare salad components: Arrange lettuce, onion, tomatoes and cucumbers on a platter. If desired, toss onion with a squeeze of lemon and/or dash or two of vinegar and salt so that it mellows/lightly pickles while it rests.\nCook chicken: Heat your grill to high heat or a grill pan to medium-high. Remove chicken from marinade and grill on first side until dark lines appear, about 5 minutes, then flip and grill for 3 minutes more on second side. Cooking times will vastly range by the thickness and coldness of your chicken, as well as variations between grills. Transfer cooked chicken to a cutting board, let rest for a couple minutes while you quickly heat/toast your pitas on the grill.\nCut chicken into thin strips. Cut pitas into wedges. Add to platter with vegetables and let everyone dig in. Repeat all summer."
        ], 
        "date": "2016-05-31T12:01:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound Campari or plum tomatoes, diced, drained", 
            "1 1/2 cups diced seeded watermelon", 
            "1 large green bell pepper, seeded, cut into 1/3-inch cubes", 
            "1/2 large English hothouse cucumber, seeded, cut into 1/3-inch cubes", 
            "1/2 cup very thinly sliced radishes", 
            "3 tablespoons olive oil, divided", 
            "10 ounces feta cheese, cut into small cubes (about 2 1/2 cups),", 
            "2 divided green onions, chopped, divided", 
            "1/4 cup thinly sliced fresh mint leaves, divided", 
            "1/2 cup plain Greek-style yogurt", 
            "1 teaspoon dried oregano"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2653761539_5d0fcda7de_b.jpg?w=750", 
        "tags": [
            "Fruit", 
            "Peppers", 
            "Photo", 
            "Radishes", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2008/07/chopped-vegetable-watermelon-and-feta-salad/", 
        "title": "chopped vegetable, watermelon and feta salad", 
        "directions": [
            "Toss first five ingredients and two tablespoons oil in large bowl. Add half each of cheese, green onions, and mint. Mix remaining cheese, green onions, mint, and oil in processor; add yogurt and oregano. Process just to blend (do not over-mix or dressing will get thin). Season dressing with salt and pepper; mix into salad."
        ], 
        "date": "2008-07-10T12:36:51+00:00"
    }, 
    {
        "ingredient_list": [
            "Dressing (Heads up: I found I only needed half of this)", 
            "3/4 cup canola oil", 
            "1/4 cup extra-virgin olive oil", 
            "1/4 cup red wine vinegar", 
            "1 tablespoon fresh lemon juice", 
            "3/4 teaspoon dry mustard", 
            "1/2 teaspoon Worcestershire", 
            "1/4 teaspoon sugar", 
            "1 clove garlic, minced", 
            "Kosher salt and freshly ground black pepper, to taste", 
            "Salad", 
            "1/2 head iceberg lettuce, cored and shredded", 
            "1/2 head romaine lettuce, chopped", 
            "1/2 bunch watercress, some of the stems trimmed, chopped", 
            "2 ounces blue cheese, crumbled (we used a Stilton)", 
            "6 strips cooked bacon, roughly chopped", 
            "3 hard-boiled eggs, peeled and cut into 1/2-inch cubes", 
            "2 medium tomatoes, peeled*, seeded, and cut into 1/2-inch cubes", 
            "1 boneless skinless chicken breast, cooked and cut into 1/2-inch cubes", 
            "1 avocado, peeled, pitted, and cut into 1/2-inch cubes", 
            "Kosher salt and freshly ground black pepper, to taste", 
            "2 tablespoons chives, minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/classic-cobb-salad.jpg?w=752", 
        "tags": [
            "Avocado", 
            "Eggs", 
            "Photo", 
            "Salad", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2010/04/classic-cobb-salad/", 
        "title": "classic cobb salad", 
        "directions": [
            "Make the dressing: Combine the canola oil, olive oil, vinegar, lemon juice, mustard, Worcestershire, sugar, and garlic in a blender. Purée the ingredients to make a smooth dressing and season with salt and pepper. Set the dressing aside.", 
            "Make the salad: On a (very) large platter, combine the iceberg and romaine lettuces along with the watercress. Arrange the blue cheese, bacon, eggs, tomatoes, chicken, and avocado on top of the greens in neat rows. To serve, drizzle salad with dressing, season with salt and pepper, and top with chives. Alternatively, toss everything together in a bowl.", 
            "Do ahead: Salad dressing keeps, covered and refrigerated, for up to one week. Individual ingredients (except the avocado, which is too prone to browning) can be prepped and chopped, and kept in separate containers in the fridge until you’re ready to assemble the salad. However, no doubt due to sturdiness of 2/3 of the lettuces, I found that the entire assembled salad kept surprisingly well wrapped in plastic in the fridge for a few hours.", 
            "* To peel a tomato: Cut an X in bottom of each tomato and blanch in a large pot of boiling water for 10 seconds. Immediately transfer with a slotted spoon to an ice bath to cool. Slide the skins right off, starting at the X. Completely befuddled by the need for this step? Skip it."
        ], 
        "date": "2010-04-14T22:13:01+00:00"
    }, 
    {
        "ingredient_list": [
            "2 (28-ounce) cans whole tomatoes packed in juice, drained, 3 cups juice reserved", 
            "1 1/2 tablespoons dark brown sugar", 
            "4 tablespoons unsalted butter", 
            "4 large shallots, minced (about 1/2 cup)", 
            "1 tablespoon tomato paste", 
            "Pinch ground allspice", 
            "2 tablespoon all-purpose flour", 
            "1 3/4 cups chicken stock, homemade or canned low-sodium", 
            "1/2 cup heavy cream", 
            "2 tablespoons brandy or dry sherry", 
            "Salt and cayenne pepper", 
            "3 ounces cheese (preferably mild cheddar) or combination of cheese, grated on large holes of box grater (about 3/4 cup)", 
            "4 slices (1/2 inch-thick) from white sandwich bread, such as Pepperidge Farm Toasting White", 
            "2 tablespoons butter (preferably salted), melted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/come-on-thunder1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Sandwich", 
            "Soup", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2006/11/come-on-thunder/", 
        "title": "classic grilled cheese + cream of tomato soup", 
        "directions": [
            "1.\tHeat heavy 12-inch skillet over low to medium-low heat. Meanwhile, sprinkle a portion of cheese over two bread slices. Top each with a remaining bread slice, pressing down gently to set. ", 
            "2.\tBrush sandwich tops completely with half of melted butter; place each sandwich, buttered-size down, in skillet. Brush remaining side of each sandwich completely with remaining butter. Cook until crisp and deep golden brown, 5 to 10 minutes per side, flipping sandwiches back to first side to reheat and crisp, about 15 seconds. Serve immediately. "
        ], 
        "date": "2006-11-09T13:54:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1 recipe Crispy Corn Bread (below) or 3 cups of 1-inch cornbread cubes", 
            "1 1/2 pounds ripe tomatoes (4 to 6 medium)", 
            "6 cups roughly torn sturdy fresh lettuce, such as Bibb, butter or Boston", 
            "2 cups bitter greens, such as arugula or dandelion greens", 
            "1 large Vidalia onion, trimmed, peeled, sliced crosswise as thinly as possible and separated into rings", 
            "1 recipe Buttermilk-Lime Dressing (below)", 
            "3/4 cups whole or lowfat buttermilk (whole preferred)", 
            "5 tabespoons freshly squeezed lime juice (they say from 3 to 4 limes; I only needed 1 1/2)", 
            "2 tablespoons olive oil", 
            "1 tablespoon apple cider vinegar (optional, this was my addition to give it more zing)", 
            "1 tablespoon honey", 
            "1/4 cup finely minced fresh basil", 
            "1/4 cup finely minced fresh flat-leaf parsley", 
            "1/4 cup finely minced green onios", 
            "1/2 teaspoon salt, plus more to taste", 
            "1 tablespoon lard or unsalted butter", 
            "1 1/2 cups stone-ground cornmeal", 
            "1 teaspoon baking powder", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "1 teaspoon sugar", 
            "1 large egg", 
            "1 1/2 cups whole or lowfat buttermilk (whole is preferred, here’s how you can make your own)", 
            "2 tablespoons unsalted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/corn-bread-salad1.jpg?w=500", 
        "tags": [
            "Arugula", 
            "Herbs", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2009/09/corn-bread-salad/", 
        "title": "corn bread salad", 
        "directions": [
            "Preheat the oven to 450°F. Grease a 12-inch skillet with one tablespoon of the lard or butter, leaving any excess in the pan, and place it in the oven.", 
            "In a large bowl, whisk the dry ingredients together. In a medium bowl, whisk the egg until frothy and then whisk in the buttermilk. Add the wet ingredients to the dry ones and mix thoroughly. Melt the remaining butter in a small skill (or your microwave) and whisk the butter into your batter.", 
            "While the fat in the large skillet is smoking, carefully remove the skillet from the oven and swirl the fat around to coat the bottom and sides evenly. Pour the batter into the skillet; it should “sizzle alluringly”, says the Lee Brothers. Bake for 15 minutes, or until the top of the bread is golden brown and the edge has pulled away from the side of the skillet. Remove from the oven and either serve hot, in six wedges, or let cool and reserve for Corn Bread Salad (above)."
        ], 
        "date": "2009-09-04T11:15:52+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 to 1 pound fresh mozzarella, diced into 1/2-inch cubes", 
            "1 pound peak-season tomatoes (I prefer roma for this because they’re less wet, but other varieties also work), diced into 1/2-inch cubes", 
            "1 15-ounce can white beans, drained and rinsed or 1 3/4 cups white beans that you’ve cooked fresh", 
            "1/4 cup pesto (or a handful of slivered basil plus 1/4 cup olive oil)", 
            "3 to 4 tablespoons red wine vinegar", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cubed-hacked-caprese1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Gluten-Free", 
            "Photo", 
            "Salad", 
            "Side Dish", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2009/08/cubed-hacked-caprese/", 
        "title": "cubed, hacked caprese", 
        "directions": [
            "Mix and season and then reseason again to adjust to your taste. Eat at once or keep it in the fridge up to a few days (really, it will depend on how fresh your mozzarella is; the made-daily stuff is only good for a day or two, most others will last nearly a week)."
        ], 
        "date": "2009-08-24T22:03:04+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (227 grams) plain, full-fat yogurt", 
            "1 garlic clove, peeled", 
            "1-inch piece of fresh ginger, peeled", 
            "1/4 teaspoon granulated sugar", 
            "Juice of half a lemon (about 2 tablespoons)", 
            "1 tablespoon minced mild or hot fresh chile (I used a jalapeno)", 
            "1 teaspoon cumin seeds, black or yellow mustard seeds or nigella seeds (I used black mustard seeds)", 
            "2 tablespoons chopped mint leaves, divided", 
            "2 tablespoons chopped cilantro leaves, divided", 
            "Kosher salt to taste", 
            "2 long, English-style cucumbers (2 pounds total)", 
            "1 cup cherry or grape tomatoes, diced", 
            "1/2 medium red onion, chopped small"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/cucumber-yogurt-raita-salad1.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Indian", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/05/cucumber-yogurt-raita-salad/", 
        "title": "cucumber yogurt raita salad", 
        "directions": [
            "\nMake the dressing by placing yogurt in a medium bowl and using a very fine grater to grate the garlic and ginger over it. Stir in sugar, lemon, chile, seeds, half of the mint and cilantro and season it with salt to taste. Set aside until you’re ready to serve the salad.\nCut the cucumbers in half lengthwise, then each half three more times into long wedge-shaped pieces (i.e. 8 long pieces per cucumber). Cut them into 1 to 1 1/2-inch lengths on a diagonal and add them to a big bowl. Pile tomatoes and onion on top and when you’re ready to eat, mix half of the dressing with the salad. Sprinkle with remaining mint and cilantro and serve with extra yogurt dressing on the side."
        ], 
        "date": "2016-05-26T11:49:16+00:00"
    }, 
    {
        "ingredient_list": [
            "4 pounds sad, unloved tomatoes (some swear by romas, I’ve had success with all varieties)", 
            "1/4 cup olive oil", 
            "Small onion", 
            "2 to 3 small cloves of garlic", 
            "1/2 medium carrot", 
            "1/2 stalk of celery", 
            "1/2 teaspoon salt plus more to taste", 
            "Slivers of fresh basil, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/08/fresh-tomato-sauce.jpg?w=750", 
        "tags": [
            "Italian", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/08/fresh-tomato-sauce/", 
        "title": "fresh tomato sauce", 
        "directions": [
            "Peel your tomatoes: Bring a pot of water to boil. Cut a small X at the bottom of each tomato. Blanche the tomatoes in the boiling water for 10 to 30 seconds, then either rinse under cold water or shock in an ice water bath. Peeling the tomatoes should now be a cinch. If one gives you trouble, toss it back in the boiling water for another 10 seconds until the skin loosens up. Discard the skins (or get crafty with them).", 
            "Finish preparing your tomatoes: If using plum tomatoes, halve each lengthwise. If using beefsteak or another round variety, quarter them. Squeeze the seeds out over a strainer over a bowl and reserve the juices. (You can discard the seeds, or get crafty with them.) Either coarsely chop you tomatoes on a cutting board or use a potato masher to do so in your pot, as you cook them in a bit.", 
            "Prepare your vegetables: I finely chop my onion, and mince my carrot, celery and garlic, as does Bastianich. Batali grates his carrots. Burell pulses all four on the food processor to form a paste. All of these methods work.", 
            "Cook your sauce: Heat your olive oil in a large pot over meduim. Cook your onions, carrots, celery and garlic, if you’re using them, until they just start to take on a little color, about 10 minutes. I really like to concentrate their flavor as much as possible. Add your tomatoes and bring to a simmer, lowering the heat to medium-low to keep it at a gentle simmer. If you haven’t chopped them yet, use a potato masher to break them up as you cook them. Simmer your sauce, stirring occasionally. At 30 minutes, you’ll have a fine pot of tomato sauce, but at 45 minutes, you might just find tomato sauce nirvana: more caramelized flavors, more harmonized texture. ", 
            "If your sauce seems to be getting thicker than you want it to be, add back the reserved tomato juice as need. If your sauce is too lumpy for your taste, use an immersion blender to break it down to your desired texture. (“Blasphemy!” some will say, but they’re not in the kitchen with you. So there.) Season with 1/2 teaspoon salt and more to taste. I like somewhere between 1/2 and 1 teaspoon for 4 pounds of tomatoes. Scatter fresh basil over the pot before serving. Taste once more. Swear you’ll never buy jarred sauce again.", 
            "More ways to play around: There are innumerable ways to tweak your tomato sauce. Some like a pinch of red pepper flakes cooked with the carrots/celery/garlic and onion in the beginning. Some add them at the end. Some swear by a glug of red wine added with the tomatoes. Others insist that a tablespoon of tomato paste will give your relatively quick-cooked sauce a longer-cooked flavor. Have fun with it.", 
            "To play around as little as possible: Skip the onion, carrot and celery. Just cook your tomatoes for 30 to 45 minutes and at the end, drizzle in some olive oil or melted butter. If you have time, you can infuse that oil or butter with garlic and basil. Season to taste with salt. Wonder why you ever added so many ingredients to something so obviously perfect without them."
        ], 
        "date": "2010-08-30T14:49:15+00:00"
    }, 
    {
        "ingredient_list": [
            "5 tablespoons olive oil", 
            "1 pound very ripe cherry tomatoes, halved", 
            "1/3 cup plain dry bread crumbs, panko works great here", 
            "1/4 cup freshly grated Parmigiano-Reggiano cheese", 
            "2 tablespoons freshly grated pecorino cheese", 
            "2 garlic cloves, finely chopped", 
            "Salt and freshly ground pepper to taste", 
            "1 pound dried fusilli (corkscrew) or farfalline (butterfly) pasta", 
            "1/4 cup loosely packed fresh basil leaves, torn or sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/02/baked-tomato-sauce.jpg?w=750", 
        "tags": [
            "Italian", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2007/02/gratitude-with-a-cherry-tomato-on-top/", 
        "title": "baked tomato sauce", 
        "directions": [
            "Heat your oven to 400°F. Pour 2 tablespoons of the olive oil in the bottom of a 13-by-9-inch baking dish. Arrange the tomatoes in the dish, cut side up.\nIn a small bowl, combine the bread crumbs, cheeses, and garlic and toss with a fork to mix well. Sprinkle the bread-crumb mixture over the tomatoes, making sure that each cut side is well covered with the crumb mixture. Sprinkle with salt and pepper, and then the 1 more tablespoon of the olive oil. Bake until the tomatoes are cooked through and the crumbs are starting to brown on top, about 20 minutes.\nWhile they bake — as in, right away — bring a large pot of well-salted water to a boil. Add the pasta and cook for 8 to 10 minutes, or until one minute shy of done. (If you can, try to time the pasta so it finishes cooking about the time the tomatoes are ready to come out of the oven.)\nWhen the tomatoes are done, add the basil and use a fork to stir and lightly mash the tomatoes into a rough sauce.  Drain the pasta and immediately transfer it to the baking dish. Add the last 2 tablespoons olive oil and mix well. Serve at once, right in your baking dish."
        ], 
        "date": "2007-02-21T13:53:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 a large, seedless English cucumber (about 6 to 7 ounces), chopped", 
            "1/2 a green bell pepper, chopped", 
            "1 cup (about 6 ounces) cherry or grape tomatoes, halved", 
            "1/4 cup kalamata olives (you can also serve these alongside)", 
            "1/4 small red onion, thinly sliced", 
            "1 lemon, halved", 
            "2 to 3 ounces feta (Bulgarian or French, if you can find them, are my favorites), in thick slices", 
            "2 tablespoons olive oil, or more to taste", 
            "Salt and freshly ground black pepper", 
            "1 sprig oregano, leaves minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/greek-salad-with-lemon-and-oregano.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Greek", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/05/greek-salad-with-lemon-and-oregano/", 
        "title": "greek salad with lemon and oregano", 
        "directions": [
            "Toss cucumbers, pepper, tomatoes, olives (if using) and onion in a shallow bowl or deep plate. Squeeze half a lemon over it. Arrange feta slices on top. Drizzle with olive oil, sprinkle with salt, pepper and oregano. Serve with a slice of feta on top of each serving, and the second half of the lemon for those that like their salads punchier.", 
            "* If you’re concerned about the pungency of the raw onion, you can squeeze the lemon juice on top of it and let it sit for a while in a dish before adding both to the salad. It will mellow and soften it.   "
        ], 
        "date": "2013-05-21T13:27:21+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound green beans, though if you can find a mix of green and yellow beans, it will be all the prettier", 
            "1 pound cherry tomatoes", 
            "1 large shallot", 
            "2 tablespoons red wine vinegar", 
            "Salt and pepper", 
            "1/3 cup extra-virgin olive oil", 
            "Basil or other herb (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/05/green-bean-and-cherry-tomato-salad.jpg?w=750", 
        "tags": [
            "Green Beans", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/05/green-bean-and-cherry-tomato-salad/", 
        "title": "green bean and cherry tomato salad", 
        "directions": [
            "Prepare the vegetables: Top and tail the beans and cut them into large segments. Parboil the beans in salted water until just tender, about four to five minutes. Drain and immediately spread them out to cool. Stem the cherry tomatoes and cut them in half. ", 
            "Make the vinaigrette: Peel and mince the shallot and put it in a bowl with the vinegar and salt and pepper. Whisk in the olive oil. Taste and adjust the balance with more vinegar, oil, or salt, as needed. Toss the cherry tomatoes in with the vinaigrette; this can sit for a while. Do not add the green beans  until just before serving or they will discolor from the acid in the vinaigrette. For variety, the salad can be garnished with basil or some other fresh herb such as parsley, chervil or hyssop.", 
            "Do ahead: Beans and vegetables can be prepared ahead of time. Simply toss with the dressing only at the last minute, as it can discolor the green beans after several hours."
        ], 
        "date": "2008-05-01T15:52:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small head garlic", 
            "2 tablespoons olive oil, plus an extra drizzle for the garlic", 
            "1 9″x13″ sheet frozen puffed pastry*, thawed in fridge for several hours", 
            "1/3 cup finely grated Parmesan cheese", 
            "Kosher salt and freshly ground black pepper or red pepper flakes, to taste", 
            "1 tablespoon capers, drained and rinsed, if salted (or 1 to 2 anchovies, finely chopped)", 
            "1 1/2 pounds (about 4 cups) small cherry or grape tomatoes, the sweetest you can find", 
            "2 tablespoons finely chopped flat-leaf parsley", 
            "1 tablespoons finely chopped fresh chives", 
            "1 tablespoons finely chopped fresh oregano"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/herbed-tomato-and-roasted-garlic-tart1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Photo", 
            "Summer", 
            "Tarts/Quiche", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/herbed-tomato-and-roasted-garlic-tart/", 
        "title": "herbed tomato and roasted garlic tart", 
        "directions": [
            "Roast garlic: Heat oven to 350°F. Cut head of garlic in half crosswise; drizzle cut ends with a few drops of olive oil, then wrap in tightly foil and bake, directly on oven rack, for 45 minutes, until garlic cloves are completely soft. Set aside. [Note: Heads of garlic can also be roasted whole, but I find it easier to remove the cloves without getting any stuck in the skin when it’s halved. Garlic can be roasted up to two days in advance; just keep in the fridge until needed. It will smell exactly like a toasted everything bagel.]", 
            "Prepare crust: Increase oven temperature to 375°F. 9″x13″-inch baking sheet (or quarter-sheet pan) with parchment paper. Fit pastry sheet into pan, pressing it against the bottom and sides. Trim pastry hanging over sides of pan, if there is any. Prick bottom of pastry all over with a fork. Lay parchment paper over crust and fill with pie weights, which can be storebought, or you can use dried beans, rice or even pennies. Bake until edges of tart are golden, 25 minutes. Carefully remove weights and parchment. If any parts have bubbled up, poke them with a knife point and they should deflate.", 
            "Squeeze roasted garlic cloves out into a bowl and mash with a fork until smooth. Spread over baked par-baked crust with a knife, as if you were buttering bread. Sprinkle with Parmesan, salt and pepper. Return to oven bake until tart shell is golden all over, 12 to 15 minutes. Set aside on a cooling rack.", 
            "Heat broiler. In a large bowl, mix tomatoes, capers, olive oil, salt and pepper. Transfer to a baking sheet and broil, shaking pan once or twice, until tomatoes are blistered and have begun to release their juices, 12 to 14 minutes. This may seem a pesky step but getting the juiciness out of the tomatoes will keep the tart crust from getting soggy.", 
            "Increase oven heat to 425°F. Use a slotted spoon to transfer the tomato mixture to the prepared tart shell; distribute tomatoes evenly, in one layer. Sprinkle with the three herbs. Return the tart to the oven and bake it until hot, about 15 minutes. Let cool slightly before cutting into it. ", 
            "Tart can be served hot or closer to room temperature. Store leftovers in fridge. Reheat in 325°F oven for 5 to 10 minutes.", 
            "* My favorite frozen puffed pastry is DuFour — definitely not cheap, but absolutely delicious, made only with butter, flour, salt and a little lemon juice. 1 14-ounce package unfolds to just about 9″x13″, which means I just pressed/stretched it a tiny bit with my fingertips to fit it in the pan — no rolling required (yay). You can also reuse the parchment it comes wrapped into line your crust as you par-bake it."
        ], 
        "date": "2014-09-11T11:52:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup plus 2 tablespoons extra-virgin olive oil", 
            "1 large head romaine (about 1 1/2 lb) *", 
            "1 large garlic clove", 
            "1/4 cup loosely packed fresh flat-leaf parsley leaves", 
            "1/2 teaspoon salt", 
            "3/8 teaspoon black pepper", 
            "1 oz finely grated parmesan (1/2 cup), plus additional for serving", 
            "6 large tomatoes (about 3 inches in diameter)", 
            "6 large eggs at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/like-the-lettuce1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Gluten-Free", 
            "Photo", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2006/09/like-the-lettuce/", 
        "title": "romaine pesto and egg-stuffed tomatoes", 
        "directions": [
            "Strip romaine leaves from stems, reserving both separately, then tear leaves into roughly 2-inch pieces. Measure 4 loosely packed cups of leaves and reserve remainder. With motor running, add garlic to food processor to finely chop. Turn off and add the 4 cups romaine leaves along with the parsley, 1/4 teaspoon salt, 1/4 teaspoon pepper, and cheese, then pulse until finely chopped. With motor running, add remaining   cup oil in a slow stream, blending until incorporated.", 
            "Put oven rack in upper third of oven and preheat oven to 400°F.", 
            "Cut off about 1/8 inch from top of each tomato with a sharp knife.** Gently scrape out pulp and seeds with a spoon and discard them. Put tomatoes, cut sides up, in a 9-inch glass or ceramic dish and spoon 1 tablespoon romaine-parsley pesto into each tomato (you will have extra pesto). Crack 1 egg into each tomato and season with salt and pepper. Bake eggs in tomatoes until whites are set and yolks are still runny, 18 to 22 minutes.", 
            "* I didn’t use nearly this much lettuce. For one, I was only making four eggs, and two, I had a hunch this would make an egregious amount. I may have used 4-6 leaves, tops, and half the oil and parsley.", 
            "** I ended up beveling a little sliver off the bottoms, too, to stop them from rolling over in the dish and dumping out their eggs, and you may have guessed happened before I came up with my brilliant solution. Next time I’d put a droplet of oil underneath the beveled tomatoes, as they stuck a little to the bottom, something I should have also seen coming."
        ], 
        "date": "2006-09-09T15:23:11+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (85 grams) slivered almonds", 
            "1 large handful fresh basil leaves", 
            "1 to 2 large garlic cloves", 
            "Several sprinkles of sea salt", 
            "6 ripe plum tomatoes, quartered", 
            "1/2 cup (50 grams) grated Pecorino or Parmesan", 
            "1/4 to 1/3 cup (60 to 80 ml) olive oil", 
            "1 pound (455 grams) linguine"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/linguine-with-tomato-almond-pesto1.jpg?w=500", 
        "tags": [
            "Italian", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Tomatoes", 
            "Travel", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/09/linguine-with-tomato-almond-pesto/", 
        "title": "linguine with tomato-almond pesto", 
        "directions": [
            "In a large skillet, sauté the almonds in a little olive oil until toasted. Let cool, then blend them in a food processor or blender until they are in coarse pieces.  (“The size of orzo,” the original recipe suggests.) Scoop them out of the processor and set them aside.", 
            "Put the basil, garlic and a few pinches of sea salt into the food processor and chop. Add the almonds back to the food processor (keeping them separate will keep them from getting too finely chopped as you get the basil and garlic to the right texture) with the tomatoes, cheese and olive oil and whirl briefly. Season it with freshly ground black pepper.", 
            "Cook your linguine until it is al dente and could use another minute of cooking time. Reserve one cup of pasta cooking water and drain the rest. Immediately toss the hot linguine with the pesto and mix quickly so that it drinks the sauce up a bit. Add more pasta water if needed. Serve this lukewarm, or at room temperature, with a glass of wine, after you get the baby to bed."
        ], 
        "date": "2010-09-14T11:07:16+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup cherry tomatoes, halved", 
            "1/3 cup chopped, pitted Kalmata olives", 
            "1 clove garlic, minced", 
            "1/4 cup thinly sliced red onion (oops, I forgot this)", 
            "2 tablespoons finely-chopped fresh flat-leaf parsley, divided", 
            "1 teaspoon dried oregano", 
            "1 teaspoon olive oil", 
            "Freshly ground black pepper", 
            "1 8- to 10-ounce block feta", 
            "Crackers, flatbread*, pita chips, or crostini, for dipping "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/08/mediterranean-baked-feta-with-tomatoes.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/08/mediterranean-baked-feta-with-tomatoes/", 
        "title": "mediterranean baked feta with tomatoes", 
        "directions": [
            "In a bowl, mix the tomatoes, olives, onion, garlic, 1 tablespoon of the parsley, oregano, olive oil and a few grinds of pepper. ", 
            "On a grill: Heat your grill to medium-high. Set the feta block in the middle of a piece of foil. Pile the tomato mixture on top of the feta. Fold up the edges of the foil so that it will hold in any liquid as it cooks. Place the packet straight on a grill for 15 minutes to warm it through. Remove from grill and transfer to plate or serving dish.", 
            "In the oven: Heat oven to 400°F. Check to see that your dish is oven-proof. (I didn’t!) Place the block of feta in the middle of your dish. Pile the tomato mixture on top of the feta. Bake for 15 minutes. ", 
            "Both methods: The feta will not melt, just warm and soften. Garnish with parsley and serve with crackers; eat immediately. As it cools, the feta will firm up again. We found that the dish could be returned to the oven to soften it again. We did this with leftovers, too.", 
            "* I made these. These days, I’ve been running a pizza wheel over the rolled-out pieces to pre-cut it into rough rectangles before baking it, like so."
        ], 
        "date": "2012-08-24T15:33:36+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pound plum tomatoes", 
            "3/4 teaspoon coarse salt", 
            "1 large clove garlic, thinly sliced", 
            "Pinch of red pepper flakes", 
            "Small handful basil leaves, most left whole, a few slivered for garnish", 
            "1/4 cup olive oil", 
            "12 ounces (3/4 pound) dried spaghetti", 
            "1 tablespoon unsalted butter, or maybe two if nobody is looking"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/naked-tomato-sauce1.jpg?w=750", 
        "tags": [
            "Italian", 
            "Pasta", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2011/08/naked-tomato-sauce/", 
        "title": "naked tomato sauce", 
        "directions": [
            "Bring a large pot of water to boil. Cut a small X at the bottom of each tomato. Blanch the tomatoes in the boiling water for 10 to 30 seconds, then either rinse under cold water or shock in an ice water bath. Peeling the tomatoes should now be a cinch. Discard the skins. Keep the pot full of hot water — you can use it to cook your spaghetti in a bit.", 
            "Cut each of your tomatoes in half lengthwise and scoop out the seeds with your fingertips into a small strainer set over a bowl. Ditch the seeds, reserve the juices.", 
            "Add tomatoes and salt to a large saucepan (you’ll be adding the pasta to this later, so err on the big side) and turn the heat to medium-high. There are several ways to break the tomatoes down (with your hands, chopping, an immersion blender that I don’t think Italian Grandmothers would approve of but don’t worry, they’re not in the kitchen with you anyway) but I loved Conant’s suggestion of a potato masher, as it gives you the maximum control over how chunky, smooth you want your sauce.", 
            "Once the sauce has begun to boil, turn your heat down to medium-low and gently simmer your tomatoes for 35 to 45 minutes, mashing them more if needed. If they begin to look a little dry, add your strained and reserved tomato juices.", 
            "While the tomato sauce cooks, combine garlic, a few whole basil leaves, a pinch of red pepper flakes and 1/4 cup olive oil in a small saucepan. Heat them slowly, over the lowest heat so that they take a long time to come to a simmer. Once it does, immediately remove it from the heat and strain the oil into a small dish. You’ll need it shortly.", 
            "When the tomato sauce has been simmering for about 25 minutes, bring your tomato-blanching pot of water back to a boil with a healthy helping of salt. Once boiling rapidly, cook your spaghetti until it is al dente, i.e. it could use another minute of cooking time. Reserve a half-cup of pasta cooking water and drain the rest.", 
            "Once your sauce is cooked to the consistency you like, stir in the reserved olive oil and adjust seasonings to taste. Add drained spaghetti and half the reserved pasta water to the simmering tomato sauce and cook them together for another minute or two. Add remaining pasta water if needed to loosen the sauce. Stir in the butter, if using, and serve immediately with slivered basil for garnish. We found that sauce this good, this simple and rich, needs no grated cheese."
        ], 
        "date": "2011-08-31T10:25:34+00:00"
    }, 
    {
        "ingredient_list": [
            "Oregano dressing", 
            "4 cloves garlic", 
            "1 to 2 tablespoons dried oregano (Nancy recommends 2; I got nervous and used 1, but might not have minded more)", 
            "2 teaspoons kosher salt", 
            "Freshly ground black pepper", 
            "2 tablespoons lemon juice, or juice of 1 lemon", 
            "1/4 cup red wine vinegar", 
            "1/4 cup olive oil, ideally extra-virgin", 
            "Salad and assembly", 
            "1 (15-ounce) can chickpeas or 1 3/4 cups cooked chickpeas, drained", 
            "1 small red onion, peeled and sliced into paper-thin rings", 
            "1/2 pound provolone (see Note about varieties), sliced 1/8-inch thick then cut into 1/4-inch ribbons", 
            "1/2 pound salami, peeled, sliced 1/8-inch thick then cut into 1/4-inch ribbons", 
            "4 medium or 8 small pickled pepperoncini, sliced into rings", 
            "3/4 pound cherry tomatoes", 
            "Sea salt", 
            "1 head iceberg lettuce (see Note about size), halved, cored, and cut in 1/2-inch ribbons", 
            "1 head radicchio, halved, cored and cut in 1/4-inch ribbons", 
            "2 tablespoons dried oregano for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/nancys-chopped-salad1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Gluten-Free", 
            "Italian", 
            "Lunch", 
            "Photo", 
            "Radicchio", 
            "Salad", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/06/nancys-chopped-salad/", 
        "title": "nancy’s chopped salad", 
        "directions": [
            "Make dressing: Roughly chop the garlic and then add the oregano, salt and up to 1/2 teaspoon ground pepper. Chop the mixture together and use the side of a knife or a mortar and pestle to make a grainy herb paste. Transfer the paste to a large salad bowl, and add the lemon juice and vinegar. Mix with a fork allowing the salt to dissolve, then add the oil and whisk with a fork until well combined. The dressing should be thick with garlic and oregano. If you’re using a small head of iceberg, transfer 1/3 the dressing into a small bowl to be used only if needed. For a larger head of iceberg, you’ll want it all.", 
            "Assemble salad: Gently fold the chickpeas, red onion, provolone, salami, pepperoncini (including seeds and juice) into the dressing, one at a time. Halve the tomatoes lengthwise and season with 1 1/2 teaspoons sea salt. Set aside until ready to serve.", 
            "To serve: When ready to serve, gently add the tomatoes, lettuce and radicchio to the salad bowl, along with a couple of generous pinches of oregano, and toss to combine with the dressing. Adjust seasonings to taste, adding any reserved dressing if needed. Serve immediately.", 
            "Sicilian Oregano Sources: It’s definitely available online here and here. If you’re in NYC, I bought the jar you see here at Brooklyn Larder a year or two ago for about $7. However, I was over at Buon Italia in Chelsea Market today (6/5) and they sell, well, almost a tree of the stuff, easily 10 times what was in that jar, for all of $4.50. Buy it and share it with all of your friends! "
        ], 
        "date": "2014-06-02T12:24:46+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups water", 
            "1 cup (updated) semi-pearled farro (see Note above for farro types)", 
            "1/2 large onion (I usually use a white one, for mildness)", 
            "2 cloves garlic", 
            "9 ounces grape or cherry tomatoes", 
            "1 1/4 teaspoons kosher or coarse sea salt", 
            "Up to 1/4 teaspoon red pepper flakes (to taste)", 
            "1 tablespoon olive oil, plus extra for drizzling", 
            "Few basil leaves, cut into thin ribbons", 
            "Grated parmesan cheese, for serving (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/one-pan-farro-with-tomatoes.jpg?w=750", 
        "tags": [
            "Grain/Rice", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Tomatoes", 
            "Vegan", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/07/one-pan-farro-with-tomatoes/", 
        "title": "one-pan farro with tomatoes", 
        "directions": [
            "Place water and farro in a medium saucepan to presoak (I find just 5 to 10 minutes sufficient) while you prepare the other ingredients. Adding each ingredient to the pot as you finish preparing it, cut onion in half again, and very thinly slice it into quarter-moons. Thinly slice garlic cloves as well. Halve or quarter tomatoes. Add salt, pepper flakes (to taste) and 1 tablespoon olive oil to pan, and set a timer for 30 minutes. Bring uncovered pan (no lid necessary) up to a boil, then reduce to a gentle simmer, stirring occasionally. When the timer rings, the farro should be perfectly cooked (tender but with a meaty chew), seasoned and the cooking water should be almost completely absorbed. If needed, though I’ve never found it necessary, cook it for 5 additional minutes, until farro is more tender. ", 
            "Transfer to a wide serving bowl. If there’s enough leftover cooking liquid to be bothersome, simply use a slotted spoon to leave the amount you wish to behind. Drizzle farro lightly with additional olive oil, scatter with basil and parmesan. Eat immediately. Repeat tomorrow."
        ], 
        "date": "2013-07-15T12:04:00+00:00"
    }, 
    {
        "ingredient_list": [
            "Roasted tomatoes", 
            "4 cups (about 680 grams) grape tomatoes", 
            "Olive oil", 
            "Salt", 
            "Oregano dressing", 
            "1 big clove or 2 small cloves garlic", 
            "1 1/2 tablespoons dried oregano (if you can find it, Sicilian is my favorite)", 
            "1 1/4 teaspoons kosher salt, plus more to taste", 
            "Freshly ground black pepper", 
            "3 tablespoons lemon juice", 
            "3 tablespoons red or white wine vinegar", 
            "1/3 cup olive oil", 
            "Assembly", 
            "1 pound (455 grams) dried pasta, a bite-sized shape of your choosing (I used reginetti), cooked until 1 to 2 minutes before doneness and drained", 
            "6 ounces (170 grams) crumbled salty cheese, such as ricotta salata, feta, queso fresco (I used this posh, delicious stuff)", 
            "1/2 cup (70 grams) pine nuts, well-toasted and cooled", 
            "1/2 cup (70 grams) pitted and rough-chopped olives of your choice (I used gaeta here, but like them even more when oil-cured)", 
            "Salt and pepper", 
            "Handful fresh basil leaves, roughly chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pasta-salad-with-roasted-tomatoes1.jpg?w=640", 
        "tags": [
            "Pasta", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/05/pasta-salad-with-roasted-tomatoes/", 
        "title": "pasta salad with roasted tomatoes", 
        "directions": [
            "Roast tomatoes: Heat oven to 300°F (150°C). Cover 1 to 2 baking sheets with parchment paper or a nonstick baking mat. Cut each small tomato in half lengthwise and arrange cut side up in a single layer on prepared sheets. Drizzle lightly with olive oil and sprinkle with salt. Bake in oven for approximately 90 minutes, until somewhat shriveled and dry to the touch, but not fully dehydrated. Set aside until needed, letting them cool. [Note, if you pine nuts are not yet toasted, you can place them in the oven for the last 10 minutes, shaking them once or twice for even coloring. Let cool as well before using.]", 
            "Make dressing: Roughly chop the garlic on a cutting board, then add oregano, salt and a few grinds of black pepper. Mince the mixture with your knife until it’s a grainy herb paste. Transfer to a small bowl, whisk in lemon juice and vinegar, then slowly drizzle in oil, whisking the whole time. Taste and adjust as needed; you might need more salt or vinegar. You want a strongly flavored dressing that won’t get lost in that big bowl of ingredients.", 
            "Assemble salad: In a giant bowl, place drained pasta, roasted tomatoes, cheese, pine nuts and olives and toss gently to combine. Add dressing to taste, along with any extra salt and pepper needed. Finish with basil. Salad can be eaten right away, but will keep in the fridge up to 3 days. This is also perfect for picnics and potlucks, as it can handle being out in the sun without going south."
        ], 
        "date": "2015-05-27T11:58:05+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons extra-virgin olive oil", 
            "1/2 cup finely chopped onion", 
            "2 large garlic cloves, coarsely chopped", 
            "1/8 teaspoon dried crushed red pepper", 
            "1/2 pound Italian sausages, casings removed", 
            "1/4 cup dry white wine", 
            "1 3/4 cups chopped plum tomatoes or diced canned tomatoes", 
            "1 cup shelled fresh fava beans (from about 1 pound), blanched 3 minutes then peeled, or double-peeled frozen, thawed", 
            "3/4 pound fresh pasta sheets (simple recipe here, richer recipe here), cut as desired (maltagliati, or “badly cut” pasta with irregular shapes is suggested), or dried egg fettuccine", 
            "2 tablespoons finely grated Pecorino Romano cheese plus additional for passing"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pasta-with-favas-tomatoes-and-sausage1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Meat", 
            "Pasta", 
            "Photo", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2009/04/pasta-with-favas-tomatoes-and-sausage/", 
        "title": "pasta with favas, tomatoes and sausage", 
        "directions": [
            "Heat oil in large saucepan over medium heat. Add next onion, garlic and red pepper and sauté until onion is translucent, about six minutes. Add sausages; break up with fork or a flat-ended wooden spoon. Sauté until brown, about three minutes. Add wine; simmer one minute, scraping up browned bits. Add tomatoes and fava beans. Sauté until tomatoes soften, about five minutes. Season sauce with salt and pepper.", 
            "Meanwhile, cook pasta in large pot of boiling salted water until tender but still firm to bite. Drain, reserving 1/2 cup pasta cooking liquid. Return pasta to same pot.", 
            "Add sauce to pasta. Toss over medium heat until sauce coats pasta, adding reserved cooking liquid as needed if dry, about two minutes. Mix in two tablespoons cheese and transfer pasta to bowl. Serve, passing additional cheese. "
        ], 
        "date": "2009-04-21T09:22:34+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pints (1 1/2 pounds) grape or cherry tomatoes (1 1/2 lb)", 
            "3 large garlic cloves, left unpeeled", 
            "1/4 cup olive oil, plus more for tomatoes", 
            "1/4 cup warm water", 
            "1 teaspoon fresh lemon juice", 
            "1 teaspoon kosher salt", 
            "1/4 teaspoon black pepper", 
            "2 3/4 cups vegetable broth", 
            "2 1/4 cups (12 ounces or 340 grams) pearl couscous, sometimes sold as Israeli couscous", 
            "1/2 cup Kalamata or other brine-cured black olives, pitted and chopped", 
            "1/3 cup chopped fresh flat-leaf parsley", 
            "1/4 cup chopped fresh mint", 
            "1 teaspoon chopped fresh thyme"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/pearl-couscous-with-olives-and-roasted-tomatoes.jpg?w=750", 
        "tags": [
            "Grain/Rice", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tomatoes", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/07/pearl-couscous-with-olives-and-roasted-tomatoes/", 
        "title": "pearl couscous with olives and roasted tomatoes", 
        "directions": [
            "\nPrepare tomatoes:  Heat oven to 300°F. Halve tomatoes through stem ends and arrange, cut sides up, in 1 layer on a large baking sheet. Add garlic to pan and drizzle both tomatoes and garlic lightly with oil (about 1 tablespoon). Sprinkle with salt. Roast in middle of oven until tomatoes are slightly shriveled around edges, about 1 hour. Cool in pan on a rack 20 to 30 minutes.", 
            "Meanwhile, make couscous:  Bring broth to a boil in a 3-quart heavy saucepan and stir in couscous, then simmer, uncovered, 6 minutes. Cover pan and remove from heat. Let stand 10 minutes. Spread couscous in one layer on a baking sheet or plate and cool 15 minutes.", 
            "When tomatoes are done, make dressing:  Peel garlic and puree with 1/4 cup oil, water, lemon juice, 1 teaspoon salt, 1/4 pepper, and 1/2 cup roasted tomatoes in a blender until dressing is very smooth. Adjust seasonings to taste.\nAssemble and serve: Transfer cooled couscous to a bowl and stir in olives, roasted tomatoes, herbs, and dressing. Season to taste with more salt and pepper as needed.\nDo ahead: Roasted tomatoes, dressing, and couscous can be made 1 day ahead and kept separately, covered and chilled. Bring to room temperature before proceeding."
        ], 
        "date": "2007-07-24T14:25:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 lb eggplant, cut into 1/2-inch cubes", 
            "3/4 lb zucchini, cut into 1/2-inch cubes", 
            "10 tablespoons extra-virgin olive oil", 
            "1 teaspoon salt", 
            "1 teaspoon black pepper", 
            "1 cup chopped scallion (from 1 bunch)", 
            "1 1/2 teaspoons ground cumin", 
            "1/2 teaspoon ground coriander", 
            "1/4 teaspoon cayenne (note: I used 1/8 tsp. and it was plenty spicy; adjust to taste)", 
            "1 1/4 cups pearl barley (8 oz)", 
            "1 (14-oz) can reduced-sodium vegetable or chicken broth (1 3/4 cups)", 
            "3/4 cup water", 
            "2 tablespoons fresh lemon juice", 
            "1 garlic clove, minced", 
            "1/4 teaspoon sugar", 
            "1/2 lb cherry tomatoes, quartered", 
            "1/3 cup Kalamata or other brine-cured black olives, pitted and halved", 
            "1/2 cup thinly sliced red onion, rinsed and drained if desired", 
            "1 cup chopped fresh flat-leaf parsley", 
            "1/2 cup chopped fresh mint"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/03/mediterranean-eggplant-and-barley-salad.jpg?w=750", 
        "tags": [
            "Eggplant", 
            "Grain/Rice", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/03/recipe-liberation-day/", 
        "title": "mediterranean eggplant and barley salad", 
        "directions": [
            "Accompaniment: 1 (1/2-lb) piece ricotta salata, cut crosswise into thin slices ", 
            "Roast eggplant and zucchini: Put oven racks in upper and lower thirds of oven and preheat oven to 425°F.", 
            "Toss eggplant and zucchini with 5 tablespoons oil, 3/4 teaspoon salt, and 3/4 teaspoon pepper in a bowl, then spread in 2 oiled large shallow (1-inch-deep) baking pans. Roast vegetables in oven, stirring occasionally and switching position of pans halfway through baking, until vegetables are golden brown and tender, 20 to 25 minutes total. Combine vegetables in 1 pan and cool, reserving other pan for cooling barley.", 
            "Cook barley: Heat 2 tablespoons oil in a 3- to 4-quart heavy pot over moderately high heat until hot but not smoking, then cook scallion, cumin, coriander, and cayenne, stirring, until fragrant, about 1 minute. Add barley and cook, stirring until well coated with oil, 2 minutes more. Add broth and water and bring to a boil. Reduce heat and simmer, covered, until all of liquid is absorbed and barley is tender, 30 to 40 minutes. Remove from heat and let stand, covered, 5 minutes. Transfer to reserved shallow baking pan and spread to quickly cool, uncovered, to room temperature, about 20 minutes.", 
            "Make dressing and assemble salad: Whisk together lemon juice, garlic, sugar, and remaining 1/4 teaspoon salt, 1/4 teaspoon pepper, and 3 tablespoons oil in a large bowl. Add barley, roasted vegetables, and remaining ingredients to bowl with dressing and toss until combined well. Serve with cheese slices.", 
            "Do ahead: Salad can be made 1 day ahead and chilled, covered. Return to room temperature before serving."
        ], 
        "date": "2007-03-15T11:33:27+00:00"
    }, 
    {
        "ingredient_list": [
            "2 to 3 tablespoons olive oil", 
            "Coarse or Kosher salt", 
            "6 medium-to-large (mine were 3 inches across, averaged 8 1/4 ounces in weight) tomatoes", 
            "Red pepper flakes, to taste", 
            "1/4 medium or 1/2 small onion, finely chopped", 
            "1 garlic clove, minced", 
            "9 tablespoons arborio or another short-grained starchy rice", 
            "Few tablespoons chopped parsley, oregano or slivered basil (or mix thereof)", 
            "Handful breadcrumbs, if using (unless using gluten-free breadcrumbs, this will of course negate the dish’s gluten-free status)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/rice-stuffed-tomatoes.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Gluten-Free", 
            "Grain/Rice", 
            "Italian", 
            "Photo", 
            "Summer", 
            "Tomatoes", 
            "Vegan", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/08/rice-stuffed-tomatoes/", 
        "title": "rice-stuffed tomatoes", 
        "directions": [
            "Heat oven to 350 degrees. Lightly coat an ovenproof baking dish with olive oil. ", 
            "Prepare tomatoes: Cut the tops off the tomatoes and scoop out tomato juices, seeds and flesh into a non-reactive (i.e. just about anything but aluminum) bowl. I like to use a grapefruit knife to make the first cuts, then a spoon to remove the rest, but you can use anything you have around, being careful not to pierce the bottom of the tomatoes. Salt the cavities of the tomatoes and turn them upside down on a plate to drain.", 
            "Prepare reserve: Run scooped-out tomato flesh and juices through a food mill or pulse in a blender until coarsely pureed. Heat a large skillet over medium heat, then add 2 tablespoons olive oil, heating it too. Once hot, add onion, garlic and red pepper flakes, cooking them together for 2 minutes, or until onion begins to soften. Add rice and cook them together for about 3 minutes, or until rice toasts a little. Add tomato puree and bring to a simmer, then reduce heat to medium-low. Season with 3/4 teaspoon salt, then cover skillet with a lid, and let simmer for 10 to 15 minutes, stirring occasionally, until rice is par-cooked. Adjust seasoning if needed.", 
            "[If using the potatoes, as mentioned in the Notes up top, prepare them while the rice simmers.]", 
            "Reassemble tomatoes: Stir fresh herbs into tomato-rice mixture. Arrange tomatoes right-side-up in baking pan then spoon mixture into tomatoes, filling them just 7/8 of the way to leave room for the rice to finish expanding. Coat with breadcrumbs that you can drizzle lightly with olive oil, if using, or you can replace the tomato lid on each (though, do not spend 10 minutes trying to match them back up, as I did last summer. It’s pointless.)", 
            "Bake: Uncovered for 30 minutes, until tomato walls are soft and the rice inside has finished cooking. Serve hot. Repeat again tomorrow."
        ], 
        "date": "2013-08-19T12:05:15+00:00"
    }, 
    {
        "ingredient_list": [
            "3 medium tomatoes, halved", 
            "1 large eggplant (about 1 1/2 pounds), halved lengthwise (I used 3 smaller ones)", 
            "1 small onion, halved (eh, mine was medium)", 
            "6 large garlic cloves, peeled", 
            "2 tablespoons olive oil", 
            "1 tablespoon chopped fresh thyme or 1 teaspoon dried", 
            "4 cups chicken stock or vegetable broth", 
            "1/4 cup heavy cream (you can add more to taste, or skip this entirely)", 
            "3/4 cup (about 3 1/2 ounces) crumbled goat cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-eggplant-soup1.jpg?w=500", 
        "tags": [
            "Eggplant", 
            "Fall", 
            "Photo", 
            "Soup", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/10/roasted-eggplant-soup/", 
        "title": "roasted eggplant soup", 
        "directions": [
            "Preheat oven to 400°F. Arrange tomatoes, eggplant, onion and garlic on a large baking sheet, or two smaller ones if you, like me, have a tiny oven. Brush or drizzle vegetables with oil then roast them for 20 minutes, pausing only to remove the garlic cloves (the original recipe had you keep them in the whole time, and mine, sadly, burned) and returning the pans to the oven for another 25 minutes, until the remaining vegetables are tender and brown in spots. Remove from oven and scoop eggplant from skin into a heavy, large saucepan or soup pot. Add the rest of the vegetables, the thyme and the chicken or vegetable stock and bring to a boil, then reduce to a simmer. Cook until onion is very tender, about 45 minutes (mine took longer). Cool slightly.", 
            "Working in batches, puree soup in blender until it is as smooth as you’d like it to be. (Or, if you have an immersion blender, you can do this in the pot.) Back in the pot, add the cream and bring the soup back to a simmer. Season with salt and pepper. Serve in four bowls, sprinkled with goat cheese.", 
            "A spicier riff: As I mentioned above, if you like to play with spices, this soup has a lot of potential. The next time I make it, I might give it a spin with 1 to 2 teaspoons ground cumin, 1 teaspoon ground coriander and a pinch of red pepper flakes or Aleppo pepper added in with the broth. I might finish the soup with a squeeze of lemon juice and I might use feta, which has a stronger flavor than the soft chevre that I used. If you add any spices or made any changes, I’d love to hear what you came up with in the comments."
        ], 
        "date": "2010-10-13T10:03:18+00:00"
    }, 
    {
        "ingredient_list": [
            "1 to 2 tablespoons plus 4 teaspoons olive oil", 
            "1 1/2 pounds eggplant (about 2 medium), in 3/4- to 1-inch slices", 
            "2 ounces (1/2 cup) chopped or crumbled ricotta salata", 
            "2 tablespoons capers, drained", 
            "1/3 cup finely diced red onion", 
            "3 seeded, diced medium tomatoes (1 1/2 cups)", 
            "3 tablespoons minced fresh mint leaves", 
            "2 teaspoon red wine vinegar", 
            "Freshly ground black pepper."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-eggplant-with-tomatoes-and-mint1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Eggplant", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/09/roasted-eggplant-with-tomatoes-and-mint/", 
        "title": "roasted eggplant with tomatoes and mint", 
        "directions": [
            "Preheat oven to 425 degrees. Coat a large baking sheet generously with olive oil, about 1 to 2 tablespoons. Arrange eggplant rounds in a single layer. Sprinkle with salt and freshly ground black pepper. Roast, without disturbing, for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release from the pan with no effort. If they’re not, let it cook longer. Once flipped, sprinkle them with additional salt and freshly ground black pepper and return the pan to the oven for another 10 to 12 minutes or so, until the undersides match the tops.", 
            "[Alternatively, on the grill: Brush eggplant slices with oil; sprinkle with salt and pepper. Grill eggplant slices until slightly charred and tender when pierced with knife, about 5 to 7 minutes per side.]", 
            "Meanwhile, mix your ricotta, capers, onion, tomatoes, mint, vinegar and remaining 4 teaspoons olive oil in a small bowl. Taste for seasoning; ricotta salata tends to be quite salty so I don’t find that this dish needs more than a pinch of salt, if that. Add more vinegar, if desired. Add freshly ground black pepper, to taste.", 
            "When the eggplant discs are done, arrange them on a serving platter. Scoop a spoonful of the salad over each round. Eat immediately."
        ], 
        "date": "2011-09-08T22:11:12+00:00"
    }, 
    {
        "ingredient_list": [
            "Soup", 
            "3 pounds plum tomatoes, halved lengthwise", 
            "2 tablespoons olive oil", 
            "2 large or 4 small cloves garlic, unpeeled", 
            "1 teaspoon finely chopped fresh thyme leaves or 1/4 teaspoon dried", 
            "1/4 teaspoon (or more to taste) dried crushed red pepper", 
            "4 cups chicken or vegetable stock", 
            "Lid", 
            "4 1-inch slices from a large loaf of rye bread, whole wheat sourdough or bread of your choice (or 16 1-inch slices from a baguette), toasted until hard and lightly buttered on one side", 
            "1 tablespoon grated raw onion", 
            "1 cup coarsely grated cheddar (or more to taste)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/09/roasted-tomato-soup-with-broiled-cheddar.jpg?w=750", 
        "tags": [
            "Photo", 
            "Soup", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/09/roasted-tomato-soup-with-broiled-cheddar/", 
        "title": "roasted tomato soup with broiled cheddar", 
        "directions": [
            "Make soup: Preheat oven to 400°F. Wrap garlic cloves in a tight foil packet. Place tomatoes, cut side up, on large baking sheet. Sprinkle generously with salt and pepper (I used 1 full teaspoon of Kosher salt). Drizzle tomatoes with olive oil.  Add foil packet of garlic to tray. Roast until tomatoes are brown and tender (garlic will be very tender), about 1 hour. Cool slightly.", 
            "Unwrap garlic packet and peel cloves. Transfer cloves, tomatoes and any accumulated juices to a blender or food processor and pulse machine on and off until tomatoes are a chunky puree. Transfer tomatoes to medium pot and add thyme, crushed red pepper and stock and bring to a boil Reduce heat to a simmer and cook, uncovered, for 25 minutes. Remove from heat and adjust seasonings to taste.", 
            "Create cheddar lid: Preheat oven to 350. Arrange four ovenproof soup bowls, crocks or large mugs on a large, foil-lined baking sheet. Stir grated onion into the warm soup. (I love this last-minute suggestion of onion.) Float toast slice(s) in each bowl, buttered side up and divide grated cheese generously over top. (If you’re using a wide bowl, you might find that you want more cheese to create a thick, broiled lid.)  Bake soups on tray for 15 to 20 minutes, until cheese on top is bubbling and brown at the edges. If you’d like it even more bronzed on top, preheat your broiler and finish soups for a minute or two under it. Serve immediately.", 
            "Do ahead: Soup can be prepared one day ahead, and kept covered in the fridge. Rewarm before serving, or before finishing with cheddar crouton."
        ], 
        "date": "2011-09-20T13:49:02+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound cipollini onions", 
            "1 pound small Roma or large cherry tomatoes", 
            "1/4 cup olive oil", 
            "Coarse salt", 
            "4 slices of country or ciabatta bread, one-inch thick", 
            "1 15-ounce can of white beans, drained and rinsed or 1 1/2 cups cooked beans of your choice", 
            "Garlic clove (optional)", 
            "Few fresh basil leaves, slivered"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-tomatoes-and-cipollini1.jpg?w=500", 
        "tags": [
            "Herbs", 
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/09/roasted-tomatoes-and-cipollini/", 
        "title": "roasted tomatoes and cipollini", 
        "directions": [
            "Preheat oven to 375°F. Boil a small pot of water and blanche the cipollini for 10 seconds, then plunging them into cold water. Use a paring knife to make a small slit in each, and slide them out of their skins and outer layer.", 
            "Spread peeled onions and tomatoes in a roasting pan. Drizzle with olive oil and a few good pinches of coarse salt. Toss everything together until well-coated and roast in preheated oven for about 45 minutes, reaching in every 15 minutes with a spatula to roll the tomatoes and onions around to ensure all sides get blistered.", 
            "Just before you take the tomatoes and onions out, place your bread slices on the oven rack (or a tray, if you’re more refined than us) and let them toast lightly. You can rub the toasts with a halved garlic clove, if you like, while still hot. Use tongs to arrange toasts in one layer on a serving platter. Dump the white beans over the bread, and using a pot holder, scrape the entire contents of the tomato-and-onion roasting pan, still hot, over the white beans. Do not skimp on the juices that have collected, all of them — don’t leave any in the pan. They could make a religious person out of you.", 
            "Sprinkle the dish with the basil and eat at once. "
        ], 
        "date": "2009-09-09T12:02:01+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons olive oil (reduced from original)", 
            "2 cups bread from a French boule, in a 1/2-inch dice, crusts removed (I went closer to 3 cups, after buying a loaf of very puffy Italian bread by accident)", 
            "2 1/2 pounds plum whatever good tomatoes you’ve got, cut into 1/2-inch dice", 
            "3 cloves garlic, minced (about 1 tablespoon)", 
            "2 tablespoons sugar", 
            "2 teaspoons Kosher salt (read this)", 
            "1 teaspoon freshly ground black pepper", 
            "1/2 cup thinly slivered basil leaves, lightly packed", 
            "1 cup freshly grated Parmesan cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/4801306651_ec75e15163_o.jpg?w=750", 
        "tags": [
            "Photo", 
            "Put An Egg On It", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/07/scalloped-tomatoes-with-croutons/", 
        "title": "scalloped tomatoes with croutons", 
        "directions": [
            "Preheat the oven to 350°F. Heat olive oil in a large sauté pan over medium-high. Add the bread cubes and stir so that they are evenly coated with oil. Cook cubes, tossing frequently, until toasty on all sides, about 5 minutes.", 
            "Meanwhile, combine tomatoes, garlic, sugar, salt and pepper in a large bowl. When the bread cubes are toasted, add the tomato mixture and cook them together, stirring frequently, for 5 minutes. Remove from heat, and stir in the basil. Pour into a shallow (6 to 8 cup) baking dish and top with Parmesan cheese. Bake 35 to 40 minutes until the top is browned and the tomatoes are bubbly. Serve hot or warm with a big green salad, a bean salad and/or a poached egg. "
        ], 
        "date": "2010-07-18T10:19:15+00:00"
    }, 
    {
        "ingredient_list": [
            "Steak", 
            "2 1 1/2 pound skirt steaks", 
            "Kosher salt", 
            "4 teaspoons (packed) brown sugar, light or dark", 
            "2 teaspoons paprika", 
            "1/2 teaspoon cayenne pepper, or to taste", 
            "1/2 teaspoon freshly ground black pepper", 
            "Vegetable oil (for brushing)", 
            "Salad", 
            "1 cup finely chopped red onion", 
            "3 tablespoons Sherry vinegar, divided", 
            "2 pounds cherry or grape tomatoes, halved (from about 3 pints or 10 ounce containers)", 
            "1 cup chopped celery hearts (inner stalks and leaves; from 1 bunch)", 
            "1/2 cup chopped brined green olives plus 2 tablespoons olive brine", 
            "2 tablespoons prepared horseradish", 
            "1 tablespoon Worcestershire sauce", 
            "1 teaspoon hot pepper sauce", 
            "1/2 teaspoon celery seeds", 
            "1/4 cup extra-virgin olive oil", 
            "Kosher salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/07/bloody-mary-steak-salad.jpg?w=750", 
        "tags": [
            "Grilling", 
            "Meat", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2011/07/skirt-steak-with-blood-mary-tomato-salad/", 
        "title": "skirt steak with bloody mary tomato salad", 
        "directions": [
            "Prepare steaks: Arrange steaks on large rimmed sheet or cutting board. Mix 1 teaspoon Kosher salt, dark brown sugar, paprika, cayenne and freshly ground black pepper together in a dish. Rub all over steaks and let them marinate in this rub for 1 to 3 hours, covered in the refrigerator. Remove steaks from fridge 1 hour before you’re ready to cook them, to bring them to room temperature.", 
            "Prepare salad: Pour 1 tablespoon sherry vinegar over onions in the bottom of a large bowl and let them sit for 10 minutes, stirring occasionally. This will temper the onion’s bite. Add tomatoes, celery and olives. Whisk remaining 2 tablespoons vinegar, reserved olive brine, horseradish, Worcestershire, pepper sauce and celery seeds in a medium bowl. Slowly drizzle in oil, whisking constantly until combined. Add to tomato salad and toss to coat. Season with salt and pepper to taste. Set aside until needed, and up to 4 hours in advance, if covered and refrigerated.", 
            "Cook steaks: Preheat a charcoal grill to medium-high or a gas grill to the highest heat. Brush grill grates with oil. Grill steaks for about 4 to 5 minutes on each side for medium-rare. Let rest for 10 minutes before slicing into 1/4-inch thick slices, against the grain.", 
            "Alternately, cook the steaks inside: Heat a large cast-iron skillet on medium-high to high and coat bottom with oil. When oil begins to shimmer, place steak in skillet and do not move it for 5 minutes. Turn it once, and cook for another 3 minutes for medium-rare. Repeat with second steak. If your steaks are too large to cook in one piece, you may halve them to fit. Let rest for 10 minutes before slicing into 1/4-inch thick slices, against the grain."
        ], 
        "date": "2011-07-05T10:50:08+00:00"
    }, 
    {
        "ingredient_list": [
            "Cherry, grape or small Roma tomatoes", 
            "Whole gloves of garlic, unpeeled", 
            "Olive oil", 
            "Herbs such as thyme or rosemary (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/08/slow-roasted-tomatoes1.jpg?w=750", 
        "tags": [
            "Photo", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/08/slow-roasted-tomatoes/", 
        "title": "slow-roasted tomatoes", 
        "directions": [
            "\n"
        ], 
        "date": "2008-08-14T13:49:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound fresh shell beans in pod or 1 cup frozen baby lima beans (I used 1/2 pound fresh cranberry beans, 1/2 pound fresh lima beans)", 
            "1/4 pound bacon (about 4 slices)", 
            "1 1/2 tablespoons olive oil", 
            "1 small Vidalia onion or other sweet onion, chopped", 
            "1 large garlic clove, minced", 
            "3/4 pound cherry tomatoes (about 1 1/2 pints), halved", 
            "Fresh kernels from 4 ears corn", 
            "1 tablespoon sherry vinegar, plus more to taste", 
            "1/4 cup packed small fresh basil leaves (I used less)", 
            "1/4 cup packed small fresh arugula leaves (I used more)", 
            "1 garlic clove, peeled and halved", 
            "1 round loaf crusty bread", 
            "2 tablespoons extra-virgin olive oil", 
            "Salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/4819859550_857986cd86_o.jpg?w=748", 
        "tags": [
            "Arugula", 
            "Beans", 
            "Corn", 
            "Photo", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2010/07/summer-succotash-with-bacon-and-croutons/", 
        "title": "summer succotash with bacon and croutons", 
        "directions": [
            "Cut three 1-inch-thick slices from middle of loaf and brush bread with oil. Lightly oil a well-seasoned ridged grill pan and heat over moderately high heat until hot but not smoking. Grill bread until golden brown on both sides. Alternately, you can run toasts under the broiler for a minute. Remove from heat and immediately rub bread both sides with cut side of garlic and sprinkle with salt. Cut into cubes and toss into succotash."
        ], 
        "date": "2010-07-25T08:17:19+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons good olive oil", 
            "1 small French bread or boule, cut into 1-inch cubes (6 cups)", 
            "1 teaspoon kosher salt", 
            "2 large ripe tomatoes, cut into 1-inch cubes", 
            "1 hothouse cucumber, unpeeled, seeded, and sliced 1/2 inch thick", 
            "2 bell peppers, seeded and cut into 1-inch cubes (I like to use a combination of purple or yellow or orange, to nicely colorize the dish)", 
            "1/2 red onion, cut in half and thinly sliced", 
            "20 large basil leaves, coarsely chopped", 
            "3 tablespoons capers, drained", 
            "For the vinaigrette", 
            "1 teaspoon finely minced garlic", 
            "1/2 teaspoon Dijon mustard", 
            "3 tablespoons champagne vinegar", 
            "1/3 cup good olive oil", 
            "1/2 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/summers-last-hurrah-panzanella-e1472056230782.jpg?w=753", 
        "tags": [
            "Cucumber", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/09/summers-last-hurrah-panzanella/", 
        "title": "summer’s last hurrah panzanella", 
        "directions": [
            "Heat the oil in a large saute pan. Add the bread and salt; cook over low to medium heat, tossing frequently, for 10 minutes, or until nicely browned. Add more oil as needed.", 
            "For the vinaigrette, whisk together the ingredients.", 
            "In a large bowl, mix the tomatoes, cucumber, red pepper, yellow pepper, red onion, basil, and capers. Add the bread cubes and toss with the vinaigrette. Season liberally with salt and pepper.", 
            "Serve immediately, or allow the salad to sit for about half an hour for the flavors to blend."
        ], 
        "date": "2008-09-21T12:05:24+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds boneless chicken thighs", 
            "1 large white onion, peeled and quartered", 
            "5 cloves garlic, peeled and lightly crushed", 
            "2 bay leaves", 
            "1 tablespoon ground cumin", 
            "1 ancho or other mild dried chili, optional", 
            "Salt and pepper to taste.", 
            "2 large fresh ripe tomatoes, chopped", 
            "1/2 large white onion, peeled and minced", 
            "1/4 teaspoon minced raw garlic, or to taste", 
            "1 habanero or jalapeño pepper, stemmed, seeded and minced, or to taste", 
            "1/4 cup chopped cilantro leaves", 
            "1 tablespoon fresh lime juice or 1 teaspoon red-wine vinegar", 
            "Salt and freshly ground pepper."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-taco-joint-on-my-shirt1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Photo", 
            "Tex-Mex", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2006/08/the-taco-joint-on-my-shirt/", 
        "title": "chicken tacos + salsa fresca", 
        "directions": [], 
        "date": "2006-08-01T09:11:50+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound plum or roma tomatoes, stemmed and cut in half", 
            "1 or 2 jalapeños (depending on how hot you want the salsa), stemmed and cut in half", 
            "2 cloves garlic, peeled", 
            "Salt and pepper, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/three-ingredient-summertime-salsa1.jpg?w=640", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Quick", 
            "Summer", 
            "Tex-Mex", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/07/three-ingredient-summertime-salsa/", 
        "title": "three-ingredient summertime salsa", 
        "directions": [
            "Turn on your broiler and place a rack five inches away from the heating element. Line a skillet or baking sheet with foil and place the tomatoes, jalapeño halves and garlic on the skillet; season with salt. Cook under the broiler for five minutes (this, and all broiling steps, took much longer in my weak oven), or until the jalapeño and garlic have brown spots. Remove the jalapeño and garlic from the skillet and place in a blender.", 
            "Meanwhile, return the skillet to the oven and continue to broil the tomatoes for five more minutes, or until they have browned on top. Remove the tomatoes from the oven and add them to the blender, also pouring into the blender any juices that may be in the skillet. Begin to pulse on a low speed until the salsa reaches your desired texture; I usually add about 2 tablespoons water to loosen mine — you may need up to 1/4 cup, or more, for a thinner salsa. Adjust salt and pepper to taste. Eat with everything."
        ], 
        "date": "2014-07-29T11:21:58+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups all-purpose flour", 
            "1 tablespoon baking powder", 
            "1 3/4 teaspoons salt, divided", 
            "3/4 stick (6 tablespoons or 3 ounces) cold unsalted butter, cut into 1/2-inch cubes, plus 2 teaspoons melted", 
            "3/4 cup whole milk", 
            "1/3 cup mayonnaise", 
            "2 tablespoons fresh lemon juice", 
            "1 3/4 pounds beefsteak tomatoes", 
            "1 1/2 cups corn (from about 3 ears), coarsely chopped by hand (my preference) or lightly puréed in a food processor, divided", 
            "2 tablespoons finely chopped basil, divided (skipped this, no harm was done)", 
            "1 tablespoon finely chopped chives, divided", 
            "1/4 teaspoon black pepper, divided", 
            "7ounces coarsely grated sharp Cheddar (1 3/4 cups), divided"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/08/tomato-and-corn-pie.jpg?w=752", 
        "tags": [
            "Corn", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Quiche", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/08/tomato-and-corn-pie/", 
        "title": "tomato and corn pie", 
        "directions": [
            "Whisk together flour, baking powder, and 3/4 tsp salt in a bowl, then blend in cold butter (3/4 stick) with your fingertips or a pastry blender until it resembles coarse meal. Add milk, stirring until mixture just forms a dough, then gather into a ball.", 
            "Divide dough in half and roll out one piece on a well-floured counter (my choice) or between two sheets of plastic wrap (the recipe’s suggestion, but I imagined it would annoyingly stick to the plastic) into a 12-inch round (1/8 inch thick). Either fold the round gently in quarters, lift it into a 9-inch pie plate and gently unfold and center it or, if you’re using the plastic warp method, remove top sheet of plastic wrap, then lift dough using bottom sheet of plastic wrap and invert into pie plate. Pat the dough in with your fingers trim any overhang.", 
            "Preheat oven to 400°F with rack in middle. If your kitchen is excessively warm, as ours is, go ahead and put the second half of the dough in the fridge until you’re ready to use it. Whisk together mayonnaise and lemon juice.", 
            "Cut an X in bottom of each tomato and blanch in a large pot of boiling water 10 seconds. Immediately transfer with a slotted spoon to an ice bath to cool. Peel tomatoes, then slice crosswise 1/4 inch thick and, if desired (see Notes above recipe), gently remove seeds and extra juices. Arrange half of tomatoes in crust, overlapping, and sprinkle with half of corn, one tablespoon basil, 1/2 tablespoon chives, 1/2 teaspoon salt, 1/8 teaspoon pepper and one cup of grated cheese. Repeat layering with remaining tomatoes, corn, basil, chives, salt, and pepper. Pour lemon mayonnaise over filling and sprinkle with remaining cheese.", 
            "Roll out remaining piece of dough into a 12-inch round in same manner, then fit over filling, folding overhang under edge of bottom crust and pinching edge to seal. Cut 4 steam vents in top crust and brush crust with melted butter (2 teaspoons). Bake pie until crust is golden and filling is bubbling, 30 to 35 minutes, then cool on a rack. Serve warm or at room temperature.", 
            "Do ahead: Pie can be baked 1 day ahead and chilled. Reheat in a 350°F oven until warm, about 30 minutes.", 
            "An idea: Want to slab pie this and serve it to a crowd? I agree, it would be brilliant. This is how I’d approach it: Make 1 1/2 batches of the crust (slab pies require more crust for the same amount of filling) and arrange the filling in one layer instead of two in a parchment-lined 15x10x1-inch pan. Increase the amount of butter you brush the top with to a tablespoon or two and the baking time to about 45 minutes (this is an estimate, you should take it out when it is golden and the filling is bubbling). Be sure to remove the tomato seeds; that extra wetness could make for a slab pie mess."
        ], 
        "date": "2009-08-27T11:35:58+00:00"
    }, 
    {
        "ingredient_list": [
            "4 1/2-inch thick slices your favorite sturdy bread*", 
            "4 tablespoons mayonnaise", 
            "Two to four 1/4-inch slices provolone cheese (use larger amount for smaller slices)", 
            "Olive oil2 medium-sized perfectly ripe tomatoes, sliced", 
            "Flaky salt and freshly cracked black pepper, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/07/tomato-and-fried-provolone-sandwich1.jpg?w=640", 
        "tags": [
            "Photo", 
            "Quick", 
            "Sandwich", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/07/tomato-and-fried-provolone-sandwich/", 
        "title": "tomato and fried provolone sandwich", 
        "directions": [
            "Spread each slice of bread with mayonnaise and set aside.", 
            "Heat a skillet, preferably nonstick, over medium-low heat. Add a thin layer of olive oil and let it heat until shimmering. Add first slice of provone to skillet and fry it until crusty and golden underneath. Using a very thin spatula (this “flexible fish spatula” style is my favorite, for everything) carefully flip slice. It’s probably not going to flip neatly and you’ll probably curse me and also Hess but a messy slice will taste no less delicious than a photogenic one, promise. Just do your best. Fry the slice on the other side until golden underneath, then lift this browned cheese mess out of the pan and onto your first prepared bread slice. Repeat with remaining slices of cheese, frying more than one at a time if you’re now more comfortable with the process. ", 
            "Arrange slices of tomatoes over fried provolone on bread, sprinkle with salt and pepper and eat with one hand while calming an irate newborn with the other (if you’re me) or with two hands, from a plate, sitting down with a napkin on your lap, you civilized thing (if you’re not me, clearly). ", 
            "* Forgive me if I sound like a broken record, but my favorite is the whole wheat sourdough (a.k.a. miche or pain de campagne; think: Poilâne, but not requiring a ticket to Paris) you see here and elsewhere on the site. If you live near a Le Pain Quotidien, they sell theirs in quarters from gigantic loaves. Balthazar also makes their own, which is wonderful, and also sells it in quarters, inexpensively. "
        ], 
        "date": "2015-07-29T11:11:33+00:00"
    }, 
    {
        "ingredient_list": [
            "Crushed croutons", 
            "4 slices hearty white bread", 
            "1 small shallot, minced (about 2 tablespoons)", 
            "1 garlic clove, minced or pressed through garlic press", 
            "1/4 teaspoon table salt", 
            "Freshly ground black pepper", 
            "2 tablespoons olive oil", 
            "2 tablespoons grated Parmesan cheese", 
            "Tomato salad", 
            "1 pound cherry or grape tomatoes, mixed colors if you can find them", 
            "2 teaspoons olive oil", 
            "1 tablespoon mellow red wine vinegar (yours isn’t mellow? use less)", 
            "1/8 teaspoon table salt", 
            "Pinch of sugar", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/08/6046162939_322f528323_b.jpg?w=750", 
        "tags": [
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2011/08/tomato-salad-with-crushed-croutons/", 
        "title": "tomato salad with crushed croutons", 
        "directions": [
            "Handful basil leaves, slivered. ", 
            "Prepare the crushed croutons: Preheat oven to 350 degrees. Tear bread into chunks and pule them in a food processor until coarsely ground (largest chunks can be lima bean sized). No food processor? Keep tearing the bread up until it is in ragged, mixed sized crumbs. Spread crumbs on a rimmed baking sheet and toss with shallots, garlic, salt, pepper, olive oil and parmesan until croutons are evenly coated with oil. Bake until golden brown and dry, about 15 to 20 minutes, stirring occasionally. Remove from oven and set aside to cool slightly. (Warm is fine, hot might wilt your tomatoes, boo.)", 
            "Assemble salad: Halve each tomato lengthwise and arrange cut side up on a platter. Whisk together vinegar, olive oil, salt, sugar and a few grinds of pepper in a small dish. Drizzle over tomatoes. Sprinkle tomatoes with crushed croutons. Garnish with slivers of basil."
        ], 
        "date": "2011-08-15T14:43:34+00:00"
    }, 
    {
        "ingredient_list": [
            "28 ounces (800 grams) whole peeled tomatoes from a can (San Marzano, if you can find them)*", 
            "5 tablespoons (70 grams) unsalted butter", 
            "1 medium-sized yellow onion, peeled and halved", 
            "Salt to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/tomato-sauce-with-butter-and-onion.jpg?w=753", 
        "tags": [
            "Budget", 
            "Date Night", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/01/tomato-sauce-with-butter-and-onions/", 
        "title": "tomato sauce with onion and butter", 
        "directions": [
            "Put the tomatoes, onion and butter in a heavy saucepan (it fit just right in a 3-quart) over medium heat. Bring the sauce to a simmer then lower the heat to keep the sauce at a slow, steady simmer for about 45 minutes, or until droplets of fat float free of the tomatoes. Stir occasionally, crushing the tomatoes against the side of the pot with a wooden spoon. Remove from heat, discard the onion, add salt to taste (you might find, as I did, that your tomatoes came salted and that you didn’t need to add more) and keep warm while you prepare your pasta.", 
            "Serve with spaghetti, with or without grated parmesan cheese to pass.", 
            "* I liked this enough to make us more the next day, but I only had a can of tomato puree. It also worked well, despite having slightly less texture. You will need a little less simmering time as the tomatoes are already broken down."
        ], 
        "date": "2010-01-17T13:36:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup uncooked white rice, long-grain is suggested but use whatever you prefer", 
            "5 tablespoons olive oil", 
            "1 1/2 pounds zucchini (about 3 medium), sliced 1/4-inch thick", 
            "1/2 pound plum tomatoes, sliced 1/4-inch thick", 
            "Table salt and freshly ground black pepper", 
            "1 medium onion, halved lengthwise and thinly sliced", 
            "3 garlic cloves, minced", 
            "2 large eggs, lightly beaten", 
            "1 teaspoon chopped fresh thyme leaves", 
            "1/2 cup grated Parmesan, divided"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/zucchini-tomato-and-rice-gratin.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Gluten-Free", 
            "Grain/Rice", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2012/07/zucchini-tomato-and-rice-gratin/", 
        "title": "zucchini, tomato and rice gratin", 
        "directions": [
            "Preheat oven to 450°F. Cook the rice according to your favorite method. The package directions work in some cases, but check my notes above about adjustments I find I have to make. If you cook the rice in a large, wide-ish covered skillet, it might cook even faster but you’ll have the chance to use it again (and save on dirty dishes) when you need to cook the onions in a bit.", 
            "While rice cooks, coat two large (or, if you have the same pitifully small oven as I do, three smaller) baking sheets each with a tablespoon of a of olive oil (a bit less for smaller pans). Spread zucchini and tomato slices on the baking sheets in as close to a single layer as you can. Sprinkle with 1/2 teaspoon salt and a few grinds of black pepper. Roast tomatoes for 10 minutes and zucchini for 20. Flip zucchini halfway through; it’s not worth the messy effort for the tomatoes. Leave oven on.", 
            "Heat large, heavy skillet (such as the one you used to cook your rice) over medium heat. Once hot, add 2 tablespoons olive oil, heat oil, then add onions, garlic and 1/4 teaspoon salt to pan. Cover and reduce heat to low, cooking onion until limp and tender, about 15 to 20 minutes. Stir occasionally.", 
            "Combine onion mixture, rice, eggs, thyme, half of your grated cheese and a half-tablespoon of olive oil in a bowl. Add a good amount of freshly ground black pepper. Use the remaining half-tablespoon of olive oil to coat a shallow 2-quart baking dish. Spread half of rice mixture in bottom of dish. Arrange half of roasted zucchini on top. Spread remaining rice mixture over it and please don’t worry about being neat about this; dinner will be “rustic” tonight! Arrange remaining zucchini on top, then tomato slices. Sprinkle with remaining grated cheese and bake until set and golden brown, about 20 minutes. Each oven varies, but I find mine does the very best browning when the dish is on a rack near the top of the oven."
        ], 
        "date": "2012-07-31T17:55:18+00:00"
    }
]