{
  "date": "2016-11-16T13:09:00+00:00",
  "directions": [
    "\nMake the pie dough:",
    "\nBy hand, with my one-bowl method: In the bottom of a large bowl, combine the flour, salt and sugar. Work the butter into the flour with your fingertips or a pastry blender until mixture resembles a coarse meal and the largest bits of butter are the size of tiny peas. (Some people like to do this by freezing the stick of butter and coarsely grating it into the flour, but I haven’t found the results as flaky.) Add 1/2 cup cold water and stir with a spoon or flexible silicone spatula until large clumps form. Use your hands to knead the dough together, right in the bottom of the bowl. If necessary to bring the dough together, you can add the last tablespoon of water.",
    "With a food processor: In the work bowl of a food processor, combine flour, salt and sugar. Add butter and pulse machine until mixture resembles a coarse meal and the largest bits of butter are the size of tiny peas. Turn mixture out into mixing bowl. Add 1/2 cup cold water and stir with a spoon or flexible silicone spatula until large clumps form. Use your hands to knead the dough together, right in the bottom of the bowl. If necessary to bring the dough together, you can add the last tablespoon of water.\nBoth methods: Wrap dough in a sheet of plastic wrap and refrigerate for at least one hour, or up to 48 hours, or you can quick-firm this in the freezer for 15 minutes. Longer than 2 days, it’s best to freeze it until needed.\n\nGet ready to bake the pie: Heat oven to 400°F (205°C). Line a 10×15-inch jellyroll pan with a fitted rectangle of parchment paper.",
    "Form the crust: On a lightly floured surface, roll out dough into a 13-by-18-inch rectangle (i.e. 3 inches bigger than your pan). Do your best to work quickly, keeping the dough as cold as possible (and tossing it in the freezer for a couple minutes if it softens too quickly) and using enough flour that it doesn’t stick to the counter.",
    "Fold dough gently in half without creasing and transfer to prepared pan. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. Return pan to fridge until ready to fill.",
    "Make pumpkin filling: Combine pumpkin, sugar, salt and spices in a medium saucepan over medium heat. Bring to a sputtering simmer and cook for 5 to 7 minutes, stirring frequently. Scoop cooked pumpkin filling into bowl, and whisk in cold cream until smooth. Whisk in eggs, one at a time. Pour filling into prepared pie crust.\nMarble cheesecake: Whisk cream cheese, sugar, egg yolk, cream and vanilla in a bowl until smooth. Dollop all over pumpkin batter and use a toothpick or chopstick to swirl decoratively in figure-8s, being very very careful not to drag the point of the toothpick/chopstick into the bottom crust, forming holes.\nBake pie: For 15 minutes, then reduce heat to 350°F (175°C) and bake for another 15 minutes, until only the center barely jiggles and a toothpick inserted into it comes out pumpkin-free. (Damp is fine, but the toothpick shouldn’t have loose pumpkin batter on it.)\nLet cool then chill in fridge until serving."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/cheesecake-marbled-pumpkin-slab-pie.jpg?w=750",
  "ingredient_list": [
    "2 1/2 cups (315 grams) flour",
    "1 tablespoon (15 grams) sugar",
    "1 teaspoon (5 grams) table salt",
    "2 sticks (8 ounces, 225 grams tablespoons or 1 cup) unsalted butter, very cold",
    "3 1/2 cups pumpkin puree, from 2 15-ounce (425 gram) cans or homemade",
    "1 1/4 cups granulated sugar",
    "1 teaspoon (6 grams) fine sea or table salt",
    "2 teaspoons ground cinnamon",
    "1 teaspoon ground ginger",
    "1/4 teaspoon ground cloves",
    "A few gratings of fresh nutmeg (or a pinch of ground nutmeg)",
    "2 1/2 cups cold heavy cream, light cream or a combination of cream and milk",
    "6 large eggs",
    "8 ounces cream cheese, softened",
    "1/3 cup sugar",
    "1 large egg yolk",
    "2 tablespoons heavy or light cream",
    "1/4 teaspoon vanilla extract"
  ],
  "tags": [
    "Fall",
    "Photo",
    "Pumpkin",
    "Tarts/Pies",
    "Thanksgiving"
  ],
  "title": "cheesecake-marbled pumpkin slab pie",
  "url": "https://smittenkitchen.com/2016/11/cheesecake-marbled-pumpkin-slab-pie/"
}