{
  "date": "2012-04-16T16:10:00+00:00",
  "directions": [
    "Make the crepe batter: Blend banana in a food processor until totally smooth. Add melted butter, blend again. Add remaining ingredients and blend until they are combined. Transfer batter, which will look pretty thin, to a bowl (even easier later if it has a spout), cover with plastic wrap and chill for at least an hour, preferably overnight, and up to two days. When you remove the batter, it will seem surprisingly thick. Stir it to redistribute the ingredients before using it.",
    "Cook the crepes: Heat a medium skillet or crepe pan over medium-high heat. Once heated, brush pan thinly with melted butter. Pour 1/4 cup batter into skillet, swirling it until it evenly coats the bottom and cook, undisturbed, until the bottom is golden and the top is set, about 2 to 3 minutes. Flip* the crepe and cook it for 30 seconds on the other side, before transferring it to a plate to cool. Repeat with remaining batter. You can stack your crepes and they should not stick together. Let crepes cool completely.",
    "* Here’s my Weirdo Two-Spatula Crepe Flipping Method: I have two spatulas handy, one flexible fish-style spatula (these are my favorite, for everything, because they’re so thin) and one smaller, like an offset icing spatula. I slide the larger one just a little bit under the crepe and lift it enough that I can slide the smaller one under. I lift it enough that I can get the larger one far underneath the crepe, then use the larger one alone to flip it. It makes it very easy, I promise.",
    "Make filling: Whip cream cheese until fluffy, then beat in yogurt, 1/2 cup at a time. When fully combined, add sugar and vanilla then beat until rich and fluffy, just another minute.",
    "Assemble crepe cake: Lay first crepe on a cake plate or serving platter. Spread with 1/4 cup of the yogurt-cream cheese filling. Repeat with all but the last remaining crepe, which should be stacked but have no filling on top, as it is the lid.",
    "Make walnut butterscotch sauce: Combine the cream, brown sugar and butter in the bottom of a medium, heavy saucepan over medium-high heat. Bring the mixture to a boil, then reduce the heat and let it simmer for 10 minutes, stirring occasionally in the beginning and more frequently as it reduces and thickens. You’ll know it’s done when it becomes thick and smells toasty. Stir in the vanilla and salt, then walnuts. Immediately pour over stack of filled crepes, nudging the butterscotch to the edges with your spoon — if it goes over the edge, so be it.",
    "Serve immediately, or keep in fridge until ready to serve. Crepe cake keeps for up to 3 days, possibly longer, but good luck with that."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/banana-bread-crepe-cake-with-butterscotch1.jpg?w=500",
  "ingredient_list": [
    "Banana crepes",
    "4 tablespoons butter, melted and cooled slightly, plus extra for greasing pan",
    "1 large (will weigh 6 ounces/170 grams be about 6 inches long when unpeeled) speckly ripe banana (should yield a scant 1/2 cup peeled, pureed)",
    "1 cup (235 ml) milk",
    "3/4 cup (95 grams) all-purpose flour",
    "4 large eggs",
    "2 tablespoons (25 grams) light brown sugar",
    "1/2 teaspoon vanilla extract",
    "1/4 teaspoon table salt",
    "1/2 teaspoon ground cinnamon",
    "1/4 teaspoon freshly grated nutmeg",
    "Pinch of ground cloves",
    "Cream cheese yogurt filling",
    "8 ounces (225 grams) cream cheese, well-softened",
    "1 1/2 cups (345 grams) plain Greek-style yogurt",
    "1/3 cup (65 grams) granulated sugar",
    "1/2 teaspoon vanilla extract",
    "Walnut butterscotch topping",
    "1/2 cup (120 ml) heavy whipping cream",
    "1/4 cup (50 grams) packed dark brown sugar",
    "1 tablespoon (15 grams) unsalted butter, at room temperature",
    "1/2 cup (about 50 grams) chopped walnuts, toasted",
    "1/2 teaspoon vanilla extract",
    "1/4 teaspoon flaky sea salt, or to taste"
  ],
  "tags": [
    "Bananas",
    "Breakfast",
    "Brunch",
    "Cake",
    "Pancakes",
    "Photo"
  ],
  "title": "banana bread crepe cake with butterscotch",
  "url": "https://smittenkitchen.com/2012/04/banana-bread-crepe-cake-with-butterscotch/"
}