{
  "date": "2013-07-26T11:38:56+00:00",
  "directions": [
    "Grind pistachios to a powder. Set aside.",
    "Peel bananas and break them into chunks. Puree them with any flavorings you might want to add. You should have about 2 cups puree.",
    "Scoop Nutella into a small plastic bag and snip off the corner. (Trust me, fake-piping it into the narry molds is easier than trying to spoon it in.) Pour a little banana into each mold, then squiggle in a little Nutella. Repeat a couple times, trying to make sure that every bite or two will have Nutella in it, using about 1 tablespoon of Nutella in each popsicle. Fill molds to about 1/4-inch before the top, to leave room for expansion when freeze.",
    "If using molds that contain sticks or hold wooden ones in place, snap on lids and freeze until solid, about 5 hours. If using glasses or open cup molds, freeze until beginning to set (about 1 1/2 to 2 hours), then insert the sticks until freeze until fully solid. If using instant popsicle makers, I’m jealous, just follow the manufacturer’s instructions.",
    "Once frozen, spread pistachios out on a cold plate. Unmold popsicles and roll them all or partially in the nuts. Go outside to eat them so you don’t sticky up the kitchen floor.",
    "Popsicle molds: I use these guys. I have the metal version, which was all that was available when I bought them a couple years ago, but the metal parts are not dishwasher safe and don’t hold the popsicle sticks in place as well as I understand the plastic ones do, so if I were buying them again, I’d opt for plastic."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/banana-nutella-and-salted-pistachio-popsicles1.jpg?w=750",
  "ingredient_list": [
    "1/3 cup shelled roasted salted pistachios",
    "4  large bananas, ripe but not mushy",
    "A scant 1/2 cup Nutella or another chocolate-hazelnut (gianduja) spread",
    "Flavorings (see Note up top), if desired"
  ],
  "tags": [
    "Bananas",
    "Photo",
    "Popsicles",
    "Quick",
    "Summer"
  ],
  "title": "banana, nutella and salted pistachio popsicles",
  "url": "https://smittenkitchen.com/2013/07/banana-nutella-and-salted-pistachio-popsicles/"
}