{
  "date": "2013-04-01T12:27:09+00:00",
  "directions": [
    "Make the lentils: Put the lentils, garlic, sage, and olive oil in a small pot, along with 2 cups cold water, and set it over medium heat. Let the water come to a simmer (not boiling), then turn the heat to low and cook the lentils in a very gentle simmer just until they are tender  — April recommends 25 minutes, but mine took 35 and needed a touch more water at the end. Take the pan off the heat and let the lentils cool a bit before draining them. Pick out and discard the sage and garlic. You’ll have about 2 cups cooked lentils.",
    "Make the dressing: Mix together the ground coriander and cumin in a small bowl. Mash the garlic clove to a paste with 1 teaspoon salt (use half as much Kosher salt, even less table salt) on a cutting board or in a mortar. In a small bowl for your dressing, combined the mashed garlic, tahini, 3 tablespoons of the lemon juice, 2 tablespoons of the olive oil, 1 teaspoon of the ground coriander-and-cumin mixture and 2 tablespoons water. Stir well, then taste. Add more lemon if desired.",
    "Assemble the salad: Place onion slices in a medium bowl and break them up with your fingers. Sprinkle in two good pinches of salt, then two teaspoons of lemon juice, two remaining teaspoons of olive oil and the cilantro or parsley. Toss well, then crumble in the cheese and gently toss again.",
    "Toss the lentils with the drained chickpeas, preserved lemon rind (if using), and 1 teaspoon flaky sea salt (use half as much Kosher salt, even less table salt) in a large mixing bowl. Pour in the tahini dressing and toss it all together really well, then stir in the onion-feta mixture.",
    "Arrange the salad in bowl or platter. Sprinkle the mixture with the sesame seeds and some of the remaining spices. Serve, and don’t forget to share.",
    "P.S. We had this with a Simple Potato Gratin (a post I’m itching to update even more simply, and less hideously, but the important stuff is there) and lamb chops (may I recommend these?). ",
    "** To toast and grind spices: Put the spices, one at a time, in a small dry pan over medium-high heat. Toast, shaking the pan frequently, until the spices become very sweet and fragrant, anywhere from 2 to 4 minutes. Let them cool in a bowl or on a small plate and grind in a mortar and pestle or in a coffee grinder."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/lentil-and-chickpea-salad.jpg?w=750",
  "ingredient_list": [
    "Lentils",
    "Scant 1 cup dried green lentils (Puy or Casteluccio, if you can find them) lentils, picked and rinsed over",
    "2 large garlic cloves, halved lengthwise",
    "2 fresh sage sprigs",
    "2 tablespoons olive oil",
    "For the dressing and salad",
    "2 teaspoons coriander seeds, toasted and ground**",
    "1 teaspoon cumin seeds, toasted and ground**",
    "1/2 large garlic clove",
    "Salt (Maldon or another flaky sea salt if you’ve got it)",
    "2 tablespoons well-stirred tahini paste",
    "1/4 cup freshly squeezed lemon juice, plus more to taste",
    "2 tablespoons plus 2 teaspoons olive oil",
    "1 and 3/4 cups drained chickpeas (from a 15-ounce can), low sodium if you can find them",
    "1/2 small preserved lemon, pith and flesh discarded, rind finely diced (optional)",
    "1 very small red onion, thinly sliced into half-moons",
    "A handful of small, delicate cilantro or flat-leaf parsley sprigs",
    "A scant 1/4 cup feta (goat’s milk if you can find it, otherwise use what you can get)",
    "1 and 1/2 tablespoons raw sesame seeds, toasted in a dry pan until a shade or two darker"
  ],
  "tags": [
    "Beans",
    "Lunch",
    "Photo",
    "Picnics",
    "Salad",
    "Vegetarian"
  ],
  "title": "lentil and chickpea salad with feta and tahini",
  "url": "https://smittenkitchen.com/2013/04/lentil-and-chickpea-salad-with-feta-and-tahini/"
}