[
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "3/4 cup (75 grams or 2 1/2 to 2 3/4 ounces) sliced almonds, ideally toasted and cooled", 
            "1 tablespoon (10 grams) all purpose flour", 
            "A few pinches of sea salt", 
            "6 tablespoons (75 grams) plus 1 teaspoon (5 grams) granulated sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/2 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1/2 pound rhubarb", 
            "To finish", 
            "Powdered sugar or 1/4 cup jam of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/almond-rhubarb-picnic-bars-e14640188536441.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2016/05/almond-rhubarb-picnic-bars/", 
        "title": "almond rhubarb picnic bars", 
        "directions": [
            "Heat oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] ", 
            "Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind almonds, 6 tablespoons sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. ", 
            "Arrange the fruit: Trim rhubarb and cut it half horizontally top to bottom, i.e. like splitting a hamburger bun, with the flatter part on the bottom. [Update: Does this diagram help?] Keep tops and bottoms matched/stacked and cut stalks on the diagonal into about 1 1/4-inch lengths. The top and bottom of each segment should nicely “V” together, color side up, in a chevron pattern. If you mostly reach for the more green segments first and the pink-er segments second, you’ll end up with an ombré look on top. Sprinkle fruit with 1 teaspoon granulated sugar.", 
            "Bake the bars: For 45 to 55 minutes, until they’re golden on top and a toothpick inserted into the almond cream underneath comes out cream-free. The rhubarb pieces are going to move around a little as it bakes so don’t be surprised if the pattern looks a little different when it’s done. ", 
            "Let cool in pan on a rack, or in the fridge, or even in the freezer. You can decorate the bars with a little powdered sugar, or warm some jam and brush it over for a glossier finish. I find it easiest to get very clean cuts when the bars are very cold. A serrated knife, used gently, can ensure the rhubarb stays perfectly put if it’s not cold enough. While bars do not need to be refrigerated if it will just be a day or so, they keep longer and (I think) more nicely chilled."
        ], 
        "date": "2016-05-23T11:56:10+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "2 1/2 cups (313 grams) all-purpose flour, plus more for dusting surfaces, dipping fork", 
            "2 tablespoons (25 grams) granulated sugar (doubled from my standard pie dough to make this more cookie-like)", 
            "1 teaspoon (4 grams) table salt", 
            "2 sticks (225 grams, 8 ounces, 16 tablespoons or 1 cup) unsalted butter, very cold", 
            "1/2 cup (118 ml) water, very cold (I pour 1 cup and add ice while I work, then measure 1/2 cup from it when I need it)", 
            "Filling", 
            "3 medium apples, whatever you like to bake with", 
            "Squeeze of lemon juice (optional)", 
            "1/3 cup (67 grams) granulated sugar", 
            "1 teaspoon (2 grams) ground cinnamon", 
            "Few gratings fresh nutmeg", 
            "A pinch of any other spices you like in your apple pie", 
            "To finish", 
            "1 large egg", 
            "Coarse or granulated sugar for garnish", 
            "Additional stuff", 
            "A couple baking sheets covered with parchment paper", 
            "Rolling pin, pastry brush (for egg wash), fork (for crimping and dipping) and sharp knife (to make slits)", 
            "Two round cookie cutters of different sizes. I used 2 1/2-inch and 1 1/2 to 1 3/4-inch rounds. You’ll want to make sure there’s at least a 3/4-inch different in the sizes, as you’ll need the extra margin to crimp your dough. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/10/apple-pie-cookies2.jpg?w=751", 
        "tags": [
            "Apple", 
            "Cookie", 
            "Fall", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2011/10/apple-pie-cookies/", 
        "title": "apple pie cookies", 
        "directions": [
            "Make your pie dough: Whisk together flour, sugar and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of small peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I did.) Gently stir in the ice water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough in half. Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days. [Even more detailed pie dough instructions in this post, check it out!]", 
            "Meanwhile, get everything else together: Line up six small dishes. In the first one, pour some water. Leave the second one empty; you’ll use it for your apples in a bit. In the third one, mix the sugar, cinnamon, nutmeg and any other spices you like in your pie, such as a pinch of cloves. In the fourth one, place a little bit of flour to dust your surface and dip your fork for crimping. In the fifth one, whisk an egg with one teaspoon of water until smooth. In the last one, or in whatever container you keep it in, add some coarse or regular sugar for decorating the tops of the pies. You are very likely thinking I’ve lost my mind by now and you may not be terribly far off.  ", 
            "On a well-floured counter, roll out your pie dough pretty thin, a little shy of 1/8-inch thick. Lift and rotate your dough as you roll it, to ensure that it rolls out evenly and so you can be sure it’s not sticking in any place. [More rolling tips here!] Use the larger of your two cookie cutters [mine was 2 1/2-inch) to cut as many rounds as you can from the dough. Transfer them to parchment-lined baking sheets and keep them in the fridge until you need them. Once you’ve finished the first packet, repeat the process with the second packet of dough", 
            "Prepare your apples: Peel your apples. Cut thin (1/8-inch thick) slices from one side of whole apple, stopping when you hit the core. Repeat on opposite side. I got about 10 usable slices from each side of my small-medium-ish apples. Use the smaller of your two cookie cutters (mine was about 1 2/3 inches) to cut the apples into cute little discs that will fit inside your pie cookies. Place them in your second bowl, covering them with a few drops of lemon juice if you find that they’re browning quickly.", 
            "Preheat oven to 350 degrees.", 
            "And now, assemble away! Grab your first disc of chilled dough and lightly dampen it on one side with the water. This is to help it seal. Take your first disc of apple and toss it in the cinnamon spice sugar. Place it on the damp side of the bottom disk. Place a second disc of dough on top; I found it easiest to seal it by picking the whole thing up (this is when you’ll be glad that your dough is cold and semi-firm; if it’s soft and getting sticky, chill it until it’s easy to pick up) and press the tops and bottoms around the apple with your fingers. Back on the floured counter, cut decorative slits in your “pies”. Dip your fork in the flour and use it to create a decorative crimp on the sealed edges. Brush your cookie with egg wash and sprinkle with coarse sugar. Replace on baking sheet and chill while you prepare the others. About now, you’ll curse your friendly food blogger for getting you into such an exacting cookie making process but I promise, the first couple are slow and the rest come together very quickly.", 
            "Bake your apple pie cookies for 25 minutes, or until puffed and bronzed and very pie-like. (If this is your first batch, peer in at them at 20 minutes, to make sure your oven doesn’t run hot.) Transfer to a cooling rack to cool before eating them… oh haha. I forgot who I was talking to.", 
            "Do ahead: These will keep for a few days at room temperature, though not in my apartment. You could also make a larger batch of these, doing everything but brushing them with egg and sprinkling them with sugar, and keep them frozen until needed. Bake them directly from the freezer, just adding a couple minutes to the baking time."
        ], 
        "date": "2011-10-13T09:37:45+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine ", 
            "Filling", 
            "3/4 cup (a scant 4 ounces or 110 grams) shelled unsalted pistachios", 
            "1 tablespoon (10 grams) all purpose flour", 
            "Few pinches of sea salt", 
            "6 tablespoons (75 grams) sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/4 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1 pound firm-ripe apricots", 
            "To finish", 
            "Powdered sugar or 1/4 cup apricot jam"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/apricot-pistachio-squares1.jpg?w=640", 
        "tags": [
            "Apricots", 
            "Bars", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/08/apricot-pistachio-squares/", 
        "title": "apricot pistachio squares", 
        "directions": [
            "Heat your oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (If you have an 8-inch square springform, you can skip this and just butter it well.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. Transfer the dough clumps to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "(Don’t have a food processor? You might have an easier time using softened butter and preparing this cookie-style: cream it with the sugar with a hand mixer, then spoon in the salt and flour, beating until just combined. It might help to chill this mixture a bit before pressing it into the pan, or it might feel too greasy to easily spread.)", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind your pistachios, sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. ", 
            "Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. Cut apricots in half (or, you might find that you can tear them open at the seams with your fingers) and remove pits. From here, you have a few decoration options: you can place the apricot halves in facedown or up all over the pistachio base. You can do as I did, which is cut them into strips, then slide each cut half onto a butter knife or offset spatula, tilt it so that it fans a little, and slide it onto your pistachio filling decoratively. (With this method, I ended up not using all of my apricots.) You could also arrange the strips like petals of flower around the pan, for maximum pretties.]]", 
            "Bake the bars for 60 minutes, or until they are golden and a toothpick inserted into the pistachio portion comes out batter-free. This might take up to 10 minutes longer depending on the juiciness of your apricots and the amount you were able to nestle in. Let cool completely in pan; you can hasten this along in the fridge. ", 
            "To finish, you can make a shiny glaze for your tart by warming the jam in a small saucepan until it thins, and brushing this mixture over the top of the cooled tart. Or, you can keep it rustic with just a dusting of powdered sugar, as I did. ", 
            "Cut bars into squares — chilled bars will give you the cleanest cuts. Keep leftover bars chilled. "
        ], 
        "date": "2014-08-07T12:18:31+00:00"
    }, 
    {
        "ingredient_list": [
            "Pastry", 
            "1 1/4 cups (160 grams) all-purpose flour", 
            "1/2 teaspoon table salt", 
            "1 1/2 teaspoons granulated sugar", 
            "Zest of half a lemon", 
            "8 tablespoons (4 ounces or 113 grams) cold unsalted butter, cut into pieces", 
            "1/4 cup ricotta, yogurt or sour cream", 
            "3 to 4 tablespoons cold water", 
            "Filling", 
            "2 cups berries or chopped fruit (I used raspberries and cherries on the red one, blueberries for on the blue)", 
            "3 to 4 tablespoons granulated sugar (use the lower amount if your fruit is especially sweet)", 
            "2 tablespoons cornstarch", 
            "Juice of half a lemon", 
            "Pinch of salt", 
            "Glaze", 
            "1 egg yolk beaten with 1 teaspoon water", 
            "1 heaped teaspoon turbinado or coarse sugar for sprinkling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/blue-and-red-berry-ricotta-galettes1.jpg?w=640", 
        "tags": [
            "Blueberries", 
            "Cherries", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/07/blue-and-red-berry-ricotta-galette/", 
        "title": "blue and red berry ricotta galette", 
        "directions": [
            "Make dough: Whisk the flour, salt, sugar and zest together in the bottom of a large bowl. Work the butter into the flour with your fingertips or a pastry blender until mixture resembles a coarse meal and the largest bits of butter are the size of tiny peas. Stir ricotta and 3 tablespoons water together in a small dish and pour into butter-flour mixture. Stir together with a flexible spatula as best as you can, then use your hands to knead the mixture into a rough, craggy ball. Wrap in plastic and flatten into a disc. Chill in the fridge for 1 hour or up to 48 hours, or you can quick-firm this in the freezer for 15 minutes.", 
            "Assemble galette: Heat oven to 400 degrees. On a floured counter, roll the dough out into a large round-ish shape, about 14 to 15 inches across. ", 
            "[If you’d like to form yours into a star, as shown, use the red dashed outline of this template [PDF]. It will print smaller on an 8.5×11-inch piece of paper than you need, but you can use it as a rough guide to cut as large of a pentagon shape as your dough will allow.] ", 
            "Transfer round or pentagon-shaped dough to a parchment-lined baking sheet; I like to fold my dough gently, without creasing, in quarters then unfold it onto the baking pan. [If you’re making a star, cut a 1-inch notch in the center of each side, angling it toward the center, as shown in the blue dashed lines of the template.] ", 
            "Stir together all of the filling ingredients and spread them in the center of the dough, leaving a 2-inch border. If you’re making a round galette, fold the border over the filling, pleating the edge to make it fit. [If you’re making a star shape, fold each of the 5 corners into the center, along the green dotted lines of the template. Pinch the outer corners closed, to seal in the filling and the shape.] ", 
            "Whisk egg yolk and water together and brush over exposed crust. Sprinkle with coarse sugar.", 
            "Bake galette: For 30 minutes, or golden all over. Remove from the oven and let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature, preferably with vanilla ice cream. [My favorite vanilla ice cream recipe is used here.]"
        ], 
        "date": "2014-07-02T10:25:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (200 grams) granulated sugar", 
            "1 teaspoon baking powder", 
            "3 cups (390 grams) all-purpose flour", 
            "1/4 teaspoon salt", 
            "Zest of one lemon", 
            "1 cup (8 ounces or 225 grams) cold unsalted butter, cut into chunks", 
            "1 large egg", 
            "Juice of 1 lemon", 
            "1/2 cup (100 grams) granulated sugar", 
            "4 teaspoons cornstarch", 
            "4 cups fresh blueberries"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2710636010_a64fe15ab8_o.jpg?w=750", 
        "tags": [
            "Bars", 
            "Blueberries", 
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/07/blueberry-crumb-bars/", 
        "title": "blueberry crumb bars", 
        "directions": [
            "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9×13 inch pan.\nIn a medium bowl, stir together 1 cup sugar, 3 cups flour, baking powder, salt, and lemon zest. Use a fork or pastry cutter to blend in the butter and egg. Dough will be crumbly. Pat half of dough into the prepared pan.\nIn another bowl, stir together the sugar, cornstarch and lemon juice. Gently mix in the blueberries. Sprinkle the blueberry mixture evenly over the crust. Crumble remaining dough over the berry layer.\nBake in preheated oven for 45 minutes, or until top is slightly brown. (This took an extra 10 to 15 minutes in my oven.) Cool completely before cutting into squares.\n"
        ], 
        "date": "2008-07-29T15:25:26+00:00"
    }, 
    {
        "ingredient_list": [
            "Topping:", 
            "5 tablespoons (40 grams) all-purpose flour", 
            "1/2 cup (100 grams) granulated sugar", 
            "1 teaspoon ground cinnamon", 
            "4 tablespoons (1/4 cup, 2 ounces or 55 grams) unsalted butter, cold is fine", 
            "Pinch of salt", 
            "Cake:", 
            "2 cups minus 1 tablespoon (i.e. 1 3/4 cups + 3 tablespoons or 240 grams) all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon table salt", 
            "4 tablespoons (1/4 cup, 2 ounces or 55 grams) unsalted butter, softened", 
            "3/4 cup (150 grams) granulated sugar", 
            "Zest of 1 lemon", 
            "1 large egg", 
            "1 teaspoon vanilla extract", 
            "1 pint (2 to 2 2/3 cups, 12 to 16 ounces, or 340 to 455 grams; see Note) fresh blueberries, clean and dry", 
            "1/2 cup milk, whole is ideal, any kind should work", 
            "1/2 cup (55 grams) walnuts, chopped medium fine (optional)", 
            "Confectioners’ sugar, for dusting (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/blueberry-crumb-cake1.jpg?w=640", 
        "tags": [
            "Blueberries", 
            "Everyday Cakes", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/07/blueberry-crumb-cake/", 
        "title": "blueberry crumb cake", 
        "directions": [
            "Heat oven to 375°F. Butter a 9-inch round baking pan (with at least 2″ sides) and dust it lightly with flour; line it with a round of parchment paper. ", 
            "Prepare the topping by mixing the flour, sugar, cinnamon and salt, then cutting the butter in with a pastry blender, fork or your fingertips until the mixture resembles coarse crumbs. Set aside.", 
            "In a medium bowl, whisk flour, baking powder, and salt until combined. In a large bowl, beat butter, sugar and zest together until light and fluffy. Add egg and vanilla and beat until combined. Beat in 1/3 of the dry ingredient mixture until just combined, followed by 1/2 the milk; repeat with remaining dry ingredients and milk, finishing with the dry mixture. The batter will be very stiff, but don’t fret. Fold blueberries into cake batter until evenly distributed.", 
            "Scoop cake batter into prepared pan and smooth so that it is flat. If using walnuts, scatter them on top. Sprinkle with prepared streusel. Bake in heated oven for 40 minutes, or until a toothpick inserted into the middle of the cake comes out batter-free. You can let the cake cool complete in the pan on a rack, or just cool it in the pan for 20 minutes before flipping it out onto a cooling rack, removing the parchment paper lining, and flipping it back onto a plate. Dust with confectioners’ sugar, if using. ", 
            "Do ahead: Cake keeps covered with plastic or foil at room temperature for three days. If longer, it might be best to keep it in the fridge. It gets more moist each day."
        ], 
        "date": "2014-07-31T12:20:32+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/08/2804182114_6d9ebd8506_b.jpg?w=753", 
        "tags": [
            "Bourbon", 
            "Fruit", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/08/bourbon-peach-hand-pies/", 
        "title": "bourbon peach hand pies", 
        "directions": [
            "1. To make the pastry, in a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour. If preparing ahead of time, the dough can be stored at this point for up to one month in the freezer.", 
            "2. Divide the refrigerated dough in half. On a lightly floured work surface, roll out one half of the dough to 1/8-inch thickness. Using a 4 1/2-inch-round biscuit cutter, cut seven circles out of the rolled dough. Transfer the circles to a parchment-lined baking sheet, and place in the refrigerator to chill for about 30 minutes. Repeat the rolling, cutting, and chilling process with the remaining half of dough. (I used a 4-inch cutter–if you can call a “cutter” the tin edge of the container that holds my smaller round cutters–and managed to get 12 from each dough half, after rerolling the scraps.)", 
            "3. Make the filling: Peel and chop the peaches into small bits (approx. 1/2-inch dice), much smaller than you’d use for a regular-sized pie. Mix them with the flour, sugar and pinch of salt, and add the bourbon and vanilla, if you wish.", 
            "4. Remove the chilled dough from the refrigerator, and let stand at room temperature until just pliable, 2 to 3 minutes. Spoon about 1 to 2 tablespoons filling (use the smaller amount for a 4-inch circle) onto one half of each circle of dough. Quickly brush a little cold water around the circumference of the dough, and fold it in half so the other side comes down over the filling, creating a semicircle. Seal the hand pie, and make a decorative edge by pressing the edges of the dough together with the back of a fork. Repeat process with remaining dough. Place the hand pies back on the parchment-lined baking sheet, and return to the refrigerator to chill for another 30 minutes.", 
            "5. Heat oven to 375 degrees. Remove the chilled hand pies from the refrigerator, cut a small slit in each and lightly brush with the egg yolk wash. Sprinkle sanding sugar generously over the pies, and place pies in the oven to bake. Bake until the hand pies are golden brown and just slightly cracked, about 20 minutes. Remove the pies from the oven, and let stand to cool slightly before serving."
        ], 
        "date": "2008-08-28T16:12:48+00:00"
    }, 
    {
        "ingredient_list": [
            "Fruit Base", 
            "1 pound apricots", 
            "3 tablespoons sugar", 
            "1 tablespoon flour", 
            "Grated fresh nutmeg, a pinch", 
            "Crisp Topping", 
            "1/2 stick (4 tablespoons, 2 ounces) butter, melted", 
            "6 tablespoons turbinado or regular sugar (turbinado, also sold as Sugar in the Raw, gives an excellent crunch)", 
            "1/2 cup oats", 
            "1/2 cup all-purpose flour (or a mixture of whole wheat and all-purpose flour)", 
            "Pinch of salt", 
            "2 tablespoons sliced almonds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/06/2554534909_1c47b6eccb_b.jpg?w=750", 
        "tags": [
            "Apricots", 
            "Breakfast", 
            "Brunch", 
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/06/breakfast-apricot-crisp/", 
        "title": "breakfast apricot crisp", 
        "directions": [
            "Prepare fruit: Preheat oven to 400 degrees. Pull apart apricots at their seam, remove pits, and tear them one more time into quarters, placing them in a small baking dish (one that holds two to three cups is ideal). Stir in sugar, flour and pinch of nutmeg. ", 
            "Make topping: Melt butter and stir in sugar, then oats, then flour, salt and almonds until large clumps form. Sprinkle mixture over the fruit.  Bake for about 30 to 40 minutes and serve warm.", 
            "Although you could dust this with powdered sugar and serve it warm with vanilla ice cream for dessert, as I noted, it is on the tart side for an after-dinner treat. Truly, this excels cooled in the fridge overnight, and mixed with a scoop of plain yogurt for a weekday breakfast that will cure you of all weekday breakfast doldrums. It sure did for me. "
        ], 
        "date": "2008-06-07T11:43:35+00:00"
    }, 
    {
        "ingredient_list": [
            "Salt", 
            "1 cup semi-pearled farro", 
            "1 pound broccolini or regular broccoli (previously: 2 pounds, see note)", 
            "4 tablespoons olive oil", 
            "2 cloves garlic, minced", 
            "Red pepper flakes, to taste", 
            "Finely grated zest, then juice, of 1 lemon (juice before zesting only if you enjoy being grumpy)", 
            "Freshly ground black pepper", 
            "4 ounces pecorino romano, grated or ground in a food processor"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/broccoli-rubble-farro-salad.jpg?w=750", 
        "tags": [
            "Broccoli", 
            "Grain/Rice", 
            "Lunch", 
            "Picnics", 
            "Put An Egg On It", 
            "Recipes", 
            "Salad", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2017/05/broccoli-rubble-farro-salad/", 
        "title": "broccoli rubble farro salad", 
        "directions": [
            "Bring a medium/large pot of salted water to boil. Once boiling, add broccoli and boil for 2 to 2 1/2 minutes, until slightly softened but still crisp overall. Scoop out with slotted spoon or tongs, then drain.", 
            "Add farro back to same pot (I’m totally okay with some errant leftover broccoli flecks and vitamins here, if you’re not, use another pot of salted water) and cook, simmering, for 25 to 30 minutes, until tender. (Since there are so many varieties of farro, however, if your package suggests otherwise, it’s best to defer to its cooking suggestion.) Drain and tip into a large mixing bowl; cool to lukewarm.\nPat drained broccoli dry on towels, trying to remove as much excess moisture as possible. Chop into small (roughly 1/2-inch) bits. In a large sauté pan, heat olive oil over medium-high heat until hot. Add garlic and pepper flakes, to taste, and cook for 1 minute, until garlic is faintly golden. Add chopped broccoli, lemon zest, and salt (I use a full teaspoon kosher salt here, but adjust the amount to your taste) and cook, stirring, for 3 to 4 more minutes, until broccoli is well-seasoned and slightly more tender.\nAdd broccoli and every bit of garlic and oil from the pan to the bowl of farro and stir to combine. Add lemon juice, black pepper and more salt to taste (but 1/2 teaspoon of each is what we used) and stir to combine. Stir in cheese.", 
            "Serve warm or at room temperature as-in, with an egg on top, burrata, and/or seasoned breadcrumbs."
        ], 
        "date": "2017-05-24T12:05:32+00:00"
    }, 
    {
        "ingredient_list": [
            "2 heads of broccoli", 
            "1/2 cup thinly sliced almonds, toasted", 
            "1/3 cup dried cranberries", 
            "1/2 small red onion, finely chopped", 
            "Buttermilk Dressing (Adapted from this salad.)", 
            "1/2 cup buttermilk, well-shaken", 
            "1/3 cup mayonnaise (this is more than is in the original, to thicken the dressing further)", 
            "2 tablespoons cider vinegar", 
            "1 tablespoon sugar", 
            "3 tablespoons finely chopped shallot (or, you could just use a little extra red onion to simplify it)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/broccoli-slaw.jpg?w=753", 
        "tags": [
            "Broccoli", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2009/05/broccoli-slaw/", 
        "title": "broccoli slaw", 
        "directions": [
            "Trim broccoli and cut it into large chunks. From here, you can either feed it through your food processor’s slicing blade, use a mandoline to cut it into thin slices, or simply had chop it into smaller pieces. I used the stem and the flowerets, but if you have a broccoli stem aversion you can just use the tops. (P.S. My favorite way to prep the stems is to peel them — the tough skin is why most people think they don’t like broccoli stems; the broccoli underneath is juicy and crisp — then use the mandoline or a knife to cut them into thin slices.)", 
            "Toss the sliced broccoli with the almonds, cranberries and red onion in a large bowl. Meanwhile, whisk the dressing ingredients in a smaller one, with a good pinch of salt and black pepper. Pour the dressing over the broccoli (if you’ve skipped the stems, you might not want it all; I otherwise found this to be the perfect amount) and toss it well. Season well with salt and pepper to taste.", 
            "Should keep up to a week in the fridge, if you don’t have any pregnant women nearby.", 
            "Variation: I bet this slaw would be equally good with cauliflower. I might use dried currants instead of cranberries, walnuts instead of almonds and maybe even some celery slices thrown in. Have fun with it."
        ], 
        "date": "2009-05-11T14:22:16+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups (160 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "8 tablespoons (4 ounces or 113 grams) cold unsalted butter, cut into pieces and chill again", 
            "1/4 cup (60 grams) plain yogurt or sour cream", 
            "2 teaspoons (10 ml) fresh lemon juice", 
            "1/4 cup (60 ml) ice water", 
            "For the filling:", 
            "1 tablespoon (15 ml) olive oil", 
            "1/4 teaspoon coarse Kosher or sea salt", 
            "3 cups (about 450 grams) cherry or grape tomatoes", 
            "1 ear corn, cut from the cob (about 1 cup)", 
            "1 small (8 ounces or 225 grams) zucchini or summer squash, diced", 
            "1 bundle (3 to 4 ounces or 85 to 115 grams) scallions, thinly sliced", 
            "1/2 cup (2 ounces or 55 grams) grated parmesan", 
            "Glaze:", 
            "1 egg yolk beaten with 1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/burst-tomato-zucchini-and-corn-galette.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Corn", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Quiche", 
            "Tomatoes", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2013/08/burst-tomato-galette-with-corn-and-zucchini/", 
        "title": "burst tomato galette with corn and zucchini", 
        "directions": [
            "Make dough: Whisk stir the flour and salt in a large bowl. Sprinkle bits of butter over dough and using a pastry blender or your fingertips, work it into the flour until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, stir together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball. Wrap with plastic and refrigerate for 1 hour, or up to 2 days.", 
            "Make filling: Get down the saute pan with the lid. If you don’t have one, any large lid will do. Add olive oil, tomatoes, salt and a pinch of red pepper flakes (if that’s your thing) to your saute pan then cover and heat over high heat. Roll the tomatoes around from time to time so that they’ll cook evenly. In a few minutes, you’ll hear some putts and pops as the tomatoes burst a little. When most have, remove lid, turn heat down to medium and add zucchini chunks. Saute for two minutes, until they soften. Add corn and cook one minute. Add scallions, just stirring them in, then turn off heat. Adjust seasonings if needed. Transfer mixture to a large plate and spread it out, so that it will cool faster. You want it cooled to at least lukewarm before assembling the galette.", 
            "Assemble galette: Heat oven to 400 degrees. On a floured counter, roll the dough out into a 12-inch round and it really doesn’t need to be perfectly shaped. Transfer to a parchment-lined baking sheet; I like to fold my dough gently, without creasing, in quarters then unfold it onto the baking pan. Sprinkle tomato-zucchini-corn mixture with half of parmesan and spoon the mixture into the center of the dough, leaving a 2-inch border. If any liquid has puddle in plate, try to leave it there as you spoon. Sprinkle with almost all of remaining parmesan, leaving a pinch or two behind for the crust. Fold the border over the filling, pleating the edge to make it fit. The center will be open. Brush crust with egg yolk glaze. Sprinkle glaze with last pinches of parmesan.", 
            "Bake the galette: For 30 to 40 minutes, or until puffed and golden brown. Remove from the oven and let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature."
        ], 
        "date": "2013-08-05T12:19:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 small red cabbage, trimmed, cored, and shredded (about 6 cups)", 
            "1/2 small green cabbage, trimmed, cored, and shredded (about 6 cups)", 
            "1 tablespoon kosher salt, plus more to taste", 
            "1 bunch fresh baby spinach, stemmed and cut into 1/2-inch wide ribbons (about 4 cups loosely packed)", 
            "1/4 cup fresh lime juice (from about 2 small limes)", 
            "1 tablespoon Dijon or other salty prepared mustard", 
            "1/2 teaspoon ground cumin", 
            "1/4 cup peanut oil", 
            "1/2 cup roasted unsalted peanuts, coarsely chopped", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-and-lime-salad-with-roasted-peanuts1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Citrus", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spinach", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/04/cabbage-and-lime-salad-with-roasted-peanuts/", 
        "title": "cabbage and lime salad with roasted peanuts", 
        "directions": [
            "In a large bowl, toss the shredded red and green cabbage with the salt. Transfer the cabbage to a colander and let it drain for two hours. (I was in a rush and did this in one. It was still nicely wilted, but of course could have been even softer.)", 
            "If you’re worried about the cabbage being too salty when you’re done with the salting process, taste a piece of cabbage and if it concerns you, rinse and drain the cabbage well. This is not a suggestion in the original recipe, but something I suspect might bother some people.", 
            "Put the salted, drained cabbage back into your (rinsed and dried) large bowl and add the spinach. In a medium bowl, whisk the lime juice, mustard and cumin together. Add the peanut oil in a thin stream, whisking constantly until the ingredients are thoroughly emulsified. Toss the salad with the dressing and add the roasted peanuts. Season to taste with salt and pepper.", 
            "This salad is best served immediately, but it does keep surprisingly well in the fridge for a day or two. "
        ], 
        "date": "2010-04-28T22:35:23+00:00"
    }, 
    {
        "ingredient_list": [
            "Chickpeas", 
            "1 3/4 cups cooked chickpeas, or 1 15-ounce can, drained and patted dry on paper towels", 
            "1 tablespoon olive oil", 
            "1/2 teaspoon coarse sea salt", 
            "1/4 teaspoon ground cumin", 
            "Salad", 
            "1 pound carrots, peeled and coarsely grated", 
            "1/4 cup coarsely chopped parsley", 
            "1/4 cup shelled, salted pistachios, coarsely chopped", 
            "Dressing", 
            "1 medium garlic clove, minced", 
            "1/4 cup lemon juice", 
            "3 tablespoons well-stirred tahini", 
            "2 tablespoons water, plus more if needed", 
            "2 tablespoons olive oil", 
            "Salt and red pepper flakes to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/carrot-salad-with-tahini-and-crisped-chickpeas1.jpg?w=640", 
        "tags": [
            "Carrots", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/05/carrot-salad-with-tahini-and-crisped-chickpeas/", 
        "title": "carrot salad with tahini and crisped chickpeas", 
        "directions": [
            "Roast chickpeas: Heat oven to 425 degrees F. Toss chickpeas with one tablespoon olive oil, salt and cumin until they’re all coated. Spread them on a baking sheet or pan and roast them in the oven until they’re browned and crisp. This can take anywhere from 15 to 20 minutes, depending on the size and firmness of your chickpeas. Toss them occasionally to make sure they’re toasting evenly. Set aside until needed.", 
            "Make dressing: Whisk all ingredients together until smooth, adding more water if needed to thin the dressing slightly. Taste and adjust seasoning; don’t worry if it tastes a little sharp on the lemon, it will marry perfectly with the sweet grated carrots.", 
            "Assemble salad: Place grated carrots in large bowl and toss with parsley. Mix in 2/3 of the dressing, adding more if desired. Add more salt and pepper if needed. Sprinkle with a large handful of chickpeas (you’ll have extra and if you’re like us, won’t regret it) and pistachios and dig in.", 
            "Do ahead: Salad keeps well in the fridge for two days, however, I’d add the chickpeas and pistachios right before serving, so they don’t get soft."
        ], 
        "date": "2014-05-29T10:45:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup thinly sliced almonds", 
            "Juice of half a lemon (about 1 tablespoon), plus more to taste", 
            "1 tablespoon white wine vinegar", 
            "1/4 teaspoon fine sea salt or table salt, then more to taste", 
            "3 tablespoons (30 grams) dried currants", 
            "5 tablespoons olive oil, plus more for frying", 
            "2 tablespoons (about 25 grams) brined or salt-packed capers", 
            "oil for frying", 
            "1 small, compact-looking head of cauliflower (about 1 1/4 pounds)", 
            "Freshly ground black pepper", 
            "3 scallions, thinly sliced (use green and white parts)", 
            "2 tablespoons chopped flat-leaf parsley (optional, mostly for color)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-slaw1.jpg?w=640", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/cauliflower-slaw/", 
        "title": "cauliflower slaw", 
        "directions": [
            "Heat oven to 350 degrees F. Spread almonds on a tray and toast them until they’re a deep golden color, tossing them once or twice to ensure even cooking. This will take 10 to 14 minutes. Set aside to cool.** ", 
            "Meanwhile, place lemon juice, vinegar and 1/4 teaspoon salt in a small bowl. Add currants; set aside and let them soak while you prepare the other ingredients. ", 
            "If using brined capers, drain and spread them on paper towels until most of their moisture has wicked out, about 5 minutes. If using salt-packed capers, soak them in water for 10 minutes to remove the saltiness, then drain, rinse and pat dry on paper towels. Pour a 1/2-inch of olive oil or another oil that you prefer to fry in in a small skillet or saucepan. Heat it over medium-high. When hot enough that a droplet of water added to the oil hisses, carefully add the capers and step back — they’re going to sputter a bit for the first 10 seconds. Once it’s safe to get closer, give them a stir. Depending on how dry they were, it can take 1 to 2 minutes for them to get lightly golden at the edges and then crisp. Remove with a slotted spoon. Drain on paper towels.", 
            "Trim cauliflower leaves and cut head into quarters. Using an adjustable-blade slicer (this is mine; it takes up very little room) to cut cauliflower, stem and florets, into 1/4-inch slices. Add to a large bowl. ", 
            "Scoop currants from vinegar mixture with a slotted spoon and add to bowl with cauliflower, along with almonds, capers, scallions and parsley. Slowly whisk 5 tablespoons olive oil into remaining vinegar mixture in a thin stream. Add several turns of freshly ground black pepper. Pour over cauliflower and other ingredients and turn gently to coat all pieces. Taste and adjust seasonings, adding more lemon juice, salt or pepper to taste. Dig in!", 
            "** P.S. I really tried to avoid this pesky oven step by toasting mine in a skillet, the one I’d use to fry the capers in a few minutes. Twice, I failed because the little bits got black and smoky before the larger ones toasted, no matter how much I kept them moving. I’m pretty sure I could do better in the future, but I was running out of almonds. If you trust your pan-toasting skills, feel free to cook the almonds there instead."
        ], 
        "date": "2014-09-16T11:56:06+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust:", 
            "7 tablespoons unsalted butter, melted", 
            "1/3 cup sugar", 
            "1/4 teaspoon vanilla extract", 
            "1 cup plus 1 tablespoon all purpose flour", 
            "Pinch of salt", 
            "Filling:", 
            "1/2 cup sugar", 
            "2 large eggs", 
            "Pinch of salt", 
            "1/4 cup all purpose flour", 
            "1 teaspoon vanilla extract", 
            "1/2 cup (1 stick) unsalted butter, diced", 
            "1 pound sweet cherries, which will yield 12 ounces of pitted cherries, which yielded some leftovers, perfect for snacking (alternately, you can use 12 ounces of the berry of your choice)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/3664441408_6dbba66669_b.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cherries", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/06/cherry-brown-butter-bars/", 
        "title": "cherry brown butter bars", 
        "directions": [
            "Make crust: Preheat over to 375°F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (It should look like this.) Congratulations! You’ve just faked a square tart pan.", 
            "Using rubber spatula or fork, mix melted butter, sugar, and vanilla in medium bowl, or if you’re Deb, in the bottom of the small saucepan you used to melt the butter. Add flour and salt and stir until incorporated. Transfer dough to your prepared pan, and use your fingertips to press the dough evenly across the bottom of the pan. Bake the crust until golden, about 18 minutes (it will puff slightly while baking). Transfer crust to rack and cool in pan. Maintain oven temperature.", 
            "Make the filling: Cook butter in heavy small saucepan (a lighter-colored one will make it easier to see the color changing, which happens quickly) over medium heat until deep nutty brown (do not burn), stirring often and watching carefully, about six minutes. Immediately pour browned butter into glass measuring cup to cool slightly.", 
            "Whisk sugar, eggs, and salt in medium bowl to blend. Add flour and vanilla and whisk until smooth. Gradually whisk browned butter into sugar-egg mixture; whisk until well blended.", 
            "Arrange pitted cherries, or the berries of your choice, in bottom of cooled crust. Carefully pour browned butter mixture evenly over the fruit. Bake bars until filling is puffed and golden and tester inserted into center comes out clean, about 40 minutes (though, of course, this took less time in my hyperactive oven so please watch your baking times carefully). Cool bars completely in pan on rack.", 
            "Use the parchment paper overhang to carefully remove cooled bars from pan and place them on a cutting board and cut them into squares with a very sharp knife. The cherries, if they fall over your slicing lines, will want to give you trouble but if you saw a sharp knife into them slowly before pressing down, they’ll cut neatly and with minimum carnage.", 
            "Do ahead: Can be made at least a day ahead, and stored at room temperature. Any longer, keep them cool in the fridge."
        ], 
        "date": "2009-06-29T13:07:57+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large red peppers, roasted and skinned (great directions over here, if you’re new to this)", 
            "3 cups of cooked chickpeas, rinsed if canned (about 2 15-ounce cans)", 
            "1/4 cup of parsley, chopped", 
            "2 tablespoons of chopped mint", 
            "3 tablespoons of capers, rinsed", 
            "2 tablespoons of fresh lemon juice or red wine or sherry vinegar", 
            "1/4  teaspoon of salt", 
            "2 cloves of garlic, minced", 
            "4 tablespoons of extra virgin olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chickpea-salad-with-roasted-red-peppers1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/11/chickpea-salad-with-roasted-red-peppers/", 
        "title": "chickpea salad with roasted red peppers", 
        "directions": [
            "Cut the peppers into half-inch wide strips and put them in a large bowl together with the chickpeas, herbs and the capers. In a smaller bowl, whisk together the lemon juice, salt, garlic and oil. Pour over the chickpea mixture and combine.Serve immediately, or refrigerate it for a day to get the flavors to mingle fantastically.", 
            "This is a great make-ahead dish for weekday lunches. It would also be wonderful on a pile of torn lettuce, served with toasted pita wedges."
        ], 
        "date": "2008-11-14T23:57:05+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups chopped, crunchy vegetables", 
            "1/2 cup (2 ounces) crumbled feta, queso fresco or ricotta salata", 
            "2 scallions, thinly sliced", 
            "1/3 cup well-toasted sunflower seeds, salted or unsalted", 
            "2 tablespoons fresh lime juice", 
            "2 tablespoons olive oil", 
            "1/4 teaspoon coarse or Kosher salt, plus more to taste", 
            "1/4 teaspoon chile powder or 1/8 teaspoon each your choice combination of chile powder, cumin, cayenne or sumac", 
            "Freshly ground black pepper, to taste", 
            "1 to 2 tablespoons thinly sliced fresh mint leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/06/7463002884_41ea1ca04d_o.jpg?w=750", 
        "tags": [
            "Beans", 
            "Citrus", 
            "Cucumber", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Radishes", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/06/chopped-salad-with-feta-lime-and-mint/", 
        "title": "chopped salad with feta, lime and mint", 
        "directions": [
            "Mix the vegetables, feta, scallions, seeds and mint in a medium bowl. Whisk lime juice, olive oil, salt, spice and black pepper in a small dish and pour over vegetables, tossing to evenly coat. Adjust with more salt or pepper as needed. Garnish with mint and crunch-crunch-crunch away!"
        ], 
        "date": "2012-06-29T07:38:56+00:00"
    }, 
    {
        "ingredient_list": [
            "For the topping:", 
            "1 1/3 cup flour", 
            "1 teaspoon baking powder", 
            "3 tablespoons sugar", 
            "3 tablespoons Demerara sugar (or turbinado sugar aka Sugar in the Raw)", 
            "Zest of one lemon", 
            "1/4 pound (1 stick or 4 ounces) unsalted butter, melted ", 
            "For the filling:", 
            "1 1/2 cups rhubarb, chopped into 1-inch pieces", 
            "1 quart strawberries plus a few extras, hulled, quartered", 
            "Juice of one lemon", 
            "1/2 cup sugar", 
            "3 to 4 tablespoons cornstarch (some commenters found the flour option a little too, well, floury so this has been updated)", 
            "Pinch of salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/05/strawberry-rhubarb-crumble.jpg?w=750", 
        "tags": [
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2007/05/crumbling-crisp-convictions/", 
        "title": "strawberry-rhubarb crumble", 
        "directions": [
            "1. Heat oven to 375°F. Prepare topping: In a mixing bowl, combine flour, baking powder, sugars and lemon zest and add the melted butter. Mix until small and large clumps form. Refrigerate until needed. ", 
            "2. Prepare filling: Toss rhubarb, strawberries, lemon juice, sugar, cornstarch and a pinch of salt in a 9-inch deep-dish pie plate. (I used an oval dish this time, because they fit better in the bottom of a shopping bag.)", 
            "3. Remove topping from refrigerator and cover fruit thickly and evenly with topping. Place pie plate on a (foil-lined, if you really want to think ahead) baking sheet, and bake until crumble topping is golden brown in places and fruit is bubbling beneath, about 40 to 50 minutes. "
        ], 
        "date": "2007-05-29T15:09:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds fresh peas in pods or about 1 1/2 cups already shelled or frozen and defrosted", 
            "1/4 cup plain yogurt", 
            "2 tablespoons tahini (sesame seed paste)", 
            "1 tablespoon lemon juice", 
            "2 tablespoons water", 
            "1/4 teaspoon ground cumin", 
            "1/4 teaspoon paprika, smoked if you have it", 
            "1/4 teaspoon salt", 
            "1 scallions, thinly sliced", 
            "Toasted pitas, cut into wedges, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/4682924368_cce5a4dd30_o.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Peas", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/06/crushed-peas-with-smoky-sesame-dressing/", 
        "title": "crushed peas with smoky sesame dressing", 
        "directions": [
            "Cook peas: Have ready a colander and an ice bath, and bring a medium pot of lightly salted water to a boil. Blanche peas for 30 seconds (if you like them with a real residual snap) to 1 minute (for a slightly more yielding pea) and drain them, then immediately shocking them in the ice water. Drain the peas again and pat them dry on a large towel.", 
            "Crush peas:  Using a potato or egg-masher (and hopefully not an annoying one like mine, with holes the exact size of peas!), muddler or meat pounder (be gentle!), lightly crush the peas. Aim for mixed textures, some left whole, most in halves and a few a little more broken up. Put them in a large bowl.", 
            "Make dressing:  Whisk together tahini, yogurt, lemon juice, water, cumin, paprika and salt. You might be tempted, as I was, to swap the water with olive oil but don’t do it — it makes a horrible curdled mess you will be sad to have to toss.", 
            "Assemble: Mix peas with about 3 tablespoons of the dressing, to start, then add more to taste. Sprinkle with scallions. Heap pea mixture on toasted pita wedges."
        ], 
        "date": "2010-06-11T11:56:25+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound cucumber(s), peeled or unpeeled, cut into large chunks, plus a few extra thin cucumber slices for garnish", 
            "1 cup lemon juice (from about 7 to 8 lemons, although juiciness will vary)", 
            "1/3 cup granulated sugar", 
            "2 cups cold water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cucumber-lemonade1.jpg?w=640", 
        "tags": [
            "Citrus", 
            "Cucumber", 
            "Drinks", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/09/cucumber-lemonade/", 
        "title": "cucumber lemonade", 
        "directions": [
            "Run cucumber through a blender or food processor until pureed, then run it for a full extra minute to ensure that it’s as processed as possible. Set a fine-mesh strainer or a regular strainer lined with a couple layers of cheesecloth or a coffee filter over a pitcher and pour cucumber puree through it, stirring to help it move along faster. Discard solids. In the pitcher, you should have about 1 cup cucumber juice.* Add lemon juice and sugar to it, then water. Give it a good stir or shake, and let it sit in the fridge (to get it started chilling) for 15 minutes, after which a couple more stirs or shakes should leave the sugar fully dissolved. Taste lemonade, adding more sugar or water if desired. (See Notes up top about concentration and sweetness.) Serve chilled over ice, with or without a splash of seltzer on top. You can fancy up the glass with a garnish of cucumber slice, if desired.", 
            "Can we put gin in this? Of course you can.", 
            "* Of course, if you have a juicer, you can use it here to the same effect."
        ], 
        "date": "2014-09-18T11:59:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (227 grams) plain, full-fat yogurt", 
            "1 garlic clove, peeled", 
            "1-inch piece of fresh ginger, peeled", 
            "1/4 teaspoon granulated sugar", 
            "Juice of half a lemon (about 2 tablespoons)", 
            "1 tablespoon minced mild or hot fresh chile (I used a jalapeno)", 
            "1 teaspoon cumin seeds, black or yellow mustard seeds or nigella seeds (I used black mustard seeds)", 
            "2 tablespoons chopped mint leaves, divided", 
            "2 tablespoons chopped cilantro leaves, divided", 
            "Kosher salt to taste", 
            "2 long, English-style cucumbers (2 pounds total)", 
            "1 cup cherry or grape tomatoes, diced", 
            "1/2 medium red onion, chopped small"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/cucumber-yogurt-raita-salad1.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Indian", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/05/cucumber-yogurt-raita-salad/", 
        "title": "cucumber yogurt raita salad", 
        "directions": [
            "\nMake the dressing by placing yogurt in a medium bowl and using a very fine grater to grate the garlic and ginger over it. Stir in sugar, lemon, chile, seeds, half of the mint and cilantro and season it with salt to taste. Set aside until you’re ready to serve the salad.\nCut the cucumbers in half lengthwise, then each half three more times into long wedge-shaped pieces (i.e. 8 long pieces per cucumber). Cut them into 1 to 1 1/2-inch lengths on a diagonal and add them to a big bowl. Pile tomatoes and onion on top and when you’re ready to eat, mix half of the dressing with the salad. Sprinkle with remaining mint and cilantro and serve with extra yogurt dressing on the side."
        ], 
        "date": "2016-05-26T11:49:16+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups cubed day-old dense country bread (1-inch cubes)", 
            "2 medium-size garlic cloves, chopped", 
            "1 large pinch of coarse salt (Kosher or sea)", 
            "1 small pinch of cumin seeds", 
            "3 tablespoons sherry vinegar, preferably aged, or best-quality red wine vinegar, or more to taste", 
            "1/3 cup fragrant extra-virgin olive oil", 
            "1 2/3 pounds very ripe but firm tomatoes, cut into 3/4-inch cubes", 
            "2 small Kirby (pickling) cucumbers, cored, seeded and diced", 
            "1/2 cup finely chopped white onion", 
            "1/2 cup seedless green grapes, cut in half", 
            "About 1/2 cup slivered fresh mint or basil (optional)", 
            "1 small onion", 
            "3 medium-size garlic cloves, peeled", 
            "3 fresh flat-leaf parsley sprigs, plus 1/4 cup chopped parsley", 
            "1 bay leaf", 
            "1 cup green or brown lentils (see Note)", 
            "Extra-virgin olive oil", 
            "1/2 pound sweet Spanish-style chorizo sausage, diced medium-fine", 
            "2 ounces thinly sliced serrano ham or proscuitto", 
            "2 tablespoon sherry vinegar, preferably aged (we, of course, used more)", 
            "1 tablespoon best-quality red wine vinegar", 
            "1 tablespoon chicken stock or broth, or water", 
            "1 teaspoon honey", 
            "Coarse salt (kosher or sea) and freshly ground black pepper", 
            "3 medium-size firm tomatoes, peeled, seeded and chopped", 
            "1/4 cup finely slices scallions, both white and green parts"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/gazpacho-and-lentil-chorizo-salads1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spanish"
        ], 
        "url": "https://smittenkitchen.com/2007/10/gazpacho-and-lentil-chorizo-salads/", 
        "title": "gazpacho salad", 
        "directions": [
            "2.\tArrange the bread cubes in a single layer on a large rimmed baking sheet and bake until they are just beginning to turn golden, 8 to 10 minutes, stirring once. Lead the bread cubes cool.", 
            "3.\tPlace the garlic, salt, and cumin in a mortar and, using a pestle, mash them into a paste. Add the vinegar and olive oil and whisk to mix. "
        ], 
        "date": "2007-10-05T09:21:02+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (177 ml) warm water  (105° to 110°F)", 
            "2 tablespoons (30 ml) milk, slightly warmed", 
            "1 1/2 teaspoons (6 grams) sugar", 
            "1 1/4 teaspoons (5 grams) active dry yeast", 
            "2 cups (250 grams) all-purpose flour", 
            "1/2 teaspoon (3 grams) salt", 
            "6 tablespoons (90 ml) olive oil", 
            "1 1/2 cups halved Concord, red or black grapes, seeded", 
            "1 teaspoon fresh rosemary needles", 
            "2 tablespoons (8 grams) raw or another coarse sugar", 
            "2 teaspoons coarse sea salt (heads up: some are finding this too salty; if you’re worried, use less)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/grape-focaccia-with-rosemary1.jpg?w=500", 
        "tags": [
            "Bread", 
            "Grapes", 
            "Photo", 
            "Picnics", 
            "Snack", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/09/grape-focaccia-with-rosemary/", 
        "title": "grape focaccia with rosemary", 
        "directions": [
            "In the bowl of an electric mixer fitted with the paddle attachment, stir together the water, milk, sugar, and yeast. Let the mixture sit until foamy, about 10 minutes. Add the flour, salt and 2 tablespoons of the olive oil to the yeast mixture and mix well on low. Attach the dough hook, raise the speed to medium-low and knead the dough for 8 minutes longer.", 
            "[And yes, you can stir this together entirely by hand with a wooden spoon, then smash it around on a floured counter to “knead” it for a bit. It’ll be sticky, but doable, and of course you’ll get to say you made bread “old school” style.]", 
            "Brush a large bowl with a generous amount of olive oil. Scrape dough into the bowl and brush the top with additional oil. Cover with plastic wrap and let it rise in a cool place until it doubles in bulk, 1 1/2 to 2 hours.", 
            "Press the dough down with a floured hand. Turn the dough out onto a floured surface and divide it into two balls. Brush a large baking sheet (or two small ones) with olive oil, place the balls of dough on it and brush the top with more oil. Set it aside for 20 minutes, lightly covered with a kitchen towel. After 20 minutes, dip your fingers in olive oil and press and stretch each ball of dough into a 8 to 9-inch circle-ish shape. It will be dimpled from your fingers. Cover again with the towel and let it rise for another 1 1/4 hours in a cool place.", 
            "Preheat the oven to 450°F. Brush tops of dough with remaining olive oil and top the sprinkle grapes, rosemary, coarse sugar and coarse sea salt evenly over the dough. Bake for 15 minutes, until the crust is golden brown and puffed around edges. Let cool before serving. Serve warm or at room temperature. Try not to eat the whole thing like, uh, some people we might know."
        ], 
        "date": "2010-09-07T20:30:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 a large, seedless English cucumber (about 6 to 7 ounces), chopped", 
            "1/2 a green bell pepper, chopped", 
            "1 cup (about 6 ounces) cherry or grape tomatoes, halved", 
            "1/4 cup kalamata olives (you can also serve these alongside)", 
            "1/4 small red onion, thinly sliced", 
            "1 lemon, halved", 
            "2 to 3 ounces feta (Bulgarian or French, if you can find them, are my favorites), in thick slices", 
            "2 tablespoons olive oil, or more to taste", 
            "Salt and freshly ground black pepper", 
            "1 sprig oregano, leaves minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/greek-salad-with-lemon-and-oregano.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Greek", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/05/greek-salad-with-lemon-and-oregano/", 
        "title": "greek salad with lemon and oregano", 
        "directions": [
            "Toss cucumbers, pepper, tomatoes, olives (if using) and onion in a shallow bowl or deep plate. Squeeze half a lemon over it. Arrange feta slices on top. Drizzle with olive oil, sprinkle with salt, pepper and oregano. Serve with a slice of feta on top of each serving, and the second half of the lemon for those that like their salads punchier.", 
            "* If you’re concerned about the pungency of the raw onion, you can squeeze the lemon juice on top of it and let it sit for a while in a dish before adding both to the salad. It will mellow and soften it.   "
        ], 
        "date": "2013-05-21T13:27:21+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound green beans, though if you can find a mix of green and yellow beans, it will be all the prettier", 
            "1 pound cherry tomatoes", 
            "1 large shallot", 
            "2 tablespoons red wine vinegar", 
            "Salt and pepper", 
            "1/3 cup extra-virgin olive oil", 
            "Basil or other herb (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/05/green-bean-and-cherry-tomato-salad.jpg?w=750", 
        "tags": [
            "Green Beans", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/05/green-bean-and-cherry-tomato-salad/", 
        "title": "green bean and cherry tomato salad", 
        "directions": [
            "Prepare the vegetables: Top and tail the beans and cut them into large segments. Parboil the beans in salted water until just tender, about four to five minutes. Drain and immediately spread them out to cool. Stem the cherry tomatoes and cut them in half. ", 
            "Make the vinaigrette: Peel and mince the shallot and put it in a bowl with the vinegar and salt and pepper. Whisk in the olive oil. Taste and adjust the balance with more vinegar, oil, or salt, as needed. Toss the cherry tomatoes in with the vinaigrette; this can sit for a while. Do not add the green beans  until just before serving or they will discolor from the acid in the vinaigrette. For variety, the salad can be garnished with basil or some other fresh herb such as parsley, chervil or hyssop.", 
            "Do ahead: Beans and vegetables can be prepared ahead of time. Simply toss with the dressing only at the last minute, as it can discolor the green beans after several hours."
        ], 
        "date": "2008-05-01T15:52:27+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds green beans", 
            "1 cup (5 ounces or 140 grams) almonds, toasted and cooled", 
            "1 1/4 ounces (about 1/3 cup grated) parmesan or aged pecorino cheese, but no need to grate if using a food processor", 
            "1 small garlic clove, peeled and crushed", 
            "Leaves from a sprig or two of thyme", 
            "Pinches of red pepper flakes, to taste", 
            "1/4 teaspoon coarse sea or kosher salt", 
            "2 to 3 teaspoons white wine vinegar", 
            "1/3 cup olive oil, plus extra for drizzling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/07/green-beans-with-almond-pesto1.jpg?w=640", 
        "tags": [
            "Gluten-Free", 
            "Green Beans", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/07/green-beans-with-almond-pesto/", 
        "title": "green beans with almond pesto", 
        "directions": [
            "Bring a large pot of salted water to boil. Trim green beans — I find using kitchen shears the quickest way — and cook beans in boiling water until crisp tender, about 3 to 4 minutes for regular green beans or 2 to 3 minutes for the skinnier “haricot vert” variety. Plunge in an ice water bath to fully cool. Drain and pat dry. (If you have no patience for the precision of ice water baths, take the green beans out a full minute early as they will continue cooking as they cool.)", 
            "In food processor, grind almonds, cheese, garlic, thyme, pepper and salt to a coarse paste. Add vinegar, and pulse again. Stir in oil and adjust seasonings to taste. ", 
            "Toss cooled green beans with almond pesto. Drizzling with extra olive oil for a fresh glisten. Dig in.", 
            "Serving suggestions: a mix of cherry tomatoes, grilled bread drizzled with olive oil and rubbed with a halved garlic clove or even grilled sausages."
        ], 
        "date": "2015-07-07T10:06:07+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds small (2-inch) potatoes, your choice of variety (I found a rainbow-colored pack, and couldn’t resist, clearly)", 
            "1/4 cup red onion, chopped", 
            "1 tablespoon white-wine vinegar", 
            "1 cup sour cream (or 1/2 cup sour cream, 1/2 cup yogurt)", 
            "2 tablespoons fresh dill, finely chopped", 
            "1/4 cup chopped fresh chives (frustratingly, couldn’t find these)", 
            "1 tablespoon Dijon mustard", 
            "3 tablespoons prepared horseradish", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/horseradish-potato-salad1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/06/horseradish-potato-salad/", 
        "title": "horseradish potato salad", 
        "directions": [
            "Boil the potatoes until fork tender, cool them to room temperature and quarter them. In a large bowl, mix the remaining ingredients and fold over the potatoes. Adjust seasoning to taste — you might add another tablespoon of vinegar if you feel it needs more ‘zing’ — and prepare to wow the Eastern Europeans in your life!"
        ], 
        "date": "2009-06-21T11:57:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon vegetable or olive oil", 
            "1 tablespoon unsalted butter", 
            "3 large leeks (about 1 1/2 pounds)", 
            "1 12-ounce bundle chard or about 6 cups (6 ounces) of leaves, cut into 1/2-inch ribbons", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "1 cup fresh corn kernels (cut from 1 to 2 medium ears corn)", 
            "Cornmeal, for sprinkling baking surface", 
            "4-ounce goat cheese log, cold"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/08/leek-chard-and-corn-flatbread.jpg?w=750", 
        "tags": [
            "Corn", 
            "Leeks", 
            "Photo", 
            "Picnics", 
            "Pizza", 
            "Summer", 
            "Swiss Chard", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/08/leek-chard-and-corn-flatbread/", 
        "title": "leek, chard and corn flatbread", 
        "directions": [
            "Trim the ends off your leeks and halve them lengthwise. Cut them crosswise into 1/2-inch half-rings. Fill a medium bowl with very cold water and drop in sliced leeks. Swish them around with your fingers, letting any sandy dirt fall to the bottom. Scoop out the leeks and drain them briefly on a towel, but no need to get them fully dry. Do the same with your chard ribbons, but you can leave the leaves on towels until they’re nearly fully dry, while you cook the leeks.", 
            "Heat your oven to 450 degrees. ", 
            "Heat a large, heavy skillet over medium heat. Once hot, add butter and oil and once they’re fully melted and a bit sizzly, add the leek slices. Reduce heat to low, cover with a lid and cook leek for 10 to 13  minutes, stirring occasionally. Raise heat back to medium, add the chard ribbons and cook until they wilt, about 4 minutes. Season mixture with salt and freshly ground black pepper, adding more if needed. Finally, add your corn kernels, cooking them with the leeks and chard for just another minute.", 
            "Sprinkle two baking sheets with cornmeal. If you have pesky old baking trays like I do, and your breads really like to stick to them, I find things will release more reliably if you first lightly spray them with an oil before sprinkling on the cornmeal. Roll or stretch half your dough into a rectangular-ish shape (flatbreads are prettiest when they’re irregularly shaped, in my humble opinion) and arrange it on the prepared sheet. Spread half the leek-corn-chard mixture on it. Sprinkle it with half the log of goat cheese, crumbled into small bits. ", 
            "Bake flatbread in oven for 10 to 15 minutes, until the edges of the bread begin to brown slightly (they might brown more deeply in a better oven than they did in my lousy one). Repeat with remaining dough, filling and goat cheese. ", 
            "To serve, slide each flatbread onto a cutting board and cut into 8 rectangles. Serve immediately. "
        ], 
        "date": "2012-08-28T14:58:56+00:00"
    }, 
    {
        "ingredient_list": [
            "Lentils", 
            "Scant 1 cup dried green lentils (Puy or Casteluccio, if you can find them) lentils, picked and rinsed over", 
            "2 large garlic cloves, halved lengthwise", 
            "2 fresh sage sprigs", 
            "2 tablespoons olive oil", 
            "For the dressing and salad", 
            "2 teaspoons coriander seeds, toasted and ground**", 
            "1 teaspoon cumin seeds, toasted and ground**", 
            "1/2 large garlic clove", 
            "Salt (Maldon or another flaky sea salt if you’ve got it)", 
            "2 tablespoons well-stirred tahini paste", 
            "1/4 cup freshly squeezed lemon juice, plus more to taste", 
            "2 tablespoons plus 2 teaspoons olive oil", 
            "1 and 3/4 cups drained chickpeas (from a 15-ounce can), low sodium if you can find them", 
            "1/2 small preserved lemon, pith and flesh discarded, rind finely diced (optional)", 
            "1 very small red onion, thinly sliced into half-moons", 
            "A handful of small, delicate cilantro or flat-leaf parsley sprigs", 
            "A scant 1/4 cup feta (goat’s milk if you can find it, otherwise use what you can get)", 
            "1 and 1/2 tablespoons raw sesame seeds, toasted in a dry pan until a shade or two darker"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/lentil-and-chickpea-salad.jpg?w=750", 
        "tags": [
            "Beans", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/04/lentil-and-chickpea-salad-with-feta-and-tahini/", 
        "title": "lentil and chickpea salad with feta and tahini", 
        "directions": [
            "Make the lentils: Put the lentils, garlic, sage, and olive oil in a small pot, along with 2 cups cold water, and set it over medium heat. Let the water come to a simmer (not boiling), then turn the heat to low and cook the lentils in a very gentle simmer just until they are tender  — April recommends 25 minutes, but mine took 35 and needed a touch more water at the end. Take the pan off the heat and let the lentils cool a bit before draining them. Pick out and discard the sage and garlic. You’ll have about 2 cups cooked lentils.", 
            "Make the dressing: Mix together the ground coriander and cumin in a small bowl. Mash the garlic clove to a paste with 1 teaspoon salt (use half as much Kosher salt, even less table salt) on a cutting board or in a mortar. In a small bowl for your dressing, combined the mashed garlic, tahini, 3 tablespoons of the lemon juice, 2 tablespoons of the olive oil, 1 teaspoon of the ground coriander-and-cumin mixture and 2 tablespoons water. Stir well, then taste. Add more lemon if desired.", 
            "Assemble the salad: Place onion slices in a medium bowl and break them up with your fingers. Sprinkle in two good pinches of salt, then two teaspoons of lemon juice, two remaining teaspoons of olive oil and the cilantro or parsley. Toss well, then crumble in the cheese and gently toss again.", 
            "Toss the lentils with the drained chickpeas, preserved lemon rind (if using), and 1 teaspoon flaky sea salt (use half as much Kosher salt, even less table salt) in a large mixing bowl. Pour in the tahini dressing and toss it all together really well, then stir in the onion-feta mixture.", 
            "Arrange the salad in bowl or platter. Sprinkle the mixture with the sesame seeds and some of the remaining spices. Serve, and don’t forget to share.", 
            "P.S. We had this with a Simple Potato Gratin (a post I’m itching to update even more simply, and less hideously, but the important stuff is there) and lamb chops (may I recommend these?). ", 
            "** To toast and grind spices: Put the spices, one at a time, in a small dry pan over medium-high heat. Toast, shaking the pan frequently, until the spices become very sweet and fragrant, anywhere from 2 to 4 minutes. Let them cool in a bowl or on a small plate and grind in a mortar and pestle or in a coffee grinder."
        ], 
        "date": "2013-04-01T12:27:09+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds unpeeled small Yukon gold (Ina’s suggestion) or fingerling (what I used) potatoes", 
            "Coarse, kosher or sea salt", 
            "3 tablespoons Champagne or white wine vinegar", 
            "1/2 teaspoon Dijon mustard", 
            "1/2 teaspoon minced or pressed garlic", 
            "1 large or extra-large egg yolk, ideally at room temperature", 
            "Freshly ground black pepper", 
            "1/2 cup olive oil", 
            "1/4 cup dry white wine (you can skip this, or use less, with little harm; I used 1 tablespoon vermouth instead)", 
            "3 tablespoons drained capers (I imagine minced cornichons would be a good alternative)", 
            "6 scallions, thinly sliced (yielding about 1 cup)", 
            "2 medium stalks celery, diced small (about 1/4 inch) (yielding about 1/2 cup)", 
            "1/2 cup finely diced red onion", 
            "1 1/2 pounds cooked lobster meat, cooked and cooled, in a 1-inch dice (from about 7 to 8 pounds fresh lobster; see post above for better budgeted suggestions)", 
            "1 lemon", 
            "3 tablespoons coarsely chopped fresh tarragon (Ina’s suggestion) or flat-leaf parsley (what we used)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/lobster-and-potato-salad.jpg?w=750", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad", 
            "Seafood", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/05/lobster-and-potato-salad/", 
        "title": "lobster and potato salad", 
        "directions": [
            "Cook the potatoes: Place the potatoes in a large pot and cover with an inch or two over water. Add 1 tablespoon salt and bring to a boil. Lower the heat and simmer for 15 to 25 minutes, depending on the size of the potatoes, until just tender. (A bamboo skewer is ideal to test them.) Drain in a colander, and let potatoes cool for 5 minutes. Cut potatoes into quarters or halves (or fingerlings into 1/2- to 1-inch segments) and place them in a large bowl.", 
            "Make the vinaigrette: Whisk together the vinegar, mustard, garlic, egg yolk, 1 teaspoon salt, and many grinds of black pepper (Ina recommends you use a full teaspoon of pepper). Whisking constantly and vigorously, pour the oil in in a thin drizzle, ideally making an emulsion. Stir in the wine (if using) and capers. ", 
            "Assemble the salad: While the potatoes are still very warm, pour half the vinaigrette on the potatoes and toss them gently, allowing them to soak up the vinaigrette. Stir in the scallions, celery, red onion, lobster, and add enough vinaigrette to moisten. Reserve any remaining vinaigrette for later. Add the zest and juice of the lemon, the tarragon or parsley, and more salt and pepper to taste (Ina calls for another 2 teaspoons salt and 1 teaspoon pepper, but this felt like overkill). Cover with plastic wrap and refrigerate for at least an hour to allow flavors to blend. Taste for seasonings and add more vinaigrette, if necessary. ", 
            "Serve: This salad is especially good served closer to room temperature. Don’t forget to share."
        ], 
        "date": "2013-05-29T10:56:52+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound small shrimp, shelled and deveined or pre-cooked and defrosted", 
            "2 firm-ripe avocados, halved, scored into a small dice", 
            "2 cups grape tomatoes, quartered or 2 cups chopped tomatoes, drained a little", 
            "1/2 small white onion, very finely chopped (use red if you can’t find white)", 
            "1 small jalapeño, seeded and finely chopped (optional)", 
            "Drizzle of olive oil", 
            "Juice of 1 to 2 limes", 
            "Salt", 
            "Handful cilantro leaves, roughly chopped", 
            "Hot sauce, on the side", 
            "Tortilla chips, to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/9349257784_815a1814b7_o.jpg?w=750", 
        "tags": [
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Seafood", 
            "Side Dish", 
            "Summer", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2013/07/mama-canales-garcias-avocado-shrimp-salsa/", 
        "title": "mama canales-garcia’s avocado-shrimp salsa", 
        "directions": [
            "To cook the shrimp: Bring salted water* to a boil and turn off heat. Add shrimp, cover pot and let stand until firm and pink, about 5 to 7 minutes. Drain shrimp, pat dry and chill. ", 
            "Make salsa: Chop shrimp into small bites and put in medium bowl. Scoop avocados into bowl. Add tomatoes, white onion, jalapeño (if using, to taste) and a drizzle of olive oil. Add the juice of one lime, and a second one, if needed. Add salt to taste, then cilantro. Serve with tortilla chips.", 
            "* If you have more time, you can first make a shrimp stock with about 3 cups water, 1 cup beer or wine, the reserved shrimp shells, additional lime juice or the peels from the lime juice you’ll use in the salad and some peppercorns or red pepper flakes. Boil these together for 20 minutes, then strain the mixture. Cook the shrimp in this stock instead."
        ], 
        "date": "2013-07-23T12:01:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 mangoes, peeled, pitted and julienned", 
            "1 to 1 1/4 pounds Napa cabbage, halved and sliced very thinly", 
            "1 red pepper, julienned", 
            "1/2 red onion, thinly sliced", 
            "6 tablespoons of fresh lime juice, from about two limes", 
            "1/4 cup rice vinegar", 
            "2 tablespoons oil of your choice", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon red pepper flakes, or to taste (or omit this and whisk in a chile paste to taste)", 
            "1/4 cup thinly sliced fresh mint leaves", 
            "1/4 cup toasted cashews, coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/mango-slaw-with-cashews-and-mint.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Mango", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2010/07/mango-slaw-with-cashews-and-mint/", 
        "title": "mango slaw with cashews and mint", 
        "directions": [
            "Toss mangoes, cabbage, pepper and onion in a large bowl. Whisk lime juice, vinegar, oil, salt and red pepper in a smaller bowl and pour over slaw. You can either serve this immediately or leave the flavors to muddle for an hour in the fridge. Before serving, toss with mint leaves and sprinkle with cashews.", 
            "About your mango: This salad will work with almost any variety or ripeness of mango, whether sour or sweet. Use the one you can get, or that you enjoy the most. In general, a firmish not overly ripe mango (unlike the very ripe, sweet one I used) holds up best but all will be delicious in this salad."
        ], 
        "date": "2010-07-08T12:58:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup red wine vinegar", 
            "1/4 cup cold water", 
            "1 tablespoon kosher salt", 
            "2 teaspoons sugar", 
            "1/2 a red onion, cut into a 1/2-inch dice (use less if your onion is huge)", 
            "3 bell peppers, your choice of colors (I used one red, orange and yellow)", 
            "1 kirby cucumber,", 
            "1/4-pound firm feta cheese", 
            "1/4 to 1/2 cup pitted kalmata olives", 
            "1/4 cup olive oil", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/mediterranean-pepper-salad.jpg?w=753", 
        "tags": [
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/06/mediterranean-pepper-salad/", 
        "title": "mediterranean pepper salad", 
        "directions": [
            "Swish together the red wine vinegar, water, kosher salt and sugar in a small bowl until the salt and sugar are dissolved. Add the red onion and set it aside.", 
            "Meanwhile, time to practice your knife skills. Core and seed your bell peppers and chop them into 1/2-inch pieces. Chop the cucumber and feta into similarly-sized chunks. Put your peppers, cucumber, feta and olives in a large bowl.", 
            "By now, your onions will have lightly pickled, both sweetening and softening their blow. Drain them and add them to the other vegetables in the large bowl, but reserve the vinegar mixture. Pour a quarter cup of the vinegar mixture over the salad, then drizzle with olive oil. Season generously with salt and freshly ground black pepper, or to taste. Toss evenly and serve at once, or let the flavors muddle together in the fridge for a few hours.", 
            "Forgetful, who me? People, I just realized I forgot to add the cup of grape tomatoes that are usually in this salad, and that I’d purchased specifically to add to it. Like grape tomatoes? Add them! Don’t like them? Turns out you might not know they were missing."
        ], 
        "date": "2009-06-25T16:09:49+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (4-pound*) cantaloupe or honeydew melon, seeded and cut into 1-inch cubes (about 8 cups)", 
            "1 1/2 cups water", 
            "1 to 2 tablespoons fresh lime juice", 
            "1 tablespoon sugar (optional, I skipped this)", 
            "1/4 teaspoons salt", 
            "1 quart chilled club soda or seltzer"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/melon-agua-fresca1.jpg?w=500", 
        "tags": [
            "Cantaloupe", 
            "Drinks", 
            "Honeydew", 
            "Photo", 
            "Picnics"
        ], 
        "url": "https://smittenkitchen.com/2009/08/melon-agua-fresca/", 
        "title": "melon agua fresca", 
        "directions": [
            "Garnish: lime wedges or melon slices", 
            "Purée melon in batches with water in a blender or food processor, however, if you use the latter be extra careful as the food processor does not excel in handling large amounts of liquid.", 
            "Transfer to a colander lined with a kitchen towel (not terry cloth) or fine cheesecloth set over a deep bowl and let drain about one hour. Gather ends of towel and very gently squeeze any remaining juice from melon, then discard solids. Stir in lime juice, sugar, and 1/4 tsp salt and chill for another hour.", 
            "Divide among 8 (10-ounces) glasses and top off with club soda. Or vodka. Look, I know some of you are going to anyway; just don’t forget to share.", 
            "Do ahead: Drinks, without club soda, can be made 4 days ahead and chilled. Add soda just before serving.", 
            "* My cantaloupe weighed 2 pounds, my honeydew weighed 7 1/2. I suppose that perfect four-pound melon specimens exist, just certainly not where I shop!"
        ], 
        "date": "2009-08-20T11:48:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup well-shaken buttermilk", 
            "2 tablespoons mayonnaise", 
            "2 tablespoons cider vinegar", 
            "2 tablespoons minced shallot", 
            "1 tablespoon sugar", 
            "3 tablespoons finely chopped chives", 
            "1 pound Napa cabbage, cored and thinly sliced crosswise (4 cups)", 
            "6 radishes, diced", 
            "2 celery ribs, thinly sliced diagonally"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/napa-cabbage-salad-with-buttermilk-dressing.jpg?w=751", 
        "tags": [
            "Cabbage", 
            "Photo", 
            "Picnics", 
            "Radishes", 
            "Salad", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2008/07/napa-cabbage-salad-with-buttermilk-dressing/", 
        "title": "napa cabbage salad with buttermilk dressing", 
        "directions": [
            "Whisk together buttermilk, mayonnaise, vinegar, shallot, sugar, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a large bowl until sugar has dissolved, then whisk in chives.", 
            "Toss cabbage, radishes, and celery with dressing."
        ], 
        "date": "2008-07-31T12:22:28+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (6 ounces or 170 grams) unsalted butter, plus additional for greasing pan", 
            "1 1/2 cups (6 3/4 ounces or 190 grams) all purpose flour", 
            "2 teaspoons (9 grams) baking powder", 
            "3/4 teaspoon (4 grams) salt", 
            "Pinch of allspice", 
            "1 cup (7 ounces or 200 grams) sugar", 
            "2 large eggs", 
            "2/3 cup whole milk or buttermilk", 
            "1 1/2 pounds nectarines, halved, pitted and cut into 1/2-inch thick wedges (about 4 cups)", 
            "1 tablespoon lemon juice", 
            "Streusel", 
            "Reserved butter from cake (above)", 
            "1/2 cup (3 1/2 ounces or 100 grams) sugar", 
            "1/2 cup (2 1/4 ounces or 64 grams) all purpose flour", 
            "1/4 teaspoon cinnamon", 
            "Pinch of salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/4833941545_0c7c5409a1_o-1.jpg?w=751", 
        "tags": [
            "Brown Butter", 
            "Cake", 
            "Cookbooks", 
            "Everyday Cakes", 
            "Nectarine", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/07/nectarine-brown-butter-buckle/", 
        "title": "nectarine brown butter buckle", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns. Set aside and let cool (the fridge will hasten this along).", 
            "Prepare you pan: Preheat oven to 350°F. Line the bottom of a 10-inch round cake pan, springform or cast iron skillet with parchment paper and butter the paper and rest of the pan generously; set aside.", 
            "Make the cake: Whisk flour, baking powder, salt and allspice in medium bowl to blend. In a large bowl, whisk together 1/2 cup cooled browned butter (set aside remaining 1/4 cup for topping), sugar and then eggs, one at  a time. Stir in milk or buttermilk. Stir dry ingredients into this wet mixture; mix until just combined and spread batter in prepared pan. Toss nectarine wedges with lemon juice and arrange them in a single layer on top of the batter.", 
            "Make the streusel and bake the cake: Stir remaining brown butter, sugar, flour, cinnamon and salt together until large crumbs form. Sprinkle the nectarine-topped batter with crumbs. Bake until top is golden brown and tester inserted into center comes out with moist crumbs, about 40 to 45 minutes. Let cool in pan for 5 minutes before flipping out onto a cooling rack."
        ], 
        "date": "2010-07-28T10:13:53+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup unbleached all-purpose flour", 
            "1/2 teaspoons sugar", 
            "1/8 teaspoon salt", 
            "6 tablespoons (3/4 stick or 3 ounces) unsalted butter, chilled, cut into 1/2–inch pieces", 
            "Filling", 
            "1 tablespoon ground almonds", 
            "1 tablespoon flour", 
            "1/4 cup plus 3 tablespoons sugar", 
            "1 tablespoon amaretti, pulverized — or — 1 extra tablespoon ground almonds plus an extra teaspoon sugar", 
            "10 ounces galette dough, rolled into a 14-inch circle and chilled", 
            "1 and 1/2 pounds ripe nectarines (about 4 large)", 
            "1 tablespoon unsalted butter, melted", 
            "1/4 cup sliced almonds (optional)", 
            "Peach or nectarine jam (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/nectarine-galette1.jpg?w=500", 
        "tags": [
            "Fruit", 
            "Nectarine", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/08/nectarine-galette/", 
        "title": "nectarine galette", 
        "directions": [
            "Make the crust: Combine the flour, sugar, and salt in a large, wide mixing bowl. Cut in six tablespoons of the butter with a pastry blender or two knives, mixing until the dough resembles coarse cornmeal. Dribble four tablespoons ice water over the mixture, using a rubber spatula to pull the mixture together. Gather the dough into a mound (either in the bowl or on a counter) and gently knead it together, for just a few seconds. If it’s not coming together, add ice water, a tablespoon at a time, until it does. Wrap dough in a flat disc in plastic and refrigerate for at least 30 minutes before rolling out.", 
            "When you are ready to roll out the dough, take one disk and let it soften slightly so that it is malleable but still cold. On a lightly floured surface, roll out the disk into a 14-inch circle about 1/8 inch thick. Transfer the dough to a parchment-lined baking sheet and refrigerate at least 1/2 hour before using.", 
            "Make the galette: Preheat the oven to 400 degrees. Place a pizza stone, if you have one, on a lower rack. Toss the ground almonds, flour, one tablespoon of the sugar, and pulverized amaretti (or mix of extra ground almonds and sugar) together.", 
            "Remove the prerolled dough from the refrigerator or freezer and sprinkle the almond mixture evenly over the pastry, leaving a 1 1/2 to 2-inch border uncoated. Cut nectarines in half, removing pits, then each half into thirds (you’ll get six wedges per nectarine). Arrange the fruit, skin-side-down, in concentric circles on the dough, making a single layer of snugly touching pieces, leaving the border bare. Sprinkle 1/4 cup of the sugar evenly over the fruit.", 
            "While rotating the tart, fold the border of exposed dough up and over itself at regular intervals, crimping and pushing it up against the fruit. Pinch or trim off any excess dough. (Make sure there are no breaks that will let juices leak.) Brush the border with melted butter, and sprinkle it with two tablespoons sugar.", 
            "Bake in the lower third of the oven (preferably on a pizza stone) for about 45 to 50 minutes, until the crust is well browned and its edges are slightly caramelized. If you wish, sprinkle sliced almonds over the galette 15 minutes before the baking time ends, so they get toasty and extra-crisp. As soon as the galette is out of the oven, use a large metal spatula to slide it onto a cooling rack, to keep it from getting soggy. Let cool for 20 minutes. If you want to glaze the tart, brush the fruit lightly with a little warmed peach (or nectarine, if you have it) jam. Serve warm, with vanilla ice cream or with plain yogurt.", 
            "Do ahead: This galette keeps at room temperature for at least two days, and even longer in the fridge. The unbaked dough, wrapped in plastic, will keep in the freezer for a few weeks, the fridge for a day or more. Rolled-out dough may be frozen and used the next day."
        ], 
        "date": "2009-08-30T12:35:26+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup granulated (50 grams) or powdered (30 grams) sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "6 tablespoons (85 grams) unsalted butter", 
            "1/3 cup dark brown sugar", 
            "1/3 cup granulated sugar", 
            "1 large egg", 
            "1 large egg yolk", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 tablespoon bourbon (optional)", 
            "1 teaspoon vanilla extract", 
            "6 tablespoons all-purpose flour", 
            "3/4 cup (4 1/2 ounces or 130 grams) chocolate chips or chopped chocolate", 
            "3/4 cup toasted (always) and coarsely chopped walnuts or pecans", 
            "Flaky sea salt on top, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/not-derby-pie-bars1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Bourbon", 
            "Chocolate", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2015/04/not-derby-pie-bars/", 
        "title": "not derby pie bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. A little nonstick spray underneath helps keep the strips in place. (If you have an 8-inch square springform, you can skip this and just butter it lightly.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take another 30 seconds for it to come together, but it will. Transfer the dough clumps to prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. Meanwhile, prepare the filling.", 
            "Make the filling: Melt your butter and, if desired, brown it too, by continuing to cook the butter in a small saucepan over medium heat, stirring frequently, until golden brown bits form at the bottom, about 5 minutes. Transfer butter to a large bowl and let it cool; you can hasten this along by setting it in the freezer for a couple minutes or stirring it over an ice water bath.", 
            "Whisk sugars into butter until smooth, then egg, (edited to add) yolk, salt, bourbon (if using) and vanilla. Stir in flour until just combined, then mix in chocolate and nuts. Pour over par-baked crust, spreading evenly. Sprinkle lightly with sea salt before baking, if desired. ", 
            "Bake bars: For 20 to 25 minutes, until top is firm and golden. Bars are much easier to cut if you let them cool almost completely, but I suspect there’s little fun in that. Once they’re cool, however, you can easily transfer them from the pan to a cutting board with the parchment paper sling you created. Serve plain, with whipped cream or a tiny scoop of vanilla ice cream. Can dust with powdered sugar for extra pretties. ", 
            "Store at room temperature for up to 3 days, or in the fridge for longer."
        ], 
        "date": "2015-04-30T12:00:22+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups (415 grams or 15 ounces) mayonnaise, low-fat is fine, as is swapping half with yogurt", 
            "1/4 cup smooth (60 grams) Dijon mustard", 
            "3 tablespoons (45 grams) whole grain mustard (I use whole grain Dijon)", 
            "2 tablespoons (30 ml) apple cider vinegar", 
            "1 teaspoon celery seed", 
            "1/2 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "1 1/2 cups (170 grams or 6 ounces) crumbled blue cheese (optional)", 
            "1/2 of a small head (about 430 grams or 15 ounces for half) green cabbage", 
            "1/2 small (about 375 grams or 13 ounces for half) head red cabbage", 
            "1 giant carrot (about 6 ounces) or 4 slim ones, scrubbed or peeled and shredded", 
            "1 cup chopped fresh parsley leaves or 1 cup slivered kale leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/not-your-mamas-coleslaw.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2006/11/not-your-mamas-coleslaw/", 
        "title": "not your mama’s coleslaw", 
        "directions": [
            "Make the dressing: Mix the mayonnaise, mustards, vinegar, celery seed, salt, and pepper in a smaller bowl. Stir in blue cheese, if using.", 
            "Prepare the vegetables: Halve the cabbage halves and cut out the cores. Slice the cabbage as thinly as you can with a sharp knife, on a mandoline, or with a food processor’s slicing blade (lay the cabbage horizontally in the feed tube). Transfer chopped cabbage into a large bowl, fishing out any very large pieces and slicing them thinly by hand. Stir in the shredded carrot. If you’re going to dress this later, this is the best stopping point.", 
            "To serve: Up to an hour before you’ll eat the slaw, toss the cabbage mixture with dressing to taste –- you will want to start with half and add more as needed — and parsley. Adjust seasonings as needed.", 
            "Note: No matter how gargantuan the salad looks right now, it will soon wilt down a bit and yield moderate portions for 8 to 10 people.\n"
        ], 
        "date": "2006-11-01T14:37:22+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 to 1 pound seedless cucumber, washed and chopped into chunks", 
            "2 thin or 1 regular scallions, thinly sliced", 
            "1 large avocado, pitted and diced", 
            "2 tablespoons mayonaise", 
            "Juice of half a lime, plus more to taste", 
            "Salt and hot sauce (we used Sriracha) to taste", 
            "Chopped cilantro or flat-leaf parsley to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/17041084926_d38d46dae0_k.jpg?w=750", 
        "tags": [
            "Avocado", 
            "Cucumber", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/04/obsessively-good-avocado-cucumber-salad/", 
        "title": "obsessively good avocado cucumber salad", 
        "directions": [
            "Combine cucumber, scallions and avocado in a bowl. Whisk together mayo, lime and seasonings, adjusting levels to taste. Drizzle salad with dressing and garnish with cilantro or parsley. Repeat again tomorrow. "
        ], 
        "date": "2015-04-07T12:00:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup packed dark brown sugar", 
            "2 tablespoons paprika (sweet, hot or smoked, whichever variety you prefer)", 
            "3 tablespoons chili powder", 
            "1 tablespoon onion powder", 
            "2 tablespoons kosher salt (Diamond brand, which is very lightweight; for most others, use 1 1/4 tablespoons; more about why here)", 
            "Chipotle powder or ground red pepper (cayenne) to taste", 
            "As many cranks of freshly ground black pepper as your arm is in for", 
            "1 5-pound rack spare ribs", 
            "2 1/2 to 3 hours at 300°F.", 
            "3 1/2 to 4 hours at 250°F.", 
            "4 hours at 225°F"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/oven-ribs-even-better1.jpg?w=640", 
        "tags": [
            "Grilling", 
            "Meat", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/06/oven-ribs-even-better/", 
        "title": "oven ribs, even better", 
        "directions": [
            "We’ve also fiddled with combinations, such as a higher temperature at the beginning, and then, upon realizing they’d be ready sooner than we’d need them, turning them down to 175°F for the remaining time. And vice-versa, starting with the low temperatures in the original recipe, and realizing at the 4 hour mark, they were coming along too slowly and finishing them at 300°F. I hope these extra options make it easier, and not more confusing, to make yours at home."
        ], 
        "date": "2015-06-29T12:09:09+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/pasta-and-fried-zucchini-salad1.jpg?w=640", 
        "tags": [
            "Pasta", 
            "Peas", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Summer Squash", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2014/06/pasta-and-fried-zucchini-salad/", 
        "title": "pasta and fried zucchini salad", 
        "directions": [
            "Bring a large pot of salted water to a boil. ", 
            "While you’re waiting, in a medium saucepan or skillet, heat sunflower oil over medium-high heat. Fry zucchini slices in batches for about 3 to 4 minutes, flipping once, until golden on both sides. [Update to add: If your zucchini isn’t browning right away, bump up the heat until it does in just a few minutes.] Drain in colander, shaking with a couple pinches of salt, then transfer to a large bowl and pour vinegar on top. Set aside.", 
            "In the hot water, cook edamame for 3 minutes, frozen peas for 3 to 4 minutes, or fresh peas for 1 to 2 minutes (to taste). Drain and run cool water over until lukewarm. Set aside to dry. Leave pot boiling, then cook pasta until al dente in it. Drain and rinse under cold water. ", 
            "Combine half of basil and all of the parsley and olive oil in a food processor or blender. Blend until smooth, then season with salt and pepper.", 
            "Transfer pasta back to empty pot. Add fried zucchini and any juices, basil-parsley oil, edamame or peas, lemon zest, capers and mozzarella. Stir gently together, then season generously with salt and pepper. Right before you serve it, stir in remaining basil leaves. ", 
            "Do ahead: Assembled dish keeps in the fridge for at least a day, or so I hear."
        ], 
        "date": "2014-06-09T11:53:03+00:00"
    }, 
    {
        "ingredient_list": [
            "Roasted tomatoes", 
            "4 cups (about 680 grams) grape tomatoes", 
            "Olive oil", 
            "Salt", 
            "Oregano dressing", 
            "1 big clove or 2 small cloves garlic", 
            "1 1/2 tablespoons dried oregano (if you can find it, Sicilian is my favorite)", 
            "1 1/4 teaspoons kosher salt, plus more to taste", 
            "Freshly ground black pepper", 
            "3 tablespoons lemon juice", 
            "3 tablespoons red or white wine vinegar", 
            "1/3 cup olive oil", 
            "Assembly", 
            "1 pound (455 grams) dried pasta, a bite-sized shape of your choosing (I used reginetti), cooked until 1 to 2 minutes before doneness and drained", 
            "6 ounces (170 grams) crumbled salty cheese, such as ricotta salata, feta, queso fresco (I used this posh, delicious stuff)", 
            "1/2 cup (70 grams) pine nuts, well-toasted and cooled", 
            "1/2 cup (70 grams) pitted and rough-chopped olives of your choice (I used gaeta here, but like them even more when oil-cured)", 
            "Salt and pepper", 
            "Handful fresh basil leaves, roughly chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pasta-salad-with-roasted-tomatoes1.jpg?w=640", 
        "tags": [
            "Pasta", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/05/pasta-salad-with-roasted-tomatoes/", 
        "title": "pasta salad with roasted tomatoes", 
        "directions": [
            "Roast tomatoes: Heat oven to 300°F (150°C). Cover 1 to 2 baking sheets with parchment paper or a nonstick baking mat. Cut each small tomato in half lengthwise and arrange cut side up in a single layer on prepared sheets. Drizzle lightly with olive oil and sprinkle with salt. Bake in oven for approximately 90 minutes, until somewhat shriveled and dry to the touch, but not fully dehydrated. Set aside until needed, letting them cool. [Note, if you pine nuts are not yet toasted, you can place them in the oven for the last 10 minutes, shaking them once or twice for even coloring. Let cool as well before using.]", 
            "Make dressing: Roughly chop the garlic on a cutting board, then add oregano, salt and a few grinds of black pepper. Mince the mixture with your knife until it’s a grainy herb paste. Transfer to a small bowl, whisk in lemon juice and vinegar, then slowly drizzle in oil, whisking the whole time. Taste and adjust as needed; you might need more salt or vinegar. You want a strongly flavored dressing that won’t get lost in that big bowl of ingredients.", 
            "Assemble salad: In a giant bowl, place drained pasta, roasted tomatoes, cheese, pine nuts and olives and toss gently to combine. Add dressing to taste, along with any extra salt and pepper needed. Finish with basil. Salad can be eaten right away, but will keep in the fridge up to 3 days. This is also perfect for picnics and potlucks, as it can handle being out in the sun without going south."
        ], 
        "date": "2015-05-27T11:58:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (7 ounces or 200 grams) white sugar", 
            "1 teaspoon (5 grams) baking powder", 
            "2 3/4 cups plus 2 tablespoons (12 5/8 ounces or 359 grams) cups all-purpose flour (or you can measure 3 cups and remove 2 tablespoons flour)", 
            "1/4 teaspoon cinnamon", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1/4 teaspoon (2 grams) salt", 
            "1 cup (2 sticks or 8 ounces or 227 grams) cold unsalted butter", 
            "1 large egg", 
            "2 peaches, pitted and thinly sliced (between 1/8 and 1/4-inch thick)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/09/4950027940_b3512efca3_o.jpg?w=749", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cookie", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/09/peach-shortbread/", 
        "title": "peach shortbread", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns and the very second that you turn around to do something else. Set it in the freezer until solid (about 30 minutes).", 
            "[Don’t have time for all this brown butter madness? Check the head notes to use regular softened butter instead.]", 
            "Preheat the oven to 375°F (190°C). Butter a 9×13 inch pan, or spray it with a nonstick spray. In a medium bowl, stir together sugar, baking powder, flour, salt and spices with a whisk.  Use a pastry blender, fork or your fingertips, blend the solidified brown butter and egg into the flour mixture. It will be crumbly. Pat 3/4 of the crumbs into the bottom of the prepared pan, pressing firmly. Tile peach slices over crumb base in a single layer. Scatter remaining crumbs evenly over peaches and bake in preheated oven for 30 minutes, until top is slightly brown and you can see a little color around the edges. Cool completely in pan before cutting into squares.", 
            "Keeping: I’ve kept mine in the fridge and they’ve held up great there since Monday. I imagine that these would freeze well, between layers of waxed paper, with the container sealed well in plastic wr"
        ], 
        "date": "2010-09-02T15:58:05+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pints (1 1/2 pounds) grape or cherry tomatoes (1 1/2 lb)", 
            "3 large garlic cloves, left unpeeled", 
            "1/4 cup olive oil, plus more for tomatoes", 
            "1/4 cup warm water", 
            "1 teaspoon fresh lemon juice", 
            "1 teaspoon kosher salt", 
            "1/4 teaspoon black pepper", 
            "2 3/4 cups vegetable broth", 
            "2 1/4 cups (12 ounces or 340 grams) pearl couscous, sometimes sold as Israeli couscous", 
            "1/2 cup Kalamata or other brine-cured black olives, pitted and chopped", 
            "1/3 cup chopped fresh flat-leaf parsley", 
            "1/4 cup chopped fresh mint", 
            "1 teaspoon chopped fresh thyme"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/pearl-couscous-with-olives-and-roasted-tomatoes.jpg?w=750", 
        "tags": [
            "Grain/Rice", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tomatoes", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/07/pearl-couscous-with-olives-and-roasted-tomatoes/", 
        "title": "pearl couscous with olives and roasted tomatoes", 
        "directions": [
            "\nPrepare tomatoes:  Heat oven to 300°F. Halve tomatoes through stem ends and arrange, cut sides up, in 1 layer on a large baking sheet. Add garlic to pan and drizzle both tomatoes and garlic lightly with oil (about 1 tablespoon). Sprinkle with salt. Roast in middle of oven until tomatoes are slightly shriveled around edges, about 1 hour. Cool in pan on a rack 20 to 30 minutes.", 
            "Meanwhile, make couscous:  Bring broth to a boil in a 3-quart heavy saucepan and stir in couscous, then simmer, uncovered, 6 minutes. Cover pan and remove from heat. Let stand 10 minutes. Spread couscous in one layer on a baking sheet or plate and cool 15 minutes.", 
            "When tomatoes are done, make dressing:  Peel garlic and puree with 1/4 cup oil, water, lemon juice, 1 teaspoon salt, 1/4 pepper, and 1/2 cup roasted tomatoes in a blender until dressing is very smooth. Adjust seasonings to taste.\nAssemble and serve: Transfer cooled couscous to a bowl and stir in olives, roasted tomatoes, herbs, and dressing. Season to taste with more salt and pepper as needed.\nDo ahead: Roasted tomatoes, dressing, and couscous can be made 1 day ahead and kept separately, covered and chilled. Bring to room temperature before proceeding."
        ], 
        "date": "2007-07-24T14:25:33+00:00"
    }, 
    {
        "ingredient_list": [
            "4 pounds small Yukon gold or red-skinned potatoes, quartered", 
            "1 pound green beans, cut into one-inch segments", 
            "1 to 2 small garlic cloves, peeled", 
            "2 bunches of basil (about one ounce each)", 
            "1/4 to 1/2 cup olive oil", 
            "6 tablespoons (or more to taste) mild vinegar, such as champagne, white wine or a white balsamic", 
            "1/4 cup chopped green onions (scallions)", 
            "1/2 cup pine nuts, toasted", 
            "Parmesan cheese to taste", 
            "Salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/pesto-potato-salad-with-green-beans.jpg?w=753", 
        "tags": [
            "Green Beans", 
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/06/pesto-potato-salad-with-green-beans/", 
        "title": "pesto potato salad with green beans", 
        "directions": [
            "Cook potatoes in large pot of boiling salted water until just tender, about 10 minutes. Add beans; cook four minutes longer. Drain well and let cool, then transfer potatoes and beans to a large bowl.", 
            "Meanwhile, discard the stems from the basil and wash and dry the leaves. Puree them in a food processor with garlic, drizzling in enough olive oil that it gets saucy. Season the pesto with salt and pepper. [Alternately, you can swap this step with one cup of prepared pesto, but seriously, I think you’ll be missing out.]", 
            "Toss the beans and potatoes with pesto. Stir in vinegar, green onions, pine nuts and season with salt, pepper and/or additional vinegar to taste. Finally, shave some wide flecks of parmesan over the salad with a vegetable peeler.", 
            "Serve immediately, or make this up to two hours in advance. It can be stored at room temperature."
        ], 
        "date": "2009-06-01T13:58:28+00:00"
    }, 
    {
        "ingredient_list": [
            "Pickling mixture", 
            "1 cup distilled white vinegar", 
            "4 tablespoons sugar", 
            "2 tablespoons Kosher salt", 
            "2 tablespoons yellow mustard seeds", 
            "1 cup cold water", 
            "Slaw mixture", 
            "4 to 5 cups mixed slivered or julienned* firm, raw vegetables (see above for vegetable suggestions, below for slicing tips)", 
            "Optional: Few slivers of jalapeno"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/06/pickled-vegetable-sandwich-slaw.jpg?w=750", 
        "tags": [
            "Photo", 
            "Pickled", 
            "Picnics", 
            "Salad", 
            "Sandwich", 
            "Side Dish", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/06/pickled-vegetable-sandwich-slaw/", 
        "title": "pickled vegetable sandwich slaw", 
        "directions": [
            "Heat vinegar, sugar, salt and mustard seeds to a simmer in a small, non-reactive pot over moderate heat, stirring only until sugar and salt dissolve. Stir in water, which should bring the mixture’s temperature down significantly. Let cool to lukewarm. ", 
            "Divide vegetables between jars. (I used two 3/4 liter jars.) Pour vinegar mixture over vegetables and refrigerate until needed. You’ll find the vegetables to be lightly pickled within an hour, and deliciously pickled within a day. They will get slightly more pickled as they sit, but the change shouldn’t be too dramatic from the 24 hour level.", 
            "Eat with/on sandwiches, aside grilled food and pack it along for picnics — it goes with almost anything. Then make more, because this stuff is habit-forming.", 
            "Do ahead: Mine have kept in the fridge for a month without any change in taste or appearance. Updated to add (thanks, Erika!) that you’ll want to make sure that your vegetables are submerged in the brine for them to keep this long.", 
            "* I used a mix of a sharp knife, a simple mandoline (that includes julienne blades) and a julienne peeler (the Kuhn one), which I was embarrassed to admit I bought last year until I realized how much easier it makes getting juliennes from long, thin vegetables (carrots, cucumbers, parsnips and zucchini). Don’t fret if you don’t have a fancy peeler or mandoline; you can cut thin strips with your knife, then slice them into skinny matchsticks quite easily."
        ], 
        "date": "2013-06-27T11:28:55+00:00"
    }, 
    {
        "ingredient_list": [
            "For the base:", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 teaspoon freshly grated lemon zest", 
            "1/8 teaspoon table salt", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cut into chunks", 
            "1 cup (125 grams) flour", 
            "For the lemonade layer", 
            "1 cup (about 5 ounces or 140 grams) raspberries", 
            "2 large eggs", 
            "3/4 cup (150 grams) granulated sugar", 
            "1/4 cup freshly squeezed lemon juice; this should only require 2 lemons", 
            "1/3 cup (40 grams) all-purpose flour", 
            "Confectioners’ sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Citrus", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/08/pink-lemonade-bars/", 
        "title": "pink lemonade bars", 
        "directions": [
            "Preheat your oven to 350°F (180°C) and line an 8x8x2-inch baking pan with parchment, letting it extend up two sides. Butter or coat the bottom and sides with a nonstick spray and set the pan aside.", 
            "Make the base: In a food processor, pulse together the sugar, zest and salt until combined. Add the butter and pulse until it is evenly dispersed in the dough. Add the flour and pulse the machine until it’s just combined and the mixture is crumbly. Press the dough into the prepared pan and about 1/2-inch up the sides. Don’t worry about making this perfect; mine was an uneven mess and nobody can tell. Bake for 15 minutes, until lightly browned at edges. Let cool on a rack while you prepare the filling (though no need for it to be completely cool when you fill it). Leave oven on.", 
            "Make the pink lemonade layer: Puree the raspberries in your food processor until they’re as liquefied as they’ll get. I don’t even bother cleaning mine between steps, but I’m also probably lazier than you. Run the puree through a fine-mesh sieve, trying to press out all the raspberry puree that you can, leaving the seeds behind. I ended up with 1/3 cup strained puree; don’t worry if you get a smidge less.", 
            "In a medium bowl, whisk together the eggs, sugar and lemon juice until smooth. Whisk in 3 tablespoons of raspberry puree. Stir in flour. Pour into cooling crust and return pan to the oven, baking the bars until they’re set (they’ll barely jiggle) and slightly golden at the edges, about 25 to 30 minutes. Cool completely before cutting into rectangles. (You can speed this up in the fridge.)", 
            "I intended to cut mine into 32 2×1-inch rectangles but actually cut them into 28 2×1-ish rectangles. I like lemony bars small but you could also cut them into 16 2×2-inch squares. Dust with powdered sugar before serving. Store in fridge for up to a week."
        ], 
        "date": "2012-08-03T13:26:11+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups cold water", 
            "1/4 cup plus 1 tablespoon granulated sugar, divided", 
            "1 cup (about 5 ounces) fresh raspberries, blackberries or sliced strawberries", 
            "1 cup lemon juice (from 4 to 6 lemons, depending on size and juicer efficiency)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade1.jpg?w=640", 
        "tags": [
            "Blackberries", 
            "Citrus", 
            "Drinks", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/05/pink-lemonade/", 
        "title": "picnic pink lemonade", 
        "directions": [
            "In a 1-liter carafe, combine water and 1/4 cup granulated sugar and shake it several times. Set this aside in the fridge to chill and dissolve while you prepare the other ingredients.", 
            "Combine your berry of choice with remaining tablespoon of sugar; it’s best to let the strawberries sit with the sugar for 10 minutes to get the color and juices flowing; blackberries and raspberries can be used right away. Blend the berries and sugar until fully pureed, and then a minute longer. Press through a fine-mesh strainer if you, like me, prefer your lemonade without seeds. You should have a generous 1/4 cup of each puree.", 
            "Remove sugar water carafe from the fridge; if sugar hasn’t fully dissolved, give it a few more shakes and it will. Add lemon juice and berry puree. For the pink hues you see above, use 1 tablespoon blackberry puree, 2 tablespoons raspberry puree or 4 tablespoons (or all) of the strawberry puree. If you don’t mind a dark red/purple color and want a stronger black- or raspberry flavor, you can use all of the puree. Extra puree makes an ideal yogurt or yogurt popsicle stir-in, or can be used for additional batches of pink lemonade, because this will go on repeat.", 
            "Give the carafe another shake, and drink right away or chill until your next picnic. ", 
            "A whole bunch of things about lemonade, from an obsessive: "
        ], 
        "date": "2015-05-29T12:03:04+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 ounces (3 tablespoons) gin (Hendricks is specified; Tanqueray was used)", 
            "1 1/2 ounces (3 tablespoons) Pimm’s No. 1 liqueur (what’s Pimm’s?)", 
            "4 ounces (1/2 cup) homemade lemonade (recipe below)", 
            "7-Up or another lemon/lime soda", 
            "10 paper-thin half moon slices of cucumber (I used an “English”, unwaxed, cucumber)", 
            "1 part freshly squeezed lemon juice", 
            "1 part simple syrup, or to taste (I will use perhaps 1/2 or 3/4 of a part next time, see Note above)", 
            "2 parts water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/porch-swing.jpg?w=748", 
        "tags": [
            "Drinks", 
            "Lemon", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/07/porch-swing/", 
        "title": "porch swing", 
        "directions": [
            "Make simple syrup: [Please don’t buy it. I see it in stores and it vexes me.] Simmer one part water with one part sugar (I did a cup of each and ended up with about 1 1/2 cups simple syrup) until sugar has dissolved. Let cool. Or, you can use my speedier method where you simmer one part sugar with half as much water and once it has dissolved, add the second half of the water, cold, which cools the mixture down faster (when you like nothing to slow your pace to the nearest drink)."
        ], 
        "date": "2010-07-06T11:23:29+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (125 grams) all-purpose flour", 
            "1 teaspoon (5 grams) baking powder (the aluminum-free kind, if you can find it)", 
            "Large pinch of salt", 
            "1 cup (200 grams) granulated sugar plus 1 to 2 tablespoon (depending on sweetness of plums)", 
            "1/2 cup (115 grams or 8 tablespoons) unsalted butter, softened", 
            "2 large eggs", 
            "12 smallish purple Italian purple plums, halved and pitted", 
            "2 teaspoons (10 ml) fresh lemon juice", 
            "1 teaspoon or tablespoon ground cinnamon (see Note up top for explanation)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/purple-plum-torte11.jpg?w=640", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fall", 
            "Photo", 
            "Picnics", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/10/purple-plum-torte/", 
        "title": "purple plum torte", 
        "directions": [
            "Heat oven to 350°F. Sift or whisk together flour, baking powder and salt in a medium bowl. In a larger bowl, cream butter and 1 cup sugar together with an electric mixer until fluffy and light in color. Add the eggs, one at a time and scraping down the bowl, then the dry ingredients, mixing until just combined. ", 
            "Spoon batter into an ungreased 9-inch springform pan (but if you’re worried, you can always lightly coat it first with butter or a nonstick spray) and smooth the top. Arrange the plums, skin side up, all over the batter, covering it. Sprinkle the top with lemon juice, then cinnamon, then remaining sugar. ", 
            "Bake until cake is golden and a toothpick inserted into a center part of the cake comes out free of batter (but of course not plum juice), about 45 to 50 minutes. Cool on rack. ", 
            "Once cool, if you can stand it, and I highly recommend trying, leave it covered at room temperature overnight as this cake is even better on the second day, when those plum juices further release into the cake around it, becoming not just “cake with plum,” but cakeplumughyum (official terminology, there). "
        ], 
        "date": "2013-10-11T10:50:35+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups diced leeks, white and light green only (from about 2 large leeks, although I think you can get away with one super-big leek)", 
            "3/4 cup diced onion", 
            "2 1/2 teaspoons olive oil (I needed a tad more)", 
            "1 1/4 cups flour", 
            "1 tablespoon plus 2 teaspoons cornstarch", 
            "Salt", 
            "6 tablespoons butter, diced", 
            "4 eggs, divided", 
            "1/2 cup plus 1 tablespoon heavy cream", 
            "1 cup plus 2 tablespoons sour cream", 
            "Pinch nutmeg", 
            "Pinch pepper", 
            "1 1/2 cups diced ham (1/4 -inch dice; I used about 1/2 pound)", 
            "3/4 cup grated Swiss cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/quiche-lorraine.jpg?w=753", 
        "tags": [
            "Easter", 
            "French", 
            "Leeks", 
            "Meat", 
            "Photo", 
            "Picnics", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2009/10/quiche-lorraine/", 
        "title": "quiche lorraine", 
        "directions": [
            "1. Heat a large sauté pan over low heat. Sauté the leeks and onions in the olive oil 30 to 40 minutes until caramelized, occasionally stirring. Remove from heat and cool.", 
            "2. Meanwhile, in a large bowl, combine the flour, cornstarch and one-fourth teaspoon salt. Cut the butter in with a pastry blender, fork or two knives until it is in very tiny bits. Add one egg (a fork works great for this) and mix it until a dough forms. (Dough can also be made in a food processor, or in theory, and as the original recipe suggests, in a stand mixer.)", 
            "3. On a lightly floured surface, roll the dough out to a 12-inch circle. Place the dough in a 9-inch pie plate (I used an 8-inch deep tart pan, though ended up with extra filling) and press to remove any air bubbles. Crimp the edges, and refrigerate for 30 minutes.", 
            "4. While the quiche shell chills, mix the heavy cream and sour cream in a medium bowl. Whisk in the remaining three eggs. Add a pinch each nutmeg, salt and pepper and combine to form a batter. Preheat the oven to 350 degrees.", 
            "5. Remove the quiche shell from the refrigerator and spread the leek and onion mixture evenly over the base. Sprinkle the ham and then the cheese over the leeks and onions. Pour in the batter and place the quiche in the oven.", 
            "6. Bake until puffed and golden, about 25 to 30 minutes (a deeper pan, such as the one I used, will require extra baking time). Remove from the oven and cool slightly on a rack. Serve warm or at room temperature."
        ], 
        "date": "2009-10-07T11:32:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 lb eggplant, cut into 1/2-inch cubes", 
            "3/4 lb zucchini, cut into 1/2-inch cubes", 
            "10 tablespoons extra-virgin olive oil", 
            "1 teaspoon salt", 
            "1 teaspoon black pepper", 
            "1 cup chopped scallion (from 1 bunch)", 
            "1 1/2 teaspoons ground cumin", 
            "1/2 teaspoon ground coriander", 
            "1/4 teaspoon cayenne (note: I used 1/8 tsp. and it was plenty spicy; adjust to taste)", 
            "1 1/4 cups pearl barley (8 oz)", 
            "1 (14-oz) can reduced-sodium vegetable or chicken broth (1 3/4 cups)", 
            "3/4 cup water", 
            "2 tablespoons fresh lemon juice", 
            "1 garlic clove, minced", 
            "1/4 teaspoon sugar", 
            "1/2 lb cherry tomatoes, quartered", 
            "1/3 cup Kalamata or other brine-cured black olives, pitted and halved", 
            "1/2 cup thinly sliced red onion, rinsed and drained if desired", 
            "1 cup chopped fresh flat-leaf parsley", 
            "1/2 cup chopped fresh mint"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/03/mediterranean-eggplant-and-barley-salad.jpg?w=750", 
        "tags": [
            "Eggplant", 
            "Grain/Rice", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/03/recipe-liberation-day/", 
        "title": "mediterranean eggplant and barley salad", 
        "directions": [
            "Accompaniment: 1 (1/2-lb) piece ricotta salata, cut crosswise into thin slices ", 
            "Roast eggplant and zucchini: Put oven racks in upper and lower thirds of oven and preheat oven to 425°F.", 
            "Toss eggplant and zucchini with 5 tablespoons oil, 3/4 teaspoon salt, and 3/4 teaspoon pepper in a bowl, then spread in 2 oiled large shallow (1-inch-deep) baking pans. Roast vegetables in oven, stirring occasionally and switching position of pans halfway through baking, until vegetables are golden brown and tender, 20 to 25 minutes total. Combine vegetables in 1 pan and cool, reserving other pan for cooling barley.", 
            "Cook barley: Heat 2 tablespoons oil in a 3- to 4-quart heavy pot over moderately high heat until hot but not smoking, then cook scallion, cumin, coriander, and cayenne, stirring, until fragrant, about 1 minute. Add barley and cook, stirring until well coated with oil, 2 minutes more. Add broth and water and bring to a boil. Reduce heat and simmer, covered, until all of liquid is absorbed and barley is tender, 30 to 40 minutes. Remove from heat and let stand, covered, 5 minutes. Transfer to reserved shallow baking pan and spread to quickly cool, uncovered, to room temperature, about 20 minutes.", 
            "Make dressing and assemble salad: Whisk together lemon juice, garlic, sugar, and remaining 1/4 teaspoon salt, 1/4 teaspoon pepper, and 3 tablespoons oil in a large bowl. Add barley, roasted vegetables, and remaining ingredients to bowl with dressing and toss until combined well. Serve with cheese slices.", 
            "Do ahead: Salad can be made 1 day ahead and chilled, covered. Return to room temperature before serving."
        ], 
        "date": "2007-03-15T11:33:27+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "3 3/4 cups (470 grams) all-purpose flour", 
            "1/2 teaspoon fresh orange zest (optional)", 
            "1 1/2 (20 grams) tablespoons granulated sugar", 
            "1 1/2 (9 grams) teaspoons table salt", 
            "1 1/2 cups (12 ounces or 340 grams) unsalted butter, very cold and cut into small cubes", 
            "3/4 to 1 cup buttermilk (or, make your own buttermilk substitute)", 
            "Rhubarb Filling", 
            "1 pound (455 grams) rhubarb stalks, trimmed and cut into 1/2-inch segments", 
            "1/3 cup (65 grams) granulated sugar", 
            "Cream cheese filling", 
            "4 ounces cream cheese, at room temperature (i.e. very soft)", 
            "1/3 cup granulated sugar", 
            "1 teaspoon lemon zest", 
            "2 teaspoons lemon juice", 
            "1 large egg yolk", 
            "To assemble", 
            "1 large egg", 
            "1 tablespoon water", 
            "Coarse sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/rhubarb-cream-cheese-hand-pies1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2013/06/rhubarb-cream-cheese-hand-pies/", 
        "title": "rhubarb cream cheese hand pies", 
        "directions": [
            "Make pie dough: Whisk together flour, zest, sugar and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in 3/4 cup buttermilk with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. If it doesn’t come together, add remaining 1/4 cup buttermilk, 1 tablespoon at a time, until it does, then gently knead again. Divide dough in half. Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day.", 
            "Make rhubarb filling: Place rhubarb and sugar in a small-to-medium saucepan with sugar and stir to combine. Cover and cook at medium-low heat for 15 minutes, no need to stir. Increase the heat to medium, remove the lid and cook for another 10 to 15 minutes, until rhubarb is broken down and ideally thick enough that if you run a spoon across the bottom of the pot, you can see a trench quickly form and disappear. (No need to be overly fussy about this level of thickness, as a little wetter won’t harm your pies.) Spread mixture on a large plate in the fridge or freezer to cool quickly, then scrape into a bowl. Keep cold until needed; it will be thicker and easier to “scoop” onto the pie bases.", 
            "Make cream cheese filling: Whisk cream cheese, sugar, zest, juice and yolk together in a small bowl until smooth. Keep cold until needed as well.", 
            "Assemble pies: Heat oven to 400 degrees. Line two to three baking sheets with parchment paper. Beat your remaining egg and 1 tablespoon water and keep aside with a pastry brush. ", 
            "Flour the heck out of your counter, unwrap the first half of your dough and start rolling your dough by pressing down lightly with the pin and moving it from the center out. You’re not going to get it all flat in one roll or even twenty; be patient and it will crack less. Roll it a few times in one direction, lift it up and rotate it a quarter-turn. Continue to do, roll a couple times, lifting the dough and rotating it until the dough is just shy of 1/8-inch thick. Cut dough into 2 3/4-inch to 3-inch squares. (I had a 2 3/4-inch fluted cutter from this set. A knife, pizza wheel or even fluted pastry wheel would be sufficient.) ", 
            "Deb’s #1 Most Essnetial Pie Tip: No mushy pie dough! If your dough becomes soft (it’s a hot day or warm kitchen, aka summer) now or at any point in the assembly process, slide the dough squares onto a prepared baking sheet and freeze them for a couple minutes until they’re semi-firm again; it will make assembly less frustrating. Promise.", 
            "Brush half the squares very, very lightly with the egg wash; these will be your bases. Cut a small vent in the other half of the squares; these will be your lids. In the center of each egg washed square, put a small dollop (a measured teaspoon) of cream cheese, then rhubarb filling on top. Be ye not tempted to fill them more as they become almost impossible to seal without leakage, and why should your baking sheet get all the good stuff? Top each filled base with a vented square. Press outer edge of top and bottom all around to seal with your fingertips; a fork will work as well. Transfer pie to a baking sheet, spacing 1-inch apart. Brush the tops with egg wash and sprinkle generously with coarse sugar. Repeat with remaining dough, including second half from fridge, and fillings.", 
            "Bake for 15 to 20 minutes, until puffed and golden, and even more brown at edges. Transfer to cooling racks and cool to room temperature before serving. Okay, well, good luck with that. "
        ], 
        "date": "2013-06-07T13:08:29+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "1 1/4 pound (565 grams) rhubarb, trimmed and cut into 1/2-inch lengths on the diagonal", 
            "1 1/3 cup (265 grams) granulated sugar, divided", 
            "1 tablespoon lemon juice (psst, skip ahead and zest it for the cake before you cut it)", 
            "1/2 cup (1 stick, 4 ounces or 115 grams) unsalted butter, softened", 
            "1/2 teaspoon finely grated lemon zest", 
            "2 large eggs", 
            "1 1/3 cups (165 grams) all-purpose flour", 
            "1 teaspoon baking powder", 
            "3/4 teaspoon table salt", 
            "1/4 teaspoon ground ginger", 
            "1/3 cup (80 grams) sour cream", 
            "Crumb", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 cup (50 grams) light brown sugar", 
            "1/8 teaspoon table salt", 
            "1/4 teaspoon ground cinnamon", 
            "4 tablespoons (1/2 stick, 2 ounces, or 55 grams) unsalted butter, melted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/rhubarb-snacking-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/05/rhubarb-snacking-cake/", 
        "title": "rhubarb snacking cake", 
        "directions": [
            "Make the cake: Preheat your oven to 350°F. Coat the bottom and sides of a 9×13-inch baking pan with butter or a nonstick cooking spray, then line the bottom with parchment paper, extending the lengths up two sides. (It will look like a sling). Stir together rhubarb, lemon juice and 2/3 cup sugar and set aside. Beat butter, remaining sugar and lemon zest with an electric mixer until light and fluffy. Add eggs, one at at time, scraping down the sides after each addition. Whisk together flour, baking powder, 3/4 teaspoon table salt and ground ginger together in a small bowl. Add one-third of this mixture to the batter, mixing until just combined. Continue, adding half the sour cream, the second third of the flour mixture, the remaining sour cream, and then the remaining flour mixture, mixing between each addition until just combined. ", 
            "Dollop batter over prepared pan, then use a spatula — offset, if you have one, makes this easiest — to spread the cake into an even, thin layer. Pour the rhubarb mixture over the cake, spreading it into an even layer (most pieces should fit in a tight, single layer). ", 
            "Stir together the crumb mixture, first whisking the flour, brown sugar, table salt and cinnamon together, then stirring in the melted butter with a spoon or fork. Scatter evenly over rhubarb layer. Bake cake in preheated oven for 50 to 60 minutes. The cake is done when a tester comes out free of the wet cake batter below. It will be golden on top. Cool completely in the pan on a rack. ", 
            "Cut the two exposed sides of the cake free of the pan, if needed, then use the parchment “sling” to remove the cake from the pan. Cut into 2-inch squares and go ahead and eat the first one standing up. (If it’s written into the recipe, it’s not “sneaking” a piece but, in fact, following orders, right?) Share the rest with friends. Cake keeps at room temperature for a few days, but I didn’t mind it at all from the fridge, where I kept it covered tightly. "
        ], 
        "date": "2012-05-29T12:28:00+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds medium red-skinned potatoes, unpeeled, scrubbed", 
            "8 dill pickle spears or a handful of cornichon, coarsely chopped (about 1 1/2 cups)", 
            "3 celery stalks, chopped (about 1 cup)", 
            "1 small red onion, chopped (about 1 cup)", 
            "3 hard-boiled eggs, peeled, chopped", 
            "2/3 cup mayonnaise", 
            "2 tablespoons Dijon mustard", 
            "2 tablespoons apple cider vinegar", 
            "2 tablespoons minced fresh dill", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/roseanne-cash-all-american-potato-salad.jpg?w=750", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2007/07/rosanne-cash-all-american-potato-salad/", 
        "title": "rosanne cash’s all-american potato salad", 
        "directions": [
            "A few hours before serving or, even better, the day before: Place potatoes in medium-sized pot and cover with a few inches of salted water. Bring to a boil and cook until fork-tender, about 30 minutes. Drain and cool completely. (Overnight in the fridge makes this easy, and the potatoes even easier to slice cleanly the next day.)\nTo assemble and serve: Cut cooled potatoes into chunks and transfer to large bowl. Add pickles, celery, onion, and eggs. Combine mayonnaise, mustard, vinegar, and dill in a jar. Stir about half of dressing into salad, tossing to combine evenly. Add more dressing to taste, and season well with salt and pepper.", 
            "Do ahead: Keep dressing and vegetables separate until just before serving. Potato salad keeps for up to 4 days in fridge. Leftover dressing should keep for a couple weeks."
        ], 
        "date": "2007-07-05T23:23:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (4 ounces or 113 grams) unsalted butter, at room temperature", 
            "2 tablespoons (25 grams) granulated sugar", 
            "2 tablespoons (25 grams) turbinado sugar (aka Sugar in the Raw; you can use more brown or white if you don’t have this, but the subtle crunch it adds is delightful)", 
            "3/4 cup plus 2 tablespoons (165 grams) packed light or dark brown sugar", 
            "1 large egg", 
            "1 teaspoon vanilla extract", 
            "3/4 teaspoon baking soda", 
            "Heaped 1/4 teaspoon (or, technically, 1/4 + 1/8 teaspoon) fine sea or table salt", 
            "1 3/4 cups (220 grams) all-purpose flour", 
            "1/2 pound (225 grams) semi- or bittersweet chocolate, cut into roughly 1/2-inch chunks with a serrated knife", 
            "Flaky sea salt, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/salted-chocolate-chunk-cookies1.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Photo", 
            "Picnics"
        ], 
        "url": "https://smittenkitchen.com/2015/04/salted-chocolate-chunk-cookies/", 
        "title": "salted chocolate chunk cookies", 
        "directions": [
            "Heat oven to 360°F (180°C) and line a baking sheet with parchment paper or a silicon baking mat.", 
            "In a large bowl, cream the butter and sugars together with an electric mixer until very light and fluffy, about 5 minutes. Add egg and vanilla, beating until incorporated, and scraping down the bowl as needed. Beat in salt fine sea or table salt and baking soda until combined, then the flour on a low speed until just mixed. The dough will look crumbly at this point. With a spatula, fold/stir in the chocolate chunks. ", 
            "Scoop cookies into 1 1/2 tablespoon (I used a #40 scoop) mounds, spacing them apart on the prepared baking sheet. Sprinkle each with a few flakes of sea salt. Bake for 11 to 12 minutes, until golden on the outside but still very gooey and soft inside. Out of the oven, let rest on baking sheet out of the for 5 minutes before transferring a cooling rack.", 
            "Extra dough — I know, what’s that?! — can be formed into scoops and frozen on a sheet until solid, then transferred to a freezer bag. I’ve baked these right from the freezer; they need, at most, 1 minute more baking time. You could also form them into a 2-inch log, freeze it, and slice and bake the cookies off as desired. The only difference I’ve noted between the cookies baked right away and those baked a day or more later is that the older cookie dough is less puffy when baked. "
        ], 
        "date": "2015-04-23T12:00:28+00:00"
    }, 
    {
        "ingredient_list": [
            "2 medium eggplants (about 1 pound each)", 
            "2 tablespoons olive oil, divided", 
            "1 teaspoon coarse or kosher salt, or to taste", 
            "6 tablespoons tahini (sesame seed paste), well-stirred if a new container", 
            "2 garlic cloves, peeled and minced or pressed", 
            "Juice of 1 lemon, plus more to taste, if desired", 
            "Pinch of cayenne or aleppo pepper", 
            "Pinch or two of ground cumin", 
            "2 tablespoons well-chopped flat-leaf parsley, divided", 
            "Toasted sesame seeds or za’atar for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/smoky-eggplant-dip1.jpg?w=640", 
        "tags": [
            "Eggplant", 
            "Middle Eastern", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/08/smoky-eggplant-dip/", 
        "title": "smoky eggplant dip", 
        "directions": [
            "Heat oven to 375°F. Brush a baking sheet or roasting pan with 1 tablespoon olive oil, and sprinkle with 1 teaspoon salt. Prick eggplants a few times with a fork or tip of a knife. Over a gas flame, grill or under a broiler, evenly char the skin of your eggplants. I like mine quite smoky and like to leave no purple visible. Transfer to a cutting board, and when cool enough to handle, trim off stem and cut lengthwise. Place cut side down on prepared baking sheet and roast for 30 to 35 minutes, until very, very tender when pressed. Let cool to room temperature.", 
            "In a blender or food processor: Scrape eggplant flesh from skin and into the work bowl. Add tahini, lemon, cayenne, cumin and 1 tablespoon parsley. Blend in short bursts (pulses) until combined but still coarsely chopped. ", 
            "By hand: Scrape eggplant flesh from skin and onto a cutting board. Finely chop the eggplant, leaving some bits closer to pea-sized. In a bowl, whisk together tahini, garlic, lemon, cayenne, cumin and half the parsley. Add chopped eggplant and stir to combine. ", 
            "Both methods: Taste and adjust ingredients if needed. I usually need more salt and lemon.", 
            "To serve: Spoon into a bowl and drizzle with remaining tablespoon of olive oil. Scatter with second tablespoon of parsley, and some toasted sesame seeds or za’atar, if desired. Serve with pita wedges.", 
            "For a big delicious summer meal, you could serve this with a tomato-cucumber salad, ethereally smooth hummus and pita wedges. If you’d like to be fancy, grilled or pan-roasted lamb chops are wonderful here too. (I use this method, but just season them with salt, pepper, lemon zest and dried oregano these days. I finish them with a squeeze of lemon juice.)"
        ], 
        "date": "2014-08-19T11:13:53+00:00"
    }, 
    {
        "ingredient_list": [
            "6 cups sour cherries, pitted (fresh or frozen will work; if frozen, defrost and drain first)", 
            "3/4 to 1 1/4 cups of sugar*", 
            "1/4 cup cornstarch", 
            "Juice of half a lemon", 
            "Pinch or two of salt", 
            "2 tablespoons heavy cream or one egg, beaten with a tablespoon of water", 
            "Glaze:", 
            "1 cup confectioners’ sugar", 
            "1 to 2 tablespoons milk or water or 1 tablespoon water plus 1 tablespoon lemon juice (I did this to make the glaze more interesting)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/3750059011_2643b0d11d_o.jpg?w=753", 
        "tags": [
            "Cherries", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/07/sour-cherry-slab-pie/", 
        "title": "sour cherry slab pie", 
        "directions": [
            "Preheat oven to 375°. In a large bowl, combine cherries, sugar, cornstarch, lemon juice, and salt. Stir to combine; set aside.", 
            "On a lightly floured surface, roll out the larger piece of dough into an 18-by-12-inch rectangle. I won’t lie: this can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible (and tossing it in the freezer for a couple minutes  if it softens too quickly; it is summer afterall) and using enough flour that it doesn’t stick to the counter. [See more of my pie-rolling tips here.]", 
            "Transfer to a 15-by-10-by-1-inch rimmed baking sheet, (pastry will hang over sides of pan). I went ahead and lined mine with parchment, just to ensure I’d be able to easily lift it out. Pour cherry mixture into lined baking sheet; set aside.", 
            "On a lightly floured surface, roll out remaining piece of dough into a 16-by-11-inch rectangle. Drape over filling. Bring bottom pastry up and over top pastry. Pinch edges to seal. Using a fork, prick top crust all over. Brush with heavy cream or egg wash.", 
            "Bake until crust is golden and filling is bubbling, 40 to 55 minutes. Transfer to a wire rack until just warm to the touch, about 45 minutes.", 
            "In a medium bowl, stir together confectioners’ sugar and milk, water or lemon juice (or combination thereof) until desired glaze consistency is achieved. Use a spoon to drizzle over top. Serve warm or room temperature.", 
            "* Martha had suggested 1 to 1 1/2 cups sugar for 6 cups of sour cherries. I balked, imagining my beautiful Jersey cherries drowning a syrupy death, and used 3/4 cup, which yielded a lightly-sweetened pie with the tartness of the cherries still coming through, just as we like. Please adjust this to your tastes, and according to the tartness of the cherries you brought home.", 
            "Some tips for replacing the sour cherries with other fruit: This pie is roughly 100% of a regular pie filling with 150% percent of the crust. Thus, if you’re looking to use something besides sour cherries, you can swap in 6 cups of any other fruit. Adjust the sugar accordingly — you’ll probably want less sugar with peaches or berries than you would with very sour cherries, or the same amount, if you like your pies on the sweeter side. (Remember, I kept this one very lightly sweetened.) Adjust the cornstarch accordingly too — peaches and berries usually let off more liquid than apples, but only slightly more than cherries.", 
            "One other route you can take is to use the filling part of your favorite pie recipe, as most standard fruit pies contain 6 cups of berries or chopped fruit. This way you’ll already know what spices, if any, you want to add and that the amount of sweetener and/or cornstarch/thickener is already spot-on. ", 
            "And do share your tweaks in the comments: I am sure that others would love to benefit from your experimentation!"
        ], 
        "date": "2009-07-24T14:39:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3-ounce package cream cheese, room temperature", 
            "1/3 cup half and half (or milk)", 
            "3 eggs", 
            "1 10-ounce package frozen chopped spinach, thawed and drained", 
            "1/2 cup grated cheddar (gruyere works well, too)", 
            "1/4 cup grated Parmesan", 
            "4 to 6 green onions, thinly sliced (1/2 cup finely diced red or white onion or shallots work as well)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spinach-quiche-revisited1.jpg?w=640", 
        "tags": [
            "Easter", 
            "Freezer Friendly", 
            "Photo", 
            "Picnics", 
            "Spinach", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2008/09/spinach-quiche-revisited/", 
        "title": "spinach quiche, revisited", 
        "directions": [
            "Preheat oven to 425°. Beat cream cheese in medium bowl until smooth. Gradually beat in half and half and eggs. Mix in remaining ingredients. Pour mixture into prepared crust. Bake until crust is golden brown and filling is set, about 25 minutes. Cool 10 minutes before serving."
        ], 
        "date": "2008-09-14T12:58:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 2/3 cups (215 grams) all-purpose flour", 
            "3/4 teaspoon kosher salt", 
            "12 tablespoons (170 grams) cold unsalted butter, diced", 
            "3 tablespoons (45 grams) very cold water", 
            "Nonstick spray oil, for coating pan", 
            "3/4 cup (176 grams, 6 ounces, or 3/4 of an 8-ounce brick) cream cheese, soft at room temperature", 
            "2/3 cup (155 ml) half-and-half or 1/3 cup each whole milk and heavy cream", 
            "6 large eggs", 
            "2 10-ounce (283-gram) packages frozen chopped spinach, thawed", 
            "1 cup (115 grams or 4 ounces) grated cheddar or gruyere", 
            "1/2 cup (50 grams) finely grated Parmesan", 
            "1 small bundle (2 to 3 ounces or about 8 thin green onions) thinly sliced", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/spinach-sheet-pan-quiche.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Casserole", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Spinach", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/11/spinach-sheet-pan-quiche/", 
        "title": "spinach sheet pan quiche", 
        "directions": [
            "Make crust: In a food processor, blend flour and salt together. Add butter and pulse machine until butter is reduced to a fine meal, or couscous-sized bits. While running machine, drizzle in water; stop when dough has balled, a few seconds later.\nWrap dough in plastic or waxed paper and set in freezer to quick-chill until firm but not rock-hard, about 15 to 20 minutes. You can also chill it in the fridge for 2 hours or up to 1 week until needed.\nLightly coat a 9×13-inch (quarter-sheet) pan with oil. Line bottom with parchment paper.\nTo roll out crust (trickier, but go for it if you’re up for the challenge): Flour your counter well. Remove crust from freezer or fridge, unwrap and flour the top of it. Even if it’s very hard, begin rolling it very gently, in light motions, so it doesn’t crack too much as you stretch it out, to about a 12×16-inch rectangle. Keep flouring top and counter underneath dough as it is prone to sticking. Work as quickly as possible because this dough softens even more than regular pie dough as it warms.\nTransfer dough to prepared pan. Lift overhang to let dough slack/droop into corners so you’re not stretching it a lot to shape it to the pan. Trim overhang to 1/2- to 1-inch, then fold overhang onto sides of dough, pressing all around and letting the dough extend slightly over the edge of the pan.\nTo press in crust (less tricky, and what I always wish I’d done): Press dough in an even layer across bottom of pan; leave it thicker as it goes up the sides; pressing all around and letting the dough extend slightly over the edge of the pan.\nBoth methods: Freeze shaped dough until solid, about 20 minutes. Save your scraps! You can use them to patch any holes or cracks formed when baking.\nMeanwhile, heat oven to 425 degrees F. Coat a large sheet of foil lightly with spray oil. Once crust is solid, prick it all over with a fork and press foil, oiled side down, tightly against dough. Fill foiled crust to the top with pie weights, dried beans or rice (that you don’t plan to eat at any time) or even pennies. Bake for 20 minutes then gently, carefully remove foil and weights and bake for 5 more minutes, unfilled.\nWhile crust par-bakes, make filling: Use an electric mixer or your best whisking skills to beat cream cheese in the bottom of a large bowl until smooth and fluffy. Gradually drizzle in half-and-half, whisking the whole time so that the mixture incorporates smoothly. Whisk in eggs, two at a time, until combined. Squeeze out spinach in handfuls, removing as much extra moisture as possible. Stir in spinach, cheddar, parmesan, scallions, salt and pepper.\nWhen crust has finished parbaking, leave oven on. Inspect crust for cracks or holes and use reserved dough to patch them if necessary. Pour in filling just to the top of the crust. You will probably have about 3/4 cup more filling than you can fit in the crust (not an issue if going crust-less or if you didn’t parbake the crust); you can bake this off in a separate oiled dish for an excellent breakfast on toast tomorrow.\nBake quiche until crust is golden brown and filling is set, about 25 minutes. Cool at least 10 minutes before serving. Quiche keeps in fridge for 4 to 5 days."
        ], 
        "date": "2016-11-28T13:12:54+00:00"
    }, 
    {
        "ingredient_list": [
            "For the croutons:", 
            "1/4 cup olive oil", 
            "2 cloves garlic, finely chopped", 
            "6 cups day-old bread, crust removed, cubed", 
            "6 tablespoons finely grated Parmesan, plus more for garnish", 
            "Salt and freshly ground black pepper", 
            "For the vinaigrette:", 
            "Half a red onion, finely diced", 
            "2 to 2 1/2 tablespoons champagne or white wine vinegar", 
            "Juice of half a lemon", 
            "1/4 cup olive oil", 
            "1/2 teaspoon Dijon mustard", 
            "For the salad:", 
            "4 large leeks", 
            "2 teaspoons salt", 
            "1 pound asparagus", 
            "1 19-ounce can of white beans, rinsed and drained or 1 1/2 cups cooked white beans"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/04/spring-panzanella.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Beans", 
            "Leeks", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spring", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/04/spring-panzanella/", 
        "title": "spring panzanella", 
        "directions": [
            "Preheat oven to 400°F.", 
            "Mix the bread cubes with the garlic, olive oil, parmesan, salt and pepper in a large bowl. Toss to coat well. Transfer bread to a baking sheet and sprinkle with salt and pepper. Bake stirring once or twice, until the croutons are crisp and lightly colored on the outside but still soft within, about 10 to 15 minutes. Set aside and let cool.", 
            "Mix the red onion with the vinegar and lemon juice in a small bowl and set aside for a few minutes before whisking in the remaining vinaigrette ingredients: olive oil and dijon. Set aside.", 
            "Cut off dark green tops of leeks and trim root ends. Halve each leek lengthwise to within 2 inches of root end. Rinse well under cold running water to wash away sand. Cover leeks with cold water in a 12-inch heavy skillet. Add salt and simmer leeks, uncovered, until tender, 15 to 20 minutes.", 
            "Without draining the cooking water (you will reuse it for the asparagus), transfer leeks to a bowl of ice and cold water to stop cooking, then pat the leeks dry with paper towels. Break off tough ends of asparagus and cook it in the boiling water until crisp-tender, no more than three minutes if they’re pencil-thin, more if your asparagus is thicker. Transfer it to another bowl of ice water, drain and pat it dry.", 
            "Cut the leeks and the asparagus each into one-inch segments–the leeks will be especially slippery and prone to separating; hold firm and use a sharp knife! Place pieces in a large bowl and mix in beans and cooled parmesan croutons. Pour vinaigrette over and toss well. Season with salt and pepper. "
        ], 
        "date": "2008-04-04T12:26:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (12-ounce) 1-inch thick New York strip boneless beef top loin steak", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "Olive oil", 
            "2 yellow onions, sliced in rings", 
            "1/2 teaspoon fresh thyme leaves", 
            "Mustard Mayo, recipe follows", 
            "2 mini focaccia buns, sliced in 1/2 (we used a small ciabatta)", 
            "1/2 cup baby arugula", 
            "1/3 cup good mayonnaise", 
            "2 tablespoons Dijon mustard", 
            "1 tablespoon whole-grain mustard", 
            "2 tablespoons sour cream", 
            "1/8 teaspoon kosher salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/steak-sandwiches1.jpg?w=500", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Picnics", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2009/02/steak-sandwiches/", 
        "title": "steak sandwiches", 
        "directions": [
            "Whisk the ingredients together in a small bowl. Serve at room temperature."
        ], 
        "date": "2009-02-28T17:00:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (80 grams) rolled oats", 
            "3/4 cup (95 grams) plus up to 2 tablespoons (15 grams) extra all-purpose flour", 
            "1/2 cup (95 grams) light brown sugar", 
            "Heaped 1/4 teaspoon table salt", 
            "6 tablespoons (85 grams) unsalted butter, melted", 
            "1 teaspoon cornstarch (optional, but helps firm up the filling)", 
            "1 tablespoon (15 ml) lemon juice", 
            "1 tablespoon (15 grams) granulated sugar, divided", 
            "1 cup (125 grams) small-diced rhubarb (from about 1 1/2 medium stalks)", 
            "1 cup (155 grams) small-diced strawberries", 
            "Powdered sugar, for decoration, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/strawberry-rhubarb-crisp-bars1.jpg?w=640", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Crumbles/Crisps", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Rhubarb", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/05/strawberry-rhubarb-crisp-bars/", 
        "title": "strawberry rhubarb crisp bars", 
        "directions": [
            "Heat oven to 375 degrees F. For easy removal, line bottom and two sides of 8-by-8-inch square baking pan with parchment paper. No need to bother (and no greasing needed) if you plan to serve them right in the pan, as I did. ", 
            "Place oats, 3/4 cup flour, brown sugar and salt in bottom of baking pan and mix. Pour melted butter over, and stir until clumps form. If the clumps feel soft or look overly damp, add the remaining 2 tablespoons flour. Set aside 1/2 cup of the crumble mixture. Press the rest of the crumb mixture evenly in the bottom of the pan.", 
            "Spread half the fruit over the crust. Sprinkle it evenly with cornstarch, then lemon juice, and 1/2 tablespoon of granulated sugar. Spread remaining fruit over this, and top with second 1/2 tablespoon sugar. Scatter reserved crumbs over fruit and bake bars for 30 to 40 minutes (firmer fruits will take longer), until fruit is bubbly and crisp portion is golden and smells toasty and amazing. ", 
            "Let cool in pan; I do this in the fridge, where they become crisp once chilled (less so at room temperature). Cut into squares and sprinkle with powdered sugar before serving. Store leftovers in fridge."
        ], 
        "date": "2014-05-09T11:20:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound strawberries, stems removed and halved", 
            "1 pound rhubarb, chopped into 1/2-inch segments", 
            "1 cup granulated sugar", 
            "1 cup water", 
            "1 lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/strawberry-rhubarb-soda-syrup1.jpg?w=750", 
        "tags": [
            "Drinks", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2015/04/strawberry-rhubarb-soda-syrup/", 
        "title": "strawberry rhubarb soda syrup", 
        "directions": [
            "Combine strawberries, rhubarb, sugar and water in a large saucepan. Remove several strips of peel from lemon with a knife or peeler and add them to the pot. Bring mixture to a boil and then reduce it to a gentle simmer. Simmer for 20 minutes, or until fruit has completely collapsed, stirring occasionally. Remove from heat, add the juice of half the lemon (or more, to taste) and let fruit cool in syrup for maximum infusion. Once cool, pour mixture through a fine-mesh strainer (or, if you only have a coarse one, line it with cheesecloth or a lint-free towel); press solids with the back of a spoon or spatula to get the most syrup from them. You should have 2 cups right away, but I had to run an errand, left mine sitting in the strainer and was delighted to find 3 full cups of syrup when I got back. Pour into a glass bottle and chill until needed. ", 
            "Save fruit pulp in a separate container; it can be used to stir into plain yogurt, oatmeal or even dollop on pancakes. (Be sure to fish out or at least look out for lemon peels if you do.)", 
            "To make 1 glass of soda, pour 2 tablespoons of the syrup in the bottom of a glass, fill with ice and then seltzer or sparkling water. Give it a stir and add more syrup to taste; for a large glass, you might use up to 2 tablespoons more. Garnish with a lemon wedge, if you wish. Drink and pretend it’s spring.", 
            "Do ahead: Syrup should keep in the fridge for at least three weeks, if not longer. "
        ], 
        "date": "2015-04-10T11:53:51+00:00"
    }, 
    {
        "ingredient_list": [
            "6 tablespoons (85 grams) unsalted butter, at room temperature, plus extra for pie plate", 
            "1 1/2 cups (188 grams) all-purpose flour (can swap 3/4 cup or 94 grams all-purpose flour with 3/4 cup or 75 grams of barley flour, see Note)", 
            "1 1/2 teaspoons baking powder", 
            "1/2 teaspoon table salt", 
            "1 cup (200 grams) plus 2 tablespoons (25 grams) granulated sugar", 
            "1 large egg", 
            "1/2 cup (118 ml) milk", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 pound (450 grams) strawberries, hulled and halved"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/5752837495_242b649dbf_o.jpg?w=750", 
        "tags": [
            "Everyday Cakes", 
            "Photo", 
            "Picnics", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2011/05/strawberry-summer-cake/", 
        "title": "strawberry summer cake", 
        "directions": [
            "Preheat oven to 350°F (180°C). Butter a 10-inch pie pan or 9-inch deep-dish pie pan (what I used). I did not test this with a standard 9-inch pie plate but looking at the margin of space leftover in my deep-dish pan after baking the cake, I suspect you’d be safe. Updated 6/13/11: This cake does not work in a standard 9-inch pie pan; it will overflow. Big apologies to anyone who learned the hard way! This cake would work, however, in a 9- or 10-inch springform or cake pan. The 10-inch would make a thinner cake than pictured.\nWhisk flour or flours, baking powder and salt together in a small bowl. In a larger bowl, beat butter and 1 cup sugar until pale and fluffy with an electric mixer, about 3 minutes. Mix in egg, milk and vanilla until just combined. Add dry mixture gradually, mixing until just smooth.\nPour into prepared pie plate. Arrange strawberries, cut side down, on top of batter, as closely as possible in a single layer (though I had to overlap a few to get them all in). Sprinkle remaining 2 tablespoons sugar over berries.\nBake cake for 10 minutes then reduce oven temperature to 325°F and bake cake until golden brown and a tester comes out free of wet batter, about 50 minutes to 60 minutes. (Gooey strawberries on the tester are a given.) Let cool in pan on a rack. Cut into wedges. Serve with lightly whipped cream.\nDo ahead: Cake can be stored at room temperature for up to 2 days, loosely covered, but good luck with that.\n"
        ], 
        "date": "2011-05-23T22:01:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound of small pasta (I used shells because I imagined the peas would nest in there and gah, such cuteness)", 
            "1/4 pound snow pea pods, ends trimmed", 
            "1/2 pound fresh summer peas, which yielded about 1 cup once shelled", 
            "3/4 to 1 cup Roasted Red Pepper Vinaigrette (recipe below)", 
            "1 red bell pepper, roasted, skinned and seeded or the equivalent from a jar, drained", 
            "1/4 cup olive oil", 
            "2 tablespoons red wine vinegar (and up to 2 tablespoons more if you, like us, like that extra bite in your dressing)", 
            "1 tablespoon chopped shallot (about 1 small)", 
            "1/2 teaspoon salt", 
            "Several grinds of black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/summer-pea-and-roasted-red-pepper-pasta-salad1.jpg?w=500", 
        "tags": [
            "Pasta", 
            "Peas", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/08/summer-pea-and-roasted-red-pepper-pasta-salad/", 
        "title": "summer pea and roasted red pepper pasta salad", 
        "directions": [
            "Puree the red bell pepper in a food processor or blender as much as possible, then add the remaining ingredients and running the machine until the dressing is silky smooth. Adjust the vinegar level and seasonings to taste."
        ], 
        "date": "2009-08-08T08:35:26+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons good olive oil", 
            "1 small French bread or boule, cut into 1-inch cubes (6 cups)", 
            "1 teaspoon kosher salt", 
            "2 large ripe tomatoes, cut into 1-inch cubes", 
            "1 hothouse cucumber, unpeeled, seeded, and sliced 1/2 inch thick", 
            "2 bell peppers, seeded and cut into 1-inch cubes (I like to use a combination of purple or yellow or orange, to nicely colorize the dish)", 
            "1/2 red onion, cut in half and thinly sliced", 
            "20 large basil leaves, coarsely chopped", 
            "3 tablespoons capers, drained", 
            "For the vinaigrette", 
            "1 teaspoon finely minced garlic", 
            "1/2 teaspoon Dijon mustard", 
            "3 tablespoons champagne vinegar", 
            "1/3 cup good olive oil", 
            "1/2 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/summers-last-hurrah-panzanella-e1472056230782.jpg?w=753", 
        "tags": [
            "Cucumber", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/09/summers-last-hurrah-panzanella/", 
        "title": "summer’s last hurrah panzanella", 
        "directions": [
            "Heat the oil in a large saute pan. Add the bread and salt; cook over low to medium heat, tossing frequently, for 10 minutes, or until nicely browned. Add more oil as needed.", 
            "For the vinaigrette, whisk together the ingredients.", 
            "In a large bowl, mix the tomatoes, cucumber, red pepper, yellow pepper, red onion, basil, and capers. Add the bread cubes and toss with the vinaigrette. Season liberally with salt and pepper.", 
            "Serve immediately, or allow the salad to sit for about half an hour for the flavors to blend."
        ], 
        "date": "2008-09-21T12:05:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound plum or roma tomatoes, stemmed and cut in half", 
            "1 or 2 jalapeños (depending on how hot you want the salsa), stemmed and cut in half", 
            "2 cloves garlic, peeled", 
            "Salt and pepper, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/three-ingredient-summertime-salsa1.jpg?w=640", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Quick", 
            "Summer", 
            "Tex-Mex", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/07/three-ingredient-summertime-salsa/", 
        "title": "three-ingredient summertime salsa", 
        "directions": [
            "Turn on your broiler and place a rack five inches away from the heating element. Line a skillet or baking sheet with foil and place the tomatoes, jalapeño halves and garlic on the skillet; season with salt. Cook under the broiler for five minutes (this, and all broiling steps, took much longer in my weak oven), or until the jalapeño and garlic have brown spots. Remove the jalapeño and garlic from the skillet and place in a blender.", 
            "Meanwhile, return the skillet to the oven and continue to broil the tomatoes for five more minutes, or until they have browned on top. Remove the tomatoes from the oven and add them to the blender, also pouring into the blender any juices that may be in the skillet. Begin to pulse on a low speed until the salsa reaches your desired texture; I usually add about 2 tablespoons water to loosen mine — you may need up to 1/4 cup, or more, for a thinner salsa. Adjust salt and pepper to taste. Eat with everything."
        ], 
        "date": "2014-07-29T11:21:58+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups all-purpose flour", 
            "1 tablespoon baking powder", 
            "1 3/4 teaspoons salt, divided", 
            "3/4 stick (6 tablespoons or 3 ounces) cold unsalted butter, cut into 1/2-inch cubes, plus 2 teaspoons melted", 
            "3/4 cup whole milk", 
            "1/3 cup mayonnaise", 
            "2 tablespoons fresh lemon juice", 
            "1 3/4 pounds beefsteak tomatoes", 
            "1 1/2 cups corn (from about 3 ears), coarsely chopped by hand (my preference) or lightly puréed in a food processor, divided", 
            "2 tablespoons finely chopped basil, divided (skipped this, no harm was done)", 
            "1 tablespoon finely chopped chives, divided", 
            "1/4 teaspoon black pepper, divided", 
            "7ounces coarsely grated sharp Cheddar (1 3/4 cups), divided"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/08/tomato-and-corn-pie.jpg?w=752", 
        "tags": [
            "Corn", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Quiche", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/08/tomato-and-corn-pie/", 
        "title": "tomato and corn pie", 
        "directions": [
            "Whisk together flour, baking powder, and 3/4 tsp salt in a bowl, then blend in cold butter (3/4 stick) with your fingertips or a pastry blender until it resembles coarse meal. Add milk, stirring until mixture just forms a dough, then gather into a ball.", 
            "Divide dough in half and roll out one piece on a well-floured counter (my choice) or between two sheets of plastic wrap (the recipe’s suggestion, but I imagined it would annoyingly stick to the plastic) into a 12-inch round (1/8 inch thick). Either fold the round gently in quarters, lift it into a 9-inch pie plate and gently unfold and center it or, if you’re using the plastic warp method, remove top sheet of plastic wrap, then lift dough using bottom sheet of plastic wrap and invert into pie plate. Pat the dough in with your fingers trim any overhang.", 
            "Preheat oven to 400°F with rack in middle. If your kitchen is excessively warm, as ours is, go ahead and put the second half of the dough in the fridge until you’re ready to use it. Whisk together mayonnaise and lemon juice.", 
            "Cut an X in bottom of each tomato and blanch in a large pot of boiling water 10 seconds. Immediately transfer with a slotted spoon to an ice bath to cool. Peel tomatoes, then slice crosswise 1/4 inch thick and, if desired (see Notes above recipe), gently remove seeds and extra juices. Arrange half of tomatoes in crust, overlapping, and sprinkle with half of corn, one tablespoon basil, 1/2 tablespoon chives, 1/2 teaspoon salt, 1/8 teaspoon pepper and one cup of grated cheese. Repeat layering with remaining tomatoes, corn, basil, chives, salt, and pepper. Pour lemon mayonnaise over filling and sprinkle with remaining cheese.", 
            "Roll out remaining piece of dough into a 12-inch round in same manner, then fit over filling, folding overhang under edge of bottom crust and pinching edge to seal. Cut 4 steam vents in top crust and brush crust with melted butter (2 teaspoons). Bake pie until crust is golden and filling is bubbling, 30 to 35 minutes, then cool on a rack. Serve warm or at room temperature.", 
            "Do ahead: Pie can be baked 1 day ahead and chilled. Reheat in a 350°F oven until warm, about 30 minutes.", 
            "An idea: Want to slab pie this and serve it to a crowd? I agree, it would be brilliant. This is how I’d approach it: Make 1 1/2 batches of the crust (slab pies require more crust for the same amount of filling) and arrange the filling in one layer instead of two in a parchment-lined 15x10x1-inch pan. Increase the amount of butter you brush the top with to a tablespoon or two and the baking time to about 45 minutes (this is an estimate, you should take it out when it is golden and the filling is bubbling). Be sure to remove the tomato seeds; that extra wetness could make for a slab pie mess."
        ], 
        "date": "2009-08-27T11:35:58+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 (1 1/4 to 1 1/2 pounds) Yukon Gold potatoes", 
            "1 small onion", 
            "1 cup olive oil", 
            "6 extra-large or 7 large eggs", 
            "Salt and freshly ground black pepper (don’t skimp)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/09/tortilla-de-patatas-potato-tortilla.jpg?w=750", 
        "tags": [
            "Brunch", 
            "Budget", 
            "Eggs", 
            "Passover", 
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Spanish", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2007/09/tortilla-de-patatas/", 
        "title": "tortilla de patatas", 
        "directions": [
            "Prepare potatoes and onions: Peel potatoes and onion and slice them very thin with a mandoline, the slicing blade of a food processor, or by hand. If either are on the large side, first cut them in a half lengthwise so the slices will be in half-moons.", 
            "Cook potatoes and onions: Heat oil in an 8- to 10-inch skillet, ideally nonstick, over medium-high until very hot, about 3 minutes. Add potatoes and onions in even layers and reduce heat to medium-low. Cook for 15 minutes, flipping and nudging potatoes around to ensure they cook evenly. Potatoes are done when they are tender when pierced with the tip of a knife. They should not get brown or fall apart in flipping (unless you like your tortillas with softer, more broken-up potatoes, as some do).\nDrain potatoes and onions: Transfer potatoes and onion to a colander set over a bowl and drain them. Season potatoes and onion with salt and pepper and let cool slightly, about 5 minutes. [Go make your salad now! Or start cracking those eggs…]\nMake the tortilla batter: In the bottom of a large bowl, lightly beat eggs with a couple good pinches of salt and freshly ground black pepper. Stir in drained potatoes and onions. If you have 10 minutes, definitely let them soak together for that long; it makes a difference in how well the finally tortilla stays together. If you’re in a rush, it’s not going to ruin the dish if you skip it.\nCook the tortilla: Add 2 tablespoons of the drained cooking oil* (back to the skillet over medium-high heat. Pour potato mixture into skillet and flatten the potatoes with a spatula until they’re mostly even. Reduce heat to medium-low. Cook, moving and shimmying the skillet and nudging the egg around (so it runs underneath) for a minute before letting the tortilla cook undisturbed until the top is wet but not very runny, and it is golden underneath.", 
            "Loosen the tortilla with a spatula then slide it onto a large dinner plate.  With your hands in potholders, invert the skillet over the plate, take a deep breath, and flip it back into the skillet. You can do it! Shake the skillet to straighten the tortilla and use a spatula to gently tuck the edges back under, if needed.", 
            "Return the skillet to the stove and cook tortilla to your desired doneness, another 2 to 3 minutes if you like an ever-so-slightly loose center (try it and see if you can go back), 3 to 4 minutes, or until a toothpick inserted into the center comes out dry, for full doneness.\nServe: Slice onto a plate and serve in wedges, hot, cold or at room temperature, plain, or with a dusting of smoked paprika and/or squiggle of aioli or mayo.", 
            "*Save the rest of the cooking in the fridge for future tortillas, or eggs, or potatoes, or anything you want with a faint onion infusion.\n"
        ], 
        "date": "2007-09-10T22:31:50+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "2 1/2 cups (355 grams) plus 2 tablespoons (20 grams) all-purpose flour", 
            "2 teaspoons (10 grams) baking powder", 
            "1 teaspoon fine sea salt or table salt", 
            "1 cup (8 ounces or 225 grams) unsalted butter, at room temperature", 
            "1 3/4 cups (340 grams) granulated sugar", 
            "Zest of 1 lemon", 
            "3 large eggs, at room temperature", 
            "1/2 teaspoon vanilla extract", 
            "3/4 cup (175 ml) buttermilk", 
            "3 cups (350 to 450 grams) mixed berries", 
            "Glaze", 
            "2 cups (240 grams) powdered or confections’ sugar", 
            "Juice of 1 lemon", 
            "1 tablespoon (15 grams) unsalted butter, very, very soft"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/06/triple-berry-summer-buttermilk-bundt.jpg?w=750", 
        "tags": [
            "Blackberries", 
            "Blueberries", 
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/06/triple-berry-summer-buttermilk-bundt/", 
        "title": "triple berry summer buttermilk bundt", 
        "directions": [
            "Preheat your oven to 350°F. Generously grease a 10-cup Bundt pan, either with butter or a nonstick spray.* Set aside.", 
            "In a medium bowl, whisk or sift 2 1/2 cups flour (leaving 2 tablespoons back), baking powder and salt together and set aside. In the bowl of a stand mixer or large mixing bowl, cream together the butter, sugar and lemon zest until light and impossibly fluffy, about 3 to 5 minutes. Then, with the mixer on a low speed, add your eggs one at a time, scraping down the bowl between each addition. Beat in vanilla, briefly. Add 1/3 flour mixture to batter, beating until just combined, followed by half the buttermilk, another 1/3 of the flour mixture, the remaining buttermilk and remaining flour mixture. Scrape down from time to time and don’t mix any more than you need to. In the bowl where you’d mixed your dry ingredients, toss the berries with the remaining 2 tablespoons of flour. With a silicon spatula, gently fold the berries into the cake batter. The batter will be very thick and this will seem impossible without squishing the berries a little, but just do your best and remember that squished berries do indeed make for a pretty batter.", 
            "Spread cake batter — you might find it easier to plop it in the pan in large spoonfuls, because it’s so thick — in the prepared baking pan and spread the top smooth. Bake for 55 to 60 minutes, rotating the cake 180 degrees after 30 (to make sure it browns evenly). The cake is done as soon as a tester comes out clean of batter. At 10 minutes before my baking time was up, a tester was totally wet with batter and I was certain it would never be done in the estimated time. 7 minutes later, the same tester was clean as a whistle, so fret not.", 
            "Set cake pan on a wire rack to cool for 30 minutes, before inverting the cake onto a serving platter to cool the rest of the way. Cool completely. Once cool, whisk together the powdered sugar, lemon juice and butter until smooth and very, very thick. (If you’d like it thinner, add more juice, but I like the thick drippiness of it, seen above.) Spread carefully over top of cake, letting it trickle down the sides when and where it wishes. Serve at once or keep it covered at room temperature for 3 to 4 days. ", 
            "* Updated note, due to comments about cake sticking: If you have a nonstick Bundt, just a coat of butter or nonstick spray should do. However, if you have a regular Bundt, not nonstick coated, you’re really going to want to make sure every nook and cranny is well-coated with butter or even shortening (the solidity of both helps them stick to the cake walls), and then dust the inside with flour. Setting your cake pan in the fridge or freezer (to set the coating even further) while you make the cake batter will provide even more insurance. I hope this improves the release rate of the cake! "
        ], 
        "date": "2012-06-25T16:02:43+00:00"
    }, 
    {
        "ingredient_list": [
            "4 pounds potatoes (I like tiny Yukon golds, but you can use whatever boiling potatoes you like for salads)", 
            "1 3/4 cups Greek yogurt (I used full-fat but I think other fat levels would work)", 
            "1/4 cup sour cream", 
            "2 tablespoons freshly squeezed lemon juice (from half a big lemon)", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon minced fresh dill", 
            "1 medium garlic clove, minced", 
            "2 teaspoons kosher salt (I use Diamond brand; use less if you use another, read why here)", 
            "Freshly ground black pepper", 
            "1 hothouse or English cucumber (1 pound), unpeeled but quartered lengthwise, seeds removed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/tzatziki-potato-salad.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/05/tzatziki-potato-salad/", 
        "title": "tzatziki potato salad", 
        "directions": [
            "More ideas for additions: Crumbled feta, chopped green olives, chopped fresh mint leaves or a minced hot chile", 
            "In a medium pot, cover your potatoes with cold water and bring them to a boil over high heat. Once boiling, reduce heat to medium-high and let potatoes simmer until tender enough that they can be pierced easily with a skewer or slim knife. I find that small potatoes tend to be done in roughly 30 minutes from the time I put them on the stove cold, but it’s best to start checking 5 to 10 minutes sooner. Drain potatoes and let them cool completely. (This is a great step to do ahead, as it seems to take potatoes forever to cool. If you’re really in a rush, spread them on a tray and pop them in the freezer for 10 minutes.) ", 
            "Meanwhile, in the bottom of a large bowl, stir together yogurt, sour cream, lemon juice, vinegar, dill, garlic, salt and lots of freshly ground black pepper. ", 
            "Grate the cucumber on a box grater (or in your food processor’s shredding blade, if you like to get things done in one hundredth of the time) and try to remove some of the excess by squeezing out handfuls, pressing it in a mesh sieve with a spoon or wringing it in a square of cheesecloth or a lint-free dishtowel. Add to yogurt mixture. ", 
            "Once potatoes are cool, cut tiny ones into quarters or larger ones into generous chunks. Add to cucumbers and yogurt and stir to coat. Add any extra ingredients desired. Adjust seasonings to taste. Either eat immediately or keep in the fridge for up to three days."
        ], 
        "date": "2012-05-24T15:44:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (2 ounces) fresh-squeezed lemon juice", 
            "1/2 cup (4 ounces) fresh watermelon puree, strained through a coarse strainer to remove seeds", 
            "3 tablespoons (1 1/2 ounces) simple syrup*", 
            "3/4 cup (6 ounces) cold water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/watermelon-lemonade.jpg?w=750", 
        "tags": [
            "Citrus", 
            "Drinks", 
            "Fruit", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2009/07/watermelon-lemonade/", 
        "title": "watermelon lemonade", 
        "directions": [
            "Stir it all together and serve over ice. Garnish it with a thin watermelon or lemon wedge, if you’re feeling fancy.", 
            "Spritzy variation: I have never met a beverage I didn’t think would taste better bubbly, thus, if you’re looking for a spritzier version of this, swap one-third (1/4 cup) or more of the water with seltzer or sparkling water.", 
            "Boozy variation: My husband thinks this would taste even better with a splash of vodka. I am not one to argue.", 
            "* Make your own simple syrup: Please. I see it sold in stores and it just boggles my mind. Simmer one part water with one part sugar (I did a cup of each and ended up with more than I needed for a quadruple batch) until sugar has dissolved. Let cool. Or, you can use my speedier method where you simmer one part sugar with half as much water and once it has dissolved, add the second half of the water, cold, which cools the mixture down faster (when you like nothing to slow your pace to the nearest mocktail)."
        ], 
        "date": "2009-07-02T17:48:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds zucchini (2 to 3, depending on size), halved lenthwise and very thinly sliced", 
            "1 teaspoon salt", 
            "1 1/2 ounces parmesan or pecorino romano cheese, thinly sliced on a mandoline or with a peeler", 
            "1/2 cup slivered almonds, well-toasted and cooled (300 degree oven for 7 to 10 minutes, tossing occasionally, usually works)", 
            "1/2 pound pasta of your choice (I like the extra bite of whole wheat pasta in pasta salads), cooked, drained and cooled", 
            "5 tablespoons olive oil", 
            "Juice of one lemon", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/zucchini-and-almond-pasta-salad1.jpg?w=500", 
        "tags": [
            "Pasta", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2010/08/zucchini-and-almond-pasta-salad/", 
        "title": "zucchini and almond pasta salad", 
        "directions": [
            "Further additions, if you wish: 1/2 cup crumbled feta or blue cheese (replacing parmesan), 1/4 red onion, thinly sliced (you can let this marinate in the dressing for a few minutes, to reduce its bite), 1/4 pound fresh arugula or 1/4 cup thinly slivered basil or 1 cup white beans, rinsed and drained", 
            "Toss zucchini slices with one teaspoon salt in a large colander set over a bowl or in sink. Let drain 20 minutes. If they taste too salty to you, rinse and drain them again.", 
            "Stir zucchini, parmesan, almonds and pasta together. Whisk together olive oil and lemon juice, seasoning generously with black pepper and salt to taste. Toss with salad and adjust seasonings to taste. Pack up salad and take it with you to the beach."
        ], 
        "date": "2010-08-09T09:39:52+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups all-purpose flour, chilled in the freezer for 30 minutes", 
            "1/4 teaspoon salt", 
            "8 tablespoons (1 stick) cold unsalted butter, cut into pieces and chill again", 
            "1/4 cup sour cream", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup ice water", 
            "Filling:", 
            "1 large or 2 small zucchinis, sliced into 1/4 inch thick rounds", 
            "1 tablespoon plus 1 teaspoon olive oil", 
            "1 medium garlic clove, minced (about 1 teaspoon)", 
            "1/2 cup ricotta cheese", 
            "1/2 cup (about 1 ounce) grated Parmesan cheese", 
            "1/4 cup (1 ounce) shredded mozzarella", 
            "1 tablespoon slivered basil leaves", 
            "Glaze:", 
            "1 egg yolk beaten with 1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/4744441126_6c461103dd_o.jpg?w=750", 
        "tags": [
            "Herbs", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2010/06/zucchini-and-ricotta-galette/", 
        "title": "zucchini and ricotta galette", 
        "directions": [
            "Make dough: Whisk together the flour and salt in a large bowl. Sprinkle bits of butter over dough and using a pastry blender, cut it in until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, whisk together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour.", 
            "Make filling: Spread the zucchini out over several layers of paper towels. Sprinkle with 1/2 teaspoon salt and let drain for 30 minutes; gently blot the tops of the zucchini dry with paper towels before using. In a small bowl, whisk the olive oil and the garlic together; set aside. In a separate bowl, mix the ricotta, Parmesan, mozzarella, and 1 teaspoon of the garlicky olive oil together and season with salt and pepper to taste.", 
            "Prepare galette: Preheat oven to 400 degrees. On a floured work surface, roll the dough out into a 12-inch round. Transfer to an ungreased baking sheet (though if you line it with parchment paper, it will be easier to transfer it to a plate later).  Spread the ricotta mixture evenly over the bottom of the galette dough, leaving a 2-inch border. Shingle the zucchini attractively on top of the ricotta in concentric circles, starting at the outside edge. Drizzle the remaining tablespoon of the garlic and olive oil mixture evenly over the zucchini. Fold the border over the filling, pleating the edge to make it fit. The center will be open. Brush crust with egg yolk glaze.", 
            "Bake the galette until the cheese is puffed, the zucchini is slightly wilted and the galette is golden brown, 30 to 40 minutes. Remove from the oven, sprinkle with basil, let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature. "
        ], 
        "date": "2010-06-29T09:51:02+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (about 2 large) zucchini or other summer squash, trimmed", 
            "1 1/4 teaspoons fine sea or table salt, plus more if needed", 
            "1 cup (3 ounces or 85 grams) coarsely grated gruyere cheese", 
            "3/4 cup (2 1/2 ounces or 70 grams) coarsely grated fontina or provolone cheese", 
            "1/4 cup (20 grams) finely grated parmesan or pecorino cheese", 
            "Freshly ground black pepper", 
            "8 thin slices bread of your choice, I used a country-style white bread", 
            "A couple tablespoons softened butter or olive oil for brushing bread"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/zucchini-grilled-cheese.jpg?w=750", 
        "tags": [
            "Picnics", 
            "Recipes", 
            "Sandwich", 
            "Summer Squash", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2017/06/zucchini-grilled-cheese/", 
        "title": "zucchini grilled cheese", 
        "directions": [
            "Prepare zucchini: Use a food processor with a grater attachment or the large holes of a box grater to grate the zucchini. In a large colander, toss together the zucchini and salt. Let stand for 20 to 30 minutes, until the zucchini has wilted and begun to release liquid. Drain the zucchini in a colander and then use your hands to squeeze out as much water as possible, a fistful at a time. Place wrung-out zucchini on paper towels to drain further.\nMake filling and assemble sandwiches: Mix zucchini with grated cheese, a lot of freshly ground black pepper, and more salt if needed.", 
            "Brush or spread the bread sides that will form the outsides of the sandwiches with olive oil or softened butter. Spread zucchini-cheese on insides and close the sandwiches.", 
            "Cook the sandwiches: Place sandwiches on a large griddle or frying pan over low-medium heat. I like to cook grilled cheese slowly to give the centers a chance to really melt before the outsides get too brown. When the undersides are a deep golden brown, flip the sandwiches and cook until the color underneath matches the lid. Cut sandwiches in half and dig in. Perhaps some pickled vegetable sandwich slaw on the side?"
        ], 
        "date": "2017-06-22T12:04:08+00:00"
    }
]