{
  "date": "2011-05-23T22:01:51+00:00",
  "directions": [
    "Preheat oven to 350°F (180°C). Butter a 10-inch pie pan or 9-inch deep-dish pie pan (what I used). I did not test this with a standard 9-inch pie plate but looking at the margin of space leftover in my deep-dish pan after baking the cake, I suspect you’d be safe. Updated 6/13/11: This cake does not work in a standard 9-inch pie pan; it will overflow. Big apologies to anyone who learned the hard way! This cake would work, however, in a 9- or 10-inch springform or cake pan. The 10-inch would make a thinner cake than pictured.\nWhisk flour or flours, baking powder and salt together in a small bowl. In a larger bowl, beat butter and 1 cup sugar until pale and fluffy with an electric mixer, about 3 minutes. Mix in egg, milk and vanilla until just combined. Add dry mixture gradually, mixing until just smooth.\nPour into prepared pie plate. Arrange strawberries, cut side down, on top of batter, as closely as possible in a single layer (though I had to overlap a few to get them all in). Sprinkle remaining 2 tablespoons sugar over berries.\nBake cake for 10 minutes then reduce oven temperature to 325°F and bake cake until golden brown and a tester comes out free of wet batter, about 50 minutes to 60 minutes. (Gooey strawberries on the tester are a given.) Let cool in pan on a rack. Cut into wedges. Serve with lightly whipped cream.\nDo ahead: Cake can be stored at room temperature for up to 2 days, loosely covered, but good luck with that.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/5752837495_242b649dbf_o.jpg?w=750",
  "ingredient_list": [
    "6 tablespoons (85 grams) unsalted butter, at room temperature, plus extra for pie plate",
    "1 1/2 cups (188 grams) all-purpose flour (can swap 3/4 cup or 94 grams all-purpose flour with 3/4 cup or 75 grams of barley flour, see Note)",
    "1 1/2 teaspoons baking powder",
    "1/2 teaspoon table salt",
    "1 cup (200 grams) plus 2 tablespoons (25 grams) granulated sugar",
    "1 large egg",
    "1/2 cup (118 ml) milk",
    "1 teaspoon (5 ml) vanilla extract",
    "1 pound (450 grams) strawberries, hulled and halved"
  ],
  "tags": [
    "Everyday Cakes",
    "Photo",
    "Picnics",
    "Strawberries",
    "Summer"
  ],
  "title": "strawberry summer cake",
  "url": "https://smittenkitchen.com/2011/05/strawberry-summer-cake/"
}