{
  "date": "2016-07-29T11:58:51+00:00",
  "directions": [
    "Dab bread slices with 3 tablespoons melted butter. If your bread is already stale, no need to pre-toast/dry it out. If it’s fresh, heat oven to 350 degrees. Spread slices on two trays and bake for 5 to 10 minutes, until firm to the touch but not yet browned. If desired, you can cut the slices on the diagonal now too. (I find this easier once the bread is firm.)",
    "Lightly butter a 9×13-inch or other 3-quart casserole dish. Fan bread slices out in pan. Scatter blueberries over and be sure to tuck some between slices so that they can burrow and collapse. Place sugar and lemon zest in the bottom of a small dish and use your fingertips to rub the zest into the sugar, so it breaks up a bit and also releases the most flavor. Sprinkle half of lemon sugar over bread and blueberries. Whisk eggs in a large bowl and slowly whisk in milk. Stir in vanilla and salt. Pour custard slowly and evenly over bread, berries and sugar. Sprinkle with remaining lemon sugar.",
    "Let mixture soak for 15 minutes at room temperature or overnight in the fridge. When you’re ready to bake it, heat oven (or increase temperature) to 375 degrees. Bake pudding until a knife inserted into the center of the casserole and turned slightly causes no liquid custard to spill into the crack, approximately 30 to 40 minutes. This can vary by the density of your bread; it can sometimes take up to 45 minutes.",
    "Let cool slightly before cutting into squares. Dust with powdered sugar or serve with a syrup on the side, if desired."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/07/img_4275.jpg?w=750",
  "ingredient_list": [
    "1 pound (455 grams) loaf white sandwich or pullman bread or 14 to 16 slices, stale is fine",
    "3 tablespoons (45 grams) unsalted butter, softened or melted, plus a smidge to butter the pan",
    "1 cup (170 grams) fresh blueberries",
    "6 tablespoons (75 grams) granulated sugar",
    "Zest of 1/2 lemon",
    "2 teaspoons (10 ml) vanilla extract",
    "6 large eggs",
    "3 cups (710 ml) whole milk",
    "1/4 teaspoon fine sea or table salt",
    "Powdered sugar, golden or maple syrup to finish (optional)"
  ],
  "tags": [
    "Blueberries",
    "Breakfast",
    "British",
    "Brunch",
    "Photo",
    "Recipes"
  ],
  "title": "blueberry bread and butter pudding",
  "url": "https://smittenkitchen.com/2016/07/blueberry-bread-and-butter-pudding/"
}