{
  "date": "2012-04-30T10:52:49+00:00",
  "directions": [
    "Preheat the oven to 450 degrees. Whisk the cinnamon and sugar together in a small dish. Line two large baking sheets with foil. Place the bread slices on the baking sheets in one layer. Spread each slice of bread with 1 teaspoon of butter, then sprinkle each slice with one teaspoon of the cinnamon-sugar mixture. Toast the trays of bread in the oven until the bread is golden, and until the cinnamon-sugar makes a caramelized crunch on top, for about 7 to10 minutes. Reduce the oven temperature to 375 degrees and let the toast cool slightly.",
    "Generously butter a 9×13-inch baking dish. (You might have a little butter leftover but I wanted to build in some leeway in case, understandably, you weren’t buttering your bread with precise teaspoon measurements!) Cut two slices of the cinnamon toast in half horizontally. Arrange the cinnamon toast down in two rows along the width of the pan. Begin with the bottom half of one slice of toast, then fan 7 more slices in a row, finishing with the top half of the slice. This ensures that those served the end pieces of the baked French toast are not stiffed with thin slices! Repeat with another 7 full slices and 1 halved slice of cinnamon toast in the second row. Whisk the milk, eggs, salt and vanilla in a medium bowl and pour evenly over cinnamon toast in baking dish. Let sit for 15 minutes (or overnight, if you’re preparing this ahead of time) so that the custard absorbs a bit. ",
    "Before baking, if you’ve got any extra cinnamon-sugar (you’ll likely have a tablespoon or two), sprinkle it over the French toast. Bake for 30 minutes, until puffed and golden and until no liquid seeps out of the toasts when they are nudged about in the pan. Cut into squares and serve plain, or with a dollop of plain yogurt and fresh berries, or maple syrup."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/04/cinnamon-toast-french-toast.jpg?w=750",
  "ingredient_list": [
    "1/2 cup (100 grams) granulated sugar",
    "1 tablespoon ground cinnamon",
    "16 slices (from a 1-pound or 450 gram loaf) white sandwich bread",
    "1 stick (4 ounces or 113 grams) unsalted butter, softened",
    "3 cups (710 ml) whole milk",
    "6 large eggs",
    "1/4 teaspoon table salt",
    "2 teaspoons (10 ml) vanilla extract"
  ],
  "tags": [
    "Announcements",
    "Breakfast",
    "Brunch",
    "Cookbooks"
  ],
  "title": "cinnamon toast french toast + book preview",
  "url": "https://smittenkitchen.com/2012/04/cinnamon-toast-french-toast-cookbook-preview/"
}