{
  "date": "2009-04-15T10:30:46+00:00",
  "directions": [
    "For dough: Combine milk and butter in glass measuring cup. Microwave on high until butter melts and mixture is just warmed to 120°F to 130°F, about 30 to 45 seconds. Pour into bowl of stand mixer fitted with paddle attachment. Add 1 cup flour, sugar, egg, yeast, and salt. Beat on low speed 3 minutes, stopping occasionally to scrape down sides of bowl. Add additional 2 1/2 cups flour. Beat on low until flour is absorbed and dough is sticky, scraping down sides of bowl. If dough is very sticky, add more flour by tablespoonfuls until dough begins to form ball and pulls away from sides of bowl. Turn dough out onto lightly floured work surface. Knead until smooth and elastic, adding more flour if sticky, about 8 minutes. (You may also use a KitchenAid’s dough hook for this process.) Form into ball.",
    "Lightly oil large bowl with nonstick spray. Transfer dough to bowl, turning to coat. Cover bowl with plastic wrap, then kitchen towel. Let dough rise in warm draft-free area until doubled in volume, about 2 hours.",
    "For filling: Mix brown sugar, cinnamon and pinch of salt in medium bowl. ",
    "Press down dough. Transfer to floured work surface. Roll out to 15×11-inch rectangle. Spread butter over dough, leaving 1/2-inch border. Sprinkle cinnamon mixture evenly over butter. Starting at the longer side, roll dough into log, pinching gently to keep it rolled up. With seam side down, trim ends straight if they are uneven (we baked them in a ramekin, incapable of discarding such deliciousness) cut remaining dough crosswise with thin sharp knife (a good serrated worked well here) into 18 equal slices (each about 1/2 to 3/4 inch wide).",
    "Spray two 9-inch square glass baking dishes (an 8-inch square metal pan worked just fine, too) with nonstick spray. Divide rolls between baking dishes, arranging cut side up (there will be almost no space between rolls). Cover baking dishes with plastic wrap, then kitchen towel. Let dough rise in warm draft-free area until almost doubled in volume, 40 to 45 minutes, though yours, like mine, may take longer. Don’t skimp on the double-rising time.",
    "Position rack in center of oven and preheat to 375°F. Bake rolls until tops are golden, about 20 minutes. Remove from oven and invert immediately onto rack. Cool 10 minutes. Turn rolls right side up.",
    "For glaze: Combine cream cheese, powdered sugar, butter, and vanilla in medium bowl. Using electric mixer, beat until smooth. Spread glaze on rolls. Serve warm or at room temperature. ",
    "Note: These buns were best the day they were baked. The second day, they were on the tough side. If you anticipate wanting them over a few days, glaze them to order, heating the buns beforehand to soften them up."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cinnamon-swirl-buns-so-much-news1.jpg?w=500",
  "ingredient_list": [
    "Dough",
    "1 cup whole milk",
    "3 tablespoons unsalted butter",
    "3 1/2 cups (or more) unbleached all purpose flour, divided",
    "1/2 cup sugar",
    "1 large egg",
    "2 1/4 teaspoons rapid-rise or instant yeast (from 1 envelope yeast)",
    "1 teaspoon salt",
    "Nonstick vegetable oil spray",
    "Filling",
    "3/4 cup (packed) golden brown sugar",
    "2 tablespoons ground cinnamon",
    "1/4 cup (1/2 stick) unsalted butter, at room temperature",
    "Pinch of salt",
    "Glaze",
    "4 ounces cream cheese, at room temperature",
    "1 cup powdered sugar",
    "1/4 cup (1/2 stick) unsalted butter, room temperature",
    "1/2 teaspoon vanilla extract"
  ],
  "tags": [
    "Announcements",
    "Breakfast",
    "Brunch",
    "Photo"
  ],
  "title": "cinnamon swirl buns + so much news",
  "url": "https://smittenkitchen.com/2009/04/cinnamon-swirl-buns-so-much-news/"
}