{
  "date": "2011-05-06T10:51:27+00:00",
  "directions": [
    "Cut bread into 1 1/2-inch thick, generous slices; a 9-inch loaf should yield 6 slices. Whisk together milk, cream, eggs, sugar, salt, liqueur, and vanilla extract, if using. If using a vanilla bean, halve it lengthwise and scrape the pulp into a small dish. Whisk vanilla bean with one tablespoon of custard, then whisk in another and a third tablespoon, then pour the vanilla bean-custard mixture back into the main batter. This avoids having vanilla bean clumps that don’t disperse in your batter. Don’t you hate that?",
    "Preheat oven to 325. Arrange bread slices on the smallest rimmed tray that will fit them in one layer (encourages maximum absorption) pour custard over slices. Allow them to absorb the custard for 30 minutes, turning the slices over at one point to ensure they’re soaking it up evenly. [Do ahead: You can also soak them overnight in the fridge. No need to flip them if so.]",
    "Line a baking sheet with parchment paper. Transfer custard-soaked slices to prepared sheet, arranging them with a smidge of space between each to avoid making one French mega-toast. Flipping them halfway through if you wish, bake French toast slices for 30 to 35 minutes, until a slim knife inserted into the center of a slice and twisted ever-so-slightly does not release any wet custard. Keep warm until ready to serve.",
    "To caramelize the tops: Either leave toasts on their baking sheet, or transfer to a serving platter. Have ready a small offset spatula and a potholder or trivet to rest your caramel pot on.",
    "Melt remaining 2/3 cup sugar in a small, heavy, completely dry saucepan over moderate heat, stirring with a small spoon or fork until fully melted and the color of honey. Move it over to the potholder or trivet you’d set up and working quickly, spoon one generous tablespoon caramel over your first slice of toast, spread it thinly and evenly with your offset spatula and repeat with the remaining toasts. Because your caramel will continue to deepen slightly in color (veering towards almost-too-toasty) as you work, it’s best to work quickly but carefully. Let no fingers or forearms be harmed in the melted sugar’s path and should a single drop land on the counter or on your towel or on the rim of the plate, do not swipe it. Just leave it until it cools.",
    "[Hot water will melt all hardened caramel and make your clean up job easy. Simply soak your pot/spoon/spatula and all will melt off.]",
    "Serve with fresh berries and if you’re feeling extra fancy, loosely whipped cream. We don’t find that it needs any maple syrup.",
    "Alternative top-caramelizing method: A really obvious question here would be “But would the broiler work?” The method would be to sprinkle each toast with 1 tablespoon of granulated sugar and let the broiler do the torching for you. However, my broiler doesn’t work. Never has, so I cannot test this. But, if it’s anything like my attempt (explained in the post) to use a blowtorch, I’m not feeling overly confident about it because the unevenness of the toasts leads to edges singeing before the sugar fully melts. But if you try this method, please report back in the comments as to how it went. I’m sure plenty of folks would prefer to avoid melting sugar."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creme-brulee-french-toasts1.jpg?w=500",
  "ingredient_list": [
    "Toasts",
    "1 loaf unsliced white bread, brioche or rich bread of your choice",
    "1 1/3 cups whole milk",
    "2/3 cup heavy cream",
    "4 large eggs",
    "1/3 cup granulated sugar",
    "1/4 teaspoon fine sea salt or table salt",
    "1 teaspoon Grand Marnier or another orange liqueur or 1/4 teaspoon orange zest",
    "1 vanilla bean or 2 teaspoons vanilla extract",
    "Topping",
    "2/3 cup granulated sugar"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Photo"
  ],
  "title": "crème brûlée french toasts",
  "url": "https://smittenkitchen.com/2011/05/creme-brulee-french-toasts/"
}