[
    {
        "ingredient_list": [
            "1 1/8 cups (225 grams) sugar, divided", 
            "4 teaspoons finely grated lemon peel (from two large lemons)", 
            "2 cups (260 grams) all purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "3/4 teaspoon fine sea or table salt", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, at room temperature", 
            "1 large egg", 
            "1 cup (235 ml) buttermilk", 
            "2 teaspoons (10 ml) vanilla extract", 
            "1 1/2 1/2-pint containers (about) fresh raspberries"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/05/raspberry-topped-lemon-muffins.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Fruit", 
            "Lemon", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Raspberries"
        ], 
        "url": "https://smittenkitchen.com/2007/05/a-new-muffin-in-town/", 
        "title": "raspberry-topped lemon muffins", 
        "directions": [
            "Preheat oven to 375°F. Line 14 standard muffin cups (or 56 minis) with paper liners. Mash 1/8 cup (25 grams) sugar and lemon peel in small bowl until sugar is slightly moist. Whisk flour, baking powder, and salt in medium bowl to blend. Using electric mixer, beat remaining 1 cup sugar and butter in large bowl until smooth. Beat in egg. Beat in buttermilk, then vanilla and lemon sugar. Beat in flour mixture.", 
            "Divide batter among muffin cups (the 2/3-3/4 level worked well for minis). Top each large muffin with 4 raspberries (or mini muffins with one each). Bake muffins until lightly browned on top and tester inserted into center comes out clean, about 35 minutes (baking time was on the shy side of 20 minutes for mini muffins). "
        ], 
        "date": "2007-05-11T15:19:46+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups all-purpose flour", 
            "1/2 teaspoon salt", 
            "2 tablespoons sugar", 
            "1 1/2 teaspoons baking soda", 
            "1 3/4 cups buttermilk* or 1 1/2 cups sour cream or plain yogurt thinned with 1/4 cup milk", 
            "2 eggs, separated", 
            "4 tablespoons (1/2 stick butter, melted and cooled)", 
            "1/2 teaspoon vanilla extract", 
            "Canola or other neutral oil for brushing on waffle pan (Deb note: Pam works great!)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/again-with-the-pining1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2007/03/again-with-the-pining/", 
        "title": "rich buttermilk waffles", 
        "directions": [
            "Combine the dry ingredients. Mix together the buttermilk, sour cream or yogurt and the egg yolks. Stir in the butter and vanilla.", 
            "Brush the waffle iron lightly with oil and preheat it. Stir the wet into the dry ingredients. Beat the egg whites with the whisk or electric mixer (spotlessly clean ones work best) until they hold soft peaks. Stir them gently into the batter. ", 
            "Spread a ladleful or so of batter onto the waffle iron and bake until the waffle is done, usually 3 to 5 minutes, depending on your iron. Serve immediately or keep warm for a few minutes in a low oven.", 
            "* The buttermilk can be substituted with 1 1/4 cups of milk at room temperature, mixed with two tablespoons white vinegar, left to clabber for 10 minutes. "
        ], 
        "date": "2007-03-26T23:21:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour", 
            "1 cup yellow cornmeal, preferably stone-ground", 
            "6 tablespoons granulated sugar", 
            "2 1/2 teaspoons baking powder", 
            "1/4 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "Pinch of freshly grated nutmeg (optional)", 
            "1 cup buttermilk", 
            "3 tablespoons unsalted butter, melted and cooled", 
            "3 tablespoons corn oil (I used olive oil since it was handy)", 
            "1 large egg", 
            "1 large egg yolk", 
            "1 cup corn kernels (add up to 1/3 cup more if you’d like) – fresh, frozen or canned (in which case they should be drained and patted dry)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/always-the-corniest1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Round-Up"
        ], 
        "url": "https://smittenkitchen.com/2007/05/always-the-corniest/", 
        "title": "corniest corn muffins", 
        "directions": [
            "Center a rack in the oven and preheat the oven to 400 degrees F. Butter or spray the 12 molds in a regular-size muffin pan or fit the molds with paper muffin cups. Alternatively, use a silicone muffin pan, which needs neither greasing nor paper cups. Place the muffin pan on a baking sheet.", 
            "In a large bowl, whisk together the flour, cornmeal, sugar, baking powder, baking soda, salt and nutmeg, if you’re using it. In a large glass measuring cup or another bowl, whisk the buttermilk, melted butter, oil, egg and yolk together until well blended. Pour the liquid ingredients over the dry ingredients and, with the whisk or a rubber spatula, gently but quickly stir to blend. Don’t worry about being thorough – the batter will be lumpy, and that’s just the way it should be. Stir in the corn kernels. Divide the batter evenly among the muffin cups.", 
            "Bake for 15 to 18 minutes (12 minutes for minis), or until the tops are golden and a thin knife inserted into the center of the muffins comes out clean. Transfer the pan to a rack and cool for 5 minutes before carefully removing each muffin from its mold."
        ], 
        "date": "2007-05-03T14:37:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound thick-cut bacon, cut into small dice", 
            "1 pound red potatoes, scrubbed clean and diced into 1/4- to 1/2-inch cubes (about 3 to 3 1/4 cups)", 
            "Salt and freshly ground black pepper", 
            "4 medium-large ears corn, kernels cut from the cob (2 1/2 to 3 cups)", 
            "1 bundle scallions, thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/bacon-corn-hash.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Budget", 
            "Corn", 
            "Gluten-Free", 
            "Meat", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Summer", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2012/07/bacon-corn-hash/", 
        "title": "bacon corn hash", 
        "directions": [
            "Toss bacon into a large skillet over medium heat, no need to heat the pan first. Let rest for a few minutes until it starts sizzling, then move the bits around so that they begin to brown evenly. Again, wait a couple minutes before shuffling the pieces around; you’re looking for them to get evenly golden and crisp. This should take about 10 minutes. Remove the bacon bits with a slotted spoon, leaving the drippings in the pan and transferring the bacon to paper towels to drain.", 
            "If your bacon is like mine, you’ll be left with a spectacular amount of fat behind. You’ll be tempted to drain it off. May I ask you not to? The potatoes that cook in this will be gorgeous and you will have a chance to remove this extra in a bit. It will mostly stay in the pan.", 
            "Heat the pan to medium/medium-high, making sure the bacon fat is nicely sizzly, then add your potatoes all at once in a single layer. Sprinkle them with 1/2 teaspoon table salt and several grinds of black pepper. Let them cook for a few minutes in one place and get a bit golden underneath before turning them over and moving them around. Repeat this process until the potatoes are browned on all sides; this takes about 20 minutes.", 
            "At this point, you can push aside the potatoes and pour or spoon off all but a small amount of the fat. I won’t tell you how much I was able to remove but it rhymes with shmoo to shmee shmablespoons. If you save it, you can use it to fry an egg in a bit.", 
            "Bump up the heat a little and add the corn to the skillet. Saute the potatoes and corn together until the corn gets a bit brown but stays fairly crisp, about 4 to 5 minutes. Add the drained bacon, and stir the mixture together until it’s evenly warm, about 1 more minute. Remove the skillet from the burner and sprinkle the scallions (reserving a couple spoonfuls if you’d like to use them as fried egg garnish) over the hash. In two minutes, they should be warm and mellowed. Season with more salt or pepper to taste, if needed.", 
            "Add a fried egg to it: Heat a small skillet over medium-high heat and swirl in one to two teaspoons bacon fat or butter. Crack one egg into the skillet and reduce heat to medium. I like to cover the skillet with a small lid at this point, as it seems to help the egg cook faster and more evenly. In one minute, you should have a perfect sunny-side-up egg. Season with salt and pepper, serve on top of a pile of bacon corn hash. "
        ], 
        "date": "2012-07-17T14:28:15+00:00"
    }, 
    {
        "ingredient_list": [
            "6 cups low-sodium chicken stock or vegetable broth, but best to have an extra splash or two around if needed", 
            "1 cup (4 ounces) finely chopped bacon (from about 4 slices) or pancetta", 
            "1 tablespoon olive oil", 
            "2 large or 3 smaller leeks, quartered lengthwise, cleaned of grit, and chopped small", 
            "3 tablespoons unsalted butter, plus more to fry eggs", 
            "1/2 small onion, finely chopped", 
            "2 cups arborio, carnaroli, or another short-grained Italian rice", 
            "1/3 cup dry white wine or vermouth (read why here)", 
            "1 cup finely grated fresh Parmesan cheese, plus extra for garnish if desired", 
            "Salt and freshly ground black pepper", 
            "4 to 6 large eggs, you’ll want one per serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/bacon-egg-and-leek-risotto.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Grain/Rice", 
            "Photo", 
            "Put An Egg On It"
        ], 
        "url": "https://smittenkitchen.com/2012/05/bacon-egg-and-leek-risotto/", 
        "title": "bacon, egg and leek risotto", 
        "directions": [
            "Place stock or broth in a small-medium saucepan over very low heat on a back burner. You want to have it heated until steamy when you add it in a bit, but not so much that it simmers and loses volume.", 
            "Heat a second medium saucepan (3 quarts) or skillet over medium heat. Add bacon or pancetta and cook until it renders its fat, and is tender and just barely crisp. Remove with a slotted spoon to a bowl and set aside, leaving whatever dripping you can in the pan. Add a tablespoon of oil to the bacon fat if needed, then add the leeks. Cook leeks on medium-low for 10 to 12 minutes, until softened and mostly tender. Transfer to bowl with bacon and set aside, leaving stove on.", 
            "Add butter to pan and, once melted, cook onion in butter until translucent and tender, about 5 minutes. Add rice and cook sauté until faintly toasted, about 4 minutes. Add wine or vermouth and cook until it almost disappears, about 2 minutes. Ladle 1 cup of hot broth into the rice mixture and simmer until it absorbs, stirring frequently. Add remaining broth 1/2 cup at a time, allowing broth to be absorbed before adding more and stirring frequently until rice is al dente, about 25 to 30 minutes. What you’re looking for in well-cooked risotto is a creamy but loose dish. When ladled onto a plate, it should spill into a creamy puddle, not heap in a mound. You might need an extra splash of broth to loosen it. When you achieve your desired texture and tenderness, stir in the cheese, bacon and leeks. Season with salt and pepper to taste. Ladle into serving bowls.", 
            "Then, quickly, in a small skillet, heat a pat of butter over medium-high and swirl it to coat the pan. Crack one egg into the skillet, season with salt and pepper and reduce heat to medium. I like to cover the skillet with a small lid at this point, as it seems to help the egg cook faster and more evenly. In one minute, you should have a perfect sunny-side-up egg. Transfer to your first bowl of risotto and repeat with remaining eggs. Garnish each with an extra bit of grated parmesan and eat immediately."
        ], 
        "date": "2012-05-07T13:36:02+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds (32 ounces) ounces fresh baby spinach or regular spinach leaves", 
            "1 small yellow onion, finely chopped", 
            "3 small garlic cloves, minced", 
            "4 tablespoons unsalted butter", 
            "1 pound mushrooms, thinly sliced (I use creminis)", 
            "1 cup heavy cream", 
            "3/4 teaspoon table salt", 
            "Freshly ground black pepper", 
            "1/4 teaspoon freshly grated nutmeg (optional; I skip this)", 
            "12 large eggs", 
            "6 tablespoons finely grated Parmesan cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/baked-eggs-with-spinach-and-mushrooms.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Mushrooms", 
            "Spinach", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/04/baked-eggs-with-spinach-and-mushrooms/", 
        "title": "baked eggs with spinach and mushrooms", 
        "directions": [
            "If you’ve just washed your spinach, no need to dry it before wilting it in the pan. If it’s already dry, bring 1/2 inch water to a boil in a very large ovenproof heavy skillet, then add half of spinach and cook, turning with tongs, until wilted, about 30 seconds. Add remaining spinach and wilt in same manner, then cook, covered, over moderately high heat until spinach is tender, about 1 to 2 minutes. Drain in a colander and cool under cold running water. Gently squeeze handfuls of spinach to remove as much liquid as possible, then coarsely chop. You will have about 2 cups fairly tightly packed cooked spinach.", 
            "Wipe skillet dry, then melt butter over medium-low heat. Cook onion and garlic until softened, 2 to 3 minutes. Add mushrooms and increase heat to medium-high, then cook, stirring, until mushrooms have softened, exuded liquid and that liquid has cooked off, about 5 minutes. Stir in cream, salt, pepper, nutmeg (if using), and chopped spinach and bring back a simmer. Remove skillet from heat.", 
            "If baking eggs in this skillet, make 12 large indentations in mixture, each large enough to fit an egg. Otherwise, you can transfer this mixture to a 9×13-inch baking dish and do the same there. I like to use 2 teaspoons to make the wells; I press the backs of them together to “pinch” up the spinach mixture to form taller walls so that the eggs will not merge together. ", 
            "Do ahead: You can then set this aside for a few hours or up to one day in the fridge, covered.", 
            "When you’re ready to bake the dish, or about 30 minutes before serving, put oven rack in upper third of oven and heat oven to 450°F. Crack an egg into each well. Bake until whites are firm and yolks are still runny. You can check this by inserting a toothpick into various parts of the eggs and seeing whether they’re runny or set, which takes anywhere from 15 to 30 minutes. The range is long due to different ovens and baking vessels. It’s better to have to check more often than to let them overcook.", 
            "[Cooking note: It is nearly impossible to get all 12 eggs to cook evenly. The ones in the center will be more runny; at the edges, they’ll be more firm. But don’t fret. I’ve found that almost all people have an egg preference (more runny vs. more firm) and each egg manages to find the right home. Just ask people their preference as you serve them.]", 
            "Remove dish from oven, sprinkle with additional salt and pepper, plus grated Parmesan. Serve immediately."
        ], 
        "date": "2014-04-16T12:31:29+00:00"
    }, 
    {
        "ingredient_list": [
            "Banana crepes", 
            "4 tablespoons butter, melted and cooled slightly, plus extra for greasing pan", 
            "1 large (will weigh 6 ounces/170 grams be about 6 inches long when unpeeled) speckly ripe banana (should yield a scant 1/2 cup peeled, pureed)", 
            "1 cup (235 ml) milk", 
            "3/4 cup (95 grams) all-purpose flour", 
            "4 large eggs", 
            "2 tablespoons (25 grams) light brown sugar", 
            "1/2 teaspoon vanilla extract", 
            "1/4 teaspoon table salt", 
            "1/2 teaspoon ground cinnamon", 
            "1/4 teaspoon freshly grated nutmeg", 
            "Pinch of ground cloves", 
            "Cream cheese yogurt filling", 
            "8 ounces (225 grams) cream cheese, well-softened", 
            "1 1/2 cups (345 grams) plain Greek-style yogurt", 
            "1/3 cup (65 grams) granulated sugar", 
            "1/2 teaspoon vanilla extract", 
            "Walnut butterscotch topping", 
            "1/2 cup (120 ml) heavy whipping cream", 
            "1/4 cup (50 grams) packed dark brown sugar", 
            "1 tablespoon (15 grams) unsalted butter, at room temperature", 
            "1/2 cup (about 50 grams) chopped walnuts, toasted", 
            "1/2 teaspoon vanilla extract", 
            "1/4 teaspoon flaky sea salt, or to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/banana-bread-crepe-cake-with-butterscotch1.jpg?w=500", 
        "tags": [
            "Bananas", 
            "Breakfast", 
            "Brunch", 
            "Cake", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/04/banana-bread-crepe-cake-with-butterscotch/", 
        "title": "banana bread crepe cake with butterscotch", 
        "directions": [
            "Make the crepe batter: Blend banana in a food processor until totally smooth. Add melted butter, blend again. Add remaining ingredients and blend until they are combined. Transfer batter, which will look pretty thin, to a bowl (even easier later if it has a spout), cover with plastic wrap and chill for at least an hour, preferably overnight, and up to two days. When you remove the batter, it will seem surprisingly thick. Stir it to redistribute the ingredients before using it.", 
            "Cook the crepes: Heat a medium skillet or crepe pan over medium-high heat. Once heated, brush pan thinly with melted butter. Pour 1/4 cup batter into skillet, swirling it until it evenly coats the bottom and cook, undisturbed, until the bottom is golden and the top is set, about 2 to 3 minutes. Flip* the crepe and cook it for 30 seconds on the other side, before transferring it to a plate to cool. Repeat with remaining batter. You can stack your crepes and they should not stick together. Let crepes cool completely.", 
            "* Here’s my Weirdo Two-Spatula Crepe Flipping Method: I have two spatulas handy, one flexible fish-style spatula (these are my favorite, for everything, because they’re so thin) and one smaller, like an offset icing spatula. I slide the larger one just a little bit under the crepe and lift it enough that I can slide the smaller one under. I lift it enough that I can get the larger one far underneath the crepe, then use the larger one alone to flip it. It makes it very easy, I promise.", 
            "Make filling: Whip cream cheese until fluffy, then beat in yogurt, 1/2 cup at a time. When fully combined, add sugar and vanilla then beat until rich and fluffy, just another minute.", 
            "Assemble crepe cake: Lay first crepe on a cake plate or serving platter. Spread with 1/4 cup of the yogurt-cream cheese filling. Repeat with all but the last remaining crepe, which should be stacked but have no filling on top, as it is the lid.", 
            "Make walnut butterscotch sauce: Combine the cream, brown sugar and butter in the bottom of a medium, heavy saucepan over medium-high heat. Bring the mixture to a boil, then reduce the heat and let it simmer for 10 minutes, stirring occasionally in the beginning and more frequently as it reduces and thickens. You’ll know it’s done when it becomes thick and smells toasty. Stir in the vanilla and salt, then walnuts. Immediately pour over stack of filled crepes, nudging the butterscotch to the edges with your spoon — if it goes over the edge, so be it.", 
            "Serve immediately, or keep in fridge until ready to serve. Crepe cake keeps for up to 3 days, possibly longer, but good luck with that."
        ], 
        "date": "2012-04-16T16:10:00+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups all-purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "2 teaspoons sugar", 
            "3/4 teaspoon baking soda", 
            "1 teaspoon salt", 
            "6 tablespoons (3/4 stick or 3 ounces) cold unsalted butter, cut into 1/2-inch cubes", 
            "1 1/2 cups crumbled blue cheese", 
            "4 scallions, finely chopped", 
            "1 cup well-shaken buttermilk (or, you can make your own)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/blue-cheese-scallion-drop-biscuits1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Cheese", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2010/04/blue-cheese-scallion-drop-biscuits/", 
        "title": "blue cheese scallion drop biscuits", 
        "directions": [
            "Preheat oven to 450°F. Whisk together flour, baking powder, sugar, baking soda, and salt in a bowl, then blend in butter with your fingertips until mixture resembles coarse meal. Stir in blue cheese and scallions. Add buttermilk and stir until just combined.", 
            "Drop dough in 12 equal mounds about 2 inches apart onto a buttered large baking sheet, or one lined with parchment paper. Bake in middle of oven until golden, 16 to 20 minutes. ", 
            "Do ahead: Biscuits are always best the day they are baked. However, if you wish to get a lead on them, you can make them, drop them onto your baking sheet, freeze them until they are firm, and place them in a freezer bag or container until you’re ready to bake them. They can be baked while still frozen (straight from the freezer), you’ll just want to add a few minutes to the baking time."
        ], 
        "date": "2010-04-21T16:51:30+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/3 cups (315 ml) buttermilk (you can also use sour cream or yogurt thinned with a little milk)", 
            "1 large egg", 
            "1/3 cup (80 ml) oil (such as vegetable, safflower, sunflower or olive oil)", 
            "1/4 cup (50 grams) lightly packed dark brown sugar", 
            "1 teaspoon (5 ml) vanilla extract, a little citrus zest (optional flavorings to add)", 
            "1 1/2 cups (90 grams) wheat bran*", 
            "1 cup (125 grams) all-purpose flour", 
            "1 1/2 teaspoons (8 grams) baking powder (preferably aluminum-free)", 
            "1 1/2 teaspoons (8 grams) baking soda", 
            "1/4 teaspoon table salt", 
            "2 teaspoons (10 grams) granulated sugar, divided", 
            "3/4 to 1 cup chopped mixed fruit (just about anything but citrus or pineapple will work, they say; frozen berries are fine)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/blue-sky-bran-muffins1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/05/blue-sky-bran-muffins/", 
        "title": "blue sky bran muffins", 
        "directions": [
            "Heat oven to 425 degrees F and coat a 12-cup muffin tin with nonstick spray.", 
            "Whisk buttermilk, egg, oil, brown sugar and any vanilla or citrus zest you’d like to use in a small bowl. Whisk bran, flour, baking powder, baking soda and salt in a large bowl. Stir wet mixture into dry until just combined and still a bit rough. ", 
            "Spoon two 2 tablespoons of batter into each prepared muffin cup. Add about 2 teaspoons fruit to each (dividing it evenly) and sprinkling the fruit with one of the teaspoons of granulated sugar. Spoon remaining batter (about 1 tablespoon each) over fruit and sprinkle tops of muffins with remaining teaspoon of granulated sugar. ", 
            "Bake muffins for a total of 16 to 18 minutes, rotating pan once midway through baking time for even browning, until a toothpick inserted into the center of muffins comes out with just a few crumbs attached. Do not overbake. Let muffins cool in pan on a wire rack for 10 minutes before removing from tin. ", 
            "Do ahead: Muffins keep for 3 days at room temperature, longer in the freezer.", 
            "* I didn’t try it, but I suspect that oats pulsed in a food processor until a cornmeal-like consistency or even that 7-grain cereal mix we used for this whole-grain cinnamon swirl bread would work here. Let us know if you audition it. I used Bob’s Red Mill brand wheat bran."
        ], 
        "date": "2014-05-02T11:51:25+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (455 grams) loaf white sandwich or pullman bread or 14 to 16 slices, stale is fine", 
            "3 tablespoons (45 grams) unsalted butter, softened or melted, plus a smidge to butter the pan", 
            "1 cup (170 grams) fresh blueberries", 
            "6 tablespoons (75 grams) granulated sugar", 
            "Zest of 1/2 lemon", 
            "2 teaspoons (10 ml) vanilla extract", 
            "6 large eggs", 
            "3 cups (710 ml) whole milk", 
            "1/4 teaspoon fine sea or table salt", 
            "Powdered sugar, golden or maple syrup to finish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/07/img_4275.jpg?w=750", 
        "tags": [
            "Blueberries", 
            "Breakfast", 
            "British", 
            "Brunch", 
            "Photo", 
            "Recipes"
        ], 
        "url": "https://smittenkitchen.com/2016/07/blueberry-bread-and-butter-pudding/", 
        "title": "blueberry bread and butter pudding", 
        "directions": [
            "Dab bread slices with 3 tablespoons melted butter. If your bread is already stale, no need to pre-toast/dry it out. If it’s fresh, heat oven to 350 degrees. Spread slices on two trays and bake for 5 to 10 minutes, until firm to the touch but not yet browned. If desired, you can cut the slices on the diagonal now too. (I find this easier once the bread is firm.)", 
            "Lightly butter a 9×13-inch or other 3-quart casserole dish. Fan bread slices out in pan. Scatter blueberries over and be sure to tuck some between slices so that they can burrow and collapse. Place sugar and lemon zest in the bottom of a small dish and use your fingertips to rub the zest into the sugar, so it breaks up a bit and also releases the most flavor. Sprinkle half of lemon sugar over bread and blueberries. Whisk eggs in a large bowl and slowly whisk in milk. Stir in vanilla and salt. Pour custard slowly and evenly over bread, berries and sugar. Sprinkle with remaining lemon sugar.", 
            "Let mixture soak for 15 minutes at room temperature or overnight in the fridge. When you’re ready to bake it, heat oven (or increase temperature) to 375 degrees. Bake pudding until a knife inserted into the center of the casserole and turned slightly causes no liquid custard to spill into the crack, approximately 30 to 40 minutes. This can vary by the density of your bread; it can sometimes take up to 45 minutes.", 
            "Let cool slightly before cutting into squares. Dust with powdered sugar or serve with a syrup on the side, if desired."
        ], 
        "date": "2016-07-29T11:58:51+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon kosher salt, or slightly less table salt", 
            "3 tablespoons sugar", 
            "2 large eggs, lightly beaten", 
            "3 cups buttermilk", 
            "4 tablespoons unsalted butter, melted, plus 1 tablespoon extra for brushing griddle (I’ve made these pancakes with and without the butter mixed in, and can say with confidence they work either way. They’re just richer with it, of course.)", 
            "1 cup blueberries, fresh or frozen and thawed (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/blueberry-pancakes-pancake-1011.jpg?w=500", 
        "tags": [
            "Blueberries", 
            "Breakfast", 
            "Brunch", 
            "Fruit", 
            "Pancakes", 
            "Photo", 
            "Tips"
        ], 
        "url": "https://smittenkitchen.com/2008/07/blueberry-pancakes-pancake-101/", 
        "title": "blueberry pancakes + pancake 101", 
        "directions": [
            "1. Preheat an electric griddle to 375°F, or place a griddle pan or cast-iron skillet over medium heat. Whisk together the flour, baking powder, baking soda, salt, and sugar in a medium bowl. Add the eggs, buttermilk, and 4 tablespoons melted butter, and whisk to combine. The batter should have small to medium lumps.", 
            "2. Test the griddle by sprinkling a few drops of water on it. If the water bounces and spatters, the griddle is hot enough. Using a pastry brush, brush the remaining 1/2 teaspoon butter onto the griddle. Wipe off the excess with a folded paper towel.", 
            "3. Using a 4-oz. ladle, about 1/2 cup (for a 6-inch pancake), pour the batter in pools 2 inches apart. If you wish to make blueberry pancakes, arrange a handful over the cooking pancake, pressing them in slightly. When the pancakes have bubbles on top and are slightly dry around the edges, about 2 1/2 minutes, flip over. If any batter oozes or blueberries roll out, push them back under with your spatula. Cook until golden on bottom, about 1 minute.", 
            "4. Repeat with the remaining batter.  You can keep the finished pancakes on a heat-proof plate in the oven at 175°F. Serve warm."
        ], 
        "date": "2008-07-26T13:54:45+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "1 cup plain, full-fat yogurt", 
            "2 to 4 tablespoons milk", 
            "3 tablespoons butter, plus extra for buttering skillet", 
            "1/2 teaspoon lemon zest", 
            "1/2 teaspoon vanilla extract", 
            "1/2 cup (62 grams) whole wheat flour", 
            "1/2 cup (68 grams) all-purpose flour", 
            "1/4 cup (32 grams) barley or rye flour", 
            "2 tablespoons sugar", 
            "1 tablespoons plus 1 teaspoons baking powder", 
            "1/2 teaspoon table salt", 
            "1 cup blueberries, rinsed and dried"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/06/blueberry-yogurt-multigrain-pancakes.jpg?w=750", 
        "tags": [
            "Blueberries", 
            "Breakfast", 
            "Brunch", 
            "Pancakes", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2011/06/blueberry-yogurt-multigrain-pancakes/", 
        "title": "blueberry yogurt multigrain pancakes", 
        "directions": [
            "Melt half of butter. Remove from heat and stir in second tablespoon of butter until melted. This keeps your butter from being too hot when you next want to add it to the wet ingredients.", 
            "Whisk egg and yogurt together in the bottom of a medium/large bowl. If you’re using a thin yogurt, no need to add any milk. If you’re using regular yogurt, stir in 2 tablespoons milk. If you’re using a thick/strained or Greek-style yogurt, add 3 to 4 tablespoons milk. Whisk in melted butter, zest and vanilla extract. In a separate, small bowl, combine flours, sugar, baking powder and salt. Stir dry ingredients into wet only until dry ingredients are moistened. A few remaining lumps is fine.", 
            "Preheat your oven to 200°F and have a baking sheet ready (to keep pancakes warm). Heat your skillet or saute pan to medium. If you’ve got a cast-iron skillet, this is my favorite for pancakes. Melt a pat of butter in the bottom and ladle a scant 1/4 cup (about 3 tablespoons) batter at a time, leaving at space between each pancake. Press a few berries into the top of each pancake. The batter is on the thick side, so you will want to use your spoon or spatula to gently nudge it flat, or you may find that pressing down on the berries does enough to spread the batter.  When the pancakes are dry around the edges and you can see bubbles forming on the top, about 3 to 4 minutes, flip them and cook for another 3 minutes, until golden underneath. (If you listen closely, after a minute you’ll hear you blueberries pop and sizzle deliciously against the pan.) If pancakes begin cooking too quickly, lower the heat. Transfer pancakes to warm oven as they are done cooking, where you can leave them there until you’re ready to serve them.", 
            "Serve in a big stack, with fixings of your choice. Do not anticipate leftovers."
        ], 
        "date": "2011-06-28T13:10:21+00:00"
    }, 
    {
        "ingredient_list": [
            "Sponge", 
            "6 tablespoons (3 ounces) warm water", 
            "1 teaspoon sugar", 
            "1 1/2 teaspoons instant yeast", 
            "1/4 cup (1 ounce) unbleached all-purpose flour", 
            "Dough", 
            "Sponge (above)", 
            "6 tablespoons (3 ounces) sour cream or yogurt", 
            "1/4 cup (4 tablespoons or 2 ounces) unsalted butter, softened", 
            "2 large eggs, 1 beaten for dough, 1 beaten with 1 teaspoon water for brushing bread", 
            "1/4 cup (1 3/4 ounces) sugar", 
            "1 teaspoon salt", 
            "1 teaspoon vanilla extract", 
            "2 1/2 cups (10 5/8 ounces) unbleached all-purpose flour", 
            "Pearl sugar* or sparkling white sugar for sprinkling", 
            "Lemon cream cheese filling", 
            "1/3 cup (2 1/2 ounces) cream cheese, softened", 
            "2 tablespoons (5/8 ounces) sugar", 
            "2 tablespoons (1 ounce) sour cream", 
            "1 teaspoon fresh lemon juice", 
            "2 tablespoons (1/2 ounce) unbleached all-purpose flour", 
            "1/4 cup (2 ounces) homemade (recipe below) or prepared lemon curd  ", 
            "3 tablespoons fresh lemon juice", 
            "3/4 teaspoon fresh lemon zest, finely grated", 
            "3 tablespoons sugar", 
            "1 large egg", 
            "2 tablespoons unsalted butter, cut into small pieces"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/braided-lemon-bread.jpg?w=750", 
        "tags": [
            "Bread", 
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Easter", 
            "Lemon", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/05/braided-lemon-bread/", 
        "title": "braided lemon bread", 
        "directions": [
            "Whisk together juice, zest, sugar, and egg in a 1-quart heavy saucepan. Stir in butter and cook over moderately low heat, whisking frequently, until curd is thick enough to hold marks of whisk and first bubble appears on surface, about 4 to 5 minutes. Transfer lemon curd to a bowl and chill, its surface covered with plastic wrap, until cold, at least 1 hour. "
        ], 
        "date": "2010-05-13T20:50:56+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds* of whatever apples, or mix of apples, you like to bake with, peeled, cored and cut into medium chunks", 
            "2 tablespoons lemon juice", 
            "3 tablespoons sugar", 
            "2 tablespoons cornstarch", 
            "1 teaspoon cinnamon", 
            "Salt", 
            "1 stick (8 tablespoons or 4 ounces) unsalted butter", 
            "1/4 cup honey", 
            "1/2 cup flour", 
            "2 cups oats", 
            "1/2 cup sliced almonds", 
            "1/2 shredded coconut (sweetened or unsweetened, as you wish; I used unsweetened)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/breakfast-apple-granola-crisp.jpg?w=753", 
        "tags": [
            "Apple", 
            "Breakfast", 
            "Brunch", 
            "Coconut", 
            "Crumbles/Crisps", 
            "Fall", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/10/breakfast-apple-granola-crisp/", 
        "title": "breakfast apple granola crisp", 
        "directions": [
            "Preheat oven to 400°F. Mix apple chunks with lemon juice, sugar, cornstarch, cinnamon and pinch of salt in a 9×13-inch baking dish until apples are evenly coated. In a medium saucepan, melt the butter with the honey. Stir in the flour, oats, almonds, coconut and another pinch of salt until clumps form. Sprinkle evenly over the apple mixture and bake in the oven for about 45 to 55 minutes, or until the apples are softened and bubbly. Should the granola brown before you wish it to, cover the baking dish carefully with foil for all but the last few minutes of baking time, when removing the foil will help the granola recrisp. Cool to room temperature and then stash in the fridge to eat with your morning yogurt.", 
            "* To note: I originally made mine with four pounds of apples, which will explain why yours may not look as voluminous as mine. However, I felt that the apple to granola proportion was off, and the apples nearly overflowed in the baking dish, hence why I suggest you use less."
        ], 
        "date": "2009-10-12T09:57:12+00:00"
    }, 
    {
        "ingredient_list": [
            "Fruit Base", 
            "1 pound apricots", 
            "3 tablespoons sugar", 
            "1 tablespoon flour", 
            "Grated fresh nutmeg, a pinch", 
            "Crisp Topping", 
            "1/2 stick (4 tablespoons, 2 ounces) butter, melted", 
            "6 tablespoons turbinado or regular sugar (turbinado, also sold as Sugar in the Raw, gives an excellent crunch)", 
            "1/2 cup oats", 
            "1/2 cup all-purpose flour (or a mixture of whole wheat and all-purpose flour)", 
            "Pinch of salt", 
            "2 tablespoons sliced almonds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/06/2554534909_1c47b6eccb_b.jpg?w=750", 
        "tags": [
            "Apricots", 
            "Breakfast", 
            "Brunch", 
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/06/breakfast-apricot-crisp/", 
        "title": "breakfast apricot crisp", 
        "directions": [
            "Prepare fruit: Preheat oven to 400 degrees. Pull apart apricots at their seam, remove pits, and tear them one more time into quarters, placing them in a small baking dish (one that holds two to three cups is ideal). Stir in sugar, flour and pinch of nutmeg. ", 
            "Make topping: Melt butter and stir in sugar, then oats, then flour, salt and almonds until large clumps form. Sprinkle mixture over the fruit.  Bake for about 30 to 40 minutes and serve warm.", 
            "Although you could dust this with powdered sugar and serve it warm with vanilla ice cream for dessert, as I noted, it is on the tart side for an after-dinner treat. Truly, this excels cooled in the fridge overnight, and mixed with a scoop of plain yogurt for a weekday breakfast that will cure you of all weekday breakfast doldrums. It sure did for me. "
        ], 
        "date": "2008-06-07T11:43:35+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 teaspoon dry active yeast", 
            "2 cups plus 2 tablespoons bread flour, plus more for dusting", 
            "Kosher salt", 
            "6 strips bacon", 
            "1/2 cup grated Parmesan", 
            "2 cups grated mozzarella", 
            "6 large eggs", 
            "Freshly ground black pepper", 
            "2 tablespoons minced flat-leaf parsley", 
            "2 tablespoons minced chives", 
            "2 scallions, thinly sliced", 
            "1 shallot, minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/03/breakfast-pizza.jpg?w=752", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Pizza", 
            "Put An Egg On It"
        ], 
        "url": "https://smittenkitchen.com/2010/03/breakfast-pizza/", 
        "title": "breakfast pizza", 
        "directions": [
            "The night before, prepare the dough: Place 3/4 cup lukewarm water in the bowl of an electric mixer fitted with a dough hook. Sprinkle in the yeast, stir and let sit for 5 minutes. Add the flour and 1 teaspoon of salt and mix on low for 1 minute. Increase the speed to medium and mix for 2 minutes, then increase the speed to high and mix until a smooth dough forms, about 2 minutes more. Turn the dough onto a lightly floured surface, divide into two equal pieces and form each half into a tight ball. Place on a large floured sheet pan, place the pan in a plastic garbage bag, tie the bag loosely and refrigerate overnight.", 
            "One to two hours* before baking, place the dough in a warm spot. Adjust the oven rack to the lowest position and set a pizza stone on it. Preheat the oven to 500 degrees 30 minutes before you are ready to bake the pizza.", 
            "Prepare the dough and toppings: Fry the bacon in a large sauté pan over medium-high heat until crisp. Cool on a paper-towel-lined plate; roughly chop.", 
            "Dip your hands and a ball of dough into the flour. On a lightly floured countertop, pat the dough into a disc with your fingertips, then drape the dough over your fists and carefully stretch it from beneath to form a 12-inch circle.", 
            "Generously dust the surface of a pizza peel or large inverted sheet pan with flour and place the stretched dough on it. Sprinkle the dough with half of the Parmesan, mozzarella and bacon. Crack 3 eggs over the top and season with salt and pepper.", 
            "Bake the pizza: Shake the pizza peel slightly to make sure the dough is not sticking. Carefully lift any sections that are sticking and sprinkle a bit more flour underneath, then slide the pizza directly onto the baking stone in one quick forward-and-back motion. Bake for 8 to 10 minutes, rotating after 5 minutes. When the crust is golden, the cheese is melted and the egg yolks are cooked, use the peel to transfer the pizza to a cutting board. Sprinkle half of the parsley, chives, scallions and shallot on top. Let cool for 2 minutes, slice and serve immediately. Prepare the second pizza in the same way.", 
            "* The original recipe suggests that you take the dough out one hour before baking but I took mine out two hours earlier, because I always find it takes a looong time to get dough back to proofing at room temperature. In this time, you can lazily prepare the toppings and get your oven nice and hot."
        ], 
        "date": "2010-03-11T11:15:18+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "3 3/4 (470 grams) cups all-purpose flour (feel free to replace up to half with whole-wheat)", 
            "1 1/2 teaspoons table salt", 
            "3 sticks (340 grams) unsalted butter, very cold", 
            "3/4 cup very cold water", 
            "Filling", 
            "1 pound yukon gold potatoes, peeled if desired, cut into 1/2-inch slices", 
            "10 ounces spinach (baby, “grown-up,” or frozen)", 
            "1 cup coarsely grated sharp cheddar cheese", 
            "4 scallions, thinly sliced", 
            "11 large eggs + 1 large egg white (you’ll use the yolk in a minute)", 
            "1 teaspoon kosher or coarse sea salt, plus more to taste", 
            "Freshly ground black pepper", 
            "To finish", 
            "1 large egg yolk (leftover from filling)", 
            "1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/breakfast-slab-pie1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Potatoes", 
            "Spinach", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/12/breakfast-slab-pie/", 
        "title": "breakfast slab pie", 
        "directions": [
            "Make pie crust: Whisk together flour, and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in the water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough roughly in half (it’s okay if one is slightly larger). Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day. [Still freaked out about making your own pie dough? Read this for a ton of additional tips and details.]", 
            "Heat oven  oven to 375 degrees F. Line bottom of 10x15x1-inch baking sheet or jellyroll pan with parchment paper.", 
            "Prepare filling: Place potatoes in a medium saucepan and cover with cold water. Bring to a boil, then reduce to a simmer, cooking for 7 to 10 minutes, until potatoes are tender but not falling apart. Drain. ", 
            "Wash spinach but no need to dry it. Place wet spinach in hot skillet and cook until it just wilts. Drain in a colander, pressing or squeezing out as much liquid as possible. You should have about 1 cup of spinach one wilted and squeezed. If spinach leaves were large, you might want to roughly chop the squeezed-out piles of spinach before adding it to the filling. ", 
            "Assemble pie: On a lightly floured surface, roll one of your dough halves (the larger one, if you have two different sizes) into an 18-by-13-inch rectangle. This can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible and using enough flour that it doesn’t stick to the counter. Transfer to your prepared baking sheet and gently drape some of the overhang in so that the dough fills out the inner edges and corners. Some pastry will still hang over the sides of the pan; trim this to 3/4-inch overhang.", 
            "Layer vegetables evenly over bottom pie crust. [You don’t want your pie to look like this, after all. NSFW language there, btw.] If using the fillings that I did, beat 11 whole eggs and 1 egg white lightly and pour over vegetables. If you’ve used other fillings, you might find that you need more or fewer eggs to mostly fill (I did not want to fill the crust to the top with eggs, as it would have been more difficult to bake without filling) the bottom crust; if you’re nervous, just beat a few eggs at a time and pour them in until your filling reaches the desired level. Sprinkle with salt and many grinds of black pepper.", 
            "Roll the second of your dough halves (the smaller one, if they were different sizes) into a 16-by-11-inch rectangle. Drape over filling and fold the bottom crust’s overhang over the edges sealing them together. Cut only a couple tiny slits in the lid to act as vents — too many or too big, and the filling will want to leak out before the eggs set. Beat remaining egg yolk with 1 teaspoon water and brush over lid. ", 
            "Bake pie: Until crust is golden and filling is set, about 40 to 45 minutes. Transfer to a wire rack and cool a bit before cutting into squares.", 
            "Do ahead: I haven’t frozen this pie, but suspect that it will freeze well already baked. Or, you could make the pie doughs up to one month in advance (storing them in the freezer), four days in advance (to store in the fridge) and roll them out when you’re ready to bake the pie. Baked slab pie will keep in the fridge for 3 to 4 days. Squares can be reheated as needed. Vegetables can be prepped (spinach wilted, potato par-boiled) and stored in the fridge for 2 days before using."
        ], 
        "date": "2013-12-20T12:29:43+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/caramelized-brown-sugar-oranges-with-yogurt-and-mint1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Gluten-Free", 
            "Orange", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/03/caramelized-brown-sugar-oranges-with-yogurt/", 
        "title": "caramelized brown sugar oranges with yogurt", 
        "directions": [
            "Heat your broiler. ", 
            "Cut tops and bottoms off oranges, exposing the flesh inside and creating a flat edge that you can stand it up on. Then slice off all the white from each orange. Cut skinned oranges into 1/2-inch crosswise slices, so that each resemble a wheel or flower.", 
            "Line a heavy baking sheet with foil and lightly coat it with oil or a nonstick spray. Arrange orange slices in one layer on it. Dab or schmear each with a little bit of brown sugar — I used about 1/4 teaspoon on each. Run under the broiler until they begin to brown on top; this can take anywhere from 5 minutes in a very good broiler to 10 to 15 in my sleepy one. Keep an eye on it. ", 
            "Transfer oranges and any juices on tray to a bowl, cover with plastic wrap and chill in the fridge for several hours or overnight. More juices will have puddled by the morning. Place a few orange slices in a small glass or cup, top with yogurt, a spoonful of juices and mint. "
        ], 
        "date": "2016-03-31T12:07:06+00:00"
    }, 
    {
        "ingredient_list": [
            "9 tablespoons (127 grams) cold unsalted butter", 
            "1 tablespoon olive oil", 
            "2 small onions, halved and thinly sliced", 
            "2 3/4 cups (345 grams) all-purpose flour", 
            "1 tablespoon (15 grams) granulated sugar", 
            "2 teaspoons baking powder", 
            "1 teaspoon baking soda", 
            "3/4 teaspoon coarse or kosher salt", 
            "4 ounces (about 1 cup or 115 grams) gruyère or another Swiss-style cheese in 1/2-inch cubes", 
            "1 cup buttermilk (or make your own)", 
            "Flaky sea salt", 
            "Freshly ground black pepper "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/caramelized-onion-and-gruyere-biscuits1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Onions", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2015/01/caramelized-onion-and-gruyere-biscuits/", 
        "title": "caramelized onion and gruyère biscuits", 
        "directions": [
            "Heat oven to 350°F (175°C). Line a baking sheet with parchment paper or a silicone mat. ", 
            "In a large skillet over medium heat, melt 1 tablespoon butter and add olive oil. Add the onions, reduce the heat to low and place a lid on top, letting them steam for about 10 minutes, stirring occasionally. Remove the lid and continue to cook the onions, stirring occasionally, until they’re deep brown about 10 to 20 more minutes. If, for whatever reason, your onions need more time, up to 10 minutes more, don’t fret, they’ll only be more delicious for it. (Mine took a total of 22 minutes, but my stove at the lowest setting is closer to what I’d call medium, so things cook/brown too quickly.) Set aside to cool. ", 
            "In a medium bowl or the workbowl of a food processor, combine flour, sugar, baking powder, baking soda and salt. Dice 8 tablespoons remaining cold butter into 1/2-inch bits. If proceeding by hand, use your fingertips or a pastry blender to work the butter into the flour mixture until the mixture is crumbly with butter in pieces no larger than a small pea. If proceeding in a food processor, add the butter and pulse the machine in short bursts until you get the same texture, then transfer the butter-flour mixture back to a medium bowl. ", 
            "Stir in diced cheese. Pour buttermilk over cooled onions and stir to combine. Add buttermilk-onion mixture to bowl and stir until combined. It’s going to seem a little dry and will help to use your hands to knead it together a few times in the bowl; don’t worry if a couple floury spots remain. Turn the dough out onto a floured counter and roll out to a 1-inch thickness. Use a floured 3-inch cutter to stamp out circles and space them apart on prepared baking sheet. Gather the scrap and re-roll them as needed. Sprinkle biscuits with sea salt and pepper and bake until the scones are deep golden-brown and the cheese is melted and bubbly around the edges, 20 to 23 minutes.", 
            "Eat warm. They’re best on the first day, but if any survive it, they will taste better re-warmed on day two."
        ], 
        "date": "2015-01-26T12:05:48+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1 cup all-purpose flour", 
            "1 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon table salt", 
            "1/2 teaspoon ground cinnamon", 
            "1/2 teaspoon freshly grated nutmeg (I used a smidge less)", 
            "1/8 teaspoon ground ginger", 
            "2 tablespoons chopped walnuts (optional, I skipped them)", 
            "2 tablespoons golden raisins (optional, ditto)", 
            "1 large egg", 
            "2 tablespoons packed brown sugar", 
            "1 cup buttermilk", 
            "1 teaspoon pure vanilla extract", 
            "2 cups finely grated carrots (from about a 3/4 pound bundle whole carrots)", 
            "3 tablespoons butter, for griddle", 
            "Cream cheese topping", 
            "4 ounces cream cheese, at room temperature", 
            "1/4 cup powdered sugar", 
            "2 to 3 tablespoons milk", 
            "1/2 teaspoon pure vanilla extract", 
            "Dash of ground cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/03/carrot-cake-pancakes.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Carrots", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/03/carrot-cake-pancakes/", 
        "title": "carrot cake pancakes", 
        "directions": [
            "Place a rack in the upper third of your oven and preheat to 200°F. This will keep the pancakes warmed as they’re fried in batches.", 
            "To make the pancakes: In a large bowl, whisk together flour, baking powder, baking soda, salt, cinnamon, nutmeg, ginger and, if using, nuts and raisins. In a small bowl, whisk together the egg, brown sugar, buttermilk and vanilla. Stir in carrots. Stir carrot mixture into dry ingredients, stirring until just Incorporated. Let rest for five minutes while you make the cream cheese topping.", 
            "To make the cream cheese topping: In a small bowl, beat the cream cheese until fluffy and lump-free. Whisk in powdered sugar, two tablespoons milk, vanilla and cinnamon. If you’d like the mixture thinner, add the remaining tablespoon of milk (I did not).", 
            "Over medium heat, melt 1 tablespoon butter in a cast-iron skillet or griddle pan. Spoon 2 tablespoons batter into the hot pan per pancake (to me, this seemed like too little but after experimenting with larger pancakes, I advise you to listen to Joy; It’s a wiggly batter and much easier to and cook in small puddles), flipping once, until pancakes are golden on both sides, about 2 minutes per side. Transfer finished pancakes to a serving dish or tray in the oven, to keep warm while you repeat the process with the remaining batter, adding more butter as needed.", 
            "Serve warm with cream cheese topping. "
        ], 
        "date": "2012-03-19T16:45:10+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "1/2 cup (120 ml) milk, preferably whole", 
            "1/4 cup (50 grams) plus a pinch of granulated sugar", 
            "1 1/2 teaspoons (5 grams) active dry yeast", 
            "1 large egg, brought to room temperature", 
            "2 cups (250 grams) all-purpose flour, plus more for work surface", 
            "1/2 teaspoon table salt", 
            "3 tablespoons (45 grams) unsalted butter, at room temperature, plus additional for bowl and muffin tins", 
            "Filling", 
            "3 tablespoons  (45 grams) unsalted butter, at room temperature", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 pound (225 grams) semisweet chocolate", 
            "Pinch of salt", 
            "3/4 teaspoon ground cinnamon (optional)", 
            "Egg wash (optional)", 
            "1 egg", 
            "2 teaspoons (10 ml) heavy cream or milk"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chocolate-swirl-buns1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/06/chocolate-swirl-buns/", 
        "title": "chocolate swirl buns", 
        "directions": [
            "Prepare dough: Warm milk and a pinch of sugar to between 110 to 116°F. If you don’t have a thermometer, you’re looking for it to be warm but not hot to the touch; best to err on the cool side. Sprinkle yeast over milk and let stand until foamy, about 5 minutes. In a small bowl, whisk together egg and remaining 1/4 cup sugar, then slowly whisk in yeast mixture. ", 
            "In a stand mixer fitted with the paddle attachment, combine flour and salt. Run mixer on low and add egg mixture, mixing until combined. Add butter and mix until incorporated. Switch mixer to dough hook and let it knead the dough for 10 minutes on low speed. At 10 minutes, it should be sticky and stringy and probably worrisome, but will firm up a bit after it rises. Butter a large bowl and place dough in it. Cover loosely with a lint-free towel or plastic wrap and let rise for 1 hour, or until doubled. ", 
            "Meanwhile, prepare filling: If your chocolate is in large bars, roughly chop it. Then, you can let a food processor do the rest of the work, pulsing the chopped chocolate with the salt, sugar, and cinnamon (if using) until the chocolate is very finely chopped with some parts almost powdery. Add butter and pulse machine until it’s distributed throughout the chocolate. (If you don’t have a food processor, just chop the chocolate until it’s very finely chopped, then stir in the sugar, salt, cinnamon and butter until it makes a pasty/chunky/delicious mess.) Set mixture aside.", 
            "Generously butter a standard 12-muffin tin; set aside.", 
            "Form buns: Once dough is doubled, turn it out onto a well-floured surface and gently deflate it with floured hands. Let it rest for another 5 minutes. Once rested, roll dough into a large, large rectangle. The short sides should be a scant 11 to 12 inches. The other side can be as loooong as you can roll it. The longer you can make it — I got mine to 20 inches before I ran out of counter space — the more dramatic and swirled your buns will be. ", 
            "Sprinkle the filling evenly over the dough’s surface. It’ll be clumpy and uneven and probably look like there’s too much chocolate for the volume of dough; just do your best. Tightly roll the dough back over the filling from one short end to the other, forming a 12 to 13-inch log. (Yes, it always magically grows because the dough is soft.) With a sharp serrated knife, gently saw 1-inch segments off the log and place each in a prepared muffin cup. Loosely cover buns with plastic wrap or a lint-free towel and let them rise for another 30 minutes.", 
            "Meanwhile, preheat your oven to 350°F (180°C).", 
            "Bake: If you’d like, you can egg wash your buns before baking them (whisking together an egg and the cream until smooth, brush over each bun top). I found the buns I brushed with the wash shinier but otherwise virtually indistinguishable from the un-brushed buns in color. Bake buns for 15 to 20 minutes, until puffed and brown. If you have an instant read thermometer, you can take the buns out when it reads 185 to 190 degrees in the middle of each bun.", 
            "Set buns on cooling rack. Theoretically, you should cool them completely before unmolding them (with the aid of a knife or thin spatula to make sure nothing has stuck). This, of course, won’t happen, so have at them; just don’t burn your tongue. Serve with iced coffee and a bowl of berries. For nutritional balance.", 
            "Do ahead: These buns can be formed, placed in the muffin cups and refrigerated (loosely covered with plastic, which you might want to oil to keep it from sticking) the night before, to bake in the morning. You can bake them directly from the fridge. They can be baked and frozen until needed, up to 1 month. "
        ], 
        "date": "2012-06-15T11:57:21+00:00"
    }, 
    {
        "ingredient_list": [
            "Coating", 
            "2/3 cup granulated sugar", 
            "1 tablespoon ground cinnamon", 
            "6 tablespoons unsalted butter", 
            "Puffs", 
            "1 1/2 cups all-purpose flour", 
            "1 1/2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon table salt", 
            "1/4 teaspoon freshly grated nutmeg", 
            "1/2 cup granulated sugar", 
            "1/3 cup (5 tablespoons plus 1 teaspoon) unsalted butter, at room temperature, plus extra for greasing muffin cups", 
            "1 large egg", 
            "1 teaspoon pure vanilla extract", 
            "1/2 cup buttermilk "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/cinnamon-brown-butter-breakfast-puffs1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brown Butter", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/12/cinnamon-brown-butter-breakfast-puffs/", 
        "title": "cinnamon brown butter breakfast puffs", 
        "directions": [
            "Preheat oven to 350°F. Butter 12 standard size or 30 miniature muffin cups, or line cups with paper liners.", 
            "Prepare coatings: In a small saucepan, melt 6 tablespoons butter over medium heat and continue to cook it, stirring frequently, until brown bits form on the bottom and it smells nutty and heavenly. Immediately remove from heat and set aside. In a small bowl, combine 2/3 cup sugar and cinnamon. Set aside as well.", 
            "Prepare puffs: Whisk flour, baking powder, baking soda, salt and nutmeg together in a medium bowl and set aside. In the large bowl of an electric mixer, beat softened butter and sugar together until light and fluffy. Add egg and vanilla and beat until combined. Mix in 1/3 of flour mixture, followed by 1/2 of buttermilk, repeating again and finishing with the flour mixture. Mix only until combined. ", 
            "Spoon into prepared muffin cups, filling only 3/4 of the way. (I filled mine higher and they ended up spilling over a bit and doming less than they are capable of.) Bake standard sized muffins for 20 to 25 minutes and miniature muffins for 12 to 14 minutes. When finished, muffins will feel springy to the touch and a tester inserted into the center will come out clean. Transfer them in their pan to a wire rack. ", 
            "As soon as you feel you’re able to pick one up, take your first puff and roll the top and upper edges in the browned butter. Don’t be afraid to pick up the browned butter solids at the bottom of the saucepan; they’re the dreamiest part. Let any excess butter drip off for a second before gently rolling the butter-soaked cake top in cinnamon-sugar. I find if you roll too firmly, or have too much wet/not absorbed butter on top, the sugar can clump off, which is heartbreaking. Transfer puff to wire rack to set and repeat with remaining puffs. Eat warm.", 
            "For an even more indulgent, doughnut-like puff: Make an extra two tablespoons of the browned butter and roll the whole puff in it and the cinnamon sugar. (I usually have enough cinnamon sugar to fully roll the puffs.)", 
            "Do ahead: Puffs are best within hours after they are baked. They can be made it advance and stored in a freezer bag until needed, too. Simply spread them out on a baking tray and reheat them until warm in the oven."
        ], 
        "date": "2011-12-28T18:54:59+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "1 cup whole milk", 
            "3 tablespoons unsalted butter", 
            "3 1/2 cups (or more) unbleached all purpose flour, divided", 
            "1/2 cup sugar", 
            "1 large egg", 
            "2 1/4 teaspoons rapid-rise or instant yeast (from 1 envelope yeast)", 
            "1 teaspoon salt", 
            "Nonstick vegetable oil spray", 
            "Filling", 
            "3/4 cup (packed) golden brown sugar", 
            "2 tablespoons ground cinnamon", 
            "1/4 cup (1/2 stick) unsalted butter, at room temperature", 
            "Pinch of salt", 
            "Glaze", 
            "4 ounces cream cheese, at room temperature", 
            "1 cup powdered sugar", 
            "1/4 cup (1/2 stick) unsalted butter, room temperature", 
            "1/2 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cinnamon-swirl-buns-so-much-news1.jpg?w=500", 
        "tags": [
            "Announcements", 
            "Breakfast", 
            "Brunch", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/04/cinnamon-swirl-buns-so-much-news/", 
        "title": "cinnamon swirl buns + so much news", 
        "directions": [
            "For dough: Combine milk and butter in glass measuring cup. Microwave on high until butter melts and mixture is just warmed to 120°F to 130°F, about 30 to 45 seconds. Pour into bowl of stand mixer fitted with paddle attachment. Add 1 cup flour, sugar, egg, yeast, and salt. Beat on low speed 3 minutes, stopping occasionally to scrape down sides of bowl. Add additional 2 1/2 cups flour. Beat on low until flour is absorbed and dough is sticky, scraping down sides of bowl. If dough is very sticky, add more flour by tablespoonfuls until dough begins to form ball and pulls away from sides of bowl. Turn dough out onto lightly floured work surface. Knead until smooth and elastic, adding more flour if sticky, about 8 minutes. (You may also use a KitchenAid’s dough hook for this process.) Form into ball.", 
            "Lightly oil large bowl with nonstick spray. Transfer dough to bowl, turning to coat. Cover bowl with plastic wrap, then kitchen towel. Let dough rise in warm draft-free area until doubled in volume, about 2 hours.", 
            "For filling: Mix brown sugar, cinnamon and pinch of salt in medium bowl. ", 
            "Press down dough. Transfer to floured work surface. Roll out to 15×11-inch rectangle. Spread butter over dough, leaving 1/2-inch border. Sprinkle cinnamon mixture evenly over butter. Starting at the longer side, roll dough into log, pinching gently to keep it rolled up. With seam side down, trim ends straight if they are uneven (we baked them in a ramekin, incapable of discarding such deliciousness) cut remaining dough crosswise with thin sharp knife (a good serrated worked well here) into 18 equal slices (each about 1/2 to 3/4 inch wide).", 
            "Spray two 9-inch square glass baking dishes (an 8-inch square metal pan worked just fine, too) with nonstick spray. Divide rolls between baking dishes, arranging cut side up (there will be almost no space between rolls). Cover baking dishes with plastic wrap, then kitchen towel. Let dough rise in warm draft-free area until almost doubled in volume, 40 to 45 minutes, though yours, like mine, may take longer. Don’t skimp on the double-rising time.", 
            "Position rack in center of oven and preheat to 375°F. Bake rolls until tops are golden, about 20 minutes. Remove from oven and invert immediately onto rack. Cool 10 minutes. Turn rolls right side up.", 
            "For glaze: Combine cream cheese, powdered sugar, butter, and vanilla in medium bowl. Using electric mixer, beat until smooth. Spread glaze on rolls. Serve warm or at room temperature. ", 
            "Note: These buns were best the day they were baked. The second day, they were on the tough side. If you anticipate wanting them over a few days, glaze them to order, heating the buns beforehand to soften them up."
        ], 
        "date": "2009-04-15T10:30:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (100 grams) granulated sugar", 
            "1 tablespoon ground cinnamon", 
            "16 slices (from a 1-pound or 450 gram loaf) white sandwich bread", 
            "1 stick (4 ounces or 113 grams) unsalted butter, softened", 
            "3 cups (710 ml) whole milk", 
            "6 large eggs", 
            "1/4 teaspoon table salt", 
            "2 teaspoons (10 ml) vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/04/cinnamon-toast-french-toast.jpg?w=750", 
        "tags": [
            "Announcements", 
            "Breakfast", 
            "Brunch", 
            "Cookbooks"
        ], 
        "url": "https://smittenkitchen.com/2012/04/cinnamon-toast-french-toast-cookbook-preview/", 
        "title": "cinnamon toast french toast + book preview", 
        "directions": [
            "Preheat the oven to 450 degrees. Whisk the cinnamon and sugar together in a small dish. Line two large baking sheets with foil. Place the bread slices on the baking sheets in one layer. Spread each slice of bread with 1 teaspoon of butter, then sprinkle each slice with one teaspoon of the cinnamon-sugar mixture. Toast the trays of bread in the oven until the bread is golden, and until the cinnamon-sugar makes a caramelized crunch on top, for about 7 to10 minutes. Reduce the oven temperature to 375 degrees and let the toast cool slightly.", 
            "Generously butter a 9×13-inch baking dish. (You might have a little butter leftover but I wanted to build in some leeway in case, understandably, you weren’t buttering your bread with precise teaspoon measurements!) Cut two slices of the cinnamon toast in half horizontally. Arrange the cinnamon toast down in two rows along the width of the pan. Begin with the bottom half of one slice of toast, then fan 7 more slices in a row, finishing with the top half of the slice. This ensures that those served the end pieces of the baked French toast are not stiffed with thin slices! Repeat with another 7 full slices and 1 halved slice of cinnamon toast in the second row. Whisk the milk, eggs, salt and vanilla in a medium bowl and pour evenly over cinnamon toast in baking dish. Let sit for 15 minutes (or overnight, if you’re preparing this ahead of time) so that the custard absorbs a bit. ", 
            "Before baking, if you’ve got any extra cinnamon-sugar (you’ll likely have a tablespoon or two), sprinkle it over the French toast. Bake for 30 minutes, until puffed and golden and until no liquid seeps out of the toasts when they are nudged about in the pan. Cut into squares and serve plain, or with a dollop of plain yogurt and fresh berries, or maple syrup."
        ], 
        "date": "2012-04-30T10:52:49+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "1 1/4 cups (295 ml) milk", 
            "1 teaspoon (5 ml) vanilla extract", 
            "2 1/2 cups (315 grams) all-purpose flour", 
            "1/4 teaspoon table salt (see Note)", 
            "2 teaspoons (10 grams) baking powder", 
            "1 to 2 teaspoons ground cinnamon (Bill calls for 2 but I preferred 1, so that it didn’t dominate)", 
            "1 cup (200 grams) granulated sugar", 
            "5 ounces (140 grams) sweetened flaked coconut (about 1 1/2 cups)", 
            "6 tablespoons (85 grams) unsalted butter, melted or melted and browned, if desired", 
            "Vegetable oil or nonstick cooking spray for baking pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/03/coconut-bread.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brown Butter", 
            "Brunch", 
            "Coconut", 
            "Everyday Cakes", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/03/coconut-bread/", 
        "title": "coconut bread", 
        "directions": [
            "Heat oven to 350 degrees. In a small bowl, whisk together eggs, milk and vanilla.", 
            "In a medium bowl, sift together flour, salt, baking powder and cinnamon. Add sugar and coconut, and stir to mix. Make a well in the center, and pour in egg mixture, then stir wet and dry ingredients together until just combined. Add butter, and stir until just smooth — be careful not to overmix.", 
            "Butter and flour a 9×5-inch loaf pan, or coat it with a nonstick spray. Spread batter in pan and bake until a toothpick inserted into the center comes out clean, anywhere from 1 to 1 1/4 hours. Cool in pan five minutes, before turning out onto a cooling rack. ", 
            "Serve in thick slices, toasted, with butter and confectioners’ sugar or salted honey brown butter spread."
        ], 
        "date": "2013-03-18T10:26:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup ground coffee (medium-coarse grind is best)", 
            "Milk (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/08/2803598346_42470b49b0_o.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Drinks", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/08/cold-brewed-iced-coffee/", 
        "title": "cold-brewed iced coffee", 
        "directions": [
            "1. In a jar, stir together coffee and 1 1/2 cups water. Cover and let rest at room temperature overnight or 12 hours.", 
            "2. Strain twice through a coffee filter, a fine-mesh sieve or a sieve lined with cheesecloth. In a tall glass filled with ice, mix equal parts coffee concentrate and water, or to taste. If desired, add milk."
        ], 
        "date": "2008-08-27T13:46:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon butter", 
            "3 cups fresh corn (cut from 3 small-to-average cobs)", 
            "1 1/2 cup thinly sliced scallions (both white and green parts from a 4-ounce bundle)", 
            "8 cups whole wheat, country or French bread in 1-inch cubes (weight will vary from 10 to 14 ounces, depending on bread type)", 
            "2 cups (6 ounces) coarsely grated sharp cheddar", 
            "1 cup (2 ounces) finely grated parmesan", 
            "9 large eggs", 
            "2 tablespoons mayonnaise (optional, see Note up top)", 
            "2 3/4 cups milk", 
            "1 teaspoon table salt or 2 teaspoons of a coarse sea salt", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/corn-cheddar-and-scallion-strata1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Corn", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/corn-cheddar-and-scallion-strata/", 
        "title": "corn, cheddar and scallion strata", 
        "directions": [
            "Generously butter a 3-quart baking dish (a lasagna or 9×13-inch pan works well here too). Toss corn and scallions together in a medium bowl. Combine cheeses in another bowl. In a large bowl, gently beat eggs and mayo together, then whisk in milk, salt and lots (or, if measuring, 1/2 teaspoon) of freshly ground black pepper. Spread one-third of bread cubes in prepared baking dish — it will not fully cover bottom of dish; this is fine. Add one-third of corn, then cheese mixture. Repeat layering twice with remaining bread, corn and cheese. Pour egg mixture evenly over strata. Cover with plastic wrap and refrigerate for at least 8 hours or up to 1 day.", 
            "When ready to bake, heat oven to 350 degrees F. Bake strata, uncovered, until puffed, golden brown and cooked through, about 45 to 55 minutes. Let stand 5 minutes before serving. ", 
            "Do ahead: Strata keeps baked in the fridge for 4 days or longer in the freezer, wrapped well. It reheats wonderfully, either from the fridge or freezer and holds up well in lunch boxes."
        ], 
        "date": "2014-09-03T11:00:41+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (100 grams) coarse yellow cornmeal", 
            "3/4 cup (100 grams) all-purpose flour", 
            "1 teaspoon baking powder", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon kosher salt", 
            "1 tablespoon (15 ml) molasses", 
            "1 cup (235 ml) buttermilk, well-shaken", 
            "4 tablespoons (55 grams) melted unsalted butter", 
            "1 large egg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/cornbread-waffles1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Put An Egg On It", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2017/03/cornbread-waffles/", 
        "title": "cornbread waffles", 
        "directions": [
            "Combine cornmeal, flour, baking powder, baking soda and salt in the bottom of a medium bowl. In a smaller bowl, whisk molasses, butter, buttermilk and egg until combined. Pour into dry ingredients and stir to combine. Let batter rest for 10 minutes. Use this time to place a oven-safe cooling rack over a tray and heat oven to 200 degrees. Heat waffle iron according to manufacturer’s instructions; I found a medium heat just fine here.", 
            "Brush waffle iron with melted butter or coat with nonstick spray. Ladle in waffle batter, 1/4 cup at a time. (It makes 4 or so -inch finished waffles, cute ones made for an egg on top.) Cook until lightly browned and carefully transfer to rack in oven. They’ll crisp as they set. Repeat with remaining batter. You should get 8 waffles out of this, ideal for 2 per person.\nWaffles keep well for 4 days in fridge and longer in freezer. Waffles re-crisp and come back to life in a warm oven."
        ], 
        "date": "2017-03-25T08:57:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/3 cups all-purpose flour", 
            "1/3 cup sugar", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon ground cinnamon or pinch of ground nutmeg (optional)", 
            "1/4 teaspoon salt", 
            "1 cup milk", 
            "1 cup full-fat or low-fat cottage cheese", 
            "3 tablespoons butter, melted", 
            "2 large egg yolks", 
            "1 teaspoon vanilla", 
            "1/3 cups finely chopped walnuts (optional)", 
            "1/3 cup dried currants, plumped (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cottage-cheese-pancakes1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/11/cottage-cheese-pancakes/", 
        "title": "cottage cheese pancakes", 
        "directions": [
            "2 large egg whites", 
            "Pure maple syrup or honey, or plain yogurt (optional, for serving)", 
            "Lightly butter, oil, or spray your griddle–nonstick works best with these, if you have them–if needed, and preheat it over medium heat. If you are using an electric griddle, preheat it to 350 degrees F. Preheat the oven to 200 degrees F if you do not plan to serve the pancakes hot off the griddle.", 
            "Whisk flour, sugar, baking powder, baking soda, cinnamon or nutmeg and salt together in a large bowl. In a separate bowl, whisk together the milk, cottage cheese, butter, egg yolks and vanilla.", 
            "Pour the wet ingredients over the dry ingredients and gently whisk them together, mixing just until combined. Stir in the walnuts and/or currants, if using them.", 
            "Beat the two egg whites until they are stiff but not dry and fold them into the batter.", 
            "The batter will be thick and bubbly – similar to cake batter. Spoon 1/3 cup batter onto the griddle for each pancake, nudging the batter into rounds. These are thick and might take a little longer to cook than most other pancakes. Cook until the top of each pancake is starting to dry around the edges – you will get a few bubbles here and there – then turn and cook until the underside is lightly browned. These will keep in a 200 degrees F oven while you finish making the rest, but they are best served immediately, when they are at their lightest and puffiest."
        ], 
        "date": "2008-11-02T13:18:49+00:00"
    }, 
    {
        "ingredient_list": [
            "3 large ripe-to-over-ripe bananas", 
            "1 large egg", 
            "1/3 cup (80 ml) virgin coconut oil, warmed until it liquefies, or olive oil", 
            "1/3 cup (65 grams) light brown sugar", 
            "1/4 to 1/3 cup (60 to 80 ml) maple syrup (less for less sweetness, of course)", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 teaspoon (5 grams) baking soda", 
            "1/4 teaspoon table salt", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon freshly grated nutmeg", 
            "Pinch of ground cloves", 
            "Salt", 
            "1 1/2 cups (180 grams) white whole-wheat flour (or flour mixture of your choice, see Note up top)", 
            "1/4 cup (50 grams) uncooked millet"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/09/crackly-banana-bread.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/09/crackly-banana-bread/", 
        "title": "crackly banana bread", 
        "directions": [
            "Preheat your oven to 350°F and butter a 9×5-inch loaf pan. In the bottom of a large bowl, mash bananas with a potato masher or the back of a wooden spoon until virtually smooth but a few tiny lumps remain. Whisk in egg, then oil, brown sugar, syrup and vanilla extract. Sprinkle baking soda, salt, cinnamon, nutmeg and cloves over mixture and stir until combined. Stir in flour until just combined, then millet. ", 
            "Pour mixture into prepared pan and bake until a tester comes out clean, about 40 to 50 minutes. Cool loaf in pan on rack. ", 
            "Do ahead: Loaves keep well in the freezer, wrapped tightly in plastic wrap, for a month or more. Ours kept at room temperature for a record week, becoming more moist each day."
        ], 
        "date": "2012-09-28T14:32:35+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough:", 
            "4 large egg yolks", 
            "1 large whole egg", 
            "1/4 cup (50 grams) granulated sugar", 
            "6 tablespoons (85 grams) butter, melted, plus additional to grease pan", 
            "3/4 cup (175 ml) buttermilk", 
            "Zest of 1 orange, finely grated (to be used in dough and filling, below)", 
            "3 3/4 cups (470 grams) all-purpose flour, plus more for dusting counter", 
            "1 packet (7 grams or 2 1/4 teaspoons) instant dry yeast", 
            "1 1/4 teaspoons coarse or kosher salt, or more to taste", 
            "1 teaspoon oil for bowl", 
            "Filling:", 
            "1 1/2 tablespoons (20 grams) butter", 
            "1 cup (190 grams) packed light brown sugar", 
            "1 cup (115 grams) fresh cranberries", 
            "Orange zest leftover from above", 
            "Icing:", 
            "3 1/2 tablespoons (55 ml) orange juice", 
            "2 cups (240 grams) powdered sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cranberry-orange-breakfast-buns1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Cranberries", 
            "Fall", 
            "Orange", 
            "Photo", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2013/11/cranberry-orange-breakfast-buns/", 
        "title": "cranberry-orange breakfast buns", 
        "directions": [
            "Make the dough: In the bottom of the bowl of a stand mixer, whisk the yolks, whole egg, sugar, butter, buttermilk and 3/4 of the orange zest together (saving the rest for the filling). Add 2 cups of the flour along with the yeast and salt; stir until evenly moistened. Switch to the dough hook and add the remaining 1 3/4 cups flour and let the dough hook knead the mixture on low speed for 5 to 7 minutes. The dough should be soft and moist, but not overly sticky. Scrape the dough into a large, lightly oiled bowl (I usually scrape my dough briefly onto the counter, oil the mixing bowl, and scrape the dough back into it) and cover it with plastic wrap. Let dough rise at room temperature until doubled, which will take between 2 and 2 1/2 hours.", 
            "[Don’t have a stand mixer? Stir the mixture together with a wooden spoon, then continue stirring and beating it about in a large bowl for several minutes, until it comes together. Turn the dough out onto a floured counter and knead it for another 5 minutes. It will stick; don’t sweat it. Just scrape everything up and into the oiled bowl when it’s time to let it rise. Try to resist adding extra flour when it sticks; it will only toughen the dough. That would be sad.]", 
            "Prepare the filling: Melt the butter and set it aside. In a food processor, pulse the whole cranberries until they’re ground to a coarse rubble, but not fully pureed. You’ll need to scrape the machine down once or twice. Set them aside. ", 
            "[Don’t have a food processor? Just hand chop them very well, as if to coarsely mince them.]", 
            "Assemble the buns: Butter a 9×13-inch baking dish, a heavier ceramic or glass dish is ideal here. Turn the risen dough out onto a floured work surface and roll it into a rectangle that is 18 inches wide (the side nearest to you) and 12 or so inches long. (It’s okay if it goes longer/thinner.) Brush the dough with the melted butter. Sprinkle it with the brown sugar. Scatter the ground cranberries over it, then the remaining orange zest. ", 
            "Roll the dough into a tight, 18-inch long spiral. Using a sharp serrated knife, very, very gently saw the log into 1 1/2-inch sections; you should get 12. Arrange the buns evenly spread out in your baking dish. Cover with plastic wrap and refrigerate overnight, or up to 16 hours.", 
            "The next morning, bake the buns: Take your buns out of the fridge 30 minutes before you’d like to bake them, to allow them to warm up slightly. Heat your oven to 350 degrees F. Bake your buns until they’re puffed and golden (the internal temperature should read 190 degrees F), approximately 30 minutes.", 
            "Transfer pan to a cooling rack and let cool slightly. Make the icing by whisking the orange juice and powdered sugar together. Spread a little on each bun, or drizzle it over the whole pan. Serve immediately. ", 
            "Many notes:"
        ], 
        "date": "2013-11-13T11:31:56+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons (45 grams) melted butter", 
            "2 cups (250 grams) all-purpose flour, plus more for dusting the surface", 
            "1 tablespoon (15 grams) baking powder", 
            "1/2 teaspoon salt", 
            "1 tablespoon (15 grams) sugar (optional)", 
            "1 1/2 cups (355 ml) heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cream-biscuits1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Scones/Biscuits", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2009/12/cream-biscuits/", 
        "title": "cream biscuits", 
        "directions": [
            "Preheat the oven to 425°F. Line a baking sheet with parchment paper. Melt butter in a small pot or microwave dish, and set aside. Sift two cups flour, the baking powder, salt and (if using) sugar into a large bowl. Fold in 1 1/4 cups cream. If the dough is not soft or easily handled, fold in the remaining 1/4 cup cream, little by little. (I ended up using two additional tablespoons, or half the unused cream.)", 
            "Turn dough onto a floured surface, mound it into a ball and, using your hands, press it to a thickness of about 3/4 inch. Cut into rounds, 2 1/2 inches in diameter. Gather dough scraps and continue to make rounds. Dip the top of each round in melted butter and arrange on the baking sheet. Bake until golden, 12 to 15 minutes. Serve immediately, or flash freeze for future use. [Biscuits can be baked straight from the freezer, and additional few minutes baking time will be needed, usually around 3 to 5.]"
        ], 
        "date": "2009-12-03T11:02:22+00:00"
    }, 
    {
        "ingredient_list": [
            "Toasts", 
            "1 loaf unsliced white bread, brioche or rich bread of your choice", 
            "1 1/3 cups whole milk", 
            "2/3 cup heavy cream", 
            "4 large eggs", 
            "1/3 cup granulated sugar", 
            "1/4 teaspoon fine sea salt or table salt", 
            "1 teaspoon Grand Marnier or another orange liqueur or 1/4 teaspoon orange zest", 
            "1 vanilla bean or 2 teaspoons vanilla extract", 
            "Topping", 
            "2/3 cup granulated sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creme-brulee-french-toasts1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/05/creme-brulee-french-toasts/", 
        "title": "crème brûlée french toasts", 
        "directions": [
            "Cut bread into 1 1/2-inch thick, generous slices; a 9-inch loaf should yield 6 slices. Whisk together milk, cream, eggs, sugar, salt, liqueur, and vanilla extract, if using. If using a vanilla bean, halve it lengthwise and scrape the pulp into a small dish. Whisk vanilla bean with one tablespoon of custard, then whisk in another and a third tablespoon, then pour the vanilla bean-custard mixture back into the main batter. This avoids having vanilla bean clumps that don’t disperse in your batter. Don’t you hate that?", 
            "Preheat oven to 325. Arrange bread slices on the smallest rimmed tray that will fit them in one layer (encourages maximum absorption) pour custard over slices. Allow them to absorb the custard for 30 minutes, turning the slices over at one point to ensure they’re soaking it up evenly. [Do ahead: You can also soak them overnight in the fridge. No need to flip them if so.]", 
            "Line a baking sheet with parchment paper. Transfer custard-soaked slices to prepared sheet, arranging them with a smidge of space between each to avoid making one French mega-toast. Flipping them halfway through if you wish, bake French toast slices for 30 to 35 minutes, until a slim knife inserted into the center of a slice and twisted ever-so-slightly does not release any wet custard. Keep warm until ready to serve.", 
            "To caramelize the tops: Either leave toasts on their baking sheet, or transfer to a serving platter. Have ready a small offset spatula and a potholder or trivet to rest your caramel pot on.", 
            "Melt remaining 2/3 cup sugar in a small, heavy, completely dry saucepan over moderate heat, stirring with a small spoon or fork until fully melted and the color of honey. Move it over to the potholder or trivet you’d set up and working quickly, spoon one generous tablespoon caramel over your first slice of toast, spread it thinly and evenly with your offset spatula and repeat with the remaining toasts. Because your caramel will continue to deepen slightly in color (veering towards almost-too-toasty) as you work, it’s best to work quickly but carefully. Let no fingers or forearms be harmed in the melted sugar’s path and should a single drop land on the counter or on your towel or on the rim of the plate, do not swipe it. Just leave it until it cools.", 
            "[Hot water will melt all hardened caramel and make your clean up job easy. Simply soak your pot/spoon/spatula and all will melt off.]", 
            "Serve with fresh berries and if you’re feeling extra fancy, loosely whipped cream. We don’t find that it needs any maple syrup.", 
            "Alternative top-caramelizing method: A really obvious question here would be “But would the broiler work?” The method would be to sprinkle each toast with 1 tablespoon of granulated sugar and let the broiler do the torching for you. However, my broiler doesn’t work. Never has, so I cannot test this. But, if it’s anything like my attempt (explained in the post) to use a blowtorch, I’m not feeling overly confident about it because the unevenness of the toasts leads to edges singeing before the sugar fully melts. But if you try this method, please report back in the comments as to how it went. I’m sure plenty of folks would prefer to avoid melting sugar."
        ], 
        "date": "2011-05-06T10:51:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour", 
            "3/4 teaspoon ground cinnamon", 
            "1 tablespoon ground ginger", 
            "1/8 teaspoon ground cloves", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1 1/2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/4 teaspoon fine sea or table salt", 
            "1/2 cup buttermilk, yogurt thinned with a little milk, fresh apple cider or even stout beer", 
            "1/2 cup molasses", 
            "1/2 cup dark brown sugar, packed", 
            "1/4 cup granulated sugar", 
            "1 large egg", 
            "3 tablespoons butter, melted, plus extra for brushing waffle iron", 
            "Powdered sugar for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/deep-dark-gingerbread-waffles11.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Christmas", 
            "Photo", 
            "Waffles", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/deep-dark-gingerbread-waffles/", 
        "title": "deep dark gingerbread waffles", 
        "directions": [
            "In a large bowl, whisk together the flour, cinnamon, ginger, cloves, nutmeg, baking powder, baking soda and salt. In a medium bowl, whisk together the buttermilk, molasses, sugars, egg and butter until combined. The butter will likely firm up and make little white splotches throughout; this is a-okay. Pour the wet into the dry ingredients and stir until just combined. ", 
            "Heat waffle iron to a middle heat. Either brush waffle iron with melted butter or spray it lightly with a nonstick cooking spray. Ladle gingerbread batter into waffle iron until they’re about 3/4 filled out. Cook according to manufacturer’s directions. In my waffle iron, I like to cook them 1 to 2 minutes more.", 
            "To remove waffles: Open waffle iron. Wait about 30 seconds, giving them a chance to steam off a little. With tongs in one hand and a small spatula in the other, gently, carefully lift corners of each waffle section enough to slide the spatula underneath, then lift and slide some more until you can get the section out. Curse Deb, because these waffles are very sticky and eager to tear. Trust Deb, that they will be worth it. Spread them on a tray in a single layer to let cool slightly; within 1 minute, they should be crisp to the touch and easier to lift. Repeat with remaining batter. Try not to stack waffles — even though they’re firm, they will stick.", 
            "Serve immediately, dusted with powdered sugar and, if you’re feeling fancy, a dollop of barely or unsweetened whipped cream or crème fraîche."
        ], 
        "date": "2014-12-18T11:54:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (110 grams) virgin coconut oil", 
            "3/4 cup (95 grams) all-purpose flour", 
            "1/2 cup (60 grams) whole wheat flour", 
            "1 1/2 teaspoons baking powder", 
            "1/4 teaspoon table salt", 
            "1 cup (230 grams) full fat Greek-style yogurt, at room temperature is best", 
            "1/3 cup (65 grams) granulated sugar", 
            "1 large egg, at room temperature is best", 
            "1 teaspoon (5 ml) vanilla extract", 
            "3/4 cup (90 grams) sweetened shredded coconut, divided"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/02/double-coconut-muffins.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Coconut", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/02/double-coconut-muffins/", 
        "title": "double coconut muffins", 
        "directions": [
            "Preheat oven to 375°F. Either grease 10 muffin cups with butter or coconut oil, or line them with papers. ", 
            "[Oh, you’re out of paper liners too? Cut parchment paper into 5-inch squares and form them into your empty muffin cups, pressing any creases flat. They won’t stay put until you fill them with batter, and you should make sure you push that batter down so it gets into the corners, but otherwise, they should work as well as the real deal.] ", 
            "In a small saucepan, warm your coconut oil just until it melts. It should still be on the cool side.", 
            "In a medium bowl, whisk together your flours, baking powder and salt. Stir 1/2 cup shredded coconut. In a separate bowl, whisk together egg, sugar, coconut oil, yogurt and vanilla. Stir into dry ingredients until just combined. Divide batter among prepared muffin cups then sprinkle the top with remaining 1/4 cup coconut, about 1 to 2 teaspoons on each.  ", 
            "Bake until a tester inserted into the center comes out batter-free, about 20 minutes. Transfer muffins to a rack and let cool.", 
            "Do ahead: Usually, muffins are best on day one but I just had one of these on day three and found them almost as moist and tender as day one. Store in an airtight container at room temperature."
        ], 
        "date": "2012-02-22T10:32:45+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups (280 grams) unbleached all-purpose flour, preferably a low-protein brand such as Gold Medal or Pillsbury", 
            "1 tablespoon (15 grams) baking powder", 
            "3 tablespoons (40 grams) sugar", 
            "1/2 teaspoon (3 grams) fine sea or table salt", 
            "5 tablespoons (70 grams) chilled, unsalted butter, cut into 1/4-inch cubes", 
            "1/2 cup currants (about 80 grams; I used dried cranberries, and chopped them into smaller bits)", 
            "1 cup (235 ml) heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/287700377_4613923001_o.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2006/11/dream-a-little-dream-of-scone/", 
        "title": "dreamy cream scones", 
        "directions": [
            "1. Adjust oven rack to middle position and heat oven to 425°F.", 
            "2. Place flour, baking powder, sugar and salt in large bowl or work bowl of food processor fitted with steel blade. Whisk together or pulse six times.", 
            "3. If making by hand, use two knives, a pastry blender or your fingertips and quickly cut in butter until mixture resembles coarse meal, with a few slightly larger butter lumps. Stir in currants. If using food processor, remove cover and distribute butter evenly over dry ingredients. Cover and pulse 12 times, each pulse lasting 1 second. Add currants and pulse one more time. Transfer dough to large bowl.", 
            "4. Stir in heavy cream with a rubber spatula or fork until dough begins to form, about 30 seconds.", 
            "5. Transfer dough and all dry, floury bits to countertop and knead dough by hand just until it comes together into a rough, sticky ball, 5 to 10 seconds. Form scones by either a) pressing the dough into an 8-inch cake pan, then turning the dough out onto a lightly floured work surface, cutting the dough into 8 wedges with either a knife or bench scraper (the book’s suggestion) or b) patting the dough onto a lightly floured work surface into a 3/4-inch thick circle, cutting pieces with a biscuit cutter, and pressing remaining scraps back into another piece (what I did) and cutting until dough has been used up. (Be warned if you use this latter method, the scones that are made from the remaining scraps will be much lumpier and less pretty, but taste fine. As in, I understand why they suggested the first method.)", 
            "6. Place rounds or wedges on ungreased baking sheet and bake until scone tops are light brown, 12 to 15 minutes. Cool on wire rack for at least 10 minutes. Serve warm or at room temperature."
        ], 
        "date": "2006-11-03T15:24:02+00:00"
    }, 
    {
        "ingredient_list": [
            "7 tablespoons all purpose flour", 
            "1 tablespoon sugar", 
            "1 teaspoon baking soda", 
            "1/ 2 teaspoon salt", 
            "1 cup sour cream (I swapped some with yogurt when I realized I was short, to no ill-effect)", 
            "2 large eggs", 
            "1/2 teaspoon vanilla extract", 
            "Butter", 
            "Maple syrup (or perhaps some Cranberry Syrup)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/edna-maes-sour-cream-pancakes1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/01/edna-maes-sour-cream-pancakes/", 
        "title": "edna mae’s sour cream pancakes", 
        "directions": [
            "Heat a cast iron skillet or griddle over medium-low heat; you want it to slowly get nice and hot.", 
            "Stir the flour, sugar, baking soda and salt together in the bottom of a medium bowl. Dump the sour cream in on top and stir it together very gently; it’s okay to leave the texture a bit uneven. Whisk the eggs and vanilla in a separate bowl and stir them into the sour cream mixture, once again, being careful not to overmix.", 
            "Melt about a tablespoon of butter in your skillet or griddle and pour the batter in, a scant 1/4 cup at a time. Cook for about 2 minutes on the first side, or until bubbles appear all over the surface [See Pancakes 101 for this and other tips], flipping them carefully and cooking for about a minute on the other side. Repeat with remaining batter.", 
            "Serve in a stack, topped with a pat of butter and a cascade of maple syrup."
        ], 
        "date": "2010-01-24T11:31:26+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups whole milk", 
            "2 tablespoons granulated sugar", 
            "2 teaspoons (10 grams) crumbled fresh yeast or 1 teaspoon active or instant dry yeast", 
            "2 cups (240 grams) all-purpose flour, sifted", 
            "1/2 teaspoon finely grated nutmeg", 
            "1/4 teaspoon ground cloves", 
            "1/4 teaspoon fine sea salt", 
            "3 large eggs, separated", 
            "7 tablespoons (100 grams) unsalted butter, melted", 
            "1 teaspoon vanilla extract or the seeds from half a vanilla bean", 
            "2 tablespoons dark rum, brandy or bourbon (optional)", 
            "Powdered sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/eggnog-waffles1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Gift Guides", 
            "Photo", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2015/12/eggnog-waffles-a-few-favorite-kitchen-things/", 
        "title": "eggnog waffles + a few favorite kitchen things", 
        "directions": [
            "Combine milk and granulated sugar and heat until lukewarm, no more than 116 degrees F. Stir in yeast and set aside for 5 minutes. ", 
            "Meanwhile, whisk flour, nutmeg, cloves and salt together in a large bowl. Create a well in the center and pour in the milk-yeast mixture, the 3 yolks, butter, vanilla and rum. Mix until you have a smooth batter. ", 
            "Place egg whites in a clean bowl and beat with an electric mixer until stiff peaks form. Fold egg whites batter. ", 
            "Let batter stand at room temperature for 30 minutes, then cook according to your waffle-maker’s instructions. ", 
            "You can keep waffles warm in 225 degrees F oven until needed.  Dust with powdered sugar before serving."
        ], 
        "date": "2015-12-12T08:16:02+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/eggs-in-purgatory-puttanesca-style1.jpg?w=640", 
        "tags": [
            "Brunch", 
            "Budget", 
            "Eggs", 
            "Italian", 
            "Photo", 
            "Quick", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/03/eggs-in-purgatory-puttanesca-style/", 
        "title": "eggs in purgatory, puttanesca-style", 
        "directions": [
            "On a cutting board, pile garlic, 1/4 cup parsley, olives, capers, anchovies (if using), oregano and pepper and run a knife through them again and again until they’re chopped into a tiny rubble. Heat a small-medium skillet over medium heat. Once hot, swirl in a glug of olive oil and let it warm. Add garlic-parsley heap to pan and cook, stirring, 2 minutes. Add tomatoes carefully because they’re going to splatter like crazy, nd stir to combine. Lower heat to medium-low and simmer sauce for 5 minutes. Taste and add salt or more pepper flakes if needed.", 
            "Make a small indentation in the sauce for each egg you’re using, and crack them in. Sprinkle the eggs and sauce with parmesan and cover pan pan partially with a lid. [This is when you should toast your bread; I like to brush mine with olive oil and run it under the broiler.] Let the eggs cook for 5 minutes, after which the whites are usually set and the yolks still loose, but when I use more than 1 to 2 eggs in the pan, this can take longer. Cook another minute or two if needed, but keep a close watch so you don’t accidentally hard cook them.", 
            "Drizzle pan with a little extra olive oil, then finish with more pepper, cheese and parsley. Eat with toasted bread."
        ], 
        "date": "2016-03-22T11:50:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup warm water (about 105 to 110 degrees, so not too hot)", 
            "1 packet (1/4 ounce, 7 grams or 2 1/4 teaspoons) active dry yeast", 
            "2 cups milk, warmed (again, not too hot", 
            "1 stick (4 ounces or 115 grams) unsalted butter, melted and cooled until lukewarm", 
            "1 teaspoon table salt", 
            "1 teaspoon granulated sugar", 
            "2 cups (250 grams) all-purpose flour", 
            "2 large eggs", 
            "1/4 teaspoon baking soda", 
            "Oil or melted butter for waffle iron", 
            "Powdered sugar, syrup or berries for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/essential-raised-waffles1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2013/05/essential-raised-waffles/", 
        "title": "essential raised waffles", 
        "directions": [
            "The night before: Pour warm water in the bottom of a large (larger than you think you’ll need, because the batter will rise a lot) bowl. Sprinkle yeast on top and let it dissolve and foam ever-so-slightly for 15 minutes. Stir in milk, butter, salt, sugar and flour — I do a little bit of wet ingredients then a little bit of dry, back and forth, to avoid forming lumps. If lumps form, you can mostly whisk them out. ", 
            "Cover bowl with plastic wrap and set out on counter (see Note up top for debate on this) overnight.", 
            "The next morning, whisk in eggs and baking soda until smooth. Heat waffle iron** (a thinner one is better than a Belgian-style one, as these will not rise enough to fill a tall one out) and coat lightly with butter or oil. Ladle in 1/2 to 3/4-cup batter per waffle batch. The batter will be very thin and will spread a lot in the pan, so err on the side of underfilled until you figure out the right amount. Repeat with remaining batter.", 
            "Waffles can be kept crisp in a warm oven until needed. If you only want to make a few at a time, the batter keeps well in the fridge for several days, says Cunningham.", 
            "** I suspect someone will ask me here about the waffle iron I use. It’s this one. I bought it last year when I was working on a story about breakfast egg sandwiches (which I just realized never ran, hmm) and I wanted to make one with waffles. I honestly do not care for it or any waffle iron I’ve ever owned for one reason, a reason that makes me a little shouty: why don’t waffles irons have removable plates for washing?! I have yet to see one and cleaning them is such an ordeal; this is the only waffle recipe I’ve loved enough that it has felt worth the bother."
        ], 
        "date": "2013-05-07T11:17:43+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons (45 grams) unsalted butter, plus more for buttering pan", 
            "1 1/4 cup (295 ml) milk (and sometimes a splash more)", 
            "4 large eggs", 
            "1 cup (125 grams) all-purpose flour", 
            "Two pinches of salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/failproof-crepes-a-crepe-party1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Pancakes", 
            "Photo", 
            "Recipes"
        ], 
        "url": "https://smittenkitchen.com/2016/05/failproof-crepes-a-crepe-party/", 
        "title": "failproof crepes + a crepe party", 
        "directions": [
            "In the bottom of a large bowl, melt your butter halfway, then stir until fully melted. (This keep it from getting so hot that it will prematurely cook the eggs.) Add milk, eggs, flour and salt and whisk to combine. It’s going to be a little lumpy. It’s going to be okay. Cover with plastic wrap and refrigerate for 1 hour and up to 4 days until needed.", 
            "When ready to cook, cover a large plate or platter with a layer of paper towels. Remove plastic from batter bowl and whisk to remove any remaining lumps. ", 
            "Quick directions for the confident: Heat skillet over medium-low. Butter skillet. Ladle in 1/4 cup batter, roll around. Cook until golden underneath, flip. Repeat, adjusting heat and re-buttering skillet as needed.", 
            "Detailed directions for the nervous: Heat a skillet (a nonstick will give you the fewest headaches;  I use this discontinued one) over medium-low. When hot, lightly butter it. Ladle in 1/4 cup batter (this amount for a 9/10-inch) and tilt and roll the pan until the bottom is covered. If this is extremely difficult cover because the batter is too thick, whisk in another splash of milk. If a stubborn hole won’t easily fill with batter, add a drop on top of it to fill it in; it will all be the same in the end.", 
            "Cook for 2 to 3 minutes on the first side, until faintly golden underneath. If this happens too quickly, reduce heat to low. Use a long thin spatula (I swear by a flexible fish spatula as well as a small offset, for this an all things in the kitchen) that can really get under the crêpe through the middle and lift and flip it over. Spatula not long enough? Put one in each hand, use the first one to lift as much as possible, and the second one to get under the crêpe further and finish the job. If it folds or crinkles, don’t fret, it’s surprisingly easy to stretch out wrinkles and shimmy the crêpe back flat. If it tears, it likely would have benefitted from another 20 seconds cooking time to better firm up underneath. Cook on the second side for 20 to 30 seconds, then slid out onto prepared platter.", 
            "Repeat with remaining batter. I do not need to rebutter a good nonstick between crêpes, only every 3 or 4. Crêpes, even warm, can be stacked and they will not stick to each other. ", 
            "To store: Wrap stack of crêpes in plastic, foil or place in an airtight container in the fridge overnight. ", 
            "To rewarm: Arrange in a baking dish (overlapped is fine) covered with foil and warm in a 250 degree oven for 10 to 15 minutes. ", 
            "Serve: With a couple sweet and savory toppings. For ideas, look no further: ", 
            "Sweet topping ideas", 
            "Savory topping ideas"
        ], 
        "date": "2016-05-03T11:48:55+00:00"
    }, 
    {
        "ingredient_list": [
            "2 to 3 tablespoons olive oil", 
            "1/2 small yellow onion, chopped", 
            "2 cloves garlic, crushed then minced", 
            "1 red bell pepper, cored and sliced into thin strips", 
            "1 yellow bell pepper, cored and sliced into thin strips", 
            "1 Anaheim or 1 jalapeño chile, cored and sliced into thin strips", 
            "1/2 teaspoon ground cumin", 
            "1 teaspoon paprika", 
            "1/4 teaspoon table salt", 
            "1 14-ounce can crushed tomatoes, fire-roasted if you can get them", 
            "6 eggs", 
            "1/2 cup feta cheese, crumbled", 
            "2 teaspoons (or more to taste) za’atar", 
            "1 to 2 tablespoons chopped flat-leaf parsley (optional), to garnish", 
            "6 small or 4 large pitas", 
            "Pickled shallots", 
            "1/4 cup red or white wine vinegar", 
            "2 teaspoons kosher salt", 
            "1 1/2 teaspoons sugar", 
            "1/4 cup water", 
            "3 small shallots, peeled and thinly sliced", 
            "Asparagus pesto", 
            "1/2 pound asparagus spears, trimmed of tough ends", 
            "1 garlic clove, peeled and chopped", 
            "1/4 cup grated Parmesan cheese", 
            "3 tablespoons pine nuts or almonds, toasted and cooled, divided", 
            "1/4 teaspoon table salt, or a little more of a coarse sea salt", 
            "2 tablespoons olive oil", 
            "To assemble", 
            "6 large slices whole-wheat sourdough bread, miche, or another sliced country bread of your choice, toasted", 
            "2 tablespoons whole grain Dijon mustard", 
            "6 large hard-boiled eggs", 
            "2 to 3 slices of bacon, halved to approximate sandwich lengths", 
            "2 thin slices white, sourdough or a country bread, toasted", 
            "4 thin slices of tomato", 
            "A few leaves of iceberg lettuce", 
            "1 tablespoon mayonnaise", 
            "1 large egg", 
            "1 teaspoon butter", 
            "Salt and freshly ground black pepper to taste", 
            "1 pound Yukon Gold potatoes, cut into small (about 1/2-inch) cubes", 
            "1 tablespoon olive or vegetable oil", 
            "1/2 small onion, finely chopped", 
            "1/2 pound Mexican chorizo, casings removed", 
            "Salt", 
            "Freshly ground black pepper", 
            "6 large eggs", 
            "8 small corn tortillas, warmed or blistered in a hot pan", 
            "To finish", 
            "Crumbled queso freso (cotija, ricotta salata and feta are decent substitutes, if you can’t find it)", 
            "Chopped cilantro, diced tomatoes, diced white onions (you can also sink these in the same pickle brine as the shallots in the earlier recipe), pickled jalapenos, a dollop of crèma or sour cream, a squeeze of lime juice, a dash or hot sauce or all of the above", 
            "Waffles", 
            "3/4 cups all-purpose flour", 
            "3/4 cups cornmeal", 
            "1 1/2 teaspoons baking powder", 
            "1 teaspoon granulated sugar", 
            "1/2 teaspoon table salt", 
            "1 cup buttermilk", 
            "1 tablespoon unsalted butter, melted and cooled slightly", 
            "1 large egg", 
            "1/2 cup finely grated cheddar cheese", 
            "Spray cooking oil to coat waffle iron", 
            "Creamed greens", 
            "5 ounces baby spinach or another fairly quick-cooking green of your choice, stemmed if stems are heavy", 
            "Butter", 
            "1/4 small onion, finely chopped", 
            "3 tablespoons heavy cream", 
            "To assemble", 
            "4 large eggs", 
            "Hot sauce and diced fresh tomatoes (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/five-new-ways-to-make-egg-sandwiches1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2014/05/five-egg-sandwiches/", 
        "title": "five egg sandwiches", 
        "directions": [
            "Preheat your oven to warm and place a tray on a middle rack.", 
            "Make waffles: Whisk flour, cornmeal, baking powder, sugar and salt in a medium bowl. In a smaller bowl, whisk together buttermilk, butter and egg. Stir wet ingredients and grated cheese into the dry mixture until combined. ", 
            "Make waffles according to your manufacturer’s directions. In the waffle iron I used – a thin one that made 6 rectangular waffles per batch – I cooked the waffles on the middle heat setting and needed 1 1/4 to 1 1/2 cups batter per batch. I made about 1 1/2 batches, yielding 9 small waffles. ", 
            "Transfer waffles to tray in warmed oven and leave them there while you cook your greens.", 
            "Prepare creamed greens: Wash greens but no need to dry them. In a large skillet over medium-high heat, cook the greens until wilted. For baby spinach, we prefer it just barely wilted, which takes just a minute. For heartier greens, you’ll want to cook them a few minutes longer. Transfer greens to a colander and press out as much extra liquid as you can. If desired, coarsely chop greens. ", 
            "Wipe out pan and return it to medium heat. Melt butter and then cook onion until soft and tender, about 5 minutes. Return greens to pan and drizzle heavy cream over them. Cook, stirring, until cream simmers for a minute and mixture is evenly combined. Season with salt and freshly ground black pepper and set aside.", 
            "Poach eggs: Poach eggs according to your favorite method. If you don’t have one, here’s mine: Heat a saucepan with a few couple inches of water to the point right before it simmers. Using a cooking spoon, create a whirlpool and crack your egg right into the center of it and stop swirling. The egg should mostly wrap around itself. Continue to let the egg cook, keeping the water from fully simmering, until the white is firmed up but it the egg still jiggles from the middle when nudged with a spoon, about 3 to 4 minutes. Scoop out with a slotted spoon and repeat with remaining eggs.", 
            "Assemble sandwiches: Place one square or wedge of waffle on a plate. Top with 1/4 of the creamed greens and a single poached egg. Dash with hot sauce, if desired, or a scattering of chopped tomatoes. Top with a second square or wedge of waffle and eat, precariously. "
        ], 
        "date": "2014-05-16T10:36:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds Yukon Gold potatoes, scrubbed and cut into 1/2-inch to 3/4-inch cubes", 
            "4 tablespoons salted butter", 
            "1 onions, finely chopped", 
            "Salt and pepper to taste", 
            "Seasoning of your choice: Garlic powder or salt work great, as does smoky Spanish paprika or chopped chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/home-fries1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It"
        ], 
        "url": "https://smittenkitchen.com/2008/11/home-fries/", 
        "title": "home fries", 
        "directions": [
            "1. Arrange potatoes in large microwave-safe bowl, top with 1 tablespoon butter, and cover tightly with plastic wrap. Microwave on high until edges of potatoes begin to soften, 5 to 7 minutes, shaking bowl (without removing plastic) to redistribute potatoes halfway through cooking.", 
            "2. Meanwhile, melt 1 tablespoon butter in large regular or nonstick skillet over medium heat. Add onion and cook until softened and golden brown, about 6 minutes. Transfer to small bowl.", 
            "3. Melt remaining 2 tablespoons butter in now-empty skillet over medium heat. Add potatoes and pack down with spatula. Cook, without moving, until underside of potatoes is brown, 5 to 7 minutes. Turn potatoes, pack down again, and continue to cook until well browned and crisp, 5 to 7 minutes. Reduce heat to medium-low and continue cooking, stirring potatoes every few minutes, until crusty and golden on all sides, 9 to 12 minutes. Stir in onion, seasonings of your choice and salt and pepper to taste."
        ], 
        "date": "2008-11-08T20:40:44+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/how-to-host-brunch-and-still-sleep-in1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Tips"
        ], 
        "url": "https://smittenkitchen.com/2009/12/how-to-host-brunch-and-still-sleep-in/", 
        "title": "how to host brunch (and still sleep in)", 
        "directions": [], 
        "date": "2009-12-21T12:47:44+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/08/2743288262_5d512b21c9_o.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Tips"
        ], 
        "url": "https://smittenkitchen.com/2008/08/how-to-poach-an-egg-smitten-kitchen-style/", 
        "title": "how to poach an egg, smitten kitchen-style", 
        "directions": [], 
        "date": "2008-08-08T17:04:18+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups all-purpose flour, plus additional for work surface", 
            "1 cup cake flour (or, make your own)", 
            "1/4 cup granulated sugar", 
            "1 1/2 teaspoons baking soda", 
            "1 1/2 teaspoons cream of tartar", 
            "1 teaspoon table salt (this is 2/3 the original amount, which I found too salty)", 
            "5 tablespoons unsalted butter (4 tablespoons softened, 1 tablespoon melted)", 
            "1 1/4 cups buttermilk (or, make your own)", 
            "1 egg, lightly beaten", 
            "1 cup currants or raisins", 
            "1 tablespoons caraway seeds (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/03/irish-soda-bread-scones.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2010/03/irish-soda-bread-scones/", 
        "title": "irish soda bread scones", 
        "directions": [
            "Heat oven to 400 degrees with a rack in the upper-middle position. Whisk dry ingredients (flours, sugar, baking soda, cream of tartar and salt) in a large bowl. Work the softened butter into the dry ingredients with a fork, pastry blender or your fingertips until the flour mixture resembles coarse crumbs.", 
            "Add the wet ingredients (buttermilk and egg), currants or raisins and caraway seeds, if you’re using them, and stir with a fork until the dough just begins to come together. Turn out onto a work surface (CI says you need a floured one but I didn’t agree) and knead until the dough just becomes cohesive and bumpy. You’re not going for a smooth dough — CI warns that this will make it tough.", 
            "Pat dough into a round and use a knife or dough divider to cut it into 8 wedges. Form each wedge into a round and place on a parchment-lined or greased baking sheet. Cut a cross shape into the top of each. Bake for 15 to 20 minutes, or until the internal temperature reaches 170 degrees (this is especially helpful in this recipe, where doneness is hard to judge from the outside). Scones should be golden brown a skewer should come out clean. Remove from the oven and brush with butter before cooling to room temperature. Eat on day one."
        ], 
        "date": "2010-03-15T09:58:16+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups all-purpose flour", 
            "1 tablespoon baking powder", 
            "1 teaspoon salt", 
            "8 tablespoons (1 stick or 4 ounces) cold butter, diced", 
            "1/2 cup heavy cream", 
            "3 eggs, divided", 
            "1/4 pound sharp Cheddar cheese, diced", 
            "2 small jalapeños pepper, minced (I wimped out and used only one only to find my scones entirely heat-free)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/jalapeno-cheddar-scones.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Cheese", 
            "Peppers", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2009/10/jalapeo-cheddar-scones/", 
        "title": "jalapeño-cheddar scones", 
        "directions": [
            "Preheat oven to 400°F. In a small skillet, melt 1/2 tablespoon of butter and sauté the jalapeños in it until soft, about two minutes. Let them cool, then place them in a small bowl with the cheddar cheese and coat them with one tablespoon of the flour. Combine the remaining flour with the baking powder and salt. Cut in the remaining butter with a pastry blender, fork or two knives, until the butter bits are pea sized.", 
            "Lightly whip two of the eggs and cream and add to the flour-butter mixture. Using a wooden spoon, fold mixture until it begins to come together. Add the cheddar-jalapeño mixture to the dough and mix until everything is incorporated.", 
            "Turn out the dough onto a well-floured surface and knead gently for less than one minute. Pat dough out to a 3/4- to 1-inch thickness and either cut into 8 triangles or the shape of your choice with a biscuit cutter. Make an egg wash by beating the remaining egg with a teaspoon of water. Brush the scones with egg wash and place on a parchment-lined (or well-oiled) baking sheet. Bake for 25 minutes or until golden brown.", 
            "Scones are always best the first day.", 
            "Want to flash-freeze yours, as I did? Brief directions, here."
        ], 
        "date": "2009-10-15T13:41:15+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 teaspoons (1 7-gram or 1/4-ounce packet) active dry yeast", 
            "1/4 cup (50 grams) granulated sugar", 
            "3/4 cup (180 ml) lukewarm (not hot) milk", 
            "2 large egg yolks", 
            "Few gratings of orange or lemon zest, 1 teaspoon vanilla or 1/2 teaspoon almond extract", 
            "2 tablespoons (1 ounce or 30 grams) butter softened", 
            "2 1/3 cups (290 grams) all-purpose flour", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 egg white, whisked until frothy (for peskier filling method)", 
            "Vegetable oil for deep-frying, and coating bowl", 
            "1/2 to 2/3 cup jam or preserves of your choice", 
            "Powdered sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/jelly-doughnuts1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Doughnut", 
            "Hanukah", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/12/jelly-doughnuts/", 
        "title": "jelly doughnuts", 
        "directions": [
            "Make the dough: In the bottom of a large mixing bowl, combine the yeast, sugar and milk. Let stand for 5 minutes; it should become a little foamy. Whisk in yolks, any zest or extracts you’d like to use, then butter. Don’t worry if the butter doesn’t fully combine. ", 
            "— By hand: Add half of flour and stir with a spoon until combined. Add second half of flour and salt and stir as best as you can with a spoon, then use your hands to knead the dough until it forms a smooth, elastic round, about 5 minutes. Try, if you can, to resist adding extra flour, even if it’s sticky. Extra flour always makes for tougher/dryer doughnuts and breads. Sticky hands and counters are always washable!", 
            "— With a stand mixer: Add half the flour and let the dough hook mix it in slowly, on a low speed. Add second half of flour and salt and let the dough hook bring it together into a rough dough. Run machine for 3 to 4 minutes, letting it knead the dough into a smooth, cohesive mass.", 
            "Both methods: If the dough is already in the bowl, remove it just long enough to lightly oil the bowl. Return dough to bowl, cover with plastic wrap and let rest at room temperature for 1 hour, or in the fridge overnight.", 
            "There are two ways to fill doughnuts: In the easiest method, you fill them after they’re cooked with a piping bag. The filling is usually a little imperfect, off-center or slightly messy, but it takes the least effort by far. With the peskier method, you pre-fill the doughnuts, sealing the edges; the centers will be picture-perfect and neat, but it does take longer to assemble. Both will make you a hero to anyone you make these for, promise.", 
            "— Easiest method: On a lightly floured counter, roll dough to a 1/2-inch thickness. Cut into 2-inch rounds; no need to re-roll scraps unless you wish; I like to keep the odd shapes for getting the hang of frying before cooking the final doughnuts. Or, if you’re vehemently against scraps and re-rolling, you can make small square doughnuts, which are surprisingly cute. Let cut dough rise for another 30 minutes at room temperature, loosely covered with a towel at room temperature, or in the fridge overnight, on an oiled tray, covered loosely with oiled plastic wrap (use this longer rise only if did the 1-hour rise the first time; two overnights is too much for this dough). ", 
            "— Peskier method:  On a lightly floured counter, roll dough to a 1/4-inch thickness. Cut into 2-inch rounds; no need to re-roll scraps unless you wish; I like to keep the odd shapes for getting the hang of frying before cooking the final doughnuts. Or, if you’re vehemently against scraps and re-rolling, you can make small square doughnuts, which are surprisingly cute. Brush the edges of half the cut-outs with egg white, and in the center of each, add a tiny dollop (much less than you think you’ll need) of jam. Use the remaining cut-outs to form lids. Pinch every speck of the edges together tightly, almost as if you were making ravioli; you’ll want to seal these spectacularly well. Let filled doughnuts rise for another 30 minutes at room temperature, loosely covered with a towel at room temperature, or in the fridge overnight, on an oiled tray, covered loosely with oiled plastic wrap (use this longer rise only if did the 1-hour rise the first time; two overnights is too much for this dough). ", 
            "Both methods, fry the doughnuts: Heat 2 inches of oil to 350°F (175°C) in a cast-iron frying pan (I like using one because it so delightfully re-seasons them) or heavy pot. Use your dough scraps to practice and get an idea of how quickly the doughnuts will cook. Then add about 4 doughnuts at a time to the oil, cooking on the first side until golden brown underneath, about 1 to 2 minutes, but often less so keep a close eye on them. Flip doughnuts and cook on the other side, until it, too, is golden brown underneath, about another minute. Drain doughnuts, then spread them on a paper towel-lined plate to absorb extra oil. Repeat with remaining doughnuts.", 
            "– If you haven’t filled your doughnuts yet, i.e. you’re using the easier method: When doughnuts are cool enough to handle, place jelly or jam in a piping bag with a round tip with a 1/4- to 1/2-inch opening. You can fill doughnuts from the tops or sides; I did half with each. Press the tip of the jam bag halfway into the doughnut, and squeeze in the jam until it dollops out a little from the hole. Repeat with remaining doughnuts. ", 
            "Finish doughnuts: Either generously shower doughnuts with powdered sugar on either side, shaken from a fine-mesh strainer, or roll the doughnuts gently in a bowl of powdered sugar.", 
            "Eat at once. Don’t forget to share. If eating these on the first day, leave any remaining doughnuts uncovered on a plate. These are best on the first day, but my son did not (shockingly) say no to one that had been in an airtight container at room temperature overnight for breakfast this morning, so I guess they’re not inedible on the second day. They will need to be re-powdered, however, as it absorbs into the doughnuts when they’re in a covered container. ", 
            "To make these dairy-free: You can use warm water, soy, almond or coconut milk instead of the dairy milk, and coconut oil, shortening or margarine for the butter. I made a version with both coconut milk and coconut oil, orange zest and a bit of almond extract that were a big hit."
        ], 
        "date": "2014-12-11T11:59:16+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large or 4 medium (2 pounds or just under 1 kg) Russet or baking potato, peeled", 
            "1 medium onion (about 6 to 8 ounces), peeled", 
            "2 teaspoons baking powder", 
            "1 1/2 teaspoons (about 9 grams) table or fine sea salt", 
            "Freshly ground black pepper", 
            "1/2 cup plus 2 tablespoons (80 grams) all-purpose flour", 
            "4 large eggs", 
            "Nonstick spray, for waffle iron", 
            "2 tablespoons fresh chives, finely chopped, for garnish (totally optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/latke-waffles1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2014/09/latke-waffles/", 
        "title": "latke waffles", 
        "directions": [
            "Heat oven to 350. Lightly oil a large baking sheet and set aside. ", 
            "In a food processor or on a box grater, coarsely shred the potato and onion. For longer strands, lay the potato sideways in the chute of your food processor. Transfer grated mixture to a bowl lined with a fuzz-free dishcloth (linen is great here) or cheesecloth. Pull up the sides of the cloth, forming a bag of grated ingredients, and twist it until you’ve squeezed out all of the excess liquid. Let stand for 1 to 2 minutes, then squeeze out one more time. ", 
            "Discard the liquid in the bowl, then add wrung-out shredded potato and onion to it. Sprinkle baking powder, salt and several grinds of black pepper over mixture and stir with a fork until it distributes throughout the shreds. Add flour, and again, stir into the potato-onion mixture until the pieces are evenly coated. Crack eggs on top; use your fork to break up the yolks and stir them so that they’re evenly distributed through the batter. ", 
            "Heat your waffle iron to high heat. Once hot, coat lightly with a nonstick spray. Heap some latke mixture on top and spread it into an even layer. Cook until the latkes are a nice, deep golden brown underneath. (I found that the bottom colors better than the top, but you’ll even this out in the oven.) ", 
            "Transfer to oiled baking sheet, paler side down, and place in warmed oven. Continue with remaining latke batter. Keep latke waffles in oven until crisp (about 5 to 10 minutes), or until all the other parts of your meal are ready. ", 
            "Serve with applesauce or sour cream, latke-style, or breakfast-style, with eggs and bacon. Sour cream is pretty good with the eggs, too. Chives make it pretty.  "
        ], 
        "date": "2014-09-29T11:51:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup leeks in 1/2-inch thick slices, white and light green parts only, cleaned and rinsed", 
            "Kosher or coarse salt", 
            "2 tablespoons (1 ounce) unsalted butter", 
            "Freshly ground black pepper", 
            "6 cups 1-inch-cubed crustless brioche or Pullman loaf (I used a little less than one loaf)", 
            "2 teaspoons finely chopped chives (I forgot to buy these; it made me sad)", 
            "1/2 teaspoons fresh thyme leaves", 
            "1 large egg", 
            "1 large egg yolk", 
            "3 cups whole milk, heavy cream or half-and-half or a combination thereof", 
            "Freshly grated nutmeg", 
            "1/2 cup shredded Comté, Emmanthaler or Swiss cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/leek-bread-pudding1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Easter", 
            "Eggs", 
            "Leeks", 
            "Photo", 
            "Side Dish", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/04/leek-bread-pudding/", 
        "title": "leek bread pudding", 
        "directions": [
            "Place a medium sauté pan over medium-high heat, drain excess water from leeks, and add to pan. Season with salt, and sauté until leeks begin to soften, about 5 minutes, then reduce heat to medium-low. Stir in butter. Cover and cook, stirring occasionally, until leeks are very soft, about 20 minutes. Adjust salt and pepper to taste.", 
            "Preheat oven to 350 degrees. While leeks are cooking, spread bread cubes on a baking sheet and bake until dry and pale gold, about 15 to 20 minutes (my already-stale brioche took less time to brown), turning pan about halfway through. Transfer to a large bowl, leaving the oven on.", 
            "Add leeks, chives and thyme to the bowl of bread; toss well. In another large bowl, lightly whisk the egg and egg yolks, then whisk in milk or cream, a generous pinch of salt, pepper to taste and a pinch of nutmeg.", 
            "Sprinkle 2 tablespoons shredded cheese in bottom of a buttered 9-by-5-inch loaf pan. Spread 1/2 of bread mixture in pan, and sprinkle with another 2 tablespoons cheese. Spread remaining bread mixture in pan, and sprinkle with another 1/4 cup cheese. Pour in enough milk mixture to cover bread, and gently press on bread so milk soaks in. Let rest 15 minutes.", 
            "Add remaining milk mixture, letting some bread cubes protrude. Sprinkle with salt. Bake until pudding is set and top is brown and bubbling, about 55 to 65 minutes. Serve hot or cold (because I’m weird and enjoy bread pudding cold)."
        ], 
        "date": "2010-04-30T12:00:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon butter, plus more for greasing baking dish", 
            "6 medium-large leeks or 3 leeks and 2 small yellow onions, diced (just white and pale green parts from leeks; leeks washed well)", 
            "1 to 2 tablespoons olive oil", 
            "12 large eggs", 
            "3 1/3 cups milk, preferably whole", 
            "Salt and freshly ground black pepper", 
            "3/4 pound grated cheese (I use a mix of gruyere and comte)", 
            "10 ounces cooked ham, diced very small"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/leek-ham-and-cheese-egg-bake1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Gluten-Free", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/01/leek-ham-and-cheese-egg-bake/", 
        "title": "leek, ham and cheese egg bake", 
        "directions": [
            "Heat oven to 350 degrees F and butter a large (9×13-inch, 3-quart or more) baking dish.", 
            "Heat a large skillet over medium heat. Add 1 to 2 tablespoons olive oil and a tablespoon of butter. Once hot, add leeks (and onions, if using) and season generously with salt (I use a full teaspoon kosher salt) and pepper. Cook, stirring, until they’re tender, sweet and just starting to brown, about 10 to 15 minutes. Lower heat to medium-low if they’re picking up color too quickly. ", 
            "Beat eggs with salt (I used another teaspoon kosher salt, adjust to taste) and a lot of freshly ground black pepper. Whisk in milk. ", 
            "Assemble by layering in prepared dish: 1/3 of grated cheese, 1/2 of each leeks and ham, next 1/3 cheese, remaining leeks and ham. Pour eggs over then sprinkle remaining cheese over the top.", 
            "Bake until gently set in center, being careful about overbaking (see note up top). It’s done when no liquid egg seeps into the gap formed where a knife inserted into the center and turned or pulled back slightly or a temperature of 165 to 170 degrees. Start checking at 55 minutes and then every 5 minutes after that until it’s done. Mine took a total of 65 minutes. Should the top brown too much before the center is set, put foil over the baking dish for remaining baking time.", 
            "Let rest on a cooling rack for 5 to 10 minutes before serving, or risk a room full of burned tongues. (It packs serious heat!) Serve in squares or scoops."
        ], 
        "date": "2016-01-22T11:52:00+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/lemon-ricotta-pancakes-with-sauteed-apples11.jpg?w=640", 
        "tags": [
            "Apple", 
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Fruit", 
            "Lemon", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/lemon-ricotta-pancakes-with-sauteed-apples/", 
        "title": "lemon ricotta pancakes with sauteed apples", 
        "directions": [
            "Serve the pancakes with the sauteed apples and the maple syrup. "
        ], 
        "date": "2007-11-03T21:57:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (120 ml) milk, whole is ideal", 
            "1/4 cup (60 ml) water", 
            "2 tablespoons raw sugar, brown sugar or honey", 
            "1 packet (7 grams or 2 1/2 teaspoons) active dry yeast", 
            "2 large eggs, ideally at room temperature", 
            "2 teaspoons vanilla extract", 
            "3 2/3 cups (460 grams) all-purpose flour, divided", 
            "1 teaspoon coarse or kosher salt", 
            "14 tablespoons (200 grams or 7 ounces) unsalted butter, softened", 
            "1 1/3 cups pearl sugar (see Note at end for sources)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/liege-waffles1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2015/05/liege-waffles/", 
        "title": "liège waffles", 
        "directions": [
            "Make pearl sugar: David Lebovitz — a man with such an impassioned following that the day he linked to a recent recipe on this site, two different parents came up to me at kindergarten drop-off to ask if I really knew him — gave me a great tip this week:  crush sugar cubes into coarse bits to create makeshift pearl sugar. And here’s an even more DIY approach. I haven’t tested these out (see above: circa 2008 impulse buy) but I have a feeling they’ll get you close to what we’re going for here."
        ], 
        "date": "2015-05-07T12:06:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup plus 2 tablespoons extra-virgin olive oil", 
            "1 large head romaine (about 1 1/2 lb) *", 
            "1 large garlic clove", 
            "1/4 cup loosely packed fresh flat-leaf parsley leaves", 
            "1/2 teaspoon salt", 
            "3/8 teaspoon black pepper", 
            "1 oz finely grated parmesan (1/2 cup), plus additional for serving", 
            "6 large tomatoes (about 3 inches in diameter)", 
            "6 large eggs at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/like-the-lettuce1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Gluten-Free", 
            "Photo", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2006/09/like-the-lettuce/", 
        "title": "romaine pesto and egg-stuffed tomatoes", 
        "directions": [
            "Strip romaine leaves from stems, reserving both separately, then tear leaves into roughly 2-inch pieces. Measure 4 loosely packed cups of leaves and reserve remainder. With motor running, add garlic to food processor to finely chop. Turn off and add the 4 cups romaine leaves along with the parsley, 1/4 teaspoon salt, 1/4 teaspoon pepper, and cheese, then pulse until finely chopped. With motor running, add remaining   cup oil in a slow stream, blending until incorporated.", 
            "Put oven rack in upper third of oven and preheat oven to 400°F.", 
            "Cut off about 1/8 inch from top of each tomato with a sharp knife.** Gently scrape out pulp and seeds with a spoon and discard them. Put tomatoes, cut sides up, in a 9-inch glass or ceramic dish and spoon 1 tablespoon romaine-parsley pesto into each tomato (you will have extra pesto). Crack 1 egg into each tomato and season with salt and pepper. Bake eggs in tomatoes until whites are set and yolks are still runny, 18 to 22 minutes.", 
            "* I didn’t use nearly this much lettuce. For one, I was only making four eggs, and two, I had a hunch this would make an egregious amount. I may have used 4-6 leaves, tops, and half the oil and parsley.", 
            "** I ended up beveling a little sliver off the bottoms, too, to stop them from rolling over in the dish and dumping out their eggs, and you may have guessed happened before I came up with my brilliant solution. Next time I’d put a droplet of oil underneath the beveled tomatoes, as they stuck a little to the bottom, something I should have also seen coming."
        ], 
        "date": "2006-09-09T15:23:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 tablespoons freshly grated lemon zest (from about 2 lemons; preferably Meyer)", 
            "2 1/2 cups all-purpose flour", 
            "1/2 cup sugar plus 3 tablespoons additional if using fresh cranberries", 
            "1 tablespoon baking powder", 
            "1/2 teaspoon salt", 
            "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits", 
            "1 1/4 cups fresh cranberries, chopped coarse, or 1 1/4 cups dried cranberries, if you insist", 
            "1 large egg", 
            "1 large egg yolk", 
            "1 cup heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/meyer-lemon-and-fresh-cranberry-scones1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Cranberries", 
            "Fall", 
            "Fruit", 
            "Lemon", 
            "Photo", 
            "Scones/Biscuits", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/11/meyer-lemon-and-fresh-cranberry-scones/", 
        "title": "meyer lemon and fresh cranberry scones", 
        "directions": [
            "Accompaniment: creme fraiche or whipped cream", 
            "Preheat oven to 400°F. and line a large baking sheet with parchment paper.", 
            "With a vegetable peeler remove the zest from lemons and chop fine, reserving lemons for another use.", 
            "In a food processor pulse flour, 1/2 cup sugar, baking powder, salt, butter and zest until mixture resembles coarse meal and transfer to a large bowl.", 
            "In a small bowl toss together fresh cranberries and 3 tablespoons sugar and stir into flour mixture. If using dried fruit, add to flour mixture.", 
            "In another small bowl lightly beat egg and yolk and stir in cream. Add egg mixture to flour mixture and stir until just combined.", 
            "On a well-floured surface with floured hands pat dough into a 1-inch-thick round (about 8 inches in diameter) and with a 2-inch round cutter or rim of a glass dipped in flour cut out as many rounds as possible, rerolling scraps as necessary. Arrange rounds about 1 inch apart on baking sheet and bake in middle of oven 15 to 20 minutes, or until pale golden.", 
            "[I decided to rebel and pat them into a square and cut them into smaller ones. The square shapes didn’t keep very well, so I don’t recommend this! Learn from me, people.]", 
            "Serve scones warm with creme fraiche or whipped cream. Scones keep, individually wrapped in plastic wrap and foil, chilled, 1 day or frozen 1 week."
        ], 
        "date": "2008-11-15T11:58:01+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup plus (optional) 2 tablespoons granulated sugar", 
            "6 tablespoons unsalted butter", 
            "1/4 teaspoon flaky sea salt or just 2 or 3 pinches of a coarse one", 
            "10 to 12-ounce loaf brioche or challah bread (cut into slices about 1/2-inch thick and about 3 inches square or round, which sounds really persnickety, but they really do fit better in the pan this way)", 
            "8 large eggs", 
            "1 cup mascarpone cheese, divided (1/4 cup for custard; 3/4 cup for serving)", 
            "1 cup milk", 
            "1/4 teaspoon almond extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/morning-bread-pudding-with-salted-caramel1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/02/morning-bread-pudding-with-salted-caramel/", 
        "title": "morning bread pudding with salted caramel", 
        "directions": [
            "First, choose your baking vessel. I opted for a 2-quart oval gratin/roasting dish, but also tested this in a 9-inch round cake pan (it was a squeeze; 10-inch would have been better). Other things I suspect would work: 9- to 10-inch cast iron skillet, 2-quart casserole dish or 1 deep-dish pie pan (what Hesser suggests).", 
            "If your vessel is safe for the stovetop, use this to make the caramel. If not, use a small, heavy saucepan. In either, place 3/4 cup sugar, butter and sea salt and heat over medium heat. The butter will melt and, after 7 to 10 minutes, the sugar will dissolve and begin to brown. Reduce heat to medium-low and stir with a spoon or spatula so that it browns evenly. You will find that the butter separates from the melting sugar and this is just fine. Do your best to keep them stirred together but know that it will all work out in the end even if it’s split.  ", 
            "If you’re using a saucepan, your caramel is done when it reaches a copper color. Pour it over the base of your baking vessel and try (I failed each time) to tip it 1-inch up the sides of the dish. ", 
            "If you’re making the caramel in your final baking vessel, your caramel should be taken off the stove a step sooner, a shade more pale than copper, something of a medium brown; this is because it will continue cooking and darkening for a minute off the stove.", 
            "Regardless of baking vessel, place dish in refrigerator and chill until caramel is cold and solid, about 30 minutes. Once chilled, arrange the bread slices. Place the heel of the bread in the center and do what you can to fan the slices around it, overlapping each slightly and knowing with complete confidence that even if your dish doesn’t resemble a blooming rose, nobody will care at all. ", 
            "In a large bowl whisk together eggs, remaining 2 tablespoons sugar (if using; I skipped this) and 1/4 mascarpone cheese (save rest for serving), until very smooth. Add milk and almond extract. Pour this over the bread, making sure to saturate all of it. Cover tightly with plastic wrap and chill overnight. If you bread seems too high in the vessel to get a good soak, you can weight it with a plate in the fridge.", 
            "In the morning, [updated to suggest] take your dish from the fridge an hour before you want to bake it. Heat oven to 375°F. Remove plastic from dish and bake 30 to 35 minutes, until moist but not wet in center. Remove from oven and run a knife around edge of dish, loosening bread from sides. Place a serving plate over top of dish (bottom side up), and, using potholders, hold pudding over sink and flip pudding onto it. Lift baking dish off plate; scrape any extra caramel from pie dish over pudding. Serve, cutting it into wedges at the table and spooning a healthy dollop of mascarpone onto each plate."
        ], 
        "date": "2014-02-28T08:40:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup yellow onion, diced", 
            "3 tablespoons butter", 
            "1 pound cremini mushrooms, thinly sliced", 
            "1/2 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground pepper", 
            "1 teaspoon flour", 
            "1/2 cup (4 ounces) milk", 
            "1/2 cup mild white cheese, mozzarella or provolone, shredded", 
            "Savory crêpes, recipe follows", 
            "2 tablespoons chives, thinly sliced (I skipped this, didn’t have them on hand)", 
            "1/4 cup Parmesan, shredded", 
            "2 large eggs", 
            "3/4 cup milk", 
            "1/2 cup water", 
            "1 cup flour", 
            "3 tablespoons butter, melted", 
            "1/2 teaspoon salt", 
            "Butter, for coating the pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-crepe-cake1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/05/mushroom-crepe-cake/", 
        "title": "mushroom crêpe cake", 
        "directions": [
            "In a blender combine all of the ingredients (excepting the butter for coating the pan) and pulse for 10 seconds. (Too lazy to bust out a blender, I mixed the flour and salt and slowly whisked in a mixture of the eggs, milk, water and butter.) Place the crepe batter in the refrigerator for one hour, or up to 48 hours.", 
            "Heat a small non-stick pan. Add butter to coat. Pour a couple tablespoons of batter into the center of the pan and swirl to spread evenly. Cook for 30 seconds and flip. Cook for another 10 seconds and throw the crepe in the garbage; seriously, the first one is always cursed. Sometimes the second too. By the time you get to the third one, go ahead and keep what you made, even if it’s not perfect. Lay the crêpe flat on a large cutting board to the cutting board to cool; continue cooking until all of the batter is gone.", 
            "Do ahead: Crêpe batter can be made up to two days in advance, stored in the fridge. Cooked, cooled and well-wrapped, crêpes can be stored for several days in the fridge or up to two months in the freezer. Frozen crêpes can be thawed on a rack; gently peel them as you need. Filling can be made a day in advance; reheat slowly, over a low flame. I made my crêpes in advance, and the filling in the morning; it doesn’t take much time (and even less if you clean and slice your mushrooms the night before)."
        ], 
        "date": "2010-05-11T11:04:07+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups (280 grams) all-purpose flour", 
            "2 teaspoons to 1 1/2 tablespoons (10 to 20 grams) sugar (to taste, see note above)", 
            "1 tablespoon (15 grams) baking powder", 
            "3/4 teaspoon (5 grams) table salt", 
            "3/4 teaspoon baking soda", 
            "9 tablespoons (125 grams) chilled unsalted butter, cut into small chunks", 
            "3/4 cup (175 ml) buttermilk"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/03/8538746952_e13bc87f35_k.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2013/03/my-favorite-buttermilk-biscuits/", 
        "title": "my favorite buttermilk biscuits", 
        "directions": [
            "Heat oven to 400 °F and cover baking sheet with parchment paper. Whisk flour, sugar, baking powder, salt and baking soda in large, wide bowl. Using fingertips or a pastry blender, work butter into dry ingredients until the mixture resembles a coarse meal, Add buttermilk and stir until large, craggy clumps form. Reach hands into bowl and knead mixture briefly until it just holds together. ", 
            "To form biscuit rounds: Transfer dough to floured counter and pat out until 1/2 to 3/4-inch thick (err on the thin side if uncertain, as the tall ones will literally rise and then tip over, like mine did the day I photographed these). Using a round cutter (2 inches for regular sized biscuits, 3 inches for the monstrous ones shown above), press straight down — twisting produces less layered sides — and transfer rounds to prepared sheet, spacing two inches apart.", 
            "To make drop biscuits: Drop 1/4-cup spoonfuls onto baking sheet, spacing two inches apart. ", 
            "Both methods:Bake until biscuits are golden brown on top, about 12 to 15 minutes. Cool slightly, then serve warm, with butter/jam/eggs/bacon/sausage and gravy or any combination thereof. Happy weekend!", 
            "Do ahead: Biscuits are best freshly baked. When I want to plan ahead, I make the biscuit dough and form the individual biscuits, then freeze them until needed. They can be baked directly from the freezer, will just need a couple more minutes baking time."
        ], 
        "date": "2013-03-08T11:37:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 loaf supermarket Challah bread in 1-inch slices, no need for the super-fancy stuff here", 
            "3 cups whole milk", 
            "3 eggs", 
            "3 tablespoons sugar", 
            "1/2 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/new-years-day-20011.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/12/new-years-day-2001/", 
        "title": "boozy baked french toast", 
        "directions": [
            "1.\tGenerously grease a 9×13-inch baking dish with salted (my choice) or unsalted butter.", 
            "2.\tArrange bread in two tightly-packed layers in the pan. I always cut one slice into smaller pieces to fill in gaps, especially when using braided Challah. If using a thinner-sliced bread, you might wish for more layers, though I find that over three, even baking can be difficult. If you are using any fillings of fruit or nuts, this is the time to get them between the layers or sprinkled atop.", 
            "3.\tWhisk milk, eggs, sugar, salt and booze or flavorings of your choice and pour over the bread. Sprinkle with cinnamon and sugar.", 
            "4.\tWrap tightly with plastic wrap and refrigerate overnight. The bread will absorb all of the milk custard while you sleep.", 
            "5.\tBake at 425 for 30 minutes, or until puffed and golden. This will take longer if you have additional layers.", 
            "6.\tCut into generous squares and serve with maple syrup, fresh fruit, powdered sugar or all of the above."
        ], 
        "date": "2006-12-10T21:02:32+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups (260 grams) all-purpose flour, plus extra for dusting surface", 
            "1/2 cup (80 grams) whole wheat flour", 
            "1/2 cup (35 grams) rolled oats (I used quick-cooking)", 
            "1 very heaped tablespoon baking powder (I only slightly heaped; wish I’d heaped more!)", 
            "1 very heaped tablespoon superfine (caster) or granulated sugar", 
            "1/2 teaspoon table salt", 
            "Scant 3/4 cup (160 grams) unsalted butter, cut into pieces", 
            "1/4 cup maple syrup", 
            "1/4 cup milk or buttermilk", 
            "1 egg, beaten (for glaze)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/oat-and-maple-syrup-scones1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2011/03/oat-and-maple-syrup-scones/", 
        "title": "oat and maple syrup scones", 
        "directions": [
            "Preheat your oven to 400°F (200°C). Butter a baking tray, or, if you’re me and your baking sheets are in horrendous condition, line them with un-buttered parchment paper.", 
            "Whisk the flours, oats, baking powder, sugar and salt together in a large bowl. With a pastry blender or your fingertips, work the butter into the dry ingredients until the mixture resembles fine breadcrumbs. In a small dish, combine the milk and syrup, then add these liquid ingredients to the butter-flour mixture. By hand or with a rubber spatula, bring everything together to form a softish dough. If it feels too dry, add a little more milk but not enough that the dough is sticky. “The dough should not be stick at all,” the book admonishes.", 
            "On a lightly floured surface, pat or roll the dough out until it is 1 1/4 inches (3 cm)  tall. Using a 2-inch (5-cm) cutter, cut the dough into rounds and place them on the prepared tray so that they almost touch. Glaze the tops with beaten egg and bake for 20 to 25 minutes until the scones are lightly golden. The scones will stick together, so pull them gently apart when they’ve cooled a bit — pull-apart scones!", 
            "Serve warm. Also, you may find them stale the next day but your toddler may not care, so keep them around!"
        ], 
        "date": "2011-03-23T17:07:31+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (90 grams) oat flour (you can make this by pulsing rolled oats into a food processor or spice grinder until finely ground; 1 cup of oats yielded 3/4 cup oat flour for me)", 
            "1 cup (130 grams) all-purpose flour", 
            "2 tablespoons (25 grams) sugar", 
            "2 teaspoon baking powder", 
            "3/4 teaspoon Kosher or coarse salt", 
            "3 tablespoons (45 grams) unsalted butter, melted and cooled slightly (plus extra for the pan)", 
            "1 1/4 cups (295 ml) whole milk", 
            "1 cup cooked oatmeal*", 
            "1 tablespoon (20 grams) unsulphured (not blackstrap) molasses or 1 tablespoon honey", 
            "2 large eggs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/oatmeal-pancakes1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/05/oatmeal-pancakes/", 
        "title": "oatmeal pancakes", 
        "directions": [
            "Whisk the dry ingredients (oat flour, flour, sugar, baking powder and salt) together in a large bowl. In a smaller bowl, whisk the butter, milk, cooked oatmeal, honey and eggs together until thoroughly combined. Gently fold the wet ingredients into the dry ingredients. Using a light hand is important for tender pancakes; the batter should be slightly thick with a holey surface.", 
            "Heat a 10-inch cast-iron pan or griddle over medium heat until water sizzles when splashed onto the pan. Lower to medium-low. (This is my tip; I find pancakes impossible to cook well over higher heats. I’ve got more pancake tips over here.) Rub the pan generously with butter; Boyce says this is the key to crisp, buttery edges. Working quickly, dollop 1/4-cup mounds of batter onto the pan, 2 or 3 at a time. Once bubbles have begun to form on the top side of the pancake, flip the pancake and cook until the bottom is dark golden-brown, about 5 minutes total. Wipe the pan with a cloth before griddling the next pancake. Continue with the rest of the batter.", 
            "Serve the pancakes hot, straight from the skillet or keep them warm in a low oven. We also found these to reheat surprisingly well the next morning, again in a low oven.", 
            "Do ahead: Although the batter is best if using immediately, it can sit for up to 1 hour on the counter or overnight in the refrigerator. When you return to the batter, it will be very thick and should be thinned, one tablespoon at a time, with milk. Take care not to overmix.", 
            "* Make oatmeal, if you don’t have any leftover: Bring 1 cup water and a slightly heaped 1/2 cup of rolled oats (old-fashioned or quick-cooking) and a pinch of salt to a boil and simmer on low for 1 (quick-cooking) to 5 minutes (old-fashioned), until thick. Let cool. This can also be cooked in a microwave."
        ], 
        "date": "2010-05-02T16:08:38+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon salt", 
            "1 cup sugar", 
            "4 large eggs", 
            "2 teaspoons orange zest", 
            "2 teaspoons lemon zest", 
            "2 tablespoons balsamic vinegar", 
            "2 tablespoons whole milk", 
            "3/4 cup extra-virgin olive oil", 
            "2/3 cup sliced almonds, toasted", 
            "Powdered sugar, for sifting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/olive-oil-muffins1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/11/olive-oil-muffins/", 
        "title": "olive oil muffins", 
        "directions": [
            "Preheat the oven to 350 degrees F. Place paper liners in a 12-cup muffin tin.", 
            "Blend together the flour, baking powder, and salt in a medium bowl to blend. Using an electric mixer beat the sugar, eggs, and zests in a large bowl until pale and fluffy, about 3 minutes. Beat in the vinegar and milk. Gradually beat in the oil. Add the flour mixture and stir just until blended. Crush the almonds with your hands as you add them to the batter and stir until mixed. Fill the muffin tin almost to the top of the paper liners. Bake until golden on top and a tester inserted into the center of the cake comes out with moist crumbs attached, about 20 to 25 minutes. Transfer to a wire rack and cool for 10 minutes. Remove the muffins onto a platter and let cool for 5 more minutes. Sift powdered sugar over the muffins and serve."
        ], 
        "date": "2008-11-11T23:58:19+00:00"
    }, 
    {
        "ingredient_list": [
            "Buttery Pastry Shell", 
            "2 cups (250 grams) all-purpose flour, plus more for dusting", 
            "1 teaspoon kosher salt", 
            "1 cup (2 sicks or 225 grams) very cold unsalted butter, cut into a small dice", 
            "1/4 cup (60 ml) water, ice cold", 
            "Neutral oil, for brushing springform", 
            "Filling", 
            "1 tablespoon (15 ml) olive or vegetable oil", 
            "2 pounds (905 grams) mushrooms (see Note up top for suggestions)", 
            "Salt and freshly ground black pepper", 
            "1 tablespoon (15 grams) unsalted butter", 
            "2 shallots, minced (I used 4 small because I’m a rebel)", 
            "1 tablespoon fresh thyme, minced (use 1 teaspoon only if dried/jarred)", 
            "3/4 cup (2 1/2 ounces or 70 grams) Comte, Emmantel or Gruyere, grated", 
            "2 cups (475 ml) milk", 
            "2 cup (475 ml) heavy cream", 
            "6 large eggs, lightly beaten", 
            "Freshly grated nutmeg (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/over-the-top-mushroom-quiche1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Easter", 
            "Mushrooms", 
            "Photo", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/04/over-the-top-mushroom-quiche/", 
        "title": "over-the-top mushroom quiche", 
        "directions": [
            "Make buttery shell: In a stand mixer fitted with the paddle attachment, mix 1 cup of the flour with all of the salt. Then, with the machine on low speed, add the bits of butter, a handful at a time, until the butter is completely incorperated. Add the remaining flour until just blended, then the cold water until thoroughly incorporated. Dump dough onto a piece of plastic wrap and form it into a flat, round disc. Wrap it with the plastic and chill it for at least one hour, preferably overnight, and up to two days.", 
            "Prepare shell: Set the ring of a 9-inch springform pan, leaving the hinge open, on a rimmed baking sheet lined with parchment paper. Brush the inside of the ring with lightly with oil and set aside.", 
            "Generously flour your counter, then place the chilled, unwrapped dough on the flour and flour the top of the dough. Roll you dough into a 16-inch round. The dough is going to be very hard at first, but keep at it, pressing your rolling pin gently from the center; it will get easier as it stretches out, and it’s best to start when its very cold as it will remain the coolest/most firm longer. Re-flour your surface as needed, continually lifting and rotating your dough to make sure no parts are sticking. If at any point the dough becomes sticky, soft and, frankly, annoying, just slide it onto a floured baking sheet and pop it into the freezer for two minutes for it to cool down again. If it tears, just overlap the sides of the tear and roll them back together. Don’t fret tiny holes; there will be time to patch later.", 
            "You can transfer your dough to the prepared pastry ring in one of two ways. Keller’s method is to roll it up on your rolling pin, then unroll it in the ring. I like to gently fold mine into quarters, without creases, and unfold it in the ring. Gently lift the edges so that the slack of the dough drapes in. Press the dough into the corners and up the sides of the ring. Trim the overhang to 1-inch and please, save your scraps. (I did not. The ring your see pictured is round two. I don’t want to talk about it.) Chill the pastry shell (and the scraps, so they don’t get mushy) in the fridge for 20 minutes (if par-baking) or until needed (if not par-baking).", 
            "Preheat oven to 325°F.", 
            "Decide if you want to par-bake your buttery pastry shell: Read the Note up top first.", 
            "To par-bake your pastry shell: Line your chilled buttery pastry shell with a 14-inch round of parchment paper, or, if your parchment paper isn’t that wide, two sheets in opposite directions. Fill completely (or whichever wall parts aren’t filled will collapse a little) with pie weights/dried beans/uncooked rice/loose change and bake in your preheated oven for 30 to 40 minutes, or until lightly golden at edges. Carefully remove weights and parchment paper and return shell to oven, baking another 10 to 15 minutes longer, until “richly brown” (as per Keller) on bottom. Set aside to cool while you make your filling. Leave the oven on.", 
            "Prepare filling: In a very large skillet, heat the oil. Add the mushrooms, season with salt and pepper and cook over high heat, stirring, until starting to soften, about 5 minutes. Reduce the heat to moderate. Add the butter, shallots and thyme and cook, stirring often, until the mushrooms are tender, about 12 minutes longer. Season with salt and pepper and let cool.", 
            "Assemble quiche: Whether or not your par-baked your buttery pastry shell, check it for holes or cracks that would cause leakage. If you see any, seal them with the trimmed scraps from the dough. Scatter 1/4 cup (one-third of) cheese and half the mushrooms in the bottom of the pastry shell. Either in a blender (Keller’s recommendation) or with a hand whisk (what I did), mix half the milk, cream and eggs with 1 1/2 teaspoons kosher salt (this seemed like a lot, I used less, wish I’d used the full amount), several grinds of black pepper and a pinch of nutmeg (if using) until frothy. Pour into the pastry shell. Top with another 1/4 cup of the cheese and remaining mushrooms. Make the custard again with the remaining eggs/milk/cream and same seasonings and pour it into the shell. Sprinkle remaining 1/4 cup cheese on top.", 
            "Bake quiche: For 1 1/2 hours, until nicely bronzed on top and the custard is just set. (My tester came out damp but not eggy; i.e. clean.) Let cool in pan until warm.", 
            "Serve quiche: Using a serrated knife, trim the pastry shell flush with the top of the pan. Run your knife around the outside of the quiche, inside the ring to make sure it’s not stuck anywhere. Take a deep breath. Lift the springform pan ring off the quiche. Applaud. You can trim your crust further if there’s a big gap between the top and the top of your crust but you might want to do so more neatly than I did. Cut the quiche into wedges and serve warm, with a delicate greens salad."
        ], 
        "date": "2012-04-06T13:33:01+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups all-purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "3/4 teaspoon baking soda", 
            "1/2 teaspoon fine sea salt", 
            "6 tablespoons cold unsalted butter, diced", 
            "1 1/4 cups (2 7/8 ounces) finely grated aged pecorino or parmesan cheese", 
            "2 slim scallions, minced (optional)", 
            "2 tablespoons flat-leaf parsley, chopped small plus 16 extra leaves for garnish", 
            "1 cup well-shaken buttermilk", 
            "1 large egg, lightly beaten with 1 teaspoon water for wash"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/parsley-pecorino-biscuits1.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Breakfast", 
            "Brunch", 
            "Herbs", 
            "Photo", 
            "Put An Egg On It", 
            "Scones/Biscuits", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2015/11/parsley-pecorino-biscuits/", 
        "title": "parsley pecorino biscuits", 
        "directions": [
            "Heat oven to 425 degrees F. Stir together flour, baking powder, baking soda, and salt in the bottom of a large bowl, then use your fingertips or a pastry blender to work the butter into the dry mixture, until the largest chunks are the size of tiny peas. Stir in cheese, scallions and chopped parsley, then buttermilk, stirring just until combined. Knead once or twice right inside the bowl to form into a rough dough.", 
            "Pat or roll it out to a 1/2-inch thickness on a floured counter. Cut into 2-inch rounds, pressing straight down and not twisting the cutter. Place on an parchment-lined baking sheet. Brush the tops of each with egg wash, then place one leaf at the center of each biscuit top. Use brush to dab leaf with egg wash.", 
            "Bake biscuits for 11 to 13 minutes, until golden brown. Eat right away, or at least before the day is out. ", 
            "Because biscuits are best on the first day, if planning ahead, I like to make the dough, cut in into rounds and freeze it until needed. Biscuits can be baked right from the freezer and will only require about 2 minutes extra. Brush egg wash and leaf on right before baking. "
        ], 
        "date": "2015-11-24T12:08:24+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups all-purpose flour", 
            "1 teaspoon baking soda", 
            "1/4 teaspoon baking powder", 
            "1 teaspoon salt", 
            "1 tablespoon ground cinnamon", 
            "1 cup chopped walnuts (optional)", 
            "3/4 cup butter, softened, or 3/4 cup vegetable oil", 
            "3 eggs, lightly beaten", 
            "2 cups sugar", 
            "2 to 4 pears firm, ripe pears, depending on size (you’ll need 2 grated cups total, but I don’t recommend you grate them until you are about to use them, so they don’t brown)", 
            "2 teaspoons vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pear-bread1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Cake", 
            "Everyday Cakes", 
            "Pear", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/12/pear-bread/", 
        "title": "pear bread", 
        "directions": [
            "Heat your oven to 350°F (175°C) and lightly grease and flour a 10-inch tube pan or two 9-by-5-inch loaf pans.", 
            "Combine the flour, baking soda, baking powder, salt, and cinnamon in a large mixing bowl, and stir with a fork to mix everything well. If you’re using nuts, scoop out about 1/4 cup of the flour mixture and combine it in a small bowl with the chopped walnuts, stirring and tossing to coat the nuts with the flour.", 
            "Peel and core pears, then grate them. You’ll want two grated cups total; set them briefly aside. In a medium bowl, combine the butter or oil, eggs, sugar, grated pear, nuts (if using), and vanilla, and stir to mix everything well. Scrape the pear mixture into the flour mixture and stir just until the flour disappears and the batter is evenly moistened.", 
            "Quickly scrape the batter into the prepared pans and bake at 350°F (175°C) for 60 to 70 minutes, or until the bread is handsomely browned and firm on top and a wooden skewer inserted in the center comes out clean.", 
            "Cool the bread in the pan on a wire rack or folded kitchen towel for about 10 minutes. Then turn it out onto a plate or a wire rack to cool completely, top side up. Serve it as is, sprinkle it with confectioners sugar or drizzle it with a simple glaze made from whisking 3 tablespoons buttermilk, a dash of vanilla and 2 cups of confectioners’ sugar together."
        ], 
        "date": "2009-12-25T19:59:19+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough:", 
            "1 packet (7 grams or 2 1/4 teaspoons) instant or active dry yeast", 
            "3/4 cup (175 ml) milk", 
            "1 tablespoon (10 grams) granulated sugar", 
            "6 tablespoons (85 grams) butter, melted and cooled to lukewarm", 
            "4 large egg yolks", 
            "1 large whole egg", 
            "3 3/4 cups (470 grams) all-purpose flour, plus more for dusting counter", 
            "1 teaspoon coarse or kosher salt", 
            "Oil or butter to coat bowl", 
            "Caramel:", 
            "1/2 cup (1 stick, 4 ounces or 113 grams) unsalted butter", 
            "3/4 cup (145 grams) dark brown sugar", 
            "3/4 cup (175 ml) heavy cream", 
            "1/3 cup (110 grams) honey", 
            "1/4 teaspoon coarse or kosher salt", 
            "Filling:", 
            "1/4 cup (50 grams) packed dark brown sugar", 
            "2 tablespoons (25 grams) granulated sugar", 
            "1 teaspoon ground cinnamon", 
            "1/8 teaspoon coarse or kosher salt", 
            "1 1/2 tablespoons (20 grams) unsalted butter, melted", 
            "1 1/2 cups toasted and cooled, chopped pecans (divided)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/pecan-sticky-buns1.jpg?w=751", 
        "tags": [
            "Announcements", 
            "Breakfast", 
            "Brunch", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/02/pecan-sticky-buns-news/", 
        "title": "pecan sticky buns + news!", 
        "directions": [
            "Make the dough: If using active dry yeast, it first needs to be proofed: warm milk to lukewarm, about 110 to 116 degrees F. Place in bottom of large mixing bowl or bowl of stand mixer. Stir in 1 tablespoon sugar and yeast and set aside for 5 minutes. It will look a dissolved and slightly foamy. ", 
            "If using instant yeast, simply stir it into cold milk along with sugar.", 
            "Continue with either type of yeast, whisk in butter, yolks and whole egg. Add half the flour and combine with the dough hook of a stand mixer or a wooden spoon, if mixing by hand. Add salt, then second half of flour and continue to mix until a craggy dough forms. If using a stand mixer, knead for 5 to 7 minutes on low until a stretchy, elastic dough forms. If kneading by hand, do so for 5 to 10 minutes on a floured counter. Lightly oil or butter your large bowl (for the stand mixer, I scoop the dough out long enough to oil it, then use the bowl again) and let dough rise until doubled, about 1 to 1 1/2 hours for active dry yeast or 2 to 2 1/2 hours with instant yeast.", 
            "About 45 minutes before the dough has doubled, prepare your caramel base: Melt butter in a medium heavy saucepan over medium heat. Stir in brown sugar, cream, honey and salt. Bring to a boil, then reduce heat to medium-low and simmer until caramel is golden brown and glossy, about 3 to 5 minutes. Pour into a the bottom and up the sides of a deep 9×13-inch baking dish and let the dish cool down in the fridge while you assemble your rolls. ", 
            "Roll out and fill buns: In a small bowl, stir sugars, cinnamon and salt together. Remove slightly cooled caramel base from fridge and sprinkle it with 1 cup pecans. ", 
            "Turn the risen dough out onto a floured work surface and roll it into a rectangle that is 18 inches wide (the side nearest to you) and 12 or so inches long. (It’s okay if it goes longer/thinner, but try to keep the width at 18″.) Brush the dough with the melted butter. Sprinkle it with the filling and then 1/2 cup pecans. Roll the dough into a tight 18-inch long spiral. Using a sharp serrated knife, very, very gently saw the log into 1 1/2-inch sections; you should get 12. Arrange the buns evenly spread out over pecan-caramel base.", 
            "Proof buns: Cover with plastic wrap and proof at room temperature for another 1 to 2 hours, until they press tightly together in the pan and look puffed again. Or, you can refrigerate the buns overnight, and up to 16 hours. If chilling overnight, remove from fridge 1 hour before you’d like them to bake. Heat oven to 350°F (175°C). ", 
            "Bake buns: Bake your buns until they’re puffed and golden (the internal temperature should read 185 degrees F), approximately 30 to 40 minutes. If they brown too quickly on top before the centers are baked, cover dish with foil for remaining baking time.", 
            "Let rest in pan on cooling rack for 2 to 3 minutes, then carefully and quickly invert onto a large serving tray, nudging any caramel left behind in the pan or puddled in the center of the buns back evenly over the tops and sides. Eat warm. Store any leftovers in the fridge, rewarming slightly. "
        ], 
        "date": "2015-02-12T11:53:00+00:00"
    }, 
    {
        "ingredient_list": [
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1/2 cup  (3 1/2 ounces or 100 grams) sugar", 
            "Finely grated zest from 1/2 a lemon (previously: 1/2 teaspoon zest)", 
            "3/4 cup plain unsweetened yogurt or sour cream", 
            "1 large egg", 
            "1 1/2 teaspoons (7 grams) baking powder", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon fine sea or table salt", 
            "1 1/2 cups (195 grams) all-purpose flour", 
            "1 1/4 to 1 1/2 cups (215 to 255 grams) blueberries, fresh or frozen (no need to defrost) (previously: 3/4 cup, see note up top)", 
            "3 tablespoons turbinado (sugar in the raw) sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/08/perfect-blueberry-muffins.jpg?w=750", 
        "tags": [
            "Blueberries", 
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/08/perfect-blueberry-muffins/", 
        "title": "perfect blueberry muffins", 
        "directions": [
            "Heat oven to 375°F. Line a muffin tin with 9 paper liners or spray each cup with a nonstick spray. Melt butter in the bottom of a large bowl and whisk in sugar,  zest, yogurt and egg until smooth. Whisk in baking powder, baking soda and salt until fully combined, then lightly fold in flour and berries. Batter will be very thick, like a cookie dough. Divide between prepared muffin cups and sprinkle each with 1 teaspoon turbinado sugar, which will seem over-the-top but I promise, will be the perfect crunchy lid at the end. Bake for 25 to 30 minutes, until tops are golden and a tester inserted into the center of muffins comes out clean (you know, except for blueberry goo). Let cool in pan for 10 minutes then the rest of the way on a rack.", 
            "These, like most muffins, are best on the first day, we’ve found through extensive “research” that if you run them split open under a broiler on day two with a pat of salted butter, it’s so good that you’re going to forever hope for more blueberry muffin leftovers.\n"
        ], 
        "date": "2010-08-26T12:50:53+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups (280 grams) yellow cornmeal, to be divided", 
            "1 cup (130 grams) all-purpose flour", 
            "1 1/2 teaspoons baking powder", 
            "1 teaspoon baking soda", 
            "1 1/4 teaspoons fine sea or table salt", 
            "1 1/4 cups (300 ml) milk, whole is best here", 
            "1 cup (240 grams) sour cream (full-fat plain yogurt should work here too)", 
            "8 tablespoons (115 grams) unsalted butter, melted and cooled slightly", 
            "3 to 5 tablespoons (35 to 60 grams) sugar (see Note up top about sweetness)", 
            "2 large eggs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/perfect-corn-muffins1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/02/perfect-corn-muffins/", 
        "title": "perfect corn muffins", 
        "directions": [
            "Heat oven to 425°F (220°C). Either grease or line a 12-cup standard muffin tin with disposable liners.", 
            "Whisk 1 1/2 cups cornmeal, flour, baking powder, baking soda and salt together in a medium bowl. In a large bowl (if you have a microwave) or a medium saucepan (if you do not), combine milk and remaining 1/2 cup cornmeal. In a microwave, cook cornmeal–milk mixture for 1 1/2 minutes, then whisk thoroughly, and continue to microwave in 30-second increments, mixing between them, until it’s thickened to a batter-like consistency, i.e. the whisk will leave a clear line across the bottom of the bowl that slowly fills in. This will take 1 to 3 minutes longer. On the stove, cook cornmeal mixture over medium heat, whisking constantly, until it thickens as described above, then transfer to a large bowl.", 
            "Whisk butter, then sugar, then sour cream into cooked cornmeal until combined. At this point, the wet mixture should be cool enough that adding the eggs will not scramble them, but if it still seems too hot, let it cool for 5 minutes longer. Whisk in eggs until combined. Fold in flour mixture until thoroughly combined and the batter is very thick. Divide batter evenly among prepared muffin cups; it will mound slightly above the rim.", 
            "Bake until tops are golden brown and toothpick inserted in center comes out clean, 13 to 17 minutes, rotating muffin tin halfway through baking to ensure even cooking. Let muffins cool in muffin tin on wire rack for 5 minutes, then remove muffins from tin and let cool 5 minutes longer. Serve warm.", 
            "P.S. You can make your own makeshift muffin liners from 5 to 6-inch squares of parchment but please, maybe test it first to see if it can reach the heat the package promises, as these, despite advertising a heat limit of 450°F, set off my smoke detector multiple times and were definitely not worth the trouble."
        ], 
        "date": "2015-02-17T11:30:26+00:00"
    }, 
    {
        "ingredient_list": [
            "8 to 10 small waxy potatoes (about 1 ounce each), scrubbed and quartered", 
            "1 cup vegetable or another broth; just use salted water if you don’t have it around", 
            "1/4 cup olive oil", 
            "8 ounces (usually 1 bundle) broccolini, trimmed and halved lengthwise or chopped into 1-inch pieces", 
            "1 small red or white onion, thinly sliced", 
            "8 large eggs", 
            "1 cup (about 3 to 3 1/2 ouncesgrated Parmesan cheese", 
            "Salt and freshly ground black pepper, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/potato-and-broccolini-frittata1.jpg?w=640", 
        "tags": [
            "Broccoli", 
            "Brunch", 
            "Eggs", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Potatoes", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/10/potato-and-broccolini-frittata/", 
        "title": "potato and broccolini frittata", 
        "directions": [
            "Place the potatoes and broth in a large, ovenproof frying pan, ideally one that is 12 inches. Bring to a boil and simmer for 10 minutes, turning the potatoes often, until almost all of the stock has been absorbed and the potatoes are tender. ", 
            "Add olive oil, broccolini and onion to the potatoes in the frying pan and cook over medium heat for 1 minute, turning frequently, just to get everything coated with oil, Then, reduce the heat to medium-low and cover the pan, cooking for 3 to 4 more minutes, or until the broccolini has become mostly tender.", 
            "Heat your broiler.", 
            "Beat eggs with half the parmesan, salt and pepper, and pour it over the vegetables in the frying pan. Cover and cook over medium (or medium-low, if yours seems to be browning too quickly) until the eggs are mostly, set. Sprinkle remaining parmesan over frittata and run the whole pan under the broiler, until the top is bronzed and the eggs are just set throughout, approximately 5 minutes, but this could vary due to how robust your broiler is (mine is terrible; it took longer).", 
            "Let cool slightly before slicing into wedges or squares."
        ], 
        "date": "2013-10-28T12:08:52+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds fingerlings, or small red or yukon gold potatoes", 
            "4 large eggs", 
            "1/4 pound frisee (French curly endive) or another sturdy lettuce", 
            "6 ounces slab bacon or thick-cut bacon slices", 
            "2 tablespoons finely chopped shallot", 
            "3 tablespoons red wine vinegar", 
            "1/2 teaspoon smooth Dijon mustard", 
            "2 ounces crumbled blue cheese, or more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/potatoes-with-soft-eggs-and-warm-bacon-vinaigrette1.jpg?w=750", 
        "tags": [
            "Brunch", 
            "Budget", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2015/03/potatoes-with-soft-eggs-and-bacon-vinaigrette/", 
        "title": "potatoes with soft eggs and bacon vinaigrette", 
        "directions": [
            "Cook potatoes: In a large saucepan, cover potatoes with cold water, set a timer for 25 minutes (for small red or gold potatoes), and bring to a boil. Once boiling, reduce to a simmer. Cook until tender but not falling apart, which for small red potatoes usually takes me 25 minutes (fingerlings, because they’re thinner, might be worth checking at 20). Drain and when cool enough to touch, but still hot, halve lengthwise and arrange cut side up on a platter.", 
            "Meanwhile, cook eggs: Bring medium saucepan of water to a boil. Lower eggs into it and boil for five (for a runnier egg) to six (for a less-runny but still loose egg) minutes. Drain and rinse egg briefly under cool water until cool enough to handle and carefully peel — because the egg inside is so soft, I recommend chipping off smaller pieces at a time and running it under water as needed so you don’t accidentally rip it open. Set aside. ", 
            "Prep salad: Tear frisee into bite-size pieces and put in a large bowl. ", 
            "Right before you’re ready to serve everything, make vinaigrette: If using slab bacon, cut lengthwise into 1/4-inch thick slices, then 1/4-inch thick sticks (lardons); if using bacon slices, just cut them crosswise into 1/4-inch lardons. Cook bacon in a heavy skillet over moderate heat, until bacon is 3/4 as crisp as you’d like it to get. Add shallots, and cook for 1 minute more. Whisk in red wine vinegar and Dijon and let simmer for 10 seconds. Immediately pour 3/4 hot dressing over potatoes and last 1/4 over frisee in bowl, tossing the lettuce to combine evenly. Season both with salt and pepper. ", 
            "To finish: Top dressed potatoes with peeled eggs and use a knife to cut them into quarters, so they break open over the potatoes. Season cut eggs with salt and pepper again, sprinkle potato dish with blue cheese. Serve with frisee on the side or on top.", 
            "Note: I’ve made this a few times (can you blame me?) and sometimes I got a lot of “renderings” from the bacon and had more than enough dressing for the potatoes and side bowl of lettuce and a couple times it felt a little scant. If you don’t feel like you have enough dressing to stretch over the potatoes and lettuce, just cover the potatoes well. The lettuce can be always be lightly dressed with a splash of olive oil, teaspoon of red wine vinegar plus the salt and pepper."
        ], 
        "date": "2015-03-16T12:00:58+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups all-purpose flour (have successfully swapped whole wheat flour for half)", 
            "1 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon table salt", 
            "1 teaspoon pumpkin-pie spice (or 1/2 teaspoon cinnamon + 1/4 teaspoon fresh nutmeg + 1/4 teaspoon ginger + pinch of ground cloves and allspice)", 
            "1 cup (original recipe) to 1 1/3 cup (what I use these days; makes it even more rich) canned solid-pack pumpkin (from a 15 ounce can, not pumpkin pie filling, which is sweetened and spiced)", 
            "1/3 cup vegetable or another neutral cooking oil", 
            "2 large eggs", 
            "1 1/4 cups plus 1 tablespoon granulated sugar", 
            "1 teaspoon cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/10/pumpkin-muffins.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Fall", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Potatoes", 
            "Pumpkin"
        ], 
        "url": "https://smittenkitchen.com/2006/10/promise-keeper-pumpkin-eater/", 
        "title": "pumpkin muffins", 
        "directions": [
            "Heat oven to 350 degrees. Put liners in 12 standard-sized muffin cups.", 
            "Stir or whisk together flour, baking powder, baking soda, salt and spice in small/medium bowl. ", 
            "In a larger bowl, whisk together pumpkin, oil, eggs and 1 1/4 cups sugar. Add dry ingredients to wet and stir until just combined. Divide batter among muffin cups (each about 3/4 full).", 
            "Stir together last tablespoon of sugar and teaspoon of cinnamon. Sprinkle over each muffin. ", 
            "Bake until puffed and golden brown and wooden pick or skewer inserted into the center of a muffin comes out clean, 25 to 30 minutes.", 
            "Cool in pan on a rack five minutes, then transfer muffins from pan to rack and cool to warm or room temperature.", 
            "Do ahead: Most muffins don’t keep well, but these are excellent on Day 2 (after being stored in an airtight container at room temperature) and not bad at all on Day 3. If longer, I’d keep them in the freezer until needed."
        ], 
        "date": "2006-10-24T09:45:32+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "6 tablespoons (85 grams) unsalted butter, to be divided", 
            "1/2 cup (120 ml) whole milk, warmed (but not over 116 degrees)", 
            "2 1/4 teaspoons active dry yeast (from 1 .25-ounce or 7 gram envelope yeast)", 
            "3 1/2 cups (440 grams) all-purpose flour, plus extra for rolling out", 
            "1/4 cup (packed) (50 grams) light or dark brown sugar", 
            "1/4 cup (50 grams) granulated sugar", 
            "1 teaspoon (6 grams) table salt", 
            "1/2 teaspoon ground cinnamon", 
            "1/4 teaspoon freshly grated nutmeg", 
            "1/8 teaspoon ground cardamom (optional)", 
            "1/4 teaspoon ground ginger", 
            "2/3 cups (160 grams) pumpkin puree, canned or homemade", 
            "1 large egg", 
            "Oil for coating rising bowl", 
            "Filling", 
            "3/4 cup (packed, 145 grams) light or dark brown sugar", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/8 teaspoon table salt", 
            "2 teaspoons (5 grams) ground cinnamon", 
            "Glaze", 
            "4 ounces (115 grams) cream cheese, softened", 
            "2 tablespoons (30 ml) milk or buttermilk", 
            "2 cups (240 grams) powdered sugar, sifted", 
            "Few drops vanilla extract (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/10/pumpkin-cinnamon-rolls.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Fall", 
            "Photo", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2012/10/pumpkin-cinnamon-rolls/", 
        "title": "pumpkin cinnamon rolls", 
        "directions": [
            "Make your dough: Melt your butter, and hey, if you’re melting it in a little saucepan, you might as well brown it for extra flavor. Once the butter has melted, keep cooking it over medium heat for a few additional minutes. It will become hissy and sizzle a lot, then take on a nutty flavor as golden bits form at the bottom of the pot. Remove from heat and set aside to cool slightly.", 
            "Combine your warmed milk and yeast in a small bowl and set aside. After five to seven minutes, it should be a bit foamy. If it’s not, you might have some bad yeast and should start again with a newer packet.", 
            "In the bottom of the bowl of an electric mixer combine flour, sugars, salt and spices. Add just 1/4 cup (or two-thirds of; leave the rest for assembly) of your melted/browned butter and stir to combine. Add yeast-milk mixture, pumpkin and egg and mix combined. Switch mixer to a dough hook and run it for 5 minutes on low.", 
            "Scrape mixture into a large oiled bowl and cover with plastic wrap. Set aside for 1 hour in a draft-free place; it should just about double.", 
            "While it is rising, line the bottom of two 9-inch round cake pans (8-inch round should work too, as does an 8-inch square) with parchment paper and butter the sides of the pan and the paper.", 
            "Assemble buns: Scoop dough onto a very well floured surface and flour the top of it well. With a rolling pin, roll the dough to an approximately 16×11-inch rectangle. Brush reserved melted/browned butter over dough. Stir together remaining filling ingredients and sprinkle mixture evenly over dough. Starting on a longer side, roll the dough into a tight spiral. It’s going to make a mess because the dough is crazy soft and some stuff spills off the ends; don’t sweat it. It will all be delicious in the end.", 
            "Here’s how to cut cinnamon rolls without squishing their pretty spirals: With a sharp serrated knife, using absolutely no pressure whatsoever (only the weight of the blade should land on the dough) gently saw your log with a back-forth motion into approximately 1-inch sections. When a soft dough like this is rolled, it tends to grow longer, which means that you’ll have the option to either make more buns (say, 18 instead of 16) or just cut them a little larger (in generous inches).", 
            "Divide buns between two prepared pans. You can sprinkle any sugar that fell off onto the counter over them. Cover each pan with plastic wrap and let rise for another 45 minutes.", 
            "If you’re doing this ahead of time, you can now put them in the fridge overnight. In the morning, leave them out for an hour to warm up and finish rising.", 
            "15 minutes before you’re ready to bake them, heat the oven to 350°F. Meanwhile, you can make the glaze. Beat your cream cheese until it is light and fluffy. Add powdered sugar and vanilla. Drizzle in milk until you get the consistency you’re looking for, either thick enough to ice or thin enough to drizzle.", 
            "Finish your buns: Remove the plastic and bake buns for 25 minutes, until puffed and golden and the aroma brings all the boys to your yard is like a snickerdoodle. Transfer pans to wire cooling racks and drizzle/schmear with cream cheese glaze, then have at them."
        ], 
        "date": "2012-10-05T11:30:01+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups all-purpose flour", 
            "1/3 cup packed light brown sugar", 
            "2 1/4 teaspoons baking powder", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "2 teaspoons ground cinnamon", 
            "1 teaspoon ground ginger", 
            "1/4 teaspoon ground cloves", 
            "4 large eggs, separated", 
            "2 cups well-shaken buttermilk", 
            "1 cup canned solid-pack pumpkin", 
            "3/4 stick (6 tablespoons) unsalted butter, melted", 
            "Vegetable oil for brushing waffle iron or cooking spray"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/11/pumpkin-waffles.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Fall", 
            "Photo", 
            "Pumpkin"
        ], 
        "url": "https://smittenkitchen.com/2007/11/pumpkin-waffles/", 
        "title": "pumpkin waffles", 
        "directions": [
            "Preheat oven to 250°F and preheat waffle iron. Sift together flour, brown sugar, baking powder and soda, salt, and spices. Whisk egg yolks in a large bowl with buttermilk, pumpkin, and butter until smooth. Whisk in dry ingredients just until combined. ", 
            "In a mixing bowl with a whisk attachment, whisk the egg whites until they hold soft peaks (as in, far softer than the over-beaten whites you’ll see in my picture above). Folk them gently into the waffle batter, until just combined.", 
            "Brush waffle iron lightly with oil and spoon batter (about 2 cups for four 4-inch Belgian waffles) into waffle iron, spreading quickly. Cook according to manufacturer’s instructions. ", 
            "Transfer waffles to rack in oven to keep warm and crisp. Make more waffles in same manner. "
        ], 
        "date": "2007-11-11T23:13:27+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "2 cups whole milk", 
            "1/2 cup vegetable oil (I haven’t tried this with melted butter instead, but if you do, let us know how it goes)", 
            "1/2 cup sugar", 
            "1 package (2 1/4 teaspoons) active dry yeast", 
            "4 1/2 cups all-purpose flour plus plenty of extra for flouring the surface", 
            "1/2 heaping (slightly more) teaspoon baking powder", 
            "1/2 scant (slightly less) teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "Filling", 
            "1/3 cup sugar", 
            "1/3 cup light or dark brown sugar", 
            "2 teaspoons cinnamon", 
            "1 cup jelly or jam (raspberry and/or apricot are traditional, but anything you like will work), divided", 
            "6 tablespoons salted butter melted (or unsalted, with a pinch of salt in it), divided", 
            "1 cup finely chopped walnuts or pecans (although there’s no reason you can’t use any other nut you prefer), divided", 
            "2/3 cup finely chopped semisweet chocolate or miniature chocolate chips, divided (optional, but use slightly more dried fruit if you’re omitting this)", 
            "2/3 cup dried currants or chopped dark raisins, divided", 
            "Glaze", 
            "3 tablespoons butter, softened", 
            "3 ounces cream cheese, at room temperature", 
            "3/4 cup powdered sugar", 
            "1/2 teaspoon vanilla extract", 
            "1/4 cup milk, approximately"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/ranch-rugelach1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/05/ranch-rugelach/", 
        "title": "ranch rugelach", 
        "directions": [
            "Make the dough: Mix the milk, vegetable oil and 1/2 cup sugar in a large pot, and heat it until just before it boils. Turn off the heat, remove the pot from the burner, and let it cool for 45 minutes to one hour. When the mixture is lukewarm, sprinkle in the yeast and let it sit for a minute or two before adding the four cups of flour. Stir the mixture together, cover the pot and let it sit for at least an hour. After an hour the dough should be a giant, puffy but still pretty wet. Add another 1/2 cup of flour, the baking powder, baking soda and salt and stir the mixture together. Either use it right away, or cover the dough and put it in the fridge until you’re ready to use it — overnight or up to a day or two. If it starts to overflow in the pot, press it down.", 
            "Roll out the dough: Generously flour a large counter — the dough is very wet and sticky. Dump half the dough onto it, flour your rolling pin well, and roll the dough into a large rectangle about 24 inches wide and as thin as you get it in the other direction (ours ended up about 12 inches deep).", 
            "Fill the rolls: Generously spray two 12-cup muffin tins with a cooking spray, or butter them well. Go ahead and spray the flat part too, so if your jam bubbles out of the buns, it will be easier to scrub off. (This is what years of a dishwasher-less experience will teach you!)", 
            "Stir together the 1/3 cup sugar, brown sugar and cinnamon and set it aside. Spread one half of your jam evenly over the dough, leaving a 1/2-inch margin at the wider ends. (If your jam is cold from the fridge, you can heat it slightly in a small saucepan or in the microwave, not until bubbling hot but until warm enough to easily spread.)", 
            "Drizzle three tablespoons melted butter over the jam layer. (Although it would be intuitive to do it in the other order, I was concerned that the jam wouldn’t spread well over the slick melted butter. Plus, I wanted the melted butter to mingle with the cinnamon sugar, as it would in a traditional cinnamon roll. Drooling yet?)", 
            "Sprinkle the jam and butter layer with 1/4 cup of the cinnamon-sugar mixture, then half of the nuts, half the chocolate and half the dried fruit.", 
            "Starting with the wider side of the rectangle (the one that should be 24 inches), begin to tightly roll the dough, incorporating the filling. Once it is fully rolled up, cut it into two-inch segments with a sharp knife (a serrated knife works great here). Place one in each muffin cup. Sprinkle the tops of the rolls with a tablespoon of the cinnamon-sugar mixture and set the tin aside to puff some more, about 20 to 30 minutes. (You could loosely cover it with plastic wrap, but we didn’t bother.)", 
            "Repeat this process with the other half of the dough, and the remaining filling ingredients.", 
            "Preheat your oven to 350°F.", 
            "Bake the rolls: Bake your rolls for 15 to 20 minutes, until they’re golden at the edges and the filling looks bubbly. (I was using a convection oven at the Lodge, which is nothing like my oven at home so your baking time may vary. Look for a nice color and that bubbling filling before you take them out.)", 
            "Let the rolls mostly cool on a rack.", 
            "Make the glaze: Beat the butter, cream cheese, powdered sugar and vanilla together in a bowl with an electric mixture until fluffy. From here, you can either spread this frosting on your lukewarm buns, or thin it with milk until it is more of a drizzling consistency. Eat one at once."
        ], 
        "date": "2009-05-01T11:29:38+00:00"
    }, 
    {
        "ingredient_list": [
            "Streusel", 
            "1/4 cup (31 grams) all-purpose flour", 
            "1/4 cup (28 grams) white whole wheat flour", 
            "1 tablespoon (13 grams) granulated sugar", 
            "3 tablespoons (38 grams) light or dark brown sugar", 
            "1/4 teaspoon ground cinnamon", 
            "Pinch of nutmeg", 
            "Pinch of salt", 
            "3 tablespoons (42 grams) unsalted butter, melted", 
            "Muffin", 
            "1 large egg", 
            "1/4 cup (50 grams) light or dark brown sugar", 
            "3 tablespoons (38 grams) granulated sugar", 
            "5 tablespoons (71 grams) unsalted butter, melted and cooled to lukewarm", 
            "3/4 cup (177 ml) sour cream", 
            "1 cup (approx. 120 grams) white whole wheat flour or whole wheat pastry flour (see Note)", 
            "1/2 cup (63 grams) all-purpose flour", 
            "1 1/2 teaspoon baking powder", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon salt", 
            "1 cup diced rhubarb, in 1/2-inch pieces (from about 6 to 8 ounces of stalks)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/rhubarb-streusel-muffins.jpg?w=751", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Rhubarb"
        ], 
        "url": "https://smittenkitchen.com/2011/05/rhubarb-streusel-muffins/", 
        "title": "rhubarb streusel muffins", 
        "directions": [
            "Preheat oven to 375°F. Butter 12 muffin cups. ", 
            "Make streusel: In a small dish, stir together flours, sugars, spices and salt. Stir in butter until crumbly. Set aside.", 
            "Make muffins: Whisk egg in the bottom of a large bowl with both sugars. Whisk in butter, then sour cream. In a separate bowl, mix together flours, baking powder, baking soda and salt and stir them into the sour cream mixture, mixing until just combined and still a bit lumpy. Fold in rhubarb and 1/3 (feel free to eyeball this) of the streusel mixture.", 
            "Divide batter among prepared muffin cups. Sprinkle each muffin with remaining streusel, then use a spoon to gently press the crumbs into the batter so that they adhere. Bake for 15 to 20 minutes, until tops are golden and a tester inserted into the center of muffins comes out clean. Rest muffins in pan on cooling rack for two minutes, then remove muffins from tin to cool them completely."
        ], 
        "date": "2011-05-18T13:57:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (2 ounces) walnuts or pecans", 
            "2 teaspoons fennel seeds", 
            "3 cups (380 grams) unbleached pastry flour or unbleached all-purpose flour", 
            "3/4 cup (150 grams) granulated sugar", 
            "1 tablespoon plus 1 teaspoon baking powder", 
            "3/4 teaspoon baking soda", 
            "1 1/2 cups (345 grams) plain yogurt", 
            "3/4 cup (150 grams) vegetable oil (though I imagine that olive oil would be a delicious swap whoops, many commenters who tried it said that the olive oil was way too heavy; listen to them, not me!)", 
            "1/2 cup (125 grams) ricotta cheese", 
            "6 tablespoons (90 grams) crème fraîche or sour cream", 
            "Kosher salt, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/ricotta-muffins.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/01/ricotta-muffins/", 
        "title": "ricotta muffins", 
        "directions": [
            "Adjust the oven rack to the center position and preheat oven to 325°F. Lightly butter a 1/2-cup capacity muffin tin.", 
            "Spread the nuts on a baking sheet and toast in the oven until lightly browned (though I like my pecans a darker brown, for better flavor), about 8 to 10 minutes. Shake the pan halfway through to ensure that the nuts toast evenly. Cool, chop finely and set aside.", 
            "Turn the oven up to 350°F.", 
            "In a small sauté pan over medium heat, toast the fennel seeds, stirring occasionally until they become aromatic and turn slightly brown, about 2 to 3 minutes. Allow to cool and finely chop, crush or grind in a spice grinder, clean coffee grinder or mortar and pestle.", 
            "In a large bowl, sift the flour, sugar, baking powder and baking soda together to combine. Sprinkle in the fennel seeds. Make a large well in the center and pour in the yogurt and oil. Whisk together the liquids and gradually draw in the the dry ingredients, mixing until incorperated.", 
            "To prepare the filling: Place the ricotta in a mixing bowl and, if stiff, break it up wtih a rubber spatula to loosen. Stire in the crème fraîche and a pinch of salt.", 
            "Using a pastry bag fitted with a wide tip, a plastic bag with the corner snipped off or a spoon, fill each muffin tin one-third of the way with batter. Place one tablespoon of the filling into the center of each muffin.", 
            "(I suspect at this point that Silverton believes that your filling will be thick, and perhaps with a stiff ricotta and crème fraîche, it might have been, but my mixture, with store brand ricotta and sour cream, was more of a puddle that spilled out into a flat layer. While it didn’t matter in the end, it did make it harder to put the remaining muffin batter — which was stiffer than the filling — over the ricotta mixture with just a spoon and I ended up having to go the plastic bag/piping bag route to easily cover it. Grumble-gripe.)", 
            "Pipe or spoon the remaining batter into the cups, filling them to just below the rim. (Unlike you see in my pictures, as I overfilled the tins.) Sprinkle about 1 teaspoon of the nuts over the top of each. (I had extra.)", 
            "Bake for 25 to 30 minutes, until lightly brown and firm to the touch.", 
            "Do ahead: I’m going to put a big question mark in this space until smarter people than me weigh in on whether a ricotta-filled muffin can be stored at room temperature. (We left them out and lived to tell you about them, but perhaps this was still a no-no?) Muffins always freeze well, however if you’re looking to a get a head start."
        ], 
        "date": "2010-01-20T12:57:15+00:00"
    }, 
    {
        "ingredient_list": [
            "3 firmish pears (about 1 pound or 455 grams)", 
            "1 1/2 cups (190 grams) all-purpose flour", 
            "1/4 cup (50 grams) granulated sugar plus 1 1/2 tablespoons granulated or coarse for sprinkling", 
            "1 1/2 teaspoons (8 grams) baking powder", 
            "1/2 teaspoon (3 grams) table salt plus additional for egg wash", 
            "6 tablespoons (85 grams) cold unsalted butter, cut into small cubes", 
            "1/4 cup (60 ml) heavy cream", 
            "1/4 cup (3 ounces or 85 grams) semisweet or bittersweet chocolate, chopped (or chips)", 
            "2 large eggs, 1 for dough, 1 for glaze"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/10/pear-and-chocolate-chunk-scones.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Chocolate", 
            "Fall", 
            "Pear", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2012/10/roasted-pear-and-chocolate-chunk-scones/", 
        "title": "roasted pear and chocolate chunk scones", 
        "directions": [
            "Heat oven to 375°F. Peel and core pears. Cut into 1-inch chunks. Line a large baking sheet with parchment paper. Arrange pear chunks on parchment and roast until they feel dry to the touch and look a little browned underneath, about 20 minutes. Slide parchment paper with pear chunks onto a cooling rack (or onto a plate in the fridge or freezer to speed this up) and cool to lukewarm. Leave oven on. Line baking sheet with another piece of parchment.", 
            "Whisk flour, baking powder, 1/4 cup sugar and salt together in the bowl of an electric mixer. Toss in cooled pear chunks, bits of butter, heavy cream and 1 egg. With the paddle attachment, mix the dough on low speed until it just comes together. Don’t overmix. Add the chocolate chunks and mix for 5 seconds more. ", 
            "On a very well floured counter, pat out dough into a 6-inch round. Cut into 6 generous wedges and transfer to baking sheet at least two inches apart (do as I say, not as I did here!). Whisk remaining egg in a small dish with 1 teaspoon of water and a pinch of salt. Brush each scone with egg wash and sprinkle with remaining tablespoon of sugar. ", 
            "Bake scones until firm and golden, about 30 minutes. Transfer to a cooling rack. Serve, and pat yourself on the back for your excellent host skills. ", 
            "Do ahead: You can get this recipe all the way to the point where you’d bake them, and instead cover the pan with foil or plastic wrap and freeze them overnight. Bake them directly from the freezer in the morning; they should only take a few minutes longer. For longer than overnight, transfer frozen, already shaped, scones to a freezer bag until needed. In both cases, brush the egg wash/sprinkle the sugar on while still frozen, before baking the scones."
        ], 
        "date": "2012-10-26T13:02:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup olive oil", 
            "5 Anaheim chiles or 3 jalape&#241os, stemmed, seeded, and finely chopped (I was nervous and only used 2 Anaheims; I would go for 3 or 4 next time for a more moderate but still gentle kick)", 
            "1 small yellow onion, chopped", 
            "5 cloves garlic, crushed then sliced", 
            "1 teaspoon ground cumin", 
            "1 tablespoon paprika", 
            "1 28-ounce can whole peeled tomatoes, undrained", 
            "Kosher salt, to taste", 
            "6 eggs", 
            "1/2 cup feta cheese, crumbled", 
            "1 tablespoon chopped flat-leaf parsley", 
            "Warm pitas, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/shakshuka.jpg?w=752", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Budget", 
            "Eggs", 
            "Israeli", 
            "North African", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/04/shakshuka/", 
        "title": "shakshuka", 
        "directions": [
            "Heat oil in a 12-inch skillet over medium-high heat. Add chiles and onions and cook, stirring occasionally, until soft and golden brown, about 6 minutes. Add garlic, cumin, and paprika, and cook, stirring frequently, until garlic is soft, about 2 more minutes.", 
            "Put tomatoes and their liquid into a medium bowl and crush with your hands. Add crushed tomatoes and their liquid to skillet along with 1/2 cup water, reduce heat to medium, and simmer, stirring occasionally, until thickened slightly, about 15 minutes. Season sauce with salt.", 
            "Crack eggs over sauce so that eggs are evenly distributed across sauce’s surface. Cover skillet and cook until yolks are just set, about 5 minutes. Using a spoon, baste the whites of the eggs with tomato mixture, being careful not to disturb the yolk. Sprinkle shakshuka with feta and parsley and serve with pitas, for dipping."
        ], 
        "date": "2010-04-08T22:24:26+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound asparagus, cleaned, not trimmed", 
            "2 ounces thinly sliced proscuitto (optional, see Note up top)", 
            "8 large eggs", 
            "2 tablespoons milk or cream", 
            "1/2 teaspoon kosher salt, plus more to taste", 
            "Freshly ground black pepper", 
            "2 scallions, thinly sliced on the diagonal", 
            "2 tablespoons olive oil", 
            "2 to 4 ounces soft goat cheese, crumbled (to taste)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/shaved-asparagus-frittata1.jpg?w=640", 
        "tags": [
            "Asparagus", 
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Spring", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/04/shaved-asparagus-frittata/", 
        "title": "shaved asparagus frittata", 
        "directions": [
            "Prepare the asparagus: No need to snap off the tough ends of your asparagus. Lay a single stalk on its side on a cutting board. Holding onto the tough end, use a vegetable peeler to peel ribbons away from the tough end (and your hand) right through the soft tip. Discard the tough ends once you’re done peeling. ", 
            "[As you get to the bottom of your stalk, you might find that the raised edge of your peeler is keeping the blade from shaving the asparagus as thin as you’d like. For this, I move the asparagus to the edge of the cutting board with the peeler blade half-off so you can get closer. Just be careful not to shave your cutting board. :) ]", 
            "Crisp the proscuitto: If you’re using the proscuitto, heat the 12-inch ovenproof skillet you’ll use for the final frittata over medium heat. Lay slices in a single layer (will need to do this in two batches) and cook them until lightly brown underneath and curling. Flip them for another 20 to 30 seconds then transfer them to paper towels to blot off the extra oil and cool. Repeat with remaining proscuitto. You’ll use the pan again in a minute.", 
            "Heat your broiler.", 
            "Vigorously beat your eggs with the milk or cream, plus salt and pepper until well-combined. Stir in scallions and crumble in crisp proscuitto, if using. Gently add asparagus peels, just swishing the egg mixture over them. ", 
            "Heat your skillet over medium heat and add 2 tablespoons olive oil. Let it heat fully, then swish it around so it goes up the sides of the pan. Pour in asparagus and egg mixture, nudging the asparagus around so it mostly stays level with the eggs. Crumble goat cheese over, to taste. Cook gently (lowering the heat to medium-low if needed) for about 5 minutes, until the edges are set and brown but it’s still loose and eggy on top. Transfer skillet to the broiler and cook for another 1 to 3 minutes, keeping a close eye on it, until eggs are set on top. ", 
            "Let cool for 5 minutes before cutting into wedges, or longer if you’d like to eat it at room temperature."
        ], 
        "date": "2016-04-27T11:32:21+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (10 ounce) package frozen spinach, thawed, squeeze of all excess liquid, and chopped", 
            "1 1/2 cups finely chopped onion (1 large)", 
            "3 tablespoons unsalted butter", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper", 
            "1/4 teaspoon freshly grated nutmeg", 
            "8 cups cubed French or Italian bread in 1-inch cubes (1/2 lb)", 
            "6 ounces coarsely grated Gruyère (2 cups)", 
            "2 ounces finely grated parmesan (1 cup)", 
            "2 3/4 cups milk", 
            "9 large eggs", 
            "2 tablespoons Dijon mustard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spinach-and-cheese-strata1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/12/spinach-and-cheese-strata/", 
        "title": "spinach and cheese strata", 
        "directions": [
            "Sauté onion in butter in a large, heavy skillet over medium heat until soft, about 5 minutes. Add 1/2 teaspoon salt, 1/4 teaspoon pepper and nutmeg and continue cooking for one minute. Stir in spinach, remove from heat and set aside.", 
            "Spread one third of the bread cubes in a well-buttered 3-quart gratin dish or other ceramic baking dish. Top with one-third of spinach mixture and one-third of each cheese. Repeat layering twice with remaining bread, spinach and cheese.", 
            "Whisk eggs, milk, mustard and remaining 1/2 teaspoon salt and 1/4 teaspoon pepper together in a large bowl and pour evenly over strata. Cover with plastic wrap and chill strata for eat least 8 hours or up to a day.", 
            "The next day, let it stand at room temperature for 30 minutes while preheating the oven to 350°F. Bake strata, uncovered, in middle of oven until puffed, golden brown, and cooked through, 45 to 55 minutes. Let stand 5 minutes before serving."
        ], 
        "date": "2009-12-22T12:27:40+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/spinach-and-egg-pizzettes1.jpg?w=640", 
        "tags": [
            "Brunch", 
            "Eggs", 
            "Italian", 
            "Photo", 
            "Pizza", 
            "Put An Egg On It", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/spinach-and-egg-pizzettes/", 
        "title": "spinach and egg pizzette", 
        "directions": [
            "Heat oven to 500 degrees. Place parchment paper* on tray and sprinkle with cornmeal. Stretch pieces of dough into 6 to 7-inch thin, round-ish shapes.", 
            "If using grown-up spinach, remove coarse stems. No need to remove stems from baby spinach. Wash and drain spinach leaves but no need to fully dry. In a large skillet, cook spinach with water droplets still clinging to the leaves (if it seems too dry, add another tablespoon or two of water to the pan) until spinach just wilts. Plunge spinach in cold water, then transfer it to a colander. Press out as much liquid as you can, then squeeze the rest in small fisfuls.", 
            "Transfer to cutting board and chop spinach into small bits. In a bowl, combine it with creme fraiche, garlic, parmesan, salt and pepper. ", 
            "Divide spinach mixture over each dough round, spreading almost to the edges, thinning it slightly in the center with a spoon to make an indentation to help hold the egg in place. If using small eggs, crack one into the center of each pizzette. If using larger eggs, separate the egg. Add yolk to center of spinach, then pour in egg white carefully, so not to add so much that it floods the pizza. However, if it does spill over, don’t sweat it, that’s what the parchment is for. ", 
            "Either bake pizza directly on parchment covered trays or slide parchment onto pizza stones for anywhere from 6 to 8 minutes (in a very robust oven), to 10 to 13 minutes (in a regular one)**, until egg white is set and the yolk is still loose. As soon as you remove the pizzette from the oven, add a grind of black pepper, very thin drizzle of olive oil and scatter some extra parmesan over it. Eat immediately.", 
            "* Technically speaking, parchment paper should not go in an oven hotter than 450 degrees, but I’ve found that nothing bad happens, it only gets a little brown at the edges. Without the parchment, any egg run-off tends to cement the pizzette to the pan, no fun at all.", 
            "** The baking times are especially finicky here. These will work for most people, however, if your egg becomes too cooked before the pizza is remotely golden at the edges, you might want to add it later in the cooking time. Be especially cautious of this if using small eggs."
        ], 
        "date": "2013-11-04T12:05:18+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound pancetta (a cured pork that is less salty than proscuitto, and not smoked like bacon), cut into 1/4-inch dice", 
            "1 pound Yukon gold potatoes, peeled and cut into a 1/2-inch dice", 
            "1 small yellow onion, chopped small", 
            "1/2 pound asparagus, tough ends trimmed and cut into 1-inch segments", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/spring-asparagus-pancetta-hash.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Spring", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/05/spring-asparagus-pancetta-hash/", 
        "title": "spring asparagus pancetta hash", 
        "directions": [
            "Serving ideas: Fried eggs, dabs of goat cheese and slivers of green onions", 
            "Heat a 12-inch cast iron frying pan over medium heat. Fry the pancetta, turning it frequently so that it browns and crisps on all sides; this takes about 10 minutes. Remove it with a slotted spoon and drain it on paper towels. Leave the heat on and the renderings in the pan. (With a well-seasoned cast iron, this should be all the fat you need to cook the remainder of the hash. If you’re not using a cast iron, you might need to add a tablespoon or so of oil; if you’ve skipped the pork, you’ll want to start with 2 tablespoons oil.)", 
            "Add the potatoes don’t move them for a couple minutes. Use this time to season them well with salt and pepper. Once they’ve gotten a little brown underneath, begin flipping and turning them, then letting them cook again for a few minutes. The idea is not to fight them off the frying pan, once they’ve gotten a little color, it’s easier to flip them and you’ve gotten closer to your goal of getting them evenly browned. ", 
            "When the potatoes are about three-fourths as crisped and brown as you’d like them — this takes about 15 minutes — add the onion. (I add this now, not earlier, because I find it often burns before the potatoes are done.) Cook for an additional 5 minutes. Add the asparagus, cover the pan and cook for 5 to 8 minutes, or until crisply cooked. (Skinny asparagus will take just 5 minutes; thicker asparagus will take longer.) Remove the lid, return the pancetta to the pan for another minute, to reheat. Taste for seasoning and adjust if needed. Serve immediately. "
        ], 
        "date": "2010-05-05T11:42:37+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups (280 grams) all-purpose flour", 
            "1 tablespoon (15 grams) aluminum-free baking powder", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 teaspoon table salt", 
            "6 tablespoons (85 grams) cold, unsalted butter", 
            "1 cup (about 130 grams) chopped very ripe strawberries (I quarter small or medium ones and further chop larger ones)", 
            "1 cup heavy cream "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/strawberries-and-cream-biscuits1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Scones/Biscuits", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/06/strawberries-and-cream-biscuits/", 
        "title": "strawberries and cream biscuits", 
        "directions": [
            "Preheat oven to 425 degrees. Line a large baking sheet with parchment paper.", 
            "In the bottom of a large, wide-ish bowl, whisk flours, baking powder, sugar and salt together. Add butter, either by cutting it in with two knives or a pastry blender (alternatively, you can freeze the butter and grate it in on the large holes of a box grater; a tip I learned from you guys) cut it into the flour mixture with a pastry blender, breaking it up until the mixture resembles a crumbly meal with tiny pea-sized bits of butter about. Gently stir in the strawberries, so that they are coated in dry ingredient, then stir in heavy cream. (I like to use a rubber spatula to gently lift and turn the ingredients over each other.) When you’ve mixed it in as best as you can with the spatula, go ahead and knead it once or twice in the bowl, to create one mass. Do not worry about getting the dough evenly mixed. It’s far more important that the dough is not overworked.", 
            "Generously flour your counter. With as few movements as possible, transfer your dough to the counter, generously flour the top of it and with your hands or a rolling pin, gently roll or press the dough out to a 3/4-inch thickness. Cut into 2 1/2-inch circles with a floured biscuit cutter or top edge of a drinking glass, pressing straight down and not twisting (this makes for nice layered edges) as you cut. Carefully transfer scones to prepared baking sheet, leaving a couple inches between each.", 
            "You can re-roll the scraps of dough, but don’t freak out over how wet the dough becomes as the strawberries have had more time to release their juice. They’ll still bake up wonderfully.", 
            "Bake the scones for 12 to 15 minutes, until bronzed at the edges and the strawberry juices are trickling out of the biscuits in places. Cool in pan for a minute, then transfer to a cooling rack. Serve warm or at room temperature.", 
            "Do ahead: Biscuits are generally best the day they are baked. However, if you wish to get a lead on them, you can make them, arrange them on your parchment-lined sheet and freeze them. If you’re prepping just one day in advance, cover the tray with plastic wrap and bake them the day you need them. If you’re preparing them more than one day in advance, once they are frozen, transfer them to a freezer bag or container. Bring them back to a parchment-lined sheet when you’re ready to bake them. No need to defrost the froze, unbaked scones, just add 2 to 3 minutes to your baking time."
        ], 
        "date": "2012-06-06T13:40:04+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (95 grams) all-purpose flour", 
            "3/4 cup (105 grams) yellow cornmeal", 
            "2 tablespoons (25 grams) granulated sugar", 
            "1/2 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon fine sea or table salt", 
            "3 tablespoons (45 grams) unsalted butter, plus more for buttering skillet", 
            "1 cup (235 ml) buttermilk, well-shaken, or 2/3 cup plain yogurt thinned with 1/3 cup milk", 
            "2 large eggs", 
            "1 cup (about 140 grams or 5 ounces) roughly chopped strawberries"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/strawberry-cornmeal-griddle-cakes1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Pancakes", 
            "Photo", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/06/strawberry-cornmeal-griddle-cakes/", 
        "title": "strawberry cornmeal griddle cakes", 
        "directions": [
            "In a large bowl, combine flour, cornmeal, sugar, baking powder, baking soda and salt with a whisk. Melt 3 tablespoons butter in the bottom of a medium bowl, then whisk in buttermilk, followed by the eggs, one at a time. Stir in strawberries. Pour strawberry-buttermilk mixture into dry ingredients and stir until just combined.", 
            "In a large skillet (cast-iron is my favorite for pancakes), melt butter over medium/medium-low heat. Pour a scant 1/4 cup batter into skillet for each pancake. Cook until bottoms are golden and bubbles appear all over top, about 1 to 2 minutes. Flip pancakes and cook until second side is golden, another minute. If batter slipped out the sides of the pancake when you first flipped it, return it to the first side for another 30 seconds to ensure the leaked batter cooks. Repeat with remaining batter, adding more butter as needed. If pan gets too hot — the butter turns brown as soon as it melts, the pancakes are done on the outside before the inside — reduce the heat to low.", 
            "If you’re not going to eat these right away, you can spread them on a baking sheet and keep them warm until needed in a 200 degree oven.", 
            "Serve with fixings of your choice, be it a pat of butter, powdered sugar, syrup and/or additional fresh strawberries."
        ], 
        "date": "2015-06-11T11:32:08+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons butter (1 ounce or 28 grams), plus additional for brushing pan", 
            "3/4 cup kernels cut from one large ear sweet fresh corn", 
            "1/8 teaspoon (1 gram) salt plus additional for seasoning corn", 
            "1 large egg", 
            "1 1/4 cups (296 ml) buttermilk", 
            "1/4 teaspoon vanilla extract", 
            "1 tablespoon (13 grams) sugar", 
            "3/4 cup (3 3/8 ounces) all-purpose flour", 
            "1/4 cup (3/4 ounce or 22 grams) cornmeal, any kind", 
            "1 teaspoon (5 grams) baking powder", 
            "1/2 teaspoon baking soda"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/08/4895873895_4fd0805304_o.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Corn", 
            "Pancakes", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/08/sweet-corn-pancakes/", 
        "title": "sweet corn pancakes", 
        "directions": [
            "Melt butter in a large cast iron skillet or griddle pan over medium heat. Add corn and saute for 4 to 5 minutes, until it begins to brown ever-so-slightly. Sprinkle with salt and set aside to cool. Wipe out skillet.", 
            "Lightly beat egg in the bottom of a large bowl, then whisk in buttermilk, corn, vanilla and sugar.  In a smaller bowl, whisk flour, cornmeal, baking powder, baking soda and 1/8 teaspoon salt. Stir dry ingredients into wet, mixing until just combined but still lumpy in appearance.", 
            "Reheat your skillet or saute pan to medium. Brush the pan with butter and ladle 1/4 cup batter at a time, 2 inches apart. When the pancakes have bubbles on top and are slightly dry around the edges, flip them over and cook them until golden brown underneath. If they seem to be cooking too quickly (dark on the outside, raw centers) turn your heat down to low for the next batch and inch it up as needed. Repeat with remaining batter, and serve immediately with a pat of salted butter and a healthy dose of maple syrup."
        ], 
        "date": "2010-08-17T11:12:05+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons (30 grams) unsalted butter, plus more for pan", 
            "2 tablespoons (25 grams) granulated sugar", 
            "1 large egg", 
            "1/4 teaspoon vanilla extract", 
            "1/2 cup plus 2 to 4 tablespoons buttermilk", 
            "1/4 teaspoon fine sea or table salt", 
            "1/2 teaspoon baking soda", 
            "1 cup (130 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/tall-fluffy-buttermilk-pancakes.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Pancakes", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2017/05/tall-fluffy-buttermilk-pancakes/", 
        "title": "tall, fluffy buttermilk pancakes", 
        "directions": [
            "Heat oven to 225 degrees F and place a large baking sheet inside.\nMelt butter halfway in the bottom of a large bowl then whisk in sugar. This should leave the mixture lukewarm, not piping hot, but if it still is, let it cool slightly before adding the egg. Whisk in egg and vanilla, then 1/2 cup plus 2 tablespoons of the buttermilk. Whisk in salt and baking soda until fully combined, scrape down bowl, then stir in flour until it just disappears. You’re looking for a thick mixture, more like a very soft cookie dough than a pourable batter, but if it’s very stiff, add 1 to 2 more tablespoons of the remaining buttermilk and stir until combined.\nHeat griddle or frying pan over medium. Once hot, add a good pat of butter (please don’t skimp; butter makes crispy edges) and dollop in small mounds of pancake batter — I find a #40 or 1.5 tablespoon scoop to make this even easier and neater. Try to resist the urge to press the mounds into flat puddles; a little nudge is okay but we’d much rather keep the height here. Once bubbles form on top, lift a corner of each pancake and check for it to be lightly browned before flipping it.", 
            "At this point, I like to reduce the heat to medium-low for the remainder of the cooking time. I’d rather the pancakes take a minute longer than singe dark as soon as they hit the pan, but your stove will vary.\nOnce pancakes are golden brown on the second side, and do not worry if the tall sides look raw, this is completely expected, just transfer them to heated oven. Repeat with remaining batter. Tall, thick pancakes like this almost always hide pockets of uncooked batter; 5 minutes in the oven will fix this. You can leave them in the oven for much longer, however, if you now wish to rinse berries and make coffee (which of course you do)."
        ], 
        "date": "2017-05-11T12:06:42+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 (1 1/4 to 1 1/2 pounds) Yukon Gold potatoes", 
            "1 small onion", 
            "1 cup olive oil", 
            "6 extra-large or 7 large eggs", 
            "Salt and freshly ground black pepper (don’t skimp)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/09/tortilla-de-patatas-potato-tortilla.jpg?w=750", 
        "tags": [
            "Brunch", 
            "Budget", 
            "Eggs", 
            "Passover", 
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Spanish", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2007/09/tortilla-de-patatas/", 
        "title": "tortilla de patatas", 
        "directions": [
            "Prepare potatoes and onions: Peel potatoes and onion and slice them very thin with a mandoline, the slicing blade of a food processor, or by hand. If either are on the large side, first cut them in a half lengthwise so the slices will be in half-moons.", 
            "Cook potatoes and onions: Heat oil in an 8- to 10-inch skillet, ideally nonstick, over medium-high until very hot, about 3 minutes. Add potatoes and onions in even layers and reduce heat to medium-low. Cook for 15 minutes, flipping and nudging potatoes around to ensure they cook evenly. Potatoes are done when they are tender when pierced with the tip of a knife. They should not get brown or fall apart in flipping (unless you like your tortillas with softer, more broken-up potatoes, as some do).\nDrain potatoes and onions: Transfer potatoes and onion to a colander set over a bowl and drain them. Season potatoes and onion with salt and pepper and let cool slightly, about 5 minutes. [Go make your salad now! Or start cracking those eggs…]\nMake the tortilla batter: In the bottom of a large bowl, lightly beat eggs with a couple good pinches of salt and freshly ground black pepper. Stir in drained potatoes and onions. If you have 10 minutes, definitely let them soak together for that long; it makes a difference in how well the finally tortilla stays together. If you’re in a rush, it’s not going to ruin the dish if you skip it.\nCook the tortilla: Add 2 tablespoons of the drained cooking oil* (back to the skillet over medium-high heat. Pour potato mixture into skillet and flatten the potatoes with a spatula until they’re mostly even. Reduce heat to medium-low. Cook, moving and shimmying the skillet and nudging the egg around (so it runs underneath) for a minute before letting the tortilla cook undisturbed until the top is wet but not very runny, and it is golden underneath.", 
            "Loosen the tortilla with a spatula then slide it onto a large dinner plate.  With your hands in potholders, invert the skillet over the plate, take a deep breath, and flip it back into the skillet. You can do it! Shake the skillet to straighten the tortilla and use a spatula to gently tuck the edges back under, if needed.", 
            "Return the skillet to the stove and cook tortilla to your desired doneness, another 2 to 3 minutes if you like an ever-so-slightly loose center (try it and see if you can go back), 3 to 4 minutes, or until a toothpick inserted into the center comes out dry, for full doneness.\nServe: Slice onto a plate and serve in wedges, hot, cold or at room temperature, plain, or with a dusting of smoked paprika and/or squiggle of aioli or mayo.", 
            "*Save the rest of the cooking in the fridge for future tortillas, or eggs, or potatoes, or anything you want with a faint onion infusion.\n"
        ], 
        "date": "2007-09-10T22:31:50+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (125 grams) all-purpose flour", 
            "1 cup (120 grams) whole wheat flour", 
            "Zest of 1 lemon, finely grated", 
            "3 tablespoons raw (turbinado) or light brown sugar", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon coarse or kosher salt", 
            "5 tablespoons cold unsalted butter, cut into small bits", 
            "1 cup fresh blueberries", 
            "2/3 cup (150 ml) milk, whole is best here", 
            "1 large egg, beaten", 
            "1 tablespoon raw (tubinado) or other coarse sugar for finishing"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/07/very-blueberry-scones1.jpg?w=640", 
        "tags": [
            "Blueberries", 
            "Breakfast", 
            "Brunch", 
            "Freezer Friendly", 
            "Photo", 
            "Scones/Biscuits", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/07/very-blueberry-scones/", 
        "title": "very blueberry scones", 
        "directions": [
            "Heat oven to 400°F (205°C). Line a large baking sheet with parchment paper. ", 
            "In a large bowl, combine flours, zest, sugar, baking powder and salt. Add cold butter and work into the flour mixture until the biggest pieces are the size of small peas with either your fingertips or a pastry blender. Stir in blueberries, then milk, mixing only until large clumps form. Use your hands to reach inside the bowl and gently (so gently) knead the mixture into one mass. The more you knead, the wetter the dough will get as the blueberries break up, so work quickly and knead only a few times, if you can get away with it.", 
            "Transfer dough to a well-floured counter and pat into a roughly 1-inch tall disc. Cut into 8 to 10 wedges, do not fret if the blueberries are now making a mess of the dough; it will all work out in the oven. Transfer wedges to prepared baking sheet, spacing them apart. Brush the tops of each with egg, then sprinkle with coarse sugar.", 
            "Bake for 15 to 17 minutes, until scones are golden brown on top. Serve warm. I find most scones to be best the first day, but these were not bad at all on day two, gently rewarmed in the oven before eating. ", 
            "If freezing: I like to freeze scones unbaked and usually hold any egg wash until I’m ready to bake them. Simply spread the wedges on a baking sheet and chill until frozen solid and will no longer stick to each other, and pack tightly into a freezer bag. You can bake them right from the freezer; you’ll only need 2 to 4 minutes extra baking time."
        ], 
        "date": "2015-07-09T12:04:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (120 grams) whole wheat flour", 
            "1 cup (130 grams) all-purpose flour", 
            "1 teaspoon baking powder", 
            "1 teaspoon baking soda", 
            "1/4 teaspoon salt", 
            "1 tablespoon cinnamon", 
            "1/2 cup (115 grams) unsalted butter, at room temperature", 
            "1/2 cup (100 grams) granulated sugar", 
            "1/2 cup (95 grams) dark brown sugar, packed, divided", 
            "1 large egg, lightly beaten", 
            "1 cup buttermilk (235 ml) or yogurt (230 grams)", 
            "2 large apples, peeled, cored, and coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/04/whole-wheat-apple-muffins.jpg?w=750", 
        "tags": [
            "Apple", 
            "Breakfast", 
            "Brunch", 
            "Fruit", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/04/whole-wheat-apple-muffins/", 
        "title": "whole wheat apple muffins", 
        "directions": [
            "Preheat the oven to 450°F. Grease and flour 18 muffin cups and set aside.", 
            "Mix together the flours, baking powder, baking soda, salt, and cinnamon, and set aside. In a separate bowl, cream the butter and add the granulated sugar and 1/4 cup of the brown sugar. Beat until fluffy. Add the egg and mix well; stop once to scrape the sides and bottom of the bowl.Mix in the buttermilk gently. (If you over-mix, the buttermilk will cause the mixture to curdle.) Stir in the dry ingredients and fold in the apple chunks.", 
            "Divide the batter evenly among the prepared muffin cups, sprinkling the remaining 1/4 cup brown sugar on top. Bake for 10 minutes, turn the heat down to 400°F, and bake for an additional 5 to 10 minutes, or until a toothpick inserted into the center of a muffin comes out clean. Cool the muffins for 5 minutes in the tin, then turn them out onto a wire rack to cool completely."
        ], 
        "date": "2008-04-11T16:46:04+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (120 grams) whole wheat flour", 
            "1 cup (125 grams) all-purpose flour", 
            "1 tablespoon baking powder, preferably aluminum-free", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 teaspoon table salt", 
            "6 tablespoons (85 grams) cold unsalted butter", 
            "1 cup  (136 grams or 4 3/4 ounces) fresh raspberries", 
            "3/4 cup (189 grams) whole milk ricotta", 
            "1/3 cup (79 ml) heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/07/whole-wheat-raspberry-ricotta-scones.jpg?w=734", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Raspberries", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2011/07/whole-wheat-raspberry-ricotta-scones/", 
        "title": "whole wheat raspberry ricotta scones", 
        "directions": [
            "Preheat oven to 425 degrees. Line a large baking sheet with parchment paper. In the bottom of a large, wide-ish bowl, whisk flours, baking powder, sugar and salt together.", 
            "With a pastry blender: Add the butter (no need to chop it first) and use the blender to both cut the butter into the flour mixture until the biggest pieces are the size of small peas. Toss in raspberries and use the blender again to break them into halves and quarter berry sized chunks.", 
            "Without a pastry blender: Cut the butter into small pieces with a knife and work the butter into the flour mixture with your fingertips until the mixture resembles a coarse meal. Roughly chop the raspberries on a cutting board and stir them into the butter-flour mixture.", 
            "Both methods: Add the ricotta and heavy cream together and stir them in to form a dough with a flexible spatula.Using your hands, gently knead dough into an even mass, right in the bottom of the bowl. Don’t fret if the raspberries get muddled and smudge up the dough. This is a pretty thing.", 
            "With as few movements as possible, transfer the dough to a well-floured counter, flour the top of the dough and pat it into a 7-inch square about 1-inch tall. With a large knife, divide the dough into 9 even squares. Transfer the scones to prepared baking sheet with a spatula. Bake the scones for about 15 minutes, until lightly golden at the edges. Cool in pan for a minute, then transfer to a cooling rack. It’s best to cool them about halfway before eating them, so they can set a bit more. I know, way to be a big meanie, right?", 
            "Do ahead: Scones are always best the day they are baked. However, if you wish to get a lead on them, you can make them, arrange them on your parchment-lined sheet and freeze them. If you’re prepping just one day in advance, cover the tray with plastic wrap and bake them the day you need them. If you’re preparing them more than one day in advance, once they are frozen, transfer them to a freezer bag or container. Bring them back to a parchment-lined sheet when you’re ready to bake them. No need to defrost the froze, unbaked scones, just add 2 to 3 minutes to your baking time."
        ], 
        "date": "2011-07-16T12:48:58+00:00"
    }, 
    {
        "ingredient_list": [
            "Panna cotta", 
            "Neutral oil such as canola or safflower", 
            "4 tablespoons (60 ml) water", 
            "2 1/2 teaspoons (1 packet or 1/4 ounce or 7 grams) unflavored gelatin", 
            "2 cups (460 grams) plain whole-milk Greek yogurt", 
            "2 cups (475 ml) milk, heavy cream or a combination thereof (see note up top), divided", 
            "1/4 to 1/2 cup (50 to 100 grams) granulated sugar (see note up top)", 
            "2 tablespoons (30 ml) freshly squeezed lemon juice (from about 1/2 lemon)", 
            "To serve", 
            "1/3 to 1/2 cup (110 to 170 grams) honey", 
            "1/2 to 3/4 cup (55 to 85 grams) walnuts, toasted, cooled and coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/yogurt-panna-cotta-with-walnuts-and-honey.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Gluten-Free", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2013/04/yogurt-panna-cotta-with-walnuts-and-honey/", 
        "title": "yogurt panna cotta with walnuts and honey", 
        "directions": [
            "If you plan to unmold the panna cotta later, lightly coat the inside of a 9-inch round cake pan or smaller dessert cups with the oil. (No need to if you will scoop it from its cups.)", 
            "Place water in a small bowl. Stir in gelatin and set aside until the gelatin softens, about 15 minutes. ", 
            "In a large bowl, whisk all of yogurt and 1 cup of milk, cream or a mixture thereof. In a small saucepan, bring remaining milk or cream and sugar to a simmer. Stir in water-gelatin mixture (it will dissolve immediately) and remove from heat. Whisk this mixture into the yogurt mixture, then stir in lemon juice at the end. Pour mixture into cake pan or smaller cups and chill in fridge for at least 2 hours for small cups and up to 8 for a large pan. It’s best to do this the night before you need it, to be safe.", 
            "To unmold the cake pan, fill a larger baking dish with 1-inch boiling water. Dip panna cotta cake pan in it for 10 seconds, then flip it out onto a flat round platter. (A curved one will cause the panna cotta to appear sunken in the middle.)", 
            "To unmold smaller dishes, bring a small saucepan of water to a simmer and dip the bottom of a small panna cotta cup in one for five seconds, then invert it onto a plate. Repeat with remaining cups.", 
            "Right before you serve the panna cotta, sprinkle it with walnuts and drizzle it with honey. This needs to be done right before you serve it because the honey will (unfortunately) become liquidy and roll off it it sits on the panna cottas for too long. ", 
            "Do ahead: Panna cottas can be made two days ahead, though I suspect longer. Keep refrigerated. ", 
            "Non-gelatin panna cotta: Because gelatin is an animal by-product, many vegetarians will not eat it. I haven’t tested vegetarian options, but I’ve read a lot about using Natural Dessert’s Vegan Gel as well as agar-agar as a replacement. If you Google around a bit, you will find many directions for using either.", 
            "Dairy-free panna cotta: This isn’t really in the realm of this recipe, which was designed for yogurt, but there are many recipes on the web for panna cottas made with almond, coconut and/or soy milks, if you’re interested in looking into them.", 
            "* I put 1/3 cup each in these tiny (5.75 ounce) tumblers. You could also put about 2/3 cups each in this 7 1/2-ounce size."
        ], 
        "date": "2013-04-26T11:07:40+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "3 tablespoons olive oil", 
            "2 tablespoons light brown, dark brown or granulated sugar", 
            "1/4 cup buttermilk or 2 tablespoons each of milk and plain yogurt, whisked until smooth", 
            "1/2 teaspoon vanilla extract", 
            "2 cups shredded zucchini (from about 9 ounces whole, or 1 1/2 medium zucchini), heaping cups are fine", 
            "1 cup all-purpose flour (half can seamlessly be swapped with a whole wheat flour)", 
            "1/4 teaspoon table salt", 
            "1 teaspoon baking soda", 
            "1 teaspoon ground cinnamon", 
            "1/8 teaspoon ground or freshly grated nutmeg", 
            "Butter or oil, for coating skillet"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/zucchini-bread-pancakes.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Pancakes", 
            "Photo", 
            "Summer", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2012/07/zucchini-bread-pancakes/", 
        "title": "zucchini bread pancakes", 
        "directions": [
            "In a large bowl, combine eggs, olive oil, sugar, buttermilk and vanilla until smooth. Stir in zucchini shreds. In a smaller bowl, whisk together flour, salt, baking soda, cinnamon and nutmeg. Stir dry ingredients into zucchini batter, mixing until just combined.", 
            "Preheat oven to 200°F and place a tray — foil-lined if you’re into doing fewer dishes later — on a middle rack.", 
            "Heat a large, heavy skillet (my favorite for pancakes is a cast-iron) over medium heat. Once hot, melt a pat of butter in pan and swirl it around until it sizzles. Scoop scant 1/4-cup dollops of batter (mine were about 3 tablespoons each) in pan so the puddles do not touch. Cook until bubbles appear on the surface, about 2 to 3 minutes. Flip pancakes and cook another minute or two, until golden underneath. Transfer pancakes to prepared pan to keep warm as well as ensure that they’re all cooked through when they’re served. Repeat with remaining batter. Serve warm. Repeat next weekend."
        ], 
        "date": "2012-07-27T11:34:37+00:00"
    }
]