{
  "date": "2008-11-15T11:58:01+00:00",
  "directions": [
    "Accompaniment: creme fraiche or whipped cream",
    "Preheat oven to 400°F. and line a large baking sheet with parchment paper.",
    "With a vegetable peeler remove the zest from lemons and chop fine, reserving lemons for another use.",
    "In a food processor pulse flour, 1/2 cup sugar, baking powder, salt, butter and zest until mixture resembles coarse meal and transfer to a large bowl.",
    "In a small bowl toss together fresh cranberries and 3 tablespoons sugar and stir into flour mixture. If using dried fruit, add to flour mixture.",
    "In another small bowl lightly beat egg and yolk and stir in cream. Add egg mixture to flour mixture and stir until just combined.",
    "On a well-floured surface with floured hands pat dough into a 1-inch-thick round (about 8 inches in diameter) and with a 2-inch round cutter or rim of a glass dipped in flour cut out as many rounds as possible, rerolling scraps as necessary. Arrange rounds about 1 inch apart on baking sheet and bake in middle of oven 15 to 20 minutes, or until pale golden.",
    "[I decided to rebel and pat them into a square and cut them into smaller ones. The square shapes didn’t keep very well, so I don’t recommend this! Learn from me, people.]",
    "Serve scones warm with creme fraiche or whipped cream. Scones keep, individually wrapped in plastic wrap and foil, chilled, 1 day or frozen 1 week."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/meyer-lemon-and-fresh-cranberry-scones1.jpg?w=500",
  "ingredient_list": [
    "1 1/2 tablespoons freshly grated lemon zest (from about 2 lemons; preferably Meyer)",
    "2 1/2 cups all-purpose flour",
    "1/2 cup sugar plus 3 tablespoons additional if using fresh cranberries",
    "1 tablespoon baking powder",
    "1/2 teaspoon salt",
    "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits",
    "1 1/4 cups fresh cranberries, chopped coarse, or 1 1/4 cups dried cranberries, if you insist",
    "1 large egg",
    "1 large egg yolk",
    "1 cup heavy cream"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Citrus",
    "Cranberries",
    "Fall",
    "Fruit",
    "Lemon",
    "Photo",
    "Scones/Biscuits",
    "Winter"
  ],
  "title": "meyer lemon and fresh cranberry scones",
  "url": "https://smittenkitchen.com/2008/11/meyer-lemon-and-fresh-cranberry-scones/"
}