{
  "date": "2011-03-23T17:07:31+00:00",
  "directions": [
    "Preheat your oven to 400°F (200°C). Butter a baking tray, or, if you’re me and your baking sheets are in horrendous condition, line them with un-buttered parchment paper.",
    "Whisk the flours, oats, baking powder, sugar and salt together in a large bowl. With a pastry blender or your fingertips, work the butter into the dry ingredients until the mixture resembles fine breadcrumbs. In a small dish, combine the milk and syrup, then add these liquid ingredients to the butter-flour mixture. By hand or with a rubber spatula, bring everything together to form a softish dough. If it feels too dry, add a little more milk but not enough that the dough is sticky. “The dough should not be stick at all,” the book admonishes.",
    "On a lightly floured surface, pat or roll the dough out until it is 1 1/4 inches (3 cm)  tall. Using a 2-inch (5-cm) cutter, cut the dough into rounds and place them on the prepared tray so that they almost touch. Glaze the tops with beaten egg and bake for 20 to 25 minutes until the scones are lightly golden. The scones will stick together, so pull them gently apart when they’ve cooled a bit — pull-apart scones!",
    "Serve warm. Also, you may find them stale the next day but your toddler may not care, so keep them around!"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/oat-and-maple-syrup-scones1.jpg?w=500",
  "ingredient_list": [
    "1 3/4 cups (260 grams) all-purpose flour, plus extra for dusting surface",
    "1/2 cup (80 grams) whole wheat flour",
    "1/2 cup (35 grams) rolled oats (I used quick-cooking)",
    "1 very heaped tablespoon baking powder (I only slightly heaped; wish I’d heaped more!)",
    "1 very heaped tablespoon superfine (caster) or granulated sugar",
    "1/2 teaspoon table salt",
    "Scant 3/4 cup (160 grams) unsalted butter, cut into pieces",
    "1/4 cup maple syrup",
    "1/4 cup milk or buttermilk",
    "1 egg, beaten (for glaze)"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Photo",
    "Scones/Biscuits"
  ],
  "title": "oat and maple syrup scones",
  "url": "https://smittenkitchen.com/2011/03/oat-and-maple-syrup-scones/"
}