{
  "date": "2010-08-26T12:50:53+00:00",
  "directions": [
    "Heat oven to 375°F. Line a muffin tin with 9 paper liners or spray each cup with a nonstick spray. Melt butter in the bottom of a large bowl and whisk in sugar,  zest, yogurt and egg until smooth. Whisk in baking powder, baking soda and salt until fully combined, then lightly fold in flour and berries. Batter will be very thick, like a cookie dough. Divide between prepared muffin cups and sprinkle each with 1 teaspoon turbinado sugar, which will seem over-the-top but I promise, will be the perfect crunchy lid at the end. Bake for 25 to 30 minutes, until tops are golden and a tester inserted into the center of muffins comes out clean (you know, except for blueberry goo). Let cool in pan for 10 minutes then the rest of the way on a rack.",
    "These, like most muffins, are best on the first day, we’ve found through extensive “research” that if you run them split open under a broiler on day two with a pat of salted butter, it’s so good that you’re going to forever hope for more blueberry muffin leftovers.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/08/perfect-blueberry-muffins.jpg?w=750",
  "ingredient_list": [
    "5 tablespoons (70 grams) unsalted butter, cold is fine",
    "1/2 cup  (3 1/2 ounces or 100 grams) sugar",
    "Finely grated zest from 1/2 a lemon (previously: 1/2 teaspoon zest)",
    "3/4 cup plain unsweetened yogurt or sour cream",
    "1 large egg",
    "1 1/2 teaspoons (7 grams) baking powder",
    "1/4 teaspoon baking soda",
    "1/4 teaspoon fine sea or table salt",
    "1 1/2 cups (195 grams) all-purpose flour",
    "1 1/4 to 1 1/2 cups (215 to 255 grams) blueberries, fresh or frozen (no need to defrost) (previously: 3/4 cup, see note up top)",
    "3 tablespoons turbinado (sugar in the raw) sugar"
  ],
  "tags": [
    "Blueberries",
    "Breakfast",
    "Brunch",
    "Muffin/Quick Bread",
    "Photo"
  ],
  "title": "perfect blueberry muffins",
  "url": "https://smittenkitchen.com/2010/08/perfect-blueberry-muffins/"
}