{
  "date": "2012-10-26T13:02:15+00:00",
  "directions": [
    "Heat oven to 375°F. Peel and core pears. Cut into 1-inch chunks. Line a large baking sheet with parchment paper. Arrange pear chunks on parchment and roast until they feel dry to the touch and look a little browned underneath, about 20 minutes. Slide parchment paper with pear chunks onto a cooling rack (or onto a plate in the fridge or freezer to speed this up) and cool to lukewarm. Leave oven on. Line baking sheet with another piece of parchment.",
    "Whisk flour, baking powder, 1/4 cup sugar and salt together in the bowl of an electric mixer. Toss in cooled pear chunks, bits of butter, heavy cream and 1 egg. With the paddle attachment, mix the dough on low speed until it just comes together. Don’t overmix. Add the chocolate chunks and mix for 5 seconds more. ",
    "On a very well floured counter, pat out dough into a 6-inch round. Cut into 6 generous wedges and transfer to baking sheet at least two inches apart (do as I say, not as I did here!). Whisk remaining egg in a small dish with 1 teaspoon of water and a pinch of salt. Brush each scone with egg wash and sprinkle with remaining tablespoon of sugar. ",
    "Bake scones until firm and golden, about 30 minutes. Transfer to a cooling rack. Serve, and pat yourself on the back for your excellent host skills. ",
    "Do ahead: You can get this recipe all the way to the point where you’d bake them, and instead cover the pan with foil or plastic wrap and freeze them overnight. Bake them directly from the freezer in the morning; they should only take a few minutes longer. For longer than overnight, transfer frozen, already shaped, scones to a freezer bag until needed. In both cases, brush the egg wash/sprinkle the sugar on while still frozen, before baking the scones."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/10/pear-and-chocolate-chunk-scones.jpg?w=750",
  "ingredient_list": [
    "3 firmish pears (about 1 pound or 455 grams)",
    "1 1/2 cups (190 grams) all-purpose flour",
    "1/4 cup (50 grams) granulated sugar plus 1 1/2 tablespoons granulated or coarse for sprinkling",
    "1 1/2 teaspoons (8 grams) baking powder",
    "1/2 teaspoon (3 grams) table salt plus additional for egg wash",
    "6 tablespoons (85 grams) cold unsalted butter, cut into small cubes",
    "1/4 cup (60 ml) heavy cream",
    "1/4 cup (3 ounces or 85 grams) semisweet or bittersweet chocolate, chopped (or chips)",
    "2 large eggs, 1 for dough, 1 for glaze"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Chocolate",
    "Fall",
    "Pear",
    "Photo",
    "Scones/Biscuits"
  ],
  "title": "roasted pear and chocolate chunk scones",
  "url": "https://smittenkitchen.com/2012/10/roasted-pear-and-chocolate-chunk-scones/"
}