{
  "date": "2013-11-07T11:55:29+00:00",
  "directions": [
    "How should I use this? You can use this as stock or broth in any soup. You can use it to cook grains or beans. But most importantly, the flavor is so wonderful that you can have it straight. It particularly excels in broth-y soups, like Chicken Noodle, Matzo Ball and Italian Wedding-style soups, where you directly taste the stock. Here, I show you how I simmered in some vegetables (and later, chicken chunks) to make a chicken noodle soup. Next, I’d love to talk about soup noodles, but at 1,500-plus words here, I think I’ve done run out of space, eh?",
    "How should I store this? If I’m not using it immediately, I divide it into 1 quart freezer bags and freeze them flat. This is a great old trick from Real Simple magazine, as the flat bags can easily be dipped in hot water for quick defrosting. 1 quart of stock in gallon bags will freeze even thinner and flatter. They also stack well in the freezer. I won’t lie; I felt like a SuperDuperDomesticDiva when I can heat up one of these with some simple vegetables and noodles when one of us is getting sick. Then I remember I don’t want to set the table and hate doing dishes and go back to being myself. Anyway, it can also be frozen in ice cube trays for tiny amounts (great to add flavor to cooked grains or beans) and CI recommends nonstick standard muffin pans for 1/2-cup servings.",
    "Why chicken wings? In Cook’s Illustrated’s chicken broth tests, they found that both chicken legs along and necks and backs lent a “livery” taste to the broth. In my own experiments, saving the backs of chickens that I take apart in the freezer to later make broth with, I reluctantly agree (i.e. I wish it were some other way). Chicken wings, with their high bone-to-flesh ratio, made most refined and full-flavored broth and it took me a single sip of this stock to be fully converted.",
    "Do I have to toss the cooked wings when I’m done? Yes and no. I find them overcooked, but not really inedible, so it’s a matter of preference. One thing I love about this recipe is that wings have so little usable flesh, it feels less wasteful than making chicken with larger parts can be (especially because they usually get overcooked and tough, thus, at least I do want to eat them).",
    "* What’s the difference between stock and broth? In most grocery store aisles, they’re used interchangeably but technically, there are small small differences. Stock is often heavier in bones and things that will add body, as this recipe is, though it doesn’t have to be. However, it is unseasoned, which means to make this a true stock, you would skip the salt. Stock is often used in restaurants to make reductions (it is really the backbone of restaurant cooking), and if you reduce something already salty, obviously, you will have an oversalted mess. So, salt is added when needed for final dishes.",
    "Why did this take you two years to tell us about it, Deb?! I was reluctant at first to share this recipe (despite being unable to stop myself from gushing about it to anyone who asked and a great many people who did not) because it felt excessively lush to me. I mean, three pounds of wings just to throw them away? Given, it’s quite easy to buy wings inexpensively in bulk (sometimes as disturbingly cheap as $1/pound), but if you prefers to buy local/cage-free/etc.-type chicken, it’s not exactly the cheapest way to approach what’s supposed to be the most economical kitchen ingredient, designed to use up scraps. But, when I actually ran the numbers, using wings on the priciest end of the spectrum (here, organic/antibiotic-free $3.99/pound and each pound of parts yields 1 quart of stock) the equivalent stuff from the box (the organic, free-range broth I’d buy is $4.50/quart, boasted such lovely ingredients as “yeast extract” and “chicken flavor), I realized that even if the taste didn’t speak for itself (it will), I’d been wrong about the cost. ",
    "When are you going to make a life-changing vegetable broth, for the rest of us? Soon. But it’s far more complicated because I don’t think that there is one magical combination of vegetables that will yield the ideal vegetable stock, it’s more about what flavors you enjoy lingering in the background your soups. Boy, I’m glad we had this talk because the kind of vegetable stock I’d like to make just totally hit me. ",
    "[New additions to the list, based on comments below]",
    "Why is my stock so thick? I’m sorry I didn’t mention this sooner, but if you’ve never made stock before, it might have been a surprise to find that it became like Jell-o in the fridge over night. This is a good thing; this is excellent! It actually became exactly like Jell-o because stocks cooked for a long time with bones release the natural collagen in them. Stocks that jiggle when cool are the ones with the best and deepest flavors. Once warmed (even a little), it will immediately re-liquefy — do not fret. ",
    "I had expected more flavor. If this stock ended up not having the flavor you were hoping for, there are a couple directions you could go in:",
    "* Edited again to add: However, upon further consideration, my first choice would be #2, to cook it longer. With this many bones and that little water, I’m more and more convinced that any lack of flavor just means that it’s possible your slow-cooker is more gentle on heat than others (I do know that mine is on the robust/running-hot side), and that it would benefit from more cooking time. The flavor is there, in the bones, it’s just a matter of whether the stock has been cooked enough to access it. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/perfect-uncluttered-chicken-stock1.jpg?w=640",
  "ingredient_list": [
    "3 pounds uncooked chicken wings",
    "3 quarts water",
    "1 large onion, chopped",
    "1 garlic clove, smashed",
    "1 teaspoon table salt, or more to taste*"
  ],
  "tags": [
    "Chicken",
    "Photo",
    "Slow Cooker",
    "Soup"
  ],
  "title": "perfect, uncluttered chicken stock",
  "url": "https://smittenkitchen.com/2013/11/perfect-uncluttered-chicken-stock/"
}