{
  "date": "2010-05-17T16:05:52+00:00",
  "directions": [
    "In a small sauté pan, cook the garlic, caraway, cumin, paprika, harissa and sugar in the oil until fragrant, about one to two minutes. Remove from heat and add the lemon juice and a pinch of salt. Pour over the carrots and mix. Add the herbs and mix. Leave to infuse for an hour and add the feta before eating. With a fork.",
    "Harissa: Is a North African chile paste that has become so popular, we were tickled to find it all over tables in Paris two years ago, right next to the Dijon mustard. There is almost nothing it doesn’t make more delicious: eggs, potatoes, stews, couscous, sandwiches and more, and there are almost as many recipes as there are people who consume it. Most boil down to hot chiles ground with garlic, cumin, coriander, caraway and olive oil, often with a smidge of sundried tomatoes. You can make your own (I’ve been eying this recipe for some time) or you can buy some (I brought home this brand, which we love). The adavantage of making your own, as always, is that you can adjust the recipe to suit your tastes and desired level of heat."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/carrot-salad-with-harissa-feta-mint.jpg?w=750",
  "ingredient_list": [
    "3/4 pound carrots, peeled, trimmed and coarsely grated",
    "4 tablespoons olive oil",
    "1 crushed clove of garlic",
    "1/2 teaspoon caraway seeds or about half as much, ground (I used seeds but ground them first)",
    "3/4 teaspoon cumin seeds or about half as much, ground (I used the seed but ground them first, again)",
    "1/2 teaspoon paprika",
    "3/4 teaspoon harissa (for a solid kick of heat; adjust yours to taste, and to the heat level of your harissa)",
    "1/2 teaspoon sugar",
    "3 tablespoons lemon juice",
    "2 tablespoons flat leaf parsley, finely chopped",
    "2 tablespoons fresh mint, finely chopped",
    "100 grams feta, crumbled or chopped into bits"
  ],
  "tags": [
    "Carrots",
    "North African",
    "Photo",
    "Salad",
    "Spring",
    "Vegetarian"
  ],
  "title": "carrot salad with harissa, feta and mint",
  "url": "https://smittenkitchen.com/2010/05/carrot-salad-with-harissa-feta-and-mint/"
}