[
    {
        "ingredient_list": [
            "2 medium tomatoes", 
            "1/2 pound yellow wax beans, ends trimmed and beans halved crosswise", 
            "1/2 pound haricot vert, or slim green beans, ends trimmed and beans halved crosswise", 
            "2 to 3 tablespoons olive oil", 
            "2 cloves garlic, minced", 
            "Pinch of red pepper flakes", 
            "Glug of white wine", 
            "Salt and pepper", 
            "Juice of one lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/bean-symphony1.jpg?w=500", 
        "tags": [
            "Elsewhere", 
            "Green Beans", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/08/bean-symphony/", 
        "title": "mixed bean salad", 
        "directions": [
            "Bring a medium-large pot of salted water to boil. Carefully lower the two tomatoes in with a slotted spoon and cook for one minute. Leave the water boiling while you drop them into a bath of ice water, peel them and then set them aside.", 
            "Meanwhile, lower the wax beans in the water for 2 to 3 minutes, until lightly cooked but still firm. Remove them from the boiling water with a large slotted spoon or tongs and plunge them in the ice bath to stop cooking them. Drain them in a colander and then spread them out on a kitchen towel to dry. ", 
            "Repeat this process with the haricot vert, but only cook them for one minute. ", 
            "If you, like me, are in a tiny kitchen and love nothing more than a one pot dish, dump the water out of the pot, dry it, and heat the olive oil to medium-high. If you love doing dishes, you can complete this step in a large saute pan. Yeah, I thought so. ", 
            "Once the oil is heated, add the minced garlic and stir it around with a wooden spoon until lightly cooked but not brown, one minute or so. Add a pinch of red pepper flakes, and then the two peeled tomatoes that you have set aside. Break them up into chunks with your spoon, and simmer this into sauciness for about 5 minutes. Add a glug of white wine, and simmer for one more minute. ", 
            "Dump the drained and dried beans into the tomato sauce, and mix it around until combined and heated through. Salt and pepper to taste. Put the salad in a serving bowl and squeeze the lemon juice all over it, tossing it lightly. ", 
            "Eat immediately."
        ], 
        "date": "2007-08-07T14:11:07+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick, 4 ounces or 113 grams) butter, melted", 
            "1 cup (218 grams or 7 3/4 ounces for light; 238 grams or 8 3/8 ounces for dark) brown sugar", 
            "1 large egg", 
            "1 teaspoon vanilla or 1/2 teaspoon almond extract", 
            "Pinch salt", 
            "1 cup (4 3/8 ounces or 125 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/blondies.jpg?w=749", 
        "tags": [
            "Bourbon", 
            "Brown Butter", 
            "Brownies/Blondies", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/blondies/", 
        "title": "blondies, infinitely adaptable", 
        "directions": [
            "Further additions, use one or a combination of: ", 
            "New favorite combination of late (added 5/24/14): We’ve gotten on a kick making these again, but I’ve really wanted to increase the toasty butterscotch flavor and have done so by: browning the butter, using dark brown sugar but only 3/4 cup (I prefer these less sweet these days), increasing the vanilla to 1 1/2 teaspoons and the salt to 1/4 teaspoon fleur de sel or flaky sea salt, plus a few flakes crumbled on top. I use 1 cup chopped bittersweet chocolate and 1/2 cup chopped walnuts or pecans as the mix-ins. Hope this provides some inspiration!"
        ], 
        "date": "2006-11-25T19:37:39+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/08/2804182114_6d9ebd8506_b.jpg?w=753", 
        "tags": [
            "Bourbon", 
            "Fruit", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/08/bourbon-peach-hand-pies/", 
        "title": "bourbon peach hand pies", 
        "directions": [
            "1. To make the pastry, in a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour. If preparing ahead of time, the dough can be stored at this point for up to one month in the freezer.", 
            "2. Divide the refrigerated dough in half. On a lightly floured work surface, roll out one half of the dough to 1/8-inch thickness. Using a 4 1/2-inch-round biscuit cutter, cut seven circles out of the rolled dough. Transfer the circles to a parchment-lined baking sheet, and place in the refrigerator to chill for about 30 minutes. Repeat the rolling, cutting, and chilling process with the remaining half of dough. (I used a 4-inch cutter–if you can call a “cutter” the tin edge of the container that holds my smaller round cutters–and managed to get 12 from each dough half, after rerolling the scraps.)", 
            "3. Make the filling: Peel and chop the peaches into small bits (approx. 1/2-inch dice), much smaller than you’d use for a regular-sized pie. Mix them with the flour, sugar and pinch of salt, and add the bourbon and vanilla, if you wish.", 
            "4. Remove the chilled dough from the refrigerator, and let stand at room temperature until just pliable, 2 to 3 minutes. Spoon about 1 to 2 tablespoons filling (use the smaller amount for a 4-inch circle) onto one half of each circle of dough. Quickly brush a little cold water around the circumference of the dough, and fold it in half so the other side comes down over the filling, creating a semicircle. Seal the hand pie, and make a decorative edge by pressing the edges of the dough together with the back of a fork. Repeat process with remaining dough. Place the hand pies back on the parchment-lined baking sheet, and return to the refrigerator to chill for another 30 minutes.", 
            "5. Heat oven to 375 degrees. Remove the chilled hand pies from the refrigerator, cut a small slit in each and lightly brush with the egg yolk wash. Sprinkle sanding sugar generously over the pies, and place pies in the oven to bake. Bake until the hand pies are golden brown and just slightly cracked, about 20 minutes. Remove the pies from the oven, and let stand to cool slightly before serving."
        ], 
        "date": "2008-08-28T16:12:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup water", 
            "2 tea bags (whatever you like for iced tea)", 
            "1 cup bourbon", 
            "1/4 cup granulated sugar", 
            "1 1/2 cups orange juice (about 3 well-squeezed oranges)", 
            "6 tablespoons lemon juice (about 2 lemons)", 
            "16 to 17 ounces (about 5 cups of small pieces of ice) ice cubes", 
            "Mint sprigs or lemon slices, for garnish "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/bourbon-slush-punch1.jpg?w=640", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Lemon", 
            "Orange", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/07/bourbon-slush-punch/", 
        "title": "bourbon slush punch", 
        "directions": [
            "Boil 1 cup water for tea. Add the tea bags and let steep until cool. Discard the tea bags and set aside. Pour tea into a pitcher. Add bourbon, sugar, orange juice and lemon juice and refrigerate until needed. Don’t worry about stirring the sugar so that it dissolves; after 30 minutes in the fridge, it will have. ", 
            "To serve: Shake or stir punch base to ensure ingredients are evenly distributed. To make two liters of punch, add base and full amount of ice cubes to your blender, blending until the ice is crushed and slushy. For each individual glass of punch, place 1/2 cup punch base and slightly heaped 1/2 cup small pieces of ice (mine were chipped off an ice block; don’t ask) and blend until slushy. Add an extra whole ice cube or two to glasses if desired. Garnish glass with a sprig of mint or slice of lemon."
        ], 
        "date": "2014-07-24T12:01:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup firmly packed brown sugar", 
            "2 tablespoons butter", 
            "1 tablespoon vanilla", 
            "2 teaspoons bourbon (optional)", 
            "1 1/2 cups whipping cream", 
            "2 cups half-and-half (light cream)", 
            "6 large egg yolks (hint: if you make a hazelnut brown butter cake, you should have these in your fridge already!)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/butterscotch-ice-cream1.jpg?w=500", 
        "tags": [
            "Bourbon", 
            "Ice Cream/Sorbet", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/03/butterscotch-ice-cream/", 
        "title": "butterscotch ice cream", 
        "directions": [
            "1. In a 1- to 2-quart pan over medium heat, stir brown sugar and butter until butter is melted, sugar is dissolved, and mixture is bubbly, 3 to 4 minutes. Whisk in 1/2 cup whipping cream until smooth; remove butterscotch mixture from heat. Add vanilla and bourbon, if using.", 
            "2. In a 3- to 4-quart pan over medium-high heat, combine remaining 1 cup whipping cream and the half-and-half; bring to a simmer.", 
            "3. Meanwhile, in a bowl, beat egg yolks to blend. Whisk 1/2 cup of the warm cream mixture into egg yolks, then pour egg yolk mixture into pan with cream. Stir constantly over low heat just until mixture is slightly thickened, 2 to 4 minutes. Immediately remove from heat.", 
            "4. Pour through a fine strainer into a clean bowl and whisk in butterscotch mixture. Chill until cold, stirring occasionally, about 2 hours; or cover and chill up to 1 day.", 
            "5. Freeze mixture in an ice cream maker according to manufacturer’s instructions. Serve softly frozen, or transfer ice cream to an airtight container and freeze until firm, at least 6 hours or up to 1 week.", 
            "Note: If you serve with espresso-chocolate shortbread cookies, your friends might never leave. Proceed with caution."
        ], 
        "date": "2008-03-14T18:56:02+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/bourbon-pumpkin-cheesecake.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Cake", 
            "Celebration Cakes", 
            "Photo", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2006/11/candy-corn-for-really-lucky-grown-ups/", 
        "title": "bourbon pumpkin cheesecake", 
        "directions": [
            "Garnish: pecan halves ", 
            "Make crust: Invert bottom of a 9-inch springform pan (to create flat bottom, which will make it easier to remove cake from pan), then lock on side and butter pan.", 
            "Stir together crumbs, pecans, sugars, and butter in a bowl until combined well. Press crumb mixture evenly onto bottom and 1/2 inch up side of pan, then chill crust, 1 hour.", 
            "Make filling and bake cheesecake: Put oven rack in middle position and Preheat oven to 350°F.", 
            "Whisk together pumpkin, eggs, brown sugar, cream, vanilla, and liqueur (if using) in a bowl until combined.", 
            "Stir together granulated sugar, cornstarch, cinnamon, nutmeg, ginger, and salt in large bowl. ", 
            "Add cream cheese and beat with an electric mixer at high speed until creamy and smooth, about 3 minutes. Reduce speed to medium, then add pumpkin mixture and beat until smooth.", 
            "Pour filling into crust, smoothing top, then put springform pan in a shallow baking pan (in case springform leaks). Bake until center is just set, 50 to 60 minutes. Transfer to rack and cool 5 minutes. (Leave oven on.)", 
            "Make topping: Whisk together sour cream, sugar, and liqueur (if using) in a bowl, then spread on top of cheesecake and bake 5 additional minutes.", 
            "Cool cheesecake completely in pan on rack, about 3 hours.", 
            "Chill, covered, until cold, at least 4 hours. Remove side of pan and bring to room temperature before serving.", 
            "Do ahead: Baked cheesecake can be chilled, covered, up to 2 days."
        ], 
        "date": "2006-11-22T14:12:19+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 pound carrots, peeled, trimmed and coarsely grated", 
            "4 tablespoons olive oil", 
            "1 crushed clove of garlic", 
            "1/2 teaspoon caraway seeds or about half as much, ground (I used seeds but ground them first)", 
            "3/4 teaspoon cumin seeds or about half as much, ground (I used the seed but ground them first, again)", 
            "1/2 teaspoon paprika", 
            "3/4 teaspoon harissa (for a solid kick of heat; adjust yours to taste, and to the heat level of your harissa)", 
            "1/2 teaspoon sugar", 
            "3 tablespoons lemon juice", 
            "2 tablespoons flat leaf parsley, finely chopped", 
            "2 tablespoons fresh mint, finely chopped", 
            "100 grams feta, crumbled or chopped into bits"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/carrot-salad-with-harissa-feta-mint.jpg?w=750", 
        "tags": [
            "Carrots", 
            "North African", 
            "Photo", 
            "Salad", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/05/carrot-salad-with-harissa-feta-and-mint/", 
        "title": "carrot salad with harissa, feta and mint", 
        "directions": [
            "In a small sauté pan, cook the garlic, caraway, cumin, paprika, harissa and sugar in the oil until fragrant, about one to two minutes. Remove from heat and add the lemon juice and a pinch of salt. Pour over the carrots and mix. Add the herbs and mix. Leave to infuse for an hour and add the feta before eating. With a fork.", 
            "Harissa: Is a North African chile paste that has become so popular, we were tickled to find it all over tables in Paris two years ago, right next to the Dijon mustard. There is almost nothing it doesn’t make more delicious: eggs, potatoes, stews, couscous, sandwiches and more, and there are almost as many recipes as there are people who consume it. Most boil down to hot chiles ground with garlic, cumin, coriander, caraway and olive oil, often with a smidge of sundried tomatoes. You can make your own (I’ve been eying this recipe for some time) or you can buy some (I brought home this brand, which we love). The adavantage of making your own, as always, is that you can adjust the recipe to suit your tastes and desired level of heat."
        ], 
        "date": "2010-05-17T16:05:52+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust:", 
            "7 tablespoons unsalted butter, melted", 
            "1/3 cup sugar", 
            "1/4 teaspoon vanilla extract", 
            "1 cup plus 1 tablespoon all purpose flour", 
            "Pinch of salt", 
            "Filling:", 
            "1/2 cup sugar", 
            "2 large eggs", 
            "Pinch of salt", 
            "1/4 cup all purpose flour", 
            "1 teaspoon vanilla extract", 
            "1/2 cup (1 stick) unsalted butter, diced", 
            "1 pound sweet cherries, which will yield 12 ounces of pitted cherries, which yielded some leftovers, perfect for snacking (alternately, you can use 12 ounces of the berry of your choice)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/3664441408_6dbba66669_b.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cherries", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/06/cherry-brown-butter-bars/", 
        "title": "cherry brown butter bars", 
        "directions": [
            "Make crust: Preheat over to 375°F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (It should look like this.) Congratulations! You’ve just faked a square tart pan.", 
            "Using rubber spatula or fork, mix melted butter, sugar, and vanilla in medium bowl, or if you’re Deb, in the bottom of the small saucepan you used to melt the butter. Add flour and salt and stir until incorporated. Transfer dough to your prepared pan, and use your fingertips to press the dough evenly across the bottom of the pan. Bake the crust until golden, about 18 minutes (it will puff slightly while baking). Transfer crust to rack and cool in pan. Maintain oven temperature.", 
            "Make the filling: Cook butter in heavy small saucepan (a lighter-colored one will make it easier to see the color changing, which happens quickly) over medium heat until deep nutty brown (do not burn), stirring often and watching carefully, about six minutes. Immediately pour browned butter into glass measuring cup to cool slightly.", 
            "Whisk sugar, eggs, and salt in medium bowl to blend. Add flour and vanilla and whisk until smooth. Gradually whisk browned butter into sugar-egg mixture; whisk until well blended.", 
            "Arrange pitted cherries, or the berries of your choice, in bottom of cooled crust. Carefully pour browned butter mixture evenly over the fruit. Bake bars until filling is puffed and golden and tester inserted into center comes out clean, about 40 minutes (though, of course, this took less time in my hyperactive oven so please watch your baking times carefully). Cool bars completely in pan on rack.", 
            "Use the parchment paper overhang to carefully remove cooled bars from pan and place them on a cutting board and cut them into squares with a very sharp knife. The cherries, if they fall over your slicing lines, will want to give you trouble but if you saw a sharp knife into them slowly before pressing down, they’ll cut neatly and with minimum carnage.", 
            "Do ahead: Can be made at least a day ahead, and stored at room temperature. Any longer, keep them cool in the fridge."
        ], 
        "date": "2009-06-29T13:07:57+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/elsewhere-dumplings-and-cake1.jpg?w=500", 
        "tags": [
            "Elsewhere", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/elsewhere-dumplings-and-cake/", 
        "title": "elsewhere: dumplings and cake", 
        "directions": [], 
        "date": "2007-11-07T18:35:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (60 ml) neutral vegetable oil, such as soybean, canola or vegetable blend", 
            "6 eggs, separated", 
            "6 tablespoons (90 ml) freshly brewed espresso, cooled to room temperature (Huntsman recommends freshly-brewed over hydrating espresso powder, which she feels can be too bitter)", 
            "2 teaspoons (10 ml) vanilla extract", 
            "1 1/3 cups (170 grams) cake flour", 
            "1 1/2 cups (300 grams) sugar", 
            "1 teaspoon baking powder", 
            "1/2 teaspoon ground cinnamon", 
            "1/2 teaspoon salt", 
            "1/2 teaspoon cream of tartar", 
            "1/3 cup hot, freshly brewed espresso", 
            "1/3 cup sugar", 
            "1/3 cup dark rum, such as Meyer’s", 
            "6 ounces unsweetened chocolate, melted and cooled", 
            "4 1/2 cups confectioners’ sugar (no need to sift)", 
            "3 sticks (12 ounces) unsalted butter, at room temperature", 
            "6 tablespoons half-and-half or whole milk", 
            "1 tablespoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/espresso-chiffon-cake-with-fudge-frosting1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Chocolate", 
            "Elsewhere", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/08/espresso-chiffon-cake-with-fudge-frosting/", 
        "title": "espresso chiffon cake with fudge frosting", 
        "directions": [
            "Place all of the ingredients in a food processor and pulse to incorporate, then process until the frosting is smooth.", 
            "Frosting tip: If your kitchen is as hot and sticky as mine is in the summer, you’ll want to watch a frosting like this carefully to make sure it doesn’t get too melty and soft. If it does, periodically put the bowl of frosting and your partially frosting cake back in the fridge to let it firm up and cool down again, then resume where you left off.", 
            "Planning to write on your cake? Whirl all of the frosting ingredients except the melted chocolate in the food processor until smooth. Set aside a half-cup of the white frosting for tinting and writing, then add the chocolate to finish making the frosting.", 
            "Cappuccino Chiffon Cake, a variation: Now, if you were with me on the espresso cake but lost interest when I got to the fudge frosting, good news! The original cake I recipe I borrowed from was actually a Cappucino Chiffon Cake — filled and frosted with whipped cream (3 cups heavy cream to 1 cup 1/3 cup sugar and 2 teaspoons vanilla, whipped until stiff peaks form) and dusted with cocoa and/or cinnamon, just like a frothy cappucino. Frankly, it sounds amazing as the light, almost foamy qualities of the chiffon cake would be matched by the almost weightless frosting and I imagine a bite on your fork would be like diving into a cappucino cloud and hey, do you think someone around here misses coffee or something?"
        ], 
        "date": "2009-08-12T16:55:23+00:00"
    }, 
    {
        "ingredient_list": [
            "Winter Warmth Syrup", 
            "1 1/2 cups water", 
            "1 cup raw, demerara or turbinado sugar (granulated will do just fine if you do not have them)", 
            "1/2 apple, peeled, cored, and diced", 
            "1/2 pear, peeled, cored, and diced", 
            "12 walnut halves", 
            "3 cinnamon sticks, broken up", 
            "6 whole cloves", 
            "1 whole nutmeg", 
            "For Each Cocktail", 
            "1 piece of orange peel (about 1 by 2 inches)", 
            "3/4 ounce Winter Warmth Syrup (recipe above)", 
            "2 dashes of bitters (Fee Brothers black walnut bitters are recommended, I used orange bitters)", 
            "2 ounces bourbon, rye or Canadian whisky"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/the-fairytale-of-new-york1.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Christmas", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/fairytale-of-new-york/", 
        "title": "fairytale of new york", 
        "directions": [
            "Make the winter warmth syrup: Combine all ingredients in a saucepan over medium heat. Bring to a simmer, stirring until the sugar dissolves, and simmer for 15 to 20 minutes. Remove from the heat and cool. Strain into a clean glass bottle, cover and refrigerate for up to 2 weeks. Makes about 2 cups.", 
            "Make a drink: Place the orange peel, syrup and bitters in a low glass and muddle. Pour in whiskey, add a large ice cube and don’t forget to share. ", 
            "Make a carafe: We brought 2 4-cup carafes of this to a party, using all of the syrup and about 5 1/2 cups bourbon. We tossed a few orange peels into each jar. Don’t forget to remind friends to pour it over ice (we forgot), so they are not asleep before, you know, Santa comes down the chimney."
        ], 
        "date": "2014-12-23T11:56:26+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups chocolate cookie crumbs or about 260 grams chocolate cookies", 
            "1 1/2 cups pecans, toasted and cooled", 
            "1/2 cup bourbon", 
            "1 cup powdered sugar", 
            "3 tablespoons unsweetened cocoa powder", 
            "1 1/2 tablespoons honey or molasses", 
            "Sprinkles, sanding or coarse sugar, additional chopped nuts, extra cookie crumbs or coconut to roll balls in"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/fudgy-bourbon-balls1.jpg?w=640", 
        "tags": [
            "Bourbon", 
            "Candy", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/12/fudgy-bourbon-balls/", 
        "title": "fudgy bourbon balls", 
        "directions": [
            "In the bowl of a food processor, pulse together the cookies, whole or already in crumbs, and pecans until the nuts are finely ground. In small dish, whisk together the bourbon, powdered sugar, cocoa and honey until smooth. Add to the food processor bowl and pulse until just combined. ", 
            "Set aside at room temperature, uncovered, for 30 minutes to 1 hour, or up to 4 hours, to give the crumbs a chance to absorb the liquid and become more fudgy and easier to roll.", 
            "Scoop dough into about 1-inch or 1 tablespoon-sized balls and roll them in toppings of your choice. The balls can be stored at room temperature or in the fridge. If at room temperature, you can leave them covered for more moisture or uncovered if you like them with more of a crust. Balls will keep for as long as you can hide them from people. ", 
            "Notes: I’m going to do a little Q&A with the comment section that lives in my head. :) "
        ], 
        "date": "2015-12-31T11:25:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large red bell pepper", 
            "4 ounces dried chiles (see suggestions above)", 
            "3 sun-dried tomatoes, dry-packed", 
            "2 clove garlic, peeled", 
            "1 teaspoon coarse or kosher salt", 
            "3/4 teaspoon ground coriander (1 1/2 teaspoons seeds, toasted and ground)", 
            "1/2 teaspoon ground caraway (or 1 teaspoon seeds, toasted and ground)", 
            "1/2 teaspoon ground cumin (or 1 teaspoon seeds, toasted and ground)", 
            "1 tablespoon olive oil, plus extra for storage"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/homemade-harissa1.jpg?w=640", 
        "tags": [
            "North African", 
            "Peppers", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/10/homemade-harissa/", 
        "title": "homemade harissa", 
        "directions": [
            "Roast your red pepper: You can do so in a 350°F oven, turning it every 15 minutes for a total of 45 to 60, until it’s deeply roasted on all sides. Some people prefer to do this over a gas flame, but be sure you cook it long enough that’s it truly soft inside, so it will blend well. Set aside to cool — you can do this in a bowl with foil or plastic over it, but I find it’s just as easy to peel a well-roasted pepper even if it’s cooled right on the tray, without the added steam. Once cool enough to handle, peel and seed the pepper.", 
            "Meanwhile, place dried chiles and sundried tomato in a bowl and cover with boiling water. Let sit for 30 minutes, until well-softened. Drain and with gloved hands, if you don’t like living on the edge, remove the seeds and stems from the chiles. The sundried tomatoes can be used as-is.", 
            "Place roasted red pepper, rehydrated chiles, tomatoes, garlic, salt and spices in a blender or food processor with 1 tablespoon olive oil and blend until it becomes a thick paste; a little water may be necessary to help this along. Store in the fridge, topped with a thin layer of olive oil. Use on everything."
        ], 
        "date": "2014-10-20T12:27:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (110 grams) plain yogurt", 
            "A small handful finely chopped leafy fresh herbs (parsley, cilantro, mint, chives, dill or a mix thereof) plus a few roughly chopped, to serve", 
            "1 teaspoon red wine vinegar, or more to taste", 
            "Kosher salt", 
            "Olive oil", 
            "A handful shredded red cabbage to serve (optional)", 
            "Lemon wedges, to serve", 
            "Kosher salt", 
            "1/2 teaspoon cumin seeds or a heaped 1/2 teaspoon ground", 
            "1/2 teaspoon coriander seeds or a heaped 1/2 teaspoon ground", 
            "1/2 teaspoon fennel seeds or a heaped 1/2 teaspoon ground", 
            "1 teaspoon sweet paprika", 
            "2 garlic cloves, minced", 
            "2 tablespoons harissa paste (I just used a small squeeze) or another hot sauce", 
            "1 pound (455 grams) ground lamb, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/homemade-merguez-with-herby-yogurt1.jpg?w=750", 
        "tags": [
            "Lamb", 
            "Middle Eastern", 
            "North African", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/09/homemade-merguez-with-herby-yogurt/", 
        "title": "homemade merguez with herby yogurt", 
        "directions": [
            "\nMake the herby yogurt: Mix the yogurt, finely chopped herbs and vinegar in a small bowl. Season to taste with salt and extra vinegar, if desired. Set aside until needed.\nMake the merguez: If using whole spices, toast them in a dry skillet over medium heat for a few minutes until fragrant. Grind them in a spice grinder or with a mortar and pestle.", 
            "Combine lamb, spices, including paprika, harissa, garlic and 1 teaspoon (Turshen called for 1 1/2, which was very salty and we liked it but probably not for everyone) kosher salt and mix to combine. Form into 12 mounds.\n[Do ahead: You can keep the mixed meat patties and herbed yogurt in the fridge for up to 3 days.]\nHeat a large, heavy skillet over high heat. Coat with olive oil and once it is very hot, add a few sausage mounds. Once they hit the frying pan, flatten them with the back of your spatula. Cook until brown and crispy underneath, then flip and cook for another minute or two. Drain on paper towels. Repeat with remaining meat.\nServe patties warm with herby yogurt and scattered with extra herbs and shredded cabbage, if desired, plus wedges of lemon to squeeze over.\n"
        ], 
        "date": "2016-09-13T12:14:13+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 ripe bananas, smashed", 
            "1/3 cup (75 grams) melted salted butter", 
            "3/4 to 1 cup (145 to 190 grams) light brown sugar (depending on the level of sweetness you prefer, I always use the smaller amount)", 
            "1 egg, beaten", 
            "1 teaspoon (5 ml) vanilla", 
            "1 tablespoon (15 ml) bourbon (optional)", 
            "1 teaspoon (5 grams) baking soda", 
            "Pinch of salt", 
            "1 teaspoon (3 grams) cinnamon", 
            "Up to 1/2 teaspoon (1) nutmeg", 
            "Pinch of ground cloves", 
            "1 1/2 cups (190 grams) flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/jacked-up-banana-bread.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Bourbon", 
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/jacked-up-banana-bread/", 
        "title": "jacked-up banana bread", 
        "directions": [
            "Preheat the oven to 350°F. With a wooden spoon, mix butter into the mashed bananas in a large mixing bowl. Mix in the sugar, egg, vanilla and bourbon, then the spices. Sprinkle the baking soda and salt over the mixture and mix in. Add the flour last, mix. Pour mixture into a buttered 4×8 inch loaf pan. Bake for 50 minutes to one hour, or until a tester comes out clean. Cool on a rack. Remove from pan and slice to serve.", 
            "Note: Due to my unhealthy obsession with tiny things, I split this into two mini-loaf pans. It took 45 minutes to bake two perfect halves, but of course, may run longer or shorter in your oven."
        ], 
        "date": "2006-11-16T18:00:50+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mighty-russian-morsels1.jpg?w=500", 
        "tags": [
            "Elsewhere", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/03/mighty-russian-morsels/", 
        "title": "mighty russian morsels", 
        "directions": [], 
        "date": "2007-03-13T22:16:11+00:00"
    }, 
    {
        "ingredient_list": [
            "5 cups of a mixture of whole milk and half-and-half (4:1 is suggested, but I might go more like 3:2 next time)", 
            "1 1/2 cups bourbon, another whiskey or brandy", 
            "1 cup powdered sugar, sifted", 
            "1 tablespoon vanilla extract", 
            "Freshly grated nutmeg, for garnish."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/12/milk-punch.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2010/12/milk-punch/", 
        "title": "milk punch", 
        "directions": [
            "In a pitcher, whisk together milk, half-and-half, bourbon, sugar and vanilla. Freeze until slushy, which will take 3 to 4 hours, but you can leave it in there up to a day. Stir before serving it in chilled glasses, finished with a few gratings of fresh nutmeg."
        ], 
        "date": "2010-12-31T17:52:35+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (3 1/2- to 4-pound) spaghetti squash", 
            "1/2 stick (4 tablespoons) unsalted butter, cut into pieces", 
            "2 garlic cloves, minced", 
            "1 teaspoon ground cumin", 
            "1/2 teaspoon ground coriander", 
            "1/8 teaspoon cayenne", 
            "3/4 teaspoon salt", 
            "2 tablespoons chopped fresh cilantro or flat-leaf parsley, if you’re cilantro-averse"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/moroccan-spiced-spaghetti-squash1.jpg?w=500", 
        "tags": [
            "Fall", 
            "North African", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2009/11/moroccan-spiced-spaghetti-squash/", 
        "title": "moroccan-spiced spaghetti squash", 
        "directions": [
            "To cook the squash in a microwave: Pierce squash (about an inch deep) all over with a small sharp knife to prevent bursting. Cook in an 800-watt microwave oven on high power (100 percent) for 6 to 7 minutes. Turn squash over and microwave until squash feels slightly soft when pressed, 8 to 10 minutes more. Cool squash for 5 minutes.", 
            "To roast the squash, two methods: If you’d like to roast the squash whole, pierce it all over with a small sharp knife to prevent bursting and bake it in a 375°F oven for one hour. If you are good with a big, sharp kinfe, you can save some time by cutting the squash in half lengthwise, scooping out the seeds and roasting the halves face-down in an oiled baking pan for about 40 minutes in a 375°F oven.", 
            "Meanwhile, melt the butter in a small saucepan over medium heat. Add the garlic and cook, stirring, until it is barely golden. Stir in spices and salt and remove from heat.", 
            "If you have microwaved or roasted your squash whole, carefully halve it lengthwise (it will give off a lot of steam) and remove the seeds.", 
            "Carefully halve squash lengthwise (it will give off steam) and remove and discard seeds. Working over a bowl, scrape squash flesh with a fork, loosening and separating strands as you remove it from skin. Toss with the  spiced butter and cilantro. "
        ], 
        "date": "2009-11-05T22:36:19+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive oil", 
            "2 tablespoons butter, softened", 
            "2 pounds portobello mushrooms, in 1/4-inch slices (save the stems for another use) (you can use cremini instead, as well)", 
            "1/2 carrot, finely diced", 
            "1 small yellow onion, finely diced", 
            "2 cloves garlic, minced", 
            "1 cup full-bodied red wine", 
            "2 cups beef or vegetable broth (beef broth is traditional but vegetable to make it vegetarian; it works with either)", 
            "2 tablespoons tomato paste", 
            "1 teaspoon fresh thyme leaves (1/2 teaspoon dried)", 
            "1 1/2 tablespoons all-purpose flour", 
            "1 cup pearl onions, peeled (thawed if frozen)", 
            "Egg noodles, for serving", 
            "Sour cream and chopped chives or parsley, for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/mushroom-bourguignon-e1477582482731.jpg?w=625", 
        "tags": [
            "Date Night", 
            "Elsewhere", 
            "Freezer Friendly", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2009/01/mushroom-bourguignon/", 
        "title": "mushroom bourguignon", 
        "directions": [
            "Heat the one tablespoon of the olive oil and one tablespoon of butter in a medium Dutch oven or heavy sauce pan over high heat. Sear the mushrooms until they begin to darken, but not yet release any liquid — about three or four minutes. Remove them from pan.", 
            "Lower the flame to medium and add the second tablespoon of olive oil. Toss the carrots, onions, thyme, a few good pinches of salt and a several grinds of black pepper into the pan and cook for 10, stirring occasionally, until the onions are lightly browned. Add the garlic and cook for just one more minute. ", 
            "Add the wine to the pot, scraping any stuck bits off the bottom, then turn the heat all the way up and reduce it by half. Stir in the tomato paste and the broth. Add back the mushrooms with any juices that have collected and once the liquid has boiled, reduce the temperature so it simmers for 20 minutes, or until mushrooms are very tender. Add the pearl onions and simmer for five minutes more.", 
            "Combine remaining butter and the flour with a fork until combined; stir it into the stew. Lower the heat and simmer for 10  more minutes. If the sauce is too thin, boil it down to reduce to the right consistency. Season to taste.", 
            "To serve, spoon the stew over a bowl of egg noodles, dollop with sour cream (optional) and sprinkle with chives or parsley."
        ], 
        "date": "2009-01-15T15:48:36+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups fresh raspberries", 
            "2 tablespoons red currant jelly melted with 1 tablespoon water", 
            "Red currant bunches (optional) "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/never-too-much1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Chocolate", 
            "Elsewhere", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/08/never-too-much/", 
        "title": "double chocolate torte", 
        "directions": [
            "For cake: Preheat oven to 325°F. Butter 10-inch-diameter springform pan; dust with sugar. Melt chocolate and butter in heavy large saucepan over low heat, stirring constantly. Cool to lukewarm. Whisk in sugar. Whisk in eggs 1 at a time, blending well after each addition. Mix in vanilla and salt, then flour. Pour batter into pan. Bake until cake just rises in center (tester inserted into center will not come out clean), about 35 minutes. Cool completely in pan on rack. Cover; chill while making mousse.", 
            "For mousse: Melt butter in medium metal bowl set over saucepan of simmering water (do not allow bottom of bowl to touch water). Whisk yolks, 1/4 cup cream and vanilla in small bowl to blend. Gradually whisk yolk mixture into bowl with melted butter. Whisk constantly over simmering water until thermometer registers 150°F, about 6 minutes (mixture may appear broken). Remove from over water; add chocolate and stir to melt. Set aside. ", 
            "Beat egg whites and 1/2 cup sugar in large bowl to medium-stiff peaks. Whisk 1/4 of beaten egg white mixture into warm chocolate mixture to lighten. Fold in remaining egg white mixture. Pour mousse over cake in pan; smooth top. Chill torte until mousse is set, at least 6 hours and up to 1 day. ", 
            "Run sharp knife around edge of pan to loosen torte. Release pan sides. Transfer torte to platter. Using electric mixer, beat 3/4 cup cream in medium bowl until peaks form. Spread whipped cream over torte. Top whipped cream with raspberries. Brush red currant jelly mixture over raspberries. Sprinkle with 1 1/2 teaspoons sugar. Garnish with currants, if desired. "
        ], 
        "date": "2007-08-27T15:27:54+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup granulated (50 grams) or powdered (30 grams) sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "6 tablespoons (85 grams) unsalted butter", 
            "1/3 cup dark brown sugar", 
            "1/3 cup granulated sugar", 
            "1 large egg", 
            "1 large egg yolk", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 tablespoon bourbon (optional)", 
            "1 teaspoon vanilla extract", 
            "6 tablespoons all-purpose flour", 
            "3/4 cup (4 1/2 ounces or 130 grams) chocolate chips or chopped chocolate", 
            "3/4 cup toasted (always) and coarsely chopped walnuts or pecans", 
            "Flaky sea salt on top, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/not-derby-pie-bars1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Bourbon", 
            "Chocolate", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2015/04/not-derby-pie-bars/", 
        "title": "not derby pie bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. A little nonstick spray underneath helps keep the strips in place. (If you have an 8-inch square springform, you can skip this and just butter it lightly.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take another 30 seconds for it to come together, but it will. Transfer the dough clumps to prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. Meanwhile, prepare the filling.", 
            "Make the filling: Melt your butter and, if desired, brown it too, by continuing to cook the butter in a small saucepan over medium heat, stirring frequently, until golden brown bits form at the bottom, about 5 minutes. Transfer butter to a large bowl and let it cool; you can hasten this along by setting it in the freezer for a couple minutes or stirring it over an ice water bath.", 
            "Whisk sugars into butter until smooth, then egg, (edited to add) yolk, salt, bourbon (if using) and vanilla. Stir in flour until just combined, then mix in chocolate and nuts. Pour over par-baked crust, spreading evenly. Sprinkle lightly with sea salt before baking, if desired. ", 
            "Bake bars: For 20 to 25 minutes, until top is firm and golden. Bars are much easier to cut if you let them cool almost completely, but I suspect there’s little fun in that. Once they’re cool, however, you can easily transfer them from the pan to a cutting board with the parchment paper sling you created. Serve plain, with whipped cream or a tiny scoop of vanilla ice cream. Can dust with powdered sugar for extra pretties. ", 
            "Store at room temperature for up to 3 days, or in the fridge for longer."
        ], 
        "date": "2015-04-30T12:00:22+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/raspberry-breakfast-bars.jpg?w=753", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Raspberries", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/09/raspberry-breakfast-bars/", 
        "title": "raspberry breakfast bars", 
        "directions": [
            "Make the crust and crumb: Preheat the oven to 350°F. Butter the bottom and sides of a 9-by-13-inch glass or light-colored metal baking pan. Put a long piece of parchment paper in the bottom of the pan, letting the parchment extend up the two short sides of the pan and overhang slightly on both ends. (This will make it easy to remove the bars from the pan after they have baked.) Butter the parchment.", 
            "Put the flour, brown sugar, oats, salt, baking powder, baking soda, and cinnamon in a food processor. Pulse in short bursts until combined. Add the butter and pulse until loose crumbs form.", 
            "Reserve 1 1/2 cup of the mixture and set aside. (Note: The book suggests you reserve one cup only. My gut told me that was too little, and I upped it. I wanted to make sure the top of the raspberries were mostly covered, at least for packing purposes, and was glad I had changed it.) Pour the rest of the mixture into the prepared pan and use your hans or the back of a large wooden spoon to push the crust into an even layer at the bottom of the pan. The crust should touch the sides of the pan. Bake until golden brown, 12 to 15 minutes. Transfer to a wire rack and let the crust cool. Keep the oven on while you make the raspberry filling.", 
            "Make the raspberry filling: In a medium bowl, whisk the sugar, lemon zest, cinnamon and flour together. Add the raspberries, lemon juice and butter and use your hands to toss gently until the raspberries are evenly coated.", 
            "Assemble and bake the bars: Spread the raspberry filling evenly on top of the cooled crust. Sprinkle the reserved crust mixture evenly on top of the filling.", 
            "Bake for 35 to 45 minutes, rotating the pan every 15 minutes, until the top is golden brown and the filling starts to bubble around the edges.", 
            "Transfer to a wire rack to cool completely, then cut into squares and serve. The bars can be stored in the refrigerator in an airtight container for up to two days."
        ], 
        "date": "2008-09-02T15:50:41+00:00"
    }, 
    {
        "ingredient_list": [
            "11 ounces Valrhona chocolate (56% cacao)", 
            "2/3 cup heavy cream", 
            "Valrhona cocoa powder for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/robert-linxes-chocolate-truffles1.jpg?w=500", 
        "tags": [
            "Candy", 
            "Chocolate", 
            "Elsewhere", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/robert-linxes-chocolate-truffles/", 
        "title": "robert linxe’s chocolate truffles", 
        "directions": [
            "Finely chop 8 ounces of the chocolate and put in a bowl. Bring heavy cream to a boil in a small heavy saucepan. Make sure your pan is small, so you’ll lose the least amount of cream to evaporation, and heavy, which will keep the cream from scorching. Linxe boils his cream three times — he believes that makes the ganache last longer. If you do this, compensate for the extra evaporation by starting with a little more cream.", 
            "Pour the cream over the chocolate, mashing any big pieces with a wooden spoon.", 
            "Then stir with a whisk in concentric circles (don’t beat or you’ll incorporate air), starting in the center and working your way to the edge, until the ganache is smooth.", 
            "Let stand at room temperature until thick enough to hold a shape, about 1 hour, then, using a pastry bag with a 3/8-inch opening or tip, pipe into mounds (about 3/4 inch high and 1 inch wide) on parchment-lined baking sheets. When piping, finish off each mound with a flick of the wrist to soften and angle the point tip. Freeze until firm, about 15 minutes.", 
            "Meanwhile, melt 3 more ounces of the same Valrhona and smear some on a gloved hand. Gently rub each chilled truffle to coat lightly with chocolate.  (The secret to a delicate coating of chocolate is to roll each truffle in a smear of melted chocolate in your hand. Linxe always uses gloves.)", 
            "Toss the truffles in unsweetened Valrhona cocoa powder so they look like their namesakes, freshly dug from the earth. A fork is the best tool for tossing truffles in cacao. Shake truffles in a sieve to eliminate excess cacao. ", 
            "Store truffles in the refrigerator. "
        ], 
        "date": "2007-12-27T15:19:58+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup olive oil", 
            "5 Anaheim chiles or 3 jalape&#241os, stemmed, seeded, and finely chopped (I was nervous and only used 2 Anaheims; I would go for 3 or 4 next time for a more moderate but still gentle kick)", 
            "1 small yellow onion, chopped", 
            "5 cloves garlic, crushed then sliced", 
            "1 teaspoon ground cumin", 
            "1 tablespoon paprika", 
            "1 28-ounce can whole peeled tomatoes, undrained", 
            "Kosher salt, to taste", 
            "6 eggs", 
            "1/2 cup feta cheese, crumbled", 
            "1 tablespoon chopped flat-leaf parsley", 
            "Warm pitas, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/shakshuka.jpg?w=752", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Budget", 
            "Eggs", 
            "Israeli", 
            "North African", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/04/shakshuka/", 
        "title": "shakshuka", 
        "directions": [
            "Heat oil in a 12-inch skillet over medium-high heat. Add chiles and onions and cook, stirring occasionally, until soft and golden brown, about 6 minutes. Add garlic, cumin, and paprika, and cook, stirring frequently, until garlic is soft, about 2 more minutes.", 
            "Put tomatoes and their liquid into a medium bowl and crush with your hands. Add crushed tomatoes and their liquid to skillet along with 1/2 cup water, reduce heat to medium, and simmer, stirring occasionally, until thickened slightly, about 15 minutes. Season sauce with salt.", 
            "Crack eggs over sauce so that eggs are evenly distributed across sauce’s surface. Cover skillet and cook until yolks are just set, about 5 minutes. Using a spoon, baste the whites of the eggs with tomato mixture, being careful not to disturb the yolk. Sprinkle shakshuka with feta and parsley and serve with pitas, for dipping."
        ], 
        "date": "2010-04-08T22:24:26+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/slinging-slaws-summer-salads1.jpg?w=500", 
        "tags": [
            "Elsewhere", 
            "Photo", 
            "Round-Up", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/07/slinging-slaws-summer-salads/", 
        "title": "slinging slaws + summer salads", 
        "directions": [], 
        "date": "2009-07-01T20:18:06+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/so-good-soba1.jpg?w=500", 
        "tags": [
            "Elsewhere", 
            "Mushrooms", 
            "Pasta", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/08/so-good-soba/", 
        "title": "spicy soba noodles with shiitakes", 
        "directions": [
            "Stir together all sauce ingredients until brown sugar is dissolved, then set aside.", 
            "Toast sesame seeds in a dry 12-inch heavy skillet (not nonstick) over medium heat, stirring, until pale golden, then transfer to a small bowl. ", 
            "Heat oil in skillet over medium-high heat until it shimmers, then saute ginger and garlic, stirring, until fragrant, about 30 seconds. Add shiitakes and saute, stirring frequently, until tender and starting to brown, about 6 minutes. Reduce heat to medium, then add cabbage and most of scallions (reserve about a tablespoon for garnish) and cook, stirring occasionally, until cabbage is crisp-tender, about 6 minutes. Add sauce and simmer 2 minutes.", 
            "While cabbage is cooking, cook soba and edamame together in a pasta pot of boiling salted water (2 tablespoons salt for 6 quarts water) until noodles are just tender, about 6 minutes. Drain in a colander and rinse under cool water to stop cooking and remove excess starch, then drain well again. Transfer to a large bowl and toss with sesame seeds and vegetable mixture. Serve sprinkled with reserved scallions.", 
            "Epicurious’ note: If you aren’t able to find Korean hot-pepper paste, substitute 3/4 teaspoon Chinese chile paste and reduce the amount of soy sauce to 1/4 cup. "
        ], 
        "date": "2007-08-30T14:44:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 teaspoon coriander seeds", 
            "1/2 teaspoon fennel seeds", 
            "1/2 teaspoon dried oregano", 
            "1/4 to 1/2 teaspoon dried hot red pepper flakes (the latter will make them quite spicy, so using according to your preferences)", 
            "1 teaspoon kosher salt", 
            "2 pounds medium sweet potatoes", 
            "3 tablespoons vegetable oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spicy-sweet-potato-wedges-plus-five-etceteras1.jpg?w=500", 
        "tags": [
            "Elsewhere", 
            "Photo", 
            "Potatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/02/spicy-sweet-potato-wedges-plus-five-etceteras/", 
        "title": "spicy sweet potato wedges + five etceteras", 
        "directions": [
            "Preheat oven to 425°F.  Coarsely grind coriander, fennel, oregano, and red pepper flakes in an electric coffee/spice grinder or with a mortar and pestle. Stir together spices and salt. ", 
            "Cut potatoes lengthwise into 1-inch wedges. Toss wedges with oil and spices in a large roasting pan and roast in middle of oven 20 minutes. Turn wedges over with a spatula and roast until tender and slightly golden, 15 to 20 minutes more. "
        ], 
        "date": "2008-02-27T15:50:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon unsalted butter", 
            "1 tablespoon olive oil", 
            "1 medium yellow onion, small dice", 
            "4 medium cloves garlic, thinly sliced", 
            "2 teaspoons ground cumin", 
            "1 (3-inch) cinnamon stick", 
            "Salt and freshly ground black pepper", 
            "1 pound butternut squash, large dice", 
            "3/4 pound red potatoes, large dice", 
            "2 cups low-sodium chicken or vegetable broth", 
            "2 cups cooked chickpeas, drained", 
            "1 (14-ounce) can diced tomatoes, with juices", 
            "Pinch saffron threads (optional)", 
            "1/2 preserved lemon, finely chopped", 
            "1 cup brined green olives (Aida recommended Cerignola)", 
            "Steamed couscous, for serving (directions here and elsewhere on the web)", 
            "Fresh cilantro leaves, roughly chopped, for garnish", 
            "Toasted slivered almonds, for garnish", 
            "Plain yogurt, for garnish", 
            "Hot sauce of your choice (for serving)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/squash-and-chickpea-moroccan-stew1.jpg?w=500", 
        "tags": [
            "Beans", 
            "North African", 
            "Photo", 
            "Stew", 
            "Vegan", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2009/01/squash-and-chickpea-moroccan-stew/", 
        "title": "squash and chickpea moroccan stew", 
        "directions": [
            "Heat butter and olive oil in a 3- to 4-quart Dutch oven or heavy-bottomed saucepan with a tight fitting lid over medium heat. When oil shimmers, add onion, garlic, cumin, and cinnamon, and season with salt and freshly ground black pepper. Cook, stirring occasionally, until spices are aromatic and onions are soft and translucent, about 5 minutes.", 
            "Add squash and potatoes, season with salt and freshly ground black pepper, stir to coat, and cook until just tender, about 3 minutes. Add broth, chickpeas, tomatoes and their juices, and saffron, if using. Bring mixture to a boil then reduce heat to low. Cover and simmer until squash is fork tender, about 10 minutes.", 
            "Remove from heat and stir in preserved lemon and olives. Serve over couscous garnished with cilantro, almonds, and yogurt. "
        ], 
        "date": "2009-01-07T13:39:08+00:00"
    }, 
    {
        "ingredient_list": [
            "For crust", 
            "1 cup all purpose flour", 
            "1 tablespoon sugar", 
            "1/8 teaspoon salt", 
            "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces", 
            "2 tablespoons ice water", 
            "1/4 teaspoon vanilla extract", 
            "For filling", 
            "1/3 cup whole almonds (about 2 ounces)", 
            "1/3 cup sugar", 
            "1 large egg", 
            "3 tablespoons unsalted butter, room temperature", 
            "4 teaspoons framboise (raspberry liqueur) or brandy", 
            "12 ounces ripe red-skinned plums, pitted, cut into 3/4-inch-thick wedges", 
            "1/4 cup red currant jelly", 
            "Make crust: ", 
            "Preheat oven to 375°F. Combine first 3 ingredients in processor. Using on/off turns, cut in butter until mixture resembles coarse meal. Mix 2 tablespoons ice water and vanilla in small bowl. Pour water mixture over dough. Process until moist clumps form. ", 
            "Make filling:", 
            "Finely grind almonds with sugar in processor. Add egg, butter and 2 teaspoons framboise. Process until batter forms. Pour filling into crust. Arrange plums atop filling. Bake until plums are tender and filling is golden and set, about 50 minutes."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/tartlets-not-innocent1.jpg?w=500", 
        "tags": [
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Plum", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2007/08/tartlets-not-innocent/", 
        "title": "plum-almond tart", 
        "directions": [
            "Melt jelly with remaining 2 teaspoons framboise in heavy small saucepan over medium-low heat. Brush jelly mixture over plums. ", 
            "Cool tart. Serve at room temperature with whipped cream, if desired. "
        ], 
        "date": "2007-08-16T17:27:23+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/the-perfect-manhattan1.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Fall", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/09/the-perfect-manhattan/", 
        "title": "the perfect manhattan", 
        "directions": [
            "Add rye, vermouths and bitters to a cocktail shaker with ice and stir (if you want to be uber-traditional about it) or shake them together. Strain ice as you pour into a rocks or martini glass, or pour ice and drink into a tumbler. Garnish and enjoy slowly because this is bonkers potent.", 
            "Rye vs. bourbon and other whiskeys from a non-expert, i.e. corrections welcome: American rye whiskey must be distilled from at least 51% rye, but rye does not, by definition, have to be made in America. Canada produces a lot of rye whiskey, but by their own regulations. Bourbon must be distilled from at least 51% corn. It must be made in America and is most often made in Kentucky. Tennessee whiskey, basically bourbon whiskey from Tennessee, uses something called the Lincoln County Process in which whiskey, after it is distilled, is filtered through sugar-maple charcoal, making it amazing. American rye tends to be more dry and spicy than bourbon, which is fuller in body with a vanilla/caramel vibe. Rye is more traditional in the Manhattan cocktail, largely because Manhattan was a rye town when the drink was hatched in the late 1800s. How did I do? ", 
            "Angostura vs. peychauds vs. orange bitters: Angostura, traditional for the Manhattan, is made from a secret recipe, and is quite aromatic. Peychauds, slightly spicier and more sweet, is a great second choice (and what I used instead). Orange bitters are not traditional, but I think taste great in an Manhattan, although giving it more of an old-fashioned vibe."
        ], 
        "date": "2015-09-25T11:26:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup freshly squeezed lemon juice (with an efficient squeezer, you should get this plus up to 1/3 cup extra from 2 pounds of 8 lemons)", 
            "2 1/2 cups cold water, plus additional if needed", 
            "1/4 to 1/2 cup maple syrup", 
            "Bourbon", 
            "Lots of ice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/5719436567_ffb51c3a26_b.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Citrus", 
            "Drinks", 
            "Lemon", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2011/05/vermontucky-lemonade/", 
        "title": "vermontucky lemonade", 
        "directions": [
            "Mix lemon juice with 2 1/2 cups water and 1/4 cup maple syrup. Taste for sweetness. If you like your lemonade sweeter, add remaining 1/4 cup maple syrup. If you found the sweetness just right, add an additional 1/4 cup cold water instead. Stir to mix. This will yield 1 quart of maple lemonade.", 
            "Fill a glass with ice. We have a fiery debate at my house about whether this drink needs 1 or 1 1/2 shots of bourbon; my husband prefers more, but I like this drink a bit weaker. I’ll let you choose. Pour your desired amount of bourbon over the ice, fill the glass the rest of the way with maple lemonade and let the force of summer be with you."
        ], 
        "date": "2011-05-14T18:17:20+00:00"
    }, 
    {
        "ingredient_list": [
            "3 ounces (85 grams) semisweet or good white chocolate*, coarsely chopped", 
            "1 stick (4 ounces or 113 grams) unsalted butter, plus extra for greasing pan", 
            "3/4 cup plus 2 tablespoons (6 1/8 ounces or 175 grams) sugar", 
            "2 large eggs", 
            "1 teaspoon (5 ml) vanilla", 
            "1/4 teaspoon table salt or 1/2 teaspoon flaky salt (about 2 grams)", 
            "2/3 cup (83 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/white-and-dark-hearted-brownies.jpg?w=750", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Elsewhere", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/02/white-and-dark-hearted-brownies/", 
        "title": "white and dark hearted brownies", 
        "directions": [
            "1-inch heart or other shaped cookie cutter", 
            "Preheat oven to 350°F. Line an 8×8-inch square baking pan with foil, with ends of foil extending over opposite sides of pan. Repeat with second piece of foil in opposite direction. Butter foil.", 
            "Melt white or dark chocolate and butter together in a large bowl over a simmering pot of water (or in the microwave in 30 second bursts, stirring between each) until it is 90% melted; remove from heat and stir the mixture until it is smooth. (I do this too keep things from getting too hot.) Whisk in sugar. Whisk in eggs, one at a time, then vanilla. Add flour and salt together, stirring until just combined. Spread into prepared pan and bake for 25 to 30 minutes (for the dark chocolate version) and 30 to 35 minutes (for the white chocolate version).", 
            "Repeat this recipe with the other kind of chocolate and a second 8×8-inch square pan. If you don’t have two matching square pans (understandably) simply wait until you can remove your brownies from the pan as directed in the next step, and start again.", 
            "Cool pans on a wire rack in the freezer if you’re going to make cut-outs; frozen brownies are much easier to  make clean cuts from. Once solid, transfer brownies in their foil “sling” to a large cutting board and cut each pan of brownies into 16 even squares, about 2×2 inches each. Still cold (and if they warm up and soften too quickly, pop them back in the freezer for 5 minutes), carefully, slowly, gently, press your cookie cutter into the center of each brownie and set the cut-out aside. Insert the dark cut-outs into the centers of the light brownies, and vice-versa. From here, you can let them warm up to room temperature or wrap them up in the freezer until you will need them.", 
            "* I generally dislike the qualifier “good” in recipes; it suggests that if you don’t use the very! best! olive oil, butter, wine, etc. your recipe will be terrible. Feh. But good white chocolate is a world apart from the cheap stuff. Namely, it is white chocolate, and not “white baking chips” which will melt into a yellow-oiled chunky… ugh, trust me. You’ll be glad you used something better. "
        ], 
        "date": "2011-02-11T10:25:26+00:00"
    }
]