{
  "date": "2011-02-11T10:25:26+00:00",
  "directions": [
    "1-inch heart or other shaped cookie cutter",
    "Preheat oven to 350°F. Line an 8×8-inch square baking pan with foil, with ends of foil extending over opposite sides of pan. Repeat with second piece of foil in opposite direction. Butter foil.",
    "Melt white or dark chocolate and butter together in a large bowl over a simmering pot of water (or in the microwave in 30 second bursts, stirring between each) until it is 90% melted; remove from heat and stir the mixture until it is smooth. (I do this too keep things from getting too hot.) Whisk in sugar. Whisk in eggs, one at a time, then vanilla. Add flour and salt together, stirring until just combined. Spread into prepared pan and bake for 25 to 30 minutes (for the dark chocolate version) and 30 to 35 minutes (for the white chocolate version).",
    "Repeat this recipe with the other kind of chocolate and a second 8×8-inch square pan. If you don’t have two matching square pans (understandably) simply wait until you can remove your brownies from the pan as directed in the next step, and start again.",
    "Cool pans on a wire rack in the freezer if you’re going to make cut-outs; frozen brownies are much easier to  make clean cuts from. Once solid, transfer brownies in their foil “sling” to a large cutting board and cut each pan of brownies into 16 even squares, about 2×2 inches each. Still cold (and if they warm up and soften too quickly, pop them back in the freezer for 5 minutes), carefully, slowly, gently, press your cookie cutter into the center of each brownie and set the cut-out aside. Insert the dark cut-outs into the centers of the light brownies, and vice-versa. From here, you can let them warm up to room temperature or wrap them up in the freezer until you will need them.",
    "* I generally dislike the qualifier “good” in recipes; it suggests that if you don’t use the very! best! olive oil, butter, wine, etc. your recipe will be terrible. Feh. But good white chocolate is a world apart from the cheap stuff. Namely, it is white chocolate, and not “white baking chips” which will melt into a yellow-oiled chunky… ugh, trust me. You’ll be glad you used something better. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/white-and-dark-hearted-brownies.jpg?w=750",
  "ingredient_list": [
    "3 ounces (85 grams) semisweet or good white chocolate*, coarsely chopped",
    "1 stick (4 ounces or 113 grams) unsalted butter, plus extra for greasing pan",
    "3/4 cup plus 2 tablespoons (6 1/8 ounces or 175 grams) sugar",
    "2 large eggs",
    "1 teaspoon (5 ml) vanilla",
    "1/4 teaspoon table salt or 1/2 teaspoon flaky salt (about 2 grams)",
    "2/3 cup (83 grams) all-purpose flour"
  ],
  "tags": [
    "Brownies/Blondies",
    "Chocolate",
    "Elsewhere",
    "Photo"
  ],
  "title": "white and dark hearted brownies",
  "url": "https://smittenkitchen.com/2011/02/white-and-dark-hearted-brownies/"
}