{
  "date": "2012-11-09T13:07:32+00:00",
  "directions": [
    "Preheat oven to 300 degrees. Line a baking sheet with parchment paper. In a food processor, pulse oats, coconut, pepitas, sugar, cinnamon and salt in short bursts until the mixture is very well chopped but not powdery — it needn’t be like a flour. In a large bowl, beat egg white and water until frothy (but not stiff). Add nuts to bowl and coat them very well, using a few more stirs than will seem necessary because if the egg doesn’t get into the craters of the nuts, no granola will stick there. And that would be sad. Pour oat mixture into bowl and very gently fold it together with the nuts, so that it just barely sticks. (I found that if you stirred it a lot, the mixture just started falling off, so just a few folds will do.) You’ll have more granola coating than will seem necessary, but this is fine. Spread nuts-and-granola out on baking sheet in a single layer but no need to separate them. Sprinkle any granola mix leftover in the bowl over the nuts. ",
    "Bake for 20 minutes, moving nuts around just once in the baking time so that the inner nuts get as toasty as the ones at the edge, and up to 10 minutes more if they don’t look toasty yet at 20 minutes. Transfer pan to cooling rack and let nuts cool completely there. Once fully cool, break up any nut clusters and place mixture in jars/bags/your hand."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/granola-crusted-nuts1.jpg?w=500",
  "ingredient_list": [
    "3/4 cup rolled oats (quick-cooking or old-fashioned will work; instant might get a little dusty)",
    "1/4 cup shredded or flaked unsweetened coconut",
    "2 tablespoons pepitas, or another nut or seed of your choice",
    "1/4 cup dark or light brown sugar (for low-to-moderate sweetness)",
    "1/8 teaspoon ground cinnamon",
    "Few pinches sea salt",
    "1 large egg white",
    "2 teaspoons water (adjusted from 1 T)",
    "2 cups (approximately 1/2 pound) walnuts, pecans or nuts that you prefer"
  ],
  "tags": [
    "Breakfast",
    "Photo",
    "Snack"
  ],
  "title": "granola-crusted nuts",
  "url": "https://smittenkitchen.com/2012/11/granola-crusted-nuts/"
}