[
    {
        "ingredient_list": [
            "2 cups all-purpose flour", 
            "1/2 teaspoon salt", 
            "2 tablespoons sugar", 
            "1 1/2 teaspoons baking soda", 
            "1 3/4 cups buttermilk* or 1 1/2 cups sour cream or plain yogurt thinned with 1/4 cup milk", 
            "2 eggs, separated", 
            "4 tablespoons (1/2 stick butter, melted and cooled)", 
            "1/2 teaspoon vanilla extract", 
            "Canola or other neutral oil for brushing on waffle pan (Deb note: Pam works great!)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/again-with-the-pining1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2007/03/again-with-the-pining/", 
        "title": "rich buttermilk waffles", 
        "directions": [
            "Combine the dry ingredients. Mix together the buttermilk, sour cream or yogurt and the egg yolks. Stir in the butter and vanilla.", 
            "Brush the waffle iron lightly with oil and preheat it. Stir the wet into the dry ingredients. Beat the egg whites with the whisk or electric mixer (spotlessly clean ones work best) until they hold soft peaks. Stir them gently into the batter. ", 
            "Spread a ladleful or so of batter onto the waffle iron and bake until the waffle is done, usually 3 to 5 minutes, depending on your iron. Serve immediately or keep warm for a few minutes in a low oven.", 
            "* The buttermilk can be substituted with 1 1/4 cups of milk at room temperature, mixed with two tablespoons white vinegar, left to clabber for 10 minutes. "
        ], 
        "date": "2007-03-26T23:21:10+00:00"
    }, 
    {
        "ingredient_list": [
            "3 whole boneless chicken breasts with skin (about 2 1/2 pounds), halved (see Note)", 
            "1 1/2 tablespoons olive oil", 
            "3 1/2 tablespoons unsalted butter", 
            "1 onion, halved and sliced thin", 
            "3/4 pound mushrooms, sliced thin, any variety you like", 
            "1/2 cup dry Marsala", 
            "1 cup chicken broth", 
            "2 tablespoons minced fresh parsley leaves (optional, for garnish)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/03/alexs-chicken-and-mushroom-marsala.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Date Night", 
            "Gluten-Free", 
            "Mushrooms", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/03/alexs-chicken-and-mushroom-marsala/", 
        "title": "alex’s chicken and mushroom marsala", 
        "directions": [
            "Pat chicken dry and season with salt and pepper. In a large heavy skillet heat oil and 1 1/2 tablespoons butter over moderately high heat until hot but not smoking and brown chicken in 2 batches, transferring with tongs to a large plate as browned.", 
            "Discard all but 1 tablespoon fat from skillet and sauté onion and mushrooms, stirring occasionally, until liquid mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until Marsala is almost evaporated. Add broth and chicken with any juices that have accumulated on plate and simmer, turning chicken once, until cooked through, about 15 minutes. Transfer chicken with tongs to a platter.", 
            "Simmer mushroom sauce until liquid is reduced to about 1/2 cup. Remove skillet from heat and stir in remaining 2 tablespoons butter and salt and pepper to taste, stirring until butter is just incorporated. Spoon mushroom sauce around chicken and sprinkle with parsley. ", 
            "New note, 11/21/13: Tonight, I made this with boneless, skinless chicken thighs and it was fantastic — and quick, with refreshingly few ingredients. This takes well under an hour to cook, and deserves to be placed back in the weeknight rotation. "
        ], 
        "date": "2008-03-03T12:44:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 can (28 ounces) diced tomatoes in juice", 
            "1 tablespoon olive oil", 
            "3/4 pound sweet or hot Italian sausage, casings removed", 
            "1 small onion, finely chopped", 
            "Coarse salt and ground pepper", 
            "1 cup Arborio rice", 
            "1/2 cup dry white wine", 
            "1 bunch flat-leaf spinach (10 to 14 ounces), washed well, tough stems removed, chopped (about 7 cups)", 
            "1/2 cup grated Parmesan cheese, plus more for serving (optional)", 
            "2 tablespoons butter "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/tomato-and-sausage-risotto.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Gluten-Free", 
            "Meat", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2006/11/alexs-restaurant/", 
        "title": "tomato and sausage risotto", 
        "directions": [], 
        "date": "2006-11-14T17:44:30+00:00"
    }, 
    {
        "ingredient_list": [
            "For the compote", 
            "1 pound strawberries, rinsed and hulled", 
            "1 pound rhubarb, trimmed", 
            "1 lemon", 
            "3/4 cup granulated sugar", 
            "For the almond cake", 
            "Butter and flour for the pan(s)", 
            "7 ounces almond paste", 
            "1/4 cup granulated sugar", 
            "4 ounces unsalted butter, cut into small pieces and chilled", 
            "2 tablespoons honey", 
            "3 large eggs", 
            "2 tablespoons amaretto, plus additional for brushing", 
            "1/3 cup all-purpose flour, sifted (we used matzo meal with success, though finely grinding it first would have been a better idea)", 
            "Kosher salt", 
            "1/3 to 1/2 cup sliced almonds, toasted", 
            "Confectioners’ sugar", 
            "3/4 cup crème fraîche, whipped to soft peaks     ", 
            "Make the compote", 
            "1. Select about 4 ounces of the smallest strawberries and cut lengthwise into quarters. These will be added raw to the cooked compote; set aside.", 
            "Make the cake", 
            "1. Preheat the oven to 350°F (175°C). Butter and flour four 4-by-1 3/4-inch-high miniature springform pans or butter and flour the bottom and sides of an 8-inch round cake pan. If using the 8-inch pan, line its bottom with a circle of parchment paper; this isn’t necessary with the small pans."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/almond-cake-with-strawberry-rhubarb-compote1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Easter", 
            "Everyday Cakes", 
            "Fruit", 
            "Passover", 
            "Photo", 
            "Rhubarb", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2008/04/almond-cake-with-strawberry-rhubarb-compote/", 
        "title": "almond cake with strawberry-rhubarb compote", 
        "directions": [
            "2. Place the almond paste and sugar in the bowl of a heavy-duty mixer fitted with the paddle attachment, or in another large bowl if using a handheld mixer. Begin to cream the mixture on low speed to break up the almond paste, then increase the speed to medium for about 2 minutes, or until the paste is broken into fine particles.", 
            "3. Add the butter and mix for 4 to 5 minutes, or until the mixture is light in color and airy; stop the machine and scrape down the sides as necessary. It is important to mix long enough or the cake will have a dense texture.", 
            "4. Mix in the honey, then add the eggs one at a time, beating until each one is fully incorporated before adding the next. Add the amaretto, flour, and a pinch of salt and mix just to combine.", 
            "5. Scrape the batter into the prepared pan(s) and smooth the top. Bake the small cakes for about 15 minutes, the large one for about 25 minutes, or until the cake is golden and springs back when pressed. Transfer to a rack to cool.", 
            "6. Unmold the small cakes or invert the large cake onto the rack, remove the parchment paper, and invert the cake again so that the top is once again facing upward. Brush the top of the cake(s) with amaretto and sprinkle with the toasted almonds. Dust with confectioners’ sugar. (The large and small cakes can be stored, well wrapped, at room temperature for up to 2 days.) To serve, cut the small cakes in half or the large cake into wedges. Serve with a dollop of whipped crème fraîche and the strawberry-rhubarb compote."
        ], 
        "date": "2008-04-21T16:27:14+00:00"
    }, 
    {
        "ingredient_list": [
            "4 1/2 cups cake flour", 
            "4 1/2 teaspoons baking powder", 
            "3/4 teaspoon salt", 
            "2/3 cup prepared almond paste (7 ounces)", 
            "2 2/3 cups sugar", 
            "2 1/2 sticks (10 ounces) unsalted butter, at room temperature", 
            "1 tablespoon almond extract", 
            "10 egg whites", 
            "1 1/2 cups whole milk", 
            "For assembly:", 
            "1 cup simple syrup (to keep cake moist)(optional)", 
            "1 cup seedless raspberry preserves", 
            "7 ounces bittersweet chocolate", 
            "1 cup heavy cream", 
            "1 stick (4 ounces) unsalted butter, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/almond-raspberry-layer-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Chocolate", 
            "Easter", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/05/almond-raspberry-layer-cake/", 
        "title": "almond raspberry layer cake", 
        "directions": [
            "1. Melt the chocolate with the cream in a double boiler or metal bowl set over a pan of simmering water. Whisk to blend well. Remove from heat and let stand, whisking occasionally, until the chocolate mixture thickens to the consistency of mayonnaise. (No doubt, exactly what you want to think about when making chocolate frosting).", 
            "2. Place the butter in a large mixer bowl and with an electric mixer on medium speed, whip the butter until light and fluffy. Add the chocolate cream and whip until lighter in color and somewhat stiff, about three minutes. Do not whip too long or the frosting may begin to separate."
        ], 
        "date": "2009-05-14T15:04:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound tart, firm apples such as Granny Smiths (2 large or 3 medium)", 
            "1 tablespoon lemon juice", 
            "6 tablespoons all-purpose flour", 
            "1 tablespoon granulated sugar", 
            "1/4 teaspoon cinnamon", 
            "1 teaspoon baking powder", 
            "2 large eggs", 
            "Butter (I used about 2 tablespoons)", 
            "Rich plain yogurt, sour cream or crème fraîche for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/11/apple-latkes.jpg?w=750", 
        "tags": [
            "Apple", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/11/apple-latkes/", 
        "title": "apple latkes", 
        "directions": [
            "In a small saucepan, simmer the apple juice until it is reduced by half. Add the sugar and continue to cook it until it becomes a golden brown/amber color. Add the butter and once it melts, the heavy cream and salt. Simmer for one minute and serve, with or without apple latkes."
        ], 
        "date": "2010-11-30T17:17:28+00:00"
    }, 
    {
        "ingredient_list": [
            "6 large eggs", 
            "4 medium asparagus spears", 
            "2 teaspoons very finely minced shallot, scallion or chives, plus a pinch extra for garnish", 
            "3 tablespoons mayonnaise, whipping cream, creme fraiche, sour cream and/or soft butter", 
            "1/2 teaspoon smooth Dijon (optional)", 
            "Few gratings fresh lemon zest (optional)", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/asparagus-stuffed-eggs1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Asparagus", 
            "Breakfast", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/04/asparagus-stuffed-eggs/", 
        "title": "asparagus-stuffed eggs", 
        "directions": [
            "Hard-boil eggs using whichever method you prefer. I cover mine with cold water, bring it to a boil, then set a timer for 9 1/2 minutes. When it rings, drain the eggs, and plunge them in ice water until they’re fully cool. Eggs can be cooked ahead of time and stored in the fridge for up to 4 days. ", 
            "Cook asparagus spears in salted simmering water until full tender, about 4 to 5 minutes. Drain and plunge in cold water. Drain and again and spread on towels to dry out as much as possible. Cut 1/2-inch off the tips of each spears and cut these tips lengthwise (they’ll be your garnish). Puree remaining asparagus — I found that my food processor didn’t do a great job due to the small volume, but yours might. A food mill with a fine disc works well here. ", 
            "You’ll want to remove the excess water from your puree; I did so by spreading it for a minute on a few paper towel layers. If you don’t, the filling will be soggy and damp, or in Julia’s words, “a disappointing texture and flavor.” ", 
            "Peel your eggs. Dip your knife in water before cutting each in half lengthwise for a cleaner cut. Shave a thin strip off the bottom of each so that it will not rock about in its dish. Remove the yolks and press them through a fine-mesh strainer to sieve them. Add asparagus puree, shallot or chives, mayonnaise or cream, Dijon or lemon zest (if using) and combine mixture until smooth. Season carefully with salt and freshly ground black pepper.", 
            "You can spoon the mixture into each egg half, or use a piping bag with a star tip for a fancier presentation. Decorate each stuffed egg with a reserved asparagus tip (you’ll be a little short of what you need), and the remaining with the extra shallot, scallion or chives. Wrap tray in plastic and keep in fridge until ready to serve. "
        ], 
        "date": "2014-04-08T12:25:30+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "1/3 cup whole blanched almonds, Marconas if you can get them", 
            "Yogurt dressing", 
            "1 cup plain yogurt (strained or Greek-style if you can find it)", 
            "2 tablespoons lemon juice", 
            "1 teaspoon smoked paprika", 
            "1 small clove garlic, minced", 
            "1/4 teaspoon table salt", 
            "Asparagus", 
            "1 tablespoon olive oil", 
            "1 pounds asparagus spears, tough ends trimmed or peeled", 
            "Salt and freshly ground black pepper", 
            "To serve", 
            "Squeeze of lemon juice", 
            "Drizzle of olive oil", 
            "Coarse sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/asparagus-with-almonds-and-yogurt-dressing1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Asparagus", 
            "Easter", 
            "Photo", 
            "Side Dish", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/06/asparagus-with-almonds-and-yogurt-dressing/", 
        "title": "asparagus with almonds and yogurt dressing", 
        "directions": [
            "Hard-boil your eggs according to your favorite method. I like to put my eggs cold in a pot of water and bring it to a boil over high heat. Once it comes to a boil, I set the timer for 10 minutes and reduce the heat to a moderate simmer. When the timer goes off, I drain them and plunge them in ice water for a quick cooling. While they cool, toast your almonds. [If you have time, cook the eggs 24 hours or more in advance. Older hard-boiled eggs peel more cleanly.] ", 
            "In a 12-inch heavy skillet, toast your almonds over medium heat, tossing them frequently until they’re lightly bronzed. [Marcona almonds often come already toasted and in a bit of olive oil. If you’re happy with their color, use them as is. If not, you can put the almonds and oil in the skillet to toast them more deeply, as I did.] Let cool.", 
            "Once eggs and almonds are cool, coarsely chop both and set aside. ", 
            "Make your yogurt dressing, whisking all of the ingredients in a small bowl. Adjust seasonings to taste. Spread 1/2 cup dressing in a thin layer over serving dish and set aside. ", 
            "Reheat heavy 12-inch skillet over medium high heat. Add oil, and once the oil is fully heated, add your trimmed asparagus spears — placing half in one direction and half in the other allows them to fit better. They won’t fit flat in a single layer, but you should try to spread them as evenly as possible. Cover the skillet with a lid (foil if you don’t have one that fits) and let skinny spears cook for 3 minutes and fatter ones for 5. Remove the lid, increase the heat to high, season the asparagus with salt and black pepper, and use tongs to cook the spears until they’re crisp-tender and well-browned along a side or two, about 5 minutes more for skinny spears or 7 minutes for thicker ones. ", 
            "Transfer asparagus to dressing-coated serving dish. Sprinkle spears with an additional squeeze of lemon juice, if desired, a tiny drizzle of olive oil, chopped almonds, eggs and a bit of coarse sea salt. Dollop with additional yogurt dressing. Then dig in."
        ], 
        "date": "2012-06-01T14:03:21+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds (32 ounces) ounces fresh baby spinach or regular spinach leaves", 
            "1 small yellow onion, finely chopped", 
            "3 small garlic cloves, minced", 
            "4 tablespoons unsalted butter", 
            "1 pound mushrooms, thinly sliced (I use creminis)", 
            "1 cup heavy cream", 
            "3/4 teaspoon table salt", 
            "Freshly ground black pepper", 
            "1/4 teaspoon freshly grated nutmeg (optional; I skip this)", 
            "12 large eggs", 
            "6 tablespoons finely grated Parmesan cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/baked-eggs-with-spinach-and-mushrooms.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Mushrooms", 
            "Spinach", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/04/baked-eggs-with-spinach-and-mushrooms/", 
        "title": "baked eggs with spinach and mushrooms", 
        "directions": [
            "If you’ve just washed your spinach, no need to dry it before wilting it in the pan. If it’s already dry, bring 1/2 inch water to a boil in a very large ovenproof heavy skillet, then add half of spinach and cook, turning with tongs, until wilted, about 30 seconds. Add remaining spinach and wilt in same manner, then cook, covered, over moderately high heat until spinach is tender, about 1 to 2 minutes. Drain in a colander and cool under cold running water. Gently squeeze handfuls of spinach to remove as much liquid as possible, then coarsely chop. You will have about 2 cups fairly tightly packed cooked spinach.", 
            "Wipe skillet dry, then melt butter over medium-low heat. Cook onion and garlic until softened, 2 to 3 minutes. Add mushrooms and increase heat to medium-high, then cook, stirring, until mushrooms have softened, exuded liquid and that liquid has cooked off, about 5 minutes. Stir in cream, salt, pepper, nutmeg (if using), and chopped spinach and bring back a simmer. Remove skillet from heat.", 
            "If baking eggs in this skillet, make 12 large indentations in mixture, each large enough to fit an egg. Otherwise, you can transfer this mixture to a 9×13-inch baking dish and do the same there. I like to use 2 teaspoons to make the wells; I press the backs of them together to “pinch” up the spinach mixture to form taller walls so that the eggs will not merge together. ", 
            "Do ahead: You can then set this aside for a few hours or up to one day in the fridge, covered.", 
            "When you’re ready to bake the dish, or about 30 minutes before serving, put oven rack in upper third of oven and heat oven to 450°F. Crack an egg into each well. Bake until whites are firm and yolks are still runny. You can check this by inserting a toothpick into various parts of the eggs and seeing whether they’re runny or set, which takes anywhere from 15 to 30 minutes. The range is long due to different ovens and baking vessels. It’s better to have to check more often than to let them overcook.", 
            "[Cooking note: It is nearly impossible to get all 12 eggs to cook evenly. The ones in the center will be more runny; at the edges, they’ll be more firm. But don’t fret. I’ve found that almost all people have an egg preference (more runny vs. more firm) and each egg manages to find the right home. Just ask people their preference as you serve them.]", 
            "Remove dish from oven, sprinkle with additional salt and pepper, plus grated Parmesan. Serve immediately."
        ], 
        "date": "2014-04-16T12:31:29+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large (mine was just over 1 1/4 pounds/570 grams) eggplant, cut into 3/4-inch dice", 
            "Salt and black pepper", 
            "1/4 cup (60 ml) olive oil", 
            "1 medium carrot, peeled and cut into 1/4-inch dice", 
            "1 celery stalk, in a 1/4-inch dice", 
            "1 medium onion, finely diced", 
            "3 garlic cloves, minced", 
            "8 ounces (225 grams) orzo, a rice-shaped pasta, rinsed", 
            "1 teaspoon (6 grams) tomato paste", 
            "1 1/2 cups (355 ml) vegetable stock", 
            "1 to 3 tablespoons fresh oregano, chopped", 
            "1 teaspoon grated lemon zest or more to taste, up to the zest of a whole lemon", 
            "4 ounces (115 grams) mozzarella, firmer is better here, cut into 1/3-inch dice", 
            "1 1/2 ounces (a generous 1/2 cup or 45 grams) parmesan, grated", 
            "3 medium tomatoes, diced "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/09/baked-orzo-with-eggplant-and-mozz.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Eggplant", 
            "Pasta", 
            "Photo", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/09/baked-orzo-with-eggplant-and-mozzarella/", 
        "title": "baked orzo with eggplant and mozzarella", 
        "directions": [
            "Sprinkle your eggplant generously with salt and let it drain in a colander for 30 minutes. I used this time to get the rest of my ingredients ready. After 30 minutes, rinse it well and pat it dry on towels. ", 
            "Preheat your oven to 350°F. Heat a large frying pan over medium-high heat. Once hot, add the oil and once the oil is shimmering, add the eggplant. Fry for 8 minutes, stirring pieces occasionally. Using a slotted spoon or spatula, transfer them to paper towels to drain. Add celery and carrots to remaining oil and cook for 3 minutes before adding onion and garlic. Cook together for 5 more minutes on medium heat. Stir in the orzo and tomato paste and cook for two minutes more. Off the heat, add the oregano, mozzarella, parmesan, tomatoes, fried eggplant, lemon zest, 1 teaspoon table salt, many grinds of black pepper and the stock and mix well. ", 
            "Transfer mixture to an 8×11-inch (about 2 quarts) ovenproof baking dish. Cover with foil and bake 20 minutes, then bake 20 minutes without the foil. (You can increase the ration of foil-on to foil-off time if you don’t like a crunchy pasta lid.) Let rest for 5 minutes before serving. "
        ], 
        "date": "2012-09-06T15:02:05+00:00"
    }, 
    {
        "ingredient_list": [
            "Pasta and assembly", 
            "1 pound chunky pasta of your choice (I love bell shapes; see above for details)", 
            "1 bundle broccoli rabe (see above for options), stems and leaves cut into 1-inch segments", 
            "1 pound Italian sausage (sweet or spicy pork or chicken), casings removed", 
            "2/3 cup grated parmesan or pecorino romano cheese", 
            "6 ounces mozzarella, cut into small cubes", 
            "Bechamel", 
            "2 cups milk, full fat is ideal", 
            "4 tablespoons unsalted butter", 
            "1/4 cup all-purpose flour", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "2 cloves garlic, minced", 
            "Few gratings fresh nutmeg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/09/baked-pasta-with-broccoli-rabe-and-sausage.jpg?w=750", 
        "tags": [
            "Broccoli Rabe", 
            "Casserole", 
            "Fall", 
            "Freezer Friendly", 
            "Meat", 
            "Pasta", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/09/baked-pasta-with-broccoli-rabe-and-sausage/", 
        "title": "baked pasta with broccoli rabe and sausage", 
        "directions": [
            "Cook the pasta and rabe: Bring a large pot of well-salted water to a boil. Add pasta and five minutes before its cooking time is up, add the broccoli rabe. It will seem like too much for the water, but with a stir or two, the rabe should wilt and cook alongside the pasta. Drain the broccoli rabe and pasta together and place in a large bowl.", 
            "Cook your sausage: Meanwhile, heat 1 to 2 tablespoons olive oil in a large, wide saucepan (you will use this for the bechamel in a few minutes; you could also use your pasta pot, once it is drained) over medium heat. When hot, add the sausage, breaking it up with a wooden spoon until it starts to brown, about five minutes. Remove with slotted spoon or spatula, leaving any fat behind. Eyeball the drippings (pork sausage will leave some; chicken usually does not) — use one tablespoon less butter next if it looks like there’s a tablespoon there. Any less, don’t worry about adjusting the butter.", 
            "Heat oven to 400 degrees.", 
            "Make the bechamel: Melt your butter in same saucepan over medium heat. Once melted, add your flour and stir it into the butter until smooth. Cook the mixture together for a minute, stirring constantly. Pour in a small drizzle of your milk, whisking constantly into the butter-flour mixture until smooth. Continue to drizzle a very small amount at a time, whisking constantly. Once you’ve added a little over half of your milk, you’ll find that you have more of a thick sauce or batter, and you can start adding the milk in larger splashes, being sure to keep mixing. Once all of the milk is added, add the salt, garlic, nutmeg, and few grinds of black pepper, and bring the mixture to a lower simmer and cook it, stirring frequently, for 10 minutes. Taste and adjust seasonings if needed.", 
            "Assemble and bake: Add the sausage and bechamel to the bowl with the pasta and broccoli rabe. Stir in mozzarella and half of grated parmesan or pecorino until combined. Pour into a lasagna pan, deep 9×13-inch baking dish* or 3-quart casserole dish and coat with remaining parmesan or pecorino. Bake for 20 to 30 minutes, until the edges and craggy points are nicely bronzed.", 
            "Eat warm. Reheat as needed.", 
            "* I love this so much, I’ve bought two, and it’s usually crazy inexpensive."
        ], 
        "date": "2013-09-11T11:36:34+00:00"
    }, 
    {
        "ingredient_list": [
            "For the meatballs:", 
            "1/4 cup milk", 
            "1 slice good white bread trimmed of its crust", 
            "1 pound ground pork (or beef, or lamb, or a mix of the three)", 
            "1 teaspoon chopped garlic", 
            "2 tablespoons chopped parsley", 
            "1/3 cup freshly grated parmigiano-reggiano (Parmesan)", 
            "1 egg", 
            "Salt", 
            "Black pepper in a grinder", 
            "1 cup flour, spread on a plate", 
            "Vegetable oil for frying", 
            "For the bèchamel:", 
            "4 1/2 cups milk", 
            "6 tablespoons butter", 
            "5 tablespoons flour", 
            "1/8 teaspoon grated nutmeg", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "To finish:", 
            "1 pound rigatoni", 
            "3/4 cup freshly grated parmigiano-reggiano", 
            "1 tablespoon butter", 
            "1/4 cup milk"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/baked-rigatoni-with-tiny-meatballs1.jpg?w=500", 
        "tags": [
            "Casserole", 
            "Freezer Friendly", 
            "Italian", 
            "Meat", 
            "Pasta", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/02/baked-rigatoni-with-tiny-meatballs/", 
        "title": "baked rigatoni with tiny meatballs", 
        "directions": [
            "Make the meatballs: Heat the milk, but don’t let it simmer. Tear pieces of the white bread into it and let it soak for 5 minutes, before picking it up with your hand, squeezing it of excess milk and putting it in a large mixing bowl.", 
            "Add the pork, garlic, parsley, grated cheese, egg, salt, and pepper. Combine all the ingredients with a fork until they are evenly mixed (or “amalgamated”, as Hazan so charmingly says).", 
            "Pinch off a small lump of meat, about the size of a raspberry and roll the lump into a ball in the palm of your hands. (Hazan says if you are good with your hands, you can try making 3 balls at a time. It turns out, I am not.) When all the meatballs have been shaped (a process that took less time than I had expected, just the same), roll them in the flour, 15 to 20 at a time. Place the floured meatballs in a strainer and shake it smartly to dispose of excess flour.", 
            "Put enough vegetable oil in a skillet to rise 1/4-inch up the sides of the pan and turn on the heat to medium high. When the oil is hot, put as many meatballs in the skillet as will fit without overcrowding. Brown them until they form a nice crust all around. When one batch is done, transfer it with a slotted spoon to a platter covered with paper towels to drain and do the next batch until all are done.", 
            "Make the bèchamel:  Heat the milk over low heat in a saucepan until it forms a ring of pearly bubbles, but do not let it break into a boil. In a larger saucepan, melt the butter over low heat, add the flour and stirring constantly with a wooden spoon or flat whisk until combined. Add 2 tablespoons of milk at a time to the flour and butter mixture, stirring steadily and thoroughly, then repeat through 8 additions. At this point, you can add the milk in 1/2 cup increments, stirring constantly to keep it smooth. Add the salt, pepper and nutmeg and stir the sauce until it thickens.", 
            "Assemble the dish: Cook the rigatoni in a pot of well salted water. Drain when still al dente, and combine immediately in bowl with two-thirds of the bèchamel, half the grated cheese, and all the meatballs.", 
            "Preheat the oven to 400°F. Heavily butter a 9×13 baking dish. (Original recipe calls for a 12-inch springform, which I am sure would be lovely but is not the commonest U.S. cake pan.) Spread the rigatoni and meatball mixture in the pan, leveling it off with a spatula. Pour the milk over the dish, the spread the rest of bèchamel on top, and sprinkle with the remaining grated cheese.", 
            "Place in the uppermost level of the preheated oven. Bake for 15 to 20 minutes until a golden brown crust forms on top."
        ], 
        "date": "2010-02-27T13:14:54+00:00"
    }, 
    {
        "ingredient_list": [
            "2 lemons, halved", 
            "5 large artichokes (about 12 ounces each)", 
            "11/2 cups shelled fresh or frozen fava beans, or shelled frozen edamame", 
            "1/4 cup extra-virgin olive oil, plus more as needed", 
            "1 large onion, thinly sliced", 
            "1 sprig oregano, optional", 
            "2 ounces guanciale or pancetta, slivered", 
            "Salt", 
            "2 cups shelled (fresh or frozen) peas", 
            "1/4 cup chopped parsley", 
            "2 tablespoons chopped mint", 
            "* teaspoon lemon juice, plus more to taste", 
            "Freshly ground black pepper. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/box-one-of-two1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Beans", 
            "Easter", 
            "Italian", 
            "Photo", 
            "Spring", 
            "Stew"
        ], 
        "url": "https://smittenkitchen.com/2007/06/box-one-of-two/", 
        "title": "spring vegetable stew", 
        "directions": [
            "1. To prepare the artichokes: Fill a large bowl halfway with cold water. Squeeze the lemons into the water and add the rinds to the bowl. Using a serrated knife, cut off the top third of an artichoke. Pull back and snap off the dark green, leafy blades, one by one, until only the pale yellow leaves remain. Using a paring knife, trim the artichoke bottom and stem to the pale green flesh, then cut it in half lengthwise. Drop into the water (to keep the artichoke from turning brown) and repeat with the remaining artichokes. Using a spoon, scoop out the prickly leaves and hairy choke. Cut each half into 4 wedges and return to the water until ready to use. ", 
            "2. If using fresh fava beans, bring a large pot of water to a boil. Fill a large bowl two-thirds full with ice water. When the water comes to a boil, add the beans and cook for 1 minute, then drain and immediately submerge the beans in the ice water. Peel the beans by gently tearing the pale skins and pinching at one end. Discard the skins, reserving the dark green interiors. ", 
            "3. To cook the ragout: Heat a 12-inch nonreactive pan over medium heat. Add 1/4 cup olive oil and when hot, add the onion, oregano (if using) and guanciale. Cook, stirring occasionally until the onion and guanciale are translucent, about 10 minutes. Drain artichokes and add to the pan, along with 2 cups water and 11/4 teaspoons salt. Bring the liquid to a boil, then reduce heat to a simmer and cook until artichokes are just tender, about 25 minutes. If using frozen favas, add them and cook for 2 minutes. If using fresh favas or frozen edamame, add them, along with the peas, and cook until warm and tender, about 5 minutes more. Remove the oregano sprig. Sprinkle in parsley and mint. Season with lemon juice, freshly ground black pepper and, if desired, additional salt. Drizzle with extra-virgin olive oil and serve."
        ], 
        "date": "2007-06-05T23:38:32+00:00"
    }, 
    {
        "ingredient_list": [
            "Sponge", 
            "6 tablespoons (3 ounces) warm water", 
            "1 teaspoon sugar", 
            "1 1/2 teaspoons instant yeast", 
            "1/4 cup (1 ounce) unbleached all-purpose flour", 
            "Dough", 
            "Sponge (above)", 
            "6 tablespoons (3 ounces) sour cream or yogurt", 
            "1/4 cup (4 tablespoons or 2 ounces) unsalted butter, softened", 
            "2 large eggs, 1 beaten for dough, 1 beaten with 1 teaspoon water for brushing bread", 
            "1/4 cup (1 3/4 ounces) sugar", 
            "1 teaspoon salt", 
            "1 teaspoon vanilla extract", 
            "2 1/2 cups (10 5/8 ounces) unbleached all-purpose flour", 
            "Pearl sugar* or sparkling white sugar for sprinkling", 
            "Lemon cream cheese filling", 
            "1/3 cup (2 1/2 ounces) cream cheese, softened", 
            "2 tablespoons (5/8 ounces) sugar", 
            "2 tablespoons (1 ounce) sour cream", 
            "1 teaspoon fresh lemon juice", 
            "2 tablespoons (1/2 ounce) unbleached all-purpose flour", 
            "1/4 cup (2 ounces) homemade (recipe below) or prepared lemon curd  ", 
            "3 tablespoons fresh lemon juice", 
            "3/4 teaspoon fresh lemon zest, finely grated", 
            "3 tablespoons sugar", 
            "1 large egg", 
            "2 tablespoons unsalted butter, cut into small pieces"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/braided-lemon-bread.jpg?w=750", 
        "tags": [
            "Bread", 
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Easter", 
            "Lemon", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/05/braided-lemon-bread/", 
        "title": "braided lemon bread", 
        "directions": [
            "Whisk together juice, zest, sugar, and egg in a 1-quart heavy saucepan. Stir in butter and cook over moderately low heat, whisking frequently, until curd is thick enough to hold marks of whisk and first bubble appears on surface, about 4 to 5 minutes. Transfer lemon curd to a bowl and chill, its surface covered with plastic wrap, until cold, at least 1 hour. "
        ], 
        "date": "2010-05-13T20:50:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 bone-in pork shoulder, about 4 pounds", 
            "Kosher salt", 
            "2 tablespoons olive oil", 
            "1 medium white or yellow onion, peeled and cut into large pieces", 
            "1 large rib celery, cut into large pieces", 
            "1 small fennel bulb, trimmed and cut into large pieces", 
            "1 quart chicken stock, plus a splash or two more, if needed", 
            "3 sprigs fresh thyme", 
            "Freshly ground black pepper", 
            "4 tablespoons unsalted butter", 
            "2 9-ounce boxes dry lasagna, broken into 3-inch shards", 
            "2 tablespoons fresh lemon juice, or more to taste", 
            "2 tablespoons (although I use more) grated or shaved parmesan or grana padano cheese", 
            "1 tablespoon chopped parsley (optional)", 
            "Large handful arugula leaves, cleaned"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/broken-pasta-with-pork-ragu.jpg?w=750", 
        "tags": [
            "Arugula", 
            "Date Night", 
            "Fall", 
            "Freezer Friendly", 
            "Italian", 
            "Meat", 
            "Pasta", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/10/broken-pasta-with-pork-ragu/", 
        "title": "broken pasta with pork ragu", 
        "directions": [
            "Prepare pork: Use a sharp knife to remove the thick skin from the pork, but not trimming off all the fat — leave a thin sheen. Season generously with salt and place in fridge until ready to use — overnight is ideal but a few hours will cut it as well.\nBraise the pork: Heat your oven to 350 degrees. Heat a deep saucepan or Dutch oven over medium-high and add 2 tablespoons of the olive oil. When it shimmers, gently cook the onion, celery and fennel until they begin to soften, about 10 minutes. Add the stock and thyme and bring to a simmer, then season well with salt and pepper.", 
            "Rinse pork to remove excess salt, dry with a paper towel and add to seasoned broth. Cover and place in the oven for 90 minutes or more, until the meat just begins to pull away from the bone.\nAllow both meat and broth to cool in the braise out of the oven for 30 minutes, or until you can touch the meat with your hands. Remove the pork and gently pull the meat from the bone, then tear the chunks into bite-size shreds. Place these in a large bowl.\nStrain the braising liquid, pouring enough of it over the pork to barely cover it and keep it from drying out.", 
            "Pour the rest back into the pot, simmering it until it is reduced by half. Add pork and cooking liquid that has covered it, and warm it back to a simmer. Taste and adjust seasonings, adding more salt and pepper if needed. Add the butter and stir to emulsify.\nBring large pot of well-salted water to boil. Cook pasta until al dente, or usually a minute shy of package directions. Drain and add to the pork ragu, simmering for 1 minute.  Add the lemon juice, half the cheese and parsley, if using. Ladle into wide pasta bowls with and top with arugula and remaining cheese. We enjoyed this with an extra lemon wedge on the side.’\nDo ahead: Should you wish to freeze this — we froze half and I was overjoyed to find it again last month — shred the pork and return it to the reduced cooking liquid, stopping short of the butter; freeze them together in a bag. Once defrosted, rewarm to a simmer, add a splash or two of pasta cooking water if needed to loosen it, and then the butter (this ensures you get the most flavor from it). Add freshly cooked pasta, lemon and parmesan from here."
        ], 
        "date": "2016-10-24T12:26:38+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/cabbage-and-sausage-casserole1.jpg?w=640", 
        "tags": [
            "Cabbage", 
            "Casserole", 
            "French", 
            "Meat", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/01/cabbage-and-sausage-casserole/", 
        "title": "cabbage and sausage casserole", 
        "directions": [
            "Heat oven to 300 degrees. Bring a large pot of salted water to a boil and butter a 9-by-13-by-2-inch baking dish. If using sausages, remove casings and discard them.", 
            "Place cabbage in boiling water, cover, and let water come back to the boil. Uncover and boil for 3 minutes. Drain cabbage in a colander and run cold water over it to stop cooking. Drain well. ", 
            "Put about 1/3 of the cabbage in buttered dish and cover with 1/2 the meat. Sprinkle with salt and pepper and dot with butter. Repeat, ending with a final layer of cabbage, and dot top with butter.", 
            "Cover dish tightly with a layer of parchment paper (commenters who skipped the parchment said that their vegetables discolored against the foil), then top with a lid or a layer of aluminum foil. Cook for about 2 1/2 hours, until cabbage is soft and sweet, and top is lightly browned. After 2 hours, uncover the dish; if there is a lot of liquid in the bottom, leave uncovered for the rest of the cooking time. If not, re-cover and finish cooking. In our case, there was not a lot of liquid but I hoped to get a little color on the top so left it uncovered for the remaining time."
        ], 
        "date": "2016-01-19T12:03:35+00:00"
    }, 
    {
        "ingredient_list": [
            "6 large eggs", 
            "12 small romaine lettuce leaves", 
            "2 to 3 tablespoons mayo (2 is suggested but 3 will make a creamier filling)", 
            "2 teaspoons smooth Dijon mustard", 
            "1/4 teaspoon Worcestershire sauce (optional)", 
            "1/2 teaspoon lemon juice", 
            "2 tablespoons chopped fresh flat-leaf parsley", 
            "Salt and freshly ground black pepper", 
            "1 tablespoon olive oil", 
            "1 anchovy fillet, minced", 
            "1 small clove garlic, minced", 
            "1/4 teaspoon grated lemon zest", 
            "1/4 cups (30 grams) panko bread crumbs", 
            "2 tablespoons freshly grated Parmesan cheese or more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/caesar-salad-deviled-eggs.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Easter", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2011/12/caesar-salad-deviled-eggs/", 
        "title": "caesar salad deviled eggs", 
        "directions": [
            "Place the eggs in a saucepan and cover with water. Bring to a boil over high heat. Once water begins to boil, reduce it to medium-low and simmer eggs for exactly 10 minutes. Drain eggs and cover with cold water. Sitting them in ice water will help the eggs chill more quickly.", 
            "Do ahead: As I discovered giving your eggs two to four days to rest in the fridge ensures that they peel more easily. If you’ve got time, do this now.", 
            "Arrange 12 small lettuce leaves on a serving platter. Carefully peel the eggs and cut in half lengthwise. Remove the yolks and place them in a small bowl. Arrange the whites on leaves. Mash the yolks with the mayo, Dijon, Worcestershire (if using), lemon juice and 1 tablespoon of the parsley until smooth. Season generously with salt and freshly ground black pepper. Set the filling aside.", 
            "In a small skillet, heat the olive oil over medium heat. Add the anchovy and garlic and cook, stirring, until the anchovy begins to dissolve into the oil, about 1 minute. Add the lemon zest and bread crumbs and saute them until golden, about 2 to 3 minutes. Stir in Parmesan and set crumbs aside.", 
            "When you’re ready to serve the eggs, spoon the yolk mixture back into the cavities of the egg whites, mounding it slightly in the center. (To make extra-cute eggs, you can pipe the filling with a star tip.) Sprinkle each egg with some of the crumb mixture (about 1 teaspoon), allowing some to spill onto the lettuce cups. Garnish with remaining chopped parsley and serve."
        ], 
        "date": "2011-12-12T13:57:38+00:00"
    }, 
    {
        "ingredient_list": [
            "6 tablespoons (3/4 stick) unsalted butter", 
            "2 pounds fresh shallots, peeled, with roots intact", 
            "3 tablespoons sugar", 
            "3 tablespoons good red wine vinegar", 
            "1/2 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "2 tablespoons chopped fresh flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/caramelized-shallots1.jpg?w=640", 
        "tags": [
            "Easter", 
            "Onions", 
            "Photo", 
            "Spring", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/04/caramelized-shallots/", 
        "title": "caramelized shallots", 
        "directions": [
            "Preheat the oven to 400 degrees F.", 
            "Melt the butter in a 12-inch ovenproof* saute pan, add the shallots and sugar, and toss to coat. Cook over medium heat for 10 minutes, tossing occasionally, until the shallots start to brown. Add the vinegar, salt, and pepper and toss well.", 
            "Place the saute pan in the oven and roast for 15 to 30 minutes, depending on the size of the shallots, until they are tender. Season, to taste, sprinkle with parsley, and serve hot.", 
            "* If yours, like mine, is not ovenproof, it works to start this dish in your frying pan then scrape the shallots and sauce into a baking dish when it’s ready to go in the oven."
        ], 
        "date": "2008-04-14T10:05:43+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/3 cups (290 grams) all-purpose flour", 
            "3/4 teaspoon (5 grams) table or fine sea salt", 
            "2 teaspoons (10 grams) baking powder (I prefer aluminum-free)", 
            "1 1/4 teaspoon ground cinnamon", 
            "1/4 teaspoon ground or a bunch of gratings of whole nutmeg", 
            "1/8 teaspoon ground cloves", 
            "1/2 cup (120 ml) olive oil", 
            "3/4 cup (145 grams) dark brown sugar", 
            "2 large eggs", 
            "1 cup cider (235 ml, see buying suggestions below)", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 1/2 cups packed coarsely grated carrots from about 9 ounces (2 to 2 1/2 meaty/large or 4 to 5 slim; about 255 grams) whole carrots", 
            "Olive oil or nonstick cooking spray for baking pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/carrot-cake-with-cider-and-olive-oil1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Carrots", 
            "Dairy-Free", 
            "Everyday Cakes", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/10/carrot-cake-with-cider-and-olive-oil/", 
        "title": "carrot cake with cider and olive oil", 
        "directions": [
            "Heat oven to 350 degrees. Coat a 9×5-inch loaf pan* with olive oil or a nonstick cooking spray. If yours is old and you’re nervous about the cake sticking, it cannot hurt to line yours with a fitted rectangle of parchment paper.", 
            "In a large bowl, whisk together flour, salt, baking powder, cinnamon, nutmeg and cloves. In a medium bowl, whisk together olive oil, brown sugar, eggs, cider and vanilla. Stir grated carrots into wet ingredients until evenly coated, then stir wet ingredients into dry just until no floury bits remain. ", 
            "Pour into prepared pan and bake for 60 to 70 minutes, until a skewer inserted into the center comes out batter-free. Let cool in loaf pan for 20 to 30 minutes, then remove from pan and cool the rest of the way on a rack. Loaf should keep at room temperature for a few days, and longer in the fridge. It’s even more moist on the second day.", 
            "Whatever you do, definitely avoid making a cream cheese frosting-like spread whipped together from 4 ounces of softened cream cheese, 2 tablespoons softened unsalted butter, 1/2 teaspoon vanilla extra and 6 tablespoons powdered sugar, some of which can be replaced with honey or maple syrup but will make for a softer spread. It will unquestionably compromise this cake’s dairy-free status. It might be dangerously good.", 
            "Notes: "
        ], 
        "date": "2014-10-16T11:58:27+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake layers", 
            "1 cup (125 grams) all-purpose flour", 
            "3/4 cup (95 grams) finely ground graham cracker crumbs, plus extra for decoration if you wish", 
            "3/4 teaspoon baking soda", 
            "1 1/2 teaspoons baking powder", 
            "3/4 teaspoon fine sea or table salt", 
            "1 1/2 teaspoons ground cinnamon", 
            "1/4 teaspoon ground nutmeg or a bunch of gratings of fresh", 
            "3/4 teaspoon ground ginger", 
            "3/4 cup (150 grams) granulated sugar", 
            "3/4 cup (145 grams) dark brown sugar", 
            "3/4 cup plus 3 tablespoons (210 grams) neutral oil or melted butter (i.e. 1 tablespoon short of 1 cup)", 
            "3 large eggs", 
            "3 cups (about 12 3/4 ounces or 360 grams) peeled and grated carrots (2 cups = 8.5 ounces, peeled/grated)", 
            "Filling", 
            "2 (8-ounce) packages cream cheese, softened (455 grams total)", 
            "1 cup (2 sticks, 8 ounces or 230 grams) unsalted butter, at room temperature", 
            "2 cups (240 grams) powdered sugar, sifted if lumpy", 
            "2 teaspoons vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/carrot-graham-layer-cake1.jpg?w=640", 
        "tags": [
            "Carrots", 
            "Celebration Cakes", 
            "Easter", 
            "Photo", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2015/03/carrot-graham-layer-cake/", 
        "title": "carrot graham layer cake", 
        "directions": [
            "Make the cake: Heat oven to 350°F (175°C). Line three 9-inch cake pans with a fitted round of parchment paper and coat with a nonstick cooking spray. Don’t have three matching cake pans? Me neither. As soon as you finish baking and unmolding the first cake layer, wipe out the baking pan, put down a new round of parchment and coat the pan with spray before using it again. ", 
            "In a large bowl, whisk together flour, graham crumbs, baking soda, baking powder, salt, cinnamon, nutmeg and ginger. In a medium-sized bowl, whisk (yes, you can use the same one) together the sugars, oil and eggs until smooth. Stir in grated carrots. Pour wet ingredients into dry and stir until flour just disappears. ", 
            "Pour batter evenly between three prepared baking pans. Bake each layer for 15 to 18 minutes, until a tester comes out clean. Cake will seem soft and likely still sticky on top. Let rest in cake pans for 5 minutes on a cooling rack, then run a knife around the edges of the first cake layer to ensure no parts are sticking to the sides, flip cake out onto cooling rack, remove parchment paper and flip back right-side-up on another cooling rack. Repeat with remaining layers and let the cake layers cool completely before filling. To hurry the cooling process along, and to make this very soft cake easier to handle, you can place cake layers in your freezer until cool and slightly firm. ", 
            "Fill the cake With an electric mixer, beat cream cheese and butter together until smooth and fluffy. Beat in powdered sugar, a little at a time. Beat in vanilla until combined. ", 
            "Arrange first cake layer on a cake plate or stand. Spread top with frosting; repeat twice with remaining layers. If desired, sprinkle top decoratively with extra graham crumbs — I used a cookie cutter to make a loose outline of a flower shape on mine. Let cake chill until serving. ", 
            "Do ahead: Cake is wonderful on the first day, and even more moist on the second and third and I’ve never met a person who had one last four days. Keep in fridge. To prepare further in advance, you can make the cake layers, wrap them well and freeze them until you’re ready to fill the cake. "
        ], 
        "date": "2015-03-26T12:03:35+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/4 cups (100 grams) rolled oats (be sure that they’re labeled gluten-free if needed; I prefer old-fashioned but any will work)", 
            "1/4 cup (20 grams) rolled oats, finely ground, or 1/4 cup oat flour", 
            "3/4 cup (60 grams) dried unsweetened shredded coconut (I used a medium grind)", 
            "1/3 cup (65 grams) uncooked millet (see alternatives up top)", 
            "1/2 teaspoon fine sea salt", 
            "1/4 teaspoon ground cinnamon (optional)", 
            "1 cup (about 140 grams) chopped dried fruit", 
            "1 cup (170 grams) chopped dark chocolate or chocolate chips", 
            "1/4 cup (65 grams) sunflower seed butter", 
            "1/4 cup olive oil or coconut oil, warmed until liquefied", 
            "1/4 cup (about 85 grams) maple syrup, honey or golden syrup"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/chocolate-chunk-granola-bars1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Dairy-Free", 
            "Freezer Friendly", 
            "Gluten-Free", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2015/06/chocolate-chunk-granola-bars/", 
        "title": "chocolate chunk granola bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Line an 8-by-8 inch square pan with two sheets of parchment paper, extending each up two sides, forming a “sling” for your bars to make them easy to remove.", 
            "In a large bowl, combine oats, oat flour or ground oats, coconut, millet, salt, cinnamon (if using), dried fruit and chocolate. In a separate, small bowl, whisk together sunflower seed butter, oil and sweetener of choice until smooth. Pour wet mixture into dry and stir until combined. Transfer to prepared pan, spreading until flat, then use an addition square of parchment paper to protect your hand as you press, press, press the ingredients tightly into all corners of the pan, until they can be pressed no flatter.", 
            "Bake for 25 to 30 minutes, until the tops are golden and the edges are light brown. Let cool completely before cutting; they’ll be even easier to cut without crumbling if you chill them in the fridge first, so feel free to cool them there. Once cool, use the parchment “sling” to lift bars from pan and transfer to cutting board. Use a sharp, serrated knife in a very gentle sawing motion to cut bars into desired sizes (I usually go for 16 2×2-inch squares). ", 
            "Bars will keep at room temperature for up to a week in an airtight container, but I prefer to freeze them, individually wrapped, until needed. They only need to be out of the freezer for about an hour to fully defrost. "
        ], 
        "date": "2015-06-25T11:25:21+00:00"
    }, 
    {
        "ingredient_list": [
            "Noodles and vegetables", 
            "8 ounces buckwheat noodles", 
            "A mixture of raw vegetables of your choice (such as carrots, cucumbers, radishes or daikon; see Note for more suggestions)", 
            "Sauce", 
            "2 to 3 tablespoons miso (red is recommend; white would be just fine)", 
            "1 2-inch piece ginger, finely grated", 
            "2 teaspoons granulated sugar", 
            "1/8 teaspoon ground cayenne, or to taste", 
            "2 tablespoons mirin", 
            "1 tablespoon soy sauce", 
            "2 tablespoons lime juice (from about 1 lime), plus lime wedges for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/cold-noodles-with-miso-lime-and-ginger1.jpg?w=640", 
        "tags": [
            "Citrus", 
            "Cucumber", 
            "Japanese", 
            "Lunch", 
            "Pasta", 
            "Photo", 
            "Radishes", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/08/cold-noodles-with-miso-lime-and-ginger/", 
        "title": "cold noodles with miso, lime and ginger", 
        "directions": [
            "Cook the noodles in well-salted water until tender but firm for the time recommended on your package of noodles. What, your package is only in Japanese, like mine? Most are cooked between 5 and 8 minutes, so test at 5 and add more minutes if needed.", 
            "Meanwhile, grate, julienne or thinly slice vegetables of your choice.", 
            "Drain noodles and run cold water over them to cool. Drain again, shaking out excess water.", 
            "Make the dressing by whisking the smaller amount of miso plus the remaining sauce ingredients in a bowl. Taste and adjust to make sweeter (with more sugar) or more intense and salty (with the last tablespoon of miso) if desired. ", 
            "Divide noodles among four bowls; toss each with a tablespoon of the sauce, plus more to taste. Top with vegetables and extra droplets of sauce. Serve with lime wedges.", 
            "The leftovers won’t keep well with the sauce on. It’s best to keep it in one container and the noodles and vegetables in another, combining when needed, if you have extras. ", 
            "Notes:"
        ], 
        "date": "2014-08-04T12:14:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon butter", 
            "3 cups fresh corn (cut from 3 small-to-average cobs)", 
            "1 1/2 cup thinly sliced scallions (both white and green parts from a 4-ounce bundle)", 
            "8 cups whole wheat, country or French bread in 1-inch cubes (weight will vary from 10 to 14 ounces, depending on bread type)", 
            "2 cups (6 ounces) coarsely grated sharp cheddar", 
            "1 cup (2 ounces) finely grated parmesan", 
            "9 large eggs", 
            "2 tablespoons mayonnaise (optional, see Note up top)", 
            "2 3/4 cups milk", 
            "1 teaspoon table salt or 2 teaspoons of a coarse sea salt", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/corn-cheddar-and-scallion-strata1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Corn", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/corn-cheddar-and-scallion-strata/", 
        "title": "corn, cheddar and scallion strata", 
        "directions": [
            "Generously butter a 3-quart baking dish (a lasagna or 9×13-inch pan works well here too). Toss corn and scallions together in a medium bowl. Combine cheeses in another bowl. In a large bowl, gently beat eggs and mayo together, then whisk in milk, salt and lots (or, if measuring, 1/2 teaspoon) of freshly ground black pepper. Spread one-third of bread cubes in prepared baking dish — it will not fully cover bottom of dish; this is fine. Add one-third of corn, then cheese mixture. Repeat layering twice with remaining bread, corn and cheese. Pour egg mixture evenly over strata. Cover with plastic wrap and refrigerate for at least 8 hours or up to 1 day.", 
            "When ready to bake, heat oven to 350 degrees F. Bake strata, uncovered, until puffed, golden brown and cooked through, about 45 to 55 minutes. Let stand 5 minutes before serving. ", 
            "Do ahead: Strata keeps baked in the fridge for 4 days or longer in the freezer, wrapped well. It reheats wonderfully, either from the fridge or freezer and holds up well in lunch boxes."
        ], 
        "date": "2014-09-03T11:00:41+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (100 grams) coarse yellow cornmeal", 
            "3/4 cup (100 grams) all-purpose flour", 
            "1 teaspoon baking powder", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon kosher salt", 
            "1 tablespoon (15 ml) molasses", 
            "1 cup (235 ml) buttermilk, well-shaken", 
            "4 tablespoons (55 grams) melted unsalted butter", 
            "1 large egg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/cornbread-waffles1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Put An Egg On It", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2017/03/cornbread-waffles/", 
        "title": "cornbread waffles", 
        "directions": [
            "Combine cornmeal, flour, baking powder, baking soda and salt in the bottom of a medium bowl. In a smaller bowl, whisk molasses, butter, buttermilk and egg until combined. Pour into dry ingredients and stir to combine. Let batter rest for 10 minutes. Use this time to place a oven-safe cooling rack over a tray and heat oven to 200 degrees. Heat waffle iron according to manufacturer’s instructions; I found a medium heat just fine here.", 
            "Brush waffle iron with melted butter or coat with nonstick spray. Ladle in waffle batter, 1/4 cup at a time. (It makes 4 or so -inch finished waffles, cute ones made for an egg on top.) Cook until lightly browned and carefully transfer to rack in oven. They’ll crisp as they set. Repeat with remaining batter. You should get 8 waffles out of this, ideal for 2 per person.\nWaffles keep well for 4 days in fridge and longer in freezer. Waffles re-crisp and come back to life in a warm oven."
        ], 
        "date": "2017-03-25T08:57:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (210 grams) dried farro", 
            "3 cups water or broth", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "Olive oil", 
            "2 1/4 to 2 1/2 pound (1 to 1 1/8 kgs) head of cauliflower, cut into small florets", 
            "2 tablespoons finely chopped fresh sage leaves", 
            "2 tablespoons capers (brine-packed), drained", 
            "2 large or 3 regular cloves garlic, minced", 
            "1/2 teaspoon finely grated lemon zest", 
            "Crushed red pepper flakes, to taste", 
            "2 cups (6 ounces or 170 grams) coarsely grated, lightly packed Italian Fontina (Val d’Aosta variety, if you can find it) (buy about 8 ounces with rind)", 
            "1/2 cup (125 grams) ricotta cheese", 
            "1/2 cup (25 grams) panko (plain Japanese-style breadcrumbs)", 
            "1/3 cup (30 grams) finely grated pecorino romano cheese", 
            "2 tablespoons finely chopped fresh parsley leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/01/crusty-baked-cauliflower-and-farro.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Cauliflower", 
            "Freezer Friendly", 
            "Grain/Rice", 
            "Photo", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2017/01/crusty-baked-cauliflower-and-farro/", 
        "title": "crusty baked cauliflower and farro", 
        "directions": [
            "Cook farro: Rinse and drain farro. There are many, many ways to cook farro and any of them work here. You can follow the package directions on any farro you buy for best results.", 
            "On the stove: If you plan to cook this on the stove and want to save time, you can presoak the grains overnight in their 3 cups of liquid and they should then cook in only 10 minutes of simmering. Otherwise, simmer the farro in water or broth for about 30 minutes, until quite tender. Drain any excess liquid. Transfer farro to large bowl.\nIn a rice-cooker: I cook mine on the quick setting and have been very happy with the results. Drain any excess liquid once the farro is tender. Transfer farro to large bowl.\nMeanwhile, parcook cauliflower:\nIn the oven: Heat oven to 425 degrees. Brush a large baking sheet with 2 tablespoons olive oil. Spread florets in one layer, drizzle with 1 more tablespoon olive oil and sprinkle with salt and freshly ground black pepper. Roast for 20 minutes until lightly browned and crisp-tender (they will finish baking with the farro). Reduce heat to 400 degrees.", 
            "One the stove: Heat 2 tablespoons olive oil in a large saute pan over medium-high heat. Add half the cauliflower and cook, tossing occasionally, until lightly browned and tender, about 6 to 7 minutes. Add to bowl with farro. Repeat with more olive oil and second half of cauliflower, then add to bowl. Heat oven to 400 degrees.\nAssemble casserole: Add the sage, capers, garlic, lemon zest, red pepper flakes, 1 teaspoon salt and 1/2 teaspoon black pepper to cauliflower and farro and stir to combine. Stir in fontina. Transfer half of the mixture to an oiled 10-inch ovenproof frying pan or equivalent baking dish. Dollop rounded tablespoons of ricotta all over. Sprinkle remaining cauliflower and farro over the ricotta, leaving the pockets of it undisturbed.", 
            "In a small dish, combine panko with pecorino, parlsey and 1 tablespoon olive oil until evenly mixed. Sprinkle over cauliflower and farro.", 
            "Bake casserole: For 20 minutes, until browned and crusty on top. Dig in.\nDo ahead: Farro can be cooked up to 3 days in advance, kept in an airtight container in fridge. Cauliflower can be cooked 2 days in advance. Casserole can be assembled and baked a day later, easily, although the crumbs might lose their crisp from absorbing the moisture below if not added right before baking. Casserole keeps for several days in fridge and longer in freezer."
        ], 
        "date": "2017-01-13T12:58:52+00:00"
    }, 
    {
        "ingredient_list": [
            "For pork", 
            "1 pound solid piece boneless pork butt (shoulder) or pork tenderloin", 
            "1/4 cup hoisin sauce", 
            "1/4 cup soy sauce (low-sodium is best here)", 
            "1/4 cup Chinese rice wine or sake", 
            "1 tablespoon finely chopped peeled fresh ginger", 
            "1 teaspoon finely chopped garlic", 
            "1/2 teaspoon salt (see Note below)", 
            "For dressing", 
            "3/4 cup seasoned rice vinegar", 
            "1/2 cup peanut or vegetable oil**", 
            "3 tablespoons fresh lime juice", 
            "3 tablespoons finely grated peeled fresh ginger", 
            "1 large fresh jalapeno chile, seeded and minced", 
            "For salad", 
            "8 oz very thin bean-thread noodles (also known as cellophane, glass, or mung bean noodles)", 
            "3/4 lb Chinese long beans (1 bunch) or green beans, trimmed and cut into 3-inch pieces", 
            "1 seedless cucumber (usually plastic-wrapped; about 1 lb), halved lengthwise and sliced diagonally 1/8 inch thick", 
            "1 bunch scallions, cut into matchsticks", 
            "1 firm-ripe mango, peeled, pitted, and thinly sliced", 
            "2 thin carrots, cut into 1/8-inch-thick matchsticks", 
            "1/2 cup loosely packed fresh cilantro leaves", 
            "1/2 cup loosely packed fresh mint leaves", 
            "1/2 cup loosely packed fresh small basil leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/05/cellophane-noodle-salad-with-roast-pork.jpg?w=753", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Salad", 
            "Vietnamese"
        ], 
        "url": "https://smittenkitchen.com/2007/05/deb-1-mandoline-0/", 
        "title": "cellophane noodle salad with roast pork", 
        "directions": [
            "Prepare pork:  Cut pork along the grain into long 1 1/2- to 2-inch-wide strips. Remove and discard any sinew but do not trim fat. Transfer pork to a large sealable plastic bag. Stir together remaining pork ingredients in a small bowl until combined well. Add to pork and turn to coat, then squeeze bag to eliminate as much air as possible and seal. Marinate pork, chilled, at least 4 hours but no longer than 24.", 
            "Roast pork: Put oven rack in lower third of oven and preheat oven to 375°F. Put 1/2 inch water in a 13- by 9-inch roasting pan and place a metal rack across top of pan (rack should not touch water). ", 
            "Remove pork from marinade, reserving marinade, and arrange pork strips 1 inch apart on rack. Roast in oven 15 minutes.", 
            "Meanwhile, bring marinade to a boil in a 1-quart saucepan, then boil 1 minute (marinade may look curdled). Remove from heat.", 
            "Brush both sides of pork with some marinade and roast 10 minutes more. Generously brush both sides of pork with marinade again and roast, basting 2 or 3 times, 10 minutes more. I recommend brushing it as many times as it takes to use the marinade up; you won’t regret it.", 
            "Increase oven temperature to 400°F and roast pork until strips are mahogany-colored and caramelized on edges, 10 to 15 minutes more (pork shoulder will need the most time, tenderloin the least; totally cooking time will be about 50 minutes). Transfer to a cutting board and let stand, loosely covered with foil, 10 minutes.", 
            "Make dressing while pork roasts:  Blend together all dressing ingredients in a blender until smooth. (See Note below about an alternate dressing.)", 
            "Cook noodles and beans while pork finishes roasting: Soak noodles in cold water to cover until pliable, about 15 minutes, then drain in a colander. Cut noodles in half with kitchen shears.", 
            "Cook beans in a 5- to 6-quart pot of boiling salted water, uncovered, until crisp-tender, 4 to 5 minutes. Transfer with a skimmer or slotted spoon to a large bowl of ice and cold water to stop cooking, reserving cooking liquid in pot. Drain beans and pat dry.", 
            "Return bean-cooking liquid to a boil, then cook noodles, uncovered, stirring occasionally, until just tender, about 2 minutes. Drain noodles in colander and rinse under cold water to stop cooking. Drain noodles again, then spread out on paper towels and pat dry.", 
            "Assemble salad:  Cut as much pork as desired for salad across the grain into 1/4-inch-thick slices. Toss noodles with 1/4 cup dressing in a bowl. Toss long beans with 2 tablespoons dressing in another bowl. Arrange pork, noodles, beans, and remaining salad ingredients on a large platter. Drizzle with some of dressing and serve remaining dressing on the side.", 
            "Many notes (Updated 1/10/14):"
        ], 
        "date": "2007-05-21T12:37:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour", 
            "3/4 teaspoon ground cinnamon", 
            "1 tablespoon ground ginger", 
            "1/8 teaspoon ground cloves", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1 1/2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/4 teaspoon fine sea or table salt", 
            "1/2 cup buttermilk, yogurt thinned with a little milk, fresh apple cider or even stout beer", 
            "1/2 cup molasses", 
            "1/2 cup dark brown sugar, packed", 
            "1/4 cup granulated sugar", 
            "1 large egg", 
            "3 tablespoons butter, melted, plus extra for brushing waffle iron", 
            "Powdered sugar for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/deep-dark-gingerbread-waffles11.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Christmas", 
            "Photo", 
            "Waffles", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/deep-dark-gingerbread-waffles/", 
        "title": "deep dark gingerbread waffles", 
        "directions": [
            "In a large bowl, whisk together the flour, cinnamon, ginger, cloves, nutmeg, baking powder, baking soda and salt. In a medium bowl, whisk together the buttermilk, molasses, sugars, egg and butter until combined. The butter will likely firm up and make little white splotches throughout; this is a-okay. Pour the wet into the dry ingredients and stir until just combined. ", 
            "Heat waffle iron to a middle heat. Either brush waffle iron with melted butter or spray it lightly with a nonstick cooking spray. Ladle gingerbread batter into waffle iron until they’re about 3/4 filled out. Cook according to manufacturer’s directions. In my waffle iron, I like to cook them 1 to 2 minutes more.", 
            "To remove waffles: Open waffle iron. Wait about 30 seconds, giving them a chance to steam off a little. With tongs in one hand and a small spatula in the other, gently, carefully lift corners of each waffle section enough to slide the spatula underneath, then lift and slide some more until you can get the section out. Curse Deb, because these waffles are very sticky and eager to tear. Trust Deb, that they will be worth it. Spread them on a tray in a single layer to let cool slightly; within 1 minute, they should be crisp to the touch and easier to lift. Repeat with remaining batter. Try not to stack waffles — even though they’re firm, they will stick.", 
            "Serve immediately, dusted with powdered sugar and, if you’re feeling fancy, a dollop of barely or unsweetened whipped cream or crème fraîche."
        ], 
        "date": "2014-12-18T11:54:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound salt pork, pancetta or bacon, diced", 
            "1 large onion, finely diced", 
            "3 shallots, chopped", 
            "4 tablespoons butter, as needed", 
            "2 pounds beef chuck, in 1-inch cubes", 
            "2 tablespoons flour", 
            "Salt and freshly ground black pepper", 
            "1/2 cup Cognac (see Note)", 
            "2 cups unsalted beef stock", 
            "1/2 cup smooth Dijon mustard", 
            "4 tablespoons coarse Dijon or Pommery mustard (see Note)", 
            "4 medium carrots, peeled and cut into half-moon slices", 
            "1/2 pound mushrooms, stemmed, cleaned and quartered", 
            "1/4 cup red wine (see Note)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/dijon-and-cognac-beef-stew.jpg?w=750", 
        "tags": [
            "Beef", 
            "Date Night", 
            "French", 
            "Photo", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/02/dijon-and-cognac-beef-stew/", 
        "title": "dijon and cognac beef stew", 
        "directions": [
            "Place salt pork in a Dutch oven or a large heavy kettle over low heat, and cook until fat is rendered. Remove solid pieces with a slotted spoon, and save for another use, like your salad, vegetables or, uh, snacking. Raise heat to medium-low, and add onion and shallots. Cook until softened but not browned, about 10 to 15 minutes. Use a slotted spoon to transfer to a large bowl.", 
            "If necessary, add 2 tablespoons butter to the pan to augment fat. Dust beef cubes with flour, and season lightly with salt and more generously with pepper. Shake off excess flour, and place half the cubes in the pan. Cook over medium-high heat until well browned, almost crusty, on all sides, then transfer to a bowl with onions. Repeat with remaining beef.", 
            "Add Cognac to the empty pan, and cook, stirring, until the bottom is deglazed and any crusted-on bits come loose. Add stock, smooth Dijon mustard and 1 tablespoon coarse or Pommery mustard. Whisk to blend, then return meat and onion mixture to pan. Lower heat, cover pan partway, and simmer gently until meat is very tender, about 1 1/4 hours.", 
            "Add carrots, and continue simmering for 40 minutes, or until slices are tender. As they cook, heat 2 tablespoons butter in medium skillet over medium-high heat, and sauté mushrooms until browned and tender. Stir mushrooms into stew along with remaining mustard and red wine. Simmer 5 minutes, then taste, and adjust seasoning. Serve hot."
        ], 
        "date": "2014-02-24T12:16:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups whole milk", 
            "2 tablespoons granulated sugar", 
            "2 teaspoons (10 grams) crumbled fresh yeast or 1 teaspoon active or instant dry yeast", 
            "2 cups (240 grams) all-purpose flour, sifted", 
            "1/2 teaspoon finely grated nutmeg", 
            "1/4 teaspoon ground cloves", 
            "1/4 teaspoon fine sea salt", 
            "3 large eggs, separated", 
            "7 tablespoons (100 grams) unsalted butter, melted", 
            "1 teaspoon vanilla extract or the seeds from half a vanilla bean", 
            "2 tablespoons dark rum, brandy or bourbon (optional)", 
            "Powdered sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/eggnog-waffles1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Gift Guides", 
            "Photo", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2015/12/eggnog-waffles-a-few-favorite-kitchen-things/", 
        "title": "eggnog waffles + a few favorite kitchen things", 
        "directions": [
            "Combine milk and granulated sugar and heat until lukewarm, no more than 116 degrees F. Stir in yeast and set aside for 5 minutes. ", 
            "Meanwhile, whisk flour, nutmeg, cloves and salt together in a large bowl. Create a well in the center and pour in the milk-yeast mixture, the 3 yolks, butter, vanilla and rum. Mix until you have a smooth batter. ", 
            "Place egg whites in a clean bowl and beat with an electric mixer until stiff peaks form. Fold egg whites batter. ", 
            "Let batter stand at room temperature for 30 minutes, then cook according to your waffle-maker’s instructions. ", 
            "You can keep waffles warm in 225 degrees F oven until needed.  Dust with powdered sugar before serving."
        ], 
        "date": "2015-12-12T08:16:02+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup warm water (about 105 to 110 degrees, so not too hot)", 
            "1 packet (1/4 ounce, 7 grams or 2 1/4 teaspoons) active dry yeast", 
            "2 cups milk, warmed (again, not too hot", 
            "1 stick (4 ounces or 115 grams) unsalted butter, melted and cooled until lukewarm", 
            "1 teaspoon table salt", 
            "1 teaspoon granulated sugar", 
            "2 cups (250 grams) all-purpose flour", 
            "2 large eggs", 
            "1/4 teaspoon baking soda", 
            "Oil or melted butter for waffle iron", 
            "Powdered sugar, syrup or berries for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/essential-raised-waffles1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2013/05/essential-raised-waffles/", 
        "title": "essential raised waffles", 
        "directions": [
            "The night before: Pour warm water in the bottom of a large (larger than you think you’ll need, because the batter will rise a lot) bowl. Sprinkle yeast on top and let it dissolve and foam ever-so-slightly for 15 minutes. Stir in milk, butter, salt, sugar and flour — I do a little bit of wet ingredients then a little bit of dry, back and forth, to avoid forming lumps. If lumps form, you can mostly whisk them out. ", 
            "Cover bowl with plastic wrap and set out on counter (see Note up top for debate on this) overnight.", 
            "The next morning, whisk in eggs and baking soda until smooth. Heat waffle iron** (a thinner one is better than a Belgian-style one, as these will not rise enough to fill a tall one out) and coat lightly with butter or oil. Ladle in 1/2 to 3/4-cup batter per waffle batch. The batter will be very thin and will spread a lot in the pan, so err on the side of underfilled until you figure out the right amount. Repeat with remaining batter.", 
            "Waffles can be kept crisp in a warm oven until needed. If you only want to make a few at a time, the batter keeps well in the fridge for several days, says Cunningham.", 
            "** I suspect someone will ask me here about the waffle iron I use. It’s this one. I bought it last year when I was working on a story about breakfast egg sandwiches (which I just realized never ran, hmm) and I wanted to make one with waffles. I honestly do not care for it or any waffle iron I’ve ever owned for one reason, a reason that makes me a little shouty: why don’t waffles irons have removable plates for washing?! I have yet to see one and cleaning them is such an ordeal; this is the only waffle recipe I’ve loved enough that it has felt worth the bother."
        ], 
        "date": "2013-05-07T11:17:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds small (I used Manila) clams", 
            "2 thick slices country or sourdough bread", 
            "1/2 tablespoon olive oil to brush bread (optional)", 
            "2 tablespoons butter", 
            "2 cloves garlic, thinly sliced or minced", 
            "1 large or 2 small shallots, minced or 1/4 cup minced white onion", 
            "Salt and red pepper flakes", 
            "1/2 cup dry white wine", 
            "1 tablespoon chopped fresh herbs — parsley, cilantro, chives or a mix", 
            "1 lemon, in wedges"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/garlic-wine-and-butter-steamed-clams.jpg?w=750", 
        "tags": [
            "Budget", 
            "Date Night", 
            "Photo", 
            "Portuguese", 
            "Quick", 
            "Seafood", 
            "Summer", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/09/garlic-wine-and-butter-steamed-clams/", 
        "title": "garlic wine and butter steamed clams", 
        "directions": [
            "If you think your clams may not be clean, wash them first: Fill a large bowl with cool tap water and place the clams in it. Let them soak for 20 minutes during which they’ll expel any sand and grit.", 
            "While they’re soaking, grill or broil your bread: Dab both sides lightly with olive oil, if using, and grill or broil until well-toasted on both sides.", 
            "Lightly scrub your clams. Discard any with chipped shells.", 
            "In a large saute pan with a lid, melt butter and add garlic, shallots, salt and pepper flakes. Cook for 1 to 2 minutes over medium-high. Add wine — and as soon as it simmers, add all the clams and cover with a lid. In three minutes, almost all should be wide open; discard any that do not open. Transfer to a bowl and ladle cooking liquid over. Scatter with herbs and serve with grilled bread and lemon."
        ], 
        "date": "2016-09-20T11:58:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (120 ml) maple syrup, honey or half of each", 
            "1/2 cup (75 grams) coconut or brown sugar", 
            "1/4 cup (60 ml) water", 
            "1 teaspoon vanilla extract", 
            "1/4 teaspoon fine sea salt", 
            "1 1/2 teaspoons ground cinnamon (but I skipped this)", 
            "3 cups (300 grams) rolled oats (not quick-cooking)", 
            "1 1/4 cups (175 grams) almonds, chopped", 
            "1 1/4 cups (60 grams) unsweetened shredded coconut", 
            "1/2 cup (80 grams) flax seeds or chia seeds, whole or ground", 
            "1/4 cup (35 grams) sesame seeds", 
            "1/2 cup (60 grams) almond or hazelnut flour", 
            "1/3 cup (80 ml) olive, vegetable or coconut oil, or melted butter", 
            "1 large egg white, whisked until frothy"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/04/granola-bark1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Coconut", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2017/04/granola-bark/", 
        "title": "granola bark", 
        "directions": [
            "\nCombine maple syrup, sugar, water, vanilla and salt in a small saucepan and bring to a boil, stirring to dissolve the sugar and salt. Remove from heat and let cool to lukewarm.\nMeanwhile combine cinnamon (if using), oats, almonds, coconut, seeds, almond or hazelnut flour in a large bowl.\nHeat oven to 325 degrees. Line a rimmed half-sheet (13×18-inch) pan with parchment paper or a silicone mat.\nOnce liquid mixture is back to room temperature, whisk in olive oil, which will cool it further, then egg white. Pour over dry ingredients and mix well.", 
            "Spread mixture evenly across the prepared baking sheet. Press down firmly to compact it before baking, using another same-size baking sheet or the bottom of a pot. Bake for 40 to 50 minutes, until dark golden brown, rotating the sheet every 15 minutes to promote even browning. While it bakes, open the oven door a few times to release steam.\nSet on a cooling rack until surface of granola is crisp. Leave oven on. If surface is still tacky to the touch once it has cooled — although I didn’t find this at all — return the pan to the oven and continue baking for another 10 to 15 minutes, checking every 5 minutes. Don’t let it get too dark or it tastes bitter.\nOnce totally cool, break into pieces in store in an airtight container at room temperature for up to 2 weeks, or in the fridge up to 1 month.\n"
        ], 
        "date": "2017-04-17T12:05:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound green beans or haricot vert (skinny ones)", 
            "1/2 a fennel bulb (about 1/2 pound)", 
            "1 stalk celery, trimmed", 
            "1/2 medium red onion", 
            "1 tablespoon lemon juice", 
            "1/4 cup red wine vinegar", 
            "1/4 cup water", 
            "1 tablespoon kosher salt (I use Diamond brand; use less if you’re using Morton or table salt)", 
            "1 1/2 teaspoons sugar", 
            "1/3 cup (about 2 ounces) whole almonds", 
            "2 tablespoons plus 2 teaspoons olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/green-bean-salad-with-fried-almonds.jpg?w=750", 
        "tags": [
            "Easter", 
            "Fennel", 
            "Green Beans", 
            "Photo", 
            "Salad", 
            "Thanksgiving", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/02/green-bean-salad-with-pickled-red-onions-and-fried-almonds/", 
        "title": "green bean salad with fried almonds", 
        "directions": [
            "If you’ve got an adjustable blade slider, time to make it earn its keep! Very thinly slice half your fennel bulb, your celery and your half onion. If you don’t have a fancy slicer, just slice them thinly with a knife. Toss the fennel with lemon juice to prevent browning and also because it makes it extra delicious.", 
            "In a small bowl, whisk together the vinegar, water, salt and sugar together. Add the onions and set them aside for about an hour. If you don’t have an hour, 30 minutes will still pickle them to deliciousness but they will only get better with age.", 
            "Meanwhile, bring a large pot of salted water to boil. Trim and tail green beans, something I just discovered I could do with kitchen shears. For me, it was a time saver. Boil beans until crisp-tender, about 4 to 5 minutes for regular green beans and about 3 minutes for skinny ones (a.k.a. “haricot vert” — what I used). Plunge in an ice water bath. Drain and pat dry. (If you have no patience for the precision of ice water baths, take the green beans out a full minute early as they will continue cooking as they cool.)", 
            "Heat a small heavy skillet to medium heat and add one teaspoon olive oil. Add almonds and toss until lightly browned, 2 to 3 minutes. Season lightly with salt and pepper to taste. Transfer almonds to a plate, let cool, and cut each almond into half or thirds.", 
            "Assemble your salad: Toss green beans with most of fennel, all of celery and half of the pickled red onions. Sprinkle two tablespoons of the red onion pickling liquid and two tablespoons of olive oil over the mixture. Season generously with salt and pepper. Taste, adjust seasonings and ingredient levels to your preferences — we found we wanted more fennel, red onion and pickling liquid.", 
            "Serve, then eat, eat, eat. "
        ], 
        "date": "2011-02-16T21:35:45+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound plain yogurt (regular or lowfat)", 
            "1/4 cup olive oil, plus more for brushing grill", 
            "1 teaspoon lemon zest", 
            "1/4 cup freshly squeezed lemon juice (2 lemons)", 
            "5 tablespoons fresh whole rosemary leaves, chopped", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "2 pounds top round lamb", 
            "1 red onion", 
            "14 ounces Greek yogurt (Ina recommends Fage Total; I recommend whatever you like best, and yes, I use full fat, always)", 
            "1 hothouse cucumber, unpeeled and seeded", 
            "1/4 cup sour cream", 
            "2 tablespoons freshly squeezed lemon juice", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon minced fresh dill", 
            "1 1/2 teaspoons minced garlic", 
            "2 teaspoons kosher salt", 
            "1/2 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/grilled-lamb-kebabs-tzatziki1.jpg?w=500", 
        "tags": [
            "Cucumber", 
            "Date Night", 
            "Greek", 
            "Grilling", 
            "Meat", 
            "Photo", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2009/09/grilled-lamb-kebabs-tzatziki/", 
        "title": "grilled lamb kebabs + tzatziki", 
        "directions": [
            "Place the yogurt in a medium bowl. Grate the cucumber on a box grater (or in your food processor, if you like to get things done in one hundreth of the time!) and squeeze the grated cucumber with your hand to remove some of the liquid. (Pressing it in mesh sieve with a spoon to extract the extra water or wringing it in cheesecloth also work well.) Add it to the yogurt along with the sour cream, lemon juice, vinegar, dill, garlic, salt and pepper and stir. Serve with grilled pita wedges."
        ], 
        "date": "2009-09-14T17:35:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (110 grams) plain yogurt", 
            "A small handful finely chopped leafy fresh herbs (parsley, cilantro, mint, chives, dill or a mix thereof) plus a few roughly chopped, to serve", 
            "1 teaspoon red wine vinegar, or more to taste", 
            "Kosher salt", 
            "Olive oil", 
            "A handful shredded red cabbage to serve (optional)", 
            "Lemon wedges, to serve", 
            "Kosher salt", 
            "1/2 teaspoon cumin seeds or a heaped 1/2 teaspoon ground", 
            "1/2 teaspoon coriander seeds or a heaped 1/2 teaspoon ground", 
            "1/2 teaspoon fennel seeds or a heaped 1/2 teaspoon ground", 
            "1 teaspoon sweet paprika", 
            "2 garlic cloves, minced", 
            "2 tablespoons harissa paste (I just used a small squeeze) or another hot sauce", 
            "1 pound (455 grams) ground lamb, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/homemade-merguez-with-herby-yogurt1.jpg?w=750", 
        "tags": [
            "Lamb", 
            "Middle Eastern", 
            "North African", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/09/homemade-merguez-with-herby-yogurt/", 
        "title": "homemade merguez with herby yogurt", 
        "directions": [
            "\nMake the herby yogurt: Mix the yogurt, finely chopped herbs and vinegar in a small bowl. Season to taste with salt and extra vinegar, if desired. Set aside until needed.\nMake the merguez: If using whole spices, toast them in a dry skillet over medium heat for a few minutes until fragrant. Grind them in a spice grinder or with a mortar and pestle.", 
            "Combine lamb, spices, including paprika, harissa, garlic and 1 teaspoon (Turshen called for 1 1/2, which was very salty and we liked it but probably not for everyone) kosher salt and mix to combine. Form into 12 mounds.\n[Do ahead: You can keep the mixed meat patties and herbed yogurt in the fridge for up to 3 days.]\nHeat a large, heavy skillet over high heat. Coat with olive oil and once it is very hot, add a few sausage mounds. Once they hit the frying pan, flatten them with the back of your spatula. Cook until brown and crispy underneath, then flip and cook for another minute or two. Drain on paper towels. Repeat with remaining meat.\nServe patties warm with herby yogurt and scattered with extra herbs and shredded cabbage, if desired, plus wedges of lemon to squeeze over.\n"
        ], 
        "date": "2016-09-13T12:14:13+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds boneless pork shoulder or pork butt, cut into 2-inch cubes", 
            "1/2 cup orange juice", 
            "1/4 cup lime juice (from about 2 to 3 limes)", 
            "4 cloves garlic, peeled and crushed", 
            "1 teaspoon ground cumin", 
            "1 teaspoon Kosher salt, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/11/homesick-texan-carnitas.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2011/11/homesick-texan-carnitas/", 
        "title": "homesick texan carnitas", 
        "directions": [
            "Place the pork in a large Dutch oven or heavy pot. Add the orange juice, lime juice, garlic, cumin, salt and enough water to just barely cover the meat. Bring the pot to a boil and then reduce the heat to a simmer. Simmer uncovered for two hours. Don’t touch the meat.", 
            "After two hours, increase the heat to medium-high and while occasionally stirring and turning the pieces, continue to cook for about 45 minutes, or until all of the liquid has evaporated, leaving only the rendered pork fat. Let it sizzle in this fat long enough to brown at the edges, turning pieces gently (they’ll be eager to fall apart), only as needed.", 
            "When pork has browned on both sides, it’s ready. Adjust seasonings to taste and serve on warmed tortillas with fixings. "
        ], 
        "date": "2011-11-04T11:09:19+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1/2 small head cabbage, very thinly sliced (1 pound or 5 to 6 cups shreds) which will be easiest on a mandoline if you have one", 
            "4 medium carrots, peeled into ribbons with a vegetable peeler", 
            "5 lacinato kale leaves, ribs removed, leaves cut into thin ribbons", 
            "4 scallions, thinly sliced on an angle", 
            "1 teaspoon kosher salt", 
            "1/2 cup all-purpose flour", 
            "6 large eggs, lightly beaten", 
            "Canola, safflower or peanut oil for frying", 
            "Tangy Sauce", 
            "1/4 cup ketchup", 
            "1 1/2 tablespoons Worcestershire sauce (note: this is not vegetarian)", 
            "1/4 teaspoon dijon mustard", 
            "1 tablespoon rice cooking wine or sake", 
            "1 teaspoon soy sauce", 
            "1 tablespoon honey (use 2 if you like a sweeter sauce)", 
            "1/8 teaspoon ground ginger"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/japanese-vegetable-pancakes.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cabbage", 
            "Carrots", 
            "Japanese", 
            "Kale", 
            "Lunch", 
            "Pancakes", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/05/japanese-cabbage-and-vegetable-pancakes/", 
        "title": "japanese vegetable pancakes", 
        "directions": [
            "Make the pancakes: Toss cabbage, carrot, kale, scallions and salt together in a large bowl. Toss mixture with flour so it coats all of the vegetables. Stir in the eggs. Heat a large heavy skillet on medium-high heat. Coat the bottom with oil and heat that too. ", 
            "To make a large pancake, add 1/4 of the vegetable mixture to the skillet, pressing it out into a 1/2- to 3/4-inch pancake. Gently press the pancake down flat. Cook until the edges beging to brown, about 3 minutes. 30 seconds to 1 minute later, flip the pancake with a large spatula. (If this is terrifying, you can first slide the pancake onto a plate, and, using potholders, reverse it back into the hot skillet.) Cook on the other side until the edges brown, and then again up to a minute more (you can peek to make sure the color is right underneath).", 
            "To make small pancakes, you can use tongs but I seriously find using my fingers and grabbing little piles, letting a little batter drip back into the bowl, and depositing them in piles on the skillet easier, to form 3 to 4 pancakes. Press down gently with a spatula to they flatten slightly, but no need to spread them much. Cook for 3 minutes, or until the edges brown. Flip the pancakes and cook them again until brown underneath. ", 
            "Regardless of pancake size, you can keep them warm on a tray in the oven at 200 to 250 degrees until needed. ", 
            "If desired, make okonomiyaki sauce: Combine all sauce ingredients in a small saucepan and let simmer for 3 to 5 minutes, until smooth and thick. ", 
            "Serve pancakes with sauce and any of the other fixings listed above, from Japanese mayo to scallions and toasted sesame seeds. ", 
            "Do ahead: Extra pancakes will keep in the fridge for a couple days, or can be spread on a tray in the freezer until frozen, then combined in a freezer bag to be stored until needed. Reheat on a baking sheet in a hot oven until crisp again."
        ], 
        "date": "2013-05-15T11:01:47+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 teaspoons (1 7-gram or 1/4-ounce packet) active dry yeast", 
            "1/4 cup (50 grams) granulated sugar", 
            "3/4 cup (180 ml) lukewarm (not hot) milk", 
            "2 large egg yolks", 
            "Few gratings of orange or lemon zest, 1 teaspoon vanilla or 1/2 teaspoon almond extract", 
            "2 tablespoons (1 ounce or 30 grams) butter softened", 
            "2 1/3 cups (290 grams) all-purpose flour", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 egg white, whisked until frothy (for peskier filling method)", 
            "Vegetable oil for deep-frying, and coating bowl", 
            "1/2 to 2/3 cup jam or preserves of your choice", 
            "Powdered sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/jelly-doughnuts1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Doughnut", 
            "Hanukah", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/12/jelly-doughnuts/", 
        "title": "jelly doughnuts", 
        "directions": [
            "Make the dough: In the bottom of a large mixing bowl, combine the yeast, sugar and milk. Let stand for 5 minutes; it should become a little foamy. Whisk in yolks, any zest or extracts you’d like to use, then butter. Don’t worry if the butter doesn’t fully combine. ", 
            "— By hand: Add half of flour and stir with a spoon until combined. Add second half of flour and salt and stir as best as you can with a spoon, then use your hands to knead the dough until it forms a smooth, elastic round, about 5 minutes. Try, if you can, to resist adding extra flour, even if it’s sticky. Extra flour always makes for tougher/dryer doughnuts and breads. Sticky hands and counters are always washable!", 
            "— With a stand mixer: Add half the flour and let the dough hook mix it in slowly, on a low speed. Add second half of flour and salt and let the dough hook bring it together into a rough dough. Run machine for 3 to 4 minutes, letting it knead the dough into a smooth, cohesive mass.", 
            "Both methods: If the dough is already in the bowl, remove it just long enough to lightly oil the bowl. Return dough to bowl, cover with plastic wrap and let rest at room temperature for 1 hour, or in the fridge overnight.", 
            "There are two ways to fill doughnuts: In the easiest method, you fill them after they’re cooked with a piping bag. The filling is usually a little imperfect, off-center or slightly messy, but it takes the least effort by far. With the peskier method, you pre-fill the doughnuts, sealing the edges; the centers will be picture-perfect and neat, but it does take longer to assemble. Both will make you a hero to anyone you make these for, promise.", 
            "— Easiest method: On a lightly floured counter, roll dough to a 1/2-inch thickness. Cut into 2-inch rounds; no need to re-roll scraps unless you wish; I like to keep the odd shapes for getting the hang of frying before cooking the final doughnuts. Or, if you’re vehemently against scraps and re-rolling, you can make small square doughnuts, which are surprisingly cute. Let cut dough rise for another 30 minutes at room temperature, loosely covered with a towel at room temperature, or in the fridge overnight, on an oiled tray, covered loosely with oiled plastic wrap (use this longer rise only if did the 1-hour rise the first time; two overnights is too much for this dough). ", 
            "— Peskier method:  On a lightly floured counter, roll dough to a 1/4-inch thickness. Cut into 2-inch rounds; no need to re-roll scraps unless you wish; I like to keep the odd shapes for getting the hang of frying before cooking the final doughnuts. Or, if you’re vehemently against scraps and re-rolling, you can make small square doughnuts, which are surprisingly cute. Brush the edges of half the cut-outs with egg white, and in the center of each, add a tiny dollop (much less than you think you’ll need) of jam. Use the remaining cut-outs to form lids. Pinch every speck of the edges together tightly, almost as if you were making ravioli; you’ll want to seal these spectacularly well. Let filled doughnuts rise for another 30 minutes at room temperature, loosely covered with a towel at room temperature, or in the fridge overnight, on an oiled tray, covered loosely with oiled plastic wrap (use this longer rise only if did the 1-hour rise the first time; two overnights is too much for this dough). ", 
            "Both methods, fry the doughnuts: Heat 2 inches of oil to 350°F (175°C) in a cast-iron frying pan (I like using one because it so delightfully re-seasons them) or heavy pot. Use your dough scraps to practice and get an idea of how quickly the doughnuts will cook. Then add about 4 doughnuts at a time to the oil, cooking on the first side until golden brown underneath, about 1 to 2 minutes, but often less so keep a close eye on them. Flip doughnuts and cook on the other side, until it, too, is golden brown underneath, about another minute. Drain doughnuts, then spread them on a paper towel-lined plate to absorb extra oil. Repeat with remaining doughnuts.", 
            "– If you haven’t filled your doughnuts yet, i.e. you’re using the easier method: When doughnuts are cool enough to handle, place jelly or jam in a piping bag with a round tip with a 1/4- to 1/2-inch opening. You can fill doughnuts from the tops or sides; I did half with each. Press the tip of the jam bag halfway into the doughnut, and squeeze in the jam until it dollops out a little from the hole. Repeat with remaining doughnuts. ", 
            "Finish doughnuts: Either generously shower doughnuts with powdered sugar on either side, shaken from a fine-mesh strainer, or roll the doughnuts gently in a bowl of powdered sugar.", 
            "Eat at once. Don’t forget to share. If eating these on the first day, leave any remaining doughnuts uncovered on a plate. These are best on the first day, but my son did not (shockingly) say no to one that had been in an airtight container at room temperature overnight for breakfast this morning, so I guess they’re not inedible on the second day. They will need to be re-powdered, however, as it absorbs into the doughnuts when they’re in a covered container. ", 
            "To make these dairy-free: You can use warm water, soy, almond or coconut milk instead of the dairy milk, and coconut oil, shortening or margarine for the butter. I made a version with both coconut milk and coconut oil, orange zest and a bit of almond extract that were a big hit."
        ], 
        "date": "2014-12-11T11:59:16+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup pistachios, shelled and toasted", 
            "1/2 cup pitted green (what I used) or Cerignola (what Burrell recommends) olives", 
            "2 tablespoons capers", 
            "1 clove garlic, smashed", 
            "1 tablespoon freshly chopped oregano leaves (nixed because mine had gone bad)", 
            "2 tablespoons freshly chopped parsley leaves", 
            "Extra-virgin olive oil", 
            "1 lemon, zested", 
            "1 (8-rib) rack of lamb or 6 lamb chops", 
            "Salt", 
            "Freshly ground black pepper*"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/lamb-chops-with-pistachio-tapenade.jpg?w=749", 
        "tags": [
            "Easter", 
            "Meat", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2010/06/lamb-chops-with-pistachio-tapenade/", 
        "title": "lamb chops with pistachio tapenade", 
        "directions": [
            "To make the pistachio tapenade: In a food processor combine the pistachios, olives, capers, garlic, herbs and puree. While the machine is running, slowly drizzle in olive oil until the mixture becomes a paste. Add the zest and pulse 1 more time, drizzling in more oil if necessary. Reserve until ready to use.", 
            "If using a rack of ribs: Remove 2 rib bones from the 8 rib rack to make it a 6-rib rack. Counting from either end, remove the 2nd and 7th bones; this will create 6 even chops that are thicker than a normal lamb chop. Cut 6 even chops.", 
            "Cook your chops: Season your six lamb chops generously on either side with salt and freshly ground black pepper. Allow them to sit for 10 to 15 minutes before cooking.", 
            "Preheat oven to 425 degrees F. Coat a large saute pan generously with olive oil and bring to medium-high heat. When the oil is hot but not smoking, add the lamb chops and cook for about 2 minutes on each side to brown. If the pan begins to smoke, lower the heat. The chops should be beautifully caramelized on both sides. Remove the chops to a sheet pan and schmear generously with the pistachio tapenade. Place in preheated oven and cook another 4 to 5 minutes for medium rare. Remove chops from oven and let rest for at least 5 minutes before serving.", 
            "* My addition. Does anyone know why not a single Anne Burrell recipe calls for black pepper, only salt? I would love to hear your theories!"
        ], 
        "date": "2010-06-04T09:48:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound medium zucchini", 
            "1 large baking potato (3/4 pound), peeled", 
            "1 small onion (4 ounces), peeled", 
            "1/2 cup matzo meal", 
            "1 large egg, lightly beaten", 
            "1 teaspoon fresh lemon juice", 
            "1 1/2 teaspoons salt", 
            "1/2 teaspoon freshly ground pepper", 
            "Vegetable oil, for frying "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/latke-minus-vodka1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Photo", 
            "Summer", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2006/12/latke-minus-vodka/", 
        "title": "zucchini latkes", 
        "directions": [
            "Halve the zucchini crosswise. Cut the zucchini flesh off the seedy center and coarsely grate it in a food processor. Or grate it on a box grater until you reach the seedy center. Discard the center. In a food processor or on a box grater, coarsely grate the potato and onion. Transfer the grated zucchini, potato and onion to a colander and squeeze dry. Let stand for 2 minutes, then squeeze again. Transfer the vegetable mixture to a large bowl. Add the matzo meal, egg, lemon juice, salt and pepper and stir to combine.", 
            "In a medium skillet, heat 2 tablespoons of vegetable oil until shimmering. Drop packed teaspoons of the zucchini mixture into the skillet and flatten them with the back of a spoon. Cook the latkes over moderately high heat until the edges are golden, about 1 1/2 minutes; flip and cook until golden on the bottom, about 1 minute. Drain on paper towels. Repeat with the remaining zucchini mixture, adding more oil to the skillet as needed.", 
            "Do ahead: The fried latkes can be kept at room temperature for up to 4 hours. Reheat them on a dark baking sheet in a 375°F oven for about 5 minutes, or until warmed through and crisp."
        ], 
        "date": "2006-12-16T11:45:59+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/latke-redux1.jpg?w=500", 
        "tags": [
            "Hanukah", 
            "Jewish", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2007/12/latke-redux/", 
        "title": "latke redux", 
        "directions": [], 
        "date": "2007-12-04T17:43:13+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large or 4 medium (2 pounds or just under 1 kg) Russet or baking potato, peeled", 
            "1 medium onion (about 6 to 8 ounces), peeled", 
            "2 teaspoons baking powder", 
            "1 1/2 teaspoons (about 9 grams) table or fine sea salt", 
            "Freshly ground black pepper", 
            "1/2 cup plus 2 tablespoons (80 grams) all-purpose flour", 
            "4 large eggs", 
            "Nonstick spray, for waffle iron", 
            "2 tablespoons fresh chives, finely chopped, for garnish (totally optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/latke-waffles1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2014/09/latke-waffles/", 
        "title": "latke waffles", 
        "directions": [
            "Heat oven to 350. Lightly oil a large baking sheet and set aside. ", 
            "In a food processor or on a box grater, coarsely shred the potato and onion. For longer strands, lay the potato sideways in the chute of your food processor. Transfer grated mixture to a bowl lined with a fuzz-free dishcloth (linen is great here) or cheesecloth. Pull up the sides of the cloth, forming a bag of grated ingredients, and twist it until you’ve squeezed out all of the excess liquid. Let stand for 1 to 2 minutes, then squeeze out one more time. ", 
            "Discard the liquid in the bowl, then add wrung-out shredded potato and onion to it. Sprinkle baking powder, salt and several grinds of black pepper over mixture and stir with a fork until it distributes throughout the shreds. Add flour, and again, stir into the potato-onion mixture until the pieces are evenly coated. Crack eggs on top; use your fork to break up the yolks and stir them so that they’re evenly distributed through the batter. ", 
            "Heat your waffle iron to high heat. Once hot, coat lightly with a nonstick spray. Heap some latke mixture on top and spread it into an even layer. Cook until the latkes are a nice, deep golden brown underneath. (I found that the bottom colors better than the top, but you’ll even this out in the oven.) ", 
            "Transfer to oiled baking sheet, paler side down, and place in warmed oven. Continue with remaining latke batter. Keep latke waffles in oven until crisp (about 5 to 10 minutes), or until all the other parts of your meal are ready. ", 
            "Serve with applesauce or sour cream, latke-style, or breakfast-style, with eggs and bacon. Sour cream is pretty good with the eggs, too. Chives make it pretty.  "
        ], 
        "date": "2014-09-29T11:51:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup leeks in 1/2-inch thick slices, white and light green parts only, cleaned and rinsed", 
            "Kosher or coarse salt", 
            "2 tablespoons (1 ounce) unsalted butter", 
            "Freshly ground black pepper", 
            "6 cups 1-inch-cubed crustless brioche or Pullman loaf (I used a little less than one loaf)", 
            "2 teaspoons finely chopped chives (I forgot to buy these; it made me sad)", 
            "1/2 teaspoons fresh thyme leaves", 
            "1 large egg", 
            "1 large egg yolk", 
            "3 cups whole milk, heavy cream or half-and-half or a combination thereof", 
            "Freshly grated nutmeg", 
            "1/2 cup shredded Comté, Emmanthaler or Swiss cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/leek-bread-pudding1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Easter", 
            "Eggs", 
            "Leeks", 
            "Photo", 
            "Side Dish", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/04/leek-bread-pudding/", 
        "title": "leek bread pudding", 
        "directions": [
            "Place a medium sauté pan over medium-high heat, drain excess water from leeks, and add to pan. Season with salt, and sauté until leeks begin to soften, about 5 minutes, then reduce heat to medium-low. Stir in butter. Cover and cook, stirring occasionally, until leeks are very soft, about 20 minutes. Adjust salt and pepper to taste.", 
            "Preheat oven to 350 degrees. While leeks are cooking, spread bread cubes on a baking sheet and bake until dry and pale gold, about 15 to 20 minutes (my already-stale brioche took less time to brown), turning pan about halfway through. Transfer to a large bowl, leaving the oven on.", 
            "Add leeks, chives and thyme to the bowl of bread; toss well. In another large bowl, lightly whisk the egg and egg yolks, then whisk in milk or cream, a generous pinch of salt, pepper to taste and a pinch of nutmeg.", 
            "Sprinkle 2 tablespoons shredded cheese in bottom of a buttered 9-by-5-inch loaf pan. Spread 1/2 of bread mixture in pan, and sprinkle with another 2 tablespoons cheese. Spread remaining bread mixture in pan, and sprinkle with another 1/4 cup cheese. Pour in enough milk mixture to cover bread, and gently press on bread so milk soaks in. Let rest 15 minutes.", 
            "Add remaining milk mixture, letting some bread cubes protrude. Sprinkle with salt. Bake until pudding is set and top is brown and bubbling, about 55 to 65 minutes. Serve hot or cold (because I’m weird and enjoy bread pudding cold)."
        ], 
        "date": "2010-04-30T12:00:17+00:00"
    }, 
    {
        "ingredient_list": [
            "2 sticks (225 grams or 8 ounces) unsalted butter, at room temperature", 
            "2 1/2 cups (500 grams) sugar", 
            "4 extra-large eggs, at room temperature", 
            "1/3 cup grated lemon zest (6 to 8 large lemons)", 
            "3 cups (375 grams) all-purpose flour", 
            "1/2 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1 teaspoon (5 grams) kosher salt", 
            "3/4 cup (175 ml) plus 3 1/2 tablespoons (50 ml) freshly squeezed lemon juice", 
            "3/4 cup (175 ml) buttermilk, at room temperature", 
            "1 teaspoon (5 ml) vanilla extract", 
            "2 cups (240 grams) confectioners’ sugar, sifted."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/10/lemon-cake.jpg?w=750", 
        "tags": [
            "Celebration Cakes", 
            "Citrus", 
            "Easter", 
            "Everyday Cakes", 
            "Lemon", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/10/lemony-persnick/", 
        "title": "lemon cake", 
        "directions": [
            "1. Heat oven to 350 degrees F (175 degrees C). Grease and flour two 8 1/2-by-4 1/4-by-2 1/2-inch loaf pans, and line the bottoms with parchment paper.", 
            "2. Cream butter and 2 cups sugar in the bowl of an electric mixer fitted with a paddle attachment for about 5 minutes, or until light and fluffy. Mixing at medium speed, add eggs, one at a time, and lemon zest.", 
            "3. Sift together flour, baking powder, baking soda and salt in a bowl. In another bowl, combine 1/4 cup lemon juice, buttermilk and vanilla. Add flour and buttermilk mixtures alternately to butter and sugar mixture, beginning and ending with flour. Divide batter evenly between pans, smooth tops, and bake for 45 minutes to 1 hour, until a cake tester comes out clean.", 
            "4. Combine 1/2 cup sugar with 1/2 cup lemon juice in a small saucepan, and cook over low heat until sugar dissolves.", 
            "5. When cakes are done, let them cool 10 minutes. Invert them onto a rack set over a tray, and spoon lemon syrup over cakes. Let cakes cool completely.", 
            "6. For glaze, combine confectioners’ sugar and remaining 3 1/2 tablespoons lemon juice in a bowl, mixing with a whisk until smooth. Pour over top of cakes, and allow glaze to drizzle down the sides."
        ], 
        "date": "2006-10-09T09:18:58+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup olive oil, divided", 
            "4 large links of sweet Italian sausage, casings removed (I used half of this, preferring the sausage to not dominate the soup’s flavor [update] and from the comments, it sounds like most of you preferred it with just 2 links as well)", 
            "1 medium onion, diced", 
            "2 celery stalks, sliced or diced", 
            "2 medium carrots, peeled and sliced into half-moons or diced", 
            "4 cloves garlic, sliced (reserve half for later in recipe)", 
            "Kosher salt", 
            "A pinch of crushed red pepper flakes (optional)", 
            "1 cup brown lentils, sorted and rinsed", 
            "2 bay leaves", 
            "1 28-ounce can crushed tomatoes", 
            "6 cups water", 
            "Freshly ground black pepper", 
            "3 to 4 cups shredded or thinly ribboned Swiss chard leaves or kale", 
            "Grated Pecorino Romano cheese to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/01/lentil-soup-with-sausage-chard-and-garlic.jpg?w=750", 
        "tags": [
            "Beans", 
            "Date Night", 
            "Photo", 
            "Soup", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2013/01/lentil-soup-with-sausage-chard-and-garlic/", 
        "title": "lentil soup with sausage, chard and garlic", 
        "directions": [
            "Heat 1/4 cup olive oil (enough to coat bottom of pot) in a large pot on medium heat. When hot, add the sausage, breaking it up with a wooden spoon until it starts to brown, about five minutes. Add the onion, celery, carrots, first two garlic cloves, a pinch of salt, and if you like your soup spicy, a pinch of red pepper flakes. Cook with the sausage until the vegetables soften a bit, another 5 minutes. Add the lentils, bay leaves, tomatoes, water (6 cups is, conveniently, a little less than 2 empty 28-ounce cans, so you can get any tomato pulp you missed), more salt and black pepper to taste. Bring to a simmer and allow to cook until the lentils are tender, about 40 minutes. (It might be necessary to add more water if the soup gets too thick, though we preferred ours on the thick side.)", 
            "When the lentils are cooked, add the chard and cook until the leaves are tender, just a few minutes more. Discard the bay leaves. ", 
            "To finish, divide soup among bowls, then add the remaining 1/4 cup olive oil and 2 garlic cloves to a small skillet and heat over medium until the garlic softens and hisses. Drizzle this over soup bowls, and top with fresh Romano, passing more at the table. Leftovers will keep for several days in the fridge."
        ], 
        "date": "2013-01-22T11:36:49+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (120 ml) milk, whole is ideal", 
            "1/4 cup (60 ml) water", 
            "2 tablespoons raw sugar, brown sugar or honey", 
            "1 packet (7 grams or 2 1/2 teaspoons) active dry yeast", 
            "2 large eggs, ideally at room temperature", 
            "2 teaspoons vanilla extract", 
            "3 2/3 cups (460 grams) all-purpose flour, divided", 
            "1 teaspoon coarse or kosher salt", 
            "14 tablespoons (200 grams or 7 ounces) unsalted butter, softened", 
            "1 1/3 cups pearl sugar (see Note at end for sources)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/liege-waffles1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2015/05/liege-waffles/", 
        "title": "liège waffles", 
        "directions": [
            "Make pearl sugar: David Lebovitz — a man with such an impassioned following that the day he linked to a recent recipe on this site, two different parents came up to me at kindergarten drop-off to ask if I really knew him — gave me a great tip this week:  crush sugar cubes into coarse bits to create makeshift pearl sugar. And here’s an even more DIY approach. I haven’t tested these out (see above: circa 2008 impulse buy) but I have a feeling they’ll get you close to what we’re going for here."
        ], 
        "date": "2015-05-07T12:06:23+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive oil", 
            "2 tablespoons butter, softened", 
            "2 pounds portobello mushrooms, in 1/4-inch slices (save the stems for another use) (you can use cremini instead, as well)", 
            "1/2 carrot, finely diced", 
            "1 small yellow onion, finely diced", 
            "2 cloves garlic, minced", 
            "1 cup full-bodied red wine", 
            "2 cups beef or vegetable broth (beef broth is traditional but vegetable to make it vegetarian; it works with either)", 
            "2 tablespoons tomato paste", 
            "1 teaspoon fresh thyme leaves (1/2 teaspoon dried)", 
            "1 1/2 tablespoons all-purpose flour", 
            "1 cup pearl onions, peeled (thawed if frozen)", 
            "Egg noodles, for serving", 
            "Sour cream and chopped chives or parsley, for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/mushroom-bourguignon-e1477582482731.jpg?w=625", 
        "tags": [
            "Date Night", 
            "Elsewhere", 
            "Freezer Friendly", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2009/01/mushroom-bourguignon/", 
        "title": "mushroom bourguignon", 
        "directions": [
            "Heat the one tablespoon of the olive oil and one tablespoon of butter in a medium Dutch oven or heavy sauce pan over high heat. Sear the mushrooms until they begin to darken, but not yet release any liquid — about three or four minutes. Remove them from pan.", 
            "Lower the flame to medium and add the second tablespoon of olive oil. Toss the carrots, onions, thyme, a few good pinches of salt and a several grinds of black pepper into the pan and cook for 10, stirring occasionally, until the onions are lightly browned. Add the garlic and cook for just one more minute. ", 
            "Add the wine to the pot, scraping any stuck bits off the bottom, then turn the heat all the way up and reduce it by half. Stir in the tomato paste and the broth. Add back the mushrooms with any juices that have collected and once the liquid has boiled, reduce the temperature so it simmers for 20 minutes, or until mushrooms are very tender. Add the pearl onions and simmer for five minutes more.", 
            "Combine remaining butter and the flour with a fork until combined; stir it into the stew. Lower the heat and simmer for 10  more minutes. If the sauce is too thin, boil it down to reduce to the right consistency. Season to taste.", 
            "To serve, spoon the stew over a bowl of egg noodles, dollop with sour cream (optional) and sprinkle with chives or parsley."
        ], 
        "date": "2009-01-15T15:48:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound (8 ounces or 225 grams) pasta of you choice, such as a ziti or twisty shape", 
            "1 tablespoon (15 ml) olive oil", 
            "3/4 pounds (340 grams) fresh mushroom, sliced (I used pre-sliced cremini, my new favorite thing)", 
            "1 small-to-medium yellow onion, halved and sliced thin", 
            "Salt and freshly ground black pepper to taste", 
            "1/4 cup (60 ml) dry marsala wine (see notes at end for more information)", 
            "3 tablespoons (45 grams) unsalted butter", 
            "3 tablespoons (25 grams) all-purpose flour", 
            "1 1/2 cups (355 ml) stock or broth (chicken, vegetable or mushroom)", 
            "1/2 cup (50 grams) finely grated parmesan cheese", 
            "4 ounces (115 grams) mozzarella, cut into small cubes", 
            "3 tablespoons chopped fresh flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/mushroom-marsala-pasta-bake1.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Date Night", 
            "Freezer Friendly", 
            "Mushrooms", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/01/mushroom-marsala-pasta-bake/", 
        "title": "mushroom marsala pasta bake", 
        "directions": [
            "A tip: If we play our cards right here, this can be made entirely in one dish. I used a 4-quart Staub braiser (Happy Hanukah to me!) but any 3-to-4 quart stovetop-to-oven type dish will work.", 
            "Cook the pasta: Bring a pot of well-salted water to a boil. Add pasta and cook until al dente, about 1 to 2 minutes before perfect doneness. Drain and set aside.", 
            "Heat oven: To 400 degrees.", 
            "Make the sauce: Reheat your empty pasta pot over high heat. Add oil and once it is hot, add mushrooms and cook until they’ve begun to brown and glisten, but have not yet released their liquid. Reduce heat to medium-high, add onions, salt and pepper and saute together until the liquid the mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until it has almost or fully evaporated (depending on your preference). Add butter, stir until melted. Add flour, and stir until all has been dampened and absorbed. Add stock, a very small splash at a time, stirring the whole time with a spoon. Make sure each splash has been fully mixed into the butter/flour/mushroom mixture, scraping from the bottom of the pan and all around, before adding the next splash. Repeat until all stock has been added. Let mixture simmer together for 2 minutes, stirring frequently; the sauce will thicken. Remove pan from heat.", 
            "Assemble and bake dish: If you’re cooking in an ovensafe dish, add cooked pasta and stir until combined. (If you’re not cooking in an ovensafe dish, transfer this mixture to a 2-quart baking dish.) Stir in half the parmesan, all of the mozzarella and two tablespoons of the parsley until evenly mixed. Sprinkle the top with remaining parmesan. Bake for 25 to 30 minutes, until edges of pasta are golden brown and irresistible. Sprinkle with reserved parsley and serve hot. Reheat as needed.", 
            "A bunch of notes: "
        ], 
        "date": "2015-01-12T12:03:33+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons unsalted butter, divided", 
            "1 tablespoon olive oil", 
            "1 1/2 pounds mixed mushrooms, cleaned, trimmed and torn into bite size pieces (see suggestions above)", 
            "2 thick slices bread from a large, crusty loaf (I’d use 4 from a smaller loaf)", 
            "2 cloves garlic or 1 shallot, minced", 
            "1 tablespoon white wine vinegar, or more to taste (I used 2)", 
            "1 fresh red chile, stemmed, seeded and minced or red pepper flakes, to taste", 
            "Coarse salt and freshly ground black pepper", 
            "6 ounces chopped fresh greens (see suggestions above)", 
            "8 ounces of a good melting cheese, thickly sliced (suggestions above)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroooms-and-greens-with-toast1.jpg?w=640", 
        "tags": [
            "Casserole", 
            "Greens", 
            "Kale", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/05/mushrooms-and-greens-with-toast/", 
        "title": "mushrooms and greens with toast", 
        "directions": [
            "Melt 2 tablespoons butter and olive oil together in a large, heavy skillet over medium-high heat. One fully hot, add mushrooms to pan and cook, stirring regularly, until they’ve released their water and started to turn golden brown, about 8 minutes. ", 
            "Meanwhile, grill or toast your bread.", 
            "One the mushrooms have a nice color on them, add the garlic or shallots and cook, stirring constantly, for 1 minute. Drizzle with vinegar, most of the chile or chile flakes, salt and pepper and stir to combine. Add the greens; pretty much any kind aside from baby spinach will benefit from about 5 to 8 minutes cooking time, just until collapsed. If you’re me, you’ll add 1 more tablespoon vinegar for brightness at this point. Stir in remaining tablespoon butter and adjust seasonings to taste. Rip bread into irregular croutons and push them into the sauteed vegetables. Lay pieces of cheese atop everything. Turn the heat down to medium low, place a lid on the pan and let the cheese melt, which will take 5 to 10 minutes, depending on the pan and the kind of cheese you used. ", 
            "Sprinkle with remaining chile, “hand out forks, then bring the the pan to the table.” "
        ], 
        "date": "2015-05-12T12:04:17+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 to 1 pound seedless cucumber, washed and chopped into chunks", 
            "2 thin or 1 regular scallions, thinly sliced", 
            "1 large avocado, pitted and diced", 
            "2 tablespoons mayonaise", 
            "Juice of half a lime, plus more to taste", 
            "Salt and hot sauce (we used Sriracha) to taste", 
            "Chopped cilantro or flat-leaf parsley to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/17041084926_d38d46dae0_k.jpg?w=750", 
        "tags": [
            "Avocado", 
            "Cucumber", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/04/obsessively-good-avocado-cucumber-salad/", 
        "title": "obsessively good avocado cucumber salad", 
        "directions": [
            "Combine cucumber, scallions and avocado in a bowl. Whisk together mayo, lime and seasonings, adjusting levels to taste. Drizzle salad with dressing and garnish with cilantro or parsley. Repeat again tomorrow. "
        ], 
        "date": "2015-04-07T12:00:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1 28-ounce can whole tomatoes", 
            "1 (3 to 3 1/2 pound) boneless beef chuck roast, tied with a string", 
            "1 head garlic, separated into cloves, left unpeeled"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic1.jpg?w=750", 
        "tags": [
            "Beef", 
            "Budget", 
            "Date Night", 
            "Gluten-Free", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic/", 
        "title": "oven-braised beef with tomatoes and garlic", 
        "directions": [
            "Heat oven to 300°F (150°C). Coarsely chop tomatoes with their juice in a food processor (Gourmet’s suggestion) or go at them in their can with kitchen shears (my lazy preference) to break them up. Put roast in an ovenproof 4- to 5-quart heavy pot or a casserole dish with a lid — a tight fit is just fine, as it will shrink very soon. Pour tomatoes over roast and scatter garlic around it. Season generously with salt and pepper. Braise in middle of oven, covered, until very tender, 3 to 4 hours. Cut roast into 1/4-inch-thick slices and serve with sauce, garlic, squeezed from its peels (or you can leave others to do this) and orzo (Gourmet’s suggestion, of course not gluten-free), mashed potatoes (recipe at the end) or crusty bread. Leftovers shredded over egg noodles sound wonderful as well.", 
            "Do ahead: Like almost all braises, this is even better on the second day, which means it’s a dream of a dinner party dish. Let it cool to room temperature, then chill it in the fridge until needed. Defat the sauce before warming (it will be a cinch once solidified on top) and rewarm at 300 for 30 to 45 minutes. ", 
            "Notes:"
        ], 
        "date": "2015-02-09T11:59:10+00:00"
    }, 
    {
        "ingredient_list": [
            "Buttery Pastry Shell", 
            "2 cups (250 grams) all-purpose flour, plus more for dusting", 
            "1 teaspoon kosher salt", 
            "1 cup (2 sicks or 225 grams) very cold unsalted butter, cut into a small dice", 
            "1/4 cup (60 ml) water, ice cold", 
            "Neutral oil, for brushing springform", 
            "Filling", 
            "1 tablespoon (15 ml) olive or vegetable oil", 
            "2 pounds (905 grams) mushrooms (see Note up top for suggestions)", 
            "Salt and freshly ground black pepper", 
            "1 tablespoon (15 grams) unsalted butter", 
            "2 shallots, minced (I used 4 small because I’m a rebel)", 
            "1 tablespoon fresh thyme, minced (use 1 teaspoon only if dried/jarred)", 
            "3/4 cup (2 1/2 ounces or 70 grams) Comte, Emmantel or Gruyere, grated", 
            "2 cups (475 ml) milk", 
            "2 cup (475 ml) heavy cream", 
            "6 large eggs, lightly beaten", 
            "Freshly grated nutmeg (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/over-the-top-mushroom-quiche1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Easter", 
            "Mushrooms", 
            "Photo", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/04/over-the-top-mushroom-quiche/", 
        "title": "over-the-top mushroom quiche", 
        "directions": [
            "Make buttery shell: In a stand mixer fitted with the paddle attachment, mix 1 cup of the flour with all of the salt. Then, with the machine on low speed, add the bits of butter, a handful at a time, until the butter is completely incorperated. Add the remaining flour until just blended, then the cold water until thoroughly incorporated. Dump dough onto a piece of plastic wrap and form it into a flat, round disc. Wrap it with the plastic and chill it for at least one hour, preferably overnight, and up to two days.", 
            "Prepare shell: Set the ring of a 9-inch springform pan, leaving the hinge open, on a rimmed baking sheet lined with parchment paper. Brush the inside of the ring with lightly with oil and set aside.", 
            "Generously flour your counter, then place the chilled, unwrapped dough on the flour and flour the top of the dough. Roll you dough into a 16-inch round. The dough is going to be very hard at first, but keep at it, pressing your rolling pin gently from the center; it will get easier as it stretches out, and it’s best to start when its very cold as it will remain the coolest/most firm longer. Re-flour your surface as needed, continually lifting and rotating your dough to make sure no parts are sticking. If at any point the dough becomes sticky, soft and, frankly, annoying, just slide it onto a floured baking sheet and pop it into the freezer for two minutes for it to cool down again. If it tears, just overlap the sides of the tear and roll them back together. Don’t fret tiny holes; there will be time to patch later.", 
            "You can transfer your dough to the prepared pastry ring in one of two ways. Keller’s method is to roll it up on your rolling pin, then unroll it in the ring. I like to gently fold mine into quarters, without creases, and unfold it in the ring. Gently lift the edges so that the slack of the dough drapes in. Press the dough into the corners and up the sides of the ring. Trim the overhang to 1-inch and please, save your scraps. (I did not. The ring your see pictured is round two. I don’t want to talk about it.) Chill the pastry shell (and the scraps, so they don’t get mushy) in the fridge for 20 minutes (if par-baking) or until needed (if not par-baking).", 
            "Preheat oven to 325°F.", 
            "Decide if you want to par-bake your buttery pastry shell: Read the Note up top first.", 
            "To par-bake your pastry shell: Line your chilled buttery pastry shell with a 14-inch round of parchment paper, or, if your parchment paper isn’t that wide, two sheets in opposite directions. Fill completely (or whichever wall parts aren’t filled will collapse a little) with pie weights/dried beans/uncooked rice/loose change and bake in your preheated oven for 30 to 40 minutes, or until lightly golden at edges. Carefully remove weights and parchment paper and return shell to oven, baking another 10 to 15 minutes longer, until “richly brown” (as per Keller) on bottom. Set aside to cool while you make your filling. Leave the oven on.", 
            "Prepare filling: In a very large skillet, heat the oil. Add the mushrooms, season with salt and pepper and cook over high heat, stirring, until starting to soften, about 5 minutes. Reduce the heat to moderate. Add the butter, shallots and thyme and cook, stirring often, until the mushrooms are tender, about 12 minutes longer. Season with salt and pepper and let cool.", 
            "Assemble quiche: Whether or not your par-baked your buttery pastry shell, check it for holes or cracks that would cause leakage. If you see any, seal them with the trimmed scraps from the dough. Scatter 1/4 cup (one-third of) cheese and half the mushrooms in the bottom of the pastry shell. Either in a blender (Keller’s recommendation) or with a hand whisk (what I did), mix half the milk, cream and eggs with 1 1/2 teaspoons kosher salt (this seemed like a lot, I used less, wish I’d used the full amount), several grinds of black pepper and a pinch of nutmeg (if using) until frothy. Pour into the pastry shell. Top with another 1/4 cup of the cheese and remaining mushrooms. Make the custard again with the remaining eggs/milk/cream and same seasonings and pour it into the shell. Sprinkle remaining 1/4 cup cheese on top.", 
            "Bake quiche: For 1 1/2 hours, until nicely bronzed on top and the custard is just set. (My tester came out damp but not eggy; i.e. clean.) Let cool in pan until warm.", 
            "Serve quiche: Using a serrated knife, trim the pastry shell flush with the top of the pan. Run your knife around the outside of the quiche, inside the ring to make sure it’s not stuck anywhere. Take a deep breath. Lift the springform pan ring off the quiche. Applaud. You can trim your crust further if there’s a big gap between the top and the top of your crust but you might want to do so more neatly than I did. Cut the quiche into wedges and serve warm, with a delicate greens salad."
        ], 
        "date": "2012-04-06T13:33:01+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1/2 pound (about 1 large) Russet potato", 
            "1 tablespoon fresh lemon juice", 
            "1 pound parsnips (about 2 large or 4 medium)", 
            "1/4 cup all-purpose flour", 
            "1 teaspoon baking powder", 
            "2 large eggs, lightly beaten", 
            "2 tablespoons chopped fresh dill", 
            "1 teaspoon table salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "Olive oil (or a mix of olive and vegetable or peanut oil) for frying", 
            "Sauce", 
            "1 cup sour cream", 
            "1 tablespoon lemon juice", 
            "1/2 teaspoon table salt", 
            "1 tablespoon freshly grated or prepared horseradish", 
            "1 tablespoon chopped dill"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/parsnip-latkes-with-horseradish-and-dill.jpg?w=749", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Parsnips", 
            "Photo", 
            "Potatoes", 
            "Snack", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/12/parsnip-latkes-with-horseradish-and-dill/", 
        "title": "parsnip latkes with horseradish and dill", 
        "directions": [
            "Preheat: Oven to 250 degrees. Line one large or two smaller baking sheets with foil and leave them in the oven until needed.", 
            "Prepare vegetables: Peel vegetables and grate them on the large holes of a box grater or (my preferred method) using the shredding blade of a food processor. If using the food processor, I like to lay the vegetables sideways in the chute, in an attempt to get the longest strands of vegetables. This creates latkes that look like little piles of mops, which is my goal.", 
            "Transfer shredded vegetables to a lint-free dishtowel or square of cheesecloth, and wring out as much liquid as possible. Let stand for two minutes, then wring again. Wetness is the enemy of crisp, light latkes, so we want to get rid of as much as possible.", 
            "Make batter: Transfer wrung-out vegetables to a large bowl. Add lemon juice. In a tiny dish, stir together the flour, baking powder, salt, pepper and any herbs or additional seasonings and toss with vegetables, evenly coating the strands. In the same tiny dish, whisk your egg(s) and then stir this into the vegetable-flour mixture, evenly coating the strands.", 
            "Prepare pan: Heat a large, heavy skillet, preferably cast iron, over medium heat. Once skillet is hot, add 3 tablespoons oil and heat oil until shimmering. If you’re unsure, you can flick a droplet of water onto the oil; if it hisses and sputters, you’re good to go.", 
            "Cook: Using a fork or your fingertips (letting the eggy batter drain off a little is good), gather spoonful-sized mounds of battered vegetables and drop them onto the heated skillet. When golden underneath, 3 to 4 minutes later, flip pancakes. [If you’re using a gas range, you’ll likely have to rotate your pancakes 180 degrees halfway through the cooking time so that they color evenly underneath.] Cook on the other side until nicely bronzed underneath, another 2 to 3 minutes, and transfer to paper towels briefly to drain pancakes, before transferring them again to tray(s) in warm oven. If latkes cook too quickly or slowly on the stove, adjust the heat accordingly.", 
            "Add more oil if needed (you want to keep the pan at that 3 tablespoon level), being sure it is heated before adding more pancakes to the skillet. Repeat with remaining batter.  I like to keep the latkes in the oven for at least 10 minutes to ensure they’ve cooked through before serving them. This gives you time to…", 
            "Make sauce: Mix sauce ingredients in a small dish. Adjust seasonings to taste.", 
            "Serve: Warm with a dollop of the sauce."
        ], 
        "date": "2011-12-22T13:13:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large or 2 small yellow onions", 
            "3 pounds or about 5 large baking — Russet or Idaho — potatoes, peeled", 
            "1/3 cup potato starch*", 
            "2 teaspoons kosher salt", 
            "Lots of freshly ground black pepper", 
            "3 large eggs", 
            "5 tablespoons olive oil, schmaltz or another oil of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/23422902976_b1b17d03a6_k.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Gluten-Free", 
            "Hanukah", 
            "Jewish", 
            "Onions", 
            "Passover", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/12/potato-kugel/", 
        "title": "potato kugel", 
        "directions": [
            "Heat oven to 350°F.", 
            "By hand: Chop onions very finely and coarsely grate potatoes.", 
            "With a food processor: Blend onions in food processor with regular blade until finely ground. Switch to grating blade and grate potatoes — I like to do this one their sides, for the longest strands.", 
            "Both methods: Place onions and potatoes in a large bowl. Sprinkle salt, pepper and starch evenly over potatoes and toss together with two forks or, as I do it, your very clean hands, evenly coating strands. Break eggs right on top and again use forks or your fingers to work them into the strands, evenly coating the mixture. ", 
            "Heat a 1/4 cup oil or fat in a 10-inch cast-iron skillet** over high heat until very hot. Pour potato-egg mixture into pan carefully (it’s going to splatter) and spread evenly in pan. I like to twist and tousle the top strands a little for a pretty final texture on top. Drizzle with last tablespoon of oil. Bake in heated oven for 75 to 80 minutes, until browned on top and tender in the middle. If top browns too quickly, before center is baked, cover with foil for all but the last two minutes of baking time, though this has never been necessary in my oven.", 
            "Serve in squares, either right from the skillet or unmolded onto a platter. Kugel reheats exceptionally well in a warm oven. It keeps in the fridge for up to 4 days, and much longer (months, even) in the freezer. I like to defrost it in the fridge before rewarming it in an oven. ", 
            "* Cornstarch works too. As does flour. Matzo meal is traditional. I like potato starch because it’s the least distracting and lightest. I buy mine from Bob’s Red Mill; usually in a section with other BRM products at just about any store these days (hooray).", 
            "** Without a cast-iron — Use a casserole baking dish. Just heat the oil first so it’s hot when the potato mixture lands in it. (You can do this in the oven, but it will take a good 5 minutes to get very hot. Might as well do it in 60 seconds on the stove.)"
        ], 
        "date": "2015-12-01T12:05:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large baking potato (1 pound), peeled", 
            "1 small onion (4 ounces), peeled", 
            "1/4 cup all-purpose flour", 
            "1 large egg, lightly beaten", 
            "1 teaspoon salt", 
            "1/4 teaspoon freshly ground pepper", 
            "Peanut oil, for frying"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/potato-latkes1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/12/potato-pancakes-even-better/", 
        "title": "potato pancakes, even better", 
        "directions": [
            "In a food processor or on a box grater, coarsely shred the potato and onion. For longer strands, lay the potato sideways in the chute of your food processor. Transfer to a colander or wrap in a cheesecloth sling, and squeeze as dry as possible. Let stand for 2 minutes, then squeeze dry again.", 
            "In a large bowl, whisk the flour, egg, salt and pepper together. Stir in the potato onion mixture until all pieces are evenly coated.", 
            "In a medium skillet, heat 2 tablespoons of vegetable oil until shimmering. Drop packed tablespoons of the potato mixture into the skillet and flatten them with the back of a spoon. Cook the latkes over moderately high heat until the edges are golden, about 1 1/2 minutes; flip and cook until golden on the bottom, about 1 minute. Drain on paper towels. Repeat with the remaining potato mixture, adding more oil to the skillet as needed.", 
            "Do ahead: Latkes are a do-ahead-er’s dream. You can also keep latkes warm in the oven for an hour or more, if you’re waiting for stragglers to arrive. Cooked, they keep well in the fridge for a day or two, or in the freezer, well wrapped, for up to two weeks. Reheat them in a single layer on a cookie sheet in a 400 degree oven until they’re crisp again. Bonus: If you undercooked them a bit or didn’t get the browning on them you’d hoped for, you can compensate for this in the oven. "
        ], 
        "date": "2008-12-21T20:54:03+00:00"
    }, 
    {
        "ingredient_list": [
            "4 teaspoons fine sea or table salt", 
            "6 to 8 (1 kilo) small to medium Yukon Gold potatoes, peeled", 
            "1 medium yellow onion, diced", 
            "1/2 teaspoon freshly ground black pepper", 
            "4 to 5 tablespoons olive oil", 
            "About 1 tablespoon fresh rosemary leaves", 
            "2 cups minus 1 tablespoon (250 grams) all-purpose or bread flour", 
            "1 1/4 teaspoons (5 grams) instant or active dry yeast", 
            "A heaped 1/4 teaspoon fine sea or table salt", 
            "A heaped 1/4 teaspoon granulated sugar", 
            "2/3 cups (150 grams) room temperature water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/potato-pizza-pizza-con-potate1.jpg?w=640", 
        "tags": [
            "Dairy-Free", 
            "Photo", 
            "Pizza", 
            "Potatoes", 
            "Vegan", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/04/potato-pizza-even-better/", 
        "title": "potato pizza, even better", 
        "directions": [
            "In a medium bowl, stir together the flour, yeast, salt, and sugar. Add the water and, using a wooden spoon or your hand, mix until well blended, about 30 seconds. Cover the bowl and let sit at room temperature until the dough has more than doubled in volume, about 2 hours. Continue using instructions above."
        ], 
        "date": "2016-04-04T12:04:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds fingerlings, or small red or yukon gold potatoes", 
            "4 large eggs", 
            "1/4 pound frisee (French curly endive) or another sturdy lettuce", 
            "6 ounces slab bacon or thick-cut bacon slices", 
            "2 tablespoons finely chopped shallot", 
            "3 tablespoons red wine vinegar", 
            "1/2 teaspoon smooth Dijon mustard", 
            "2 ounces crumbled blue cheese, or more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/potatoes-with-soft-eggs-and-warm-bacon-vinaigrette1.jpg?w=750", 
        "tags": [
            "Brunch", 
            "Budget", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2015/03/potatoes-with-soft-eggs-and-bacon-vinaigrette/", 
        "title": "potatoes with soft eggs and bacon vinaigrette", 
        "directions": [
            "Cook potatoes: In a large saucepan, cover potatoes with cold water, set a timer for 25 minutes (for small red or gold potatoes), and bring to a boil. Once boiling, reduce to a simmer. Cook until tender but not falling apart, which for small red potatoes usually takes me 25 minutes (fingerlings, because they’re thinner, might be worth checking at 20). Drain and when cool enough to touch, but still hot, halve lengthwise and arrange cut side up on a platter.", 
            "Meanwhile, cook eggs: Bring medium saucepan of water to a boil. Lower eggs into it and boil for five (for a runnier egg) to six (for a less-runny but still loose egg) minutes. Drain and rinse egg briefly under cool water until cool enough to handle and carefully peel — because the egg inside is so soft, I recommend chipping off smaller pieces at a time and running it under water as needed so you don’t accidentally rip it open. Set aside. ", 
            "Prep salad: Tear frisee into bite-size pieces and put in a large bowl. ", 
            "Right before you’re ready to serve everything, make vinaigrette: If using slab bacon, cut lengthwise into 1/4-inch thick slices, then 1/4-inch thick sticks (lardons); if using bacon slices, just cut them crosswise into 1/4-inch lardons. Cook bacon in a heavy skillet over moderate heat, until bacon is 3/4 as crisp as you’d like it to get. Add shallots, and cook for 1 minute more. Whisk in red wine vinegar and Dijon and let simmer for 10 seconds. Immediately pour 3/4 hot dressing over potatoes and last 1/4 over frisee in bowl, tossing the lettuce to combine evenly. Season both with salt and pepper. ", 
            "To finish: Top dressed potatoes with peeled eggs and use a knife to cut them into quarters, so they break open over the potatoes. Season cut eggs with salt and pepper again, sprinkle potato dish with blue cheese. Serve with frisee on the side or on top.", 
            "Note: I’ve made this a few times (can you blame me?) and sometimes I got a lot of “renderings” from the bacon and had more than enough dressing for the potatoes and side bowl of lettuce and a couple times it felt a little scant. If you don’t feel like you have enough dressing to stretch over the potatoes and lettuce, just cover the potatoes well. The lettuce can be always be lightly dressed with a splash of olive oil, teaspoon of red wine vinegar plus the salt and pepper."
        ], 
        "date": "2015-03-16T12:00:58+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "2 cups (260 grams) all-purpose flour", 
            "1/2 teaspoon fine sea or table salt", 
            "1/2 pound (225 grams) unsalted butter", 
            "1/2 pound (1 8-ounce or 225-gram package) cream cheese", 
            "Filling", 
            "2/3 cup (135 grams) granulated sugar", 
            "1 1/2 tablespoons ground cinnamon", 
            "1/3 cup miniature chocolate chips or finely chopped bitter- or semi-sweet chocolate", 
            "1/3 cup toasted nuts, chopped small (I used walnuts)", 
            "1/3 cup dried fruit, chopped small; (I used tiny dried currants, no chopping needed)", 
            "1/2 to 3/4 cup jam (I used seedless raspberry, apricot is more traditional)", 
            "Finish", 
            "1 egg beaten with 1 teaspoon water or milk", 
            "Remaining cinnamon-sugar from above"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/pull-apart-rugelach-e14492472877211.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Hanukah", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/12/pull-apart-rugelach/", 
        "title": "pull-apart rugelach", 
        "directions": [
            "Make the dough:", 
            "In a food processor: Place flour and salt in work bowl fitted with standard blade. Pulse to combine. Add cream cheese, chopped into large chunks, and run machine until it’s fully dispersed into the flour. Add butter in large chunks and run machine until dough starts to clump. Dump out onto a large piece of plastic wrap and form into a flattish disc. ", 
            "With a mixer: Let butter and cream cheese soften at room temperature. Beat both together until light and fluffy. Beat in salt. Add flour, beating until it disappears. Scrape dough onto a large piece of plastic wrap and form into a flattish disc.", 
            "Both methods: Chill dough until totally firm — about 2 hours in the fridge you can hasten this along in the freezer for about 30 minutes. (Dough keeps in fridge for up to a week, and in freezer much longer.)", 
            "Form the pastries: ", 
            "Heat oven to 350 degrees F and line a couple baking sheets with parchment paper or nonstick baking mats.", 
            "Stir cinnamon and sugar together in a small dish. Combine coarse mixture of chocolate, nuts and dried fruit in a second dish. ", 
            "Divide dough into quarters and roll first quarter out on a floured counter into a rectangle about 12 inches wide and 7 to 8 inches long, with the wider side to you. Thinly spread dough to all but the furthest 1/4 inch from you — which seals better once rolled if bare — with about 2 to 3 tablespoons jam. (I find that with seedless raspberry, 2T covers nicely but with thicker jam, you’ll need 3T to coat it thinly. If your jam is difficult to spread, you can warm it gently in the microwave for a few seconds first.) Sprinkle with 2 tablespoons cinnamon-sugar mixture, then 4 tablespoons coarse fruit and nut mixture.", 
            "Roll dough from the 12-inch side in front of you into as tight as a log as you can, using your fingers to lightly seal the ends onto the log. Repeat with remaining logs. ", 
            "Now, choose your final shape:", 
            "To make classic, easy sliced cookies: Place log of filled dough in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. Trim ends from log so they have a clean shape. Cut log into 10 to 12 even slices. Arrange on prepared baking sheets a couple inches apart from each other. ", 
            "To make a ring of spirals: Place log of filled dough in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. Trim ends from log so they have a clean shape. Cut log into 10 to 12 even slices. Arrange them in a ring formation on prepared baking sheets so that each link touches. Do note: This will be the hardest to lift in one piece from the baking sheet once cool.", 
            "To make a pull-apart wreath: Form log into a ring, connecting the ends and smoothing the dough to seal the shape. Place ring in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. On prepared baking sheet, cut 10 to 12 evenly spaced apart notches in ring, cutting through all but the last 1/4-inch of log so it stays connected. ", 
            "To make a pull-apart log: Place log of filled dough in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. Trim ends from log so they have a clean shape. On prepared baking sheet, cut 10 to 12 evenly spaced apart notches in log, alternating sides that you cut from, cutting through all but the last 1/4-inch of log so it stays connected.", 
            "To make a split log twisted together like a babka: Don’t. It was a flopped-open mess. We couldn’t even eat it. [biggest lie, ever]", 
            "For all shapes: Brush top(s) lightly with egg wash and sprinkle with a total of 1 teaspoon of the remaining cinnamon-sugar mixture. Bake for 20 to 25 minutes, until golden brown on top. Individual cookies need to cool only a few minutes on baking sheet before they can be transferred to a cooling rack but larger rings, wreaths and logs do best if they cool at least 3/4 of the way to solidify more before attempting to carefully transfer them. ", 
            "Cooled cookies keep in a container at room temperature for a week, and in the freezer for a month. Just not around here.", 
            "More do-ahead tips: Your filled log of rugelach is also easy to freeze until needed (I did this with the two I had left). Wrap well, and you can slice it into cookies straight from the freezer, baking them while still frozen — you’ll just new a few extra minutes in the oven. "
        ], 
        "date": "2015-12-04T11:44:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups diced leeks, white and light green only (from about 2 large leeks, although I think you can get away with one super-big leek)", 
            "3/4 cup diced onion", 
            "2 1/2 teaspoons olive oil (I needed a tad more)", 
            "1 1/4 cups flour", 
            "1 tablespoon plus 2 teaspoons cornstarch", 
            "Salt", 
            "6 tablespoons butter, diced", 
            "4 eggs, divided", 
            "1/2 cup plus 1 tablespoon heavy cream", 
            "1 cup plus 2 tablespoons sour cream", 
            "Pinch nutmeg", 
            "Pinch pepper", 
            "1 1/2 cups diced ham (1/4 -inch dice; I used about 1/2 pound)", 
            "3/4 cup grated Swiss cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/quiche-lorraine.jpg?w=753", 
        "tags": [
            "Easter", 
            "French", 
            "Leeks", 
            "Meat", 
            "Photo", 
            "Picnics", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2009/10/quiche-lorraine/", 
        "title": "quiche lorraine", 
        "directions": [
            "1. Heat a large sauté pan over low heat. Sauté the leeks and onions in the olive oil 30 to 40 minutes until caramelized, occasionally stirring. Remove from heat and cool.", 
            "2. Meanwhile, in a large bowl, combine the flour, cornstarch and one-fourth teaspoon salt. Cut the butter in with a pastry blender, fork or two knives until it is in very tiny bits. Add one egg (a fork works great for this) and mix it until a dough forms. (Dough can also be made in a food processor, or in theory, and as the original recipe suggests, in a stand mixer.)", 
            "3. On a lightly floured surface, roll the dough out to a 12-inch circle. Place the dough in a 9-inch pie plate (I used an 8-inch deep tart pan, though ended up with extra filling) and press to remove any air bubbles. Crimp the edges, and refrigerate for 30 minutes.", 
            "4. While the quiche shell chills, mix the heavy cream and sour cream in a medium bowl. Whisk in the remaining three eggs. Add a pinch each nutmeg, salt and pepper and combine to form a batter. Preheat the oven to 350 degrees.", 
            "5. Remove the quiche shell from the refrigerator and spread the leek and onion mixture evenly over the base. Sprinkle the ham and then the cheese over the leeks and onions. Pour in the batter and place the quiche in the oven.", 
            "6. Bake until puffed and golden, about 25 to 30 minutes (a deeper pan, such as the one I used, will require extra baking time). Remove from the oven and cool slightly on a rack. Serve warm or at room temperature."
        ], 
        "date": "2009-10-07T11:32:31+00:00"
    }, 
    {
        "ingredient_list": [
            "14 ounces (400 grams) sweetened, flaked coconut", 
            "2/3 cup (130 grams) granulated sugar", 
            "3 large egg whites", 
            "Heaped 1/4 teaspoon flaked sea salt or level 1/4 teaspoon table salt", 
            "1/2 teaspoon almond extract", 
            "1/2 pint (6 ounces, 170 grams or 1 1/4 cups) fresh raspberries (if washed, patted very dry)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/03/raspberry-coconut-macaroons.jpg?w=750", 
        "tags": [
            "Coconut", 
            "Cookie", 
            "Easter", 
            "Gluten-Free", 
            "Passover", 
            "Photo", 
            "Raspberries"
        ], 
        "url": "https://smittenkitchen.com/2012/03/raspberry-coconut-macaroons/", 
        "title": "raspberry coconut macaroons", 
        "directions": [
            "Preheat oven to 325°F. Line two large baking sheets with parchment paper.", 
            "In a food processor, blend the coconut for a minute. Add sugar, blend another minute. Add egg whites, salt and almond extract and blend for another minute. Add raspberries and pulse machine on and off in short bursts until they are largely, but not fully, broken down. (I counted 13 pulses. I might have been a little obsessive, what with the counting.) Some visible flecks of raspberry here and there are great. When you open the machine, you’ll see some parts of the batter that are still fully white while others are fully pink. Resist stirring them together.", 
            "With a tablespoon measure or cookie scoop (I used a #70), scoop batter into 1-inch mounds. You can arrange the cookies fairly close together as they don’t spread, just puff a bit. Scooping a little of the pink batter and a little of the white batter together makes them look extra marble-y and pretty.", 
            "Bake cookies for 25 to 30 minutes, until they look a little toasted on top. Let them rest on the tray for 10 minutes after baking (or you can let them fully cool in place, if you’re not in a rush to use the tray again), as they’ll be hard to move right out of the oven. They’ll firm up as they cool, but still remain softer and less dry inside than traditional macaroons. Thank goodness."
        ], 
        "date": "2012-03-29T09:20:53+00:00"
    }, 
    {
        "ingredient_list": [
            "2 to 3 tablespoons olive oil", 
            "Coarse or Kosher salt", 
            "6 medium-to-large (mine were 3 inches across, averaged 8 1/4 ounces in weight) tomatoes", 
            "Red pepper flakes, to taste", 
            "1/4 medium or 1/2 small onion, finely chopped", 
            "1 garlic clove, minced", 
            "9 tablespoons arborio or another short-grained starchy rice", 
            "Few tablespoons chopped parsley, oregano or slivered basil (or mix thereof)", 
            "Handful breadcrumbs, if using (unless using gluten-free breadcrumbs, this will of course negate the dish’s gluten-free status)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/rice-stuffed-tomatoes.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Gluten-Free", 
            "Grain/Rice", 
            "Italian", 
            "Photo", 
            "Summer", 
            "Tomatoes", 
            "Vegan", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/08/rice-stuffed-tomatoes/", 
        "title": "rice-stuffed tomatoes", 
        "directions": [
            "Heat oven to 350 degrees. Lightly coat an ovenproof baking dish with olive oil. ", 
            "Prepare tomatoes: Cut the tops off the tomatoes and scoop out tomato juices, seeds and flesh into a non-reactive (i.e. just about anything but aluminum) bowl. I like to use a grapefruit knife to make the first cuts, then a spoon to remove the rest, but you can use anything you have around, being careful not to pierce the bottom of the tomatoes. Salt the cavities of the tomatoes and turn them upside down on a plate to drain.", 
            "Prepare reserve: Run scooped-out tomato flesh and juices through a food mill or pulse in a blender until coarsely pureed. Heat a large skillet over medium heat, then add 2 tablespoons olive oil, heating it too. Once hot, add onion, garlic and red pepper flakes, cooking them together for 2 minutes, or until onion begins to soften. Add rice and cook them together for about 3 minutes, or until rice toasts a little. Add tomato puree and bring to a simmer, then reduce heat to medium-low. Season with 3/4 teaspoon salt, then cover skillet with a lid, and let simmer for 10 to 15 minutes, stirring occasionally, until rice is par-cooked. Adjust seasoning if needed.", 
            "[If using the potatoes, as mentioned in the Notes up top, prepare them while the rice simmers.]", 
            "Reassemble tomatoes: Stir fresh herbs into tomato-rice mixture. Arrange tomatoes right-side-up in baking pan then spoon mixture into tomatoes, filling them just 7/8 of the way to leave room for the rice to finish expanding. Coat with breadcrumbs that you can drizzle lightly with olive oil, if using, or you can replace the tomato lid on each (though, do not spend 10 minutes trying to match them back up, as I did last summer. It’s pointless.)", 
            "Bake: Uncovered for 30 minutes, until tomato walls are soft and the rice inside has finished cooking. Serve hot. Repeat again tomorrow."
        ], 
        "date": "2013-08-19T12:05:15+00:00"
    }, 
    {
        "ingredient_list": [
            "Olive oil", 
            "1 large onion, sliced (1 1/2 cups)", 
            "2 cups (1/4-inch-sliced) fennel, top and core, if thick, removed", 
            "3 cloves garlic, minced (1 tablespoon)", 
            "1 pound sweet potatoes, peeled and sliced 1/4-inch thick", 
            "1 pound celery root, peeled and sliced 1/4-inch thick", 
            "1 pound yukon gold, peeled and sliced 1/4-inch thick", 
            "1 cup heavy cream (see Note up top)", 
            "2 cups chicken or vegetable stock or brother", 
            "2 cups grated gruyere cheese (6 ounces with rind)", 
            "2 teaspoons minced fresh thyme leaves", 
            "Kosher salt and freshly ground black pepper", 
            "2 1/2 cups coarse fresh breadcrumbs or panko (what I used)", 
            "2 to 3 tablespoons melted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/root-vegetable-gratin.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Fennel", 
            "Freezer Friendly", 
            "Onions", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/11/root-vegetable-gratin/", 
        "title": "root vegetable gratin", 
        "directions": [
            "Heat your oven to 350°F. Butter a 13×9-inch deep baking dish.\nHeat 2 tablespoons olive oil in a large deep (ideally 12-inch) saute pan over medium heat and add the onions and fennel. Cooking, tossing occasionally, until lightly browned and tender, about 10 minutes. Add the garlic and cook for one minute more.\nMeanwhile, in the largest bowl you own, combine the onion mixture with remaining vegetables, cream, stock, cheese, thyme, 1 tablespoon kosher salt and 1 1/2 teaspoons black pepper. Pour mixture into prepared dish and spread until even. Mix breadcrumbs and butter until evenly coated and distribute evenly over top of dish.\nBake 1 1/2 hours uncovered, or until vegetables are very tender when tested with a small knife and the top is browned and bubbly. Allow to set for 15 minutes at room temperature and serve hot."
        ], 
        "date": "2016-11-10T13:09:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup corn flour", 
            "1 cup all-purpose flour", 
            "1/2 cup fine cornmeal", 
            "1/4 cup plus 2 tablespoons sugar", 
            "1 teaspoon Kosher or coarse salt", 
            "1 stick (4 ounces) cold unsalted butter, cut into small pieces", 
            "1/4 cup plus 2 tablespoons heavy cream", 
            "2 egg yolks", 
            "1 batch Rhubarb Vanilla Compote (recipe below)", 
            "1 1/2 pounds rhubarb stalks", 
            "1 cup minus 1 tablespoon dark brown sugar (i.e. 15 tablespoons, if you want to drive yourself mad)", 
            "1/2 vanilla bean, split and seeds scraped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/rustic-rhubarb-tarts1.jpg?w=750", 
        "tags": [
            "Easter", 
            "Photo", 
            "Rhubarb", 
            "Spring", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2010/05/rustic-rhubarb-tarts/", 
        "title": "rustic rhubarb tarts", 
        "directions": [
            "Rinse the rhubarb stalks and trim the very ends. Cut them in half lengthwise (unless they’re very slim) and then on the diagonal into 3/4-inch chunks. Leaving the last 1 1/2 cups aside, put 3 cups of the rhubarb into a large, heavy-bottomed pot. Add the brown sugar, vanilla bean seeds and pods and turn the heat to medium low. (You want to start at a low temperature to encourage the rhubarb to release its liquid. Unlike most compotes, this one adds no water.) Cook the rhubarb mixture, covered, for about 15 minutes, or until the mixture is saucy. Remove the cover and increase the heat to medium, cooking an additional 15 to 17 minutes, or until the rhubarb is completely broken down and thick enough that a spoon leaves a trail at the bottom of the pan. Discard your vanilla bean pods and add remaining rhubarb chunks to the compote. Pour the compote out onto a large plate to cool.", 
            "Do ahead: This keeps for one week in the fridge. It can also be used to fill pies, crisps and cobblers."
        ], 
        "date": "2010-05-19T22:00:30+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups (335 grams) packed light brown sugar", 
            "2 large eggs, at room temperature", 
            "1/2 teaspoon vanilla extract", 
            "1 3/4 cups (450 grams) smooth peanut butter (see note at end)", 
            "Coarse-grained sea salt, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/salted-peanut-butter-cookies1.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Peanut Butter", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2015/10/salted-peanut-butter-cookies/", 
        "title": "salted peanut butter cookies", 
        "directions": [
            "Preheat the oven to 350°F. Line a rimmed baking sheet with parchment paper.", 
            "In a medium bowl, whisk together the light brown sugar and eggs until smooth. Whisk in the vanilla extract, then the peanut butter until smooth and completely incorporated; you shouldn’t be able to see any ribbons of peanut butter. Ovenly says you know the dough is ready when it has the consistency of Play-Doh, but I can tell you as the mom of a Play-Doh fanatic that mine was thinner, softer.", 
            "If you’d like to get those pretty striations across the top of the cookies, chill the dough by freezing it in its bowl for 15 minutes, stirring it once (so the edges don’t freeze first), before scooping it. If you’re not obsessed with these markings, you can scoop it right away. Scoop or spoon the dough into balls — Ovenly uses about a 1/4-cup scoop (probably #16); I use a 1 2/3 tablespoons or #40 scoop. Place on prepared pan. For the tallest final shape, place the tray in the freezer for 15 minutes before baking.", 
            "Sprinkle the dough balls lightly with coarse-grained sea salt just before baking. Bake smaller cookies for 14 to 15 minutes and larger for 18 to 20. When finished, cookies should be golden at edges. They’ll need to set on the sheet for a minute or two before they can be lifted intact to a cooling sheet. Trust me, you should let these cool completely before eating so the different textures (crisp outside, soft inside) can set up.", 
            "Do ahead: You can definitely make the dough in advance and either refrigerate it for a couple days or freeze it longer. However, if I were going to freeze it, I’d probably go ahead and scoop it first. You can bake them right from the freezer.", 
            "About chilling the dough: The Ovenly recipe says you can scoop and bake the cookies right away, but they keep their shape better if you chill them in the freezer for 15 minutes first. I tried it with and without and did find a better dome and final shape with the 15 minutes after. However, I was incredibly charmed by the striated marks from the cookie scoop on top of the cookie I bought last weekend, as well as in the photo in their book, and I realized that I couldn’t get it at home with just-mixed dough; you’ll get more of a blob shape from your scoop. So, I also chilled the dough for 15 minutes before scooping it and was then satisfied with the shape. It’s not necessary unless you’re as taken with top pattern as I am.", 
            "Two questions I suspect someone will ask very soon: Can you make this with all-natural peanut butter and can you make this with almond or a nut butter? The answer to both is yes, however, the authors themselves warn that you’ll get the best final shape and texture from a smooth, thick processed peanut butter like Skippy (their recommendation; updated to note, thanks to a commenter suggestion, that the 16.3-ounce jar of Skippy is estimated to contain 1 3/4 cups, saving you some measuring). I suspect an almond or cashew butter will have a similar effect as natural peanut butter. "
        ], 
        "date": "2015-10-15T11:56:41+00:00"
    }, 
    {
        "ingredient_list": [
            "Dressing", 
            "4 1/2 tablespoons toasted sesame seeds, plus more for garnish", 
            "3 tablespoons water", 
            "3 tablespoons soy sauce (use low-sodium for a less salty sauce)", 
            "2 tablespoons plus 1 teaspoon tahini", 
            "2 tablespoons plus 1 teaspoon  rice vinegar", 
            "1 1/2 tablespoons toasted sesame oil", 
            "3/4 teaspoon granulated sugar, or more to taste", 
            "Chili sesame oil to taste", 
            "Omelet Ribbons", 
            "Neutral cooking oil, to coat skillet", 
            "3 large eggs", 
            "3 teaspoons water", 
            "A few pinches sugar", 
            "A few pinches salt", 
            "Assembly", 
            "1 9.5-ounce package buckwheat soba noodles", 
            "Raw vegetables of choice (we used julienned carrots, cucumbers and radishes, plus some snipped chives on top, which have recently reappeared in my garden!)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/sesame-soba-and-ribboned-omelet-salad1.jpg?w=750", 
        "tags": [
            "Japanese", 
            "Photo", 
            "Put An Egg On It", 
            "Salad", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/03/sesame-soba-and-ribboned-omelet-salad/", 
        "title": "sesame soba and ribboned omelet salad", 
        "directions": [
            "Make the dressing: Put the toasted sesame seeds into a blender or food processor and run the machine until the seeds look like wet sand — it will take a couple minutes. Add the water, soy sauce, tahini, rice vinegar, sesame oil, sugar, salt and chili sesame oil and blend until combined. Taste and adjust ingredients to your preferences. ", 
            "Make the omelet ribbons: Whisk eggs with water, sugar and salt until well-blended and even in color. Heat a 10-inch skillet (I really like using a nonstick here and for other crepe-like things) over medium and coat very lightly with cooking oil. Pour in 1/3 of mixture, which will be enough to coat the pan very thinly. (If your pan is bigger or smaller, use less or more accordingly per batch, the goal is to keep the egg very thin.) Cook for 1 to 2 minutes, until the egg has set and the edges look dry. Carefully flip* the omelet and cook for 20 to 30 seconds on second side. Flip egg out onto paper towel to blot oil and repeat 2 more times. ", 
            "Stack the three omelets together and roll them into a log. Use a sharp knife to slice the roll into very thin ribbons, thinner even than you see in my photos. ", 
            "Cook the noodles: In well-salted water until tender but firm for the time recommended on your package of noodles, usually 4 to 5 minutes. Drain noodles and run cold water over them to cool. Drain again, shaking out excess water.", 
            "To serve: My favorite way for a family meal is to put everything out in separate dishes and let each of us assemble to taste. (Or, if you’re this one, grab the bowl of egg ribbons and help yourself.) Or, you can toss the noodles with about half the sauce, then arrange it in a bowl with the omelet ribbons on top, followed by your vegetables. Garnish with extra sesame seeds and serve with additional sauce on the side. ", 
            "* One day, when I have video on this site, I will demonstrate my crepe-flipping “method” for you but hopefully this will help until then: I use two thin spatulas (such as offset icing spatulas or a flexible fish spatula). The first smaller one goes under the edge and lifts the omelet/crepe enough that I can hold the second larger spatula in my other hand and slide it under enough that it goes past the center of the omelet/crepe. From here, it’s easier to flip without tearing."
        ], 
        "date": "2016-03-16T12:06:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            null, 
            "1/2 cup (about 3 ounces) ricotta", 
            "1 cup coarsely grated fontina (about 3 ounces)", 
            "1 cup coarsely grated mozzarella (about 3 ounces", 
            "1 cup grated pecorino romano (about 3 ounces)", 
            "3/4 cup mild blue cheese, crumbled (about 3 ounces)", 
            "1 cup crushed tomatoes from a can", 
            "1 cup whole milk (see notes up top for adjustments)", 
            "Kosher salt and freshly ground black pepper to taste", 
            "1 tablespoon finely chopped rosemary or 6 fresh basil leaves, coarsely chopped", 
            "2 scallions, sliced thinly at an angle"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/skillet-baked-pasta-with-five-cheeses.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Pasta", 
            "Photo", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/10/skillet-baked-pasta-with-five-cheeses/", 
        "title": "skillet-baked pasta with five cheeses", 
        "directions": [
            "Bring a pot of well-salted water to a boil. Add the pasta and cook until very al dente, a full 2 minutes shy of whatever your package says. Try a piece of pasta — it should have a toothsome bite to it because it will continue softening in the oven after this. If it’s still crunchy, however, continue to boil the rest of the pasta for another minute.\nHeat your oven to 500 degrees F.\nMeanwhile, in the bottom of a large bowl, combine the five cheeses. Scoop out half and set aside. Whisk milk and tomatoes in the half of cheese left in the large bowl. When pasta is drained, add it to the bowl and stir to combine. Season well with salt and pepper and stir in any herbs you plan to use.\nCoat the sides and bottom of a 12-inch cast-iron or other oven-proof skillet with olive oil. Pour the pasta and sauce in. Sprinkle with remaining cheese. Bake until the top is bubbling and golden brown, 16 to 18 minutes. If it’s not brown enough for your tastes, run it under the broiler for 1 minute.", 
            "Top with scallions and dig in."
        ], 
        "date": "2016-10-04T12:04:20+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound skirt steak, trimmed of excess fat if necessary, halved crosswise, at room temperature", 
            "1 to 2 tablespoons olive oil", 
            "1 pint (2 cups) cherry tomatoes, halved", 
            "1/2 cup (about 4 ounces) crumbled blue cheese", 
            "1/2 pound baby arugula", 
            "Vinaigrette (below)", 
            "3 tablespoons minced chives, 2 thinly sliced scallions or 3 tablespoons finely chopped red onion, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/09/skirt-steak-salad-with-blue-cheese.jpg?w=749", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Salad", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/09/skirt-steak-salad-with-arugula-and-blue-cheese/", 
        "title": "skirt steak salad with blue cheese", 
        "directions": [
            "Whisk ingredients. Season with salt and pepper and adjust ingredients to taste (usually more Dijon and vinegar for me)."
        ], 
        "date": "2010-09-17T13:41:24+00:00"
    }, 
    {
        "ingredient_list": [
            "24 ladyfingers (savioardi) cookies (storebought or from recipe below)", 
            "3 large eggs, separated", 
            "1/3 cup (65 grams) plus 1 tablespoon (13 grams) granulated sugar, divided", 
            "1 8.8-ounce (250 ml) package mascarpone", 
            "1/3 cup (80 ml) sweet or dry marsala", 
            "1 cup (235 ml) strong, warm espresso coffee", 
            "A couple tablespoons of your favorite cocoa powder, for sifting over"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/small-batch-tiramisu.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Italian", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2017/02/small-batch-tiramisu/", 
        "title": "small batch tiramisu", 
        "directions": [
            "In a medium bowl, beat egg whites until stiff.", 
            "In a larger bowl, using same beaters, beat egg yolks and 1/3 cup sugar until thick and pale yellow, 3 to 4 minutes. Beat in mascarpone cheese until combined, and continue beating another minute for extra fluff. Beat in marsala until smooth. Gently fold in egg whites until combined, trying not to deflate the mixture. It will be a loose, soft, creamy custard.", 
            "In a small bowl wide enough to dip cookies into, combine the espresso and 1 tablespoon sugar. Set aside.\nTo assemble small cups: Dip first cookie in espresso mixture until almost fully saturated but not falling apart. Break in half and place the first half in the bottom of your cup. Spoon 1 generous (I use a measuring spoon, but heaped a little) tablespoon cream over it. Repeat with second half of first biscuit and another spoonful of cream. Dust with cocoa powder. Dip second cookie in coffee and break in half. Place side-by-side over cocoa then top with 2 generous tablespoons cream mixture, which should take you nearly to the top of the cup. Dust with more cocoa. Repeat with remaining cups.\nTo assemble large cups: Dip first cookie in espresso mixture until almost fully saturated but not falling apart. Break in half and place side-by-side in the bottom of your larger cup. Spoon 2 generous tablespoons (I use a measuring spoon, but heaped a little) cream over and dust with cocoa powder. Dip two biscuits in espresso mixture and break in half. Place 3 of the halves on top of the cocoa powder, cover with another 2 generous tablespoons of cream and cocoa powder. Dip a 4th biscuit in the espresso mixture, break it in half, and place these two halves plus the leftover half from the previous layer on top of the cocoa. Dollop more cream over and repeat with remaining cups.\nIf you can bear it, let cups chill in fridge overnight to set. Before eating, you can dust them with fresh cocoa powder for a prettier look.", 
            ""
        ], 
        "date": "2017-02-13T13:02:17+00:00"
    }, 
    {
        "ingredient_list": [
            "5 cups chicken broth (40 fl ounces)", 
            "1 cup water", 
            "1 pound thin to medium asparagus, trimmed and cut into 1/4 inch thick slices, leaving tips 1 1/2 inches long", 
            "1 tablespoon olive oil", 
            "1/2 stick (1/4 cup) unsalted butter", 
            "3/4 pound fresh shiitake mushrooms, stems discarded and caps cut into 1/4 inch thick slices", 
            "2 large fresh artichoke hearts, cut into 1/4 inch thick slices, prepared*", 
            "2 shallots, finely chopped", 
            "1 1/2 cups Arborio rice (10 ounces)", 
            "1/2 cup dry white wine", 
            "2 ounces finely grated Parmigiano-Reggiano (1 cup, though I used half) "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/someday-my-spring-will-come1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Asparagus", 
            "Easter", 
            "Grain/Rice", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/01/someday-my-spring-will-come/", 
        "title": "asparagus, artichoke and shiitake risotto", 
        "directions": [
            "Bring broth and water to a boil in a 4-quart pot. Add asparagus and cook, uncovered, until crisp-tender, 3 to 4 minutes. Transfer asparagus with a slotted spoon to a large bowl of ice and cold water to stop cooking, then drain and pat dry. Keep broth at a bare simmer, covered. ", 
            "Heat oil with 1 tablespoon butter in a 4-quart heavy saucepan over moderately high heat until foam subsides, then saute mushrooms, stirring occasionally, until browned, about 4 minutes. Season with salt and pepper, then transfer to a bowl. ", 
            "Cook onion in 2 tablespoons butter in saucepan over moderate heat, stirring, until softened, about 3 minutes. Add shallots and cook until softened, about 2 to 3 minutes, then add rice and cook, stirring, 1 minute. Add wine and cook, stirring, until absorbed, about 1 minute. ", 
            "Ladle in 1 cup simmering broth and cook at a strong simmer, stirring, until absorbed, about 2 minutes. Continue simmering and adding broth, about 1/2 cup at a time, stirring frequently and letting each addition be absorbed before adding next, until rice is just tender and looks creamy, 18 to 20 minutes. (Save leftover broth for thinning.) ", 
            "Remove from heat and stir in 1/2 cup cheese, remaining tablespoon butter, and salt and pepper to taste. Gently stir in asparagus, artichokes and mushrooms, then cover pan and let stand 1 minute. If desired, thin risotto with some of remaining broth. Serve immediately with remaining cheese on the side.", 
            "* My absolutely favorite artichoke heart preparation is to remove all the outer leaves, choke and stem of a whole artichoke, leaving just the heart. Cut the heart into 1/4 inch slices and toss it immediately in a bowl filled with the juice of one lemon. Make sure each and every edge, angle and side of the hearts gets coated in lemon juice, or they will brown very quickly. In a small pot, boil water with a good glug or two of white wine, a splash of white vinegar and if you’re feeling fancy, a smashed garlic clove and/or a bay leaf. Drop in the artichoke hearts with all of their lemon juice, and simmer them for about 10 minutes, or longer if needed for them to become tender. Drain and set them aside. "
        ], 
        "date": "2007-01-29T22:36:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup olive oil", 
            "1 pound dried spaghetti", 
            "2 tablespoons butter", 
            "4 ounces Pecorino Romano cheese, finely grated", 
            "1 1/2 teaspoon finely ground black pepper", 
            "Salt (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaghetti-cacio-e-pepe1.jpg?w=500", 
        "tags": [
            "Date Night", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/02/spaghetti-cacio-e-pepe/", 
        "title": "spaghetti with cheese + black pepper", 
        "directions": [
            "Cook spaghetti in well-salted water to your al dente tastes in a large, wide-bottomed pot. (You’ll have fewer dishes to wash if you use this pot to assemble the dish as well.) Drain spaghetti, reserving 1 1/2 cups of pasta cooking water.", 
            "Dry out your pot, then heat the olive oil over high heat until almost smoking. Add drained spaghetti and 1 cup of reserved pasta water and jump back, this will splatter mightily, also known as “I made this three times, and never once learned my lesson. Do as I say, not as I do.”", 
            "Add butter, 3 ounces cheese and ground pepper and toss together with tongs. Taste, adding more pasta water, cheese, pepper or salt (which should not be neccessary, as Romano is very salty) to taste.", 
            "Serve immediately, sprinkling with reserved cheese and an extra grind or two of black pepper."
        ], 
        "date": "2010-02-12T11:09:01+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/spaghetti-pie-with-pecorino-and-black-pepper1.jpg?w=640", 
        "tags": [
            "Casserole", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/01/spaghetti-pie-with-pecorino-and-black-pepper/", 
        "title": "spaghetti pie with pecorino and black pepper", 
        "directions": [
            "Heat oven to 425 degrees. Butter a 9-inch springform pan and this is very important, wrap the outside of the springform, focusing on the places where the ring meets the base, tightly in aluminum foil. Set aside.", 
            "Bring a large pot of well-salted water to a boil. If using broccoli rabe, add it to the pot and boil for 1 to 2 minutes, until it has some give. Fish it out with a large slotted spoon and drain it well. Set aside.", 
            "Add spaghetti to boiling water and cook until (this is also important) 2 minutes shy of done, so very al dente, as the spaghetti will continue cooking in the oven. Drain well and let cool slightly.", 
            "If using broccoli rabe, wring all extra moisture out of it and blot greens on paper towels to be extra careful. Mince rabe into very small bits. You’ll have about 1 cup total.", 
            "In a large bowl, whisk eggs and milk together with salt and pepper. Stir in all but 1/2 cup of each cheese and chopped rabe, if using. Add spaghetti and toss to coat. ", 
            "Pour into prepared springform and sprinkle remaining cheese on top. Bake for 35 to 40 minutes (without greens) and up to 15 minutes more (with greens, as they add moisture too), until the cheese is melted and bubbling and a knife inserted into the center of the pie and turned slightly will not release any loose egg batter into the center. If the top of your pie browns too quickly before the center is set, cover it with foil for the remaining cooking time.", 
            "Turn on your oven’s broiler. Broil the pie a few inches from the heat for 2 to 3 minutes, until browned on top. Cut along springform ring to loosen, then remove ring. Run a spatula underneath the pie to loosen the base and slide onto a serving plate. Cut into wedges."
        ], 
        "date": "2016-01-26T12:08:58+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound spaghetti or linguine", 
            "Salt", 
            "3 lemons", 
            "1/4 cup extra virgin olive oil , plus additional for serving", 
            "1/4 cup heavy cream", 
            "1 ounce finely grated Parmesan cheese (about 1/2 cup), plus additional for serving", 
            "Ground black pepper", 
            "Small handful fresh basil or arugula (what I used, deliciously, in a pinch) leaves, shredded"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaghetti-with-lemon-and-olive-oil-al-limone1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Date Night", 
            "Italian", 
            "Lemon", 
            "Pasta", 
            "Photo", 
            "Travel", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/02/spaghetti-with-lemon-and-olive-oil-al-limone/", 
        "title": "spaghetti with lemon and olive oil", 
        "directions": [
            "Cook linguine or spaghetti in well-salted water to your al dente tastes in a large, wide-bottomed pot. (You’ll have fewer dishes to wash if you use this pot to assemble the dish as well.) ", 
            "While pasta is cooking, zest lemons until you have a little shy of a tablespoon of zest. Juice lemons — you’ll have anywhere from 1/3 to 1/2 cup lemon juice.  ", 
            "Drain pasta, reserving 1 1/2 cups of pasta cooking water. Dry out your pot, then boil the olive oil, cream, zest and 1 cup of the reserved pasta water together for two minutes over high heat.  Return pasta to pot and stir until coated. Add the cheese and 1/4 cup lemon juice and toss, toss, toss everything together. Add more pasta water, 1/4 cup at a time, if you’d like your dish a little looser. Quickly taste a strand of pasta and see if you want to add the remaining lemon juice (we did). Stir in basil or arugula and season generously with salt and pepper. ", 
            "Serve immediately, drizzling individual portions with a bit of extra olive oil and sprinkling with extra Parmesan cheese."
        ], 
        "date": "2011-02-24T12:00:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (10 ounce) package frozen spinach, thawed, squeeze of all excess liquid, and chopped", 
            "1 1/2 cups finely chopped onion (1 large)", 
            "3 tablespoons unsalted butter", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper", 
            "1/4 teaspoon freshly grated nutmeg", 
            "8 cups cubed French or Italian bread in 1-inch cubes (1/2 lb)", 
            "6 ounces coarsely grated Gruyère (2 cups)", 
            "2 ounces finely grated parmesan (1 cup)", 
            "2 3/4 cups milk", 
            "9 large eggs", 
            "2 tablespoons Dijon mustard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spinach-and-cheese-strata1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/12/spinach-and-cheese-strata/", 
        "title": "spinach and cheese strata", 
        "directions": [
            "Sauté onion in butter in a large, heavy skillet over medium heat until soft, about 5 minutes. Add 1/2 teaspoon salt, 1/4 teaspoon pepper and nutmeg and continue cooking for one minute. Stir in spinach, remove from heat and set aside.", 
            "Spread one third of the bread cubes in a well-buttered 3-quart gratin dish or other ceramic baking dish. Top with one-third of spinach mixture and one-third of each cheese. Repeat layering twice with remaining bread, spinach and cheese.", 
            "Whisk eggs, milk, mustard and remaining 1/2 teaspoon salt and 1/4 teaspoon pepper together in a large bowl and pour evenly over strata. Cover with plastic wrap and chill strata for eat least 8 hours or up to a day.", 
            "The next day, let it stand at room temperature for 30 minutes while preheating the oven to 350°F. Bake strata, uncovered, in middle of oven until puffed, golden brown, and cooked through, 45 to 55 minutes. Let stand 5 minutes before serving."
        ], 
        "date": "2009-12-22T12:27:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3-ounce package cream cheese, room temperature", 
            "1/3 cup half and half (or milk)", 
            "3 eggs", 
            "1 10-ounce package frozen chopped spinach, thawed and drained", 
            "1/2 cup grated cheddar (gruyere works well, too)", 
            "1/4 cup grated Parmesan", 
            "4 to 6 green onions, thinly sliced (1/2 cup finely diced red or white onion or shallots work as well)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spinach-quiche-revisited1.jpg?w=640", 
        "tags": [
            "Easter", 
            "Freezer Friendly", 
            "Photo", 
            "Picnics", 
            "Spinach", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2008/09/spinach-quiche-revisited/", 
        "title": "spinach quiche, revisited", 
        "directions": [
            "Preheat oven to 425°. Beat cream cheese in medium bowl until smooth. Gradually beat in half and half and eggs. Mix in remaining ingredients. Pour mixture into prepared crust. Bake until crust is golden brown and filling is set, about 25 minutes. Cool 10 minutes before serving."
        ], 
        "date": "2008-09-14T12:58:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 2/3 cups (215 grams) all-purpose flour", 
            "3/4 teaspoon kosher salt", 
            "12 tablespoons (170 grams) cold unsalted butter, diced", 
            "3 tablespoons (45 grams) very cold water", 
            "Nonstick spray oil, for coating pan", 
            "3/4 cup (176 grams, 6 ounces, or 3/4 of an 8-ounce brick) cream cheese, soft at room temperature", 
            "2/3 cup (155 ml) half-and-half or 1/3 cup each whole milk and heavy cream", 
            "6 large eggs", 
            "2 10-ounce (283-gram) packages frozen chopped spinach, thawed", 
            "1 cup (115 grams or 4 ounces) grated cheddar or gruyere", 
            "1/2 cup (50 grams) finely grated Parmesan", 
            "1 small bundle (2 to 3 ounces or about 8 thin green onions) thinly sliced", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/spinach-sheet-pan-quiche.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Casserole", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Spinach", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/11/spinach-sheet-pan-quiche/", 
        "title": "spinach sheet pan quiche", 
        "directions": [
            "Make crust: In a food processor, blend flour and salt together. Add butter and pulse machine until butter is reduced to a fine meal, or couscous-sized bits. While running machine, drizzle in water; stop when dough has balled, a few seconds later.\nWrap dough in plastic or waxed paper and set in freezer to quick-chill until firm but not rock-hard, about 15 to 20 minutes. You can also chill it in the fridge for 2 hours or up to 1 week until needed.\nLightly coat a 9×13-inch (quarter-sheet) pan with oil. Line bottom with parchment paper.\nTo roll out crust (trickier, but go for it if you’re up for the challenge): Flour your counter well. Remove crust from freezer or fridge, unwrap and flour the top of it. Even if it’s very hard, begin rolling it very gently, in light motions, so it doesn’t crack too much as you stretch it out, to about a 12×16-inch rectangle. Keep flouring top and counter underneath dough as it is prone to sticking. Work as quickly as possible because this dough softens even more than regular pie dough as it warms.\nTransfer dough to prepared pan. Lift overhang to let dough slack/droop into corners so you’re not stretching it a lot to shape it to the pan. Trim overhang to 1/2- to 1-inch, then fold overhang onto sides of dough, pressing all around and letting the dough extend slightly over the edge of the pan.\nTo press in crust (less tricky, and what I always wish I’d done): Press dough in an even layer across bottom of pan; leave it thicker as it goes up the sides; pressing all around and letting the dough extend slightly over the edge of the pan.\nBoth methods: Freeze shaped dough until solid, about 20 minutes. Save your scraps! You can use them to patch any holes or cracks formed when baking.\nMeanwhile, heat oven to 425 degrees F. Coat a large sheet of foil lightly with spray oil. Once crust is solid, prick it all over with a fork and press foil, oiled side down, tightly against dough. Fill foiled crust to the top with pie weights, dried beans or rice (that you don’t plan to eat at any time) or even pennies. Bake for 20 minutes then gently, carefully remove foil and weights and bake for 5 more minutes, unfilled.\nWhile crust par-bakes, make filling: Use an electric mixer or your best whisking skills to beat cream cheese in the bottom of a large bowl until smooth and fluffy. Gradually drizzle in half-and-half, whisking the whole time so that the mixture incorporates smoothly. Whisk in eggs, two at a time, until combined. Squeeze out spinach in handfuls, removing as much extra moisture as possible. Stir in spinach, cheddar, parmesan, scallions, salt and pepper.\nWhen crust has finished parbaking, leave oven on. Inspect crust for cracks or holes and use reserved dough to patch them if necessary. Pour in filling just to the top of the crust. You will probably have about 3/4 cup more filling than you can fit in the crust (not an issue if going crust-less or if you didn’t parbake the crust); you can bake this off in a separate oiled dish for an excellent breakfast on toast tomorrow.\nBake quiche until crust is golden brown and filling is set, about 25 minutes. Cool at least 10 minutes before serving. Quiche keeps in fridge for 4 to 5 days."
        ], 
        "date": "2016-11-28T13:12:54+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (12-ounce) 1-inch thick New York strip boneless beef top loin steak", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "Olive oil", 
            "2 yellow onions, sliced in rings", 
            "1/2 teaspoon fresh thyme leaves", 
            "Mustard Mayo, recipe follows", 
            "2 mini focaccia buns, sliced in 1/2 (we used a small ciabatta)", 
            "1/2 cup baby arugula", 
            "1/3 cup good mayonnaise", 
            "2 tablespoons Dijon mustard", 
            "1 tablespoon whole-grain mustard", 
            "2 tablespoons sour cream", 
            "1/8 teaspoon kosher salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/steak-sandwiches1.jpg?w=500", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Picnics", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2009/02/steak-sandwiches/", 
        "title": "steak sandwiches", 
        "directions": [
            "Whisk the ingredients together in a small bowl. Serve at room temperature."
        ], 
        "date": "2009-02-28T17:00:14+00:00"
    }, 
    {
        "ingredient_list": [
            "Gratin", 
            "2 pounds summer squash", 
            "Salt", 
            "1 1/2 cup fresh breadcrumbs", 
            "3 tablespoons unsalted butter", 
            "3/4 cup thinly sliced shallots (from 4 to 5 medium)", 
            "1 cup grated gruyere cheese", 
            "1/4 cup salsa verde (below)", 
            "Freshly ground black pepper", 
            "Salsa verde", 
            "1 tablespoon thyme leaves", 
            "1 teaspoon marjoram or oregano leaves (or half, if dried)", 
            "1/4 cup coarsely chopped mint leaves", 
            "1 cup coarsely chopped flat-leaf parsley", 
            "2 small cloves garlic", 
            "1 salt-packed anchovy, rinsed and bones removed", 
            "1 tablespoon capers, drained (and rinsed, too, if salt-packed)", 
            "1/2 cup olive oil", 
            "1/2 lemon, or more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/summer-squash-gratin-with-salsa-verde1.jpg?w=640", 
        "tags": [
            "Casserole", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Summer Squash", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2014/07/summer-squash-gratin-with-salsa-verde/", 
        "title": "summer squash gratin with salsa verde", 
        "directions": [
            "Heat your oven to 400°F. Cut the squash into thin (1/8-inch thick) coins. Toss with 1 teaspoon kosher salt and set aside for at least 10 minutes. Drain zucchini in a colander, and if you have time, spread them on a towel for a few minutes to further wick away moisture before placing it in a large mixing bowl.", 
            "Meanwhile, place breadcrumbs in a small bowl. In a small skillet or saucepan, melt butter and keep cooking it over medium heat until it browns and smells nutty. Carefully pour (in a small drizzle at first) over breadcrumbs and be sure to scrape out any brown bits from the pot. Toss crumbs to evenly coat.", 
            "Make the salsa verde by blending the herbs in a food processor or blender with garlic, anchovy and capers until it forms a paste, scraping down as needed. With the machine running, stream in the olive oil in a drizzle. Season with salt and black pepper. Add lemon juice to taste.", 
            "Add shallots, gruyere, half the breadcrumbs, 1/4 cup salsa verde (about half; you can use the rest to dress eggs or any roasted meat) and some freshly ground black pepper to the bowl with the summer squash and toss. Transfer to a 9×9-inch (or equivalent; I used a 9-inch round cast-iron skillet) baking dish. Scatter remaining breadcrumbs over the top and bake 35 to 40 minutes, until the squash is tender and the crumbs are crisp."
        ], 
        "date": "2014-07-22T12:23:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 ounce dried mushrooms (porcini, morels, or shitakes)", 
            "1/2 cup olive oil", 
            "2 sprigs of rosemary", 
            "4 sprigs of sage", 
            "1 large yellow onion, peeled and thinly sliced", 
            "3 garlic cloves, peeled and thinly sliced", 
            "1 1/2 teaspoons salt", 
            "1/4 tsp freshly ground white pepper", 
            "1 pound white button mushrooms, cleaned and thinly sliced", 
            "1 pound shitake mushrooms stemmed, cleaned and thinly sliced", 
            "6 cups chicken stock or water", 
            "1 cup heavy cream", 
            "2 tablespoons unsalted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/01/balthazars-cream-of-mushroom-soup.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Gluten-Free", 
            "Mushrooms", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2007/01/superlatively-souper/", 
        "title": "balthazar’s cream of mushroom soup", 
        "directions": [
            "1.\tSoak the dry mushrooms in 1 cup of warm water for 20 to 30 minutes, until plump.", 
            "2.\tStrain the soaking liquid through a coffee filter to remove grit and reserve, along with the reconstituted mushrooms, until needed.", 
            "3.\tHeat the olive oil in a large pot over a medium flame. Bundle the rosemary and sage together and tie with kitchen twine.  When the oil is hot, add the herb bundle and sizzle for a few minutes on both sides to infuse the oil.", 
            "4.\tAdd the onion, garlic, salt and pepper and cook for 5 minutes, until the onion is soft and translucent but not brown.", 
            "5.\tTurn the flame to high and add the white mushrooms and shitakes.", 
            "6.\tCook for 10 minutes, during which the mushrooms will give off their liquid (which should evaporate quickly due to the high heat) and deflate significantly. Stir occasionally.", 
            "7.\tAdd the chicken stock and the dried mushrooms along with the soaking water.", 
            "8.\tSimmer for 30 minutes. Remove the herbs, then add the cream and butter. Working in batches, puree the soup in a blender until smooth. Return to the pot and keep at a very low simmer until ready to serve.", 
            "Deb adjustments: I used far less olive oil, replaced some of the chicken stock with beef, as I had it on hand and love mixing that flavor with mushrooms; half as much cream, preferring a more potent soup and thyme instead of rosemary, also due to personal preference."
        ], 
        "date": "2007-01-04T14:38:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (1/2 stick or 2 ounces) butter", 
            "1 small onion, finely chopped", 
            "3 pounds Swiss chard, leaves and stems separated and both cut into 1-inch pieces", 
            "Pinch of freshly grated nutmeg", 
            "2 cups heavy cream or whole milk", 
            "2 garlic cloves, minced", 
            "2 tablespoons flour", 
            "2 pounds medium red-skinned sweet potatoes (yams), peeled and cut into 1/8-inch thick rounds", 
            "1 tablespoon minced fresh Italian parsley", 
            "1 tablespoon minced fresh thyme", 
            "Fine sea salt", 
            "Freshly ground black pepper", 
            "1 1/4 cups (about 5 ounces) coarsely grated Gruyére cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/swiss-chard-and-sweet-potato-gratin.jpg?w=753", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Freezer Friendly", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Swiss Chard", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/11/swiss-chard-and-sweet-potato-gratin/", 
        "title": "swiss chard and sweet potato gratin", 
        "directions": [
            "Prep greens: Cook onion in 2 tablespoons butter in a wide 8-quart heavy pot over moderately low heat, stirring, until softened. Add chard stems, pinch of nutmeg, and salt and pepper to taste and cook, stirring, until vegetables are tender but not browned, about 8 minutes. Increase heat to moderately high and add chard leaves by large handfuls, stirring, until all greens are wilted. Season with salt and pepper then transfer greens to a colander to drain well and press out liquid with back of a large spoon.", 
            "Make sauce: Combine cream or milk and garlic in small saucepan; bring to simmer; keep warm. Melt two tablespoons butter in a medium heavy saucepan over moderate heat and stir in flour. Cook roux, whisking, one minute, then slowly whisk in warm cream/milk and boil, whisking, one minute. Season sauce with salt and pepper.", 
            "Assemble gratin: Preheat oven to 400°F. Butter deep 9×13 baking dish. Spread half of sweet potatoes in the prepared baking dish. Sprinkle with salt, pepper, a quarter of the herbs and a 1/4 cup of the cheese. Distribute half of the greens mixture over the cheese, then sprinkle salt, pepper, a quarter of the herbs and 1/4 cup of the cheese over it. Pour half of bechamel sauce over the first two layers then continue with the remaining sweet potatoes, more salt, pepper, herbs and cheese and then the remaining greens, salt, pepper and herbs. Pour the remaining sauce over the top of the gratin, pressing the vegetables slightly to ensure that they are as submerged as possible. Sprinkle with the last 1/4 cup of cheese.", 
            "Bake gratin for about 1 hour until golden and bubbly, and most of the liquid is absorbed. Let stand 10 minutes before serving. ", 
            "Do ahead: You can make the entire gratin but not bake it up to a day in advance and keep it in the fridge. You can also make and bake the gratin and reheat it. Gratins reheat well, but they take almost as much time to gently heat through as they do to bake in the first place, especially deep ones like this. As for reheating, already baked and frozen, I will find out very soon! But I am near-positive it will be fine."
        ], 
        "date": "2009-11-12T17:08:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups plus 1 tablespoon all-purpose flour and more for dusting", 
            "1 tablespoon plus 1/2 cup sugar", 
            "1 teaspoon salt", 
            "1 teaspoon baking powder", 
            "11 tablespoons cold unsalted butter, in 11 slices", 
            "1/2 cup long-grain rice", 
            "3 cups milk", 
            "2 teaspoons grated lemon zest", 
            "1/2 teaspoon almond extract (optional)", 
            "1/2 cup blanched almonds, finely ground in food processor", 
            "3 large eggs", 
            "Confectioners’ sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/03/swiss-easter-rice-tart.jpg?w=750", 
        "tags": [
            "Easter", 
            "Photo", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/03/swiss-easter-rice-tart/", 
        "title": "swiss easter rice tart", 
        "directions": [
            "1. Combine 1 1/2 cups flour, 1 tablespoon sugar, 1/2 teaspoon salt and the baking powder in food processor. Pulse to blend. Add 10 tablespoons butter and pulse 3 to 4 times, until butter is in pea-size pieces. Sprinkle in 3 tablespoons cold water. Pulse 4 times. Dough will not come together. Turn dough out on lightly floured work surface and knead gently a few times to form a disk. Wrap in plastic and refrigerate at least 1 hour.", 
            "2. Meanwhile, half fill a 3-quart saucepan with water, bring to a boil, stir in rice, lower heat to medium and cook until rice is soft, about 15 minutes. Drain rice and return it to saucepan. Add milk, remaining butter, 1/2 cup sugar and remaining salt. Bring to a boil over medium heat. Reduce heat to low and simmer until mixture has thickened almost to a risotto consistency, about 25 minutes.", 
            "3. Place saucepan in a large bowl of ice and water 10 minutes, to cool mixture to tepid. PurÃ©e in food processor. Pour into a bowl and add lemon zest. Mix ground almonds and extract if using with 1 tablespoon flour and add to bowl. Stir in eggs one at a time.", 
            "4. Place oven rack in lowest position and preheat oven to 350 degrees. Remove pastry from refrigerator and place on lightly floured surface. Lightly dust top with flour. Use a rolling pin to press down on dough to soften it. Roll out disk to 12 inches in diameter. Transfer to a 10-inch tart pan with a removable bottom. Press dough evenly into pan. Trim edges flush with pan. Pour filling into pastry.", 
            "5. Bake about 35 minutes (mine took 45), until filling is set and golden. Cool on a rack. Dust with sifted confectionersâ€™ sugar before serving."
        ], 
        "date": "2008-03-27T21:47:13+00:00"
    }, 
    {
        "ingredient_list": [
            "28 ounces (800 grams) whole peeled tomatoes from a can (San Marzano, if you can find them)*", 
            "5 tablespoons (70 grams) unsalted butter", 
            "1 medium-sized yellow onion, peeled and halved", 
            "Salt to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/tomato-sauce-with-butter-and-onion.jpg?w=753", 
        "tags": [
            "Budget", 
            "Date Night", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/01/tomato-sauce-with-butter-and-onions/", 
        "title": "tomato sauce with onion and butter", 
        "directions": [
            "Put the tomatoes, onion and butter in a heavy saucepan (it fit just right in a 3-quart) over medium heat. Bring the sauce to a simmer then lower the heat to keep the sauce at a slow, steady simmer for about 45 minutes, or until droplets of fat float free of the tomatoes. Stir occasionally, crushing the tomatoes against the side of the pot with a wooden spoon. Remove from heat, discard the onion, add salt to taste (you might find, as I did, that your tomatoes came salted and that you didn’t need to add more) and keep warm while you prepare your pasta.", 
            "Serve with spaghetti, with or without grated parmesan cheese to pass.", 
            "* I liked this enough to make us more the next day, but I only had a can of tomato puree. It also worked well, despite having slightly less texture. You will need a little less simmering time as the tomatoes are already broken down."
        ], 
        "date": "2010-01-17T13:36:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups hazelnuts", 
            "1 cup granulated sugar, divided", 
            "1/4 teaspoon fine sea or table salt", 
            "4 large egg whites", 
            "2 teaspoons instant espresso powder (optional)", 
            "8 ounces (about 1 1/3 cups) miniature chocolate chips or bittersweet chocolate, chopped small"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/ugly-but-good-brutti-ma-buoni-cookies1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Italian", 
            "Passover", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/01/ugly-but-good-cookies/", 
        "title": "ugly but good cookies", 
        "directions": [
            "Heat oven to 350 degrees F. Place hazelnuts on a baking sheet and toast in oven for 10 minutes, rolling around once to ensure they cook evenly. Check the color; I believe that they taste best when toasted to a real golden color. Put them back in for 2 minutes at a time and check again if they’re not there yet. Let cool completely. (Putting the tray outside in winter for all of 5 minutes does the trick.) Place nuts in a dishtowel and roll them around so that the skins largely come off. Reduce heat to 300 degrees F.", 
            "Transfer toasted, peeled hazelnuts to a food processor and add 1/4 cup sugar and the salt. Grind until they reach your desired consistency; I went for well-chopped but not fully powdery. ", 
            "In a large bowl, beat egg whites with an electric mixer until very foamy. Slowly pour in remaining 3/4 cup sugar, beating the whole time. Beat until stiff peaks form; when you lift the beater, they should flop over slightly after forming a peak. Fold in nuts, espresso powder (if using) and chocolate.", 
            "Line two large baking sheets with parchment paper or a nonstick baking mat. Scoop batter into about 1 1/2 tablespoon mounds with about an inch of space between them. Bake for 25 minutes, until very faintly golden. Let cool on baking sheet for 5 to 10 minutes, after which they’ll be easier to remove with a thin spatula. Let finish cooling on racks. ", 
            "Cookies keep at room temperature in an airtight container for a week, but only if you don’t tell anyone they’re there."
        ], 
        "date": "2016-01-07T12:11:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup wild rice, uncooked", 
            "3 tablespoons unsalted butter", 
            "2 1/2 pounds (about 4) Vidalia onions, or other sweet onions, quartered and very thinly sliced", 
            "6 cups chicken or vegetable stock", 
            "Herb bundle (see Note above)", 
            "Salt and pepper", 
            "8 slices baguette", 
            "2 tablespoons extra-virgin olive oil", 
            "4 ounces Maytag or other young, not too sharp, blue cheese, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/vidalia-onion-soup-with-wild-rice-and-blue-cheese.jpg?w=750", 
        "tags": [
            "Easter", 
            "Grain/Rice", 
            "Onions", 
            "Photo", 
            "Soup", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/05/vidalia-onion-soup-with-wild-rice/", 
        "title": "vidalia onion soup with wild rice", 
        "directions": [
            "Cook the wild rice in a small saucepan according to package directions. Usually, 2 cups of water is the amount needed for 1/2 cup wild rice. Bring to a boil, reduce heat to a very low simmer and cover the pot. Let it cook, undisturbed, until the rice is tender and the water is absorbed, about 50 to 55 minutes. Set aside. ", 
            "Melt the butter in the bottom of a 4- to 5-quart saucepan or Dutch oven over moderately low heat. Add the onions, toss to coat them in oil and cover the pot. Reduce the heat to real low and let them slowly steep for 15 minutes. They don’t need your attention; you can even check your email, eh, who are we kidding, Facebook.", 
            "After 15 minutes, uncover the pot, raise the heat slightly and season the onions with a bit of salt and pepper. Cook onions, stirring frequently, for another 15 to 25 minutes, until they are tender, limp and sweet. Add the stock and simmer for 20 minutes. Wrap the herbs (see Note up top) in a small piece of cheesecloth and tie with kitchen string. Trotter suggests you drop the bundle into the broth for one minute, then remove it, but after going through such an effort to make one, I decided to leave mine in a little longer; it made me feel better. Adjust seasonings with additional salt and pepper, if needed.", 
            "Heat oven to 400 degrees. Brush both sides of the baguette slices with oil. Bake on a baking sheet until light golden brown, 5 to 10 minutes. While the croutons are still warm, spread them with blue cheese.", 
            "To serve, divide the rice among four bowls, and ladle broth and onions on top. Float two croutons in the center of each bowl, and sprinkle with more pepper. Eat immediately."
        ], 
        "date": "2012-05-21T16:02:02+00:00"
    }, 
    {
        "ingredient_list": [
            "2 ounces (4 tablespoons) vodka", 
            "1 1/2 ounces (3 tablespoons) coffee liqueur (such as kahlua or tia maria)", 
            "1 1/2 ounces (3 tablespoons) half-and-half or 1 ounce (2 tablespoons) milk plus 1/2 ounce (1 tablespoon) heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/white-russian1.jpg?w=640", 
        "tags": [
            "Date Night", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/02/white-russian/", 
        "title": "white russian", 
        "directions": [
            "Fill a short — or rocks — glass with ice. Add vodka and coffee liqueur. Finish with the cream. For the layered effect, pour the cream in a very slow drizzle off the back of a spoon held over — but not touching — the surface of the drink. To swirl it prettily, insert a stirrer along the inner wall of the glass only as a deep as the cream and move it around in a slow circle."
        ], 
        "date": "2016-02-19T12:01:37+00:00"
    }, 
    {
        "ingredient_list": [
            "Butter for dish", 
            "2 1/2 pounds (about 1 1/8 kg) zucchini", 
            "2 1/2 teaspoons kosher salt (I use Diamond brand, use 1 1/2 of other brands)", 
            "1/2 cup (90 grams) plain, uncooked white rice", 
            "1 medium onion, minced (about 1 cup)", 
            "5 tablespoons (75 ml) olive oil, divided", 
            "2 large cloves garlic, mashed or finely minced", 
            "2 tablespoons (15 grams) all-purpose flour (optional)", 
            "1/2 cup milk, as needed, although water or broth of your choice would work just fine [1/2 cup needed for streamlined directions, less for original]", 
            "2/3 cup (55 grams) grated Parmesan cheese, divided", 
            "Salt and pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/zucchini-rice-and-cheese-gratin1.jpg?w=750", 
        "tags": [
            "Budget", 
            "Casserole", 
            "Freezer Friendly", 
            "Grain/Rice", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Summer", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2015/09/zucchini-rice-cheese-gratin/", 
        "title": "zucchini rice and cheese gratin", 
        "directions": [
            "\nNew, simplified directions:", 
            "Heat oven to 325 degrees F. Oil or butter a 2-quart baking dish, or 2 smaller 1-quart dishes (as I did, with the intention of freezing one).", 
            "Prepare zucchini: Wash zucchini and trim ends. Halve lengthwise, and if seeds are particularly large, core them out. Coarsely grate and place in a large bowl.", 
            "Prepare remaining ingredients: In a large frying pan, cook the onions slowly in 3 tablespoons oil for 8 to 10 minutes until tender and translucent. Raise heat slightly and stir several minutes until very lightly browned. Stir in garlic and cook another minute. Add uncooked rice and sauté for another two minutes. Season generously with salt and pepper.\nAssemble gratin: Transfer to bowl with zucchini and stir together with 1/2 cup liquid of your choice and all but 2 tablespoons cheese. Taste and adjust seasoning if needed. Transfer to prepared baking dish.", 
            "Bake gratin: Cover tightly with foil and bake for 50 to 60 minutes, until rice within is cooked but not mush. Increase oven temperature to 450 degrees. Remove foil, drizzle top with remaining olive oil (or dot with butter), sprinkle on remaining cheese and bake uncovered until browned and crisp on top, about another 10 to 15 minutes. For extra color, you can run it under the broiler for one minute at the end.\nDirections as originally published here:", 
            "Prepare zucchini: Wash zucchini and trim ends. Halve lengthwise, and if seeds are particularly large, core them out. Coarsely grate and place in a colander set over a bowl. Toss with kosher salt. Let drain for 5 minutes, says Julia Child, but more like 20 or, if you’ve got the time, up to 30 minutes.", 
            "Save drained liquid and squeeze a handful of the zucchini and taste. If it’s very salty, rinse and drain it again (not saving liquid this time). Squeeze all of the zucchini in handfuls, gently, collecting any juices in the bowl of drained liquid. Blot dry on paper towels.", 
            "Prepare rice: Boil for exactly 5 minutes in salted water. Drain and set aside. [In comments I’ve read about this recipe online, many people say that they skip this step and it all works out in the oven. But I didn’t this time.]\nPrepare remaining ingredients: In a large frying pan, cook the onions slowly in 3 tablespoons oil for 8 to 10 minutes until tender and translucent. Raise heat slightly and stir several minutes until very lightly browned. Stir in the grated and dried zucchini and garlic; season with salt and pepper. Toss and turn for 5 to 6 minutes until the zucchini is almost tender.  Sprinkle in the flour, stir over moderate heat for 2 minutes, and remove from heat.\nAssemble dish: Measure the drained liquid from the zucchini. If you have less than 2 1/2 cups, add milk to bring the level up to it. (I became sidetracked and mine drained for an hour; I ended up with the full 2 1/2 cups and needed no milk.)\nStir into zucchini-onion mixture, return pan to stove over medium-high heat and bring to a simmer, stirring. Remove from heat again, stir in par-cooked rice and all but 2 tablespoons cheese. Taste and adjust seasoning if needed.", 
            "Turn into a 2-quart baking dish, or 2 smaller 1-quart dishes (as I did, with the intention of freezing one). Sprinkle with reserved cheese and remaining olive oil, although I apparently used butter instead, because: butter\nYou can cook it right away, or let it sit until 30 minutes before you want to serve it.", 
            "30 minutes before serving: Heat oven to 425 degrees. Bake in upper third of oven until bubbling and browned on top, about 25 to 30 minutes. (If yours begins to brown too quickly, you can cover it with foil until the last 5 minutes.) The rice should absorb all the liquid. Serve immediately.", 
            ""
        ], 
        "date": "2015-09-16T12:05:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup uncooked white rice, long-grain is suggested but use whatever you prefer", 
            "5 tablespoons olive oil", 
            "1 1/2 pounds zucchini (about 3 medium), sliced 1/4-inch thick", 
            "1/2 pound plum tomatoes, sliced 1/4-inch thick", 
            "Table salt and freshly ground black pepper", 
            "1 medium onion, halved lengthwise and thinly sliced", 
            "3 garlic cloves, minced", 
            "2 large eggs, lightly beaten", 
            "1 teaspoon chopped fresh thyme leaves", 
            "1/2 cup grated Parmesan, divided"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/zucchini-tomato-and-rice-gratin.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Gluten-Free", 
            "Grain/Rice", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2012/07/zucchini-tomato-and-rice-gratin/", 
        "title": "zucchini, tomato and rice gratin", 
        "directions": [
            "Preheat oven to 450°F. Cook the rice according to your favorite method. The package directions work in some cases, but check my notes above about adjustments I find I have to make. If you cook the rice in a large, wide-ish covered skillet, it might cook even faster but you’ll have the chance to use it again (and save on dirty dishes) when you need to cook the onions in a bit.", 
            "While rice cooks, coat two large (or, if you have the same pitifully small oven as I do, three smaller) baking sheets each with a tablespoon of a of olive oil (a bit less for smaller pans). Spread zucchini and tomato slices on the baking sheets in as close to a single layer as you can. Sprinkle with 1/2 teaspoon salt and a few grinds of black pepper. Roast tomatoes for 10 minutes and zucchini for 20. Flip zucchini halfway through; it’s not worth the messy effort for the tomatoes. Leave oven on.", 
            "Heat large, heavy skillet (such as the one you used to cook your rice) over medium heat. Once hot, add 2 tablespoons olive oil, heat oil, then add onions, garlic and 1/4 teaspoon salt to pan. Cover and reduce heat to low, cooking onion until limp and tender, about 15 to 20 minutes. Stir occasionally.", 
            "Combine onion mixture, rice, eggs, thyme, half of your grated cheese and a half-tablespoon of olive oil in a bowl. Add a good amount of freshly ground black pepper. Use the remaining half-tablespoon of olive oil to coat a shallow 2-quart baking dish. Spread half of rice mixture in bottom of dish. Arrange half of roasted zucchini on top. Spread remaining rice mixture over it and please don’t worry about being neat about this; dinner will be “rustic” tonight! Arrange remaining zucchini on top, then tomato slices. Sprinkle with remaining grated cheese and bake until set and golden brown, about 20 minutes. Each oven varies, but I find mine does the very best browning when the dish is on a rack near the top of the oven."
        ], 
        "date": "2012-07-31T17:55:18+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/zuni-cafe-roast-chicken-bread-salad1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Date Night", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/12/zuni-cafe-roast-chicken-bread-salad/", 
        "title": "zuni cafe’s roasted chicken + bread salad", 
        "directions": [
            "Preheat the broiler. Carve off all of the bottom and most of the top and side crusts from your bread (you can reserve these to use as croutons for soup or another salad). Tear bread into irregular 2- to 3-inch chunks, wads, bite-sized bits and fat crumbs. You should get about 4 cups.", 
            "Toss them with just a tablespoon or two of olive oil, lightly coating them, and broil them very briefly, just to lightly color the edges. If you’d like to toast the pine nuts (recommended) you can put them on your broiler tray as well, but watch them very carefully — they cook quickly!", 
            "Combine about 1/4 cup of the olive oil with the Champagne or white wine vinegar and salt and pepper to taste. Toss about 1/4 cup of this tart vinaigrette with the torn bread in a wide salad bowl; the bread will be unevenly dressed. Taste one of the more saturated pieces. If it is bland, add a little salt and pepper and toss again.", 
            "Heat a spoonful of the olive oil in a small skillet, add the garlic and scallions, and cook over medium-low heat, stirring constantly, until softened. Don’t let them color. Scrape into the bread and fold to combine. Drain the plumped currants and fold them in, along with the pine nuts, if they were not already mixed with the bread scraps from the broiling step. Dribble the chicken stock or lightly salted water over the salad and fold again.", 
            "Taste a few pieces of bread — a fairly saturated one and a dryish one. If it is bland, add salt, pepper, and/or a few drops of vinegar, then toss well.", 
            "If you’re going to serve the salad under the roast chicken (recipe above), you can pile the bread salad on the serving dish you want to use and tent it with foil. If you want to serve it separately, do the same, but in a 1-quart shallow baking dish. Hang onto the bowl you mixed it in — you’ll use it again.", 
            "Place the salad in the oven after you flip the chicken the final time, for about 5 to 10 minutes.", 
            "Tip the bread salad back into the salad bowl. It will be steamy-hot, a mixture of soft, moist wads, crispy-on-the-outside-but-moist-in-the-middle-wads, and a few downright crispy ones. Drizzle and toss with a spoonful of the pan juices. Add the greens, a drizzle of vinaigrette, and fold well. Taste again."
        ], 
        "date": "2008-12-10T14:30:48+00:00"
    }
]