{
  "date": "2016-01-26T12:08:58+00:00",
  "directions": [
    "Heat oven to 425 degrees. Butter a 9-inch springform pan and this is very important, wrap the outside of the springform, focusing on the places where the ring meets the base, tightly in aluminum foil. Set aside.",
    "Bring a large pot of well-salted water to a boil. If using broccoli rabe, add it to the pot and boil for 1 to 2 minutes, until it has some give. Fish it out with a large slotted spoon and drain it well. Set aside.",
    "Add spaghetti to boiling water and cook until (this is also important) 2 minutes shy of done, so very al dente, as the spaghetti will continue cooking in the oven. Drain well and let cool slightly.",
    "If using broccoli rabe, wring all extra moisture out of it and blot greens on paper towels to be extra careful. Mince rabe into very small bits. You’ll have about 1 cup total.",
    "In a large bowl, whisk eggs and milk together with salt and pepper. Stir in all but 1/2 cup of each cheese and chopped rabe, if using. Add spaghetti and toss to coat. ",
    "Pour into prepared springform and sprinkle remaining cheese on top. Bake for 35 to 40 minutes (without greens) and up to 15 minutes more (with greens, as they add moisture too), until the cheese is melted and bubbling and a knife inserted into the center of the pie and turned slightly will not release any loose egg batter into the center. If the top of your pie browns too quickly before the center is set, cover it with foil for the remaining cooking time.",
    "Turn on your oven’s broiler. Broil the pie a few inches from the heat for 2 to 3 minutes, until browned on top. Cut along springform ring to loosen, then remove ring. Run a spatula underneath the pie to loosen the base and slide onto a serving plate. Cut into wedges."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/spaghetti-pie-with-pecorino-and-black-pepper1.jpg?w=640",
  "ingredient_list": [],
  "tags": [
    "Casserole",
    "Italian",
    "Pasta",
    "Photo",
    "Vegetarian",
    "Winter"
  ],
  "title": "spaghetti pie with pecorino and black pepper",
  "url": "https://smittenkitchen.com/2016/01/spaghetti-pie-with-pecorino-and-black-pepper/"
}