{
  "date": "2015-09-16T12:05:37+00:00",
  "directions": [
    "\nNew, simplified directions:",
    "Heat oven to 325 degrees F. Oil or butter a 2-quart baking dish, or 2 smaller 1-quart dishes (as I did, with the intention of freezing one).",
    "Prepare zucchini: Wash zucchini and trim ends. Halve lengthwise, and if seeds are particularly large, core them out. Coarsely grate and place in a large bowl.",
    "Prepare remaining ingredients: In a large frying pan, cook the onions slowly in 3 tablespoons oil for 8 to 10 minutes until tender and translucent. Raise heat slightly and stir several minutes until very lightly browned. Stir in garlic and cook another minute. Add uncooked rice and sauté for another two minutes. Season generously with salt and pepper.\nAssemble gratin: Transfer to bowl with zucchini and stir together with 1/2 cup liquid of your choice and all but 2 tablespoons cheese. Taste and adjust seasoning if needed. Transfer to prepared baking dish.",
    "Bake gratin: Cover tightly with foil and bake for 50 to 60 minutes, until rice within is cooked but not mush. Increase oven temperature to 450 degrees. Remove foil, drizzle top with remaining olive oil (or dot with butter), sprinkle on remaining cheese and bake uncovered until browned and crisp on top, about another 10 to 15 minutes. For extra color, you can run it under the broiler for one minute at the end.\nDirections as originally published here:",
    "Prepare zucchini: Wash zucchini and trim ends. Halve lengthwise, and if seeds are particularly large, core them out. Coarsely grate and place in a colander set over a bowl. Toss with kosher salt. Let drain for 5 minutes, says Julia Child, but more like 20 or, if you’ve got the time, up to 30 minutes.",
    "Save drained liquid and squeeze a handful of the zucchini and taste. If it’s very salty, rinse and drain it again (not saving liquid this time). Squeeze all of the zucchini in handfuls, gently, collecting any juices in the bowl of drained liquid. Blot dry on paper towels.",
    "Prepare rice: Boil for exactly 5 minutes in salted water. Drain and set aside. [In comments I’ve read about this recipe online, many people say that they skip this step and it all works out in the oven. But I didn’t this time.]\nPrepare remaining ingredients: In a large frying pan, cook the onions slowly in 3 tablespoons oil for 8 to 10 minutes until tender and translucent. Raise heat slightly and stir several minutes until very lightly browned. Stir in the grated and dried zucchini and garlic; season with salt and pepper. Toss and turn for 5 to 6 minutes until the zucchini is almost tender.  Sprinkle in the flour, stir over moderate heat for 2 minutes, and remove from heat.\nAssemble dish: Measure the drained liquid from the zucchini. If you have less than 2 1/2 cups, add milk to bring the level up to it. (I became sidetracked and mine drained for an hour; I ended up with the full 2 1/2 cups and needed no milk.)\nStir into zucchini-onion mixture, return pan to stove over medium-high heat and bring to a simmer, stirring. Remove from heat again, stir in par-cooked rice and all but 2 tablespoons cheese. Taste and adjust seasoning if needed.",
    "Turn into a 2-quart baking dish, or 2 smaller 1-quart dishes (as I did, with the intention of freezing one). Sprinkle with reserved cheese and remaining olive oil, although I apparently used butter instead, because: butter\nYou can cook it right away, or let it sit until 30 minutes before you want to serve it.",
    "30 minutes before serving: Heat oven to 425 degrees. Bake in upper third of oven until bubbling and browned on top, about 25 to 30 minutes. (If yours begins to brown too quickly, you can cover it with foil until the last 5 minutes.) The rice should absorb all the liquid. Serve immediately.",
    ""
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/zucchini-rice-and-cheese-gratin1.jpg?w=750",
  "ingredient_list": [
    "Butter for dish",
    "2 1/2 pounds (about 1 1/8 kg) zucchini",
    "2 1/2 teaspoons kosher salt (I use Diamond brand, use 1 1/2 of other brands)",
    "1/2 cup (90 grams) plain, uncooked white rice",
    "1 medium onion, minced (about 1 cup)",
    "5 tablespoons (75 ml) olive oil, divided",
    "2 large cloves garlic, mashed or finely minced",
    "2 tablespoons (15 grams) all-purpose flour (optional)",
    "1/2 cup milk, as needed, although water or broth of your choice would work just fine [1/2 cup needed for streamlined directions, less for original]",
    "2/3 cup (55 grams) grated Parmesan cheese, divided",
    "Salt and pepper"
  ],
  "tags": [
    "Budget",
    "Casserole",
    "Freezer Friendly",
    "Grain/Rice",
    "Photo",
    "Put An Egg On It",
    "Side Dish",
    "Summer",
    "Vegetarian",
    "Zucchini"
  ],
  "title": "zucchini rice and cheese gratin",
  "url": "https://smittenkitchen.com/2015/09/zucchini-rice-cheese-gratin/"
}