[
    {
        "ingredient_list": [
            "4 ripe peaches", 
            "1/3 cup (55 grams) whole almonds", 
            "1/4 cup (50 grams) sugar", 
            "3 tablespoons (45 grams) cold unsalted butter, cubed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/9565648165_acd0965ca4_o.jpg?w=750", 
        "tags": [
            "Announcements", 
            "Crumbles/Crisps", 
            "Gluten-Free", 
            "Peach", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/08/almond-crisped-peaches-uk-book-tour/", 
        "title": "almond-crisped peaches + uk book tour", 
        "directions": [
            "Optional extras: 1/4 cup (20 grams) rolled oats, 1/8 teaspoon ground cinnamon, pinch of sea salt", 
            "Heat oven to 350 degrees. Halve peaches and remove pits. Place fruit cut side up in baking dish. In a food processor, grind almonds and sugar together until coarsely ground (with a few pebbles left). Add oats and other flavorings, if using, then butter, pulsing the machine until the ingredients are just blended. Spoon the almond mixture into the center of each peach, then press it flat, as if icing the tops of the peaches with it. Bake for 45 minutes to 1 hour (baking time varies with peach size), until the top is brown and crisp and you can easily slice through the fruit with a fork or spoon. ", 
            "Serve warm or at room temperature, with creme fraiche, lightly sweetened whipped cream or even plain yogurt, cold, for breakfast.", 
            "Without a food processor: Use an equivalent weight of almond meal or finely chopped almonds, stir in sugar and any other ingredients, then the same volume of butter, melted. It will be less clumpy, but the oven won’t know the difference."
        ], 
        "date": "2013-08-22T11:35:10+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/08/2804182114_6d9ebd8506_b.jpg?w=753", 
        "tags": [
            "Bourbon", 
            "Fruit", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/08/bourbon-peach-hand-pies/", 
        "title": "bourbon peach hand pies", 
        "directions": [
            "1. To make the pastry, in a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour. If preparing ahead of time, the dough can be stored at this point for up to one month in the freezer.", 
            "2. Divide the refrigerated dough in half. On a lightly floured work surface, roll out one half of the dough to 1/8-inch thickness. Using a 4 1/2-inch-round biscuit cutter, cut seven circles out of the rolled dough. Transfer the circles to a parchment-lined baking sheet, and place in the refrigerator to chill for about 30 minutes. Repeat the rolling, cutting, and chilling process with the remaining half of dough. (I used a 4-inch cutter–if you can call a “cutter” the tin edge of the container that holds my smaller round cutters–and managed to get 12 from each dough half, after rerolling the scraps.)", 
            "3. Make the filling: Peel and chop the peaches into small bits (approx. 1/2-inch dice), much smaller than you’d use for a regular-sized pie. Mix them with the flour, sugar and pinch of salt, and add the bourbon and vanilla, if you wish.", 
            "4. Remove the chilled dough from the refrigerator, and let stand at room temperature until just pliable, 2 to 3 minutes. Spoon about 1 to 2 tablespoons filling (use the smaller amount for a 4-inch circle) onto one half of each circle of dough. Quickly brush a little cold water around the circumference of the dough, and fold it in half so the other side comes down over the filling, creating a semicircle. Seal the hand pie, and make a decorative edge by pressing the edges of the dough together with the back of a fork. Repeat process with remaining dough. Place the hand pies back on the parchment-lined baking sheet, and return to the refrigerator to chill for another 30 minutes.", 
            "5. Heat oven to 375 degrees. Remove the chilled hand pies from the refrigerator, cut a small slit in each and lightly brush with the egg yolk wash. Sprinkle sanding sugar generously over the pies, and place pies in the oven to bake. Bake until the hand pies are golden brown and just slightly cracked, about 20 minutes. Remove the pies from the oven, and let stand to cool slightly before serving."
        ], 
        "date": "2008-08-28T16:12:48+00:00"
    }, 
    {
        "ingredient_list": [
            "For the fruit", 
            "1 1/2 (about 4 cups) pounds peaches, pitted and cut into slices*", 
            "1 pint (about 2 cups) blueberries, rinsed and dried", 
            "2/3 cup packed dark-brown sugar", 
            "2 tablespoons flour", 
            "2 tablespoons fresh lemon juice", 
            "1/4 teaspoon ground cinnamon", 
            "1/4 teaspoon salt", 
            "For the biscuit topping", 
            "3/4 cup (3 1/4 ounces) all-purpose flour", 
            "1/4 cup fine stone-ground cornmeal (yellow or white)", 
            "3 tablespoons dark brown sugar", 
            "1 1/2 teaspoons baking powder", 
            "1/4 teaspoon salt", 
            "3 tablespoons cold unsalted butter, cut into pieces", 
            "1/2 cup buttermilk"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cornmeal-drop-biscuit-peach-blueberry-cobbler1.jpg?w=500", 
        "tags": [
            "Blueberries", 
            "Peach", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/07/cornmeal-drop-biscuit-peach-blueberry-cobbler/", 
        "title": "peach blueberry cobbler", 
        "directions": [
            "Preheat oven to 425°F (218°C).Toss peaches with blueberries, sugar, flour, lemon juice, cinnamon and salt in the bottom of a 2-quart ovenproof dish.", 
            "Make the biscuit dough: Stir together the flour, cornmeal, brown sugar, baking powder and salt. Cut the butter into the dry mixture with your fingertips, a fork or a pastry blender. Stir in buttermilk with a rubber spatula until a wet, tacky dough comes together.", 
            "Plop spoonfuls of the biscuit dough over the filling; don’t worry about covering entire surface. Bake until the cobbler’s syrup is bubbly and the biscuit tops are browned, about 20 to 25 minutes. Let cool slightly and scoop it into bowls. Top with whipped cream, vanilla ice cream, of if you’re having an accidental run-in with this cobbler before noon, plain yogurt.", 
            "* Want to peel your peaches? Here’s how: Cut a small “x” in the bottom of each peach. Dip them in boiling water for 30 seconds, and the skins will slide right off."
        ], 
        "date": "2010-07-15T10:40:25+00:00"
    }, 
    {
        "ingredient_list": [
            "4 1/2 pounds (about 10 large or 2 kg) peaches, unpeeled, cut into 1-inch chunks or slices (I cut mine each into 8 wedges)", 
            "Zest and juice of 1 lemon", 
            "4 ounces (115 grams) unsalted butter, softened", 
            "2 cups (400 grams) granulated sugar, divided (I reduced this to 1 1/2 cups, and recommend the same)", 
            "1 1/2 cups (190 grams) all-purpose flour", 
            "2 teaspoons baking powder", 
            "1 teaspoon coarse or kosher salt", 
            "3/4 cup milk (whole is ideal; almond will work too)", 
            "1/2 cup hot water", 
            "Heavy cream, cold, for drizzling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/08/crispy-peach-cobbler1.jpg?w=640", 
        "tags": [
            "Crumbles/Crisps", 
            "Peach", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/08/crispy-peach-cobbler/", 
        "title": "crispy peach cobbler", 
        "directions": [
            "Heat oven to 350°F (175°C). Line a rimmed baking sheet with foil, to catch drips, or regret it later. ", 
            "Prepare the peaches: Place the peaches in a 9×13-inch baking pan and in roughly an even layer. Using a zester or a Microplane, finely zest the lemon evenly over the peaches and then squeeze the lemon juice evenly over the peaches, too, catching any seeds before they fall in.", 
            "Make the batter: With an electric mixer, beat butter and 3/4 of the sugar (1 1/2 cups if you use the full amount; 1 cup plus 2 tablespoons if you reduce it as I did) with sugar until sandy, about 1 minutes. Add the flour, baking powder and salt and beat until combined, about 30 seconds, then lower the speed and slowly mix in milk. Continue beating at a medium speed for 2 minutes more, until light and fluffy-ish. ", 
            "Assemble cobbler: Plop the batter in a large blobs over the peaches. Using my favorite $3.20 kitchen tool, a small offset spatula, or if you don’t have one, a butter knife, carefully spread the batter evenly over the fruit so that it’s no more than 1/2-inch thick in any place. Sprinkle with remaining sugar and drizzle the hot water evenly over the sugar. ", 
            "Bake cobbler: Place the baking dish on the foil-lined baking sheet and bake for 60 to 70 minutes, until the top is cracked and golden brown, and a toothpick inserted into the topping comes out batter-free. (It’s best to start checking it at 60 minutes.) ", 
            "Be patient: Let the cobbler sit in the baking dish on a wire rack for at least 30 minutes before serving, which will feel (and smell) like torture, but gives the peach juices a chance to slightly thicken up. To serve, scoop into bowls and drizzle with heavy cream."
        ], 
        "date": "2015-08-27T11:34:27+00:00"
    }, 
    {
        "ingredient_list": [
            "Crumbs", 
            "1/2 cup (65 grams) raw pecans", 
            "1 1/4 cups (155 grams) all-purpose flour", 
            "1/3 cup (40 grams) powdered sugar", 
            "2 tablespoons (25 grams) coarse sugar, such as turbinado or Sugar in the Raw; use granulated if you have neither", 
            "1/4 teaspoon table salt", 
            "1/4 teaspoon baking powder", 
            "6 tablespoons (85 grams) unsalted butter, melted and cooled slightly", 
            "3/4 teaspoon vanilla extract (or you can use bourbon; I’ll never tell)", 
            "Caramel", 
            "2/3 cup (135 grams) granulated sugar", 
            "2/3 cup (155 ml) heavy or whipping cream", 
            "1 tablespoon (15 ml) bourbon or whiskey or 1 teaspoon vanilla extract", 
            "Heaped 1/4 teaspoon flaky salt or level 1/4 teaspoon fine sea salt", 
            "Whipped cream", 
            "1/2 cup (120 ml) heavy or whipping cream", 
            "1 tablespoon powdered or granulated sugar (optional, or to taste)", 
            "2 tablespoons (30 grams) crème fraîche or sour cream", 
            "1/4 teaspoon vanilla extract", 
            "Peaches", 
            "Butter, for grill", 
            "4 large firm-ripe peaches (free stone, if you can find them, not that I ever do), halved and pitted", 
            "2 to 3 tablespoons (30 to 45 ml) maple syrup", 
            "1 teaspoon cinnamon sugar, or just cinnamon to sprinkle", 
            "To serve", 
            "1 pint (about 400 grams) vanilla ice cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/grilled-peach-splits1.jpg?w=640", 
        "tags": [
            "Announcements", 
            "Grilling", 
            "Ice Cream/Sorbet", 
            "Peach", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/07/grilled-peach-splits-news/", 
        "title": "grilled peach splits + news!", 
        "directions": [
            "Make crumbs: Heat oven to 350 degrees F. Line a baking sheet with parchment paper or a nonstick baking mat. Spread the nuts out in one layer and bake them, stirring occasionally, until they are well browned, 10 to 13 minutes, tossing them around once or twice to ensure they toast evenly. Cool the nuts; you can hasten this along by putting them in a bowl in your freezer for a few minutes. Leave oven on and tray lined with parchment. ", 
            "Place cooled pecans, flour, sugars, salt and baking powder in a food processor and blend until the nuts are as powdery as possible without turning to paste. Add melted butter and vanilla and pulse machine until large and small crumbs form. Spread them out on prepared baking sheet. Bake for 8 minutes, then move the crumbs around for even browning, and bake them for another 4 to 5 minutes, until they are golden brown. Let cool completely on rack, then transfer to a jar. They can be stored at room temperature in an airtight container for a week.", 
            "Make caramel: Place sugar in the bottom of a medium-sized heavy saucepan. Set over medium heat. In a few minutes, the sugar will begin to melt. Use a spoon or spatula to stir it as it melts, to ensure it does so evenly, breaking up any chunks as needed. Continue to stir continuously until the melted sugar takes on an amber color, which usually happens at about the same time the last sugar chunk melts. Remove from heat and carefully stir in cream, just a little drizzle at first (it will hiss and splatter) and then the rest. If your sugar re-solidifies, return the saucepan to the stove over medium-low and stir it until the sugar melts again. Let caramel sauce cool slightly before adding bourbon or vanilla and salt. Store caramel sauce in a glass container for up to 1 week in the fridge. Rewarm to loosen the caramel into a sauce consistency, as needed. If using it within a couple hours, you can leave it out.", 
            "Make whipped cream: Using a clean bowl and whisk (electric or a regular large one), whip cream and sugar, if using, until it holds soft peaks. Whisk in crème fraîche or sour cream, and vanilla. Keep chilled until needed. On day two, mine is still perfectly whipped. Theoretically, amazingly, it should stay whipped for a few days, using this recipe.", 
            "Grill peaches: Heat your grill to medium/medium-low and butter it generously. Brush peach halves with maple syrup and sprinkle with cinnamon sugar or just cinnamon. Place cut side down on grill and grill them gently and slowly, between 10 and 20 minutes, until they take on nice grill marks and are mostly tender to the touch. Brush a little extra maple syrup on top when you’re done, if desired. If you’d like to grill these in advance, they can be warmed before serving in a lowish oven.", 
            "Assemble splits: Place a peach half, face up, in a shallow bowl. Top with ice cream, caramel, whipped cream and a handful of cookie crumbs. Don’t forget to share."
        ], 
        "date": "2014-07-17T11:36:00+00:00"
    }, 
    {
        "ingredient_list": [
            "Streusel", 
            "1/4 cup confectioners’ sugar", 
            "1/4 teaspoon baking powder", 
            "Pinch of salt", 
            "3 to 6 tablespoons all-purpose flour (I needed the latter amount to get this into a crumble)", 
            "1/4 cup cold (1/2 stick) unsalted butter, cut into pieces", 
            "Filling", 
            "1 1/2 pounds ripe (4 to 5 medium) yellow peaches, pitted and quartered", 
            "2 to 4 tablespoons granulated sugar", 
            "Pinch of salt", 
            "5 tablespoons crème fraîche*"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/peach-and-creme-fraiche-pie.jpg?w=753", 
        "tags": [
            "Fruit", 
            "Peach", 
            "Photo", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/07/peach-and-creme-fraiche-pie/", 
        "title": "peach and crème fraîche pie", 
        "directions": [
            "Prepare pie dough: Roll out pie dough (look!: a tutorial) to about 1/8-inch thick and fit into a regular (not deep dish) pie plate, 9 1/2 to 10 inches in diameter. Trim edge to 1/2 inch; fold under and crimp as desired. Pierce bottom of dough all over with a fork. Transfer to freezer for 30 minutes. Preheat oven to 400°F right before you take it out.", 
            "Make streusel: Stir confectioners’ sugar, baking powder, salt and three tablespoons flour together in a small bowl. Add bits of cold butter, and either using a fork, pastry blender or your fingertips, work them into the flour mixture until it resembles coarse crumbs. Add additional flour as needed; I needed to almost double it to get the mixture crumbly, but my kitchen is excessively warm and the butter wanted to melt. Set aside.", 
            "Par-bake crust: Tightly press a piece of aluminum foil against frozen pie crust. From here, you ought to fill the shell with pie weights or dried beans, or you can wing it like certainly lazy people we know, hoping the foil will be enough to keep the crust shape in place. Bake for 10 minutes, then remove carefully remove foil and any weights you have used, press any bubbled-up spots in with the back of a spoon, and return the crust to the oven for another 5 to 8 minutes, or until it is lightly golden brown. Transfer to a wire rack to cool slightly. Reduce oven temperature to 375°F. ", 
            "[P.S. If you’re not overly-concerned about “soggy bottoms” (in the words of Julia Child) you can save time by skipping the par-baking step. Given the light nature of the filling, odds are good that it would not become excessively damp even without the parbake.]", 
            "Make the filling: Sprinkle quartered peaches with sugar (two tablespoons will make a just-barely-sweeteened pie; add the other two for a still not overly-sweet but sweeter pie) and salt. Let sit for 10 minutes. Spread two tablespoons crème fraîche in bottom of par-baked pie shell, sprinkle with one-third of the streusel and fan the peach quarters decoratively on top. Dot the remaining three tablespoons of crème fraîche on the peaches and sprinkle with remaining streusel.", 
            "Bake the pie: Until the crème fraîche is bubble and the streusel is golden brown, about 50 minutes. Cover edge of crust with a strip of foil if it browns too quickly. Let cool on a wire rack at least 15 minutes before serving.", 
            "I stored this in the fridge, due to the crème fraîche, and found that I liked it even better cold, with the flavors better married.", 
            "* Make your own crème fraîche: It’s true! You can make a version of it at home, using these instructions."
        ], 
        "date": "2009-07-18T13:17:07+00:00"
    }, 
    {
        "ingredient_list": [
            "Pecan sandy topping", 
            "1 cup raw pecans", 
            "1 3/4 cups all-purpose flour", 
            "1/2 cup powdered sugar", 
            "2 tablespoons coarse sugar, such as Turbinado or Sugar in the Raw; use granulated if you have neither", 
            "3/4 teaspoon table salt", 
            "1/2 teaspoon baking powder", 
            "3/4 cup unsalted butter, melted", 
            "1 1/2 teaspoons vanilla extract (or you can use bourbon; I’ll never tell)", 
            "Filling", 
            "3 1/2 to 4 pounds peaches", 
            "2 tablespoons lemon juice", 
            "1/2 cup granulated sugar", 
            "3 tablespoons cornstarch", 
            "1/4 teaspoon freshly grated nutmeg", 
            "1/4 teaspoon ground cinnamon", 
            "A couple pinches of salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/9175837136_29363bbdec_k.jpg?w=750", 
        "tags": [
            "Crumbles/Crisps", 
            "Peach", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/07/peach-and-pecan-sandy-crumble/", 
        "title": "peach and pecan sandy crumble", 
        "directions": [
            "Make topping: Heat oven to 350 degrees F. Spread the nuts out in one layer on a baking sheet and bake them, stirring occasionally, until they are well browned, 10 to 13 minutes (they will smell toasted and nutty but keep an eye on them towards the end so yours do not burn). Transfer the pan to a wire rack to cool.", 
            "In a food processor, coarsely chop 1/4 cup of cooled pecans, then set them aside in a small dish. Put remaining pecans (3/4 cup) in food processor along with about one-quarter of your flour (you can eyeballs this) and grind the nuts until they’re as powdery as possible. Add the remaining flour, powdered sugar, coarse sugar, salt, baking powder and pulse the machine two or three times, just to combine. Transfer dry mixture a bowl and add melted butter and vanilla. Stir this together until small and large clumps form, then stir in coarsely chopped pecans. Refrigerate until needed.", 
            "Make filling: Heat oven to 375 degrees F. Halve and pit your peaches, then cut them into chunks, smaller if they’re firm, large ones if the peaches are already soft. In the bottom of 3- to 4-quart (a 9×13, such as a deep lasagna pan, works here) works fine here) ovenproof baking dish, toss the peach chunks with sugar, cornstarch, lemon juice, cinnamon, nutmeg and salt. ", 
            "Remove topping from refrigerator and cover fruit thickly and evenly with topping. Bake until crumble topping is golden brown in places and fruit is bubbling and begins to creep up over the topping a little, about 40 to 50 minutes. If your topping browns too much before this happens (this doesn’t happen in my oven, but just in case) you can cover the top with foil until it is done baking.", 
            "Let cool slightly before serving, ideally with vanilla ice cream."
        ], 
        "date": "2013-07-01T11:11:51+00:00"
    }, 
    {
        "ingredient_list": [
            "4 pounds (1.8 kilograms) peaches", 
            "1 cup (237 ml) water", 
            "2 cups (400 grams) granulated sugar", 
            "Juice of one lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peach-butter1.jpg?w=500", 
        "tags": [
            "Peach", 
            "Photo", 
            "Summer", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2011/09/peach-butter/", 
        "title": "peach butter", 
        "directions": [
            "Without a food mill: Cut a small “x” in the bottom of each peach. Dip each into a pot of boiling water for 30 seconds, and then into a bowl of cold water for a minute. The peels should slide right off.  [If you have a food mill, skip the peeling step and I’ll tell you where to use it in a moment.] ", 
            "Halve your peaches and remove the pits, then cut each half into quarters (i.e. 8 chunks from each peach). Place peach chunks and water in a large pot and bring to a boil. Simmer until peaches are tender, about 15 to 20 minutes, stirring occasionally to ensure they cook evenly. If you have a food mill, run them through it to puree them and remove the skins. If you don’t have a food mill — i.e. you already peeled your peaches — you can puree in a food processor, blender or with an immersion blender. I like my peach butter very smooth, but feel free to leave any amount of texture you prefer.", 
            "Return the peaches to the large pot, add the sugar and lemon juice and bring the mixture to a good strong simmer/gentle boil, cooking them at this level for 30 to 40 minutes, stirring occasionally in the beginning and more often near the end, as it thickens up and the fruit masses risk scorching on the bottom of the pot. ", 
            "There are several methods to test for doneness: You can drizzle a ribbon of sauce across the surface; when that ribbon holds its shape before dissolve into the pot, it is done. Some people use cold or frozen plates; dollop a spoonful in the middle of one and if no water forms a ring around it in a couple minutes, it is done. Others use a spoon; if the butter remains rounded on a spoon for two minutes, it is done. You can also check the pot itself; the butter is usually done when a wooden spoon leaves a clear trail when scraped across the bottom.", 
            "Let peach butter cool (unless you’re canning it, in which, follow the directions below). If you’re not canning it, keep it in an airtight container in the fridge. It should be good for at least two weeks.", 
            "To can your peach butter: First, sterilize your jars, either by boiling them in a large, deep pot of water (which should cover the jars completely) for 10 minutes or washing them in lots of hot soapy water, rinsing and drying the parts well and then place the jars only in a 200 degree oven for 20 minutes. Then, divide your hot piping hot peach butter between your jars, leaving a little room at the top. Wipe the rims clean with a dry towel and cover the jars with their lids. Submerge the jars in a large, deep pot of boiling water for 10 minutes, either in a removable basket or using tongs to dip and remove them. Let cool completely on towels, a process that can take overnight. If canned properly, the peach butter should last indefinitely at room temperature. ", 
            "I did not have canning jars around when I made this, but am so so so in love with it that I will be buying some and making more before the last peaches are gone. I am a woman converted."
        ], 
        "date": "2011-09-02T13:48:38+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups cake flour", 
            "1 1/2 teaspoons baking powder", 
            "1 1/2 teaspoons baking soda", 
            "1 teaspoon salt", 
            "Pinch of nutmeg", 
            "3/4 cup (1 1/2 sticks or 6 ounces) unsalted butter, at room temperature", 
            "3/4 cup granulated sugar", 
            "3/4 cup dark or light brown sugar, packed", 
            "2 large eggs, lightly beaten", 
            "1 teaspoon vanilla extract", 
            "1 1/2 cups (12 ounces) buttermilk, sour cream or full-fat yogurt", 
            "3 large peaches, peeled, cored, and chopped smallish (I went for a 1/3-inch dice)", 
            "1 1/4 cups light brown sugar", 
            "1/4 cup cornstarch", 
            "1/2 cup powdered sugar", 
            "2 8-ounce packages of cream cheese, at room temperature", 
            "1/2 cup (4 ounces or 8 tablespoons) unsalted butter, at room temperature", 
            "1/2 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peach-cupcakes-with-brown-sugar-frosting1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Fruit", 
            "Peach", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/08/peach-cupcakes-with-brown-sugar-frosting/", 
        "title": "peach cupcakes with brown sugar frosting", 
        "directions": [
            "In a small bowl, whisk together the brown sugar, cornstarch and powdered sugar. In a large bowl, beat the cream cheese and butter until fluffy. Add the sugar-cornstarch mixture and vanilla, beat until frosting is smooth and light. Chill the bowl in the refrigerator until it thickens back up a bit, about 30 minutes, then spread or dollop on cooled cupcakes.", 
            "Tip: Did you know you can make your own brown sugar?", 
            "Some notes, or questions I am going to anticipate and try to answer before they are asked: I bought the brown cupcake liners at the New York Cake & Baking Supply on 22nd Street (and wow, do I miss only living a few blocks from there) but they’re also available on Amazon and from many other online baking supply shops. I piped dollops of the frosting with a Wilton #10 round tip. I have a small, inexpensive kit like this (but a different version) that pretty much works for anything I need to do. It’s a great investment for those of us that just like to dabble in decorating at home."
        ], 
        "date": "2009-08-18T16:00:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup water", 
            "1/2 cup sugar", 
            "1 cup whole raspberries", 
            "2 cups peeled chopped peaches in small/medium chunks", 
            "1/8 teaspoon almond extract (optional)", 
            "1 1/2 cups vanilla ice cream, frozen yogurt or non-dairy vanilla ice cream of your choice, slightly softened (think: soft-serve consistency)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_4528.jpg?w=750", 
        "tags": [
            "Ice Cream/Sorbet", 
            "Peach", 
            "Photo", 
            "Popsicles", 
            "Raspberries", 
            "Recipes", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/08/peach-melba-popsicles/", 
        "title": "peach melba popsicles", 
        "directions": [
            "Combine sugar and water in a small-medium saucepan (intentionally larger than it requires) and bring to a simmer; stir until sugar dissolves. Pour 1/4 cup syrup (just eyeball it — it’s 1/3 of mixture) over raspberries in a bowl. Add peach chunks to remaining syrup in saucepan and bring back to a simmer, cook for 1 to 2 minute, until they soften. Let both raspberries and peaches cool in syrup. The raspberries will quickly but you can hasten the peaches along by setting them in a larger bowl of ice water for 10 to 15 minutes. In a blender or food processor, puree peaches and their syrup first, then scrape into a measuring cup with a spout and stir in almond extract, if using, then puree raspberries and place in a smaller spouted cup. (The raspberry color would muddle the peach puree much more than vice-versa, hence blending peaches first.)\nPour a tiny splash of raspberry (you’ll only want to use half of your total sauce) in the bottom of each popsicle mold or small glass that you’re using as a mold (I like champagne flutes, for this and really everything), following by a larger splash of peaches (again, using about half the puree) and dolloping in a little softened ice cream. Repeat with remaining raspberry, peaches and ice cream. Use a skewer to lightly marble the mixtures together — I get the best swirls by swiping the skewer right along the inside of each mold. Freeze popsicles according to manufacturer’s instructions."
        ], 
        "date": "2016-08-04T11:44:04+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "2 1/2 cups (315 grams) all-purpose flour, plus more for dusting surfaces", 
            "1 tablespoons (15 grams) granulated sugar", 
            "1 teaspoon table salt", 
            "2 sticks (225 grams, 8 ounces, or 1 cup) unsalted butter, very cold", 
            "1/2 cup water, very cold ", 
            "Filling", 
            "About 3 1/2 pounds peaches (approximately 6 large, 7 medium or 8 small)", 
            "1 tablespoon fresh lemon juice, from about half a regular lemon", 
            "1/4 cup granulated sugar (see note up top; use 1/3 cup for a sweeter pie)", 
            "1/4 cup light brown sugar (ditto)", 
            "1/8 teaspoon ground cinnamon", 
            "Few gratings of fresh nutmeg", 
            "1/8 teaspoon table salt", 
            "2 tablespoons minute tapioca, ground to a powder (see note up top), or 3 tablespoons cornstarch or potato starch", 
            "To finish", 
            "1 tablespoon milk, cream or water", 
            "1 tablespoon coarse or granulated sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/7626532960_1888033ad4_k.jpg?w=750", 
        "tags": [
            "Peach", 
            "Photo", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2012/07/peach-pie/", 
        "title": "peach pie", 
        "directions": [
            "Make your pie dough: Whisk together flour, sugar and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of small peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in the ice water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough in half. Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days. Slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day.", 
            "Meanwhile, prepare your filling: Bring a large saucepan of water to boil. Prepare an ice bath. Make a small x at the bottom of each peach. Once water is boiling, lower peaches, as many as you can fit at once, into saucepan and poach for two minutes. Using a slotted spoon, transfer to ice bath for one minute to cool. Transfer peaches to cutting board and peel the skins. In most cases, the boiling-then-cold water will loosen the skins and they’ll slip right off. In the case of some stubborn peaches, they will stay intact and you can peel them with a paring knife or vegetable peeler and curse the person who made you waste your time with poaching fruit. ", 
            "Halve and pit the peaches, then into about 1/3-inch thick slices. You’ll want 6 cups; it’s okay if you go a little over. Add to a large bowl and toss with lemon juice. In a small dish, stir together sugars, cinnamon, nutmeg, salt and cornstarch until evenly mixed. Add to peaches and toss to evenly coat.", 
            "Preheat: Oven to 425 degrees.", 
            "Assemble your pie: Flour the heck out of your counter, unwrap your first dough (if the two pieces look uneven, go for the smaller one) and put it in the middle and flour that too. Be generous, you’ll thank me later. Start rolling your dough by pressing down lightly with the pin and moving it from the center out. You’re not going to get it all flat in one roll or even twenty; be patient and it will crack less. Roll it a few times in one direction, lift it up and rotate it a quarter-turn. And that’s what you’re going to continue to do, roll a couple times, lift the dough and rotate it. Re-flour the counter and the top of the dough as needed–don’t skimp! You should be leaving no bits of dough on the counter and none should be stuck to your pin. If at any point, the dough starts to get sticky or soft, it’s warming up and will only become more difficult to work with. Transfer it back to the fridge for a few minutes (or even the freezer, but for just a minute) to let it cool, then resume your rolling process.", 
            "Once your dough is a 12- to 13-inch circle, transfer pie dough to a standard pie dish by folding it gently into quarters (making no creases), arranging the folded corner into one quadrant of the bottom of your tin and gently unfolding it to fit over the base. Trim the overhang to one inch. ", 
            "Scoop filling into bottom pie dough, including any accumulated juices (they contain the thickener too, also: tastiness). Roll out your top pie dough using the same procedure, until it is 12 to 13 inches in diameter. If you’d like to make a regular lidded pie, use it as is, cutting some decorative vents in the pie lid before baking. To make a lattice-top pie, cut the pie dough into strips anywhere from 1/2 to 1-inch wide with a pastry wheel, pizza wheel or knife. Arrange every other strip across your pie filling in one direction, spacing the strips evenly. Fold back every other strip gently on itself and add the longest remaining strip in the other direction. Fold the strips back down, repeat with the other strips until a full lattice-top is formed. Trim the lattice’s overhang to the diameter of the pie dish’s rim (i.e. no overhang; only the bottom crust will have that and this is a case of do as I say, not as I do, because I totally forgot this detail when I was making the above pie). Gently fold the rim of the bottom crust over the lattice strips and crimp decoratively.", 
            "To finish:Brush pie with milk, cream or water and sprinkle with sugar.  ", 
            "Bake pie: For about 20 minutes in the preheated oven, until the crust is set and beginning to brown. Reduce oven temperature to 375 and bake pie for another 30 to 40 minutes, until filling is bubbling all over and the crust is a nice golden brown. If the pie lid browns too quickly at any point in the baking process, you can cover it with foil for the remaining baking time to prevent further browning.", 
            "Cool pie: For three hours at room temperature before serving. I know you won’t listen to me — there’s hot delicious pie to be eaten, after all — but if you’re concerned about the runniness of the pie filling, keep in mind that the pie filling does not fully thicken until it is fully cool. Pie can be stored at room temperature or in the fridge; from the fridge, it will be even thicker. "
        ], 
        "date": "2012-07-23T15:25:26+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (7 ounces or 200 grams) white sugar", 
            "1 teaspoon (5 grams) baking powder", 
            "2 3/4 cups plus 2 tablespoons (12 5/8 ounces or 359 grams) cups all-purpose flour (or you can measure 3 cups and remove 2 tablespoons flour)", 
            "1/4 teaspoon cinnamon", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1/4 teaspoon (2 grams) salt", 
            "1 cup (2 sticks or 8 ounces or 227 grams) cold unsalted butter", 
            "1 large egg", 
            "2 peaches, pitted and thinly sliced (between 1/8 and 1/4-inch thick)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/09/4950027940_b3512efca3_o.jpg?w=749", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cookie", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/09/peach-shortbread/", 
        "title": "peach shortbread", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns and the very second that you turn around to do something else. Set it in the freezer until solid (about 30 minutes).", 
            "[Don’t have time for all this brown butter madness? Check the head notes to use regular softened butter instead.]", 
            "Preheat the oven to 375°F (190°C). Butter a 9×13 inch pan, or spray it with a nonstick spray. In a medium bowl, stir together sugar, baking powder, flour, salt and spices with a whisk.  Use a pastry blender, fork or your fingertips, blend the solidified brown butter and egg into the flour mixture. It will be crumbly. Pat 3/4 of the crumbs into the bottom of the prepared pan, pressing firmly. Tile peach slices over crumb base in a single layer. Scatter remaining crumbs evenly over peaches and bake in preheated oven for 30 minutes, until top is slightly brown and you can see a little color around the edges. Cool completely in pan before cutting into squares.", 
            "Keeping: I’ve kept mine in the fridge and they’ve held up great there since Monday. I imagine that these would freeze well, between layers of waxed paper, with the container sealed well in plastic wr"
        ], 
        "date": "2010-09-02T15:58:05+00:00"
    }, 
    {
        "ingredient_list": [
            "6 cups chopped peaches (from 6 to 7 large or 12 medium)", 
            "1 1/2 cups (340 grams or 12 ounces) unsalted butter, at room temperature", 
            "1 1/2 cups (300 grams) granulated sugar", 
            "1 1/2 cups (285 grams) light brown sugar", 
            "1 tablespoon (15 ml) vanilla extract", 
            "A few gratings of nutmeg", 
            "6 large eggs", 
            "2 cups (480 grams) sour cream", 
            "1 tablespoon baking powder", 
            "1 1/2 teaspoons baking soda", 
            "1 1/2 teaspoons fine sea or table salt", 
            "6 cups (780 grams) all-purpose flour", 
            "2 cups (455 grams or 16 ounces) unsalted butter, at room temperature", 
            "7 1/2 cups (from 2 1-pound boxes) powdered sugar, sifted if lumpy", 
            "1/2 cup (120 grams) sour cream, plus more if needed", 
            "1 tablespoon (15 ml) vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/07/img_3605.jpg?w=750", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Peach", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/07/peaches-and-cream-bunny-cake/", 
        "title": "peaches and cream bunny cake", 
        "directions": [
            "\nMake the cake: Line 1, 2 or 3 (if you have) 9×13-inch baking pans with parchment and coat the bottom and sides with nonstick spray. Don’t worry if you only have one pan, you can bake these one at a time. Heat oven to 350 degrees F.\nIf desired, peel your peaches. A commenter pointed me to this life-changning peeler many years ago that works great for peaches, tomatoes and other thin-skinned fruits, or you can cut a small x in the bottom of each and briefly dip them in boiling water, after which their skins should slip off easily.\nCut peaches in half, remove the pits (don’t worry if yours weren’t “freestone” and are making a mess; the cake doesn’t care) and cut the halves into about 1-inch wide fingers, then cut the fingers thinly, creating flat square-ish slices of peach. I like this shape because it’s light enough to not sink but you know you’re biting into a peach when you do. Set peaches aside.\nBeat butter and sugars together until light and fluffy. Add vanilla, nutmeg and eggs, one at a time, scraping down the sides of the bowl every egg or two. Add sour cream and beat to combine. Sprinkle batter with baking powder, baking soda and salt and beat to combine, then add flour. Mix only until it disappears, and carefully. If you’re using a 5-quart bowl as I was, it’s going to be very full at this point. Add peaches and (again, my bowl was nearly overflowing) fold them with a spatula in very very carefully.\nDivide batter into 3 pans (mine clocked in at 39 1/4 ounces per layer) or 1/3 of it each into the number of pans you have. Bake cake layers for 23 to 27 minutes, rotating once for even color. Cake is done when a toothpick inserted into batter portion comes out clean. Let cool on a rack for 5 to 10 minutes, then run a knife around the cake and flip it out onto a cooling rack. Let cool completely. If you need to use your cake pan again, just wipe it out, coat it again with nonstick spray and pour another 1/3 of the batter in.\nMake the frosting: Beat butter and powdered sugar together until very fluffy; add sour cream and vanilla and beat again. If frosting feels too firm, you can add more sour cream, 1 tablespoon at at time. This frosting gets soft pretty quickly (especially during summer peach season) so you might need to periodically put it in the fridge to keep it at a good consistency. Just don’t leave it in there so long that it hardens.\nShape and assemble cake: To make a bunny cake as shown, print the template from this page and cut out the face and ear shape. Lay it over the cake and use a thin knife to cut out four oval faces and 8 long almond-shaped ears. You will use two sets to make a miniature bunny smash cake. Arrange the first bunny layer on a plate. I do not attach the ears with anything more than frosting. Spread first layer thickly with frosting, place second layer on top and coat entire outside with a very thin layer of frosting. Place cake in the fridge or freezer so that this crumb layer firms up.\nRepeat on a larger scale with the two sheet cake layers. Trim the tops so that they’re level, fill them thickly with frosting and coat the outside with a thin layer of frosting chill it.\nOnce the first frosting layer on the miniature bunny and sheet cake are set, cover more thickly with a final coat of frosting. Use another one-layer bunny face and ear set to decorate the sheet cake, frosting this too. I used a small star tip to pipe dollops of frosting around the edges of the ears and face, and around the bottom rim of the sheet cake. Tint a tiny amount of the frosting with an eye, nose and mouth color. If you don’t have a small round piping tip, you can just snip a tiny bit of corner off a sandwich bag. A jelly bean also makes cute eyes and noses. I covered the sheet cake with confetti sprinkles.\nChill cakes until you’re ready to serve. Don’t take it out more than an hour or two before needed."
        ], 
        "date": "2016-07-15T14:23:14+00:00"
    }
]