{
  "date": "2016-07-15T14:23:14+00:00",
  "directions": [
    "\nMake the cake: Line 1, 2 or 3 (if you have) 9×13-inch baking pans with parchment and coat the bottom and sides with nonstick spray. Don’t worry if you only have one pan, you can bake these one at a time. Heat oven to 350 degrees F.\nIf desired, peel your peaches. A commenter pointed me to this life-changning peeler many years ago that works great for peaches, tomatoes and other thin-skinned fruits, or you can cut a small x in the bottom of each and briefly dip them in boiling water, after which their skins should slip off easily.\nCut peaches in half, remove the pits (don’t worry if yours weren’t “freestone” and are making a mess; the cake doesn’t care) and cut the halves into about 1-inch wide fingers, then cut the fingers thinly, creating flat square-ish slices of peach. I like this shape because it’s light enough to not sink but you know you’re biting into a peach when you do. Set peaches aside.\nBeat butter and sugars together until light and fluffy. Add vanilla, nutmeg and eggs, one at a time, scraping down the sides of the bowl every egg or two. Add sour cream and beat to combine. Sprinkle batter with baking powder, baking soda and salt and beat to combine, then add flour. Mix only until it disappears, and carefully. If you’re using a 5-quart bowl as I was, it’s going to be very full at this point. Add peaches and (again, my bowl was nearly overflowing) fold them with a spatula in very very carefully.\nDivide batter into 3 pans (mine clocked in at 39 1/4 ounces per layer) or 1/3 of it each into the number of pans you have. Bake cake layers for 23 to 27 minutes, rotating once for even color. Cake is done when a toothpick inserted into batter portion comes out clean. Let cool on a rack for 5 to 10 minutes, then run a knife around the cake and flip it out onto a cooling rack. Let cool completely. If you need to use your cake pan again, just wipe it out, coat it again with nonstick spray and pour another 1/3 of the batter in.\nMake the frosting: Beat butter and powdered sugar together until very fluffy; add sour cream and vanilla and beat again. If frosting feels too firm, you can add more sour cream, 1 tablespoon at at time. This frosting gets soft pretty quickly (especially during summer peach season) so you might need to periodically put it in the fridge to keep it at a good consistency. Just don’t leave it in there so long that it hardens.\nShape and assemble cake: To make a bunny cake as shown, print the template from this page and cut out the face and ear shape. Lay it over the cake and use a thin knife to cut out four oval faces and 8 long almond-shaped ears. You will use two sets to make a miniature bunny smash cake. Arrange the first bunny layer on a plate. I do not attach the ears with anything more than frosting. Spread first layer thickly with frosting, place second layer on top and coat entire outside with a very thin layer of frosting. Place cake in the fridge or freezer so that this crumb layer firms up.\nRepeat on a larger scale with the two sheet cake layers. Trim the tops so that they’re level, fill them thickly with frosting and coat the outside with a thin layer of frosting chill it.\nOnce the first frosting layer on the miniature bunny and sheet cake are set, cover more thickly with a final coat of frosting. Use another one-layer bunny face and ear set to decorate the sheet cake, frosting this too. I used a small star tip to pipe dollops of frosting around the edges of the ears and face, and around the bottom rim of the sheet cake. Tint a tiny amount of the frosting with an eye, nose and mouth color. If you don’t have a small round piping tip, you can just snip a tiny bit of corner off a sandwich bag. A jelly bean also makes cute eyes and noses. I covered the sheet cake with confetti sprinkles.\nChill cakes until you’re ready to serve. Don’t take it out more than an hour or two before needed."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/07/img_3605.jpg?w=750",
  "ingredient_list": [
    "6 cups chopped peaches (from 6 to 7 large or 12 medium)",
    "1 1/2 cups (340 grams or 12 ounces) unsalted butter, at room temperature",
    "1 1/2 cups (300 grams) granulated sugar",
    "1 1/2 cups (285 grams) light brown sugar",
    "1 tablespoon (15 ml) vanilla extract",
    "A few gratings of nutmeg",
    "6 large eggs",
    "2 cups (480 grams) sour cream",
    "1 tablespoon baking powder",
    "1 1/2 teaspoons baking soda",
    "1 1/2 teaspoons fine sea or table salt",
    "6 cups (780 grams) all-purpose flour",
    "2 cups (455 grams or 16 ounces) unsalted butter, at room temperature",
    "7 1/2 cups (from 2 1-pound boxes) powdered sugar, sifted if lumpy",
    "1/2 cup (120 grams) sour cream, plus more if needed",
    "1 tablespoon (15 ml) vanilla extract"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Peach",
    "Photo"
  ],
  "title": "peaches and cream bunny cake",
  "url": "https://smittenkitchen.com/2016/07/peaches-and-cream-bunny-cake/"
}