{
  "date": "2011-07-10T18:39:42+00:00",
  "directions": [
    "Preheat oven to 450°F with a heavy baking sheet or pizza stone on a middle rack.",
    "Whisk together flour, baking powder, and salt in a medium bowl. Make a well in center, then add water and oil and gradually stir into flour with a wooden spoon until a dough forms. Knead dough gently on a work surface 4 or 5 times. It will feel quite oily (but just think of how great your hands will look later!). ",
    "Divide dough into 4 pieces and roll out 1 piece at on a sheet of parchment paper into a longish irregular rustic shape; mine were about 12″x6″. The dough should be rolled thin and it be crazy oily and you’ll think I’ve lost my mind suggesting that it will make anything but a mess, but you’ll see in a few minutes how perfectly ungreasy it bakes up, promise.",
    "Slide rolled out dough and parchment paper together onto the preheated baking sheet or stone, and bake about 5 minutes, until lightly golden. Leaving the oven on, remove tray from oven and quickly sprinkle with 1/4 of grated cheese. Bake an additional 3 to 4 minutes, until browned at edges and in thinner spots. Remove flatbreads from oven a final time, quickly drizzle each with honey (1 used about a tablespoon per flatbread, but the restaurant used more; they were truly flooded with honey and it was delicious), sprinkle with sea salt and garnish with thyme leaves. Cut each cracker width-wise into 4 sections (about 3″x6″ each) with a sharp knife. Repeat with remaining pieces of dough. Serve warm.",
    "Do ahead: Should you want to prepare these ahead of time for a party, I’d bake them including the cheese about 1 minute less than needed. Shortly before you’re ready to serve them, re-toast them in the oven and then drizzle on the honey/thyme/sea salt. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/flatbreads-with-honey-thyme-and-sea-salt1.jpg?w=500",
  "ingredient_list": [
    "1 3/4 cups (7 3/4 ounces or 220 grams) all-purpose flour",
    "1 teaspoon baking powder",
    "3/4 teaspoon table salt",
    "1/2 cup (118 ml) water",
    "1/3 cup (79 ml) olive oil",
    "2/3 to 3/4 cup (about 3 ounces or 85 grams) grated Mahon cheese (see above for replacements)",
    "1/3 to 1/2 cup (79 to 118 ml) honey",
    "1 tablespoon fresh thyme",
    "Flaky sea salt such as Maldon"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Bread",
    "Quick",
    "Snack"
  ],
  "title": "flatbreads with honey, thyme and sea salt",
  "url": "https://smittenkitchen.com/2011/07/flatbreads-with-honey-thyme-and-sea-salt/"
}