{
  "date": "2013-06-27T11:28:55+00:00",
  "directions": [
    "Heat vinegar, sugar, salt and mustard seeds to a simmer in a small, non-reactive pot over moderate heat, stirring only until sugar and salt dissolve. Stir in water, which should bring the mixture’s temperature down significantly. Let cool to lukewarm. ",
    "Divide vegetables between jars. (I used two 3/4 liter jars.) Pour vinegar mixture over vegetables and refrigerate until needed. You’ll find the vegetables to be lightly pickled within an hour, and deliciously pickled within a day. They will get slightly more pickled as they sit, but the change shouldn’t be too dramatic from the 24 hour level.",
    "Eat with/on sandwiches, aside grilled food and pack it along for picnics — it goes with almost anything. Then make more, because this stuff is habit-forming.",
    "Do ahead: Mine have kept in the fridge for a month without any change in taste or appearance. Updated to add (thanks, Erika!) that you’ll want to make sure that your vegetables are submerged in the brine for them to keep this long.",
    "* I used a mix of a sharp knife, a simple mandoline (that includes julienne blades) and a julienne peeler (the Kuhn one), which I was embarrassed to admit I bought last year until I realized how much easier it makes getting juliennes from long, thin vegetables (carrots, cucumbers, parsnips and zucchini). Don’t fret if you don’t have a fancy peeler or mandoline; you can cut thin strips with your knife, then slice them into skinny matchsticks quite easily."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/06/pickled-vegetable-sandwich-slaw.jpg?w=750",
  "ingredient_list": [
    "Pickling mixture",
    "1 cup distilled white vinegar",
    "4 tablespoons sugar",
    "2 tablespoons Kosher salt",
    "2 tablespoons yellow mustard seeds",
    "1 cup cold water",
    "Slaw mixture",
    "4 to 5 cups mixed slivered or julienned* firm, raw vegetables (see above for vegetable suggestions, below for slicing tips)",
    "Optional: Few slivers of jalapeno"
  ],
  "tags": [
    "Photo",
    "Pickled",
    "Picnics",
    "Salad",
    "Sandwich",
    "Side Dish",
    "Summer",
    "Vegan",
    "Vegetarian"
  ],
  "title": "pickled vegetable sandwich slaw",
  "url": "https://smittenkitchen.com/2013/06/pickled-vegetable-sandwich-slaw/"
}