{
  "date": "2014-04-02T12:13:23+00:00",
  "directions": [
    "To serve: Lime wedges, sour cream, diced white onion, cilantro, corn or flour tortillas or tortilla chips or rice",
    "Heat oil in the bottom of a medium-sized heavy pot or Dutch oven (if finishing it on the stove), in the pot of your pressure-cooker (if using one) or in a large skillet (if finishing in a slow-cooker). Once warm, add onion and cook for 5 minutes, until translucent. Add any fresh peppers and cook for 3 more minutes. Add garlic, chili powder, cumin, oregano and salt and cook for 2 minutes, until browned and deeply fragrant. Add beer and scrape up any bits stuck to the pot. Boil until reduced by half, or, if you’re nervous about alcohol content, until it has all but disappeared. ",
    "If finishing on the stove: Add tomatoes, dried beans, any dried or rehydrated-and-pureed chiles and the smaller amount of water. Bring mixture to a full boil and boil for one minute, then reduce heat to a very low, gentle simmer, place a lid on your pot, and cook for 2 1/2 to 3 hours, until the beans are tender, stirring occasionally. Add the last 1/2 cup water if mixture seems to be getting dry, though I didn’t need it in most of my tested batches. If a slightly more sloshy chili wouldn’t bother you, you can add it from the get-go.",
    "If finishing in a slow-cooker: Scrape onion, spice and beer mixture into a slow-cooker and add tomatoes, dried beans, any dried or rehydrated-and-pureed chiles and the smaller amount of water. Cook on HIGH for 6 to 7 hours, until beans are tender. You can add the last 1/2 cup water if needed, but probably will not find it necessary.",
    "If finishing in a pressure-cooker: Follow the directions from your pressure cooker manufacturer. I failed to get this fully tested in my new one (boo) but estimate that it will take 20 to 22 minutes on high. ",
    "Serve as-is or with fixings of your choice.",
    "Notes:"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/three-bean-chili.jpg?w=750",
  "ingredient_list": [
    "1 tablespoon olive oil",
    "1 medium onion, chopped small",
    "1 to 2 peppers of your choice (see Notes, below), finely chopped",
    "3 cloves garlic, minced",
    "2 tablespoons chili powder",
    "2 teaspoons ground cumin",
    "1 teaspoon dried oregano",
    "1 1/2 teaspoons table salt or 2 1/2 teaspoons kosher or coarse salt",
    "1 12-ounce bottle beer",
    "1 28-ounce can crushed tomatoes, fire-roasted if you can find them",
    "1 1/2 cups mixed dried beans (see Note)",
    "3 1/2 to 4 cups water"
  ],
  "tags": [
    "Beans",
    "Photo",
    "Slow Cooker",
    "Stew",
    "Tex-Mex",
    "Vegan",
    "Vegetarian"
  ],
  "title": "three-bean chili",
  "url": "https://smittenkitchen.com/2014/04/three-bean-chili/"
}