{
  "date": "2016-05-31T12:01:10+00:00",
  "directions": [
    "Prepare the chicken: Combine all ingredients in a large freezer bag. Rub all around, coating chicken as evenly as possible. Let marinate for 20 minutes or up to 24 hours, whatever time you have.\nMake tzatziki: Place the yogurt in a medium bowl. Quarter your cucumber lengthwise and cut out the seeded area. Coarsely grate your cucumber onto a clean dishcloth and wring it out as well as you can. All of that liquid makes for a soggy sauce. Add wrung-out cucumber to yogurt bowl along with lemon, vinegar, dill, garlic, salt and pepper and stir to combine. Taste and adjust seasonings. Chill until needed.\nPrepare salad components: Arrange lettuce, onion, tomatoes and cucumbers on a platter. If desired, toss onion with a squeeze of lemon and/or dash or two of vinegar and salt so that it mellows/lightly pickles while it rests.\nCook chicken: Heat your grill to high heat or a grill pan to medium-high. Remove chicken from marinade and grill on first side until dark lines appear, about 5 minutes, then flip and grill for 3 minutes more on second side. Cooking times will vastly range by the thickness and coldness of your chicken, as well as variations between grills. Transfer cooked chicken to a cutting board, let rest for a couple minutes while you quickly heat/toast your pitas on the grill.\nCut chicken into thin strips. Cut pitas into wedges. Add to platter with vegetables and let everyone dig in. Repeat all summer."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/chicken-gyro-salad1.jpg?w=750",
  "ingredient_list": [
    "1 tablespoon olive oil",
    "Zest and juice of 1 lemon",
    "3 cloves garlic, minced",
    "1 1/2 teaspoon kosher salt",
    "3/4 teaspoon paprika",
    "1/4 teaspoon hot smoked paprika, plus more to taste",
    "1 1/2 teaspoons dried oregano, crumbled",
    "Freshly ground black pepper",
    "10 boneless, skinless chicken thighs (about 3 pounds)",
    "2 cups (554 grams) plain, unsweetened Greek yogurt",
    "1 hothouse, English or seedless cucumber, unpeeled (about 1 pound)",
    "2 tablespoons freshly squeezed lemon juice",
    "1 tablespoon white wine vinegar",
    "1 tablespoon minced fresh dill",
    "2 medium cloves garlic, minced",
    "1 1/2 teaspoons kosher salt",
    "1/2 teaspoon freshly ground black pepper",
    "1 head romaine lettuce, chopped",
    "1 red onion, thinly sliced",
    "About 1 pound small-medium tomatoes, chopped",
    "1 hothouse, English or seedless cucumber, chopped",
    "4 large pitas (intending 1/2 per person) or more as needed"
  ],
  "tags": [
    "Chicken",
    "Cucumber",
    "Greek",
    "Greens",
    "Grilling",
    "Onions",
    "Photo",
    "Salad",
    "Summer",
    "Tomatoes",
    "Weeknight Favorite"
  ],
  "title": "chicken gyro salad",
  "url": "https://smittenkitchen.com/2016/05/chicken-gyro-salad/"
}