{
  "date": "2011-09-28T22:14:27+00:00",
  "directions": [
    "Make your dough: Whisk yeast and 1 teaspoon honey into 2/3 cup warm water and let stand until foamy, a few minutes.",
    "With a stand mixer: In the bowl of a stand mixture, whisk together yeast mixture, oil, remaining honey (1/3 cup), eggs and yolk. Switch to dough hook and add 4 1/4 cups flour and salt. Use dough hook on a moderate speed until it pulls all of the flour and wet ingredients together into a craggy mass. Lower the speed and let the dough hook knead the dough for 5 minutes, until smooth, elastic and a little sticky.",
    "By hand:: In a large bowl, whisk together yeast mixture, oil, remaining honey (1/3 cup), eggs and yolk. Add flour all at once and stir with a wooden spoon until you get a craggy mass of uneven dough. Turn dough out onto a floured counter and knead it into a smooth, elastic dough, about 5 to 8 minutes. Try to use as little flour as necessary when kneading the dough; you don’t want to toughen the bread. A bench scraper can make it really easy to remove it from the counter if it gets stuck in a spot. [More bread tips here.]",
    "Both methods: Transfer dough to large oil-coated bowl, cover with plastic wrap and set aside for 1 hour, or until almost doubled in size.",
    "Add apples to dough: [See photos in post.] Turn dough out onto a floured counter and gently press it down into a flat, oblong shape. The shape does not matter so however it goes, it goes. Spread 2/3 of apple chunks over 1/2 of the flattened dough. Fold the other half over the apple chunks and press the dough down around them, flattening the now lumpy dough. Spread the remaining 1/3 apple chunks over half the folded dough. Fold the other half over the apples, pressing the dough down again. Your dough packet will likely be square-ish. Fold the corners under with the sides of your hands and form the dough into a round.  Upend your empty bowl over and set it aside for another 30 minutes.",
    "Weave your bread: [See photos in post.] Divide dough into 4 pieces. Roll and stretch each one as carefully as you can into a rope — don’t worry about getting it too long or thin, just 12 inches or so should do. If any apple chunks fall out as you form the ropes or at any other time in the forming of the loaf or risings, just poke them back in with your finger.",
    "Arrange two strands in each direction, perpendicular to each other, like a plus sign. Weave them so that one side is over, and the other is under, where they meet. So, now you’ve got an 8-legged woven-headed octopus. Take the four legs that come from underneath the center and move them over the leg to their right, i.e. jumping it. Take those legs that were on the right and again, jump each over the leg before, this time to the left. If you had extra length to your ropes, you can repeat these left-right jumps until you run out of rope. For me, this was enough. Just as you had with the folded packet of apple dough above, tuck the corners/odd bumps under the dough with the sides of your hands to form a round.",
    "Transfer the dough to a parchment-covered heavy baking sheet or baker’s peel (if you’ll be using a bread stone). Beat egg until smooth and brush over challah. Let challah rise for another hour but 45 minutes into this rise, preheat your oven to 375 degrees.",
    "Bake your loaf: Before baking, brush loaf one more time with egg wash and sprinkle with coarse sugar if you’re using it. Bake in middle of oven for 40 to 45 minutes. It should be beautifully bronzed; if yours (like mine, except I didn’t catch it in time) starts getting too dark too quickly, cover it with foil for the remainder of the baking time. The very best way to check for doneness in any bread but especially on like this where the wetness of the apples can slow down the baking time a bit, is with an instant read thermometer — the center of the loaf should be 195 degrees.",
    "Cool loaf on a rack before serving. Or, well, good luck with that. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-and-honey-challah1.jpg?w=500",
  "ingredient_list": [],
  "tags": [
    "Apple",
    "Bread",
    "Jewish",
    "Photo"
  ],
  "title": "apple and honey challah",
  "url": "https://smittenkitchen.com/2011/09/apple-and-honey-challah/"
}