{
  "date": "2014-10-09T12:12:17+00:00",
  "directions": [
    "Make the dough: Combine the flour, sugar, yeast and zest in the bottom of the bowl of a stand mixer. Add eggs and 1/2 cup water, mixing with the dough hook until it comes together; this may take a couple minutes. It’s okay if it’s on the dry side, but if it doesn’t come together at all, add extra water, 1 tablespoon at a time, until the dough forms a mass. With the mixer on low, add the salt, then the butter, a spoonful at a time, mixing until it’s incorporated into the dough. Then, mix on medium speed for 10 minutes until dough is completely smooth; you’ll need to scrape the bowl down a few times. I usually found that after 10 minutes, the dough began to pull away from the sides of the bowl. If it doesn’t, you can add 1 tablespoon extra flour to help this along. ",
    "Coat a large bowl with oil (or scrape the dough out onto a counter and oil this one) and place dough inside, cover with plastic and refrigerate. Leave in fridge for at least half a day, preferably overnight. [Dough will not fully double, so don’t fret if it doesn’t look like it grew by more than half.]",
    "[To make this on the same day, see my fourth note below.]",
    "Make filling: Melt butter and chocolate together until smooth. Stir in powdered sugar and cocoa; mixture should form a spreadable paste. Add cinnamon, if desired. [If you’re wondering what happened to the pecans and granulated sugar, see my third note below.]",
    "Assemble loaves: Coat two 9-by-4-inch (2 1/4 or 1kg) loaf pans with oil or butter, and line the bottom of each with a rectangle of parchment paper. Take half of dough from fridge (leave the other half chilled). Roll out on a well-floured counter to about a 10-inch width (the side closest to you) and as long in length (away from you) as you can when rolling it thin, likely 10 to 12 inches. ",
    "Spread half of chocolate mixture evenly over the dough, leaving a 1/2-inch border all around. Brush the end farthest away from you with water. Roll the dough up with the filling into a long, tight cigar. Seal the dampened end onto the log. I found that transferring the log to a lightly floured baking tray in the freezer for 10 to 15 minutes made it much, much easier to cut cleanly in half. Repeat with second dough.",
    "Trim last 1/2-inch off each end of log. Gently cut the log in half lenghtwise and lay them next to each other on the counter, cut sides up. Pinch the top ends gently together. Lift one side over the next, forming a twist and trying to keep the cut sides facing out (because they’re pretty). Don’t worry if this step makes a mess, just transfer the twist as best as you can into the prepared loaf pan. In one batch, mine was long enough to “S” inside the pan and I nested the trimmed ends of the log in the openings. Even if you don’t (and choose to bake them separately in a little pan, as I did in other batches), the dough will fill in any gaps by the time it’s done rising and baking, so don’t worry.",
    "Cover with a damp tea towel and leave to rise another 1 to 1 1/2 hours at room temperature. Repeat process with second loaf. ",
    "Bake and finish cakesL Heat oven to 375°F (190°C). Remove towels, place each loaf on the middle rack of your oven. Bake for 30 minutes, but there’s no harm in checking for doneness at 25 minutes. A skewer inserted into an underbaked babka will feel stretchy/rubbery inside and may come back with dough on it. When fully baked, you’ll feel almost no resistance. If you babka needs more time, put it back, 5 minutes at a time then re-test. If it browns too quickly, you can cover it with foil. ",
    "While babkas are baking, make syrup: Bring sugar and water to a simmer until sugar dissolves. Remove from heat and set aside to cool somewhat. As soon as the babkas leave the oven, brush the syrup all over each. It will seem like too much, but will taste just right — glossy and moist. Let cool about halfway in pan, then transfer to a cooling rack to cool the rest of the way before eating (an adorable suggestion from Ottolenghi — don’t worry, we know you’re going to eat it warm).",
    "Do ahead: Babkas keep for a few days at room temperature. Longer, I’d freeze them. They freeze and defrost really well.",
    "A whole bunch of notes:"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/better-chocolate-babka1.jpg?w=640",
  "ingredient_list": [
    "Dough",
    "4 1/4 cups (530 grams) all-purpose flour, plus extra for dusting",
    "1/2 cup (100 grams) granulated sugar",
    "2 teaspoons instant yeast",
    "Grated zest of 1 small lemon or half an orange (our preference)",
    "3 large eggs",
    "1/2 cup water (cold is fine) and up to 1 to 2 tablespoons extra, if needed",
    "3/4 teaspoon fine sea or table salt",
    "2/3 cup unsalted butter (150 grams or 5.3 ounces) at room temperature",
    "Sunflower or other neutral oil, for greasing",
    "Filling",
    "4 1/2 ounces (130 grams) dark chocolate (or approximately 3/4 cup chocolate chips)",
    "1/2 cup (120 grams) unsalted butter, cold is fine",
    "Scant 1/2 cup (50 grams) powdered sugar",
    "1/3 cup (30 grams) cocoa powder",
    "1/4 teaspoon cinnamon [optional]",
    "Syrup",
    "1/3 cup water",
    "6 tablespoons (75 grams) granulated sugar"
  ],
  "tags": [
    "Cake",
    "Chocolate",
    "Jewish",
    "Photo",
    "Recipes"
  ],
  "title": "better chocolate babka",
  "url": "https://smittenkitchen.com/2014/10/better-chocolate-babka/"
}