{
  "date": "2007-09-27T17:15:10+00:00",
  "directions": [
    "Cornmeal or semolina flour for dusting",
    "Sesame seeds, poppy seeds, kosher salt, rehydrated dried minced garlic or onions (Deb note: this was what I chose, and found the taste very authentic), or chopped onions that have been tossed in oil (optional) ",
    "1. Day one: To make the sponge, stir the yeast into the flour in a 4-quart mixing bowl.  Add the water, whisking or stirring only until it forms a smooth, sticky batter (like pancake batter).  Cover the bowl with plastic wrap and leave at room temperature for approximately 2 hours, or until the mixture becomes very foamy and bubbly.  It should swell to nearly double in size and collapse when the bowl is tapped on the countertop. ",
    "2. To make the dough, in the same mixing bowl (or in the bowl of an electric mixer), add the additional yeast to the sponge and stir.  Then add 3 cups of the flour and all of the salt and malt.  Stir (or mix on low speed with the dough hook) until the ingredients for a ball, slowly working in the remaining 3/4 cup flour to stiffen the dough. ",
    "3. Transfer the dough to the counter and knead for at least 10 minutes (or for 6 minutes by machine).  The dough should be firm, stiffer than French bread dough, but still pliable and smooth.  There should be no raw flour – all ingredients should be hydrated.  The dough should pass the windowpane test and register 77 to 71 degrees F.  If the dough seems to dry and rips, add a few drops of water and continue kneading.  If the dough seems tacky or sticky, add more flour to achieve the stiffness required.  The kneaded dough should feel satiny and pliable but not be tacky. ",
    "4. Immediately divide the dough into 4 1/2 ounce pieces for standard bagels, or smaller if desired (Deb note: I used 2.25 ounce pieces, and yes, I weighed them because I wanted them to bake evenly).  Form the pieces into rolls. ",
    "5. Cover the rolls with a damp towel and allow them to rest for approximately 20 minutes. ",
    "6. Line 2 sheet pans with baking parchment and mist lightly with spray oil.  Proceed with one of the following shaping methods:",
    "Method 1: Poke a hole in a ball of bagel dough and gently rotate your thumb around the inside of the hole to widen it to approximately 2 1/2 inches in diameter (half of this for a mini-bagel).  The dough should be as evenly stretched as possible (try to avoid thick and thin spots.) ",
    "Method 2: Roll out the dough into an 8-inch long rope.  (This may require rolling part of the way and resting if the pieces are too elastic and snap back, in which case, allow them to rest for 3 minutes and then extend them again to bring to full length.  Wrap the dough around the palm and back of your hand, between the thumb and forefinger, overlapping the ends by several inches.  Press the overlapping ends on the counter with the palm of your hand, rocking back and forth to seal. ",
    "7. Place each of the shaped pieces 2 inches apart on the pans (Deb note: I got away with 1-inch space for the minis).  Mist the bagels very lightly with the spray oil and slip each pan into a food-grade plastic bag, or cover loosely with plastic wrap. Let the pans sit at room temperature for about 20 minutes. ",
    "8.  Check to see if the bagels are ready to be retarded in the refrigerator by using the “float test”.  Fill a small bowl with cool or room-temperature water.  The bagels are ready to be retarded when they float within 10 seconds of being dropped into the water.  Take one bagel and test it.  If it floats, immediately return the tester bagel to the pan, pat it dry, cover the pan, and place it in the refrigerator overnight (it can stay in the refrigerator for up to 2 days).  If the bagel does not float.  Return it to the pan and continue to proof the dough at room temperature, checking back every 10 to 20 minutes or so until a tester floats.  The time needed to accomplish the float will vary, depending on the ambient temperature and the stiffness of the dough. ",
    "9. The following day (or when you are ready to bake the bagels), preheat the oven to 500 degrees F with the two racks set in the middle of the oven.  Bring a large pot of water to a boil (the wider the pot the better), and add the baking soda (and optionally, a few tablespoons of barley syrup, see Note at the end).  Have a slotted spoon or skimmer nearby. ",
    "10. Remove the bagels from the refrigerator and gently drop them into the water, boiling only as many as comfortably fit (they should float within 10 seconds).  After 1 minutes flip them over rand boil for another minute.  If you like very chewy bagels, you can extend the boiling to 2 minutes per side (Deb note: I used the 2 minute option).  While the bagels are boiling, sprinkle the same parchment-lined sheet pans with cornmeal or semolina flour.  (If you decide to replace the paper, be sure to spray the new paper lightly with spray oil to prevent the bagels from sticking to the surface.)  If you want to top (see note below) the bagels, do so as soon as they come out of the water. You can use any of the suggestions in the ingredients list or a combination. ",
    "11. When all the bagels have been boiled, place the pans on the 2 middle shelves in the oven.  Bake for approximately 5 minutes, then rotate the pans, switching shelves and giving the pans a 180-degree rotation.  (If you are baking only 1 pan, keep it on the center shelf but still rotate 180 degrees.)  After the rotation, lower the oven setting to 450 degrees F and continue baking for about 5 minutes, or until the bagels turn light golden brown.  You may bake them darker if you prefer. (Deb note: I actually baked them quite a bit longer, often almost five extra minutes. I judge by color, not internal temperature, in this case. I did not lower the oven temperature because I had multiple batches to bake.)",
    "12. Remove the pans from the oven and let the bagels cool on a rack for 15 minutes or longer before serving.",
    "Cinnamon Raisin Bagels: For cinnamon raisin bagels, increase the yeast in the final dough to 1 teaspoon, and add 1 tablespoon of ground cinnamon and 5 tablespoons of granulated sugar to the final dough.  Rinse 2 cups of loosely packed raisins with warm water to wash off surface sugar, acid, and natural wild yeast.  Add the raisins during the final 2 minutes of mixing.  Proceed as directed, but do not top the bagels with any garnishes.  When they come out of the oven and are still hot, you can brush the tops with melted butter and dip them in cinnamon sugar to create a cinnamon-sugar crust, if desired. ",
    "Notes:"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/09/peter-reinharts-bagels.jpg?w=750",
  "ingredient_list": [
    "Sponge",
    "1 teaspoon instant yeast",
    "4 cups unbleached high-gluten or bread flour (see note below)",
    "2 1/2 cups water, room temperature",
    "Dough",
    "1/2 teaspoon instant yeast",
    "3 3/4 cups unbleached high-gluten or bread flour",
    "2 3/4 teaspoons salt",
    "2 teaspoons malt powder or 1 tablespoon dark or light malt syrup, honey, or brown sugar (see note below)",
    "To Finish",
    "1 tablespoon baking soda"
  ],
  "tags": [
    "Bread",
    "Jewish",
    "Photo"
  ],
  "title": "peter reinhart’s bagels",
  "url": "https://smittenkitchen.com/2007/09/bronx-worthy-bagels/"
}