{
  "date": "2008-09-24T14:24:43+00:00",
  "directions": [
    "Fits in three loaf pans, two 9-inch square or round cake pans, one 9 or 10 inch tube or bundt cake pan, or one 9 by 13 inch sheet cake. I made mine in two full-size loaf pans plus two miniature ones.",
    "Preheat oven to 350°F. Generously grease pan(s) with non-stick cooking spray. For tube or angel food pans, line the bottom with lightly greased parchment paper, cut to fit.",
    "In a large bowl, whisk together the flour, baking powder, baking soda, salt, cinnamon, cloves and allspice. Make a well in the center, and add oil, honey, white sugar, brown sugars, eggs, vanilla, coffee or tea, orange juice and rye or whiskey, if using. (If you measure your oil before the honey, it will be easier to get all of the honey out.)",
    "Using a strong wire whisk or in an electric mixer on slow speed, stir together well to make a thick, well-blended batter, making sure that no ingredients are stuck to the bottom.",
    "Spoon batter into prepared pan(s). Sprinkle top of cake(s) evenly with almonds, if using. Place cake pan(s) on two baking sheets, stacked together (this will ensure the cakes bake properly with the bottom baking faster than the cake interior and top).",
    "Bake until cake tests done, that is, it springs back when you gently touch the cake center. For angel and tube cake pans, this will take 60 to 75 minutes, loaf cakes, about 45 to 55 minutes. For sheet style cakes, baking time is 40 to 45 minutes.",
    "Let cake stand fifteen minutes before removing from pan."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/majestic-and-moist-honey-cake.jpg?w=753",
  "ingredient_list": [
    "3 1/2 cups (440 grams) all-purpose flour",
    "1 tablespoon (15 grams) teaspoon (5 grams) baking powder [see explanation above]",
    "1 teaspoon (5 grams) baking soda",
    "1/2 teaspoon kosher salt",
    "4 teaspoons (about 8 grams) ground cinnamon",
    "1/2 teaspoon ground cloves",
    "1/2 teaspoon ground allspice",
    "1 cup (235 ml) vegetable oil",
    "1 cup (340 grams) honey",
    "1 1/2 cups (300 grams) granulated sugar",
    "1/2 cup (95 grams) brown sugar",
    "3 large eggs at room temperature",
    "1 teaspoon (5 ml) vanilla extract",
    "1 cup warm (235 ml) coffee or strong tea",
    "1/2 cup (120 ml) fresh orange juice",
    "1/4 cup (60 ml) rye or whiskey",
    "1/2 cup (45 to 55 grams) slivered or sliced almonds (optional)"
  ],
  "tags": [
    "Cake",
    "Everyday Cakes",
    "Jewish",
    "Photo"
  ],
  "title": "majestic and moist honey cake",
  "url": "https://smittenkitchen.com/2008/09/majestic-and-moist-honey-cake/"
}