{
  "date": "2012-09-11T11:26:27+00:00",
  "directions": [
    "To make dough with a stand mixer: Whisk the yeast and 1 teaspoon honey into warm water, and let it stand for a few minutes, until foamy. In a large mixer bowl, combine the yeast mixture with remaining honey, 1/3 cup olive oil, and eggs. Add the salt and flour, and mix until dough begins to hold together. Switch to a dough hook, and run at low speed for 5 to 8 minutes. Transfer the dough to an olive-oil coated bowl (or rest the dough briefly on the counter and oil your mixer bowl to use for rising, so that you’ll use fewer dishes), cover with plastic wrap, and set aside for 1 hour, or until almost doubled in size.",
    "To make the dough by hand: Proof the yeast as directed above. Mix the wet ingredients with a whisk, then add the salt and flour. Mix everything together with a wooden spoon until the dough starts to come together. Turn the mixture out onto a floured counter, and knead for 5 to 10 minutes, until a smooth and elastic dough is formed. Let rise as directed above.",
    "Meanwhile, make fig paste: In a small saucepan, combine the figs, zest, water, juice, salt, and a few grinds of black peper. Bring to a simmer over medium heat, and cook, stirring occasionally, until the figs are soft and tender, about 10 minutes. Season with salt and pepper to taste. Remove from heat, and let cool to lukewarm. PRocess fig mixture in a food processor until it resembles a fine paste, scraping down the sides of the bowl as necessary. Set aside to cool.",
    "Insert figs: After your dough has risen, turn it out onto a floured counter and divide it in half. Roll the first half of the dough into a wide and totally imperfect rectangle (really, the shape doesn’t matter). Spread half the fig filling evenly over the dough, stopping short of the edge. Roll the dough into a long, tight log, trapping the filling within. Then gently stretch the log as wide as feels comfortable (I take mine to my max counter width, a pathetic three feet), and divide it in half. Repeat with remaining dough and fig filling.",
    "Weave your challah: Arrange two ropes in each direction, perpendicular to each other, like a tight tic-tac-toe board. Weave them so that one side is over, and the other is under, where they meet. So, now you’ve got an eight-legged woven-headed octopus. Take the four legs that come from underneath the center and move the leg to their right — i.e., jumping it. Take the legs that were on the right and, again, jump each over the leg before, this time to the left. If you have extra length in your ropes, you can repeat these left-right jumps until you run out of rope. Tuck the corners or odd bumps under the dough with the sides of your hands to form a round.",
    "Transfer the dough to a parchment-cover heavy baking sheet, or, if you’ll be using a bread stone, a baker’s peel. Beat egg until smooth, and brush over challah.  Let challah rise for another hour, but 45 minutes into this rise, preheat your oven to 375°F.",
    "Bake your loaf: Before baking, brush loaf one more time with egg wash and sprinkle with sea salt. Bake in middle of oven for 35 to 40 minutes. It should be beautifully bronzed; if yours starts getting too dark too quickly, cover it with foil for the remainder of the baking time. The very best way to check for doneness is with an instant-read thermometer — the center of the loaf should be 195 degrees. ",
    "Cool loaf on a rack before serving. Or, well, good luck with that."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/09/fig-olive-oil-and-sea-salt-challah.jpg?w=750",
  "ingredient_list": [
    "Bread",
    "2 1/4 teaspoons (1 packet — 1/4 ounce or 7 grams) active dry yeast",
    "1/4 cup (85 grams) plus 1 teaspoon honey",
    "2/3 cup warm water (110 to 116 degrees F)",
    "1/3 cup (80 ml) olive oil, plus more for the bowl",
    "2 large eggs",
    "2 teaspoons flaky sea salt, such as Maldon, or 1 1/2 teaspoons table salt",
    "4 cups (500 grams) all-purpose flour",
    "Fig Filling",
    "1 cup (5 1/2 ounces or 155 grams) stemmed and roughly chopped dried figs",
    "1/8 teaspoon freshly grated orange zest, or more as desired",
    "1/2 cup (120 ml) water",
    "1/4 cup (60 ml) orange juice",
    "1/8 teaspoon sea salt",
    "Few grinds black pepper",
    "Egg wash",
    "1 large egg",
    "Coarse or flaky sea salt, for sprinkling"
  ],
  "tags": [
    "Announcements",
    "Bread",
    "Cookbooks",
    "Figs",
    "Jewish",
    "Photo"
  ],
  "title": "fig, olive oil and sea salt challah + book tour!",
  "url": "https://smittenkitchen.com/2012/09/fig-olive-oil-and-sea-salt-challah-book-tour/"
}