{
  "date": "2010-01-30T10:12:13+00:00",
  "directions": [
    "Position a rack in the lower third of the oven and preheat the oven to 325°F. Line the bottom and sides of an 8×8-inch square baking pan with parchment paper or foil, leaving an overhang on two opposite sides.\nCombine the butter, sugar, cocoa, and salt in a medium heatproof bowl and (Medrich’s method) set the bowl in a wide skillet of barely simmering water. Stir from time to time until the butter is melted and the mixture is smooth and hot enough that you want to remove your finger fairly quickly after dipping it in to test. Or (Deb’s method) you can melt the butter with the cocoa in a microwave too.",
    "Both methods: Set the bowl aside briefly until the mixture is only warm, not hot. It looks fairly gritty at this point, but don’t fret — it smooths out once the eggs and flour are added.",
    "Stir in the vanilla with a wooden spoon. Add the eggs one at a time, stirring vigorously after each one. When the batter looks thick, shiny, and well blended, add the flour and stir until you cannot see it any longer, then beat vigorously for 40 strokes with the wooden spoon or a rubber spatula. Stir in the nuts, if using. Spread evenly in the lined pan.\nBake until a toothpick plunged into the center emerges slightly moist with batter, 20 to 25 minutes is Medrich’s suggestion but it took me at least 10 minutes longer to get them set. Let cool completely on a rack. (I go further and throw mine in the fridge or freezer for a while; it’s the only way I can get them to cut with clean lines.)\nLift up the ends of the parchment or foil liner, and transfer the brownies to a cutting board. Cut into 16 or 25 squares.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/best-cocoa-brownies.jpg?w=751",
  "ingredient_list": [
    "10 tablespoons (140 grams) unsalted butter",
    "1 1/4 cups (250 grams) granulated sugar",
    "3/4 cup plus 2 tablespoons (65 grams, may vary by brands) unsweetened cocoa powder (natural or Dutch-process)",
    "1/4 teaspoon salt (or a heaping 1/4 teaspoon flaky salt, as I used)",
    "1/2 teaspoon pure vanilla extract",
    "2 large eggs, cold",
    "1/2 cup (65 grams) all-purpose flour",
    "2/3 cup (75 grams) walnut or pecan pieces (optional)"
  ],
  "tags": [
    "Brownies/Blondies",
    "Chocolate",
    "Photo"
  ],
  "title": "best cocoa brownies",
  "url": "https://smittenkitchen.com/2010/01/best-cocoa-brownies/"
}