{
  "date": "2008-12-19T19:23:25+00:00",
  "directions": [
    "Spread chocolate ganache over mint and chill until firm, about 2 hours.",
    "Lift dessert out of pan using foil overhang. Run a heavy knife under hot water and wipe dry, then trim edges of dessert (1/4 inch off each side). Cut dessert into squares and peel from foil."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2008/12/grasshopper-brownies.jpg?w=750",
  "ingredient_list": [
    "For brownie layer",
    "1 1/2 sticks (3/4 cup) unsalted butter",
    "10 1/2 oz fine-quality bittersweet chocolate (not extra-bitter or unsweetened and no more than 60% cacao if marked), finely chopped",
    "1 1/2 cups packed light brown sugar",
    "3 large eggs, lightly beaten",
    "1 1/4 teaspoons vanilla",
    "3/4 cup all-purpose flour",
    "1/4 cup plus 2 tablespoons unsweetened Dutch-process cocoa powder",
    "3/4 teaspoon salt",
    "For mint ganache",
    "1/2 cup heavy cream (see recipe notes)",
    "10 oz fine-quality white chocolate, chopped (see recipe notes)",
    "2 tablespoons green crème de menthe (I skipped this and found the mint flavor strong enough; compensated for the tinting with a single drop of green color)",
    "1 teaspoon peppermint extract",
    "For chocolate ganache",
    "1 cup heavy cream (see recipe notes)",
    "10 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped",
    "Make brownie layer:",
    "Put oven rack in middle position and preheat oven to 375°F. Lightly butter a 13- by 9-inch baking pan and line with 2 crisscrossed sheets of foil, leaving a 2 inch overhang on all sides. Butter foil.",
    "Make mint ganache:",
    "Bring cream to a simmer in a 2- to 3-quart saucepan and remove from heat. Pour over white chocolate in a bowl. Let stand 1 minute, then whisk until smooth. Stir in crème de menthe and extract and chill, covered, stirring occasionally, until thick, about 1 hour.",
    "Make chocolate ganache:",
    "Bring cream to a simmer in a 2- to 3-quart saucepan and remove from heat. Pour over bittersweet chocolate in a bowl. Let stand 1 minute, then whisk until smooth. Chill, covered, stirring occasionally, until thick, about 30 minutes.",
    "Assemble layers:",
    "Spread mint ganache over top of cooled brownie in a thin even layer using offset spatula, then chill until firm but still slightly sticky, about 30 minutes."
  ],
  "tags": [
    "Brownies/Blondies",
    "Chocolate",
    "Photo"
  ],
  "title": "grasshopper brownies",
  "url": "https://smittenkitchen.com/2008/12/grasshopper-brownies/"
}