{
  "date": "2013-02-07T11:33:36+00:00",
  "directions": [
    "Make caramel: Set a square of parchment paper over a medium-sized plate. Lightly butter or coat the parchment with a spray oil, just as an added security measure. ",
    "In a medium, dry saucepan over medium-high heat, melt your sugar; this will take about 5 minutes, stirring if necessary to break up large chunks. By the time it is all melted, if should be a nice copper color; if not, cook until it is. Remove from heat and stir in butter. It may not incorporate entirely but do your best. Stir in cream and salt and return saucepan to the stove over medium-high heat, bringing it back to a simmer and melted again any sugar that solidified. Cook bubbling caramel for a few minutes more, until it is a shade darker. ",
    "Pour out onto parchment-covered plate and transfer plate to your freezer. Freeze until solidified, which can take anywhere from 20 to 30 minutes in a decent freezer to 40 minutes in my terrible one.",
    "Meanwhile, or when your caramel is almost firm, make your brownies: Heat oven to 350°F. Line an 8×8-inch square baking pan with parchment, extending it up two sides. Butter the parchment or spray it with a nonstick cooking spray.",
    "In a medium heatproof bowl over gently simmering water, melt chocolate and butter together until only a couple unmelted bits remain. Off the heat, stir until smooth and fully melted. You can also do this in the microwave in 30-second bursts, stirring between each. Whisk in sugar, then eggs, one at a time, then vanilla and salt. Stir in flour with a spoon or flexible spatula.",
    "Assemble brownies: When caramel is firm, remove it from the freezer and chop it into rough 1-inch squares. Gently fold all but a small amount of caramel bits into batter. Scrape batter into prepared pan, spreading until mostly even. Scatter remaining caramel bits on top. Bake in heated oven for 30 minutes, until a toothpick inserted into the center comes out clean. ",
    "Cool thoroughly — a process that can be hastened in the freezer, which will also produce cleaner cuts — and cut into squares or other desired shapes."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/02/salted-caramel-brownies1.jpg?w=750",
  "ingredient_list": [
    "Caramel",
    "1/2 cup granulated sugar",
    "4 tablespoons unsalted butter (or salted, but then ease up on the sea salt)",
    "Heaped 1/4 teaspoon flaky sea salt (or 1/8 teaspoon table salt, more to taste)",
    "3 tablespoons heavy cream",
    "Brownie",
    "3 ounces (85 grams) unsweetened chocolate, roughly chopped",
    "1 stick (4 ounces or 115 grams) unsalted butter, plus extra for pan",
    "1 cup (200 grams) granulated sugar",
    "2 large eggs",
    "1 teaspoon (5 ml) vanilla extract",
    "Heaped 1/4 teaspoon flaky sea salt or 1/8 teaspoon table salt",
    "2/3 cup (85 grams) all-purpose flour"
  ],
  "tags": [
    "Brownies/Blondies",
    "Chocolate",
    "Photo"
  ],
  "title": "salted caramel brownies",
  "url": "https://smittenkitchen.com/2013/02/salted-caramel-brownies/"
}