{
  "date": "2015-12-16T14:59:33+00:00",
  "directions": [
    "Melt butter and unsweetened chocolate together — you can do this on the stove over very low heat, stirring constantly, in a double-boiler or in the microwave in 30-second bursts, stirring between each — and taking the chocolate out when it’s almost, but not fully, melted. Off the heat, stir until it is. ",
    "Whisk sugars into melted butter and chocolate, then eggs, one at a time, then vanilla. Whisk in baking soda and salt. If your cocoa powder is lumpy, sift it right onto the surface of the batter, other wise, just add it to the bowl. Add flour, too, and then stir until just combined. Add chips or chocolate chunks and stir until combined.",
    "Place bowl in the fridge for about 30 minutes, and up to a few days. Shorter than 30 minutes, you can bake it right away but they keep better shape once chilled and are easier to scoop. Longer than 30 minutes, they become difficult to scoop, but you can let them warm up slightly before you do.",
    "Heat oven to 350°F (175°C). ",
    "Scoop into about 1 1/2- to 2-tablespoon sized mounds and space evenly on parchment- or nonstick baking mat-lined baking sheets, allowing room for them to spread a little. Bake for 11 to 12 minutes, at which point they will still definitely look underbaked, but you should take them out if a fudgy-centered cookie is your goal. (Of course it is!) Let set on baking sheets for a few minutes before carefully transferring to a rack to cool the rest of the way before eating. Ha ha, just kidding. You can eat one right away, but you’ll probably want a glass of milk nearby.",
    "Do ahead: The cookie dough keeps in the fridge for up to a week and longer in the freezer. If you’d like to turn these into a slice-and-bake cookie, after 20 to 30 minutes in the fridge, scrape dough onto a sheet of parchment or waxed paper and form into a 1 1/2- to 2-inch thick log. Wrap in plastic and freeze until needed. Be sure to cut them on the thick side before baking, so your cookie isn’t too flat. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/the-browniest-cookies1.jpg?w=640",
  "ingredient_list": [
    "1/2 cup (4 ounces or 115 grams) unsalted butter",
    "4 ounces (115 grams) unsweetened chocolate, chopped",
    "1 cup (190 grams) dark or light brown sugar",
    "2 tablespoons (25 grams) granulated sugar",
    "2 large eggs",
    "1 teaspoon vanilla extract",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon fine sea or table salt",
    "1/2 cup (45 grams) unsweetened cocoa powder, any kind will work",
    "1 cup (130 grams) all-purpose flour",
    "2/3 cup (115 grams) chocolate chips or bitter- or semisweet chocolate, chopped into chunks"
  ],
  "tags": [
    "Brownies/Blondies",
    "Chocolate",
    "Cookie",
    "Photo"
  ],
  "title": "the browniest cookies",
  "url": "https://smittenkitchen.com/2015/12/the-browniest-cookies/"
}