{
  "date": "2009-10-19T10:35:29+00:00",
  "directions": [
    "Make the doughnuts: In a saucepan over medium or medium-low heat, gently reduce the apple cider to about 1/4 cup, 20 to 30 minutes. Set aside to cool.",
    "Meanwhile, in a bowl, combine the flour, baking powder and soda, cinnamon, salt and nutmeg. Set aside.",
    "Using an electric mixer on medium speed (with the paddle attachment, if using a standing mixer) beat the butter and granulated sugar until the mixture is smooth. Add the eggs, one at a time, and continue to beat until the eggs are completely incorporated. Use a spatula to scrape down the sides of the bowl occasionally. Reduce the speed to low and gradually add the reduced apple cider and the buttermilk, mixing just until combined. Add the flour mixture and continue to mix just until the dough comes together.",
    "Line two baking sheets with parchment or wax paper and sprinkle them generously with flour. Turn the dough onto one of the sheets and sprinkle the top with flour. Flatten the dough with your hands until it is about 1/2 inch thick. Use more flour if the dough is still wet. Transfer the dough to the freezer until it is slightly hardened, about 20 minutes. Pull the dough out of the freezer. Using a 3-inch or 3 1/2-inch doughnut cutter — or a 3 1/2-inch round cutter for the outer shape and a 1-inch round cutter for the hole from a set like this, as I did — cut out doughnut shapes. Place the cut doughnuts and doughnut holes onto the second sheet pan. Refrigerate the doughnuts for 20 to 30 minutes. (You may re-roll the scraps of dough, refrigerate them briefly and cut additional doughnuts from the dough.)",
    "Add enough oil or shortening to a deep-sided pan to measure a depth of about 3 inches. Attach a candy thermometer to the side of the pan and heat over medium heat until the oil reaches 350°F*. Have ready a plate lined with several thicknesses of paper towels.",
    "Make your toppings (if using): While the cut doughnut shapes are in the refrigerator, make the glaze by whisking together the confectioners’ sugar and the cider until the mixture is smooth; make the cinnamon sugar by mixing the two together. Set aside.",
    "Fry and top the doughnuts: Carefully add a few doughnuts to the oil, being careful not to crowd the pan, and fry until golden brown, about 60 seconds. Turn the doughnuts over and fry until the other side is golden, 30 to 60 seconds. Drain on paper towels for a minute after the doughnuts are fried. Dip the top of the warm doughnuts into the glaze or cinnamon sugar mixture (if using) and serve immediately.",
    "* Tip: Here’s an easy way to find out if your thermometer’s readings are accurate."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/4014418929_1dd1c25ec9_o.jpg?w=753",
  "ingredient_list": [
    "1 cup apple cider",
    "3 1/2 cups flour, plus additional for the work surface",
    "2 teaspoons baking powder",
    "1 teaspoon baking soda",
    "1/2 teaspoon ground cinnamon",
    "1/2 teaspoon salt",
    "1/8 teaspoon ground nutmeg",
    "4 tablespoons (1/2 stick or 2 ounces) butter, at room temperature",
    "1 cup granulated sugar",
    "2 large eggs",
    "1/2 cup buttermilk",
    "Vegetable oil or shortening (see my explanation in the post) for frying",
    "Toppings (optional)",
    "Glaze (1 cup confectioners’ sugar + 2 tablespoons apple cider)",
    "Cinnamon sugar (1 cup granulated sugar + 1 1/2 tablespoons cinnamon)"
  ],
  "tags": [
    "Breakfast",
    "Cake",
    "Doughnut",
    "Fall",
    "Photo"
  ],
  "title": "apple cider doughnuts",
  "url": "https://smittenkitchen.com/2009/10/apple-cider-doughnuts/"
}