{
  "date": "2007-12-19T09:00:32+00:00",
  "directions": [
    "Cream the butter in a mixer fitted with a paddle attachment (or using a hand mixer) until soft and fluffy. Add the egg yolks and mix well.",
    "Mix the granulated sugar, flour, baking powder, and salt together. Add to the butter and egg yolk mixture and mix just until incorporated and the dough starts to come together. Turn the dough out onto a floured work surface and form into two balls. Wrap each ball in plastic wrap and freeze at least 2 hours or overnight (or as long as a month, if you like).",
    "Heat the oven to 350 degrees.",
    "Remove one ball of dough from the freezer and coarsely grate it by hand or with the grating disk in a food processor into the bottom of a 9×13-inch baking pan or a 10-inch tart pan with a removable bottom (oops, sorry, no). Make sure the surface is covered evenly with shreds of dough.",
    "With a piping bag with a wide tip or a zip-lock bag with the corner cut off, squeeze the jam over the surface as evenly as possible, to within 1/2 inch of the edge all the way around. Remove the remaining dough from the freezer and coarsely grate it over the entire surface.",
    "Bake until lightly golden brown and the center no longer wiggles, 50 to 60 minutes. As soon as the shortbread comes out of the oven, dust with confectioners’ sugar. ",
    "Cool on a wire rack, then cut in the pan with a serrated knife. I find that for this an all bar cookies, chilling the pan in the fridge makes it a lot easier to get clean cuts. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/12/austrian-raspberry-shortbread.jpg?w=750",
  "ingredient_list": [
    "1 pound (4 sticks) unsalted butter, slightly softened",
    "4 egg yolks",
    "2 cups granulated sugar",
    "4 cups all-purpose flour",
    "2 teaspoons baking powder",
    "1/4 teaspoon salt",
    "Optional additions: 1 teaspoon vanilla extract or 1 teaspoon lemon zest",
    "1 cup raspberry jam, at room temperature",
    "1/4 cup confectioners’ sugar"
  ],
  "tags": [
    "Bars",
    "Cookie",
    "Photo"
  ],
  "title": "austrian raspberry shortbread",
  "url": "https://smittenkitchen.com/2007/12/austrian-raspberry-shortbread/"
}