[
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "3/4 cup (75 grams or 2 1/2 to 2 3/4 ounces) sliced almonds, ideally toasted and cooled", 
            "1 tablespoon (10 grams) all purpose flour", 
            "A few pinches of sea salt", 
            "6 tablespoons (75 grams) plus 1 teaspoon (5 grams) granulated sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/2 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1/2 pound rhubarb", 
            "To finish", 
            "Powdered sugar or 1/4 cup jam of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/almond-rhubarb-picnic-bars-e14640188536441.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2016/05/almond-rhubarb-picnic-bars/", 
        "title": "almond rhubarb picnic bars", 
        "directions": [
            "Heat oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] ", 
            "Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind almonds, 6 tablespoons sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. ", 
            "Arrange the fruit: Trim rhubarb and cut it half horizontally top to bottom, i.e. like splitting a hamburger bun, with the flatter part on the bottom. [Update: Does this diagram help?] Keep tops and bottoms matched/stacked and cut stalks on the diagonal into about 1 1/4-inch lengths. The top and bottom of each segment should nicely “V” together, color side up, in a chevron pattern. If you mostly reach for the more green segments first and the pink-er segments second, you’ll end up with an ombré look on top. Sprinkle fruit with 1 teaspoon granulated sugar.", 
            "Bake the bars: For 45 to 55 minutes, until they’re golden on top and a toothpick inserted into the almond cream underneath comes out cream-free. The rhubarb pieces are going to move around a little as it bakes so don’t be surprised if the pattern looks a little different when it’s done. ", 
            "Let cool in pan on a rack, or in the fridge, or even in the freezer. You can decorate the bars with a little powdered sugar, or warm some jam and brush it over for a glossier finish. I find it easiest to get very clean cuts when the bars are very cold. A serrated knife, used gently, can ensure the rhubarb stays perfectly put if it’s not cold enough. While bars do not need to be refrigerated if it will just be a day or so, they keep longer and (I think) more nicely chilled."
        ], 
        "date": "2016-05-23T11:56:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup apple cider", 
            "3 1/2 cups flour, plus additional for the work surface", 
            "2 teaspoons baking powder", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon ground cinnamon", 
            "1/2 teaspoon salt", 
            "1/8 teaspoon ground nutmeg", 
            "4 tablespoons (1/2 stick or 2 ounces) butter, at room temperature", 
            "1 cup granulated sugar", 
            "2 large eggs", 
            "1/2 cup buttermilk", 
            "Vegetable oil or shortening (see my explanation in the post) for frying", 
            "Toppings (optional)", 
            "Glaze (1 cup confectioners’ sugar + 2 tablespoons apple cider)", 
            "Cinnamon sugar (1 cup granulated sugar + 1 1/2 tablespoons cinnamon)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/4014418929_1dd1c25ec9_o.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Cake", 
            "Doughnut", 
            "Fall", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/10/apple-cider-doughnuts/", 
        "title": "apple cider doughnuts", 
        "directions": [
            "Make the doughnuts: In a saucepan over medium or medium-low heat, gently reduce the apple cider to about 1/4 cup, 20 to 30 minutes. Set aside to cool.", 
            "Meanwhile, in a bowl, combine the flour, baking powder and soda, cinnamon, salt and nutmeg. Set aside.", 
            "Using an electric mixer on medium speed (with the paddle attachment, if using a standing mixer) beat the butter and granulated sugar until the mixture is smooth. Add the eggs, one at a time, and continue to beat until the eggs are completely incorporated. Use a spatula to scrape down the sides of the bowl occasionally. Reduce the speed to low and gradually add the reduced apple cider and the buttermilk, mixing just until combined. Add the flour mixture and continue to mix just until the dough comes together.", 
            "Line two baking sheets with parchment or wax paper and sprinkle them generously with flour. Turn the dough onto one of the sheets and sprinkle the top with flour. Flatten the dough with your hands until it is about 1/2 inch thick. Use more flour if the dough is still wet. Transfer the dough to the freezer until it is slightly hardened, about 20 minutes. Pull the dough out of the freezer. Using a 3-inch or 3 1/2-inch doughnut cutter — or a 3 1/2-inch round cutter for the outer shape and a 1-inch round cutter for the hole from a set like this, as I did — cut out doughnut shapes. Place the cut doughnuts and doughnut holes onto the second sheet pan. Refrigerate the doughnuts for 20 to 30 minutes. (You may re-roll the scraps of dough, refrigerate them briefly and cut additional doughnuts from the dough.)", 
            "Add enough oil or shortening to a deep-sided pan to measure a depth of about 3 inches. Attach a candy thermometer to the side of the pan and heat over medium heat until the oil reaches 350°F*. Have ready a plate lined with several thicknesses of paper towels.", 
            "Make your toppings (if using): While the cut doughnut shapes are in the refrigerator, make the glaze by whisking together the confectioners’ sugar and the cider until the mixture is smooth; make the cinnamon sugar by mixing the two together. Set aside.", 
            "Fry and top the doughnuts: Carefully add a few doughnuts to the oil, being careful not to crowd the pan, and fry until golden brown, about 60 seconds. Turn the doughnuts over and fry until the other side is golden, 30 to 60 seconds. Drain on paper towels for a minute after the doughnuts are fried. Dip the top of the warm doughnuts into the glaze or cinnamon sugar mixture (if using) and serve immediately.", 
            "* Tip: Here’s an easy way to find out if your thermometer’s readings are accurate."
        ], 
        "date": "2009-10-19T10:35:29+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine ", 
            "Filling", 
            "3/4 cup (a scant 4 ounces or 110 grams) shelled unsalted pistachios", 
            "1 tablespoon (10 grams) all purpose flour", 
            "Few pinches of sea salt", 
            "6 tablespoons (75 grams) sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/4 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1 pound firm-ripe apricots", 
            "To finish", 
            "Powdered sugar or 1/4 cup apricot jam"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/apricot-pistachio-squares1.jpg?w=640", 
        "tags": [
            "Apricots", 
            "Bars", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/08/apricot-pistachio-squares/", 
        "title": "apricot pistachio squares", 
        "directions": [
            "Heat your oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (If you have an 8-inch square springform, you can skip this and just butter it well.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. Transfer the dough clumps to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "(Don’t have a food processor? You might have an easier time using softened butter and preparing this cookie-style: cream it with the sugar with a hand mixer, then spoon in the salt and flour, beating until just combined. It might help to chill this mixture a bit before pressing it into the pan, or it might feel too greasy to easily spread.)", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind your pistachios, sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. ", 
            "Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. Cut apricots in half (or, you might find that you can tear them open at the seams with your fingers) and remove pits. From here, you have a few decoration options: you can place the apricot halves in facedown or up all over the pistachio base. You can do as I did, which is cut them into strips, then slide each cut half onto a butter knife or offset spatula, tilt it so that it fans a little, and slide it onto your pistachio filling decoratively. (With this method, I ended up not using all of my apricots.) You could also arrange the strips like petals of flower around the pan, for maximum pretties.]]", 
            "Bake the bars for 60 minutes, or until they are golden and a toothpick inserted into the pistachio portion comes out batter-free. This might take up to 10 minutes longer depending on the juiciness of your apricots and the amount you were able to nestle in. Let cool completely in pan; you can hasten this along in the fridge. ", 
            "To finish, you can make a shiny glaze for your tart by warming the jam in a small saucepan until it thins, and brushing this mixture over the top of the cooled tart. Or, you can keep it rustic with just a dusting of powdered sugar, as I did. ", 
            "Cut bars into squares — chilled bars will give you the cleanest cuts. Keep leftover bars chilled. "
        ], 
        "date": "2014-08-07T12:18:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup long-grain white rice", 
            "2 cinnamon sticks (I had very large canela sticks — see bottom for more info — so I only used one)", 
            "2 strips of lemon or orange zest (can use a peeler to get a larger piece)", 
            "3 whole cloves or a tiny pinch of ground cloves", 
            "4 cups water", 
            "1 egg", 
            "3 cups whole milk (updated to note that many people, including my  mother, successfully made this with lower fat milks)", 
            "1 (12-ounce) can sweetened condensed milk (I realized after the fact that my can had been 14 ounces, had no averse effect)", 
            "1/4 teaspoon salt", 
            "1 tablespoon vanilla", 
            "1/2 cup raisins (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/02/arroz-con-leche.jpg?w=751", 
        "tags": [
            "Coconut", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2010/02/arroz-con-leche-rice-pudding/", 
        "title": "arroz con leche (rice pudding)", 
        "directions": [
            "Soak the rice, cinnamon sticks, lemon or orange zest and whole or powdered cloves in the water in a heavy saucepan for 1 hour.", 
            "After soaking, bring the rice mixture to a boil on high heat, uncovered. When it starts to boil (about 5 minutes), lower the heat to medium and cook for 10 to 12 more minutes or until water is almost evaporated.", 
            "While rice is cooking, beat the egg in a bowl. Add the milk and stir well to mix. Add the egg mixture, condensed milk, salt, vanilla extract and raisins, if using, to the rice and cook over medium-low heat, stirring carefully, until it thickens slightly or until desired consistency about 25 to 35 minutes (see notes that follow).", 
            "(About cooking time: Many reviewers said 25 to 35 minutes was way too much cooking time for them, and that 15 to 20 minutes would have been better. I was all ready to pull my pot off early, but actually needed almost 30 minutes. Still, want to give you a heads up that yours might be done sooner.)", 
            "(About “desired consistency”: I cooked mine until all but 10 percent of the liquid had been absorbed, which yielded a creamy, not-too-thick pudding. If you like your arroz con leche thinner, pull it off the stove when more liquid is left. This pudding does most of its thickening as it cools, but the end result should still be thinner than traditional rice pudding.)", 
            "Remove citrus zest and cinnamon sticks. Let cool uncovered, then chill the rest of the way in the fridge.", 
            "Mexican cinnamon: A long time ago, I bought a jar of canela (Mexican \"soft cinnamon\") sticks from Rancho Gordo and this was the perfect time to bust it out. The cinnamon flavor is just a little different than we’re used to, a little less loud and one note, a little dynamic. It smells exactly like a cross between a cinnamon stick and apple cider. Seriously! When simmered with the pudding for almost an hour, the pudding had an almost spicy edge to it and an unmistakable flavor I associate only with arroz con leche."
        ], 
        "date": "2010-02-24T20:05:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (4 sticks) unsalted butter, slightly softened", 
            "4 egg yolks", 
            "2 cups granulated sugar", 
            "4 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/4 teaspoon salt", 
            "Optional additions: 1 teaspoon vanilla extract or 1 teaspoon lemon zest", 
            "1 cup raspberry jam, at room temperature", 
            "1/4 cup confectioners’ sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/12/austrian-raspberry-shortbread.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/austrian-raspberry-shortbread/", 
        "title": "austrian raspberry shortbread", 
        "directions": [
            "Cream the butter in a mixer fitted with a paddle attachment (or using a hand mixer) until soft and fluffy. Add the egg yolks and mix well.", 
            "Mix the granulated sugar, flour, baking powder, and salt together. Add to the butter and egg yolk mixture and mix just until incorporated and the dough starts to come together. Turn the dough out onto a floured work surface and form into two balls. Wrap each ball in plastic wrap and freeze at least 2 hours or overnight (or as long as a month, if you like).", 
            "Heat the oven to 350 degrees.", 
            "Remove one ball of dough from the freezer and coarsely grate it by hand or with the grating disk in a food processor into the bottom of a 9×13-inch baking pan or a 10-inch tart pan with a removable bottom (oops, sorry, no). Make sure the surface is covered evenly with shreds of dough.", 
            "With a piping bag with a wide tip or a zip-lock bag with the corner cut off, squeeze the jam over the surface as evenly as possible, to within 1/2 inch of the edge all the way around. Remove the remaining dough from the freezer and coarsely grate it over the entire surface.", 
            "Bake until lightly golden brown and the center no longer wiggles, 50 to 60 minutes. As soon as the shortbread comes out of the oven, dust with confectioners’ sugar. ", 
            "Cool on a wire rack, then cut in the pan with a serrated knife. I find that for this an all bar cookies, chilling the pan in the fridge makes it a lot easier to get clean cuts. "
        ], 
        "date": "2007-12-19T09:00:32+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust: ", 
            "1 1/4 pounds unsalted butter, room temperature", 
            "3/4 cup granulated sugar", 
            "3 extra-large eggs", 
            "3/4 teaspoon pure vanilla extract", 
            "4 1/2 cups all-purpose flour", 
            "1/2 teaspoon baking powder", 
            "1/4 teaspoon salt ", 
            "Topping: ", 
            "1 pound unsalted butter", 
            "1 cup good honey", 
            "3 cups light brown sugar, packed", 
            "1 teaspoon grated lemon zest", 
            "1 teaspoon grated orange zest", 
            "1/4 cup heavy cream", 
            "2 pounds pecans, coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/aww-yeah-1017-grams-of-butter1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/12/aww-yeah-1017-grams-of-butter/", 
        "title": "pecan squares", 
        "directions": [
            "Preheat the oven to 350°F. ", 
            "For the crust: Beat the butter and granulated sugar in the bowl of an electric mixer fitted with a paddle attachment, until light, approximately 3 minutes. Add the eggs and the vanilla and mix well. Sift together the flour, baking powder, and salt. Mix the dry ingredients into the batter with the mixer on low speed until just combined. Press the dough evenly into an ungreased 18 by 12 by 1-inch baking sheet, making an edge around the outside. It will be very sticky; sprinkle the dough and your hands lightly with flour. Bake for 15 minutes, until the crust is set but not browned. Allow to cool. ", 
            "For the topping: Combine the butter, honey, brown sugar, and zests in a large, heavy-bottomed saucepan. Cook over low heat until the butter is melted, using a wooden spoon to stir. Raise the heat and boil for 3 minutes. Remove from the heat. Stir in the heavy cream and pecans. Pour over the crust, trying not to get the filling between the crust and the pan. Bake for 25 to 30 minutes, until the filling is set. Remove from the oven and allow to cool. Wrap in plastic wrap and refrigerate until cold. Cut into bars and serve."
        ], 
        "date": "2006-12-08T14:07:31+00:00"
    }, 
    {
        "ingredient_list": [
            "Pudding", 
            "1 3/4 cups (from a 15-ounce can, 415 grams) pumpkin puree (unsweetened; not pumpkin pie filling)", 
            "1/2 cup (100 grams) granulated sugar", 
            "1 teaspoon (2 grams) ground cinnamon", 
            "1/2 teaspoon (3 grams) table salt", 
            "1/2 teaspoon ground ginger", 
            "1/4 teaspoon ground cloves", 
            "1 cup (237 ml) whole milk", 
            "1/2 cup (118 ml) heavy cream", 
            "2 large eggs, lightly beaten", 
            "Topping", 
            "1 cup (227 grams) sour cream", 
            "1 tablespoon (13 grams) granulated sugar", 
            "1/4 teaspoon (1 ml) vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/11/baked-pumpkin-puddings-with-sour-cream.jpg?w=750", 
        "tags": [
            "Fall", 
            "Gluten-Free", 
            "Photo", 
            "Pudding", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2011/11/baked-pumpkin-and-sour-cream-puddings/", 
        "title": "baked pumpkin and sour cream puddings", 
        "directions": [
            "Preheat oven to 350°F.", 
            "The quickest method: In a medium bowl, whisk together all of the pudding ingredients.", 
            "For creamier, silkier pudding: Combine pumpkin, sugar, salt and spices in a food processor and blend for 30 seconds. Transfer to a saucepan and heat over medium-high. Once glurping and simmering in the pot, cook for another 5 minutes, stirring frequently. The mixture will thicken and get a bit darker. Reduce heat slightly and whisk in milk and cream. Off the heat, slowly whisk in eggs.", 
            "Both methods: Divide between 7 to 8 (I had just shy of enough to make eight 1/2-cup puddings) ovenproof 6-ounce pudding cups or ramekins on a baking sheet. Bake for 35 to 40 minutes, until puddings barely jiggle when shimmied and/or a knife tip inserted into the center of puddings comes out clean. Try not to overbake.", 
            "While they bake, combine topping ingredients in a small bowl. When the puddings are cooked through, transfer to a cooling rack on the counter and leave oven on. Spoon 2 tablespoons of sour cream mixture onto first pudding and use a small offset spatula, butter knife or spoon to quickly (it will get melty fast) spread it over the top of the first pudding. Repeat with remaining puddings.", 
            "Return puddings to oven for 5 more minutes, then cool completely at room temperature, about 1 to 2 hours. Chill until ready to serve. Eat with a gingersnap."
        ], 
        "date": "2011-11-16T11:27:48+00:00"
    }, 
    {
        "ingredient_list": [
            "Custard", 
            "3⁄4 cup (150 grams) granulated sugar", 
            "1⁄4 cup (35 grams) cornstarch", 
            "1/4 teaspoon fine salt", 
            "6 large egg yolks", 
            "3 1⁄2 cups (830 ml) milk, preferably whole", 
            "2 tablespoons (30 grams) butter, cut into a few bits", 
            "1 tablespoon (15 ml) vanilla", 
            "1 tablespoon (15 ml) dark rum (optional, but think it has an amazing impact here)", 
            "Wafers", 
            "1 cup (200 grams) granulated sugar", 
            "Seeds from 1/2 of a fresh vanilla bean", 
            "1/2 cup (115 grams) unsalted butter, softened", 
            "1 large egg", 
            "1 tablespoon (15 ml) vanilla extract", 
            "3/4 teaspoon baking powder", 
            "1/4 teaspoon fine sea salt", 
            "1 1/3 cups (176 grams) all-purpose flour", 
            "Assembly", 
            "1/2 cup heavy cream", 
            "2 teaspoons granulated sugar", 
            "4 large firm-ripe bananas, thinly slices"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/banana-puddings-with-vanilla-bean-wafers1.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Cookie", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2016/01/banana-pudding-with-vanilla-bean-wafers/", 
        "title": "banana puddings with vanilla bean wafers", 
        "directions": [
            "Make the custard: Whisk sugar, cornstarch, salt and yolks together in the bottom of a large saucepan, ideally 4-quarts to protect against splattering as it simmers. Drizzle in milk, whisking the whole time so that no lumps form. Place over medium heat on the stove and bring up to a simmer, stirring. Once simmering, stirring, until custard thickens, 4 to 7 minutes. Remove from heat; whisk in butter, vanilla, and rum. Let chill in fridge for several hours or overnight to finish thickening. You’ll have 4 cups custard.", 
            "Make the wafers: Heat oven to 350°F. In the bottom of a large bowl, combine sugar and vanilla been seeds, rubbing them together so that the abrasion from the sugar granules helps release the maximum vanilla flavor. Add the butter and beat with an electric mixer until light and fluffy. Add egg and vanilla, beat to combine. Sprinkle baking powder and salt over batter, beat to combine. Add flour and once again, beat just to combine.", 
            "Line two large baking sheets with parchment paper or nonstick baking mats. Using your tiniest scoop (yes, I actually have one that holds about 1 teaspoon), spoon or even a 1-teaspoon measuring spoon, scoop the dough (you can then roll it in your palms for a more perfect final round shape) and space at least 2 inches apart on prepared sheets. Bake 10 to 11 minutes, keeping a close eye on them. You’ll want them to be nicely golden at the edges before you take them out. Let cool on racks. Yield: About 80 1 3/4-inch cookies.", 
            "Assembly: Beat heavy cream with 2 teaspoons sugar until soft peaks form. Line the bottom of 8 1-cup dishes with a wafer cookie. Add custard (you’re looking to use about 1/3 of it total right now). Top with a layer of bananas. Repeat twice with more cookies (you can break them up to get them to fit better in small cups), custard and bananas. Dollop each pudding with whipped cream; chill (I prefer to do so with lids on so the whipped cream doesn’t dry out) for a few hours and up to a few days.", 
            "Jars Are Weck Tulip Jelly Jars (which I’d bought to keep baby food organized then, predictably, co-opted). I urge everyone to buy “keep fresh covers” for Weck jars. Clamps are adorable and photogenic but definitely annoying in the long run. I order them from Weck directly and save the gaskets and clamps for future canning projects."
        ], 
        "date": "2016-01-28T12:00:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (30 grams) cornstarch", 
            "1/2 cup (100 grams) sugar", 
            "1/8 teaspoon salt", 
            "3 cups (710 ml) whole milk", 
            "6 ounces (170 grams) semi- or bittersweet chocolate, coarsely chopped (or 1 cup good chocolate chips)", 
            "1 teaspoon (5 ml) pure vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/best-chocolate-pudding11.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2008/02/best-chocolate-pudding/", 
        "title": "best chocolate pudding", 
        "directions": [
            "Combine the cornstarch, sugar and salt in a medium saucepan, Slowly whisk in the milk, in a thin steam at first so that lumps don’t form, then more quickly once the cornstarch mixture is smoothly incorporated. Place over medium-low heat and stir occasionally, scraping the bottom and sides. Use a whisk as necessary should lumps begin to form. After 10 minutes or so (slower over lower heat is better, to give the cornstarch time to cook), before it starts to simmer, the mixture should begin to thicken, enough that it will coat the back of a spoon. Add the chocolate, and continue stirring for another 2 to 4 minutes, until chocolate is fully incorporated and mixture is quite thick. Remove from heat and stir in the vanilla.", 
            "If you’re concerned about lumps: Run mixture through a fine-mesh strainer.", 
            "Distribute among individual pudding cups or one large serving bowl, and chill until it is cool and set, about 2 to 3 hours.", 
            "If you dislike pudding skin: Put plastic on top of the pudding and smooth it gently against the surface before refrigerating. ", 
            "Do ahead: Pudding is good for 3 days in the fridge but nobody I know would allow it to last that long."
        ], 
        "date": "2008-02-13T14:37:18+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (200 grams) granulated sugar", 
            "1 teaspoon baking powder", 
            "3 cups (390 grams) all-purpose flour", 
            "1/4 teaspoon salt", 
            "Zest of one lemon", 
            "1 cup (8 ounces or 225 grams) cold unsalted butter, cut into chunks", 
            "1 large egg", 
            "Juice of 1 lemon", 
            "1/2 cup (100 grams) granulated sugar", 
            "4 teaspoons cornstarch", 
            "4 cups fresh blueberries"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2710636010_a64fe15ab8_o.jpg?w=750", 
        "tags": [
            "Bars", 
            "Blueberries", 
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/07/blueberry-crumb-bars/", 
        "title": "blueberry crumb bars", 
        "directions": [
            "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9×13 inch pan.\nIn a medium bowl, stir together 1 cup sugar, 3 cups flour, baking powder, salt, and lemon zest. Use a fork or pastry cutter to blend in the butter and egg. Dough will be crumbly. Pat half of dough into the prepared pan.\nIn another bowl, stir together the sugar, cornstarch and lemon juice. Gently mix in the blueberries. Sprinkle the blueberry mixture evenly over the crust. Crumble remaining dough over the berry layer.\nBake in preheated oven for 45 minutes, or until top is slightly brown. (This took an extra 10 to 15 minutes in my oven.) Cool completely before cutting into squares.\n"
        ], 
        "date": "2008-07-29T15:25:26+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons (30 grams) unsalted butter", 
            "1/2 cup (95 grams) dark brown sugar", 
            "Several pinches of sea salt (I use a scant 1/2 teaspoon of flaky Maldon salt)", 
            "1/4 cup (30 grams) cornstarch", 
            "3 cups (710 ml) whole milk", 
            "2 teaspoons (10 ml) vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/old-school-butterscotch-pudding1.jpg?w=750", 
        "tags": [
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2015/01/butterscotch-pudding/", 
        "title": "butterscotch pudding", 
        "directions": [
            "In a medium saucepan over medium heat, melt the butter. Add the brown sugar and reduce heat to medium-low. Let it heat and bubble for 1 to 2 minutes, stirring frequently. Don’t let it smoke or burn, which brown sugar is always very eager to do. Reduce heat to low. Add salt and cornstarch, stirring until combined — it’s going to look like a thick paste. Switch to a whisk and add the milk in a thin drizzle, whisking the whole time, so that no lumps form. Once all of the milk is added, you can switch back to a spoon. Cook over low to medium-low, stirring frequently, until the mixture comes to a gentle simmer. Let it simmer for a full minute, stirring, it should clearly thicken at this stage, although it will finish thickening in the fridge. Off the heat, stir in the vanilla extract. Divide into glasses or pudding cups and let chill in fridge for 1 to 2 hours, until set. ", 
            "Those decorations on top: A dollop of whipped cream and chocolate crunchy pearls. I highly recommend the dark chocolate ones (you can get them from Callebaut, Valrhona and a few other brands); they’re so much more delicious and fun to eat than chocolate sprinkles. I highly recommend that whatever you do, you never try the beige ones, which are made from Valrhona’s Dulcey Chocolate, their in-house take on salted, caramelized white chocolate. I regret ever discovering it. Trust me, the safest thing is to never find out how good it is. ", 
            "Variation: Coconut Butterscotch Pudding: Okay, I realize that making butterscotch without butter is of questionable logic. But, I did it anyway, using coconut oil instead of butter, and canned full-fat (and well-shaken) coconut milk for the milk above, yielded a totally dairy-free pudding. The result is something distinctly delicious, a little darker and more translucent in color than the dairy version, with a nuttier butterscotch flavor. Don’t skimp on the salt here."
        ], 
        "date": "2015-01-08T11:58:44+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups milk, whole or 2% (no, I haven’t tried skim, if you do, let us know how it goes)", 
            "6 tablespoons cornstarch", 
            "2 teaspoons pure vanilla extract", 
            "1/4 teaspoon salt", 
            "1 cup sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/caramel-pudding1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2010/01/caramel-pudding/", 
        "title": "caramel pudding", 
        "directions": [
            "In a small bowl, whisk 1/2 cup of the milk with the cornstarch, vanilla and salt until smooth. Set aside. In a large saucepan, combine the sugar with 6 tablespoons of water and bring to a boil. Cook over moderately high heat, undisturbed, until a deep amber caramel forms, about 8 minutes. Be patient but watch the stove like a hawk as caramel changes color quickly, and only burns when you think you are safe leave the room for a second. Remove from the heat. Very gradually whisk in the remaining 3 1/2 cups of milk. (This is another great place for your whisk for the corners.) As you begin whisking it in, the caramel will get very dark, and likely make you nervous that you’ve burnt it. Fear not; that there is your flavor base.", 
            "Return the pot to the stove and whisk over moderate heat until the caramel has dissolved again. Once again, watch this closely as the milk will foam up quickly as it comes to a simmer. Simmer over moderately low heat until the mixture thickens slightly and deepens in color, about 10 minutes.", 
            "Gradually whisk the cornstarch mixture into the caramel. Cook again over moderate heat, stirring, until the pudding thickens, about one minute. If you’re not lazy like me, strain the pudding fine strainer set over a large measuring cup; if you are, you can skip this and nothing terrible will happen. Scrape the pudding into eight 1/2-cup ramekins and refrigerate until chilled and set, about 2 hours.", 
            "To avoid a pudding skin if you, like everyone in the world but me, are pudding skin-averse: Press a piece of plastic wrap onto the surface of each pudding dish as it chills."
        ], 
        "date": "2010-01-04T23:52:01+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust:", 
            "7 tablespoons unsalted butter, melted", 
            "1/3 cup sugar", 
            "1/4 teaspoon vanilla extract", 
            "1 cup plus 1 tablespoon all purpose flour", 
            "Pinch of salt", 
            "Filling:", 
            "1/2 cup sugar", 
            "2 large eggs", 
            "Pinch of salt", 
            "1/4 cup all purpose flour", 
            "1 teaspoon vanilla extract", 
            "1/2 cup (1 stick) unsalted butter, diced", 
            "1 pound sweet cherries, which will yield 12 ounces of pitted cherries, which yielded some leftovers, perfect for snacking (alternately, you can use 12 ounces of the berry of your choice)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/3664441408_6dbba66669_b.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cherries", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/06/cherry-brown-butter-bars/", 
        "title": "cherry brown butter bars", 
        "directions": [
            "Make crust: Preheat over to 375°F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (It should look like this.) Congratulations! You’ve just faked a square tart pan.", 
            "Using rubber spatula or fork, mix melted butter, sugar, and vanilla in medium bowl, or if you’re Deb, in the bottom of the small saucepan you used to melt the butter. Add flour and salt and stir until incorporated. Transfer dough to your prepared pan, and use your fingertips to press the dough evenly across the bottom of the pan. Bake the crust until golden, about 18 minutes (it will puff slightly while baking). Transfer crust to rack and cool in pan. Maintain oven temperature.", 
            "Make the filling: Cook butter in heavy small saucepan (a lighter-colored one will make it easier to see the color changing, which happens quickly) over medium heat until deep nutty brown (do not burn), stirring often and watching carefully, about six minutes. Immediately pour browned butter into glass measuring cup to cool slightly.", 
            "Whisk sugar, eggs, and salt in medium bowl to blend. Add flour and vanilla and whisk until smooth. Gradually whisk browned butter into sugar-egg mixture; whisk until well blended.", 
            "Arrange pitted cherries, or the berries of your choice, in bottom of cooled crust. Carefully pour browned butter mixture evenly over the fruit. Bake bars until filling is puffed and golden and tester inserted into center comes out clean, about 40 minutes (though, of course, this took less time in my hyperactive oven so please watch your baking times carefully). Cool bars completely in pan on rack.", 
            "Use the parchment paper overhang to carefully remove cooled bars from pan and place them on a cutting board and cut them into squares with a very sharp knife. The cherries, if they fall over your slicing lines, will want to give you trouble but if you saw a sharp knife into them slowly before pressing down, they’ll cut neatly and with minimum carnage.", 
            "Do ahead: Can be made at least a day ahead, and stored at room temperature. Any longer, keep them cool in the fridge."
        ], 
        "date": "2009-06-29T13:07:57+00:00"
    }, 
    {
        "ingredient_list": [
            "2 3/4 cups (12 3/8 ounces or 352 grams) all-purpose flour", 
            "1 cup (3 ounces or 90 grams) unsweetened Dutch-process cocoa", 
            "2 teaspoons (about 3/8 ounce or 10 grams) baking powder", 
            "1/2 teaspoon (about 1/8 ounces or 4 grams) salt", 
            "4 large eggs", 
            "1 1/2 (10 5/8 ounces or 300 grams) cups sugar", 
            "1/3 cup (2 7/8 ounce or 84 grams) sour cream (what I used) or buttermilk or you can make your own", 
            "3 tablespoons (1 1/2 ounces or 42 grams) butter, melted and cooled a bit", 
            "Your fat of choice for frying (solid vegetable shortening or canola, peanut or vegetable oil are popular choices)", 
            "8 ounces powdered sugar", 
            "3 tablespoons water, milk or buttermilk (what I used, highly recommended)", 
            "1/8 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/chocolate-doughnut-holes1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Chocolate", 
            "Doughnut", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/06/chocolate-doughnut-holes/", 
        "title": "chocolate doughnut holes", 
        "directions": [
            "Whisk together until smooth. If you need it thinner, add more water, milk or buttermilk, a few drops at a time."
        ], 
        "date": "2010-06-15T14:50:25+00:00"
    }, 
    {
        "ingredient_list": [
            "Pudding filling:", 
            "1/4 cup cornstarch", 
            "1/3 cup plus 2 tablespoons sugar, divided", 
            "3 tablespoons unsweetened cocoa powder", 
            "1/4 teaspoon salt", 
            "3 cups whole milk", 
            "4 ounces bittersweet chocolate (not more than 60% cacao), finely chopped", 
            "1 teaspoon pure vanilla extract", 
            "1 cup chilled heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/09/chocolate-pudding-pie.jpg?w=753", 
        "tags": [
            "Chocolate", 
            "Photo", 
            "Pudding", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/09/chocolate-pudding-pie/", 
        "title": "chocolate pudding pie", 
        "directions": [
            "Bittersweet chocolate shavings for garnish (optional)", 
            "Prepare pie dough: Roll out dough on a lightly floured surface with a lightly floured rolling pin into an 11-inch round, then fit into a 9-inch pie plate. Trim edge, leaving a 1/2-inch overhang, then fold overhang under and crimp edge decoratively. Prick bottom and side of shell all over with a fork, then chill shell 30 minutes. While shell chills, preheat oven to 375°F with a baking sheet on middle rack. Line shell with foil and fill with pie weights*.", 
            "Bake on baking sheet until pastry is set and edge is pale golden, about 25 minutes. Carefully remove weights and foil, then bake shell on baking sheet until pale golden all over, 15 to 20 minutes more. Cool shell.", 
            "Make pudding filling: Whisk together cornstarch, 1/3 cup sugar, cocoa powder, and salt in a 2-quart heavy saucepan, then gradually whisk [tips alert!] in milk. Bring to a boil over medium heat, whisking constantly, then boil, whisking, two  minutes (mixture will thicken). Remove from heat and whisk in chocolate and vanilla until smooth.", 
            "Pour filling into cooled shell and chill, its surface covered with wax paper (if you want to prevent a skin from forming), until cold, at least two hours.", 
            "Just before serving, beat cream with remaining two tablespoons sugar until it just holds soft peaks. Spoon onto pie and garnish with bittersweet chocolate shavings, if you’re feeling fancy.", 
            "Do ahead: Pie dough can be made and chilled up to two days. Pie, without whipped cream, can be chilled up to one day before serving. Whipped cream is best added at the last minute, however, I did find that ours held up surprisingly well for a day (so far), if you feel like winging it.", 
            "* Detour! This is where I admit that I for reasons both lengthy and boring, I really loathe working with pie weights and use a different technique to blind bake pie and pastry shells. Instead, I freeze my rolled-out shells for 20 to 30 minutes until solid, press a piece of buttered foil, buttered side down, very tightly against the frozen shell and blind bake it according to regular directions. When it is time to remove the weights, I carefully pull back the foil, and press any part of the crust that has bubbled up gently back with the back of a spoon and continue baking the shell. Try it!"
        ], 
        "date": "2009-09-07T11:58:53+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "2 cups (475 ml) water", 
            "3 tablespoons (40 grams) unsalted butter, cold is fine", 
            "2 tablespoons (25 grams) granulated sugar", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1/2 teaspoon fine sea or table salt", 
            "2 cups (260 grams) all-purpose flour", 
            "2 large eggs", 
            "1 1/2 to 2 quarts (about 1 1/2 to 1 2/3 liters) vegetable oil for frying", 
            "Coating", 
            "2/3 cup (130 grams) granulated sugar", 
            "1 1/4 teaspoons ground cinnamon or canela", 
            "Chocolate", 
            "3/4 cup (175 ml) heavy or whipping cream", 
            "5 ounces (140 grams) chopped semi- or bittersweet chocolate or about 1/2 cup chocolate chips", 
            "Pinch salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/churros1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Doughnut", 
            "Photo", 
            "Spanish"
        ], 
        "url": "https://smittenkitchen.com/2016/03/churros/", 
        "title": "churros", 
        "directions": [
            "Make the dough: Heat water, butter, sugar, vanilla and salt in a medium-size saucepan until simmering and butter has melted. Remove from heat and dump in flour all at once. Mix vigorously with a spoon until the mixture forms a smooth ball and no floury bits are visible. ", 
            "Let cool 5 to 10 minutes, then add eggs, one at a time. You can beat them in with a large whisk and strong arm, or use a hand- or stand mixer. Be warned that the dough really likes to ride up the beaters of a handmixer, so keep it pushed down. ", 
            "Transfer churros to a pastry bag or strong gallon ziploc bag with a corner snipped off, fitted with a large closed star tip — Cook’s Country recommends a #8 pastry tip, 5/8-inch in diameter but I might have preferred a slightly smaller one so they were less thick. ", 
            "If you’d like to make them the traditional way, you can skip right to the frying stage and pipe the churros in 6-inch or desired lengths (I played around with some blob-shaped minis) right into the oil, snipping them off with scissors at your desired length. But I found it a little easier to pipe them while still warm onto a large baking sheet that had been lined with parchment paper and sprayed lightly with a nonstick spray, so I was in less of a rush. If using this method, transfer the tray of shaped churros to the fridge for 15 minutes and up to a couple hours to help the shapes set before frying them.", 
            "Cook the churros: Heat oven to 200 degrees to keep churros warm while you fry them in batches. Line a large plate with a couple layers of paper towels. Add oil to Dutch oven or cast iron skillet until it measures about 1 1/2 inches deep and heat over medium/medium-high heat to 375 degrees.", 
            "Gently drop a few churros at a time into the oil and fry until deep golden brown on all sides, which will take about 6 minutes. Turn them frequently so that they cook evenly. Adjust heat as needed so that the oil does not dip below 350 degrees. Once churros are cooked, remove from oil and drain on towels for a minute before transferring to a tray in the oven to keep warm. Return your oil to 375 degrees before adding more churros. Repeat with remaining dough.", 
            "Coat the churros: Once all churros are fried, combine cinnamon and sugar on a plate. Roll warm churros, one by one, in sugar to coat, spooning more cinnamon-sugar on as you do for best coverage. Tap off excess. Do not let warm churros sit in cinnamon sugar for longer than needed to coat or the sugar will get clumpy.", 
            "Make the sauce: Heat cream, chocolate and salt in a bowl in microwave in 30 second bursts, whisking between them, until chocolate has melted. ", 
            "Dip warm churros in warm chocolate sauce, repeat as needed.", 
            "Do ahead: Choux dough, the style of dough used here, can be made and kept in bowl for up to a day before using, but it will be easier to pipe when it’s still warm. Piped raw churros should be good in the fridge for a few hours, but I haven’t tested it for a full day, though it stands to reason they’d keep that long too. Churros can be kept warm in oven before coating with cinnamon sugar for probably up to an hour before they might get dry. They’re best on the first day."
        ], 
        "date": "2016-03-03T12:14:43+00:00"
    }, 
    {
        "ingredient_list": [
            "Pudding", 
            "1/3 cup small pearl tapioca (I used this)", 
            "2 1/2 cups coconut milk (light or full-fat; a 13.5-ounce can will contain 1 3/4 cups)", 
            "1 egg yolk", 
            "1/3 cup granulated sugar", 
            "1/4 teaspoon table salt or a heaped 1/4 teaspoon sea salt", 
            "1/2 teaspoon vanilla extract or the seeds from a 1-inch segment of vanilla bean", 
            "Mango puree", 
            "1 very ripe mango, peeled, pitted and roughly chopped", 
            "2 teaspoons granulated sugar (optional; I used it but would skip it next time)", 
            "A squeeze or two of fresh lime juice", 
            "Optional garnishes", 
            "Whipped coconut cream", 
            "1/2 cup toasted coconut flakes", 
            "Few gratings of lime zest"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/coconut-tapioca-pudding-with-mango1.jpg?w=500", 
        "tags": [
            "Coconut", 
            "Gluten-Free", 
            "Mango", 
            "Photo", 
            "Pudding", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/01/coconut-tapioca-pudding-with-mango/", 
        "title": "coconut tapioca pudding with mango", 
        "directions": [
            "Make pudding: In a medium saucepan, soak tapioca in coconut milk for 30 minutes. Whisk in egg yolk, sugar, salt and vanilla bean seeds, if using (if using extract, you’ll add it in a bit). Place saucepan over medium heat until mixture comes to a simmer, then reduce it to very low heat so it’s barely bubbling, and cook it until it thickens, about 15 minutes, stirring frequently. Remove from heat and add vanilla extract, if using. [Pudding will be the consistency of thick gravy — i.e. worrisomely thin — going into the cups but after chilling in the fridge, it will set.] Pour into pudding cups to chill for several hours or overnight. ", 
            "Make mango puree: Place mango chunks in food processor with sugar (if using) and lime juice and blend until very smooth, scraping down the sides several times, if needed. Refrigerate puree until needed.", 
            "Serve with mango puree on top, plus whipped coconut cream, toasted coconut flakes or a few gratings of lime zest.", 
            "To make whipped coconut cream: This a bit of advance planning. Place 1 can of full-fat coconut milk in the fridge overnight; in most brands, this will cause the coconut fats and thin milk/watery part to separate. Place a small/medium mixing bowl in the freezer, ideally metal. The next day, turn it upside-down before opening it, so that the thickened coconut fat will be at the bottom. Pour off the thin coconut milk; you should have about 1 cup and this can be used towards the 2 1/2 cups needed for your pudding. About 2/3 cup thickened coconut fat will remain at the bottom of the can; scrape this into your chilled bowl, add about 1 tablespoon granulated sugar (for a light sweetness; use more to taste) and beat it with an electric mixer until thick and whipped cream-like. Dollop it over desserts such as this, though you’ll have more than you need for 6 puddings. ", 
            "To toast coconut chips: Heat an oven to 350 degrees F. Spread coconut flakes on a rimmed baking sheet and toast until golden brown and fragrant, about 5 minutes, tossing once if needed to help them brown evenly. Let cool before using.", 
            "How to use a vanilla bean: Cut off desired amount of bean. With a sharp paring knife, split the segment lengthwise. Use the back of the knife to scrape the seeds out of the open pod; they’ll be on both sides and look a bit like sticky tar. Use these in your pudding. Go ahead and throw the pods in, too, for extra flavor, just remember to fish them out before chilling the pudding."
        ], 
        "date": "2014-01-09T12:12:56+00:00"
    }, 
    {
        "ingredient_list": [
            "For the filling", 
            "1 1/2 cups (8 ounces) pitted dates, chopped", 
            "3/4 cup water", 
            "1 teaspoon finely grated orange (or mandarin or clementine) zest", 
            "For the crumbs", 
            "2 tablespoons packed brown sugar", 
            "1/4 cup raw or turbinado sugar", 
            "1/2 cup olive oil, coconut oil, melted butter or a mix of the above", 
            "3/4 cups rolled oats, I used quick-cooking but old-fashioned should work just fine", 
            "3/4 cup plus 2 tablespoons whole wheat flour, or a wholegrain flour mix of your choice", 
            "1/2 teaspoon ground cinnamon", 
            "A few gratings of fresh nutmeg", 
            "A pinch or two of ground cloves", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon coarse sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-breakfast-squares1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Dates", 
            "Photo", 
            "Snack", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2015/11/date-breakfast-squares/", 
        "title": "date breakfast squares", 
        "directions": [
            "Heat oven to 400 degrees. Either grease bottom and sides of an 8×8-inch pan or line the bottom and sides with parchment paper. ", 
            "In a small saucepan, combine dates, water and zest over low heat, simmering for 5 to 10 minutes, until liquid has absorbed and mixture has thickened. Set aside while you make the crumbs.", 
            "In a large bowl, mix the sugars and oil or butter together. Add the oats, flour, spices, baking soda and salt and stir to combine; the mixture should form a coarse rubble. ", 
            "Press half into the bottom of your prepared pan. Dollop the date mixture over it and use a small offset spatula (or whatever you have on hand) to spread the mixture smoothly over the crumbs. Don’t worry if the crumbs move around a little underneath; these bars don’t require perfection. Sprinkle remaining crumbs over date layer and press lightly to cover. ", 
            "Bake bars for 25 minutes, or until light brown at the edges. Cool in pan. Cut into squares. They’ll keep just fine at room temperature but will last up to a week in the fridge and longer in the freezer."
        ], 
        "date": "2015-11-20T11:50:15+00:00"
    }, 
    {
        "ingredient_list": [
            "For crust", 
            "3 1/2 ounces (100 grams or 1 cup) graham crackers, crumbled", 
            "2 tablespoons (25 grams) sugar", 
            "3 tablespoons (45 grams) unsalted butter, melted", 
            "For filling", 
            "1 teaspoon unflavored gelatin (from a 1/4-ounce or 7-gram envelope, will be just about half an envelope)", 
            "1/4 cup (60 ml) whole milk", 
            "8 ounces (225 grams) cream cheese, softened", 
            "2 large eggs", 
            "3/8 teaspoon salt", 
            "1 cup dulce de leche (12 1/2-ounce or 355-gram can) (recipe follows)", 
            "For glaze", 
            "3 ounces (85 grams) fine-quality bittersweet chocolate (not unsweetened), coarsely chopped", 
            "1/2 stick (2 ounces or 55 grams) unsalted butter, cut into pieces", 
            "2 teaspoons light corn syrup"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/dulce-de-leche-cheesecake-squares.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cake", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/02/dulce-de-leche-cheesecake-squares/", 
        "title": "dulce de leche cheesecake squares", 
        "directions": [
            "Make crust: Put oven rack in middle position and preheat oven to 325°F. Line bottom and sides of an 8-inch square baking pan with 2 sheets of foil (crisscrossed), leaving a 2-inch overhang on all sides.", 
            "Finely grind crackers with sugar and a pinch of salt in a food processor. With motor running, add butter, blending until combined. Press mixture evenly onto bottom of baking pan. Bake 10 minutes, then cool in pan on a rack 5 minutes.", 
            "Make filling: Sprinkle gelatin over milk in a small bowl and let stand 2 minutes to soften. Beat together cream cheese, eggs, salt, and gelatin mixture in a bowl with an electric mixer at medium speed until well combined, about 2 minutes, then stir in dulce de leche gently but thoroughly. Pour filling over crust, smoothing top, then bake in a hot water bath (I was able to fit mine in a 9×13-inch baking pan) in oven until center is just set, about 45 minutes. Cool cheesecake completely in pan on rack, about 2 hours. Chill, covered, at least 6 hours.", 
            "Glaze cake within 2 hours of serving: Heat all glaze ingredients in a double boiler or a small metal bowl set over a saucepan of barely simmering water, stirring until smooth, then pour over cheesecake, tilting baking pan to coat top evenly. Chill, uncovered, 30 minutes.", 
            "Lift cheesecake from pan using foil overhang and cut into 1-inch squares with a thin knife, wiping off knife after each cut. (Don’t skip this step! A clean knife is essential for uber-neat squares.)", 
            "Note: Cheesecake (without glaze) can be chilled up to 3 days.", 
            "Dulce de Leche (Milk Caramel)", 
            "I know that most of the world makes this by boiling the milk inside a closed can, but honestly, that scares the bejesus out of me and according to the Carnation can label I pulled this technique from, is not recommended by them (likely because they do not want to get sued, but still). This method works just as well.", 
            "Pour one can (14 ounce) sweetened condensed milk into top of double-boiler pan; cover. Place over boiling water. Cook over low heat, stirring occasionally, for 40 to 50 minutes, or until thick and light caramel-colored.", 
            "Remove from heat. Whisk until smooth."
        ], 
        "date": "2008-02-06T13:08:40+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "3 tablespoons granulated sugar", 
            "1 cup milk (non-dairy milks could easily be subbed here)", 
            "1 cup water", 
            "1/2 teaspoon vanilla extract or a small scraping of fresh vanilla bean seeds", 
            "3 cups all-purpose flour", 
            "1 tablespoon baking powder", 
            "1/2 teaspoon coarse or kosher salt", 
            "Oil for deep-fat frying (I needed about 1 1/2 cups for an 9-inch skillet)", 
            "Confectioners’ sugar to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/06/funnel-cake1.jpg?w=750", 
        "tags": [
            "Doughnut", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/06/funnel-cake/", 
        "title": "funnel cake", 
        "directions": [
            "\nIn a large bowl, whisk eggs with sugar, milk, water and vanilla. Sprinkle salt and baking powder over the batter, then flour, and whisk it until batter is smooth.\nYou can use a funnel, pitcher, squeeze bottle or plastic bag with the corner snipped off to pour your batter into the oil in a thin stream.Are you going to use a funnel? If so, check to make sure your batter is the right consistency to fall through by holding it over your bowl and ladling a little in. I was using one with a 1/2-inch opening and my batter was a tad thick. If yours is, whisk in extra water, 1 tablespoon at a time, until it’s right. You might need 2 or 3.Are you going to use a plastic bag with the corner snipped off? Don’t worry about it then, you can always cut the hole a little bigger if the batter doesn’t fall through easily.\nHeat 1-inch of oil in a heavy skillet that’s the size you want your cakes to be to between 350 and 375 degrees F. With your finger over the opening so it doesn’t fall out, ladle batter into your funnel or a plastic bag. I like to put in only as much batter as I’ll need for each cake (1/2 cup for the 8-inch round size) so I can put the funnel down without having to stop it up somehow between uses.\nLet batter squiggle and scribble all over oil. Fry for 1 to 2 minutes on first side, until golden underneath. Flip with tongs and fry on the second side for about 1 minute, until golden all over. Remove from oil and blot briefly on paper towels. Ensure that the oil temperature is still correct, then fry remaining cakes. Transfer each to a double layer of paper plates and blizzard on the powdered sugar. Eat with your fingers."
        ], 
        "date": "2016-06-21T11:32:24+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups old-fashioned oatmeal", 
            "1 cup sliced almonds", 
            "1 cup shredded coconut, loosely packed (I used unsweetened)", 
            "1/2 cup toasted wheat germ", 
            "2/3 cup honey", 
            "1 1/2 teaspoons pure vanilla extract", 
            "1/4 teaspoon kosher salt", 
            "1 1/2 cup dried fruit, or a mix of dried fruit (I used chopped apricots, cranberries and raisins)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/granola-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Coconut", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/09/granola-bars/", 
        "title": "granola bars", 
        "directions": [
            "Preheat your oven to 350°F. Butter an 8×12-inch baking dish (lacking this, I used a 9×13-inch) and line it with parchment paper.", 
            "Toss the oatmeal, almonds, and coconut together on a sheet pan and bake for 10 to 12 minutes, stirring occasionally, until lightly browned. Transfer the mixture to a large mixing bowl and stir in the wheat germ. Reduce the oven temperature to 300°F.", 
            "While the mixture is still warm, stir in the honey, vanilla and salt until the mixture is well coated, then the dried fruit. Pour the mixture into your prepared baking dish and press, press, press it in (wet fingers and/or a silicon spatula work great for this) until the mixture is packed as tightly as possible.", 
            "Bake for 25 to 30 minutes, until light golden brown. Cool for 2 to 3 hours before cutting into squares — your best serrated knife is great for this.", 
            "You can store these in an airtight container at room temperature for a week or two, as you would cookies, however, I prefer to store mine in the freezer. I find that they stay the most crisp this way as all granola tends to soften at room temperature after a day or more. "
        ], 
        "date": "2009-09-02T11:24:48+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 teaspoons (1 7-gram or 1/4-ounce packet) active dry yeast", 
            "1/4 cup (50 grams) granulated sugar", 
            "3/4 cup (180 ml) lukewarm (not hot) milk", 
            "2 large egg yolks", 
            "Few gratings of orange or lemon zest, 1 teaspoon vanilla or 1/2 teaspoon almond extract", 
            "2 tablespoons (1 ounce or 30 grams) butter softened", 
            "2 1/3 cups (290 grams) all-purpose flour", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 egg white, whisked until frothy (for peskier filling method)", 
            "Vegetable oil for deep-frying, and coating bowl", 
            "1/2 to 2/3 cup jam or preserves of your choice", 
            "Powdered sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/jelly-doughnuts1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Doughnut", 
            "Hanukah", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/12/jelly-doughnuts/", 
        "title": "jelly doughnuts", 
        "directions": [
            "Make the dough: In the bottom of a large mixing bowl, combine the yeast, sugar and milk. Let stand for 5 minutes; it should become a little foamy. Whisk in yolks, any zest or extracts you’d like to use, then butter. Don’t worry if the butter doesn’t fully combine. ", 
            "— By hand: Add half of flour and stir with a spoon until combined. Add second half of flour and salt and stir as best as you can with a spoon, then use your hands to knead the dough until it forms a smooth, elastic round, about 5 minutes. Try, if you can, to resist adding extra flour, even if it’s sticky. Extra flour always makes for tougher/dryer doughnuts and breads. Sticky hands and counters are always washable!", 
            "— With a stand mixer: Add half the flour and let the dough hook mix it in slowly, on a low speed. Add second half of flour and salt and let the dough hook bring it together into a rough dough. Run machine for 3 to 4 minutes, letting it knead the dough into a smooth, cohesive mass.", 
            "Both methods: If the dough is already in the bowl, remove it just long enough to lightly oil the bowl. Return dough to bowl, cover with plastic wrap and let rest at room temperature for 1 hour, or in the fridge overnight.", 
            "There are two ways to fill doughnuts: In the easiest method, you fill them after they’re cooked with a piping bag. The filling is usually a little imperfect, off-center or slightly messy, but it takes the least effort by far. With the peskier method, you pre-fill the doughnuts, sealing the edges; the centers will be picture-perfect and neat, but it does take longer to assemble. Both will make you a hero to anyone you make these for, promise.", 
            "— Easiest method: On a lightly floured counter, roll dough to a 1/2-inch thickness. Cut into 2-inch rounds; no need to re-roll scraps unless you wish; I like to keep the odd shapes for getting the hang of frying before cooking the final doughnuts. Or, if you’re vehemently against scraps and re-rolling, you can make small square doughnuts, which are surprisingly cute. Let cut dough rise for another 30 minutes at room temperature, loosely covered with a towel at room temperature, or in the fridge overnight, on an oiled tray, covered loosely with oiled plastic wrap (use this longer rise only if did the 1-hour rise the first time; two overnights is too much for this dough). ", 
            "— Peskier method:  On a lightly floured counter, roll dough to a 1/4-inch thickness. Cut into 2-inch rounds; no need to re-roll scraps unless you wish; I like to keep the odd shapes for getting the hang of frying before cooking the final doughnuts. Or, if you’re vehemently against scraps and re-rolling, you can make small square doughnuts, which are surprisingly cute. Brush the edges of half the cut-outs with egg white, and in the center of each, add a tiny dollop (much less than you think you’ll need) of jam. Use the remaining cut-outs to form lids. Pinch every speck of the edges together tightly, almost as if you were making ravioli; you’ll want to seal these spectacularly well. Let filled doughnuts rise for another 30 minutes at room temperature, loosely covered with a towel at room temperature, or in the fridge overnight, on an oiled tray, covered loosely with oiled plastic wrap (use this longer rise only if did the 1-hour rise the first time; two overnights is too much for this dough). ", 
            "Both methods, fry the doughnuts: Heat 2 inches of oil to 350°F (175°C) in a cast-iron frying pan (I like using one because it so delightfully re-seasons them) or heavy pot. Use your dough scraps to practice and get an idea of how quickly the doughnuts will cook. Then add about 4 doughnuts at a time to the oil, cooking on the first side until golden brown underneath, about 1 to 2 minutes, but often less so keep a close eye on them. Flip doughnuts and cook on the other side, until it, too, is golden brown underneath, about another minute. Drain doughnuts, then spread them on a paper towel-lined plate to absorb extra oil. Repeat with remaining doughnuts.", 
            "– If you haven’t filled your doughnuts yet, i.e. you’re using the easier method: When doughnuts are cool enough to handle, place jelly or jam in a piping bag with a round tip with a 1/4- to 1/2-inch opening. You can fill doughnuts from the tops or sides; I did half with each. Press the tip of the jam bag halfway into the doughnut, and squeeze in the jam until it dollops out a little from the hole. Repeat with remaining doughnuts. ", 
            "Finish doughnuts: Either generously shower doughnuts with powdered sugar on either side, shaken from a fine-mesh strainer, or roll the doughnuts gently in a bowl of powdered sugar.", 
            "Eat at once. Don’t forget to share. If eating these on the first day, leave any remaining doughnuts uncovered on a plate. These are best on the first day, but my son did not (shockingly) say no to one that had been in an airtight container at room temperature overnight for breakfast this morning, so I guess they’re not inedible on the second day. They will need to be re-powdered, however, as it absorbs into the doughnuts when they’re in a covered container. ", 
            "To make these dairy-free: You can use warm water, soy, almond or coconut milk instead of the dairy milk, and coconut oil, shortening or margarine for the butter. I made a version with both coconut milk and coconut oil, orange zest and a bit of almond extract that were a big hit."
        ], 
        "date": "2014-12-11T11:59:16+00:00"
    }, 
    {
        "ingredient_list": [
            "For the crust: ", 
            "1/2 pound unsalted butter, at room temperature", 
            "1/2 cup granulated sugar", 
            "2 cups flour", 
            "1/8 teaspoon kosher salt", 
            "For the full-size lemon layer: ", 
            "6 extra-large eggs at room temperature", 
            "2 1/2 cups granulated sugar", 
            "2 tablespoons grated lemon zest (4 to 6 lemons)", 
            "1 cup freshly squeezed lemon juice", 
            "1 cup flour", 
            "4 extra-large eggs at room temperature", 
            "1 2/3 cups granulated sugar", 
            "1 tablespoon + 1 teaspoon grated lemon zest (3 to 4 lemons)", 
            "2/3 cup freshly squeezed lemon juice", 
            "2/3 cup flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/01/lemon-bars.jpg?w=750", 
        "tags": [
            "Bars", 
            "Citrus", 
            "Cookie", 
            "Fruit", 
            "Lemon", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/01/lemon-bars/", 
        "title": "lemon bars", 
        "directions": [
            "Confectioners’ sugar, for dusting", 
            "Preheat the oven to 350°F and grease a 9 by 13 by 2-inch baking sheet.", 
            "For the crust, cream the butter and sugar until light in the bowl of an electric mixer fitted with the paddle attachment. Combine the flour and salt and, with the mixer on low, add to the butter until just mixed. Dump the dough onto a well-floured board and gather into a ball. Flatten the dough with floured hands and press it into the greased baking sheet, building up a 1/2-inch edge on all sides. Chill.", 
            "Bake the crust for 15 to 20 minutes, until very lightly browned. Let cool on a wire rack. Leave the oven on.", 
            "For the lemon layer, whisk together the eggs, sugar, lemon zest, lemon juice, and flour. Pour over the crust and bake for 30 to 35 minutes (less if you are using the thinner topping), or about five minutes beyond the point where the filling is set. Let cool to room temperature.", 
            "Cut into rectangles and dust with confectioners’ sugar."
        ], 
        "date": "2008-01-07T23:12:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (1 stick) salted butter, cut into large pieces", 
            "1 1/2 cups graham crackers crumbs (about 8 graham crackers, pulsed in a food processor)", 
            "1 1/2 cups chocolate chips", 
            "1 cup butterscotch chips", 
            "1 cup shredded coconut", 
            "1 cup pecans, coarsely chopped", 
            "1/3 cup sweetened condensed milk (just under half a small can)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/lookin-swell-dolly1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Candy", 
            "Chocolate", 
            "Coconut", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/10/lookin-swell-dolly/", 
        "title": "hello dolly bars", 
        "directions": [
            "Preheat oven to 350 degrees.", 
            "Melt butter in microwave in heatproof bowl until just melted when stirred. Add graham cracker crumbs. Mix and then press evenly into the bottom of 8×8 baking pan. ", 
            "Layer coconut, pecans, butterscotch and chocolate chips on top of graham cracker base. Pour sweetened condensed milk over whole mixture. ", 
            "Bake in oven for 25 to 30 minutes, or until the top is light brown.", 
            "Like all brownie and cookie bars, I find them easier to cut cleanly once they’ve been thoroughly cooled in the fridge, but I also don’t expect you to be able to wait that long. ", 
            "Because they’re so sweet, I like to cut them into really tiny squares. Those mini-cupcake liners come in handy as well, too, so they don’t all cluster together, not that anyone would mind. "
        ], 
        "date": "2007-10-08T21:07:08+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup granulated (50 grams) or powdered (30 grams) sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "6 tablespoons (85 grams) unsalted butter", 
            "1/3 cup dark brown sugar", 
            "1/3 cup granulated sugar", 
            "1 large egg", 
            "1 large egg yolk", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 tablespoon bourbon (optional)", 
            "1 teaspoon vanilla extract", 
            "6 tablespoons all-purpose flour", 
            "3/4 cup (4 1/2 ounces or 130 grams) chocolate chips or chopped chocolate", 
            "3/4 cup toasted (always) and coarsely chopped walnuts or pecans", 
            "Flaky sea salt on top, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/not-derby-pie-bars1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Bourbon", 
            "Chocolate", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2015/04/not-derby-pie-bars/", 
        "title": "not derby pie bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. A little nonstick spray underneath helps keep the strips in place. (If you have an 8-inch square springform, you can skip this and just butter it lightly.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take another 30 seconds for it to come together, but it will. Transfer the dough clumps to prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. Meanwhile, prepare the filling.", 
            "Make the filling: Melt your butter and, if desired, brown it too, by continuing to cook the butter in a small saucepan over medium heat, stirring frequently, until golden brown bits form at the bottom, about 5 minutes. Transfer butter to a large bowl and let it cool; you can hasten this along by setting it in the freezer for a couple minutes or stirring it over an ice water bath.", 
            "Whisk sugars into butter until smooth, then egg, (edited to add) yolk, salt, bourbon (if using) and vanilla. Stir in flour until just combined, then mix in chocolate and nuts. Pour over par-baked crust, spreading evenly. Sprinkle lightly with sea salt before baking, if desired. ", 
            "Bake bars: For 20 to 25 minutes, until top is firm and golden. Bars are much easier to cut if you let them cool almost completely, but I suspect there’s little fun in that. Once they’re cool, however, you can easily transfer them from the pan to a cutting board with the parchment paper sling you created. Serve plain, with whipped cream or a tiny scoop of vanilla ice cream. Can dust with powdered sugar for extra pretties. ", 
            "Store at room temperature for up to 3 days, or in the fridge for longer."
        ], 
        "date": "2015-04-30T12:00:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup Arborio rice", 
            "4 cups milk", 
            "1/4 cup sugar", 
            "1/2 vanilla bean, split", 
            "3/4 teaspoon almond extract or 1 bay leaf", 
            "1/2 pint raspberries, other berries or dried fruit (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/04/arborio-rice-pudding.jpg?w=750", 
        "tags": [
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2007/04/odds-ends/", 
        "title": "arborio rice pudding", 
        "directions": [
            "In a large saucepan, place all the ingredients, except the almond extract and raspberries. Bring it to a gentle boil and then turn it down to a gentle simmer, stirring occasionally to keep it from sticking to the bottom, for about 30 to 40 minutes. Taste the rice to check for doneness. The rice should be very soft and plump. ", 
            "Take the pudding off the heat and stir in the extract. Pour into dessert bowls and stir in some fresh raspberries, or other dried or fresh fruit. Serve immediately."
        ], 
        "date": "2007-04-07T16:00:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (7 ounces or 200 grams) white sugar", 
            "1 teaspoon (5 grams) baking powder", 
            "2 3/4 cups plus 2 tablespoons (12 5/8 ounces or 359 grams) cups all-purpose flour (or you can measure 3 cups and remove 2 tablespoons flour)", 
            "1/4 teaspoon cinnamon", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1/4 teaspoon (2 grams) salt", 
            "1 cup (2 sticks or 8 ounces or 227 grams) cold unsalted butter", 
            "1 large egg", 
            "2 peaches, pitted and thinly sliced (between 1/8 and 1/4-inch thick)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/09/4950027940_b3512efca3_o.jpg?w=749", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cookie", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/09/peach-shortbread/", 
        "title": "peach shortbread", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns and the very second that you turn around to do something else. Set it in the freezer until solid (about 30 minutes).", 
            "[Don’t have time for all this brown butter madness? Check the head notes to use regular softened butter instead.]", 
            "Preheat the oven to 375°F (190°C). Butter a 9×13 inch pan, or spray it with a nonstick spray. In a medium bowl, stir together sugar, baking powder, flour, salt and spices with a whisk.  Use a pastry blender, fork or your fingertips, blend the solidified brown butter and egg into the flour mixture. It will be crumbly. Pat 3/4 of the crumbs into the bottom of the prepared pan, pressing firmly. Tile peach slices over crumb base in a single layer. Scatter remaining crumbs evenly over peaches and bake in preheated oven for 30 minutes, until top is slightly brown and you can see a little color around the edges. Cool completely in pan before cutting into squares.", 
            "Keeping: I’ve kept mine in the fridge and they’ve held up great there since Monday. I imagine that these would freeze well, between layers of waxed paper, with the container sealed well in plastic wr"
        ], 
        "date": "2010-09-02T15:58:05+00:00"
    }, 
    {
        "ingredient_list": [
            "", 
            "\t\t", 
            "\t", 
            "\t\tPeople, these things are nothing but trouble, so whatever you do, don’t do this:", 
            "", 
            "", 
            "Do not start with a bowl of vaguely healthful and intensely fortified bowl of Snap, Crackle and Pop.", 
            "", 
            "Do not boil some sugar, because obviously unsweetened cereal will not do.", 
            "", 
            "(Try not to do this to your lens, either, when you take a picture.)", 
            "", 
            "Do not mix the caramel with the Krispies and press them into a pan.", 
            "", 
            "", 
            "Definitely don’t melt some chocolate and peanut butter together. ", 
            "", 
            "Or do this.", 
            "", 
            "And this.", 
            "", 
            "Then this.", 
            "", 
            "Or sit back and scratch your head as they disappear, because there’s only two of you at home. Just don’t, okay?", 
            "I’m sorry, are you still there? I figure that by now, half of you rebels have already run to the grocery store to buy your first box of Rice Krispies in half a lifetime, and the other half of you are appalled, simply appalled, at the syrupy, overindulgent, processed and fattening “treats” we Americans are so fond of.", 
            "Well, here’s a warning to those of you in the latter camp (those of you in the former one already know this): these bars will win you over. I wholly admit that as awesome as they sound, I really made them because I live with a 3rd grader 34 year old that has only one reaction to the suggestion of chocolate and peanut butter: WANT. ", 
            "But when I first tried them, I was a little taken aback. The crispy layer crumbled to the point that I couldn’t get a clean cut and I thought the peanut butter layer was too thick and sweet. Were I a more patient cook this week–you see, I am quietly considering partaking in this NaBloPoMo madness again this year, because I never learn, which would mean that I should preserve my cooking energy–I might have tried it over again with a few tweaks…", 
            "But a day or two later now, they’ve completely won me over and I now realize why the Baked boys say that this is, hands down, the most popular refrigerated bar they make at the bakery. Curious about the others? The Rasberry Breakfast Bars and Baked Brownies weren’t enough for you? (And how could they be, with as yet un-auditioned recipes for Pumpkin Whoopie Pies and S’more Nut Bars and Butterscotch Pudding Tarts?) You’ve got to get your own copy.", 
            "Chocolate and peanut butter, previously: Chocolate and Peanut Butter Cake, Peanut Butter Brownies and Peanut Butter Cookies", 
            "One year ago: Sweet Potato and Sausage Soup", 
            "Two years ago Bretzel Rolls", 
            "\t", 
            "", 
            "\t", 
            "Peanut Butter Crispy Bars", 
            "Adapted from Baked: New Frontiers in Baking", 
            "These bars are sticky and indulgent and not good for you in any way, so before you even ask, perhaps you can make them with organic, low-fat peanut butter, whole grain bio-crisped rice cereal or a sugar substitute but you shouldn’t. Nobody likes a party pooper.", 
            "For the crispy crust", 
            "1 3/4 cups crisped rice cereal", 
            "1/4 cup sugar", 
            "3 tablespoons light corn syrup", 
            "3 tablespoons unsalted (their recommendation) or salted (what I used, and liked) butter, melted", 
            "For the milk chocolate peanut butter layer", 
            "5 ounces good-quality milk (their recommendation) or semi-sweet (what I’d use next time) chocolate, coarsely chopped", 
            "1 cup creamy peanut butter", 
            "For the chocolate icing", 
            "3 ounces dark chocolate (60 to 72 percent cocoa), coarsely chopped", 
            "1/2 teaspoon light corn syrup", 
            "4 tablespoons (1/2 stick or 2 ounces) unsalted (their recommendation) or salted (what I used, and liked) butter", 
            "Make the crispy crust: Lightly spray a paper towel with nonstick cooking spray and use it to rub the bottom and sides of an 8-inch square baking pan.", 
            "Put the cereal in a large bowl and set aside.", 
            "Pour 1/4 cup water into a small saucepan. Gently add the sugar and corn syrup (do not let any sugar or syrup get on the sides of the pan) and use a small wooden spoon to stir the mixture until just combined. Put a candy thermometer in the saucepan. Cook over medium-high heat and bring to a boil; cook until the mixture reaches the soft ball stage, 235 degrees F.", 
            "Remove from the heat, stir in the butter, and pour the mixture over the cereal. Working quickly, stir until the cereal is thoroughly coated, then pour it into the prepared pan. Using your hands, press the mixture into the bottom of the pan (do not press up the sides). Let the crust cool to room temperature while you make the next layer.", 
            "Make the milk chocolate peanut butter layer: In a large nonreactive metal bowl, stir together the chocolate and the peanut butter. Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is smooth. Remove the bowl from the pan and stir for about 30 seconds to cool slightly. Pour the mixture over the cooled crust. Put the pan in the refridgerator for 1 hour, or until the top layer hardens.", 
            "Make the chocolate icing: In a large nonreactive metal bowl, combine the chocolate, corn syrup, and butter.", 
            "Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is completely smooth. Remove the bowl from the pan and stir for 30 seconds to cool slightly. Pour the mixture over the chilled milk chocolate peanut butter layer and spread (actually, I found it easier to just roll it around until it coated smoothly, avoiding the risk of picking up any of the peanut butter layer with it) into an even layer. Put the pan into the refrigerator for 1 hour, or until the topping hardens.", 
            "Cut into 9 (they say, I say 16, at least!) squares and serve. The bars can be stored in the refrigerator, covered tightly, for up to 4 days.", 
            "Rate this:Do More:TwitterFacebookPinterestPrintEmail\t\t\t", 
            "For the crispy crust", 
            "1 3/4 cups crisped rice cereal", 
            "1/4 cup sugar", 
            "3 tablespoons light corn syrup", 
            "3 tablespoons unsalted (their recommendation) or salted (what I used, and liked) butter, melted", 
            "For the milk chocolate peanut butter layer", 
            "5 ounces good-quality milk (their recommendation) or semi-sweet (what I’d use next time) chocolate, coarsely chopped", 
            "1 cup creamy peanut butter", 
            "For the chocolate icing", 
            "3 ounces dark chocolate (60 to 72 percent cocoa), coarsely chopped", 
            "1/2 teaspoon light corn syrup", 
            "4 tablespoons (1/2 stick or 2 ounces) unsalted (their recommendation) or salted (what I used, and liked) butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peanut-butter-crispy-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Candy", 
            "Peanut Butter", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/10/peanut-butter-crispy-bars/", 
        "title": "peanut butter crispy bars", 
        "directions": [
            "Make the crispy crust: Lightly spray a paper towel with nonstick cooking spray and use it to rub the bottom and sides of an 8-inch square baking pan.", 
            "Put the cereal in a large bowl and set aside.", 
            "Pour 1/4 cup water into a small saucepan. Gently add the sugar and corn syrup (do not let any sugar or syrup get on the sides of the pan) and use a small wooden spoon to stir the mixture until just combined. Put a candy thermometer in the saucepan. Cook over medium-high heat and bring to a boil; cook until the mixture reaches the soft ball stage, 235 degrees F.", 
            "Remove from the heat, stir in the butter, and pour the mixture over the cereal. Working quickly, stir until the cereal is thoroughly coated, then pour it into the prepared pan. Using your hands, press the mixture into the bottom of the pan (do not press up the sides). Let the crust cool to room temperature while you make the next layer.", 
            "Make the milk chocolate peanut butter layer: In a large nonreactive metal bowl, stir together the chocolate and the peanut butter. Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is smooth. Remove the bowl from the pan and stir for about 30 seconds to cool slightly. Pour the mixture over the cooled crust. Put the pan in the refridgerator for 1 hour, or until the top layer hardens.", 
            "Make the chocolate icing: In a large nonreactive metal bowl, combine the chocolate, corn syrup, and butter.", 
            "Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is completely smooth. Remove the bowl from the pan and stir for 30 seconds to cool slightly. Pour the mixture over the chilled milk chocolate peanut butter layer and spread (actually, I found it easier to just roll it around until it coated smoothly, avoiding the risk of picking up any of the peanut butter layer with it) into an even layer. Put the pan into the refrigerator for 1 hour, or until the topping hardens.", 
            "Cut into 9 (they say, I say 16, at least!) squares and serve. The bars can be stored in the refrigerator, covered tightly, for up to 4 days."
        ], 
        "date": "2008-10-28T15:39:11+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (190 grams) smooth peanut butter", 
            "2/3 (135 grams) cup granulated sugar", 
            "1 large egg", 
            "1/4 teaspoon vanilla extra", 
            "A few pinches of flaky or coarse sea salt", 
            "3 ounces (85 grams) unsweetened chocolate, roughly chopped", 
            "1/2 cup (115 grams or 4 ounces) unsalted butter, plus extra for pan", 
            "1 1/4 cups (250 grams) granulated sugar", 
            "2 large eggs", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1/2 teaspoon flaky or heaped 1/4 teaspoon of coarse sea salt", 
            "2/3 cup (85 grams) all-purpose flour", 
            "1/4 cup (40 grams) semi- or bittersweet chocolate chips"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/peanut-butter-swirled-brownies.jpg?w=750", 
        "tags": [
            "Bars", 
            "Brownies/Blondies", 
            "Chocolate", 
            "Peanut Butter", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2017/03/peanut-butter-swirled-brownies/", 
        "title": "peanut butter swirled brownies", 
        "directions": [
            "Heat oven: To 350°F (175°C).", 
            "Line an 8-inch square baking pan with parchment and coat the bottom and sides with nonstick cooking spray or butter.", 
            "Make peanut butter batter: Whisk all ingredients in a bowl until smooth.\nMake brownie batter: In a medium heatproof bowl over gently simmering water, melt chocolate and butter together until only a couple unmelted bits remain. Off the heat, stir until smooth and fully melted. You can also do this in the microwave in 30-second bursts, stirring between each. Whisk in sugar, then eggs, one at a time, then vanilla and salt. Stir in flour with a spoon or flexible spatula.\nAssemble brownies: Spread a thin layer of brownie batter (about 1/3 of total batter, but no need to be exact) in bottom of prepared baking pan. Dollop peanut butter batter all over in big spoonfuls. Dollop remaining brownie batter in pan, aiming, if you can, between the peanut butter dollops. Use a butter knife to swirl the batters together in loose figure-8s. Sprinkle chips all over.\nBake: For 30 to 35 minutes, or until a toothpick inserted into the center comes out batter-free.\nTo keep: Brownies keep well at room temperature, in the fridge or freezer."
        ], 
        "date": "2017-03-17T11:46:13+00:00"
    }, 
    {
        "ingredient_list": [
            "For the base:", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 teaspoon freshly grated lemon zest", 
            "1/8 teaspoon table salt", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cut into chunks", 
            "1 cup (125 grams) flour", 
            "For the lemonade layer", 
            "1 cup (about 5 ounces or 140 grams) raspberries", 
            "2 large eggs", 
            "3/4 cup (150 grams) granulated sugar", 
            "1/4 cup freshly squeezed lemon juice; this should only require 2 lemons", 
            "1/3 cup (40 grams) all-purpose flour", 
            "Confectioners’ sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Citrus", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/08/pink-lemonade-bars/", 
        "title": "pink lemonade bars", 
        "directions": [
            "Preheat your oven to 350°F (180°C) and line an 8x8x2-inch baking pan with parchment, letting it extend up two sides. Butter or coat the bottom and sides with a nonstick spray and set the pan aside.", 
            "Make the base: In a food processor, pulse together the sugar, zest and salt until combined. Add the butter and pulse until it is evenly dispersed in the dough. Add the flour and pulse the machine until it’s just combined and the mixture is crumbly. Press the dough into the prepared pan and about 1/2-inch up the sides. Don’t worry about making this perfect; mine was an uneven mess and nobody can tell. Bake for 15 minutes, until lightly browned at edges. Let cool on a rack while you prepare the filling (though no need for it to be completely cool when you fill it). Leave oven on.", 
            "Make the pink lemonade layer: Puree the raspberries in your food processor until they’re as liquefied as they’ll get. I don’t even bother cleaning mine between steps, but I’m also probably lazier than you. Run the puree through a fine-mesh sieve, trying to press out all the raspberry puree that you can, leaving the seeds behind. I ended up with 1/3 cup strained puree; don’t worry if you get a smidge less.", 
            "In a medium bowl, whisk together the eggs, sugar and lemon juice until smooth. Whisk in 3 tablespoons of raspberry puree. Stir in flour. Pour into cooling crust and return pan to the oven, baking the bars until they’re set (they’ll barely jiggle) and slightly golden at the edges, about 25 to 30 minutes. Cool completely before cutting into rectangles. (You can speed this up in the fridge.)", 
            "I intended to cut mine into 32 2×1-inch rectangles but actually cut them into 28 2×1-ish rectangles. I like lemony bars small but you could also cut them into 16 2×2-inch squares. Dust with powdered sugar before serving. Store in fridge for up to a week."
        ], 
        "date": "2012-08-03T13:26:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (130 grams) all-purpose flour", 
            "1/2 cup (55 grams) sliced almonds, toasted or equivalent weight almond flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 teaspoon almond extract", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "2/3 cup (85 grams) all purpose flour", 
            "1/3 cup (packed) almond paste (about 3.5 ounces or half a 7-ounce tube)", 
            "1/3 cup (65 grams) light brown sugar", 
            "1/4 teaspoon fine sea or table salt", 
            "4 tablespoons (2 ounces or 55 grams) chilled unsalted butter, cut into cubes", 
            "1/4 cup (30 grams) sliced, toasted almonds", 
            "1 pounds plums (about 6 to 7), halved, pitted, thinly sliced", 
            "3 tablespoons granulated sugar", 
            "1 1/2 tablespoons cornstarch"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/plum-squares-with-marzipan-crumble.jpg?w=750", 
        "tags": [
            "Bars", 
            "Crumbles/Crisps", 
            "Photo", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/09/plum-squares-with-marzipan-crumble/", 
        "title": "plum squares with marzipan crumble", 
        "directions": [
            "Heat oven to 375 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.\nMake the crust: Combine the flour, almonds, salt, sugar and extract in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.\nMake crumble: Blend flour, almond paste, sugar and salt in processor until almond paste is finely ground. Add butter and blend, using on/off turns, until coarse crumbs form. Transfer crumble to bowl; mix in almonds.\nMake filling: Combine all ingredients in medium bowl; toss to coat well.\nAssemble squares: Sprinkle 1/2 cup prepared crumble over cooled crust. Top with plum mixture. Sprinkle with remaining crumble.", 
            "Bake: Until filling bubbles thickly and top is golden, about 35 to 40 minutes. If the bars brown too quickly, cover them with foil for the remaining baking time. Cool in pan. I like to hurry this (too) along in the fridge or freezer. Once firm, I’ll use the parchment sling to remove the bars and cut them more cleanly on a cutting board. Dust with powdered sugar, if desired, before serving.\nDo ahead: These bars keep for up to a week in the fridge, longer in the freezer."
        ], 
        "date": "2016-09-01T07:33:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound bakery white or challah bread, crusts removed, cut into 1-inch cubes", 
            "1 Granny Smith apple, peeled and cut into 1/2-inch pieces", 
            "1 cup (6 ounces) golden raisins, plumped in hot water for 15 minutes", 
            "3 large eggs", 
            "3/4 cup sugar", 
            "1/4 teaspoon cinnamon", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1/8 teaspoon ground ginger", 
            "1/4 teaspoon pure vanilla extract", 
            "1/4 teaspoon salt", 
            "3 cups whole milk", 
            "2 tablespoons unsulfured molasses", 
            "1/4 cup sliced almonds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/raisin-studded-apple-bread-pudding1.jpg?w=500", 
        "tags": [
            "Apple", 
            "Fall", 
            "Photo", 
            "Pudding", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2009/11/raisin-studded-apple-bread-pudding/", 
        "title": "raisin-studded apple bread pudding", 
        "directions": [
            "Preheat the oven to 350°F. Spread the bread cubes on a baking sheet and toast in the oven for 6 minutes, until crisp. Transfer to a bowl and add the apple and raisins.", 
            "Generously butter either a 9×13-inch deep baking dish or six 8-ounce ramekins. If using ramekins, set them on the baking sheet.", 
            "In a medium bowl, using a handheld electric mixer or whisk, beat the eggs with the sugar. Beat in the ground spices, vanilla and salt.", 
            "In a medium saucepan, heat the milk with the molasses until just warm to the touch. Gradually beat the warm milk into the egg mixture, scraping the bottom and side of the bowl.", 
            "Spread bread mixture out in your large baking dish, or distribute it among ramekins. Pour the custard over the bread mixture, nudging the bread around a bit to make sure it soaks all of the pieces. Let stand for 5 minutes. Sprinkle the almonds on top. Bake in the center of the oven for about 40 minutes, until puffed and set, with the tops lightly browned. Let the bread pudding(s) rest for at least 15 minutes before serving."
        ], 
        "date": "2009-11-10T09:53:03+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/raspberry-breakfast-bars.jpg?w=753", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Raspberries", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/09/raspberry-breakfast-bars/", 
        "title": "raspberry breakfast bars", 
        "directions": [
            "Make the crust and crumb: Preheat the oven to 350°F. Butter the bottom and sides of a 9-by-13-inch glass or light-colored metal baking pan. Put a long piece of parchment paper in the bottom of the pan, letting the parchment extend up the two short sides of the pan and overhang slightly on both ends. (This will make it easy to remove the bars from the pan after they have baked.) Butter the parchment.", 
            "Put the flour, brown sugar, oats, salt, baking powder, baking soda, and cinnamon in a food processor. Pulse in short bursts until combined. Add the butter and pulse until loose crumbs form.", 
            "Reserve 1 1/2 cup of the mixture and set aside. (Note: The book suggests you reserve one cup only. My gut told me that was too little, and I upped it. I wanted to make sure the top of the raspberries were mostly covered, at least for packing purposes, and was glad I had changed it.) Pour the rest of the mixture into the prepared pan and use your hans or the back of a large wooden spoon to push the crust into an even layer at the bottom of the pan. The crust should touch the sides of the pan. Bake until golden brown, 12 to 15 minutes. Transfer to a wire rack and let the crust cool. Keep the oven on while you make the raspberry filling.", 
            "Make the raspberry filling: In a medium bowl, whisk the sugar, lemon zest, cinnamon and flour together. Add the raspberries, lemon juice and butter and use your hands to toss gently until the raspberries are evenly coated.", 
            "Assemble and bake the bars: Spread the raspberry filling evenly on top of the cooled crust. Sprinkle the reserved crust mixture evenly on top of the filling.", 
            "Bake for 35 to 45 minutes, rotating the pan every 15 minutes, until the top is golden brown and the filling starts to bubble around the edges.", 
            "Transfer to a wire rack to cool completely, then cut into squares and serve. The bars can be stored in the refrigerator in an airtight container for up to two days."
        ], 
        "date": "2008-09-02T15:50:41+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces (113 grams) unsalted butter, plus extra for the pan", 
            "1 10-ounce (285-gram) bag marshmallows", 
            "Heaping 1/4 teaspoon coarse sea salt", 
            "6 cups (160 grams) crispy rice cereal (about half a 12-ounce box)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/salted-brown-butter-crispy-treats.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Candy", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2009/11/salted-brown-butter-crispy-treats/", 
        "title": "salted brown butter crispy treats", 
        "directions": [
            "Butter (or coat with non-stick spray) an 8-inch square cake pan with 2-inch sides.", 
            "In a large pot, melt butter over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as while you may be impatient for it to start browning, the period between the time the butter begins to take on color and the point where it burns is often less than a minute.", 
            "As soon as the butter takes on a nutty color, turn the heat off and stir in the marshmallows. The residual heat from the melted butter should be enough to melt them, but if it is not, turn it back on low until the marshmallows are smooth.", 
            "Remove the pot from the stove and stir in the salt and cereal together. Quickly spread into prepared pan. I liked to use a piece of waxed or parchment paper that I’ve sprayed with oil to press it firmly and evenly into the edges and corners, though a silicon spatula works almost as well.", 
            "Let cool, cut into squares and get ready to make new friends. "
        ], 
        "date": "2009-11-02T13:52:13+00:00"
    }, 
    {
        "ingredient_list": [
            "8 ounces bittersweet chocolate (no more than 60% cacao), chopped", 
            "3/4 stick (3 ounces) unsalted butter, cut into 6 pieces", 
            "3 large eggs, separated", 
            "1 tablespoon Cognac or other brandy (or swap with a liqueur of your choice)", 
            "1 cup very cold heavy or whipping cream", 
            "1/8 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/old-school-chocolate-mousse1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "French", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2009/10/silky-decadent-old-school-chocolate-mousse/", 
        "title": "silky, decadent old-school chocolate mousse", 
        "directions": [
            "Get out one large heatproof, two medium and one small mixing bowl and dust off your electric hand mixer.", 
            "Set the large bowl over a saucepan of barely simmering water and melt the chocolate and butter in it, gently stirring it until smooth. Remove from heat. Alternately, you can melt them in your microwave, stirring thoroughly at 30 seconds and every 15 seconds thereafter until the mixture is smooth.", 
            "In the small bowl, beat yolks with your electric mixer until thick enough to form a ribbon that takes a few seconds to dissolve — this will take about two to four minutes to achieve. Whisk yolks into chocolate mixture along with Cognac, then cool to warm.", 
            "In one of the medium bowls, beat the cream with cleaned beaters until it just holds stiff peaks.", 
            "In the other medium bowl, beat the egg whites and salt with cleaned beaters until they just hold soft peaks.", 
            "Fold the whipped cream and beaten whites into the chocolate mixture, gently but thoroughly. Transfer to 8 (4 ounce) ramekins or one large serving bowl, or go restaurant-style, serving it in stemmed glasses with white or dark chocolate shavings on top.", 
            "Do ahead: Mousse can be chilled, its surface covered with parchment paper, up to 2 days, though I’ve never heard of it lasting that long with hungry people named Deb around. Let stand at room temperature at least 30 minutes before serving."
        ], 
        "date": "2009-10-26T11:52:59+00:00"
    }, 
    {
        "ingredient_list": [
            "24 ladyfingers (savioardi) cookies (storebought or from recipe below)", 
            "3 large eggs, separated", 
            "1/3 cup (65 grams) plus 1 tablespoon (13 grams) granulated sugar, divided", 
            "1 8.8-ounce (250 ml) package mascarpone", 
            "1/3 cup (80 ml) sweet or dry marsala", 
            "1 cup (235 ml) strong, warm espresso coffee", 
            "A couple tablespoons of your favorite cocoa powder, for sifting over"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/small-batch-tiramisu.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Italian", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2017/02/small-batch-tiramisu/", 
        "title": "small batch tiramisu", 
        "directions": [
            "In a medium bowl, beat egg whites until stiff.", 
            "In a larger bowl, using same beaters, beat egg yolks and 1/3 cup sugar until thick and pale yellow, 3 to 4 minutes. Beat in mascarpone cheese until combined, and continue beating another minute for extra fluff. Beat in marsala until smooth. Gently fold in egg whites until combined, trying not to deflate the mixture. It will be a loose, soft, creamy custard.", 
            "In a small bowl wide enough to dip cookies into, combine the espresso and 1 tablespoon sugar. Set aside.\nTo assemble small cups: Dip first cookie in espresso mixture until almost fully saturated but not falling apart. Break in half and place the first half in the bottom of your cup. Spoon 1 generous (I use a measuring spoon, but heaped a little) tablespoon cream over it. Repeat with second half of first biscuit and another spoonful of cream. Dust with cocoa powder. Dip second cookie in coffee and break in half. Place side-by-side over cocoa then top with 2 generous tablespoons cream mixture, which should take you nearly to the top of the cup. Dust with more cocoa. Repeat with remaining cups.\nTo assemble large cups: Dip first cookie in espresso mixture until almost fully saturated but not falling apart. Break in half and place side-by-side in the bottom of your larger cup. Spoon 2 generous tablespoons (I use a measuring spoon, but heaped a little) cream over and dust with cocoa powder. Dip two biscuits in espresso mixture and break in half. Place 3 of the halves on top of the cocoa powder, cover with another 2 generous tablespoons of cream and cocoa powder. Dip a 4th biscuit in the espresso mixture, break it in half, and place these two halves plus the leftover half from the previous layer on top of the cocoa. Dollop more cream over and repeat with remaining cups.\nIf you can bear it, let cups chill in fridge overnight to set. Before eating, you can dust them with fresh cocoa powder for a prettier look.", 
            ""
        ], 
        "date": "2017-02-13T13:02:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (80 grams) rolled oats", 
            "3/4 cup (95 grams) plus up to 2 tablespoons (15 grams) extra all-purpose flour", 
            "1/2 cup (95 grams) light brown sugar", 
            "Heaped 1/4 teaspoon table salt", 
            "6 tablespoons (85 grams) unsalted butter, melted", 
            "1 teaspoon cornstarch (optional, but helps firm up the filling)", 
            "1 tablespoon (15 ml) lemon juice", 
            "1 tablespoon (15 grams) granulated sugar, divided", 
            "1 cup (125 grams) small-diced rhubarb (from about 1 1/2 medium stalks)", 
            "1 cup (155 grams) small-diced strawberries", 
            "Powdered sugar, for decoration, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/strawberry-rhubarb-crisp-bars1.jpg?w=640", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Crumbles/Crisps", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Rhubarb", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/05/strawberry-rhubarb-crisp-bars/", 
        "title": "strawberry rhubarb crisp bars", 
        "directions": [
            "Heat oven to 375 degrees F. For easy removal, line bottom and two sides of 8-by-8-inch square baking pan with parchment paper. No need to bother (and no greasing needed) if you plan to serve them right in the pan, as I did. ", 
            "Place oats, 3/4 cup flour, brown sugar and salt in bottom of baking pan and mix. Pour melted butter over, and stir until clumps form. If the clumps feel soft or look overly damp, add the remaining 2 tablespoons flour. Set aside 1/2 cup of the crumble mixture. Press the rest of the crumb mixture evenly in the bottom of the pan.", 
            "Spread half the fruit over the crust. Sprinkle it evenly with cornstarch, then lemon juice, and 1/2 tablespoon of granulated sugar. Spread remaining fruit over this, and top with second 1/2 tablespoon sugar. Scatter reserved crumbs over fruit and bake bars for 30 to 40 minutes (firmer fruits will take longer), until fruit is bubbly and crisp portion is golden and smells toasty and amazing. ", 
            "Let cool in pan; I do this in the fridge, where they become crisp once chilled (less so at room temperature). Cut into squares and sprinkle with powdered sugar before serving. Store leftovers in fridge."
        ], 
        "date": "2014-05-09T11:20:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup Arborio rice", 
            "4 cups milk (both whole and reduced-fat have worked for me)", 
            "1/4 cup sugar", 
            "1/2 vanilla bean, split (or 1 teaspoon pure extract, added with almond at the end)", 
            "1 bay leaf", 
            "3/4 teaspoon almond extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/vanilla-almond-rice-pudding.jpg?w=752", 
        "tags": [
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2009/01/vanilla-almond-rice-pudding/", 
        "title": "almond-vanilla rice pudding", 
        "directions": [
            "In a large saucepan, place all the ingredients, except the almond extract. Bring it to a gentle boil and then turn it down to a gentle simmer, stirring occasionally to keep it from sticking to the bottom, for about 30 to 40 minutes. Taste the rice to check for doneness. The rice should be very soft and plump.", 
            "Take the pudding off the heat and stir in the extract(s). Pour into dessert bowls. You can serve it immediately or let it chill in the fridge. Either way, keep it away from Deb."
        ], 
        "date": "2009-01-09T11:44:07+00:00"
    }, 
    {
        "ingredient_list": [
            "2 2/3 cups whole milk, divided", 
            "1/2 cup sugar", 
            "1/4 cup cornstarch", 
            "1/4 teaspoon salt", 
            "Seeds from 1/2 vanilla bean (or 2 teaspoons of vanilla extract)", 
            "1 large egg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/vanilla-bean-pudding11.jpg?w=640", 
        "tags": [
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2011/01/vanilla-bean-pudding/", 
        "title": "vanilla bean pudding", 
        "directions": [
            "Bring 2 cups of the milk to a boil in a medium saucepan. While it is heating, combine sugar, cornstarch, salt and vanilla bean (if you’re replacing it with extract, don’t add it yet; if you’d like to toss the leftover vanilla bean pods in the pot with the simmering milk for an extra vanilla boost, go for it) in the bottom of a medium, heatproof bowl. Gradually whisk in the remaining 2/3 cup whole milk, a little at a time so lumps do not form, then whisk in the egg. Once milk is boiling, very gradually add it to the cornstarch mixture in the bowl, whisking the whole time.", 
            "Return the mixture back to the saucepan, stirring constantly with a silicon spatula or wooden spoon. Once it comes to a simmer, cook it for one minute longer (which will cook the cornstarch and egg fully). Stir in vanilla extract, if you’re using it and divide pudding among 6 dishes. Chill in refrigerator until fully set, about 2 hours.", 
            "[If you don’t like pudding skin, we can’t be friends just press a piece of plastic wrap against the top of the pudding before you chill it.]"
        ], 
        "date": "2011-01-08T13:22:09+00:00"
    }, 
    {
        "ingredient_list": [
            "Custards", 
            "1 cup whole milk", 
            "Seeds from 1/4 to 1/2 vanilla bean (see Note) or 1 teaspoon pure vanilla extract", 
            "3 large egg yolks", 
            "1/4 cup granulated sugar", 
            "3 tablespoons all-purpose flour", 
            "1 to 2 tablespoons (see Note) unsalted butter", 
            "Berries", 
            "1 cup blueberries", 
            "1 1/2 teaspoons granulated sugar", 
            "Juice from a wedge lemon, or to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/08/vanilla-custards-with-roasted-blueberries.jpg?w=750", 
        "tags": [
            "Blueberries", 
            "Photo", 
            "Pudding", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/08/vanilla-custards-with-roasted-blueberries/", 
        "title": "vanilla custards with roasted blueberries", 
        "directions": [
            "In a small saucepan, combine your milk and vanilla bean flecks (if using extract instead, don’t add it yet). Heat the mixture until it is warm, then set aside. You can also do this in a microwave. If your saucepan or microwave dish has a small spout, even better.", 
            "In the bottom of a small saucepan, off the heat, beat or whisk your egg yolks and 1/4 cup sugar together vigorously, until it pales in color and a ribbon of batter falls off your whisk when you lift it from the bowl; this will take a few minutes by hand, and likely just one minute with an electric mixer. Whisk in the flour until fully incorporated.", 
            "Whisking the whole time, drizzle the warm vanilla-milk mixture into the egg yolk mixture, just a tiny bit at a time at first. Once you’ve added about 1/4 of the milk, you can add the rest in a thin stream, whisking constantly. ", 
            "Bring the saucepan to your stove and heat it over medium-high heat, whisking constantly, until it begins to bubble. Once bubbling, whisk it for 1 to 2 more minutes, then remove it from the heat. Immediately stir in vanilla extract (if using) and butter until combined. [Updated to add] As a final step for a perfectly smooth and silky custard, you can press the mixture through a fine-mesh strainer. You can also skip this step if you’re not terribly concerned about an imperfect custard.", 
            "To cool your custard quickly, place the saucepan in a larger bowl of ice water that will go halfway up the sides of the saucepan (i.e. water should not spill in) and stir the custard until lukewarm, then divide among serving dishes or ramekins. You can also pour it into serving dishes or ramekins still hot, but you should then press a film of plastic wrap against each custard in the fridge so it doesn’t form a pudding skin. Custards keep in fridge for up to 4 days.", 
            "To serve: Preheat oven to 450°F. Place blueberries in a heatproof, shallow roasting dish and sprinkle with 1 1/2 teaspoons sugar. Roast in oven for 12 to 15 minutes, rolling around once or twice during cooking time to ensure they roast evenly. The goal is not to let the blueberries fully slump or turn to sauce; you just want a little trickle of juices puddled across in the bottom. Squeeze a bit of lemon juice over berries the second they come out of the oven and roll them back and forth to evenly incorporate it. Spoon hot roasted blueberries and some of their juices over each custard. Eat immediately, passing any extra roasted blueberries alongside."
        ], 
        "date": "2012-08-30T22:06:46+00:00"
    }, 
    {
        "ingredient_list": [
            "Panna cotta", 
            "Neutral oil such as canola or safflower", 
            "4 tablespoons (60 ml) water", 
            "2 1/2 teaspoons (1 packet or 1/4 ounce or 7 grams) unflavored gelatin", 
            "2 cups (460 grams) plain whole-milk Greek yogurt", 
            "2 cups (475 ml) milk, heavy cream or a combination thereof (see note up top), divided", 
            "1/4 to 1/2 cup (50 to 100 grams) granulated sugar (see note up top)", 
            "2 tablespoons (30 ml) freshly squeezed lemon juice (from about 1/2 lemon)", 
            "To serve", 
            "1/3 to 1/2 cup (110 to 170 grams) honey", 
            "1/2 to 3/4 cup (55 to 85 grams) walnuts, toasted, cooled and coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/yogurt-panna-cotta-with-walnuts-and-honey.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Gluten-Free", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2013/04/yogurt-panna-cotta-with-walnuts-and-honey/", 
        "title": "yogurt panna cotta with walnuts and honey", 
        "directions": [
            "If you plan to unmold the panna cotta later, lightly coat the inside of a 9-inch round cake pan or smaller dessert cups with the oil. (No need to if you will scoop it from its cups.)", 
            "Place water in a small bowl. Stir in gelatin and set aside until the gelatin softens, about 15 minutes. ", 
            "In a large bowl, whisk all of yogurt and 1 cup of milk, cream or a mixture thereof. In a small saucepan, bring remaining milk or cream and sugar to a simmer. Stir in water-gelatin mixture (it will dissolve immediately) and remove from heat. Whisk this mixture into the yogurt mixture, then stir in lemon juice at the end. Pour mixture into cake pan or smaller cups and chill in fridge for at least 2 hours for small cups and up to 8 for a large pan. It’s best to do this the night before you need it, to be safe.", 
            "To unmold the cake pan, fill a larger baking dish with 1-inch boiling water. Dip panna cotta cake pan in it for 10 seconds, then flip it out onto a flat round platter. (A curved one will cause the panna cotta to appear sunken in the middle.)", 
            "To unmold smaller dishes, bring a small saucepan of water to a simmer and dip the bottom of a small panna cotta cup in one for five seconds, then invert it onto a plate. Repeat with remaining cups.", 
            "Right before you serve the panna cotta, sprinkle it with walnuts and drizzle it with honey. This needs to be done right before you serve it because the honey will (unfortunately) become liquidy and roll off it it sits on the panna cottas for too long. ", 
            "Do ahead: Panna cottas can be made two days ahead, though I suspect longer. Keep refrigerated. ", 
            "Non-gelatin panna cotta: Because gelatin is an animal by-product, many vegetarians will not eat it. I haven’t tested vegetarian options, but I’ve read a lot about using Natural Dessert’s Vegan Gel as well as agar-agar as a replacement. If you Google around a bit, you will find many directions for using either.", 
            "Dairy-free panna cotta: This isn’t really in the realm of this recipe, which was designed for yogurt, but there are many recipes on the web for panna cottas made with almond, coconut and/or soy milks, if you’re interested in looking into them.", 
            "* I put 1/3 cup each in these tiny (5.75 ounce) tumblers. You could also put about 2/3 cups each in this 7 1/2-ounce size."
        ], 
        "date": "2013-04-26T11:07:40+00:00"
    }
]