[
    {
        "ingredient_list": [
            "Dough", 
            "1 cup all-purpose flour plus additional for kneading and rolling", 
            "3/4 cup cake flour (not self-rising)", 
            "2 large eggs", 
            "3/4 teaspoon salt", 
            "1/4 cup water", 
            "Filling", 
            "1/4 cup water", 
            "1/4 cup plus 2 tablespoons sugar", 
            "2 tablespoons apricot brandy (optional)", 
            "6 oz dried apricots (1 cup; preferably California)", 
            "1/2 cup walnuts (2 oz), finely chopped", 
            "Dough (recipe above)", 
            "1 stick (1/2 cup) unsalted butter", 
            "1/2 cup fresh bread crumbs", 
            "1/4 teaspoon cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apricot-and-walnut-vareniki1.jpg?w=500", 
        "tags": [
            "Apricots", 
            "Dumplings", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/apricot-and-walnut-vareniki/", 
        "title": "apricot and walnut vareniki", 
        "directions": [
            "Make filling: Bring water and 1/4 cup sugar to a boil, stirring until sugar is dissolved. Remove from heat and stir in brandy. Finely chop apricots in a food processor, then add sugar syrup and pulse until just combined (do not puree). Transfer to a bowl and stir in 1/4 cup walnuts. Cool.", 
            "Roll out dough and fill varenikis: Halve dough and roll out 1 piece on a lightly floured surface into a 15-inch round, keeping remaining dough wrapped. Trim dough to a 13-inch square. Cut lengthwise into 4 strips, then crosswise into fourths to form 16 (3 1/4-inch) squares. ", 
            "Put 1 slightly rounded teaspoon filling in center of each square. Working with 1 square at a time, moisten edges with water and fold in half diagonally to form a triangle, pressing edges firmly together to seal. overlap bottom points of triangle and press to seal (dumpling will look like a pointed hat). Transfer vareniki to a flour-dusted kitchen towel. Repeat with remaining squares, then make more dumplings with remaining dough and filling.", 
            "Cook varenikis in a large pot of lightly salted boiling water until tender, about 15 minutes. Make topping while varenikis cook:", 
            "Heat 2 tablespoons butter in a skillet over moderate heat, then cook bread crumbs and remaining 1/4 cup walnuts, stirring frequently, until golden, 2 to 3 minutes. Remove from heat and season lightly with salt. Stir together cinnamon and remaining 2 tablespoons sugar. Sprinkle 2 teaspoons cinnamon sugar over crumb mixture and toss. ", 
            "To serve varenikis: Melt remaining 6 tablespoons butter, then drizzle about 2 tablespoons on a warmed serving platter. Transfer varenikis with a slotted spoon to platter and drizzle with remaining 4 tablespoons butter. ", 
            "Serve hot, sprinkled with bread-crumb mixture and remaining cinnamon sugar to taste. "
        ], 
        "date": "2007-11-08T23:15:27+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine ", 
            "Filling", 
            "3/4 cup (a scant 4 ounces or 110 grams) shelled unsalted pistachios", 
            "1 tablespoon (10 grams) all purpose flour", 
            "Few pinches of sea salt", 
            "6 tablespoons (75 grams) sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/4 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1 pound firm-ripe apricots", 
            "To finish", 
            "Powdered sugar or 1/4 cup apricot jam"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/apricot-pistachio-squares1.jpg?w=640", 
        "tags": [
            "Apricots", 
            "Bars", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/08/apricot-pistachio-squares/", 
        "title": "apricot pistachio squares", 
        "directions": [
            "Heat your oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (If you have an 8-inch square springform, you can skip this and just butter it well.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. Transfer the dough clumps to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "(Don’t have a food processor? You might have an easier time using softened butter and preparing this cookie-style: cream it with the sugar with a hand mixer, then spoon in the salt and flour, beating until just combined. It might help to chill this mixture a bit before pressing it into the pan, or it might feel too greasy to easily spread.)", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind your pistachios, sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. ", 
            "Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. Cut apricots in half (or, you might find that you can tear them open at the seams with your fingers) and remove pits. From here, you have a few decoration options: you can place the apricot halves in facedown or up all over the pistachio base. You can do as I did, which is cut them into strips, then slide each cut half onto a butter knife or offset spatula, tilt it so that it fans a little, and slide it onto your pistachio filling decoratively. (With this method, I ended up not using all of my apricots.) You could also arrange the strips like petals of flower around the pan, for maximum pretties.]]", 
            "Bake the bars for 60 minutes, or until they are golden and a toothpick inserted into the pistachio portion comes out batter-free. This might take up to 10 minutes longer depending on the juiciness of your apricots and the amount you were able to nestle in. Let cool completely in pan; you can hasten this along in the fridge. ", 
            "To finish, you can make a shiny glaze for your tart by warming the jam in a small saucepan until it thins, and brushing this mixture over the top of the cooled tart. Or, you can keep it rustic with just a dusting of powdered sugar, as I did. ", 
            "Cut bars into squares — chilled bars will give you the cleanest cuts. Keep leftover bars chilled. "
        ], 
        "date": "2014-08-07T12:18:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup black beans, cooked, drained (about 2/3 of a 15-ounce can)", 
            "1 large bell pepper, finely diced (I used a mix of colors because we keep them around for the kid)", 
            "1/4 cup finely diced white or red onion", 
            "1 small jalapeno, seeded and minced", 
            "1/4 cup olive oil", 
            "2 tablespoons freshly squeezed lime juice (from about 1 lime)", 
            "1/4 teaspoon coarse salt, plus more to taste", 
            "1/2 teaspoon ground cumin", 
            "Dashes of hot sauce or pinches of cayenne, to taste", 
            "Chopped cilantro for garnish", 
            "4 ripe avocados", 
            "1 cup finely diced cucumber (from about half a long English or 2 small Persian cukes), seeds removed", 
            "1 cup finely diced radishes (from about 4 large red ones)", 
            "2 scallions, finely chopped", 
            "4 tablespoons toasted sesame oil", 
            "2 teaspoons white miso (shiromiso, which is more mild/less salty)", 
            "2 tablespoons rice vinegar", 
            "1/2 teaspoon finely grated or minced fresh ginger root (or more to taste)", 
            "1 teaspoon white sesame seeds, toasted", 
            "1 teaspoon black sesame seeds", 
            "4 ripe avocados"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/avocado-cup-salads-two-ways1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Avocado", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/04/avocado-cup-salads-two-ways/", 
        "title": "avocado cup salads, two ways", 
        "directions": [
            "Mix cucumber, radishes and scallions in a medium bowl. In a small dish, whisk sesame oil, miso, rice vinegar and ginger. Add dressing flavor and seasonings to taste. Halve avocados and remove pits. Score avocado halves with a knife, cutting lines in both directions to form a grid, but being careful not to through the skin. ", 
            "If you’re serving all four avocados right away, go ahead and mix the dressing and salad ingredients together, then heap each avocado half with salad and dressing and garnish with mix of sesame seeds. If you’d like to stretch this over several days of lunches or the like, keep the mixed salad ingredients and dressing in separate dishes. When you’re ready to eat, cut and score your avocado, dot a little dressing directly on each half, heap with salad filling and drizzle with more dressing. Garnish with mix of seeds. ", 
            "Eat with a spoon. "
        ], 
        "date": "2014-04-23T12:13:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large carrot, peeled and roughly chopped", 
            "1 small shallot, peeled and roughly chopped", 
            "2 tablespoons roughly chopped fresh ginger", 
            "2 tablespoons white miso", 
            "2 tablespoons rice vinegar", 
            "2 tablespoons toasted sesame seed oil", 
            "1/4 cup grape seed or another neutral oil", 
            "2 tablespoons water", 
            "1 small/medium head of lettuce (I used Bibb)", 
            "1/4 red onion, thinly sliced", 
            "1 avocado, quartered and thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/avocado-salad-with-carrot-ginger-dressing.jpg?w=750", 
        "tags": [
            "Avocado", 
            "Carrots", 
            "Photo", 
            "Salad", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/04/avocado-salad-with-carrot-ginger-dressing/", 
        "title": "avocado salad with carrot-ginger dressing", 
        "directions": [
            "Make the dressing: Whiz the carrots, shallot and ginger in a blender or food processor until finely chopped. Scrape down the sides, then add the miso, vinegar and sesame oil. While the machine running, slowly drizzle in the grape seed oil and the water.\nAssemble salad: Trim and chop lettuce into small wedges. Arrange on a platter. Scatter onion and avocado on top.* If you’d like, and I do, sprinkle some flaky sea salt and black pepper over the salad at this point. Dollop with plenty of dressing and serve with remaining dressing on the side.I also added a few strips of purple and yellow carrot on top that had been cut with a juleinne peeler, plus some snipped chives. Toasted black and white sesame seeds would also make a pretty garnish here."
        ], 
        "date": "2010-04-26T17:25:21+00:00"
    }, 
    {
        "ingredient_list": [
            "Fruit Base", 
            "1 pound apricots", 
            "3 tablespoons sugar", 
            "1 tablespoon flour", 
            "Grated fresh nutmeg, a pinch", 
            "Crisp Topping", 
            "1/2 stick (4 tablespoons, 2 ounces) butter, melted", 
            "6 tablespoons turbinado or regular sugar (turbinado, also sold as Sugar in the Raw, gives an excellent crunch)", 
            "1/2 cup oats", 
            "1/2 cup all-purpose flour (or a mixture of whole wheat and all-purpose flour)", 
            "Pinch of salt", 
            "2 tablespoons sliced almonds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/06/2554534909_1c47b6eccb_b.jpg?w=750", 
        "tags": [
            "Apricots", 
            "Breakfast", 
            "Brunch", 
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/06/breakfast-apricot-crisp/", 
        "title": "breakfast apricot crisp", 
        "directions": [
            "Prepare fruit: Preheat oven to 400 degrees. Pull apart apricots at their seam, remove pits, and tear them one more time into quarters, placing them in a small baking dish (one that holds two to three cups is ideal). Stir in sugar, flour and pinch of nutmeg. ", 
            "Make topping: Melt butter and stir in sugar, then oats, then flour, salt and almonds until large clumps form. Sprinkle mixture over the fruit.  Bake for about 30 to 40 minutes and serve warm.", 
            "Although you could dust this with powdered sugar and serve it warm with vanilla ice cream for dessert, as I noted, it is on the tart side for an after-dinner treat. Truly, this excels cooled in the fridge overnight, and mixed with a scoop of plain yogurt for a weekday breakfast that will cure you of all weekday breakfast doldrums. It sure did for me. "
        ], 
        "date": "2008-06-07T11:43:35+00:00"
    }, 
    {
        "ingredient_list": [
            "Dressing (Heads up: I found I only needed half of this)", 
            "3/4 cup canola oil", 
            "1/4 cup extra-virgin olive oil", 
            "1/4 cup red wine vinegar", 
            "1 tablespoon fresh lemon juice", 
            "3/4 teaspoon dry mustard", 
            "1/2 teaspoon Worcestershire", 
            "1/4 teaspoon sugar", 
            "1 clove garlic, minced", 
            "Kosher salt and freshly ground black pepper, to taste", 
            "Salad", 
            "1/2 head iceberg lettuce, cored and shredded", 
            "1/2 head romaine lettuce, chopped", 
            "1/2 bunch watercress, some of the stems trimmed, chopped", 
            "2 ounces blue cheese, crumbled (we used a Stilton)", 
            "6 strips cooked bacon, roughly chopped", 
            "3 hard-boiled eggs, peeled and cut into 1/2-inch cubes", 
            "2 medium tomatoes, peeled*, seeded, and cut into 1/2-inch cubes", 
            "1 boneless skinless chicken breast, cooked and cut into 1/2-inch cubes", 
            "1 avocado, peeled, pitted, and cut into 1/2-inch cubes", 
            "Kosher salt and freshly ground black pepper, to taste", 
            "2 tablespoons chives, minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/classic-cobb-salad.jpg?w=752", 
        "tags": [
            "Avocado", 
            "Eggs", 
            "Photo", 
            "Salad", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2010/04/classic-cobb-salad/", 
        "title": "classic cobb salad", 
        "directions": [
            "Make the dressing: Combine the canola oil, olive oil, vinegar, lemon juice, mustard, Worcestershire, sugar, and garlic in a blender. Purée the ingredients to make a smooth dressing and season with salt and pepper. Set the dressing aside.", 
            "Make the salad: On a (very) large platter, combine the iceberg and romaine lettuces along with the watercress. Arrange the blue cheese, bacon, eggs, tomatoes, chicken, and avocado on top of the greens in neat rows. To serve, drizzle salad with dressing, season with salt and pepper, and top with chives. Alternatively, toss everything together in a bowl.", 
            "Do ahead: Salad dressing keeps, covered and refrigerated, for up to one week. Individual ingredients (except the avocado, which is too prone to browning) can be prepped and chopped, and kept in separate containers in the fridge until you’re ready to assemble the salad. However, no doubt due to sturdiness of 2/3 of the lettuces, I found that the entire assembled salad kept surprisingly well wrapped in plastic in the fridge for a few hours.", 
            "* To peel a tomato: Cut an X in bottom of each tomato and blanch in a large pot of boiling water for 10 seconds. Immediately transfer with a slotted spoon to an ice bath to cool. Slide the skins right off, starting at the X. Completely befuddled by the need for this step? Skip it."
        ], 
        "date": "2010-04-14T22:13:01+00:00"
    }, 
    {
        "ingredient_list": [
            "For the filling", 
            "1 1/2 cups (8 ounces) pitted dates, chopped", 
            "3/4 cup water", 
            "1 teaspoon finely grated orange (or mandarin or clementine) zest", 
            "For the crumbs", 
            "2 tablespoons packed brown sugar", 
            "1/4 cup raw or turbinado sugar", 
            "1/2 cup olive oil, coconut oil, melted butter or a mix of the above", 
            "3/4 cups rolled oats, I used quick-cooking but old-fashioned should work just fine", 
            "3/4 cup plus 2 tablespoons whole wheat flour, or a wholegrain flour mix of your choice", 
            "1/2 teaspoon ground cinnamon", 
            "A few gratings of fresh nutmeg", 
            "A pinch or two of ground cloves", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon coarse sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-breakfast-squares1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Dates", 
            "Photo", 
            "Snack", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2015/11/date-breakfast-squares/", 
        "title": "date breakfast squares", 
        "directions": [
            "Heat oven to 400 degrees. Either grease bottom and sides of an 8×8-inch pan or line the bottom and sides with parchment paper. ", 
            "In a small saucepan, combine dates, water and zest over low heat, simmering for 5 to 10 minutes, until liquid has absorbed and mixture has thickened. Set aside while you make the crumbs.", 
            "In a large bowl, mix the sugars and oil or butter together. Add the oats, flour, spices, baking soda and salt and stir to combine; the mixture should form a coarse rubble. ", 
            "Press half into the bottom of your prepared pan. Dollop the date mixture over it and use a small offset spatula (or whatever you have on hand) to spread the mixture smoothly over the crumbs. Don’t worry if the crumbs move around a little underneath; these bars don’t require perfection. Sprinkle remaining crumbs over date layer and press lightly to cover. ", 
            "Bake bars for 25 minutes, or until light brown at the edges. Cool in pan. Cut into squares. They’ll keep just fine at room temperature but will last up to a week in the fridge and longer in the freezer."
        ], 
        "date": "2015-11-20T11:50:15+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "3/4 pound (12 ounces, 340 grams or about 2 1/4 cups) dried dates", 
            "2 1/4 cups (530 ml) boiling water", 
            "1 1/2 teaspoons baking soda", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "3/4 cup (150 grams) granulated sugar", 
            "2 tablespoons (25 grams) light or dark brown sugar", 
            "2 large eggs", 
            "1/4 teaspoon fine sea or table salt", 
            "1 2/3 cups (210 grams) all-purpose flour", 
            "Sauce", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "1 cup (235 ml) heavy or whipping cream", 
            "1 cup plus 2 tablespoons (215 grams) brown sugar (light is called for, but I’d like to use dark next time)", 
            "2 teaspoons vanilla extract", 
            "To serve", 
            "Unsweetened whipped cream (optional, but please don’t skip it)", 
            "A few flakes of sea salt", 
            "Fresh mint leaves (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/date-cake-with-toffee-sauce-31.jpg?w=640", 
        "tags": [
            "Cake", 
            "Christmas", 
            "Dates", 
            "English", 
            "Everyday Cakes", 
            "Photo", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/11/date-cake-with-toffee-sauce/", 
        "title": "sticky toffee pudding", 
        "directions": [
            "Make the cake: Pit and roughly chop dates and place them in a heatproof bowl. Pour boiling water over them and stir in the baking soda. Cover the bowl and set it aside for 30 minutes.", 
            "Meanwhile, heat oven to 350°F (175°C). Butter a 9×13-inch baking pan. As an extra precaution, if you’re nervous about sticking (although this cake should not), you can line the bottom with a fitted rectangle of parchment paper.", 
            "Blend date-water mixture in a blender or food processor until smooth. In a large bowl, combine the melted butter and sugars. Whisk in eggs, then salt. Stir in the flour, then date puree. Pour the batter into the prepared pan and bake for 25 to 30 minutes, until a toothpick inserted into the center comes out clean. ", 
            "To serve it rustic-style, as we did, let it cool in the pan on a cooling rack. If you’d like to transfer it later to a serving plate, let cool in the pan for 20 minutes, then flip it out onto a cooling rack, removing the parchment paper if you used it.", 
            "Make the sauce: Combine butter, cream, sugar and vanilla in a larger saucepan than you think you’ll need (I vote for 2 1/2 to 3 quarts) over medium heat and bring to a simmer. Whisk for about 10 minutes, until the mixture thickens slightly. ", 
            "To serve: Cut the cake into squares (still warm is just fine). Drizzle each slice with toffee sauce, a pinch of sea salt, and top with a dollop of whipped cream, if desired. If your mint plant has survived the fall better than mine has, a leaf or two would be lovely here, too."
        ], 
        "date": "2014-11-06T12:06:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 to 1 1/4 pounds red cabbage (1 small head or half of a large one), sliced very thin", 
            "3 tablespoons olive oil", 
            "2 tablespoons lime or lemon juice (I use lime)", 
            "Salt and red pepper flakes (I used the mild Aleppo variety) to taste", 
            "About 1/2 cup pitted dates, coarsely chopped or sliced", 
            "4 ounces feta, crumbled into chunks", 
            "1 tablespoon chopped flat-leaf parsley", 
            "2 teaspoons well-toasted sesame seeds "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-feta-and-red-cabbage-salad1.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Dates", 
            "Fall", 
            "Gluten-Free", 
            "Photo", 
            "Salad", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/11/date-feta-and-red-cabbage-salad/", 
        "title": "date, feta and red cabbage salad", 
        "directions": [
            "Toss cabbage with olive oil and first tablespoons of lime juice, plus salt and pepper, coating leaves evenly. Taste and add more lime juice, salt and pepper to taste. I do this a few times, making sure I really get this base well seasoned because it will be hard to do it as well later.", 
            "Toss dressed cabbage gently with half of dates and feta. Sprinkle with remaining dates, then feta, then parsley and sesame seeds. Dig in.", 
            "Do ahead: The whole salad can sit assembled for at least an hour, if not longer in the fridge. Mine is going strong on the second day. You can also prepare the parts separately (feta, chopped dates, sliced cabbage) to assemble right before serving, if you’re planning ahead for Thanksgiving or a dinner party."
        ], 
        "date": "2015-11-10T12:01:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups coarsely chopped dates (10 ounces or 285 grams pitted)", 
            "1/3 cup orange liqueur such as Cointreau or Triple Sec", 
            "4 tablespoons (2 ounces or 55 grams) unsalted butter, at room temperature", 
            "3/4 cup (145 grams) light brown sugar, lightly packed", 
            "1 large egg", 
            "1 teaspoon pure vanilla extract", 
            "1 tablespoon grated orange zest (2 oranges)", 
            "2 cups (250 grams) all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1 teaspoon ground cinnamon", 
            "1 teaspoon ground nutmeg", 
            "1/4 teaspoon ground cloves", 
            "1 teaspoon kosher salt", 
            "3/4 cup freshly squeezed orange juice (3 oranges)", 
            "3/4 cup (3 ounces or 85 grams) coarsely chopped pecans"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/09/date-spice-loaf.jpg?w=750", 
        "tags": [
            "Cake", 
            "Dates", 
            "Everyday Cakes", 
            "Fruit", 
            "Orange", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/09/date-spice-loaf/", 
        "title": "date spice loaf", 
        "directions": [
            "Preheat the oven to 350°F. Butter the bottom of an 8 1/2 by 4 1/2 by 2 1/2-inch loaf pan. Line the bottom with parchment paper, then butter and flour the pan.", 
            "Combine the dates and orange liqueur in a small bowl and set aside for 30 minutes. Stir occasionally.", 
            "In the bowl of an electric mixer fitted with the paddle attachment, beat the butter and brown sugar together on medium speed for one minute. Scrape down the bowl. With the mixer on low, add the egg, vanilla, and orange zest. Sift together the flour, baking powder, baking soda, cinnamon, nutmeg, cloves, and salt. With the mixer still on low, add the flour mixture alternately with the orange juice to the creamed mixture, beating only until combined. By hand, stir in the dates with their liquid, and the pecans.", 
            "Pour the batter into the prepared loaf pan and smooth the top. Bake for 50 to 60 minutes, until a toothpick comes out clean. Cool in the pan for 10 minutes, then turn out onto a wire rack and cool completely.", 
            "Serving: Ina suggests you serve this bread with an orange cream cheese spread, which you can make by creaming 6 ounces of room temperature cream cheese with 1/3 cup sugar and one tablespoon orange zest in an electric mixer until just combined. "
        ], 
        "date": "2009-09-25T20:15:15+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons minced white onion (from about 1/8 large one)", 
            "1 1/2 tablespoons minced, seeded jalapeño (from about half a medium one)", 
            "2 tablespoons cilantro leaves, minced, plus more to taste", 
            "Juice of half a lime", 
            "1/4 teaspoon coarse or kosher salt, plus more to taste", 
            "2 medium-large ripe avocados"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/guacamole.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Avocado", 
            "Photo", 
            "Snack", 
            "Tex-Mex", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/02/guacamole/", 
        "title": "guacamole", 
        "directions": [
            "\nMix the onion, jalapeño and cilantro in the bottom of a medium bowl. Add lime and salt. Cut avocado in half and remove the pit. Use a knife to score each half in a grid pattern, being careful not to cut through the skin of the avocado. Run a soup  spoon between the avocado and skin to scoop the chunks cleanly into the bowl. Turn them over a few times to coat them with the dressing. Taste mixture, adding more of other ingredients to taste. Use a fork to mash chunks to desired consistency, or not at all. Try not to eat this bowl by yourself, although it will be hard.\n"
        ], 
        "date": "2017-02-03T13:16:54+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2-inch slice seven-grain sandwich bread", 
            "1/2 a large, ripe avocado", 
            "1 tablespoon olive oil", 
            "1 tablespoon lemon juice, or more to taste", 
            "Salt", 
            "An unholy amount of red pepper flakes"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/nolita-style-avocado-toast1.jpg?w=640", 
        "tags": [
            "Avocado", 
            "Budget", 
            "Photo", 
            "Quick", 
            "Sandwich", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/03/nolita-style-avocado-toast/", 
        "title": "nolita-style avocado toast", 
        "directions": [
            "Toast the bread so that it’s dark and firm. Scoop the avocado into a bowl and lightly mash/chop it, or directly onto your toast and do the same. Spread the avocado from edge to edge of the toast, leaving no bread uncovered, mounding it smoothly in the center. Drizzle olive oil over so that it rolls off onto the plate. Repeat with lemon juice. Shake or grind on some fine salt and cover with red pepper flakes. Slice toast on the diagonal and eat with a knife and fork, if before noon, with a cup of coffee or tea, if after, a petite glass of rose wine. ", 
            "On the side: If trying to stretch this into a fuller meal, you cannot go wrong with David Lebovitz’s simple carrot salad on the side, or the Moroccan-hinted harissa and feta version in the archives here."
        ], 
        "date": "2016-03-08T12:05:25+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 to 1 pound seedless cucumber, washed and chopped into chunks", 
            "2 thin or 1 regular scallions, thinly sliced", 
            "1 large avocado, pitted and diced", 
            "2 tablespoons mayonaise", 
            "Juice of half a lime, plus more to taste", 
            "Salt and hot sauce (we used Sriracha) to taste", 
            "Chopped cilantro or flat-leaf parsley to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/17041084926_d38d46dae0_k.jpg?w=750", 
        "tags": [
            "Avocado", 
            "Cucumber", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/04/obsessively-good-avocado-cucumber-salad/", 
        "title": "obsessively good avocado cucumber salad", 
        "directions": [
            "Combine cucumber, scallions and avocado in a bowl. Whisk together mayo, lime and seasonings, adjusting levels to taste. Drizzle salad with dressing and garnish with cilantro or parsley. Repeat again tomorrow. "
        ], 
        "date": "2015-04-07T12:00:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup boiling water (optional, see note up top)", 
            "1 cup pitted dates (about 120 grams), roughly chopped", 
            "A few gratings of fresh nutmeg", 
            "2/3 cup milk", 
            "2 cups (410 grams) vanilla ice cream", 
            "Whipped cream and maraschino cherry, to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/palm-springs-date-shake-monkey-flip1.jpg?w=640", 
        "tags": [
            "Dates", 
            "Ice Cream/Sorbet", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/04/palm-springs-date-shake-monkey-flip/", 
        "title": "palm springs date shake + monkey flip", 
        "directions": [
            "If you’d like the smoothest date shake: Pour boiling water over dates in a medium bowl, cover with a lid and let steep for 10 to 15 minutes (longer if you have time). Blend both water and dates in blender until smooth — it will seem like too much water at first but will eventually become a thickish puree. Transfer to freezer for a few minutes to cool it, if it’s not cold enough already. Add date puree back to blender bowl, if they’re not there already.", 
            "If you don’t mind some nubby bits of dates in your shake: Blend dates with a splash or two of the milk until they’re finely ground.", 
            "Both methods: Add nutmeg, milk and ice cream and blend until smooth. Pour into glasses, top with whipped cream and a cherry. ", 
            "To Make A Monkey Flip", 
            "Use all the ingredients above, plus 1/4 cup smooth peanut butter, 1/4 cup chocolate syrup and 2 medium bananas and blend until smooth. You’ll end up with 5 small (8-ounce) shakes instead of 4, but that last one can be your little secret."
        ], 
        "date": "2016-04-29T12:00:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound carrots, scrubbed or peeled and cut into two-inch segments (angled if you’re feeling fancy)", 
            "3 tablespoons olive oil, divided", 
            "1/4 teaspoon ground cumin", 
            "Coarse salt and freshly ground black pepper", 
            "1/2 an avocado, pitted and sliced (we had a mega-‘cado and only used 1/4 of it)", 
            "Juice of half a lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-carrot-and-avocado-salad1.jpg?w=500", 
        "tags": [
            "Avocado", 
            "Carrots", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2009/08/roasted-carrot-and-avocado-salad/", 
        "title": "roasted carrot and avocado salad", 
        "directions": [
            "Roast the carrots: Preheat your oven to 400 degrees. Toss the carrot chunks in a medium bowl with two tablespoons of the olive oil, cumin and as generous of a helping of salt and pepper as you like. (We like a lot. Especially with sweet things like carrots.)", 
            "Spread them on a roasting sheet (I lined ours with foil because despite having a dishwasher these days, old must-create-fewer-dishes-at-all-times habits die hard) and roast for about 20 minutes, or until tender and browned. Of course, roasting time will vary depending on the thickness of your carrots. Our heftier chunks took over 30.", 
            "Finish the salad: Once the carrots are roasted, arrange them on a serving platter with slices of avocado on top. Drizzle the salad with the last tablespoons of olive oil, lemon juice and extra salt and pepper, if it needs it. Eat immediately."
        ], 
        "date": "2009-08-03T09:53:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup water", 
            "1 1/2 teaspoons teaspoon cumin seeds, toasted and cooled if you have the patience, ground will work here as well", 
            "1 1/2 teaspoons coriander seeds, toasted and cooled if you have the patience, ground will work here as well", 
            "2 teaspoon fresh thyme leaves", 
            "1 teaspoon coarse or kosher salt, plus more to taste", 
            "Red chile flakes, to taste", 
            "Freshly ground black pepper, to taste", 
            "4 garlic cloves, minced or pressed", 
            "1 tablespoon red wine vinegar", 
            "1/4 cup olive oil", 
            "3 pounds thin-to-medium carrots, scrubbed, not peeled; mixed colors are prettier here but not essential", 
            "2 tablespoons olive oil", 
            "2 tablespoons orange juice (from about 1/4 orange)", 
            "2 tablespoons lemon juice (from about 1/2 lemon)", 
            "1 large or 2 medium firm-ripe avocados, cut in thin slices", 
            "Salt and pepper to taste", 
            "1 to 2 cups radish sprouts, other sprouts or light salad greens of your choice", 
            "1/4 cup plain yogurt", 
            "2 tablespoons roasted hulled pumpkin seeds, sunflower seeds, toasted sesame seeds or a mix thereof"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/spiced-roasted-carrots-with-avocado-and-yogurt1.jpg?w=750", 
        "tags": [
            "Avocado", 
            "Carrots", 
            "Photo", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/05/roasted-carrots-with-avocado-and-yogurt/", 
        "title": "roasted carrots with avocado and yogurt", 
        "directions": [
            "Heat your oven to 400 degrees F. Cover 1 large (half-sheet) or 2 smaller (quarter-sheet) roasting pans with foil for easy cleanup. Pour 1/4 cup water in bottom of pan (or divide between both).\nMake your spice paste by either pounding the cumin, coriander, thyme, salt and peppers in a mortar and pestle until roughly ground, using an electric spice grinder (i.e. a coffee grinder you don’t mind smelling like spices) or small food processor to do the same, or, if using ground spices, just combining them in the bottom of the large bowl you’re about to use. In the bottom of a very large bowl, combine prepared spices, salt and pepper, garlic, vinegar and 1/4 cup olive oil and whisk to blend. Add carrots and toss to coat.\nSpread carrots, drizzling with any extra marinade, in prepared pans and cover tightly with foil. Roast for 25 minutes covered then remove the foil and roast for 35 minutes more, until the carrots are lightly browned and tender but not falling apart.\nMeanwhile, combine 2 tablespoons olive oil, orange and lemon juices in a small dish with salt and pepper. When carrots are done, scatter with avocado and sprouts then drizzle with this citrus dressing all over. Dollop yogurt over the top and sprinkle with seeds. Dig in."
        ], 
        "date": "2016-05-17T11:57:35+00:00"
    }
]