{
  "date": "2010-10-15T14:09:55+00:00",
  "directions": [
    "Position a rack at the center of oven and preheat oven to 375 °F. Line baking sheet with parchment paper.",
    "Peel and core apples, then cut them into one-sixteenths. (I assumed this meant chunks, not slivers.) Placed them in a single layer on a baking sheet lined with parchment paper and bake them until they take on a little color and feel dry to the touch, about 20 minutes. They will be about half-baked. Let them cool completely. (You can speed this up in the fridge, as I did.) Leave oven on.",
    "Sift or whisk flour, sugar, baking powder and salt together. Set aside. Place butter in the bowl of an electric mixer with a paddle attachment, along with cooled apple chunks, cheese, cream and one egg. Sprinkle flour mixture over the top and mix on low speed until the dough just comes together. Do not overmix.",
    "[Don’t have a stand or hand mixer? I’d rub the cold butter into the flour mixture with my fingertips or with a pastry blender, hand-chop the apples coarsely and mix the rest together with a wooden spoon until combined. It might feel awkward, but it should all come together. Again, don’t overmix it though it will be harder to do this by hand.]",
    "Generously flour your counter top and place the scone dough on top of it. Sprinkle with flour. Use a rolling pin to gently roll (or use your hands to pat) the dough into a 1 1/4-inch thick, 6-inch circle. Cut circle into 6 wedges. Transfer them to a baking sheet that has either been buttered or lined with a fresh sheet of parchment paper. Leave at least 2 inches between each scone.",
    "Beat remaining egg in a small bowl with a pinch of salt. Brush the scones with egg wash and sprinkle them with remaining tablespoon of sugar. Bake until firm and golden, about 30 minutes. With a spatula, lift them to a wire rack to cool for 10 minutes. Before you eat one, make sure you realize how addictive they might be. Once you’ve got that down, go for it anyway.",
    "Do ahead: Scones are best the day they are baked. However, they can be made ahead of time and stored unbaked in the freezer until you need them. Simply brush them with the egg wash and sprinkle them with sugar, and bake them still frozen for just a couple extra minutes. This way they are always freshly baked when you want them. These scones were passable on day two and terrible on day three. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/5079390141_db09235efb_o.jpg?w=749",
  "ingredient_list": [
    "2 firm tart apples (1 pound or 2 454 grams)",
    "1 1/2 cups (6.75 ounces or 195 grams) all-purpose flour",
    "1/4 cup sugar plus 1 1/2 tablespoons for sprinkling (total of 2.2 ounces or 63 grams)",
    "1/2 tablespoon (7 grams) baking powder",
    "1/2 teaspoon salt (3 grams) plus additional for egg wash",
    "6 tablespoons (3 ounces or 85 grams)unsalted butter, chilled and cut into 1/2-inch cubes plus additional for baking sheet if not lining it with parchment",
    "1/2 cup (2.25 ounces or 65 grams) sharp cheddar, shredded (white is recommended, I assume for aesthetics)",
    "1/4 cup (2 ounces) heavy cream",
    "2 large eggs"
  ],
  "tags": [
    "Apple",
    "Cheese",
    "Fall",
    "Muffin/Quick Bread",
    "Photo",
    "Scones/Biscuits"
  ],
  "title": "apple and cheddar scones",
  "url": "https://smittenkitchen.com/2010/10/apple-and-cheddar-scones/"
}