{
  "date": "2009-06-16T15:19:17+00:00",
  "directions": [
    "1.    Preheat oven to 350°F.",
    "2.    In a food processor, combine the cheese, butter, flour, salt and red pepper in five 5-second pulses until the mixture resembles coarse crumbs. Add the half-and-half and process until the dough forms a ball, about 10 seconds.",
    "3.    On a lightly floured surface, using a lightly floured rolling pin, roll the dough into an 8- by 10-inch rectangle that is 1/8-inch thick. With a sharp knife (or a pizza or pastry wheel; both worked great), cut the dough into thin 8-inch strips, each 1/4- to 1/3-inch wide (dipping the knife in flour after every few inches ensures a clean cut). Gently transfer the strips to an ungreased cookie sheet (though I lined mine with parchment), leaving at least 1/4-inch between them. The dough may sag or may break occasionally in the transfer, but don’t be concerned — just do your best. The straws can be any length, from 2 to 10 inches.",
    "4.    Bake the straws on the middle rack for 12 to 15 minutes, or until the ends are barely browned. Remove from the oven and set the cookie sheet on a rack to cool.",
    "5.    Serve at room temperature. Cheese straws will keep in the refrigerator, in a sealed container, for two days. They will not last an hour at a party.",
    "Variation: One adaptation I am curious to try would be to roll these into thin, round crackers. Because they puff a bit, I’d roll them as thin as possible, and use a fork or skewer to make some holes to keep the expansion in check. If you try this, I’d love to hear how it went for you."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/cheese-straws.jpg?w=753",
  "ingredient_list": [
    "1 1/2 cups (about 6 ounces) grated extra-sharp Cheddar cheese",
    "4 tablespoons (1/2 stick or 2 ounces) unsalted butter, softened and cut into 4 pieces",
    "3/4 cup flour, plus more for dusting",
    "1/2 teaspoon kosher salt",
    "1/2 teaspoon crushed red pepper flakes",
    "1 tablespoon half-and-half (I used cream, because I had it on hand; suspect milk would work just as well)"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Cheese",
    "Photo"
  ],
  "title": "cheese straws",
  "url": "https://smittenkitchen.com/2009/06/cheese-straws/"
}