[
    {
        "ingredient_list": [
            "2 firm tart apples (1 pound or 2 454 grams)", 
            "1 1/2 cups (6.75 ounces or 195 grams) all-purpose flour", 
            "1/4 cup sugar plus 1 1/2 tablespoons for sprinkling (total of 2.2 ounces or 63 grams)", 
            "1/2 tablespoon (7 grams) baking powder", 
            "1/2 teaspoon salt (3 grams) plus additional for egg wash", 
            "6 tablespoons (3 ounces or 85 grams)unsalted butter, chilled and cut into 1/2-inch cubes plus additional for baking sheet if not lining it with parchment", 
            "1/2 cup (2.25 ounces or 65 grams) sharp cheddar, shredded (white is recommended, I assume for aesthetics)", 
            "1/4 cup (2 ounces) heavy cream", 
            "2 large eggs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/5079390141_db09235efb_o.jpg?w=749", 
        "tags": [
            "Apple", 
            "Cheese", 
            "Fall", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2010/10/apple-and-cheddar-scones/", 
        "title": "apple and cheddar scones", 
        "directions": [
            "Position a rack at the center of oven and preheat oven to 375 °F. Line baking sheet with parchment paper.", 
            "Peel and core apples, then cut them into one-sixteenths. (I assumed this meant chunks, not slivers.) Placed them in a single layer on a baking sheet lined with parchment paper and bake them until they take on a little color and feel dry to the touch, about 20 minutes. They will be about half-baked. Let them cool completely. (You can speed this up in the fridge, as I did.) Leave oven on.", 
            "Sift or whisk flour, sugar, baking powder and salt together. Set aside. Place butter in the bowl of an electric mixer with a paddle attachment, along with cooled apple chunks, cheese, cream and one egg. Sprinkle flour mixture over the top and mix on low speed until the dough just comes together. Do not overmix.", 
            "[Don’t have a stand or hand mixer? I’d rub the cold butter into the flour mixture with my fingertips or with a pastry blender, hand-chop the apples coarsely and mix the rest together with a wooden spoon until combined. It might feel awkward, but it should all come together. Again, don’t overmix it though it will be harder to do this by hand.]", 
            "Generously flour your counter top and place the scone dough on top of it. Sprinkle with flour. Use a rolling pin to gently roll (or use your hands to pat) the dough into a 1 1/4-inch thick, 6-inch circle. Cut circle into 6 wedges. Transfer them to a baking sheet that has either been buttered or lined with a fresh sheet of parchment paper. Leave at least 2 inches between each scone.", 
            "Beat remaining egg in a small bowl with a pinch of salt. Brush the scones with egg wash and sprinkle them with remaining tablespoon of sugar. Bake until firm and golden, about 30 minutes. With a spatula, lift them to a wire rack to cool for 10 minutes. Before you eat one, make sure you realize how addictive they might be. Once you’ve got that down, go for it anyway.", 
            "Do ahead: Scones are best the day they are baked. However, they can be made ahead of time and stored unbaked in the freezer until you need them. Simply brush them with the egg wash and sprinkle them with sugar, and bake them still frozen for just a couple extra minutes. This way they are always freshly baked when you want them. These scones were passable on day two and terrible on day three. "
        ], 
        "date": "2010-10-15T14:09:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (80 grams) raisins", 
            "2 tablespoons (30 ml) dark rum", 
            "1 cup plus 3 tablespoons (150 grams) all-purpose flour, plus more for dusting", 
            "Pinch of salt", 
            "3 tablespoons (45 ml) sunflower, safflower or another neutral oil", 
            "1/3 cup (80 ml) water", 
            "2 pounds (905 grams) firm apples (about 5 to 6)", 
            "Juice of 1 lemon", 
            "1/3 cup (65 grams) granulated sugar or vanilla sugar (see note above)", 
            "1/2 teaspoon ground cinnamon (optional)", 
            "8 tablespoons (115 grams) unsalted butter, divided", 
            "3/4 cup (40 grams) plain, unseasoned dried breadcrumbs (I used, and recommend, panko, see note above)", 
            "1 tablespoon granulated sugar or vanilla sugar", 
            "1/8 teaspoon salt", 
            "Confectioners’ sugar, for dusting", 
            "Lightly sweetened whipped cream or vanilla ice cream, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/apple-strudel-apfelstrudel.jpg?w=750", 
        "tags": [
            "Apple", 
            "Austrian", 
            "Cake", 
            "Fall", 
            "German", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/11/apple-strudel/", 
        "title": "apple strudel", 
        "directions": [
            "Prepare the raisins: The day before, combine the raisins and the rum in a small bowl and cover; set aside for 24 hours. However, should you be reading this and want to make it right now, I found microwaving the two together for 10 to 15 seconds and setting them aside until you’re ready to mix the filling allowed them to absorb almost as well.\nMake the dough: The day of, combine the flour and salt in a medium bowl. Add the oil and water and mix with a spoon or your index finger until a rough dough forms. Turn it out onto a very lightly floured counter and knead for 10 minutes. It sounds like it will be forever, but set a timer and chat with a friend, it goes quickly. After 10 minutes, the dough should be soft and silky to the tough. Form it into a ball, place it on the counter and upend the mixing bowl over it. Set aside for 30 minutes.\nMeanwhile, prepare the apples: Peel, halve, core and slice thin in one direction, then halve the slices crosswise, creating thin squarish rectangles of apples. Place them in a large bowl and toss with lemon juice, sugar and cinnamon, if using. Add the raisins and any rum left in the bowl.\nPrepare the breadcrumbs: In a small skillet over medium-low heat, melt 3 tablespoons butter and add the breadcrumbs, sugar and salt. Stir to coat and cook, stirring frequently as they can burn quickly, until crumbs are an even golden brown and very fragrant. Don’t let them burn. Scrape into a dish (or they’ll keep cooking in the pan) and set aside.\nHeat your oven to 400 degrees F (200 degrees C). Line 1 large or 2 smaller baking sheets with parchment paper.\nMelt the remaining 5 tablespoons butter in a small dish.\nRoll out your dough (these directions are for a full-sized strudel): Cover your work surface with a cleaning linen towel or sheet that’s at least 24-by-32 inches. The long side should be horizontal. Sprinkle the cloth lightly with flour. Place the dough in the middle, sprinkle it very lightly with flour and roll in both directions until it’s about 10-by-13 inches, or about as far as the rolling pin can take it. Make sure the dough hasn’t stuck to the cloth; reflour if it has. Now the stretching begins! Ball your hands to loose fists, put them under the rolled-out dough and gently start stretching the dough using the back of your hands. Alternate with pulling the dough gently with your fingers to continue stretching it, stretching the edges thin too. This is all much easier than it sounds, but be patient. If holes form, pinch the dough back together. Continue stretching until the dough is about 16-by-24 inches.", 
            "Assemble strudel: Brush evenly with about half the melted butter. On the right side of the rectangle, a few inches from the end, spread the breadcrumbs top to bottom in a thick line, leaving a little more than an inch margin at the top and bottom of the strip. Scoop the apples with a slotted spoon, leaving any accumulated juices in the bowl, and pile them over the crumbs. Gently pull the top and bottom edges of the dough over the apple mixture. Pull the right edge of the dough up and over the filling as far as it will go without tearing. Working carefully, use the towel to roll up the strudel all the way. Place the parchment paper from your baking sheet at the edge of the roll and roll the strudel onto it. Ideally, it should be breadcrumb side-down on the parchment, you can roll it again if it’s not. Use the parchment like a sling to gently place the strudel on the baking sheet.\nBrush the strudel generously all over with some of the remaining butter. Bake for 15 minutes, then brush again and return to the oven in a rotated position. Repeat this once, baking a total of 45 minutes. (Half-size strudels seem to bake 5 or so minutes faster.) The finished strudel should be crisp to the touch and a deep golden brown.", 
            "Remove the baking sheet from the oven and let cool on a rack for at least 20 minutes before serving. Dust with confectioners’ sugar and slice into pieces to serve.", 
            "Strudel is best the day it is made, but it keeps for 1 to 2 days at room temperature. I’ve also read that you can freeze it (am trying this as we speak, will give more notes once it defrosts). Before serving, you can crisp up leftover strudel in a 350 degree F (180 degree C) oven."
        ], 
        "date": "2016-11-04T12:07:27+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick, 4 ounces or 113 grams) butter, melted", 
            "1 cup (218 grams or 7 3/4 ounces for light; 238 grams or 8 3/8 ounces for dark) brown sugar", 
            "1 large egg", 
            "1 teaspoon vanilla or 1/2 teaspoon almond extract", 
            "Pinch salt", 
            "1 cup (4 3/8 ounces or 125 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/blondies.jpg?w=749", 
        "tags": [
            "Bourbon", 
            "Brown Butter", 
            "Brownies/Blondies", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/blondies/", 
        "title": "blondies, infinitely adaptable", 
        "directions": [
            "Further additions, use one or a combination of: ", 
            "New favorite combination of late (added 5/24/14): We’ve gotten on a kick making these again, but I’ve really wanted to increase the toasty butterscotch flavor and have done so by: browning the butter, using dark brown sugar but only 3/4 cup (I prefer these less sweet these days), increasing the vanilla to 1 1/2 teaspoons and the salt to 1/4 teaspoon fleur de sel or flaky sea salt, plus a few flakes crumbled on top. I use 1 cup chopped bittersweet chocolate and 1/2 cup chopped walnuts or pecans as the mix-ins. Hope this provides some inspiration!"
        ], 
        "date": "2006-11-25T19:37:39+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups all-purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "2 teaspoons sugar", 
            "3/4 teaspoon baking soda", 
            "1 teaspoon salt", 
            "6 tablespoons (3/4 stick or 3 ounces) cold unsalted butter, cut into 1/2-inch cubes", 
            "1 1/2 cups crumbled blue cheese", 
            "4 scallions, finely chopped", 
            "1 cup well-shaken buttermilk (or, you can make your own)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/blue-cheese-scallion-drop-biscuits1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Cheese", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2010/04/blue-cheese-scallion-drop-biscuits/", 
        "title": "blue cheese scallion drop biscuits", 
        "directions": [
            "Preheat oven to 450°F. Whisk together flour, baking powder, sugar, baking soda, and salt in a bowl, then blend in butter with your fingertips until mixture resembles coarse meal. Stir in blue cheese and scallions. Add buttermilk and stir until just combined.", 
            "Drop dough in 12 equal mounds about 2 inches apart onto a buttered large baking sheet, or one lined with parchment paper. Bake in middle of oven until golden, 16 to 20 minutes. ", 
            "Do ahead: Biscuits are always best the day they are baked. However, if you wish to get a lead on them, you can make them, drop them onto your baking sheet, freeze them until they are firm, and place them in a freezer bag or container until you’re ready to bake them. They can be baked while still frozen (straight from the freezer), you’ll just want to add a few minutes to the baking time."
        ], 
        "date": "2010-04-21T16:51:30+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/08/2804182114_6d9ebd8506_b.jpg?w=753", 
        "tags": [
            "Bourbon", 
            "Fruit", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/08/bourbon-peach-hand-pies/", 
        "title": "bourbon peach hand pies", 
        "directions": [
            "1. To make the pastry, in a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour. If preparing ahead of time, the dough can be stored at this point for up to one month in the freezer.", 
            "2. Divide the refrigerated dough in half. On a lightly floured work surface, roll out one half of the dough to 1/8-inch thickness. Using a 4 1/2-inch-round biscuit cutter, cut seven circles out of the rolled dough. Transfer the circles to a parchment-lined baking sheet, and place in the refrigerator to chill for about 30 minutes. Repeat the rolling, cutting, and chilling process with the remaining half of dough. (I used a 4-inch cutter–if you can call a “cutter” the tin edge of the container that holds my smaller round cutters–and managed to get 12 from each dough half, after rerolling the scraps.)", 
            "3. Make the filling: Peel and chop the peaches into small bits (approx. 1/2-inch dice), much smaller than you’d use for a regular-sized pie. Mix them with the flour, sugar and pinch of salt, and add the bourbon and vanilla, if you wish.", 
            "4. Remove the chilled dough from the refrigerator, and let stand at room temperature until just pliable, 2 to 3 minutes. Spoon about 1 to 2 tablespoons filling (use the smaller amount for a 4-inch circle) onto one half of each circle of dough. Quickly brush a little cold water around the circumference of the dough, and fold it in half so the other side comes down over the filling, creating a semicircle. Seal the hand pie, and make a decorative edge by pressing the edges of the dough together with the back of a fork. Repeat process with remaining dough. Place the hand pies back on the parchment-lined baking sheet, and return to the refrigerator to chill for another 30 minutes.", 
            "5. Heat oven to 375 degrees. Remove the chilled hand pies from the refrigerator, cut a small slit in each and lightly brush with the egg yolk wash. Sprinkle sanding sugar generously over the pies, and place pies in the oven to bake. Bake until the hand pies are golden brown and just slightly cracked, about 20 minutes. Remove the pies from the oven, and let stand to cool slightly before serving."
        ], 
        "date": "2008-08-28T16:12:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup water", 
            "2 tea bags (whatever you like for iced tea)", 
            "1 cup bourbon", 
            "1/4 cup granulated sugar", 
            "1 1/2 cups orange juice (about 3 well-squeezed oranges)", 
            "6 tablespoons lemon juice (about 2 lemons)", 
            "16 to 17 ounces (about 5 cups of small pieces of ice) ice cubes", 
            "Mint sprigs or lemon slices, for garnish "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/bourbon-slush-punch1.jpg?w=640", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Lemon", 
            "Orange", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/07/bourbon-slush-punch/", 
        "title": "bourbon slush punch", 
        "directions": [
            "Boil 1 cup water for tea. Add the tea bags and let steep until cool. Discard the tea bags and set aside. Pour tea into a pitcher. Add bourbon, sugar, orange juice and lemon juice and refrigerate until needed. Don’t worry about stirring the sugar so that it dissolves; after 30 minutes in the fridge, it will have. ", 
            "To serve: Shake or stir punch base to ensure ingredients are evenly distributed. To make two liters of punch, add base and full amount of ice cubes to your blender, blending until the ice is crushed and slushy. For each individual glass of punch, place 1/2 cup punch base and slightly heaped 1/2 cup small pieces of ice (mine were chipped off an ice block; don’t ask) and blend until slushy. Add an extra whole ice cube or two to glasses if desired. Garnish glass with a sprig of mint or slice of lemon."
        ], 
        "date": "2014-07-24T12:01:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound broccolini or regular broccoli", 
            "2 tablespoons olive oil", 
            "3 cloves garlic, minced", 
            "A few pinches red pepper flakes, to taste", 
            "Finely grated zest, then juice, of 1/2 lemon (juice before zesting only if you enjoy being grumpy)", 
            "Coarse salt, to taste", 
            "1/2 cup finely grated aged pecorino romano cheese", 
            "8 thin slices totally unfancy deli provolone", 
            "8 slices bread of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/broccoli-melts1.jpg?w=640", 
        "tags": [
            "Broccoli", 
            "Cheese", 
            "Photo", 
            "Sandwich", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/02/broccoli-melts/", 
        "title": "broccoli melts", 
        "directions": [
            "If using broccolini, cut it into 2-inch segments. If regular broccoli, peel the stems with a vegetable peeler first so that they cook evenly, and cut the rest into large chunks.", 
            "Pour about 1-inch puddle of salted water into a large sauté pan and bring to a boil. Add broccoli and cover with a lid and boil/steam for 2 minutes. Drain well and pat dry on paper towels, wringing out as much extra liquid as possible. Chop into small (roughly 1/2-inch) bits.", 
            "Wipe sauté pan dry and heat over medium. Add olive oil and let it heat for a full minute. Add garlic and pepper flakes, cooking for 1 minutes, or until the garlic is just beginning to turn golden. Add the broccoli and cook 1 to 2 minutes more, seasoning with salt. Transfer mixture to a bowl and add lemon zest, juice, pecorino and more salt and pepper flakes to taste.", 
            "Heat broiler. Arrange slices of bread on a tray and lightly toast on both sides. Scoop broccoli mixture onto each slice of bread, lay a slice of provolone over it and run under the broiler until cheese has melted and begun to blister. Eat. Repeat. Don’t forget to share, or at least hide the evidence if you decide not to."
        ], 
        "date": "2016-02-16T12:02:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup firmly packed brown sugar", 
            "2 tablespoons butter", 
            "1 tablespoon vanilla", 
            "2 teaspoons bourbon (optional)", 
            "1 1/2 cups whipping cream", 
            "2 cups half-and-half (light cream)", 
            "6 large egg yolks (hint: if you make a hazelnut brown butter cake, you should have these in your fridge already!)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/butterscotch-ice-cream1.jpg?w=500", 
        "tags": [
            "Bourbon", 
            "Ice Cream/Sorbet", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/03/butterscotch-ice-cream/", 
        "title": "butterscotch ice cream", 
        "directions": [
            "1. In a 1- to 2-quart pan over medium heat, stir brown sugar and butter until butter is melted, sugar is dissolved, and mixture is bubbly, 3 to 4 minutes. Whisk in 1/2 cup whipping cream until smooth; remove butterscotch mixture from heat. Add vanilla and bourbon, if using.", 
            "2. In a 3- to 4-quart pan over medium-high heat, combine remaining 1 cup whipping cream and the half-and-half; bring to a simmer.", 
            "3. Meanwhile, in a bowl, beat egg yolks to blend. Whisk 1/2 cup of the warm cream mixture into egg yolks, then pour egg yolk mixture into pan with cream. Stir constantly over low heat just until mixture is slightly thickened, 2 to 4 minutes. Immediately remove from heat.", 
            "4. Pour through a fine strainer into a clean bowl and whisk in butterscotch mixture. Chill until cold, stirring occasionally, about 2 hours; or cover and chill up to 1 day.", 
            "5. Freeze mixture in an ice cream maker according to manufacturer’s instructions. Serve softly frozen, or transfer ice cream to an airtight container and freeze until firm, at least 6 hours or up to 1 week.", 
            "Note: If you serve with espresso-chocolate shortbread cookies, your friends might never leave. Proceed with caution."
        ], 
        "date": "2008-03-14T18:56:02+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/bourbon-pumpkin-cheesecake.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Cake", 
            "Celebration Cakes", 
            "Photo", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2006/11/candy-corn-for-really-lucky-grown-ups/", 
        "title": "bourbon pumpkin cheesecake", 
        "directions": [
            "Garnish: pecan halves ", 
            "Make crust: Invert bottom of a 9-inch springform pan (to create flat bottom, which will make it easier to remove cake from pan), then lock on side and butter pan.", 
            "Stir together crumbs, pecans, sugars, and butter in a bowl until combined well. Press crumb mixture evenly onto bottom and 1/2 inch up side of pan, then chill crust, 1 hour.", 
            "Make filling and bake cheesecake: Put oven rack in middle position and Preheat oven to 350°F.", 
            "Whisk together pumpkin, eggs, brown sugar, cream, vanilla, and liqueur (if using) in a bowl until combined.", 
            "Stir together granulated sugar, cornstarch, cinnamon, nutmeg, ginger, and salt in large bowl. ", 
            "Add cream cheese and beat with an electric mixer at high speed until creamy and smooth, about 3 minutes. Reduce speed to medium, then add pumpkin mixture and beat until smooth.", 
            "Pour filling into crust, smoothing top, then put springform pan in a shallow baking pan (in case springform leaks). Bake until center is just set, 50 to 60 minutes. Transfer to rack and cool 5 minutes. (Leave oven on.)", 
            "Make topping: Whisk together sour cream, sugar, and liqueur (if using) in a bowl, then spread on top of cheesecake and bake 5 additional minutes.", 
            "Cool cheesecake completely in pan on rack, about 3 hours.", 
            "Chill, covered, until cold, at least 4 hours. Remove side of pan and bring to room temperature before serving.", 
            "Do ahead: Baked cheesecake can be chilled, covered, up to 2 days."
        ], 
        "date": "2006-11-22T14:12:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups (about 6 ounces) grated extra-sharp Cheddar cheese", 
            "4 tablespoons (1/2 stick or 2 ounces) unsalted butter, softened and cut into 4 pieces", 
            "3/4 cup flour, plus more for dusting", 
            "1/2 teaspoon kosher salt", 
            "1/2 teaspoon crushed red pepper flakes", 
            "1 tablespoon half-and-half (I used cream, because I had it on hand; suspect milk would work just as well)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/cheese-straws.jpg?w=753", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cheese", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/06/cheese-straws/", 
        "title": "cheese straws", 
        "directions": [
            "1.    Preheat oven to 350°F.", 
            "2.    In a food processor, combine the cheese, butter, flour, salt and red pepper in five 5-second pulses until the mixture resembles coarse crumbs. Add the half-and-half and process until the dough forms a ball, about 10 seconds.", 
            "3.    On a lightly floured surface, using a lightly floured rolling pin, roll the dough into an 8- by 10-inch rectangle that is 1/8-inch thick. With a sharp knife (or a pizza or pastry wheel; both worked great), cut the dough into thin 8-inch strips, each 1/4- to 1/3-inch wide (dipping the knife in flour after every few inches ensures a clean cut). Gently transfer the strips to an ungreased cookie sheet (though I lined mine with parchment), leaving at least 1/4-inch between them. The dough may sag or may break occasionally in the transfer, but don’t be concerned — just do your best. The straws can be any length, from 2 to 10 inches.", 
            "4.    Bake the straws on the middle rack for 12 to 15 minutes, or until the ends are barely browned. Remove from the oven and set the cookie sheet on a rack to cool.", 
            "5.    Serve at room temperature. Cheese straws will keep in the refrigerator, in a sealed container, for two days. They will not last an hour at a party.", 
            "Variation: One adaptation I am curious to try would be to roll these into thin, round crackers. Because they puff a bit, I’d roll them as thin as possible, and use a fork or skewer to make some holes to keep the expansion in check. If you try this, I’d love to hear how it went for you."
        ], 
        "date": "2009-06-16T15:19:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup sweetened condensed milk", 
            "1/2 cup unsweetened coconut milk", 
            "2 tablespoons salted or unsalted butter (salted will give the candy more contrast)", 
            "2 teaspoons light corn syrup", 
            "1/3 cup finely shredded unsweetened coconut (I lightly toasted mine, for crunch)", 
            "1/3 cup ground pistachios (see Note below)", 
            "1/3 cup chocolate sprinkles or “vermicelli” (see Note below)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/coconut-milk-fudge1.jpg?w=500", 
        "tags": [
            "Brazilian", 
            "Candy", 
            "Coconut", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/03/coconut-milk-fudge/", 
        "title": "coconut milk fudge", 
        "directions": [
            "In a medium-size heavy saucepan, combine condensed milk, coconut milk, butter and corn syrup. Bring to a boil over medium heat. Reduce heat to low and whisk constantly until fudgy. The recipe notes that when mixture is ready, it will pull together into one soft piece, leaving browned residue on bottom of pan and that this should take 8 to 10 minutes. This took me 20 to 25 minutes, and the candy began taking on a beige, caramelized color.", 
            "Slide mixture into a bowl. (Don’t scrape the pan; leave any residue behind.) Let cool to room temperature, then refrigerate until very firm, at least 4 hours. Or, you could realize that the nanny has to leave in an hour, chill it for only 30 and discover that nothing bad will happen if you don’t wait the whole cooling time. You’ll have to be more careful if you use “real” i.e. meltable chocolate sprinkles but otherwise it will have no ill-effect to speed the process up.) ", 
            "Scoop out teaspoonfuls of the mixture (I used my one teaspoon measure) and use your hands to roll into balls, about 3/4-inch in diameter. I found having just a drop or two of water in my palms — not wet, just a little moist — helped form them. Set aside on a baking sheet.", 
            "Place toppings in wide bowls and roll brigadeiros through them, covering the surface completely.  Store in an airtight container at room temperature for 2 days, or refrigerate for up to 1 month. Serve at room temperature.", 
            "Chocolate “vermicelli”: I got a little freaked out when I saw the ingredient list on the chocolate sprinkles I had brought home from the store. Look, I don’t need to pretend that chocolate sprinkles are health food, but I like to imagine I’m eating something with at least a minute smidgen of chocolate in it. I ended up spending way too much on a bottle of “chocolate vermicelli” (they look like chocolate sprinkles but are almost 100% pure chocolate, and delightfully, taste that way too) but I’d buy them next time from Amazon or King Arthur Flour’s Baker’s Catalog for much less.", 
            "Pistachios: Since toasted nuts always, always taste better than raw ones, I toasted and ground a batch to coat the candy only to find the brown/green shade… um, a little unpretty. Looks won out and I used ground raw pistachios in the end. I actually ended up preferring the softness of the coating.", 
            "Those tiny cups: I know someone is going to ask me where I bought those colorful little candy cups and I’m sorry, as my answer could not be more inconvenient: Vienna. A grocery store. I’m kind of obsessed with going to grocery stores in foreign countries and always walk out with random stuff like this. Anyway, Amazon sells #4 size cups (1-inch base) in brown and white; however, mine are actually #3 size (3/4 to 7/8-inch base) which I found online at a smaller store."
        ], 
        "date": "2010-03-08T13:02:22+00:00"
    }, 
    {
        "ingredient_list": [
            "Winter Warmth Syrup", 
            "1 1/2 cups water", 
            "1 cup raw, demerara or turbinado sugar (granulated will do just fine if you do not have them)", 
            "1/2 apple, peeled, cored, and diced", 
            "1/2 pear, peeled, cored, and diced", 
            "12 walnut halves", 
            "3 cinnamon sticks, broken up", 
            "6 whole cloves", 
            "1 whole nutmeg", 
            "For Each Cocktail", 
            "1 piece of orange peel (about 1 by 2 inches)", 
            "3/4 ounce Winter Warmth Syrup (recipe above)", 
            "2 dashes of bitters (Fee Brothers black walnut bitters are recommended, I used orange bitters)", 
            "2 ounces bourbon, rye or Canadian whisky"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/the-fairytale-of-new-york1.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Christmas", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/fairytale-of-new-york/", 
        "title": "fairytale of new york", 
        "directions": [
            "Make the winter warmth syrup: Combine all ingredients in a saucepan over medium heat. Bring to a simmer, stirring until the sugar dissolves, and simmer for 15 to 20 minutes. Remove from the heat and cool. Strain into a clean glass bottle, cover and refrigerate for up to 2 weeks. Makes about 2 cups.", 
            "Make a drink: Place the orange peel, syrup and bitters in a low glass and muddle. Pour in whiskey, add a large ice cube and don’t forget to share. ", 
            "Make a carafe: We brought 2 4-cup carafes of this to a party, using all of the syrup and about 5 1/2 cups bourbon. We tossed a few orange peels into each jar. Don’t forget to remind friends to pour it over ice (we forgot), so they are not asleep before, you know, Santa comes down the chimney."
        ], 
        "date": "2014-12-23T11:56:26+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups chocolate cookie crumbs or about 260 grams chocolate cookies", 
            "1 1/2 cups pecans, toasted and cooled", 
            "1/2 cup bourbon", 
            "1 cup powdered sugar", 
            "3 tablespoons unsweetened cocoa powder", 
            "1 1/2 tablespoons honey or molasses", 
            "Sprinkles, sanding or coarse sugar, additional chopped nuts, extra cookie crumbs or coconut to roll balls in"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/fudgy-bourbon-balls1.jpg?w=640", 
        "tags": [
            "Bourbon", 
            "Candy", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/12/fudgy-bourbon-balls/", 
        "title": "fudgy bourbon balls", 
        "directions": [
            "In the bowl of a food processor, pulse together the cookies, whole or already in crumbs, and pecans until the nuts are finely ground. In small dish, whisk together the bourbon, powdered sugar, cocoa and honey until smooth. Add to the food processor bowl and pulse until just combined. ", 
            "Set aside at room temperature, uncovered, for 30 minutes to 1 hour, or up to 4 hours, to give the crumbs a chance to absorb the liquid and become more fudgy and easier to roll.", 
            "Scoop dough into about 1-inch or 1 tablespoon-sized balls and roll them in toppings of your choice. The balls can be stored at room temperature or in the fridge. If at room temperature, you can leave them covered for more moisture or uncovered if you like them with more of a crust. Balls will keep for as long as you can hide them from people. ", 
            "Notes: I’m going to do a little Q&A with the comment section that lives in my head. :) "
        ], 
        "date": "2015-12-31T11:25:56+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 ripe bananas, smashed", 
            "1/3 cup (75 grams) melted salted butter", 
            "3/4 to 1 cup (145 to 190 grams) light brown sugar (depending on the level of sweetness you prefer, I always use the smaller amount)", 
            "1 egg, beaten", 
            "1 teaspoon (5 ml) vanilla", 
            "1 tablespoon (15 ml) bourbon (optional)", 
            "1 teaspoon (5 grams) baking soda", 
            "Pinch of salt", 
            "1 teaspoon (3 grams) cinnamon", 
            "Up to 1/2 teaspoon (1) nutmeg", 
            "Pinch of ground cloves", 
            "1 1/2 cups (190 grams) flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/jacked-up-banana-bread.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Bourbon", 
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/jacked-up-banana-bread/", 
        "title": "jacked-up banana bread", 
        "directions": [
            "Preheat the oven to 350°F. With a wooden spoon, mix butter into the mashed bananas in a large mixing bowl. Mix in the sugar, egg, vanilla and bourbon, then the spices. Sprinkle the baking soda and salt over the mixture and mix in. Add the flour last, mix. Pour mixture into a buttered 4×8 inch loaf pan. Bake for 50 minutes to one hour, or until a tester comes out clean. Cool on a rack. Remove from pan and slice to serve.", 
            "Note: Due to my unhealthy obsession with tiny things, I split this into two mini-loaf pans. It took 45 minutes to bake two perfect halves, but of course, may run longer or shorter in your oven."
        ], 
        "date": "2006-11-16T18:00:50+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups all-purpose flour", 
            "1 tablespoon baking powder", 
            "1 teaspoon salt", 
            "8 tablespoons (1 stick or 4 ounces) cold butter, diced", 
            "1/2 cup heavy cream", 
            "3 eggs, divided", 
            "1/4 pound sharp Cheddar cheese, diced", 
            "2 small jalapeños pepper, minced (I wimped out and used only one only to find my scones entirely heat-free)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/jalapeno-cheddar-scones.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Cheese", 
            "Peppers", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2009/10/jalapeo-cheddar-scones/", 
        "title": "jalapeño-cheddar scones", 
        "directions": [
            "Preheat oven to 400°F. In a small skillet, melt 1/2 tablespoon of butter and sauté the jalapeños in it until soft, about two minutes. Let them cool, then place them in a small bowl with the cheddar cheese and coat them with one tablespoon of the flour. Combine the remaining flour with the baking powder and salt. Cut in the remaining butter with a pastry blender, fork or two knives, until the butter bits are pea sized.", 
            "Lightly whip two of the eggs and cream and add to the flour-butter mixture. Using a wooden spoon, fold mixture until it begins to come together. Add the cheddar-jalapeño mixture to the dough and mix until everything is incorporated.", 
            "Turn out the dough onto a well-floured surface and knead gently for less than one minute. Pat dough out to a 3/4- to 1-inch thickness and either cut into 8 triangles or the shape of your choice with a biscuit cutter. Make an egg wash by beating the remaining egg with a teaspoon of water. Brush the scones with egg wash and place on a parchment-lined (or well-oiled) baking sheet. Bake for 25 minutes or until golden brown.", 
            "Scones are always best the first day.", 
            "Want to flash-freeze yours, as I did? Brief directions, here."
        ], 
        "date": "2009-10-15T13:41:15+00:00"
    }, 
    {
        "ingredient_list": [
            "Base and lattice", 
            "4 1/2 cups (1 pound or 455 grams) shelled walnuts", 
            "3 cups (375 grams) all-purpose flour", 
            "2 teaspoons ground cinnamon", 
            "1/2 teaspoon ground cloves (I halved this, using only 1/4 teaspoon)", 
            "1/4 to 1/2 teaspoon table salt (Heatter says 1/4, I really prefer this with 1/2)", 
            "2 1/2 sticks (10 ounces or 285 grams) cold, unsalted butter, cut into chunks", 
            "1 2/3 cup (330 grams) granulated sugar", 
            "1 egg plus 1 egg yolk", 
            "Finely grated zest of 1 lemon", 
            "Filling", 
            "1/4 cup (about 20 to 25 grams) fine, dry breadcrumbs", 
            "2 cups (about 575 grams) seedless raspberry jam", 
            "To finish", 
            "1 egg yolk", 
            "1 teaspoon water", 
            "2/3 to 1 cup (75 to 115 grams) to slivered almonds (julienne-shaped pieces) (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/linzer-torte1.jpg?w=640", 
        "tags": [
            "Austrian", 
            "Christmas", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/12/linzer-torte/", 
        "title": "linzer torte", 
        "directions": [
            "Make base: Heat oven to 400 degrees. Butter two 9-inch round layer cake pans (preferably with removable bottoms if you plan to serve this in wedges, like a cake), two 8-inch square pans (what I used, then cut each into square bars, like cookies), one 9×13-inch rectangular pan (again, for bar cookies) or one 11- to 12-inch round cake pan (again ideally with a removable bottom). Line the bottom of each with a piece of parchment paper cut to fit, then butter then paper. ", 
            "In a food processor, process walnuts and 1/2 cup of the flour (reserve remaining 2 1/2 cups for next step) for 15 seconds, or until the nuts are finely ground but have not formed a paste. ", 
            "Place remaining 2 1/2 cups flour, cinnamon, cloves and salt in a large, wide-ish mixing bowl. With a pastry blender, work the butter into the dry mixture until it forms coarse crumbs. Stir in the sugar and walnut-flour mixture. In a small dish, beat the whole egg, yolk, and lemon rind utnil combined, and stir into crumb mixture. Stir the mixture in as best as you can with a spoon, then work the rest in with your hands. Knead the dough a few times inside the bowl until a cohesive mass, one that holds together, forms. ", 
            "Divide dough into quarters if making two tortes, or halves if making one.", 
            "Place one portion into the bottom of each pan, and press evenly and firmly over the bottoms and then about 1 1/4 to 1 1/2 inches up the sides with your fingers. Don’t worry about making it smooth or level on the sides; it gets filled in later.", 
            "Bake shell(s) for 15 minutes, or until it barely begins to color at the edges.", 
            "While the shell(s) bakes, roll remaining piece(s) of dough between two pieces of waxed paper, until 1/4- to 3/8-inch in thickness one inch bigger than your pan size. [I.e., for each 9-inch round torte, you’ll want a 10-inch diameter circle; for each 8-inch square torte, a 9-inch square, etc.] Transfer to freezer until the dough is well-chilled, about 20 minutes.", 
            "Remove shell(s) from oven and let cool slightly; reduce baking temperature to 350 degrees. ", 
            "Make filling: If you’re using panko or another coarse dry breadcrumb, you can pulse it in a food processor until it is fine powder. I found I needed almost double the volume in panko (7 tablespoons) to yield 1/4 cup of a fine breadcrumb powder.", 
            "Sprinkle 2 tablespoons finely ground breadcrumbs over each par-baked shell, or all 1/4 cup over your single large one. If jam is not already soft, stir it until it is, then spread 1 cup over each shell. Cut dough(s) into 1/2- to 3/4-inch wide strips, cutting through the bottom of the waxed paper at the same time. Lift each strip-and-waxed paper over the jam and reverse it onto the jam, then peel off waxed paper. Cut the ends of the dough by pressing them onto the sides of the pan. Arrange strips 1/2- to 3/4-inch apart, crisscrossing them on an angle to make a lattice top with diamond-shaped openings. [Note: I neither “wove” my lattice or ended up making “diamond-shaped” openings. Oops.] Use leftover pieces to fill in any gaps between lattice-strips and tall sides of shells. The two doughs will blend together in the oven. ", 
            "To finish: Mix egg yolks and water. Brush it all over lattice top and border. Sprinkle with almonds, if using. (I prefer to use 1/3 cup per smaller torte, instead of the 1/2 cup Heatter recommends. I only sprinkled them on one.) Bake torte(s) for 45 to 60 minutes (Heatter recommends 60, I find it perfect, but ovens and baking pans vary, check yours sooner if you’re nervous), until crust and almonds on top are well-browned. ", 
            "Remove from oven and place on racks. If you’ve baked it in a cake pan and wish to serve it as a “cake,” i.e. in wedges, Heatter recommends that you remove it from the pan while still warm by cutting around the torte carefully (the crust is very fragile) with a small, sharp knife and loosening the torte in the pan, before reversing it onto a cooling rack, and then back again onto another rack to finish cooling. If using a pan with a removable base, you should safely be able to remove it once it has fully cooled. Personally, I had no trouble letting my cool fully in the square pan but the first square did not come out cleanly. ", 
            "Once fully cool, Heatter recommends you let the tortes stand overnight (covered with foil) before serving for best flavor. You can decorate the tortes with powdered sugar before serving in wedges or squares. "
        ], 
        "date": "2013-12-13T12:34:39+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick) unsalted butter, plus more for casserole", 
            "6 slices white bread, crusts removed, torn into 1/4- to l/2-inch pieces", 
            "5 1/2 cups milk", 
            "1/2 cup all-purpose flour", 
            "2 teaspoons coarse salt, plus more for water", 
            "1/4 teaspoon ground nutmeg", 
            "1/4 teaspoon freshly ground black pepper", 
            "1/4 teaspoon cayenne pepper", 
            "4 1/2 cups (about 18 ounces) grated sharp white cheddar cheese", 
            "2 cups (about 8 ounces) grated Gruyère or 1 1/4 cups (about 5 ounces) grated Pecorino Romano cheese", 
            "1 pound elbow macaroni"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/marthas-macaroni-cheese1.jpg?w=640", 
        "tags": [
            "Cheese", 
            "Freezer Friendly", 
            "Pasta", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/05/marthas-macaroni-and-cheese/", 
        "title": "martha’s macaroni-and-cheese", 
        "directions": [
            "1. Preheat oven to 375°F. Butter a 3-quart casserole dish; set aside. Place the bread in a medium bowl. In a small saucepan over medium heat, melt 2 tablespoons butter. Pour the melted butter into the bowl with the bread, and toss. Set the breadcrumbs aside.", 
            "2. Warm the milk in a medium saucepan over medium heat. Melt the remaining 6 tablespoons butter in a high-sided skillet over medium heat. When the butter bubbles, add the flour. Cook, stirring, 1 minute.", 
            "3. While whisking, slowly pour in the hot milk a little at a time to keep mixture smooth. Continue cooking, whisking constantly, until the mixture bubbles and becomes thick, 8 to 12 minutes.", 
            "4. Remove the pan from the heat. Stir in salt, nutmeg, black pepper, cayenne pepper, 3 cups cheddar cheese, and 1 1/2 cups Gruyère (or 1 cup Pecorino Romano); set the cheese sauce aside.", 
            "5. Cover a large pot of salted water, and bring to a boil. Cook the macaroni until the outside of pasta is cooked and the inside is underdone, 2 to 3 minutes. Transfer the macaroni to a colander, rinse under cold running water, and drain well. Stir the macaroni into the reserved cheese sauce.", 
            "6. Pour the mixture into the prepared dish. Sprinkle the remaining 1 1/2 cups cheddar cheese, 1/2 cup Gruyère (or 1/4 cup Pecorino Romano), and the breadcrumbs over the top. Bake until golden brown, about 30 minutes (though we needed a bit more time to get it brown, but your oven may vary). Transfer the dish to a wire rack for 5 minutes; serve."
        ], 
        "date": "2008-05-07T11:15:54+00:00"
    }, 
    {
        "ingredient_list": [
            "5 cups of a mixture of whole milk and half-and-half (4:1 is suggested, but I might go more like 3:2 next time)", 
            "1 1/2 cups bourbon, another whiskey or brandy", 
            "1 cup powdered sugar, sifted", 
            "1 tablespoon vanilla extract", 
            "Freshly grated nutmeg, for garnish."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/12/milk-punch.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2010/12/milk-punch/", 
        "title": "milk punch", 
        "directions": [
            "In a pitcher, whisk together milk, half-and-half, bourbon, sugar and vanilla. Freeze until slushy, which will take 3 to 4 hours, but you can leave it in there up to a day. Stir before serving it in chilled glasses, finished with a few gratings of fresh nutmeg."
        ], 
        "date": "2010-12-31T17:52:35+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons (30 grams) unsalted butter", 
            "2 tablespoons (15 grams) all-purpose flour", 
            "3/4 cup (175 ml) milk, ideally whole but lowfat should work", 
            "A few gratings fresh nutmeg", 
            "Salt and black pepper to taste", 
            "1 tablespoon (15 grams) smooth Dijon mustard", 
            "1 1/2 pounds (680 grams) fresh mushrooms (cremini, white or a mix of wild all work), thinly sliced", 
            "Olive oil and butter as needed", 
            "2 teaspoons minced mixed fresh herbs such as rosemary, thyme and sage", 
            "Salt and black pepper to taste", 
            "1 pound loaf of a hearty white or whole wheat sourdough bread, in 3/4-inch slices", 
            "8 ounces (225 grams) coarsely grated gruyere or comte", 
            "Chopped fresh flat-leaf parsley, to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/mushroom-tartines.jpg?w=750", 
        "tags": [
            "Cheese", 
            "Mushrooms", 
            "Photo", 
            "Put An Egg On It", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/03/mushroom-tartines/", 
        "title": "mushroom tartines", 
        "directions": [
            "Make the sauce: In a large skillet (so you can use it again for the mushrooms), melt butter over medium heat and then stir in flour until a paste forms. Very slowly drizzle in milk, whisking the whole time to keep the mixture smooth. Add nutmeg, salt and pepper and cook, stirring, until mixture has simmered for a couple minutes. It will be thick and get thicker as it cools; this makes for a better spread. Scrape into a bowl and stir in Dijon. Adjust seasonings if needed. Set aside.\nHeat oven: To 425 degrees F. Line your largest baking sheet with foil.\n\nCook the mushrooms: Wipe out skillet and heat over medium-high. Add a glug of olive oil or a mix of olive oil and butter. Once it is very hot, add 1/3 to 1/2 of mushrooms, 1/3 to 1/2 of herbs and let sear in pan until brown underneath, about 2 to 3 minutes, before stirring and continuing to cook until tender and any liquid in the pan has cooked off, about 5 minutes. Season well with salt and pepper. Repeat with remaining mushrooms.", 
            "Assemble and bake: Spread bread in one layer on prepared baking sheet. Schmear each all the way to the edges with sauce; you should have exactly enough for a thin coat on each. Heap each slice with mushrooms; use them all. Sprinkle cheese over and since the mushrooms are heaped so high, you’ll probably have to press it in a bit with your hand. You’ll be glad you got all the cheese on there.", 
            "Bake for 10 minutes, until cheese is melted all over, then transfer to the broiler and cook until tops are browned, a few minutes more (but keep an eye on it because broilers vary wildly and mine is rather weak).", 
            "To serve: Scatter with parsley and eat with a knife and fork, preferably with a big green salad on the side."
        ], 
        "date": "2017-03-29T12:21:56+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup granulated (50 grams) or powdered (30 grams) sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "6 tablespoons (85 grams) unsalted butter", 
            "1/3 cup dark brown sugar", 
            "1/3 cup granulated sugar", 
            "1 large egg", 
            "1 large egg yolk", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 tablespoon bourbon (optional)", 
            "1 teaspoon vanilla extract", 
            "6 tablespoons all-purpose flour", 
            "3/4 cup (4 1/2 ounces or 130 grams) chocolate chips or chopped chocolate", 
            "3/4 cup toasted (always) and coarsely chopped walnuts or pecans", 
            "Flaky sea salt on top, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/not-derby-pie-bars1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Bourbon", 
            "Chocolate", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2015/04/not-derby-pie-bars/", 
        "title": "not derby pie bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. A little nonstick spray underneath helps keep the strips in place. (If you have an 8-inch square springform, you can skip this and just butter it lightly.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take another 30 seconds for it to come together, but it will. Transfer the dough clumps to prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. Meanwhile, prepare the filling.", 
            "Make the filling: Melt your butter and, if desired, brown it too, by continuing to cook the butter in a small saucepan over medium heat, stirring frequently, until golden brown bits form at the bottom, about 5 minutes. Transfer butter to a large bowl and let it cool; you can hasten this along by setting it in the freezer for a couple minutes or stirring it over an ice water bath.", 
            "Whisk sugars into butter until smooth, then egg, (edited to add) yolk, salt, bourbon (if using) and vanilla. Stir in flour until just combined, then mix in chocolate and nuts. Pour over par-baked crust, spreading evenly. Sprinkle lightly with sea salt before baking, if desired. ", 
            "Bake bars: For 20 to 25 minutes, until top is firm and golden. Bars are much easier to cut if you let them cool almost completely, but I suspect there’s little fun in that. Once they’re cool, however, you can easily transfer them from the pan to a cutting board with the parchment paper sling you created. Serve plain, with whipped cream or a tiny scoop of vanilla ice cream. Can dust with powdered sugar for extra pretties. ", 
            "Store at room temperature for up to 3 days, or in the fridge for longer."
        ], 
        "date": "2015-04-30T12:00:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour, more as needed", 
            "1/2 teaspoon salt", 
            "1/2 cup finely grated fresh Parmesan cheese (alternate: I think Romano could also work well here)", 
            "4 tablespoons unsalted butter", 
            "1/4 cup cream or half-and-half, more as needed", 
            "Coarse salt, pepper, sesame or poppy seeds or whatever you like for sprinkling (optional)."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/parmesan-cream-crackers1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cheese", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/12/parmesan-cream-crackers/", 
        "title": "parmesan cream crackers", 
        "directions": [
            "Heat oven to 400°F. Line a baking sheet with parchment paper or lightly dust with flour. Put flour, salt, cheese and butter in bowl of a food processor. Pulse until flour and butter are combined. Add about 1/4 cup cream or half-and-half and let machine run for a bit until a dough forms. If it does not come together, add more liquid a teaspoon at a time, until mixture holds together but is not sticky. (I only needed the ingredient levels as listed to pull the dough together.)", 
            "Roll out dough on a lightly floured surface until 1/4-inch thick or even thinner, adding flour as needed. From here, you can either form them into individual crackers (I went for 1 1/2-inch squares cut with a fluted pastry wheel) and bake them an inch apart on your baking sheet (the method I used) or transfer the entire rolled-out sheet to your baking sheet (draping it over the rolling pin will make it easier) and score them lightly with a knife, pizza or pastry wheel to break into crackers after they are baked. For either method, dock all over with a fork and sprinkle with salt or any other toppings you are using.", 
            "Bake until moderately browned, about 12 minutes. Cool on a rack; serve warm or at room temperature or store in a tin for a few days.", 
            "Note: Mine were the most crisp before they’d been kept in a container. If you’re baking them less than a day in advance, I think they can be left uncovered to maintain their best texture."
        ], 
        "date": "2009-12-27T23:05:19+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups whole milk", 
            "1 cup heavy cream (see Note above about using less)", 
            "1/2 teaspoon coarse sea salt", 
            "3 tablespoons freshly squeezed lemon juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/06/rich-homemade-ricotta.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cheese", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/06/rich-homemade-ricotta/", 
        "title": "rich homemade ricotta", 
        "directions": [
            "Pour the milk, cream and salt into a 3-quart nonreactive saucepan. Attach a candy or deep-fry thermometer. Heat the milk to 190°F, stirring it occasionally to keep it from scorching on the bottom. Turn off the heat [Updated] Remove from heat and add the lemon juice, then stir it once or twice, gently and slowly. Let the pot sit undisturbed for 5 minutes.", 
            "Line a colander with a few layers of cheesecloth and place it over a large bowl (to catch the whey). Pour the curds and whey into the colander and let the curds strain for at least an hour. At an hour, you’ll have a tender, spreadable ricotta. At two hours, it will be spreadable but a bit firmer, almost like cream cheese. (It will firm as it cools, so do not judge its final texture by what you have in your cheesecloth.) Discard the whey, or, if you’re one of those crafty people who use it for other things, of course, save it. Eat the ricotta right away or transfer it to an airtight container and refrigerate until ready to use.", 
            "Serve: On 1/2-inch slices of baguette that have been run under the broiler until lightly bronzed. Serve it simply [as shown in the top photo, left to right] with honey and a pinch of flaky sea salt, a couple grinds of black pepper, pinch of salt and drizzle of olive oil, and/or a few droplets of an aged balsamic. Or with zucchini ribbons [as shown in the last photo], I started with about half a pound of miniature zucchini my mother-in-law had found at Trader Joes. Larger ones will work just fine, but you might want to first cut a big one in half lengthwise. Peel them into ribbons and toss them with 1/4 teaspoon of salt and let them drain in a colander for a while (this wilts them), about 20 minutes. Rinse and pat them dry. Toss with lemon juice, olive oil, salt and black pepper to taste. Arrange in piles on ricotta crostini.", 
            "Do ahead: I keep mine only 3 to 4 days; the really fresh milk I used doesn’t last long. However, Salvatore also uses really fresh milk, and theirs appears to keep closer to two weeks. In conclusion? Shelf lives will vary. Use your nose to judge freshness. Or your partner’s nose, because who doesn’t like hearing “Hey honey, sniff this for me?”"
        ], 
        "date": "2011-06-18T09:48:36+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/the-perfect-manhattan1.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Fall", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/09/the-perfect-manhattan/", 
        "title": "the perfect manhattan", 
        "directions": [
            "Add rye, vermouths and bitters to a cocktail shaker with ice and stir (if you want to be uber-traditional about it) or shake them together. Strain ice as you pour into a rocks or martini glass, or pour ice and drink into a tumbler. Garnish and enjoy slowly because this is bonkers potent.", 
            "Rye vs. bourbon and other whiskeys from a non-expert, i.e. corrections welcome: American rye whiskey must be distilled from at least 51% rye, but rye does not, by definition, have to be made in America. Canada produces a lot of rye whiskey, but by their own regulations. Bourbon must be distilled from at least 51% corn. It must be made in America and is most often made in Kentucky. Tennessee whiskey, basically bourbon whiskey from Tennessee, uses something called the Lincoln County Process in which whiskey, after it is distilled, is filtered through sugar-maple charcoal, making it amazing. American rye tends to be more dry and spicy than bourbon, which is fuller in body with a vanilla/caramel vibe. Rye is more traditional in the Manhattan cocktail, largely because Manhattan was a rye town when the drink was hatched in the late 1800s. How did I do? ", 
            "Angostura vs. peychauds vs. orange bitters: Angostura, traditional for the Manhattan, is made from a secret recipe, and is quite aromatic. Peychauds, slightly spicier and more sweet, is a great second choice (and what I used instead). Orange bitters are not traditional, but I think taste great in an Manhattan, although giving it more of an old-fashioned vibe."
        ], 
        "date": "2015-09-25T11:26:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup freshly squeezed lemon juice (with an efficient squeezer, you should get this plus up to 1/3 cup extra from 2 pounds of 8 lemons)", 
            "2 1/2 cups cold water, plus additional if needed", 
            "1/4 to 1/2 cup maple syrup", 
            "Bourbon", 
            "Lots of ice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/5719436567_ffb51c3a26_b.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Citrus", 
            "Drinks", 
            "Lemon", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2011/05/vermontucky-lemonade/", 
        "title": "vermontucky lemonade", 
        "directions": [
            "Mix lemon juice with 2 1/2 cups water and 1/4 cup maple syrup. Taste for sweetness. If you like your lemonade sweeter, add remaining 1/4 cup maple syrup. If you found the sweetness just right, add an additional 1/4 cup cold water instead. Stir to mix. This will yield 1 quart of maple lemonade.", 
            "Fill a glass with ice. We have a fiery debate at my house about whether this drink needs 1 or 1 1/2 shots of bourbon; my husband prefers more, but I like this drink a bit weaker. I’ll let you choose. Pour your desired amount of bourbon over the ice, fill the glass the rest of the way with maple lemonade and let the force of summer be with you."
        ], 
        "date": "2011-05-14T18:17:20+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces goat milk Gouda, coarsely grated*", 
            "4 ounces fresh goat cheese, softened", 
            "1 tablespoon all-purpose flour", 
            "1 large egg", 
            "1/4 cup Panko** breadcrumbs", 
            "1/2 teaspoon coarse or sea salt", 
            "Olive oil, for frying", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/warm-crisp-and-a-little-melty-salad-croutons1.jpg?w=500", 
        "tags": [
            "Cheese", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/05/warm-crisp-and-a-little-melty-salad-croutons/", 
        "title": "warm, crisp and a little melty salad croutons", 
        "directions": [
            "Mash together cheeses in a bowl, mixing until combined. Form the mixture into four balls then smoosh each slightly into thick patties. Arrange three small dishes for dredging stations: Place the flour in the first one, beat the egg lightly in the second, and mix the breadcrumbs and salt in the last one. Heat a healthy slick of olive oil (the original recipe suggested 3 tablespoons; in a tiny skillet, I used closer to 2) in a small skillet over medium heat. Once hot, fry each patty until golden and crispy, about two minutes per side. It’s going to get melty (I’m not sorry) and seem pesky to flip once warm. I found using two forks made this easy-peasy. Briefly pause the crouton on paper towels to drain excess oil, before landing it on top of your salad of choice, then finish the whole thing with freshly ground black pepper. Repeat with remaining croutons. Eat at once. ", 
            "* Gouda, a Dutch cheese, is traditionally made with cow’s milk. You can buy it young (smooth, semi-firm and mild flavored), or aged (harder, darker, stronger-flavored with crunchy flecks), smoked, light, and even more ways. However, if you can find the goat milk gouda suggested here, perfect for goat cheese-phobes, it’s really amazing in these croutons, absolutely worth swinging by a cheese shop or grocery store with a great cheese counter for. (It’s also sold online from a variety of stores.) If you cannot get it, you could replace the gouda with another semi-firm cheese good for grating and melting, like a young cow’s milk gouda, gruyere, etc.", 
            "** If you can’t find or don’t want to buy Panko, here’s how I fake it: Preheat oven to 350 degrees. Tear one to two slices of soft, crustless white bread into 1-inch pieces and pulse them in the food processor until coarsely ground. This will make a generous half cup. Transfer crumbs to a rimmed baking sheet and bake until just barely golden brown and dry, about 15 minutes, stirring occasionally. Cool. Use."
        ], 
        "date": "2012-05-11T14:13:44+00:00"
    }, 
    {
        "ingredient_list": [
            "6 ounces (1 1/2 cups coarsely grated) sharp cheddar, orange if you can find one you like", 
            "4 tablespoons (2 ounces or 57 grams) butter", 
            "1/2 cup (2 1/2 ounces or 62 grams) whole wheat flour", 
            "1/4 cup (1 1/8 ounces or 31 grams) all-purpose flour", 
            "1/8 teaspoon onion powder", 
            "1/8 to 1/4 teaspoon table salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/03/whole-wheat-goldfish-crackers.jpg?w=750", 
        "tags": [
            "Cheese", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2011/03/whole-wheat-goldfish-crackers/", 
        "title": "whole wheat goldfish crackers", 
        "directions": [
            "Preheat oven to 350°F. Combine all ingredients in a food processor, running the machine until the dough forms a ball, about two minutes.", 
            "If the dough feels warm or worrisome-ly soft, wrap it in waxed paper or plastic wrap and chill it in the fridge for 30 to 45 minutes. This also makes it easier to transfer shapes once they are rolled out.", 
            "On a lightly floured surface, using a lightly floured rolling pin, roll the dough out 1/8-inch thick. Form shapes with a cookie cutter, dipping it in flour from time to time to ensure a clean cut. Gently transfer crackers to an ungreased (though mine were parchment-lined, because they are in despicable shape) cookie sheet with a 1/2 inch between them. Bake the crackers on the middle rack for 12 to 15 minutes, or until they are barely browned at the edges. Remove from the oven and set the cookie sheet on a rack to cool.", 
            "Tiny Goldfish Cookie Cutter: I bought mine here."
        ], 
        "date": "2011-03-03T15:53:44+00:00"
    }
]