{
  "date": "2015-04-30T12:00:22+00:00",
  "directions": [
    "Heat oven to 350°F (175°C). Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. A little nonstick spray underneath helps keep the strips in place. (If you have an 8-inch square springform, you can skip this and just butter it lightly.)",
    "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take another 30 seconds for it to come together, but it will. Transfer the dough clumps to prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. Meanwhile, prepare the filling.",
    "Make the filling: Melt your butter and, if desired, brown it too, by continuing to cook the butter in a small saucepan over medium heat, stirring frequently, until golden brown bits form at the bottom, about 5 minutes. Transfer butter to a large bowl and let it cool; you can hasten this along by setting it in the freezer for a couple minutes or stirring it over an ice water bath.",
    "Whisk sugars into butter until smooth, then egg, (edited to add) yolk, salt, bourbon (if using) and vanilla. Stir in flour until just combined, then mix in chocolate and nuts. Pour over par-baked crust, spreading evenly. Sprinkle lightly with sea salt before baking, if desired. ",
    "Bake bars: For 20 to 25 minutes, until top is firm and golden. Bars are much easier to cut if you let them cool almost completely, but I suspect there’s little fun in that. Once they’re cool, however, you can easily transfer them from the pan to a cutting board with the parchment paper sling you created. Serve plain, with whipped cream or a tiny scoop of vanilla ice cream. Can dust with powdered sugar for extra pretties. ",
    "Store at room temperature for up to 3 days, or in the fridge for longer."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/not-derby-pie-bars1.jpg?w=750",
  "ingredient_list": [
    "Crust",
    "1 cup (125 grams) all-purpose flour",
    "1/4 teaspoon fine sea or table salt",
    "1/4 cup granulated (50 grams) or powdered (30 grams) sugar",
    "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine",
    "Filling",
    "6 tablespoons (85 grams) unsalted butter",
    "1/3 cup dark brown sugar",
    "1/3 cup granulated sugar",
    "1 large egg",
    "1 large egg yolk",
    "1/4 teaspoon coarse or kosher salt",
    "1 tablespoon bourbon (optional)",
    "1 teaspoon vanilla extract",
    "6 tablespoons all-purpose flour",
    "3/4 cup (4 1/2 ounces or 130 grams) chocolate chips or chopped chocolate",
    "3/4 cup toasted (always) and coarsely chopped walnuts or pecans",
    "Flaky sea salt on top, if desired"
  ],
  "tags": [
    "Bars",
    "Bourbon",
    "Chocolate",
    "Photo",
    "Picnics",
    "Tarts/Pies"
  ],
  "title": "not derby pie bars",
  "url": "https://smittenkitchen.com/2015/04/not-derby-pie-bars/"
}