{
  "date": "2008-09-26T15:44:26+00:00",
  "directions": [
    "1. In a large bowl, dissolve yeast and 1 tablespoon (13 grams) sugar in water; set aside for 5 minutes until a bit foamy.",
    "2. Whisk oil into yeast, then beat in 4 eggs, one at a time, with remaining 1/2 cup (100 grams) sugar and salt. Gradually add flour. When dough holds together, it is ready for kneading. (You can also use a mixer with a dough hook for both mixing and kneading, but be careful if using a standard size KitchenAid–it’s a bit much for it, though it can be done.)",
    "3. Turn dough onto a floured surface and knead until smooth. Clean out bowl and grease it, then return dough to bowl. Cover with plastic wrap, and let rise in a warm place for 1 hour, until almost doubled in size. Dough may also rise in an oven that has been warmed to 150 degrees then turned off. Punch down dough, cover and let rise again in a warm place for another half-hour.",
    "4. At this point, you can knead the raisins into the challah, if you’re using them, before forming the loaves. To make a 6-braid challah, either straight or circular*, take half the dough and form it into 6 balls. With your hands, roll each ball into a strand about 12 inches long and 1 1/2 inches wide. Place the 6 in a row, parallel to one another. Pinch the tops of the strands together. Move the outside right strand over 2 strands. Then take the second strand from the left and move it to the far right. Take the outside left strand and move it over 2. Move second strand from the right over to the far left. Start over with the outside right strand. Continue this until all strands are braided. For a straight loaf, tuck ends underneath. For a circular loaf, twist into a circle, pinching ends together. Make a second loaf the same way. Place braided loaves on a greased cookie sheet with at least 2 inches in between.",
    "5. Beat remaining egg and brush it on loaves. Either freeze breads or let rise another hour.",
    "6. If baking immediately, preheat oven to 375 degrees and brush loaves again. Sprinkle bread with seeds, if using. If freezing, remove from freezer 5 hours before baking.",
    "7. Bake in middle of oven for 30 to 40 minutes, or until golden. (If you have an instant read thermometer, you can take it out when it hits an internal temperature of 190 degrees.) Cool loaves on a rack.",
    "Note: Any of the three risings can be done in the fridge for a few hours, for more deeply-developed flavor. When you’re ready to work with it again, bring it back to room temperature before moving onto the next step.",
    "Round or straight braid? Raisins or skip them? Straight loaves of braided challah are eaten throughout the year–typically on the Sabbath–round challahs, often studded with raisins, are served for the New Year and the other High Holidays that follow. I made one of each, so you could see examples. ",
    "* These days, we make round woven challahs with this much easier technique. Do check it out!"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/best-challah-egg-bread1.jpg?w=640",
  "ingredient_list": [
    "3 3/4 teaspoons active dry yeast (about 1 1/2 packages, 3/8 ounces or 11 grams)",
    "1 tablespoon (13 grams) granulated sugar",
    "1 3/4 cups lukewarm water",
    "1/2 cup (118 ml) olive or vegetable oil, plus more for greasing the bowl",
    "5 large eggs",
    "1/2 cup (100 grams) granulated sugar",
    "1 tablespoon (14 grams) table salt",
    "8 to 8 1/2 cups (1000 to 1063 grams) all-purpose flour",
    "1/2 cup raisins (about 70 grams) per challah, if using, plumped in hot water and drained",
    "Poppy or sesame seeds for sprinkling."
  ],
  "tags": [
    "Bread",
    "Jewish",
    "Photo"
  ],
  "title": "best challah (egg bread)",
  "url": "https://smittenkitchen.com/2008/09/best-challah-egg-bread/"
}