{
  "date": "2009-05-04T12:58:18+00:00",
  "directions": [
    "1. Day one: To make the sponge, stir the yeast into the flour in a 4-quart mixing bowl. Add the water, whisking or stirring only until it forms a smooth, sticky batter (like pancake batter). Cover the bowl with plastic wrap and leave at room temperature for approximately 2 hours, or until the mixture becomes very foamy and bubbly. It should swell to nearly double in size and collapse when the bowl is tapped on the countertop.",
    "2. To make the dough, in the same mixing bowl (or in the bowl of an electric mixer), add the additional yeast to the sponge and stir. Then add 3 cups of the flour, cinnamon, sugar, salt and malt. Stir (or mix on low speed with the dough hook) until the ingredients form a ball, slowly working in the remaining 3/4 cup flour to stiffen the dough. In the last two minutes of mixing, add the raisins. (I ended up adding a bit of flour with them, as mine were still wet and made the dough a little sticky.)",
    "3. Transfer the dough to the counter and knead for at least 10 minutes (or for 6 minutes by machine). The dough should be firm, stiffer than French bread dough, but still pliable and smooth. There should be no raw flour – all ingredients should be hydrated. The dough should 77 to 71°F. If the dough seems too dry and rips, add a few drops of water and continue kneading. If the dough seems tacky or sticky, add more flour to achieve the stiffness required. The kneaded dough should feel satiny and pliable but not be tacky.",
    "4. Immediately divide the dough into 12 (4 1/2 ounce) pieces for super sized bagels, 16 (3.375 ounce) regular-sized bagels, or 24 (2.25 ounce) perfectly smaller bagels. Form the pieces into rolls.",
    "5. Cover the rolls with a damp towel and allow them to rest for approximately 20 minutes.",
    "6. Line 2 sheet pans with baking parchment and mist lightly with spray oil. Poke a hole in a ball of bagel dough and gently rotate your thumb around the inside of the hole to widen it to approximately 2 1/2 inches in diameter for a supersized bagel, two inches for a large one or just slightly more than one inch for a miniature. The dough should be as evenly stretched as possible (try to avoid thick and thin spots.)",
    "7. Place each of the shaped pieces two inches apart on the pans. Mist the bagels very lightly with the spray oil and slip each pan into a food-grade plastic bag, or cover loosely with plastic wrap. Let the pans sit at room temperature for about 20 minutes.",
    "8. Check to see if the bagels are ready to be retarded in the refrigerator by using the “float test”. Fill a small bowl with cool or room-temperature water. The bagels are ready to be retarded when they float within 10 seconds of being dropped into the water. Take one bagel and test it. If it floats, immediately return the tester bagel to the pan, pat it dry, cover the pan, and place it in the refrigerator overnight (it can stay in the refrigerator for up to 2 days). If the bagel does not float. Return it to the pan and continue to proof the dough at room temperature, checking back every 10 to 20 minutes or so until a tester floats. The time needed to accomplish the float will vary, depending on the ambient temperature and the stiffness of the dough.",
    "9. The following day (or when you are ready to bake the bagels, see head notes), preheat the oven to 500°F with the two racks set in the middle of the oven. Bring a large pot of water to a boil (the wider the pot the better), and add the baking soda. Have a slotted spoon or skimmer nearby.",
    "10. Remove the bagels from the refrigerator and gently drop them into the water, boiling only as many as comfortably fit (they should float within 10 seconds). After 1 minute, flip them over and boil for another minute. If you like very chewy bagels, you can extend the boiling to 2 minutes per side. While the bagels are boiling, sprinkle the same parchment-lined sheet pans with cornmeal or semolina flour. (If you decide to replace the paper, be sure to spray the new paper lightly with spray oil to prevent the bagels from sticking to the surface.) ",
    "11. When all the bagels have been boiled, place the pans on two middle shelves in the oven. Bake for approximately five minutes, then rotate the pans, switching shelves and giving the pans a 180-degree rotation. (If you are baking only one pan, keep it on the center shelf but still rotate 180 degrees.) After the rotation, lower the oven setting to 450°F and continue baking for about 5 minutes, or until the bagels turn light golden brown. You may bake them darker if you prefer.",
    "12. Remove the pans from the oven and let the bagels cool on a rack for 15 minutes or longer before serving. Optionally, when they come out of the oven and are still hot, you can brush the tops with the melted butter and dip them in cinnamon sugar to create a cinnamon-sugar crust, if desired. But who’d want to eat something like that?"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cinnamon-raisin-bagels1.jpg?w=500",
  "ingredient_list": [
    "Sponge",
    "1 teaspoon instant yeast",
    "4 cups unbleached high-gluten or bread flour",
    "2 1/2 cups water, room temperature",
    "Dough",
    "1 teaspoon instant yeast",
    "3 3/4 cups unbleached high-gluten or bread flour",
    "1 tablespoon ground cinnamon",
    "5 tablespoons sugar",
    "2 3/4 teaspoons salt",
    "2 teaspoons malt powder or 1 tablespoon dark or light malt syrup, honey, or brown sugar",
    "2 cups loosely packed raisins, rinsed with warm water to remove surfact sugar, acid, and natural wild yeast",
    "To Finish",
    "1 tablespoon baking soda",
    "Cornmeal or semolina flour for dusting",
    "Melted butter for brushing (optional)",
    "Cinnamon sugar for sprinkling (optional)"
  ],
  "tags": [
    "Bread",
    "Jewish",
    "Photo"
  ],
  "title": "cinnamon raisin bagels",
  "url": "https://smittenkitchen.com/2009/05/cinnamon-raisin-bagels/"
}