[
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-and-honey-challah1.jpg?w=500", 
        "tags": [
            "Apple", 
            "Bread", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/09/apple-and-honey-challah/", 
        "title": "apple and honey challah", 
        "directions": [
            "Make your dough: Whisk yeast and 1 teaspoon honey into 2/3 cup warm water and let stand until foamy, a few minutes.", 
            "With a stand mixer: In the bowl of a stand mixture, whisk together yeast mixture, oil, remaining honey (1/3 cup), eggs and yolk. Switch to dough hook and add 4 1/4 cups flour and salt. Use dough hook on a moderate speed until it pulls all of the flour and wet ingredients together into a craggy mass. Lower the speed and let the dough hook knead the dough for 5 minutes, until smooth, elastic and a little sticky.", 
            "By hand:: In a large bowl, whisk together yeast mixture, oil, remaining honey (1/3 cup), eggs and yolk. Add flour all at once and stir with a wooden spoon until you get a craggy mass of uneven dough. Turn dough out onto a floured counter and knead it into a smooth, elastic dough, about 5 to 8 minutes. Try to use as little flour as necessary when kneading the dough; you don’t want to toughen the bread. A bench scraper can make it really easy to remove it from the counter if it gets stuck in a spot. [More bread tips here.]", 
            "Both methods: Transfer dough to large oil-coated bowl, cover with plastic wrap and set aside for 1 hour, or until almost doubled in size.", 
            "Add apples to dough: [See photos in post.] Turn dough out onto a floured counter and gently press it down into a flat, oblong shape. The shape does not matter so however it goes, it goes. Spread 2/3 of apple chunks over 1/2 of the flattened dough. Fold the other half over the apple chunks and press the dough down around them, flattening the now lumpy dough. Spread the remaining 1/3 apple chunks over half the folded dough. Fold the other half over the apples, pressing the dough down again. Your dough packet will likely be square-ish. Fold the corners under with the sides of your hands and form the dough into a round.  Upend your empty bowl over and set it aside for another 30 minutes.", 
            "Weave your bread: [See photos in post.] Divide dough into 4 pieces. Roll and stretch each one as carefully as you can into a rope — don’t worry about getting it too long or thin, just 12 inches or so should do. If any apple chunks fall out as you form the ropes or at any other time in the forming of the loaf or risings, just poke them back in with your finger.", 
            "Arrange two strands in each direction, perpendicular to each other, like a plus sign. Weave them so that one side is over, and the other is under, where they meet. So, now you’ve got an 8-legged woven-headed octopus. Take the four legs that come from underneath the center and move them over the leg to their right, i.e. jumping it. Take those legs that were on the right and again, jump each over the leg before, this time to the left. If you had extra length to your ropes, you can repeat these left-right jumps until you run out of rope. For me, this was enough. Just as you had with the folded packet of apple dough above, tuck the corners/odd bumps under the dough with the sides of your hands to form a round.", 
            "Transfer the dough to a parchment-covered heavy baking sheet or baker’s peel (if you’ll be using a bread stone). Beat egg until smooth and brush over challah. Let challah rise for another hour but 45 minutes into this rise, preheat your oven to 375 degrees.", 
            "Bake your loaf: Before baking, brush loaf one more time with egg wash and sprinkle with coarse sugar if you’re using it. Bake in middle of oven for 40 to 45 minutes. It should be beautifully bronzed; if yours (like mine, except I didn’t catch it in time) starts getting too dark too quickly, cover it with foil for the remainder of the baking time. The very best way to check for doneness in any bread but especially on like this where the wetness of the apples can slow down the baking time a bit, is with an instant read thermometer — the center of the loaf should be 195 degrees.", 
            "Cool loaf on a rack before serving. Or, well, good luck with that. "
        ], 
        "date": "2011-09-28T22:14:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound tart, firm apples such as Granny Smiths (2 large or 3 medium)", 
            "1 tablespoon lemon juice", 
            "6 tablespoons all-purpose flour", 
            "1 tablespoon granulated sugar", 
            "1/4 teaspoon cinnamon", 
            "1 teaspoon baking powder", 
            "2 large eggs", 
            "Butter (I used about 2 tablespoons)", 
            "Rich plain yogurt, sour cream or crème fraîche for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/11/apple-latkes.jpg?w=750", 
        "tags": [
            "Apple", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/11/apple-latkes/", 
        "title": "apple latkes", 
        "directions": [
            "In a small saucepan, simmer the apple juice until it is reduced by half. Add the sugar and continue to cook it until it becomes a golden brown/amber color. Add the butter and once it melts, the heavy cream and salt. Simmer for one minute and serve, with or without apple latkes."
        ], 
        "date": "2010-11-30T17:17:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (80 grams) raisins", 
            "2 tablespoons (30 ml) dark rum", 
            "1 cup plus 3 tablespoons (150 grams) all-purpose flour, plus more for dusting", 
            "Pinch of salt", 
            "3 tablespoons (45 ml) sunflower, safflower or another neutral oil", 
            "1/3 cup (80 ml) water", 
            "2 pounds (905 grams) firm apples (about 5 to 6)", 
            "Juice of 1 lemon", 
            "1/3 cup (65 grams) granulated sugar or vanilla sugar (see note above)", 
            "1/2 teaspoon ground cinnamon (optional)", 
            "8 tablespoons (115 grams) unsalted butter, divided", 
            "3/4 cup (40 grams) plain, unseasoned dried breadcrumbs (I used, and recommend, panko, see note above)", 
            "1 tablespoon granulated sugar or vanilla sugar", 
            "1/8 teaspoon salt", 
            "Confectioners’ sugar, for dusting", 
            "Lightly sweetened whipped cream or vanilla ice cream, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/apple-strudel-apfelstrudel.jpg?w=750", 
        "tags": [
            "Apple", 
            "Austrian", 
            "Cake", 
            "Fall", 
            "German", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/11/apple-strudel/", 
        "title": "apple strudel", 
        "directions": [
            "Prepare the raisins: The day before, combine the raisins and the rum in a small bowl and cover; set aside for 24 hours. However, should you be reading this and want to make it right now, I found microwaving the two together for 10 to 15 seconds and setting them aside until you’re ready to mix the filling allowed them to absorb almost as well.\nMake the dough: The day of, combine the flour and salt in a medium bowl. Add the oil and water and mix with a spoon or your index finger until a rough dough forms. Turn it out onto a very lightly floured counter and knead for 10 minutes. It sounds like it will be forever, but set a timer and chat with a friend, it goes quickly. After 10 minutes, the dough should be soft and silky to the tough. Form it into a ball, place it on the counter and upend the mixing bowl over it. Set aside for 30 minutes.\nMeanwhile, prepare the apples: Peel, halve, core and slice thin in one direction, then halve the slices crosswise, creating thin squarish rectangles of apples. Place them in a large bowl and toss with lemon juice, sugar and cinnamon, if using. Add the raisins and any rum left in the bowl.\nPrepare the breadcrumbs: In a small skillet over medium-low heat, melt 3 tablespoons butter and add the breadcrumbs, sugar and salt. Stir to coat and cook, stirring frequently as they can burn quickly, until crumbs are an even golden brown and very fragrant. Don’t let them burn. Scrape into a dish (or they’ll keep cooking in the pan) and set aside.\nHeat your oven to 400 degrees F (200 degrees C). Line 1 large or 2 smaller baking sheets with parchment paper.\nMelt the remaining 5 tablespoons butter in a small dish.\nRoll out your dough (these directions are for a full-sized strudel): Cover your work surface with a cleaning linen towel or sheet that’s at least 24-by-32 inches. The long side should be horizontal. Sprinkle the cloth lightly with flour. Place the dough in the middle, sprinkle it very lightly with flour and roll in both directions until it’s about 10-by-13 inches, or about as far as the rolling pin can take it. Make sure the dough hasn’t stuck to the cloth; reflour if it has. Now the stretching begins! Ball your hands to loose fists, put them under the rolled-out dough and gently start stretching the dough using the back of your hands. Alternate with pulling the dough gently with your fingers to continue stretching it, stretching the edges thin too. This is all much easier than it sounds, but be patient. If holes form, pinch the dough back together. Continue stretching until the dough is about 16-by-24 inches.", 
            "Assemble strudel: Brush evenly with about half the melted butter. On the right side of the rectangle, a few inches from the end, spread the breadcrumbs top to bottom in a thick line, leaving a little more than an inch margin at the top and bottom of the strip. Scoop the apples with a slotted spoon, leaving any accumulated juices in the bowl, and pile them over the crumbs. Gently pull the top and bottom edges of the dough over the apple mixture. Pull the right edge of the dough up and over the filling as far as it will go without tearing. Working carefully, use the towel to roll up the strudel all the way. Place the parchment paper from your baking sheet at the edge of the roll and roll the strudel onto it. Ideally, it should be breadcrumb side-down on the parchment, you can roll it again if it’s not. Use the parchment like a sling to gently place the strudel on the baking sheet.\nBrush the strudel generously all over with some of the remaining butter. Bake for 15 minutes, then brush again and return to the oven in a rotated position. Repeat this once, baking a total of 45 minutes. (Half-size strudels seem to bake 5 or so minutes faster.) The finished strudel should be crisp to the touch and a deep golden brown.", 
            "Remove the baking sheet from the oven and let cool on a rack for at least 20 minutes before serving. Dust with confectioners’ sugar and slice into pieces to serve.", 
            "Strudel is best the day it is made, but it keeps for 1 to 2 days at room temperature. I’ve also read that you can freeze it (am trying this as we speak, will give more notes once it defrosts). Before serving, you can crisp up leftover strudel in a 350 degree F (180 degree C) oven."
        ], 
        "date": "2016-11-04T12:07:27+00:00"
    }, 
    {
        "ingredient_list": [
            "Brown butter", 
            "9 tablespoons unsalted butter, cold is fine", 
            "Dough", 
            "1/4 cup browned butter, from above", 
            "2/3 cup granulated sugar", 
            "1 teaspoon vanilla extract", 
            "Seeds from half a fresh vanilla bean (optional)", 
            "2 large eggs", 
            "1 teaspoon baking powder", 
            "1/4 teaspoon kosher salt", 
            "2 1/4 cups plus 2 tablespoons cups all-purpose flour ", 
            "Filling", 
            "3/4 cup (3.6 ounces) toasted hazelnuts, skins rubbed off", 
            "1 tablespoon all purpose flour", 
            "Few pinches of sea salt", 
            "1/3 cup granulated sugar", 
            "4 to 5 tablespoons browned butter, cold, from above", 
            "1 large egg", 
            "1/4 teaspoon vanilla extract, 1 teaspoon brandy, or another flavoring of your choice (totally optional)", 
            "1/2 cup (rough estimate) apricot jam"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/apricot-hazelnut-brown-butter-hamantaschen1.jpg?w=640", 
        "tags": [
            "Cookie", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/03/apricot-hazelnut-brown-butter-hamantaschen/", 
        "title": "apricot hazelnut brown butter hamantaschen", 
        "directions": [
            "Brown your butter: You’re going to use this in two places. In a medium saucepan, melt the butter over medium heat. Keep cooking it after it has melted, stirring frequently, until it begins to smell nutty and pale brown flecks appear at the edge of the pan, which takes a few minutes. Once these reach a dark beige/medium brown color (you’ll want to watch this like a hawk, this happens quickly once it begins to toast) remove from heat. Pour 1/4 cup exactly of this browned butter mixture into the bottom of the large bowl you’re going to make your cookie dough with. Place the rest (this will be 4 to 5 tablespoons) in a small-medium dish and freeze it until you need it for the filling, which uses a more flexible amount of butter.", 
            "Make your dough:  Let the 1/4 cup browned butter cool slightly in the bottom of a large bowl, then whisk in sugar, vanilla extract, scraped vanilla bean seeds (if using). Whisk in eggs, one at a time, followed by salt and baking powder. Switch to a spoon and add first cup flour, stirring to combine. Repeat with second cup of flour, then 1/4 cup. Dough is going to become stiff, just do you best. Add the last 2 tablespoons flour and if it’s too stiff to stir with a spoon, knead it in with your hands. ", 
            "Divide dough into two parts and wrap each in a flattish disc in plastic in the fridge for 2 hours, or up to a few days. Impatient? So am I? Place discs in freezer until firm but not frozen, 20 to 30 minutes.", 
            "Make your filling: Place nuts, flour, salt and sugar in the workbowl of a food processor and run the machine until the nuts are finely ground but not yet forming a paste. Remember that browned butter you froze? Scrape it into the machine and run it until combined. Add egg and any flavorings and run the machine until a smooth paste forms. Scrape hazelnut paste back into that browned butter dish (fewer dishes) and place it in the fridge until needed. It doesn’t have to be cold to work, but it is easier to scoop.", 
            "Assemble and bake cookies: Heat oven to 350 degrees and line two large baking sheets with parchment paper or a nonstick baking mat.", 
            "Roll chilled dough, one packet at a time, out on a floured counter until 1/8-inch thick. These cookies puff in the oven, so err on the thin side. Cut into 3-inch circles. In the center of each circle, dollop the tiniest amount (a scant teaspoon, this expands in the oven so use less that it seems you’d need) of the hazelnut paste and a little (1/2 teaspoon, tops) dab of apricot jam. Fold sides up, forming a triangular shape and pinching the corners closed well. ", 
            "Arrange on baking sheet with an inch or so between cookies. Reroll scraps as needed. Repeat with remaining packet of dough.", 
            "Bake cookies for 11 minutes to start, then check the color and return them to the oven, a minute at a time, until they’re nice and golden at the edges. For me, this usually takes a couple more minutes. ", 
            "Let cool on racks. Cookies keep in an airtight container at room temperature for up to a week, and longer in the freezer."
        ], 
        "date": "2016-03-18T11:59:35+00:00"
    }, 
    {
        "ingredient_list": [
            "3 3/4 teaspoons active dry yeast (about 1 1/2 packages, 3/8 ounces or 11 grams)", 
            "1 tablespoon (13 grams) granulated sugar", 
            "1 3/4 cups lukewarm water", 
            "1/2 cup (118 ml) olive or vegetable oil, plus more for greasing the bowl", 
            "5 large eggs", 
            "1/2 cup (100 grams) granulated sugar", 
            "1 tablespoon (14 grams) table salt", 
            "8 to 8 1/2 cups (1000 to 1063 grams) all-purpose flour", 
            "1/2 cup raisins (about 70 grams) per challah, if using, plumped in hot water and drained", 
            "Poppy or sesame seeds for sprinkling."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/best-challah-egg-bread1.jpg?w=640", 
        "tags": [
            "Bread", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/09/best-challah-egg-bread/", 
        "title": "best challah (egg bread)", 
        "directions": [
            "1. In a large bowl, dissolve yeast and 1 tablespoon (13 grams) sugar in water; set aside for 5 minutes until a bit foamy.", 
            "2. Whisk oil into yeast, then beat in 4 eggs, one at a time, with remaining 1/2 cup (100 grams) sugar and salt. Gradually add flour. When dough holds together, it is ready for kneading. (You can also use a mixer with a dough hook for both mixing and kneading, but be careful if using a standard size KitchenAid–it’s a bit much for it, though it can be done.)", 
            "3. Turn dough onto a floured surface and knead until smooth. Clean out bowl and grease it, then return dough to bowl. Cover with plastic wrap, and let rise in a warm place for 1 hour, until almost doubled in size. Dough may also rise in an oven that has been warmed to 150 degrees then turned off. Punch down dough, cover and let rise again in a warm place for another half-hour.", 
            "4. At this point, you can knead the raisins into the challah, if you’re using them, before forming the loaves. To make a 6-braid challah, either straight or circular*, take half the dough and form it into 6 balls. With your hands, roll each ball into a strand about 12 inches long and 1 1/2 inches wide. Place the 6 in a row, parallel to one another. Pinch the tops of the strands together. Move the outside right strand over 2 strands. Then take the second strand from the left and move it to the far right. Take the outside left strand and move it over 2. Move second strand from the right over to the far left. Start over with the outside right strand. Continue this until all strands are braided. For a straight loaf, tuck ends underneath. For a circular loaf, twist into a circle, pinching ends together. Make a second loaf the same way. Place braided loaves on a greased cookie sheet with at least 2 inches in between.", 
            "5. Beat remaining egg and brush it on loaves. Either freeze breads or let rise another hour.", 
            "6. If baking immediately, preheat oven to 375 degrees and brush loaves again. Sprinkle bread with seeds, if using. If freezing, remove from freezer 5 hours before baking.", 
            "7. Bake in middle of oven for 30 to 40 minutes, or until golden. (If you have an instant read thermometer, you can take it out when it hits an internal temperature of 190 degrees.) Cool loaves on a rack.", 
            "Note: Any of the three risings can be done in the fridge for a few hours, for more deeply-developed flavor. When you’re ready to work with it again, bring it back to room temperature before moving onto the next step.", 
            "Round or straight braid? Raisins or skip them? Straight loaves of braided challah are eaten throughout the year–typically on the Sabbath–round challahs, often studded with raisins, are served for the New Year and the other High Holidays that follow. I made one of each, so you could see examples. ", 
            "* These days, we make round woven challahs with this much easier technique. Do check it out!"
        ], 
        "date": "2008-09-26T15:44:26+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "4 1/4 cups (530 grams) all-purpose flour, plus extra for dusting", 
            "1/2 cup (100 grams) granulated sugar", 
            "2 teaspoons instant yeast", 
            "Grated zest of 1 small lemon or half an orange (our preference)", 
            "3 large eggs", 
            "1/2 cup water (cold is fine) and up to 1 to 2 tablespoons extra, if needed", 
            "3/4 teaspoon fine sea or table salt", 
            "2/3 cup unsalted butter (150 grams or 5.3 ounces) at room temperature", 
            "Sunflower or other neutral oil, for greasing", 
            "Filling", 
            "4 1/2 ounces (130 grams) dark chocolate (or approximately 3/4 cup chocolate chips)", 
            "1/2 cup (120 grams) unsalted butter, cold is fine", 
            "Scant 1/2 cup (50 grams) powdered sugar", 
            "1/3 cup (30 grams) cocoa powder", 
            "1/4 teaspoon cinnamon [optional]", 
            "Syrup", 
            "1/3 cup water", 
            "6 tablespoons (75 grams) granulated sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/better-chocolate-babka1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Chocolate", 
            "Jewish", 
            "Photo", 
            "Recipes"
        ], 
        "url": "https://smittenkitchen.com/2014/10/better-chocolate-babka/", 
        "title": "better chocolate babka", 
        "directions": [
            "Make the dough: Combine the flour, sugar, yeast and zest in the bottom of the bowl of a stand mixer. Add eggs and 1/2 cup water, mixing with the dough hook until it comes together; this may take a couple minutes. It’s okay if it’s on the dry side, but if it doesn’t come together at all, add extra water, 1 tablespoon at a time, until the dough forms a mass. With the mixer on low, add the salt, then the butter, a spoonful at a time, mixing until it’s incorporated into the dough. Then, mix on medium speed for 10 minutes until dough is completely smooth; you’ll need to scrape the bowl down a few times. I usually found that after 10 minutes, the dough began to pull away from the sides of the bowl. If it doesn’t, you can add 1 tablespoon extra flour to help this along. ", 
            "Coat a large bowl with oil (or scrape the dough out onto a counter and oil this one) and place dough inside, cover with plastic and refrigerate. Leave in fridge for at least half a day, preferably overnight. [Dough will not fully double, so don’t fret if it doesn’t look like it grew by more than half.]", 
            "[To make this on the same day, see my fourth note below.]", 
            "Make filling: Melt butter and chocolate together until smooth. Stir in powdered sugar and cocoa; mixture should form a spreadable paste. Add cinnamon, if desired. [If you’re wondering what happened to the pecans and granulated sugar, see my third note below.]", 
            "Assemble loaves: Coat two 9-by-4-inch (2 1/4 or 1kg) loaf pans with oil or butter, and line the bottom of each with a rectangle of parchment paper. Take half of dough from fridge (leave the other half chilled). Roll out on a well-floured counter to about a 10-inch width (the side closest to you) and as long in length (away from you) as you can when rolling it thin, likely 10 to 12 inches. ", 
            "Spread half of chocolate mixture evenly over the dough, leaving a 1/2-inch border all around. Brush the end farthest away from you with water. Roll the dough up with the filling into a long, tight cigar. Seal the dampened end onto the log. I found that transferring the log to a lightly floured baking tray in the freezer for 10 to 15 minutes made it much, much easier to cut cleanly in half. Repeat with second dough.", 
            "Trim last 1/2-inch off each end of log. Gently cut the log in half lenghtwise and lay them next to each other on the counter, cut sides up. Pinch the top ends gently together. Lift one side over the next, forming a twist and trying to keep the cut sides facing out (because they’re pretty). Don’t worry if this step makes a mess, just transfer the twist as best as you can into the prepared loaf pan. In one batch, mine was long enough to “S” inside the pan and I nested the trimmed ends of the log in the openings. Even if you don’t (and choose to bake them separately in a little pan, as I did in other batches), the dough will fill in any gaps by the time it’s done rising and baking, so don’t worry.", 
            "Cover with a damp tea towel and leave to rise another 1 to 1 1/2 hours at room temperature. Repeat process with second loaf. ", 
            "Bake and finish cakesL Heat oven to 375°F (190°C). Remove towels, place each loaf on the middle rack of your oven. Bake for 30 minutes, but there’s no harm in checking for doneness at 25 minutes. A skewer inserted into an underbaked babka will feel stretchy/rubbery inside and may come back with dough on it. When fully baked, you’ll feel almost no resistance. If you babka needs more time, put it back, 5 minutes at a time then re-test. If it browns too quickly, you can cover it with foil. ", 
            "While babkas are baking, make syrup: Bring sugar and water to a simmer until sugar dissolves. Remove from heat and set aside to cool somewhat. As soon as the babkas leave the oven, brush the syrup all over each. It will seem like too much, but will taste just right — glossy and moist. Let cool about halfway in pan, then transfer to a cooling rack to cool the rest of the way before eating (an adorable suggestion from Ottolenghi — don’t worry, we know you’re going to eat it warm).", 
            "Do ahead: Babkas keep for a few days at room temperature. Longer, I’d freeze them. They freeze and defrost really well.", 
            "A whole bunch of notes:"
        ], 
        "date": "2014-10-09T12:12:17+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups (10.5 ounces/300 grams) King Arthur high-gluten bread flour, preferably, or bread flour", 
            "1/2 teaspoon (1.6 grams) instant yeast", 
            "1 teaspoon (6.6 grams) salt (the more authentic bialys I have had use a bit more salt, so feel free to dial it up if you like a saltier roll)", 
            "3/4 cup plus 2 tablespoons (7.25 ounces/206 grams) water, at room temperature", 
            "Onion-Poppy Seed Filling", 
            "2 1/4 teaspoons vegetable oil", 
            "6 tablespoons (1.5 ounces, 43 grams) onion, chopped", 
            "3/4 teaspoon poppy seeds (I love poppy seeds on a bialy, but this did seem more than I was used to; I might dial it back next time)", 
            "1/4 teaspoon sea salt", 
            "Black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/03/bialys.jpg?w=753", 
        "tags": [
            "Bread", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/03/bialys/", 
        "title": "bialys", 
        "directions": [
            "1. Mix the dough. In the bowl, whisk together the flour and the yeast, then whisk in the salt (this keeps the yeast from coming in direct contact with the salt which would kill it). With the dough hook, on low speed (#2 if using a KitchenAid), gradually add the water, mixing for about 1 minute or until the flour mixture is moistened. Raise the speed to medium (#4 KitchenAid) and continue mixing for 7 minutes. The dough should clean the bowl but be soft and elastic. Add a little extra flour or water if necessary. (The dough will weigh about 17.75 ounces/506 grams).", 
            "2.Let the dough rise. Place the dough in a 1 1/2-quart or larger dough-rising container or bowl, lightly greased with cooking spray or oil. Press down the dough and lightly spray or oil the top. Cover the container with a lid or plastic wrap. With a piece of tape, mark the side of the container at approimately where double the height of the dough would be. Allow the dough to rise, ideally at 75 to 80°F, for 1 1/2 to 2 hours or until it has doubled.", 
            "3. Shape the dough and let it rise. Deflate the dough by firmly pushing it down, and transfer it to a floured counter. Cut the dough into 6 equal pieces (about 3 ounces, 84 grams each). Work with one piece at a time, keeping the remaining dough covered. Maintaining as much air as possible in the dough, round each piece by pulling the dough together to form a pouch, stretching to make a smooth skin, and pinching it together where the edges meet. Set it on a floured baking sheet or tray, pinched side down. (The rounds will be 2 1/2 inches by 1 1/2 inches high.) Flour the tops and cover with plastic wrap.", 
            "Allow the bialys to rise for about 2 hours at 75 to 80°F or until almost doubled; when pressed lightly in the center, they should keep the impression. If the dough is underrisen, it will puff up in the center instead of maintaining the characteristic hollow crater. The trick for underrisen dough is to make a small hole in the center before adding the filling. Since the dough bakes so quickly, it’s easy to test bake one to see if the dough is ready. If you want to be on the safe side, make the hole anyway.", 
            "4. Make the onion-poppy seed filling. In a small saute pan, heat the oil. Add the onion and saute over medium heat, stirring often, for about 5 minutes or until translucent. (I went longer, going for a deeper caramelization but you should cook them to your taste.) Remove from the heat and add the poppy seeds, salt, and pepper to taste. Cool.", 
            "5. Preheat the oven. Preheat the oven to 475°F 30 minutes before baking. have an oven shelf at the lowest level and place a baking stone or baking sheet on it, and a sheet pan on the floor of the oven, before preheating.", 
            "6. Make the craters for the filling. Holding each piece of dough with both hands, with your thumbs in the middle and almost touching, pinch the center of the dough tightly between your thumbs and first two fingers and stretch the dough to 4 1/2 to 5 inches in diameter, forming a crater in the center. (My pinching skills are not up to par and my centers puffed a bit. No biggie, but make sure you get a good firm pinch in there!) Place it on the lined baking sheet and spoon 1 teaspoon of onion-poppy seed filling into the center.", 
            "7. Bake the bialys. Place the baking sheet with the bialys directly on the hot oven stone or hot baking sheet, or, if using parchment, use a peel or a cookie sheet to slide the parchment with the bialys onto the stone or sheet. Toss a handful of ice cubes into the sheet pan on the oven floor (this helps make your oven closer to a professional bread oven; the steam helps form a crust), and immediately shut the door. Bake for 6 to 10 minutes or until pale golden and mottled with brown spots (an instand-read thermometer inserted into the center will read about 211°F.)", 
            "8. Cool the bialys. Remove the baking sheet or parchment from the oven and, with a pancake turner, transfer the bialys to wire racks to cool until just warm.", 
            "Storage: The bialys keep well for one day at room temperature in a paper bag. For longer storage, wrap each in airtight plastic wrap and place freezer bags in the freezer for up to one month. Thaw, still wrapped, at room temperature.", 
            "Variation: To make crisper flat bialys (a favorite in New York, I did not do this but might next time), brush the tops with a mixture of 1 large egg white beaten with 1/2 teaspoon water and sprinkle with poppy seeds (use 3 times the weight of the egg white in poppy seeds). Cover with plastic wrap and press down on the bialys with a sheet pan or cookie sheet to make 5 1/2- to 6-inch rounds. Remove the plastic wrap and use the wide end of a chopstick to make about 12 holes in each bialy. Bake as above, but add a few minutes to that bialys turn golden brown."
        ], 
        "date": "2009-03-28T23:56:27+00:00"
    }, 
    {
        "ingredient_list": [
            "Sponge", 
            "1 teaspoon instant yeast", 
            "4 cups unbleached high-gluten or bread flour (see note below)", 
            "2 1/2 cups water, room temperature", 
            "Dough", 
            "1/2 teaspoon instant yeast", 
            "3 3/4 cups unbleached high-gluten or bread flour", 
            "2 3/4 teaspoons salt", 
            "2 teaspoons malt powder or 1 tablespoon dark or light malt syrup, honey, or brown sugar (see note below)", 
            "To Finish", 
            "1 tablespoon baking soda"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/09/peter-reinharts-bagels.jpg?w=750", 
        "tags": [
            "Bread", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/09/bronx-worthy-bagels/", 
        "title": "peter reinhart’s bagels", 
        "directions": [
            "Cornmeal or semolina flour for dusting", 
            "Sesame seeds, poppy seeds, kosher salt, rehydrated dried minced garlic or onions (Deb note: this was what I chose, and found the taste very authentic), or chopped onions that have been tossed in oil (optional) ", 
            "1. Day one: To make the sponge, stir the yeast into the flour in a 4-quart mixing bowl.  Add the water, whisking or stirring only until it forms a smooth, sticky batter (like pancake batter).  Cover the bowl with plastic wrap and leave at room temperature for approximately 2 hours, or until the mixture becomes very foamy and bubbly.  It should swell to nearly double in size and collapse when the bowl is tapped on the countertop. ", 
            "2. To make the dough, in the same mixing bowl (or in the bowl of an electric mixer), add the additional yeast to the sponge and stir.  Then add 3 cups of the flour and all of the salt and malt.  Stir (or mix on low speed with the dough hook) until the ingredients for a ball, slowly working in the remaining 3/4 cup flour to stiffen the dough. ", 
            "3. Transfer the dough to the counter and knead for at least 10 minutes (or for 6 minutes by machine).  The dough should be firm, stiffer than French bread dough, but still pliable and smooth.  There should be no raw flour – all ingredients should be hydrated.  The dough should pass the windowpane test and register 77 to 71 degrees F.  If the dough seems to dry and rips, add a few drops of water and continue kneading.  If the dough seems tacky or sticky, add more flour to achieve the stiffness required.  The kneaded dough should feel satiny and pliable but not be tacky. ", 
            "4. Immediately divide the dough into 4 1/2 ounce pieces for standard bagels, or smaller if desired (Deb note: I used 2.25 ounce pieces, and yes, I weighed them because I wanted them to bake evenly).  Form the pieces into rolls. ", 
            "5. Cover the rolls with a damp towel and allow them to rest for approximately 20 minutes. ", 
            "6. Line 2 sheet pans with baking parchment and mist lightly with spray oil.  Proceed with one of the following shaping methods:", 
            "Method 1: Poke a hole in a ball of bagel dough and gently rotate your thumb around the inside of the hole to widen it to approximately 2 1/2 inches in diameter (half of this for a mini-bagel).  The dough should be as evenly stretched as possible (try to avoid thick and thin spots.) ", 
            "Method 2: Roll out the dough into an 8-inch long rope.  (This may require rolling part of the way and resting if the pieces are too elastic and snap back, in which case, allow them to rest for 3 minutes and then extend them again to bring to full length.  Wrap the dough around the palm and back of your hand, between the thumb and forefinger, overlapping the ends by several inches.  Press the overlapping ends on the counter with the palm of your hand, rocking back and forth to seal. ", 
            "7. Place each of the shaped pieces 2 inches apart on the pans (Deb note: I got away with 1-inch space for the minis).  Mist the bagels very lightly with the spray oil and slip each pan into a food-grade plastic bag, or cover loosely with plastic wrap. Let the pans sit at room temperature for about 20 minutes. ", 
            "8.  Check to see if the bagels are ready to be retarded in the refrigerator by using the “float test”.  Fill a small bowl with cool or room-temperature water.  The bagels are ready to be retarded when they float within 10 seconds of being dropped into the water.  Take one bagel and test it.  If it floats, immediately return the tester bagel to the pan, pat it dry, cover the pan, and place it in the refrigerator overnight (it can stay in the refrigerator for up to 2 days).  If the bagel does not float.  Return it to the pan and continue to proof the dough at room temperature, checking back every 10 to 20 minutes or so until a tester floats.  The time needed to accomplish the float will vary, depending on the ambient temperature and the stiffness of the dough. ", 
            "9. The following day (or when you are ready to bake the bagels), preheat the oven to 500 degrees F with the two racks set in the middle of the oven.  Bring a large pot of water to a boil (the wider the pot the better), and add the baking soda (and optionally, a few tablespoons of barley syrup, see Note at the end).  Have a slotted spoon or skimmer nearby. ", 
            "10. Remove the bagels from the refrigerator and gently drop them into the water, boiling only as many as comfortably fit (they should float within 10 seconds).  After 1 minutes flip them over rand boil for another minute.  If you like very chewy bagels, you can extend the boiling to 2 minutes per side (Deb note: I used the 2 minute option).  While the bagels are boiling, sprinkle the same parchment-lined sheet pans with cornmeal or semolina flour.  (If you decide to replace the paper, be sure to spray the new paper lightly with spray oil to prevent the bagels from sticking to the surface.)  If you want to top (see note below) the bagels, do so as soon as they come out of the water. You can use any of the suggestions in the ingredients list or a combination. ", 
            "11. When all the bagels have been boiled, place the pans on the 2 middle shelves in the oven.  Bake for approximately 5 minutes, then rotate the pans, switching shelves and giving the pans a 180-degree rotation.  (If you are baking only 1 pan, keep it on the center shelf but still rotate 180 degrees.)  After the rotation, lower the oven setting to 450 degrees F and continue baking for about 5 minutes, or until the bagels turn light golden brown.  You may bake them darker if you prefer. (Deb note: I actually baked them quite a bit longer, often almost five extra minutes. I judge by color, not internal temperature, in this case. I did not lower the oven temperature because I had multiple batches to bake.)", 
            "12. Remove the pans from the oven and let the bagels cool on a rack for 15 minutes or longer before serving.", 
            "Cinnamon Raisin Bagels: For cinnamon raisin bagels, increase the yeast in the final dough to 1 teaspoon, and add 1 tablespoon of ground cinnamon and 5 tablespoons of granulated sugar to the final dough.  Rinse 2 cups of loosely packed raisins with warm water to wash off surface sugar, acid, and natural wild yeast.  Add the raisins during the final 2 minutes of mixing.  Proceed as directed, but do not top the bagels with any garnishes.  When they come out of the oven and are still hot, you can brush the tops with melted butter and dip them in cinnamon sugar to create a cinnamon-sugar crust, if desired. ", 
            "Notes:"
        ], 
        "date": "2007-09-27T17:15:10+00:00"
    }, 
    {
        "ingredient_list": [
            "Wrappers", 
            "4 tablespoons unsalted butter, melted and cooled slightly", 
            "1 cup milk (fat level shouldn’t matter, but I use whole)", 
            "4 large eggs", 
            "1 cup all-purpose flour (I swap 1/3 to 1/2 regularly with whole wheat, and did so here)", 
            "Few pinches of salt", 
            "Filling", 
            "2 cups farmer’s cheese, quark, a thicker cottage cheese or ricotta", 
            "6 tablespoons sour cream, mascarpone, creme fraiche or softened cream cheese", 
            "2 tablespoons granulated sugar (or more to taste, see Note up top)", 
            "1/4 teaspoon vanilla extract (if desired)", 
            "Few gratings fresh lemon zest (if desired)", 
            "2 large egg yolks or 1 large egg (optional, see Note up top)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/01/cheese-blintz.jpg?w=750", 
        "tags": [
            "Jewish", 
            "Pancakes", 
            "Photo", 
            "Russian", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/01/cheese-blintz/", 
        "title": "cheese blintz", 
        "directions": [
            "Make wrapper/crêpe batter: Combine wrapper ingredients in a blender, or in a bowl with an immersion blender, or whisk by hand until smooth. Cover with plastic wrap and refrigerate for an hour or up to two days. ", 
            "Cook wrappers/crêpes: Heat a medium skillet or crêpe pan over medium-high heat. Once heated, brush pan lightly with melted butter or oil. If batter has gotten too thick to pour thinly in the fridge, you can add an additional tablespoon or two of milk or water to thin it. Pour 3 to 4 tablespoons batter into skillet, just enough that it coats the bottom in an even layer when you swirl it around. Let cook, undisturbed, until the crêpe becomes a little golden underneath or at the edges. (We can cook these more pale than dessert crêpe, because we’re going to cook them again before serving.) ", 
            "Here’s my crêpe-flipping technique: I use a small offset spatula (my first kind of favorite spatula) to loosen the edges and get underneath the crêpe enough to lift it. Then, in the lifted space between the crêpe and the skillet, I put a flexible fish spatula (my second favorite kind of spatula) further underneath, remove the “lifting” offset spatula, and then use the bigger one to flip it in one movement. If it lands off-center, just shimmy the skillet until it goes back into place. ", 
            "Cook the crêpe on the reverse side for another 20 seconds, then slide onto a plate to cool. Repeat with remaining batter, brushing the skillet with additional oil or butter as needed. You can stack the crêpe on top of each other even when they’re hot; they will not stick.", 
            "Either use the crêpe right away, or cover the plate with plastic wrap and use them in the next 2 days.", 
            "Make filling and fill wrappers: Mix all filling ingredients together until smooth. Place 3 tablespoons or so filling across the center of the top wrapper/crêpe in your stack. Fold the bottom part of the wrapper up and over it; fold the sides in over the bottom and filling, then fold the pancake up to form an egg roll-like shape filled pancake.", 
            "You can use these blintz right away, or refrigerate them for up to 2 days or freeze them between layers of waxed paper for up to 2 months. ", 
            "Serve the blintz: Heat a pat of butter over medium heat in a skillet. Fry blintz until browned on both sides. Transfer to a place and serve with sour cream or a fruit sauce or jam or your choice."
        ], 
        "date": "2014-01-27T12:28:52+00:00"
    }, 
    {
        "ingredient_list": [
            "Sponge", 
            "1 teaspoon instant yeast", 
            "4 cups unbleached high-gluten or bread flour", 
            "2 1/2 cups water, room temperature", 
            "Dough", 
            "1 teaspoon instant yeast", 
            "3 3/4 cups unbleached high-gluten or bread flour", 
            "1 tablespoon ground cinnamon", 
            "5 tablespoons sugar", 
            "2 3/4 teaspoons salt", 
            "2 teaspoons malt powder or 1 tablespoon dark or light malt syrup, honey, or brown sugar", 
            "2 cups loosely packed raisins, rinsed with warm water to remove surfact sugar, acid, and natural wild yeast", 
            "To Finish", 
            "1 tablespoon baking soda", 
            "Cornmeal or semolina flour for dusting", 
            "Melted butter for brushing (optional)", 
            "Cinnamon sugar for sprinkling (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cinnamon-raisin-bagels1.jpg?w=500", 
        "tags": [
            "Bread", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/05/cinnamon-raisin-bagels/", 
        "title": "cinnamon raisin bagels", 
        "directions": [
            "1. Day one: To make the sponge, stir the yeast into the flour in a 4-quart mixing bowl. Add the water, whisking or stirring only until it forms a smooth, sticky batter (like pancake batter). Cover the bowl with plastic wrap and leave at room temperature for approximately 2 hours, or until the mixture becomes very foamy and bubbly. It should swell to nearly double in size and collapse when the bowl is tapped on the countertop.", 
            "2. To make the dough, in the same mixing bowl (or in the bowl of an electric mixer), add the additional yeast to the sponge and stir. Then add 3 cups of the flour, cinnamon, sugar, salt and malt. Stir (or mix on low speed with the dough hook) until the ingredients form a ball, slowly working in the remaining 3/4 cup flour to stiffen the dough. In the last two minutes of mixing, add the raisins. (I ended up adding a bit of flour with them, as mine were still wet and made the dough a little sticky.)", 
            "3. Transfer the dough to the counter and knead for at least 10 minutes (or for 6 minutes by machine). The dough should be firm, stiffer than French bread dough, but still pliable and smooth. There should be no raw flour – all ingredients should be hydrated. The dough should 77 to 71°F. If the dough seems too dry and rips, add a few drops of water and continue kneading. If the dough seems tacky or sticky, add more flour to achieve the stiffness required. The kneaded dough should feel satiny and pliable but not be tacky.", 
            "4. Immediately divide the dough into 12 (4 1/2 ounce) pieces for super sized bagels, 16 (3.375 ounce) regular-sized bagels, or 24 (2.25 ounce) perfectly smaller bagels. Form the pieces into rolls.", 
            "5. Cover the rolls with a damp towel and allow them to rest for approximately 20 minutes.", 
            "6. Line 2 sheet pans with baking parchment and mist lightly with spray oil. Poke a hole in a ball of bagel dough and gently rotate your thumb around the inside of the hole to widen it to approximately 2 1/2 inches in diameter for a supersized bagel, two inches for a large one or just slightly more than one inch for a miniature. The dough should be as evenly stretched as possible (try to avoid thick and thin spots.)", 
            "7. Place each of the shaped pieces two inches apart on the pans. Mist the bagels very lightly with the spray oil and slip each pan into a food-grade plastic bag, or cover loosely with plastic wrap. Let the pans sit at room temperature for about 20 minutes.", 
            "8. Check to see if the bagels are ready to be retarded in the refrigerator by using the “float test”. Fill a small bowl with cool or room-temperature water. The bagels are ready to be retarded when they float within 10 seconds of being dropped into the water. Take one bagel and test it. If it floats, immediately return the tester bagel to the pan, pat it dry, cover the pan, and place it in the refrigerator overnight (it can stay in the refrigerator for up to 2 days). If the bagel does not float. Return it to the pan and continue to proof the dough at room temperature, checking back every 10 to 20 minutes or so until a tester floats. The time needed to accomplish the float will vary, depending on the ambient temperature and the stiffness of the dough.", 
            "9. The following day (or when you are ready to bake the bagels, see head notes), preheat the oven to 500°F with the two racks set in the middle of the oven. Bring a large pot of water to a boil (the wider the pot the better), and add the baking soda. Have a slotted spoon or skimmer nearby.", 
            "10. Remove the bagels from the refrigerator and gently drop them into the water, boiling only as many as comfortably fit (they should float within 10 seconds). After 1 minute, flip them over and boil for another minute. If you like very chewy bagels, you can extend the boiling to 2 minutes per side. While the bagels are boiling, sprinkle the same parchment-lined sheet pans with cornmeal or semolina flour. (If you decide to replace the paper, be sure to spray the new paper lightly with spray oil to prevent the bagels from sticking to the surface.) ", 
            "11. When all the bagels have been boiled, place the pans on two middle shelves in the oven. Bake for approximately five minutes, then rotate the pans, switching shelves and giving the pans a 180-degree rotation. (If you are baking only one pan, keep it on the center shelf but still rotate 180 degrees.) After the rotation, lower the oven setting to 450°F and continue baking for about 5 minutes, or until the bagels turn light golden brown. You may bake them darker if you prefer.", 
            "12. Remove the pans from the oven and let the bagels cool on a rack for 15 minutes or longer before serving. Optionally, when they come out of the oven and are still hot, you can brush the tops with the melted butter and dip them in cinnamon sugar to create a cinnamon-sugar crust, if desired. But who’d want to eat something like that?"
        ], 
        "date": "2009-05-04T12:58:18+00:00"
    }, 
    {
        "ingredient_list": [
            "Bread", 
            "2 1/4 teaspoons (1 packet — 1/4 ounce or 7 grams) active dry yeast", 
            "1/4 cup (85 grams) plus 1 teaspoon honey", 
            "2/3 cup warm water (110 to 116 degrees F)", 
            "1/3 cup (80 ml) olive oil, plus more for the bowl", 
            "2 large eggs", 
            "2 teaspoons flaky sea salt, such as Maldon, or 1 1/2 teaspoons table salt", 
            "4 cups (500 grams) all-purpose flour", 
            "Fig Filling", 
            "1 cup (5 1/2 ounces or 155 grams) stemmed and roughly chopped dried figs", 
            "1/8 teaspoon freshly grated orange zest, or more as desired", 
            "1/2 cup (120 ml) water", 
            "1/4 cup (60 ml) orange juice", 
            "1/8 teaspoon sea salt", 
            "Few grinds black pepper", 
            "Egg wash", 
            "1 large egg", 
            "Coarse or flaky sea salt, for sprinkling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/09/fig-olive-oil-and-sea-salt-challah.jpg?w=750", 
        "tags": [
            "Announcements", 
            "Bread", 
            "Cookbooks", 
            "Figs", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/09/fig-olive-oil-and-sea-salt-challah-book-tour/", 
        "title": "fig, olive oil and sea salt challah + book tour!", 
        "directions": [
            "To make dough with a stand mixer: Whisk the yeast and 1 teaspoon honey into warm water, and let it stand for a few minutes, until foamy. In a large mixer bowl, combine the yeast mixture with remaining honey, 1/3 cup olive oil, and eggs. Add the salt and flour, and mix until dough begins to hold together. Switch to a dough hook, and run at low speed for 5 to 8 minutes. Transfer the dough to an olive-oil coated bowl (or rest the dough briefly on the counter and oil your mixer bowl to use for rising, so that you’ll use fewer dishes), cover with plastic wrap, and set aside for 1 hour, or until almost doubled in size.", 
            "To make the dough by hand: Proof the yeast as directed above. Mix the wet ingredients with a whisk, then add the salt and flour. Mix everything together with a wooden spoon until the dough starts to come together. Turn the mixture out onto a floured counter, and knead for 5 to 10 minutes, until a smooth and elastic dough is formed. Let rise as directed above.", 
            "Meanwhile, make fig paste: In a small saucepan, combine the figs, zest, water, juice, salt, and a few grinds of black peper. Bring to a simmer over medium heat, and cook, stirring occasionally, until the figs are soft and tender, about 10 minutes. Season with salt and pepper to taste. Remove from heat, and let cool to lukewarm. PRocess fig mixture in a food processor until it resembles a fine paste, scraping down the sides of the bowl as necessary. Set aside to cool.", 
            "Insert figs: After your dough has risen, turn it out onto a floured counter and divide it in half. Roll the first half of the dough into a wide and totally imperfect rectangle (really, the shape doesn’t matter). Spread half the fig filling evenly over the dough, stopping short of the edge. Roll the dough into a long, tight log, trapping the filling within. Then gently stretch the log as wide as feels comfortable (I take mine to my max counter width, a pathetic three feet), and divide it in half. Repeat with remaining dough and fig filling.", 
            "Weave your challah: Arrange two ropes in each direction, perpendicular to each other, like a tight tic-tac-toe board. Weave them so that one side is over, and the other is under, where they meet. So, now you’ve got an eight-legged woven-headed octopus. Take the four legs that come from underneath the center and move the leg to their right — i.e., jumping it. Take the legs that were on the right and, again, jump each over the leg before, this time to the left. If you have extra length in your ropes, you can repeat these left-right jumps until you run out of rope. Tuck the corners or odd bumps under the dough with the sides of your hands to form a round.", 
            "Transfer the dough to a parchment-cover heavy baking sheet, or, if you’ll be using a bread stone, a baker’s peel. Beat egg until smooth, and brush over challah.  Let challah rise for another hour, but 45 minutes into this rise, preheat your oven to 375°F.", 
            "Bake your loaf: Before baking, brush loaf one more time with egg wash and sprinkle with sea salt. Bake in middle of oven for 35 to 40 minutes. It should be beautifully bronzed; if yours starts getting too dark too quickly, cover it with foil for the remainder of the baking time. The very best way to check for doneness is with an instant-read thermometer — the center of the loaf should be 195 degrees. ", 
            "Cool loaf on a rack before serving. Or, well, good luck with that."
        ], 
        "date": "2012-09-11T11:26:27+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/five-details-three-corners1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/03/five-details-three-corners/", 
        "title": "hamataschen + five details", 
        "directions": [], 
        "date": "2007-03-01T15:30:45+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons unsalted butter, softened", 
            "3 ounces cream cheese at room temperature", 
            "3 tablespoons sugar", 
            "1 egg", 
            "1 teaspoon vanilla extract", 
            "1/2 teaspoon orange zest", 
            "1 1/3 cups plus 4 teaspoons flour", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/hamantaschen1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/03/hamantaschen/", 
        "title": "hamantaschen", 
        "directions": [
            "Various jams (we used raspberry, blackberry and apricot, but my favorite is this stuff) or prepared fillings (such as poppy seed or prune pastry filing)", 
            "Cream butter and cream cheese together until smooth. Add sugar and mix for one minute longer, then egg, vanilla extract, orange zest and salt, mixing until combined. Finally, add the flour. The mixture should come together and be a tad sticky. If it feels too wet, add an additional tablespoon of flour.", 
            "Form dough into a disc, wrap in plastic and refrigerate for at least an hour.", 
            "Preheat oven to 350°F.", 
            "To form the hamantaschen, roll out the dough on a well-floured surface until it is about 1/4-inch thick. Using a round cookie cutter (3 inches is traditional, but very large; I used one that was 2 1/2 inches), cut the dough into circles. Spoon a teaspoon of you filling of choice in the center. Fold the dough in from three sides and firmly crimp the corners and give them a little twist to ensure they stay closed. Leave the filling mostly open in the center. Bake on a cookie sheet lined with parchment paper and bake until golden brown, about 20 minutes.", 
            "Cool on racks. Resist the urge to try a still-hot one unless a jam-burnt tongue is as much of your Purim tradition as are these cookies."
        ], 
        "date": "2008-03-23T11:00:49+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound medium zucchini", 
            "1 large baking potato (3/4 pound), peeled", 
            "1 small onion (4 ounces), peeled", 
            "1/2 cup matzo meal", 
            "1 large egg, lightly beaten", 
            "1 teaspoon fresh lemon juice", 
            "1 1/2 teaspoons salt", 
            "1/2 teaspoon freshly ground pepper", 
            "Vegetable oil, for frying "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/latke-minus-vodka1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Photo", 
            "Summer", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2006/12/latke-minus-vodka/", 
        "title": "zucchini latkes", 
        "directions": [
            "Halve the zucchini crosswise. Cut the zucchini flesh off the seedy center and coarsely grate it in a food processor. Or grate it on a box grater until you reach the seedy center. Discard the center. In a food processor or on a box grater, coarsely grate the potato and onion. Transfer the grated zucchini, potato and onion to a colander and squeeze dry. Let stand for 2 minutes, then squeeze again. Transfer the vegetable mixture to a large bowl. Add the matzo meal, egg, lemon juice, salt and pepper and stir to combine.", 
            "In a medium skillet, heat 2 tablespoons of vegetable oil until shimmering. Drop packed teaspoons of the zucchini mixture into the skillet and flatten them with the back of a spoon. Cook the latkes over moderately high heat until the edges are golden, about 1 1/2 minutes; flip and cook until golden on the bottom, about 1 minute. Drain on paper towels. Repeat with the remaining zucchini mixture, adding more oil to the skillet as needed.", 
            "Do ahead: The fried latkes can be kept at room temperature for up to 4 hours. Reheat them on a dark baking sheet in a 375°F oven for about 5 minutes, or until warmed through and crisp."
        ], 
        "date": "2006-12-16T11:45:59+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/latke-redux1.jpg?w=500", 
        "tags": [
            "Hanukah", 
            "Jewish", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2007/12/latke-redux/", 
        "title": "latke redux", 
        "directions": [], 
        "date": "2007-12-04T17:43:13+00:00"
    }, 
    {
        "ingredient_list": [
            "Base and lattice", 
            "4 1/2 cups (1 pound or 455 grams) shelled walnuts", 
            "3 cups (375 grams) all-purpose flour", 
            "2 teaspoons ground cinnamon", 
            "1/2 teaspoon ground cloves (I halved this, using only 1/4 teaspoon)", 
            "1/4 to 1/2 teaspoon table salt (Heatter says 1/4, I really prefer this with 1/2)", 
            "2 1/2 sticks (10 ounces or 285 grams) cold, unsalted butter, cut into chunks", 
            "1 2/3 cup (330 grams) granulated sugar", 
            "1 egg plus 1 egg yolk", 
            "Finely grated zest of 1 lemon", 
            "Filling", 
            "1/4 cup (about 20 to 25 grams) fine, dry breadcrumbs", 
            "2 cups (about 575 grams) seedless raspberry jam", 
            "To finish", 
            "1 egg yolk", 
            "1 teaspoon water", 
            "2/3 to 1 cup (75 to 115 grams) to slivered almonds (julienne-shaped pieces) (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/linzer-torte1.jpg?w=640", 
        "tags": [
            "Austrian", 
            "Christmas", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/12/linzer-torte/", 
        "title": "linzer torte", 
        "directions": [
            "Make base: Heat oven to 400 degrees. Butter two 9-inch round layer cake pans (preferably with removable bottoms if you plan to serve this in wedges, like a cake), two 8-inch square pans (what I used, then cut each into square bars, like cookies), one 9×13-inch rectangular pan (again, for bar cookies) or one 11- to 12-inch round cake pan (again ideally with a removable bottom). Line the bottom of each with a piece of parchment paper cut to fit, then butter then paper. ", 
            "In a food processor, process walnuts and 1/2 cup of the flour (reserve remaining 2 1/2 cups for next step) for 15 seconds, or until the nuts are finely ground but have not formed a paste. ", 
            "Place remaining 2 1/2 cups flour, cinnamon, cloves and salt in a large, wide-ish mixing bowl. With a pastry blender, work the butter into the dry mixture until it forms coarse crumbs. Stir in the sugar and walnut-flour mixture. In a small dish, beat the whole egg, yolk, and lemon rind utnil combined, and stir into crumb mixture. Stir the mixture in as best as you can with a spoon, then work the rest in with your hands. Knead the dough a few times inside the bowl until a cohesive mass, one that holds together, forms. ", 
            "Divide dough into quarters if making two tortes, or halves if making one.", 
            "Place one portion into the bottom of each pan, and press evenly and firmly over the bottoms and then about 1 1/4 to 1 1/2 inches up the sides with your fingers. Don’t worry about making it smooth or level on the sides; it gets filled in later.", 
            "Bake shell(s) for 15 minutes, or until it barely begins to color at the edges.", 
            "While the shell(s) bakes, roll remaining piece(s) of dough between two pieces of waxed paper, until 1/4- to 3/8-inch in thickness one inch bigger than your pan size. [I.e., for each 9-inch round torte, you’ll want a 10-inch diameter circle; for each 8-inch square torte, a 9-inch square, etc.] Transfer to freezer until the dough is well-chilled, about 20 minutes.", 
            "Remove shell(s) from oven and let cool slightly; reduce baking temperature to 350 degrees. ", 
            "Make filling: If you’re using panko or another coarse dry breadcrumb, you can pulse it in a food processor until it is fine powder. I found I needed almost double the volume in panko (7 tablespoons) to yield 1/4 cup of a fine breadcrumb powder.", 
            "Sprinkle 2 tablespoons finely ground breadcrumbs over each par-baked shell, or all 1/4 cup over your single large one. If jam is not already soft, stir it until it is, then spread 1 cup over each shell. Cut dough(s) into 1/2- to 3/4-inch wide strips, cutting through the bottom of the waxed paper at the same time. Lift each strip-and-waxed paper over the jam and reverse it onto the jam, then peel off waxed paper. Cut the ends of the dough by pressing them onto the sides of the pan. Arrange strips 1/2- to 3/4-inch apart, crisscrossing them on an angle to make a lattice top with diamond-shaped openings. [Note: I neither “wove” my lattice or ended up making “diamond-shaped” openings. Oops.] Use leftover pieces to fill in any gaps between lattice-strips and tall sides of shells. The two doughs will blend together in the oven. ", 
            "To finish: Mix egg yolks and water. Brush it all over lattice top and border. Sprinkle with almonds, if using. (I prefer to use 1/3 cup per smaller torte, instead of the 1/2 cup Heatter recommends. I only sprinkled them on one.) Bake torte(s) for 45 to 60 minutes (Heatter recommends 60, I find it perfect, but ovens and baking pans vary, check yours sooner if you’re nervous), until crust and almonds on top are well-browned. ", 
            "Remove from oven and place on racks. If you’ve baked it in a cake pan and wish to serve it as a “cake,” i.e. in wedges, Heatter recommends that you remove it from the pan while still warm by cutting around the torte carefully (the crust is very fragile) with a small, sharp knife and loosening the torte in the pan, before reversing it onto a cooling rack, and then back again onto another rack to finish cooling. If using a pan with a removable base, you should safely be able to remove it once it has fully cooled. Personally, I had no trouble letting my cool fully in the square pan but the first square did not come out cleanly. ", 
            "Once fully cool, Heatter recommends you let the tortes stand overnight (covered with foil) before serving for best flavor. You can decorate the tortes with powdered sugar before serving in wedges or squares. "
        ], 
        "date": "2013-12-13T12:34:39+00:00"
    }, 
    {
        "ingredient_list": [
            "3 1/2 cups (440 grams) all-purpose flour", 
            "1 tablespoon (15 grams) teaspoon (5 grams) baking powder [see explanation above]", 
            "1 teaspoon (5 grams) baking soda", 
            "1/2 teaspoon kosher salt", 
            "4 teaspoons (about 8 grams) ground cinnamon", 
            "1/2 teaspoon ground cloves", 
            "1/2 teaspoon ground allspice", 
            "1 cup (235 ml) vegetable oil", 
            "1 cup (340 grams) honey", 
            "1 1/2 cups (300 grams) granulated sugar", 
            "1/2 cup (95 grams) brown sugar", 
            "3 large eggs at room temperature", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 cup warm (235 ml) coffee or strong tea", 
            "1/2 cup (120 ml) fresh orange juice", 
            "1/4 cup (60 ml) rye or whiskey", 
            "1/2 cup (45 to 55 grams) slivered or sliced almonds (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/majestic-and-moist-honey-cake.jpg?w=753", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/09/majestic-and-moist-honey-cake/", 
        "title": "majestic and moist honey cake", 
        "directions": [
            "Fits in three loaf pans, two 9-inch square or round cake pans, one 9 or 10 inch tube or bundt cake pan, or one 9 by 13 inch sheet cake. I made mine in two full-size loaf pans plus two miniature ones.", 
            "Preheat oven to 350°F. Generously grease pan(s) with non-stick cooking spray. For tube or angel food pans, line the bottom with lightly greased parchment paper, cut to fit.", 
            "In a large bowl, whisk together the flour, baking powder, baking soda, salt, cinnamon, cloves and allspice. Make a well in the center, and add oil, honey, white sugar, brown sugars, eggs, vanilla, coffee or tea, orange juice and rye or whiskey, if using. (If you measure your oil before the honey, it will be easier to get all of the honey out.)", 
            "Using a strong wire whisk or in an electric mixer on slow speed, stir together well to make a thick, well-blended batter, making sure that no ingredients are stuck to the bottom.", 
            "Spoon batter into prepared pan(s). Sprinkle top of cake(s) evenly with almonds, if using. Place cake pan(s) on two baking sheets, stacked together (this will ensure the cakes bake properly with the bottom baking faster than the cake interior and top).", 
            "Bake until cake tests done, that is, it springs back when you gently touch the cake center. For angel and tube cake pans, this will take 60 to 75 minutes, loaf cakes, about 45 to 55 minutes. For sheet style cakes, baking time is 40 to 45 minutes.", 
            "Let cake stand fifteen minutes before removing from pan."
        ], 
        "date": "2008-09-24T14:24:43+00:00"
    }, 
    {
        "ingredient_list": [
            "3 1/2 to 4 1/2 pounds chicken necks, backs and wings", 
            "3 celery ribs, cut into big chunks", 
            "3 carrots, scrubbed and cut into big chunks", 
            "2 parsnips, scrubbed and cut into big chunks", 
            "2 onions, unpeeled and quartered", 
            "1 head garlic, cut horizontally in half", 
            "1 Turkish or 1/2 California bay leaf", 
            "1 tablespoon black peppercorns", 
            "1 tablespoon Kosher salt", 
            "4 quarts cold water", 
            "–and/or–", 
            "Any vegetables you have stashed in your Stock Bag (described above) ", 
            "Matzo Balls", 
            "1/2 cup matzo meal", 
            "2 eggs, lightly beaten", 
            "2 tablespoons reserved chicken fat or vegetable oil", 
            "1 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "2 tablespoons chicken stock or seltzer (which both of our mothers swear by for making the balls extra light)", 
            "For soup", 
            "2 to 3 quarts prepared chicken stock (recipe above)", 
            "1 carrot, thinly sliced", 
            "A few sprigs of dill"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/matzo-ball-soup.jpg?w=750", 
        "tags": [
            "Dumplings", 
            "Jewish", 
            "Passover", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/02/matzo-ball-soup/", 
        "title": "matzo ball soup", 
        "directions": [
            "Mix all matzo ball ingredients in a bowl. Cover and place in the refrigerator for 30 minutes. ", 
            "Bring 1 1/2 quarts of well-salted water to a brisk boil in a medium sized pot.", 
            "Reduce the flame. Run your hands under water so they are thoroughly wet. Form matzo balls by dropping spoonfuls of matzo ball batter approximately 1-inch in diameter into the palm of your wet hands and rolling them loosely into balls. Drop them into the simmering salt water one at a time. Cover the pot and cook them for 30 to 40 minutes.", 
            "About ten minutes before the matzo balls are ready, bring prepared chicken stock to a simmer with the sliced carrot in it. Ladle some soup and a couple matzo balls into each bowl and top with a couple snips of dill. Eat immediately. "
        ], 
        "date": "2008-02-04T16:08:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups warm milk, 110 degrees", 
            "2 (1/4 ounce each) packages active dry yeast", 
            "1 3/4 cups plus a pinch of sugar", 
            "3 whole large eggs, room temperature", 
            "2 large egg yolks, room temperature", 
            "6 cups all-purpose flour, plus more for work surface", 
            "1 teaspoon salt", 
            "1 3/4 cups (3 1/2 sticks) unsalted butter, cut into 1-inch pieces, room temperature, plus more for bowl and loaf pans", 
            "2 1/4 pounds semisweet chocolate, very finely chopped*", 
            "2 1/2 tablespoons ground cinnamon", 
            "1 tablespoon heavy cream", 
            "Streusel topping (below)", 
            "1 2/3 cups confectioners’ sugar", 
            "1 1/3 cups all-purpose flour", 
            "12 tablespoons (1 1/2 sticks) unsalted butter, room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mmm-bab-bee-bab-ka1.jpg?w=753", 
        "tags": [
            "Bread", 
            "Cake", 
            "Chocolate", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/09/mmm-bab-bee-bab-ka/", 
        "title": "chocolate babka", 
        "directions": [
            "In a large bowl, combine sugar, flour, and butter. Using a fork, stir until fully combined with clumps ranging in size from crumbs to 1 inch."
        ], 
        "date": "2007-09-14T10:41:20+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound wide egg noodles", 
            "8 eggs", 
            "2 cups sugar (Mom uses 1 1/2 cups)", 
            "2 pounds full-fat cottage cheese, creamed or large curd", 
            "2 sticks (1 cup or 8 ounces) melted unsalted butter or margarine (Mom uses 1 1/2 sticks butter)", 
            "2 teaspoons vanilla", 
            "Dash of salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/10/my-familys-noodle-kugel.jpg?w=753", 
        "tags": [
            "Guest Post", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/10/my-familys-noodle-kugel/", 
        "title": "my family’s noodle kugel", 
        "directions": [
            "Optional: 2 cups canned cherry pie filling (Comstock is specified)", 
            "Preheat oven to 350 degrees. Parboil the noodles (five to seven minutes).", 
            "In a very large bowl beat eggs until fluffy. Add the sugar gradually, then the cottage cheese, margarine or butter and vanilla. Stir in the drained noodles.", 
            "Pour into a 9×13-inch pan. Bake for 1 1/2 hours, or until kugel is set. If using the cherry pie filling as a topping, pour it over at the one-hour mark, then bake it for an additional 30 minutes.", 
            "Deb note: Your baking time may, of course, vary. Check for doneness at one hour and go from there. Our oven, always running cool, took almost two hours to bake this. At home, my mothers inferno of an oven does it in an hour.", 
            "About the topping: Okay, so apparently, the original version of this recipe has the cherry pie filling (from! a! can!) as a topping and apparently, my father says that some segments of my family still bake it this way. I have yet to see it, and my mother has never used it. Should you want to try some version of this but avoid the mystery-in-a-can stuff, a quick cherry pie filling can be made with a bag of frozen sour cherries cooked with half a cup of water in a saucepan for about 10 minutes. Mix 1/2 cup of sugar with 1 tablespoon of cornstarch and stir these into the pot. The mixture will thicken within a couple minutes. Cool before using."
        ], 
        "date": "2008-10-08T13:47:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound wide egg noodles", 
            "2 8-ounce packages cream cheese, softened", 
            "1 pound (16 ounces) creamed cottage cheese, full fat", 
            "1 1/2 cups sugar", 
            "1 stick salted butter, melted, plus more for greasing the baking dish", 
            "8 eggs", 
            "2 teaspoons vanilla", 
            "1 teaspoon cinnamon", 
            "1 cup dried cherries"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/noodle-kugel1.jpg?w=500", 
        "tags": [
            "Jewish", 
            "Pasta", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/09/noodle-kugel/", 
        "title": "cream cheese noodle kugel", 
        "directions": [
            "Preheat oven to 350°F. Grease a 9×13 glass baking dish. ", 
            "Parboil the noodles (5 to 7 minutes) and drain them in a colander. In a very large bowl beat cream cheese until fluffy, add cottage cheese and beat for another minute. Scrape bowl down well. Add sugar and combine, then melted butter, and scrape down the bowl another time. Add the eggs one at a time, beating between additions. Add cinnamon, vanilla and mix, then stir in dried cherries. Finally, carefully mix in the drained egg noodles. ", 
            "Pour into prepared baking dish and bake for one hour before checking to see if the center is set. It may need up to 30 minutes more. (Yes, I know this range is crazy, but I’ve baked kugels that took either end of the range. They refuse to be predictable.)"
        ], 
        "date": "2007-09-19T19:13:00+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1/2 pound (about 1 large) Russet potato", 
            "1 tablespoon fresh lemon juice", 
            "1 pound parsnips (about 2 large or 4 medium)", 
            "1/4 cup all-purpose flour", 
            "1 teaspoon baking powder", 
            "2 large eggs, lightly beaten", 
            "2 tablespoons chopped fresh dill", 
            "1 teaspoon table salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "Olive oil (or a mix of olive and vegetable or peanut oil) for frying", 
            "Sauce", 
            "1 cup sour cream", 
            "1 tablespoon lemon juice", 
            "1/2 teaspoon table salt", 
            "1 tablespoon freshly grated or prepared horseradish", 
            "1 tablespoon chopped dill"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/parsnip-latkes-with-horseradish-and-dill.jpg?w=749", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Parsnips", 
            "Photo", 
            "Potatoes", 
            "Snack", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/12/parsnip-latkes-with-horseradish-and-dill/", 
        "title": "parsnip latkes with horseradish and dill", 
        "directions": [
            "Preheat: Oven to 250 degrees. Line one large or two smaller baking sheets with foil and leave them in the oven until needed.", 
            "Prepare vegetables: Peel vegetables and grate them on the large holes of a box grater or (my preferred method) using the shredding blade of a food processor. If using the food processor, I like to lay the vegetables sideways in the chute, in an attempt to get the longest strands of vegetables. This creates latkes that look like little piles of mops, which is my goal.", 
            "Transfer shredded vegetables to a lint-free dishtowel or square of cheesecloth, and wring out as much liquid as possible. Let stand for two minutes, then wring again. Wetness is the enemy of crisp, light latkes, so we want to get rid of as much as possible.", 
            "Make batter: Transfer wrung-out vegetables to a large bowl. Add lemon juice. In a tiny dish, stir together the flour, baking powder, salt, pepper and any herbs or additional seasonings and toss with vegetables, evenly coating the strands. In the same tiny dish, whisk your egg(s) and then stir this into the vegetable-flour mixture, evenly coating the strands.", 
            "Prepare pan: Heat a large, heavy skillet, preferably cast iron, over medium heat. Once skillet is hot, add 3 tablespoons oil and heat oil until shimmering. If you’re unsure, you can flick a droplet of water onto the oil; if it hisses and sputters, you’re good to go.", 
            "Cook: Using a fork or your fingertips (letting the eggy batter drain off a little is good), gather spoonful-sized mounds of battered vegetables and drop them onto the heated skillet. When golden underneath, 3 to 4 minutes later, flip pancakes. [If you’re using a gas range, you’ll likely have to rotate your pancakes 180 degrees halfway through the cooking time so that they color evenly underneath.] Cook on the other side until nicely bronzed underneath, another 2 to 3 minutes, and transfer to paper towels briefly to drain pancakes, before transferring them again to tray(s) in warm oven. If latkes cook too quickly or slowly on the stove, adjust the heat accordingly.", 
            "Add more oil if needed (you want to keep the pan at that 3 tablespoon level), being sure it is heated before adding more pancakes to the skillet. Repeat with remaining batter.  I like to keep the latkes in the oven for at least 10 minutes to ensure they’ve cooked through before serving them. This gives you time to…", 
            "Make sauce: Mix sauce ingredients in a small dish. Adjust seasonings to taste.", 
            "Serve: Warm with a dollop of the sauce."
        ], 
        "date": "2011-12-22T13:13:41+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "2 1/2 cups all-purpose flour", 
            "1 teaspoon baking powder", 
            "1/2 teaspoon table salt", 
            "1 large egg", 
            "1/2 cup vegetable oil (Joe also recommends schmaltz, or rendered chicken fat, if you’ve got some)", 
            "1 teaspoon white vinegar", 
            "1/2 cup water (see Update, above)", 
            "Filling", 
            "1 1/2 pounds (about 3 medium) russet potatoes, peeled and quartered", 
            "1 small yellow onion, peeled and diced small", 
            "1 tablespoon vegetable or olive oil", 
            "1 tablespoon unsalted butter", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "To finish", 
            "1 large egg yolk", 
            "1 teaspoon water", 
            "1 1/2 pounds medium red potato (about 3 to 4), peeled and quartered", 
            "1 big leek (about 1/2 pound), white and light-green parts only, halved lengthwise, and thinly sliced (you’ll clean the grit out in a moment)", 
            "1 tablespoon vegetable or olive oil", 
            "1 tablespoon unsalted butter", 
            "1 generous cup lacinato kale ribbons (about 3 ounces or 1/4 to 1/3 bundle), tough stems and ribs removed and leaves cut into strips  (you’ll wash it in a moment)", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "3 ounces cream cheese, at room temperature "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/potato-knish-two-ways1.jpg?w=500", 
        "tags": [
            "Jewish", 
            "Kale", 
            "Leeks", 
            "Photo", 
            "Potatoes", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2012/03/potato-knish-two-ways/", 
        "title": "potato knish, two ways", 
        "directions": [
            "Cook potatoes: Put potatoes into a large pot, cover with cold water, and bring to a boil over high heat. Reduce heat to medium and cook until soft, about 20 to 25 minutes. Drain, then transfer to a large bowl to cool. ", 
            "Meanwhile, prepare leeks and kale: Fill a medium bowl with very cold water and drop in leek rings. Swish them around with your fingers, letting any sandy dirt fall to the bottom. Scoop out the leeks and drain them briefly on a towel, but no need to get them fully dry. Do the same with the kale, but you can leave the leaves to nearly fully dry, patting them if necessary, on the towels while you cook the leeks.", 
            "Heat a large, heavy skillet over medium heat. Once hot, add butter and oil and once they’re fully melted and a bit sizzly, add the leek slices. Reduce heat to low, cover with a lid and cook leek for 20 minutes, stirring occasionally. Raise heat back to medium, add the kale ribbons and cook until they wilt, about 5 minutes.", 
            "Transfer mixture to bowl with potatoes, add the cream cheese and mash together until combined. Stir in salt and many grinds of black pepper and set filling aside. "
        ], 
        "date": "2012-03-15T13:01:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large or 2 small yellow onions", 
            "3 pounds or about 5 large baking — Russet or Idaho — potatoes, peeled", 
            "1/3 cup potato starch*", 
            "2 teaspoons kosher salt", 
            "Lots of freshly ground black pepper", 
            "3 large eggs", 
            "5 tablespoons olive oil, schmaltz or another oil of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/23422902976_b1b17d03a6_k.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Gluten-Free", 
            "Hanukah", 
            "Jewish", 
            "Onions", 
            "Passover", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/12/potato-kugel/", 
        "title": "potato kugel", 
        "directions": [
            "Heat oven to 350°F.", 
            "By hand: Chop onions very finely and coarsely grate potatoes.", 
            "With a food processor: Blend onions in food processor with regular blade until finely ground. Switch to grating blade and grate potatoes — I like to do this one their sides, for the longest strands.", 
            "Both methods: Place onions and potatoes in a large bowl. Sprinkle salt, pepper and starch evenly over potatoes and toss together with two forks or, as I do it, your very clean hands, evenly coating strands. Break eggs right on top and again use forks or your fingers to work them into the strands, evenly coating the mixture. ", 
            "Heat a 1/4 cup oil or fat in a 10-inch cast-iron skillet** over high heat until very hot. Pour potato-egg mixture into pan carefully (it’s going to splatter) and spread evenly in pan. I like to twist and tousle the top strands a little for a pretty final texture on top. Drizzle with last tablespoon of oil. Bake in heated oven for 75 to 80 minutes, until browned on top and tender in the middle. If top browns too quickly, before center is baked, cover with foil for all but the last two minutes of baking time, though this has never been necessary in my oven.", 
            "Serve in squares, either right from the skillet or unmolded onto a platter. Kugel reheats exceptionally well in a warm oven. It keeps in the fridge for up to 4 days, and much longer (months, even) in the freezer. I like to defrost it in the fridge before rewarming it in an oven. ", 
            "* Cornstarch works too. As does flour. Matzo meal is traditional. I like potato starch because it’s the least distracting and lightest. I buy mine from Bob’s Red Mill; usually in a section with other BRM products at just about any store these days (hooray).", 
            "** Without a cast-iron — Use a casserole baking dish. Just heat the oil first so it’s hot when the potato mixture lands in it. (You can do this in the oven, but it will take a good 5 minutes to get very hot. Might as well do it in 60 seconds on the stove.)"
        ], 
        "date": "2015-12-01T12:05:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large baking potato (1 pound), peeled", 
            "1 small onion (4 ounces), peeled", 
            "1/4 cup all-purpose flour", 
            "1 large egg, lightly beaten", 
            "1 teaspoon salt", 
            "1/4 teaspoon freshly ground pepper", 
            "Peanut oil, for frying"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/potato-latkes1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/12/potato-pancakes-even-better/", 
        "title": "potato pancakes, even better", 
        "directions": [
            "In a food processor or on a box grater, coarsely shred the potato and onion. For longer strands, lay the potato sideways in the chute of your food processor. Transfer to a colander or wrap in a cheesecloth sling, and squeeze as dry as possible. Let stand for 2 minutes, then squeeze dry again.", 
            "In a large bowl, whisk the flour, egg, salt and pepper together. Stir in the potato onion mixture until all pieces are evenly coated.", 
            "In a medium skillet, heat 2 tablespoons of vegetable oil until shimmering. Drop packed tablespoons of the potato mixture into the skillet and flatten them with the back of a spoon. Cook the latkes over moderately high heat until the edges are golden, about 1 1/2 minutes; flip and cook until golden on the bottom, about 1 minute. Drain on paper towels. Repeat with the remaining potato mixture, adding more oil to the skillet as needed.", 
            "Do ahead: Latkes are a do-ahead-er’s dream. You can also keep latkes warm in the oven for an hour or more, if you’re waiting for stragglers to arrive. Cooked, they keep well in the fridge for a day or two, or in the freezer, well wrapped, for up to two weeks. Reheat them in a single layer on a cookie sheet in a 400 degree oven until they’re crisp again. Bonus: If you undercooked them a bit or didn’t get the browning on them you’d hoped for, you can compensate for this in the oven. "
        ], 
        "date": "2008-12-21T20:54:03+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "2 cups (260 grams) all-purpose flour", 
            "1/2 teaspoon fine sea or table salt", 
            "1/2 pound (225 grams) unsalted butter", 
            "1/2 pound (1 8-ounce or 225-gram package) cream cheese", 
            "Filling", 
            "2/3 cup (135 grams) granulated sugar", 
            "1 1/2 tablespoons ground cinnamon", 
            "1/3 cup miniature chocolate chips or finely chopped bitter- or semi-sweet chocolate", 
            "1/3 cup toasted nuts, chopped small (I used walnuts)", 
            "1/3 cup dried fruit, chopped small; (I used tiny dried currants, no chopping needed)", 
            "1/2 to 3/4 cup jam (I used seedless raspberry, apricot is more traditional)", 
            "Finish", 
            "1 egg beaten with 1 teaspoon water or milk", 
            "Remaining cinnamon-sugar from above"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/pull-apart-rugelach-e14492472877211.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Hanukah", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/12/pull-apart-rugelach/", 
        "title": "pull-apart rugelach", 
        "directions": [
            "Make the dough:", 
            "In a food processor: Place flour and salt in work bowl fitted with standard blade. Pulse to combine. Add cream cheese, chopped into large chunks, and run machine until it’s fully dispersed into the flour. Add butter in large chunks and run machine until dough starts to clump. Dump out onto a large piece of plastic wrap and form into a flattish disc. ", 
            "With a mixer: Let butter and cream cheese soften at room temperature. Beat both together until light and fluffy. Beat in salt. Add flour, beating until it disappears. Scrape dough onto a large piece of plastic wrap and form into a flattish disc.", 
            "Both methods: Chill dough until totally firm — about 2 hours in the fridge you can hasten this along in the freezer for about 30 minutes. (Dough keeps in fridge for up to a week, and in freezer much longer.)", 
            "Form the pastries: ", 
            "Heat oven to 350 degrees F and line a couple baking sheets with parchment paper or nonstick baking mats.", 
            "Stir cinnamon and sugar together in a small dish. Combine coarse mixture of chocolate, nuts and dried fruit in a second dish. ", 
            "Divide dough into quarters and roll first quarter out on a floured counter into a rectangle about 12 inches wide and 7 to 8 inches long, with the wider side to you. Thinly spread dough to all but the furthest 1/4 inch from you — which seals better once rolled if bare — with about 2 to 3 tablespoons jam. (I find that with seedless raspberry, 2T covers nicely but with thicker jam, you’ll need 3T to coat it thinly. If your jam is difficult to spread, you can warm it gently in the microwave for a few seconds first.) Sprinkle with 2 tablespoons cinnamon-sugar mixture, then 4 tablespoons coarse fruit and nut mixture.", 
            "Roll dough from the 12-inch side in front of you into as tight as a log as you can, using your fingers to lightly seal the ends onto the log. Repeat with remaining logs. ", 
            "Now, choose your final shape:", 
            "To make classic, easy sliced cookies: Place log of filled dough in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. Trim ends from log so they have a clean shape. Cut log into 10 to 12 even slices. Arrange on prepared baking sheets a couple inches apart from each other. ", 
            "To make a ring of spirals: Place log of filled dough in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. Trim ends from log so they have a clean shape. Cut log into 10 to 12 even slices. Arrange them in a ring formation on prepared baking sheets so that each link touches. Do note: This will be the hardest to lift in one piece from the baking sheet once cool.", 
            "To make a pull-apart wreath: Form log into a ring, connecting the ends and smoothing the dough to seal the shape. Place ring in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. On prepared baking sheet, cut 10 to 12 evenly spaced apart notches in ring, cutting through all but the last 1/4-inch of log so it stays connected. ", 
            "To make a pull-apart log: Place log of filled dough in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. Trim ends from log so they have a clean shape. On prepared baking sheet, cut 10 to 12 evenly spaced apart notches in log, alternating sides that you cut from, cutting through all but the last 1/4-inch of log so it stays connected.", 
            "To make a split log twisted together like a babka: Don’t. It was a flopped-open mess. We couldn’t even eat it. [biggest lie, ever]", 
            "For all shapes: Brush top(s) lightly with egg wash and sprinkle with a total of 1 teaspoon of the remaining cinnamon-sugar mixture. Bake for 20 to 25 minutes, until golden brown on top. Individual cookies need to cool only a few minutes on baking sheet before they can be transferred to a cooling rack but larger rings, wreaths and logs do best if they cool at least 3/4 of the way to solidify more before attempting to carefully transfer them. ", 
            "Cooled cookies keep in a container at room temperature for a week, and in the freezer for a month. Just not around here.", 
            "More do-ahead tips: Your filled log of rugelach is also easy to freeze until needed (I did this with the two I had left). Wrap well, and you can slice it into cookies straight from the freezer, baking them while still frozen — you’ll just new a few extra minutes in the oven. "
        ], 
        "date": "2015-12-04T11:44:06+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/11/2068969108_44aacd5913_b.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/rugelach-pinwheels/", 
        "title": "rugelach pinwheels", 
        "directions": [
            "Place cream cheese and butter in the bowl of a food processor and process until smooth and creamy. Add sugar and continue processing until fully incorporated. Add flour and salt and pulse just until dough comes together. ", 
            "Don’t have a food processor? A stand mixer or electric beaters will work just as well. Beat butter and cream cheese together until light and fluffy. Add sugar, beat until combined. Scrape bowl down very well; I find cream cheese likes to leave hidden deposits at the bottom of the bowl. Add salt and flour and mix until just combined, with no flour visible. Divide dough into 2 equal pieces, wrap with plastic wrap, and refrigerate at least 2 hours. ", 
            "Meanwhile, make filling. In a medium bowl, toss together granulated and brown sugars, cinnamon, raisins, and walnuts; set aside.", 
            "On a lightly floured surface, roll out 1 piece of dough into a rectangle about 1/8-inch thick, roughly 12 or so inches wide. (I find making it wider makes it harder to manage or store.) Spread a thin layer of preserves evenly over dough; sprinkle with filling mixture. Roll dough into a tight log beginning with one of the long sides; wrap in plastic wrap. Transfer dough log baking sheet. Repeat process with remaining piece of dough. Place dough logs in refrigerator; let chill at least 1 hour. ", 
            "Heat oven to 350 degrees. Line baking sheets with parchment paper; set aside. Mix together the cinnamon and sugar for the topping; set aside.", 
            "Slice chilled dough logs crosswise, about 1/4 inch thick. Toss each cookie in the cinnamon-sugar mixture with a fork to easily shake excess off. On the first batch, place cookies 3 inches apart on prepared baking sheets to gauge how much yours will spread; I usually find that I only need them an inch or so apart for the rest of the trays. ", 
            "Bake until lightly browned, 15 to 20 minutes. When you remove them from the oven, if any “tails” or layers have sprung loose, you can use your fingers to press the cookie back into a round shape. Let rest on baking sheet for another 2 minutes after that, after which they will set in their re-formed shape, before transferring cookies to a cooling rack which has been lightly coated with a nonstick spray. (It helps keep their warm jammy edges from sticking.) Let cool completely on racks. Repeat with remaining pinwheel dough and cinnamon-sugar. ", 
            "Once cool, cookies can be packed away and stored in an airtight container at room temperature for two weeks."
        ], 
        "date": "2007-11-27T14:44:01+00:00"
    }, 
    {
        "ingredient_list": [
            "Topping", 
            "4 tiny-to-small apples, halved, peeled and cored", 
            "2 tablespoons fresh lemon juice", 
            "2 tablespoons granulated sugar", 
            "Batter", 
            "1/2 cup plus 1 tablespoon (125 grams) unsalted butter, at room temperature", 
            "1/4 cup plus 2 tablespoons (6 tablespoons) granulated sugar", 
            "1/4 cup honey (any variety you like to eat)", 
            "1 teaspoon vanilla extract", 
            "3 large eggs, separated", 
            "2 good pinches of salt", 
            "2 teaspoons baking powder", 
            "1 1/4 cups all-purpose flour", 
            "Glaze", 
            "1/4 cup honey", 
            "A good pinch of sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/sunken-apple-cake-with-salted-honey-glaze1.jpg?w=640", 
        "tags": [
            "Apple", 
            "Cake", 
            "Everyday Cakes", 
            "Fall", 
            "German", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/09/sunken-apple-and-honey-cake/", 
        "title": "sunken apple and honey cake", 
        "directions": [
            "Heat oven: To 350°F. Coat a 9-inch springform with butter or a nonstick spray. Line the bottom of the pan with a round of parchment paper. ", 
            "Prepare apples: Place peeled, halved and cored apples cut-side-down on a cutting board. Use a knife to create parallel thin slices, but only cut halfway through each apple so that the apples stay intact. Don’t fret if you cut through, however; you can just reassemble the halves on the cake in a few minutes.", 
            "In a bowl, toss apples with lemon juice and 2 tablespoon granulated sugar.", 
            "Prepare cake base: Beat butter and 1/4 cup plus 2 tablespoons granulated sugar together in a bowl with electric beaters until fluffy. Add honey and beat until combined. Add vanilla and egg yolks, beating until just combined. Sprinkle salt and baking powder over cake batter, and mix for just 5 seconds, until they disappear. Add flour, half at a time, mixing only until just combined.", 
            "In a separate bowl with cleaned beaters, beat egg whites until stiff. Stir 1/4 of them into the cake batter, to lighten it a little. Fold in the rest in three additions. It will seem impossible to fold in at first because the batter is so stiff, but it will loosen with careful folding. Only fold the last addition of egg whites until it has mostly disappeared (a couple faint streaks of egg white are fine). ", 
            "Spread cake batter in prepared cake pan, smoothing the top. Arrange apple halves facedown over the cake batter. To warn, 4 tiny/small apples will definitely fit over the cake batter. When I made it with 4 small-almost-medium apples, I could only fit 3 1/2 of them. No need to press the apples into the batter. You can pour any extra lemon juice and sugar in the bowl over the apples.", 
            "Bake cake: 35 to 40 minutes, until a toothpick or skewer inserted into the center of the cake comes out clean. Let rest on a cooling rack for 5 minutes, then cut around the cake to make sure it’s not sticking to the pan at all, and unhinge the sides. Let cake cool completely. You can store it at room temperature at this point, or after you add the honey, for up to 5 days 3 days at room temperature. After that, a fridge is best for longevity. The cake is lovelier on day 2 than day 1.", 
            "Before serving, if you’d like the glaze to look glossy, or whenever the cake is cool, if you don’t mind if the honey sinks into the cake: Warm 1/4 cup honey and a good pinch of sea salt until it liquefies to the point where it makes a thin glaze — this will take less than 30 seconds. Brush honey-salt mixture over cooled cake. "
        ], 
        "date": "2014-09-22T12:17:45+00:00"
    }, 
    {
        "ingredient_list": [
            "3 large onions, sliced", 
            "3 tablespoons vegetable oil", 
            "6 garlic cloves, peeled and halved", 
            "1 teaspoon paprika", 
            "2 teaspoons salt", 
            "1 1/2 teaspoons garlic powder", 
            "1 1/4 teaspoons black pepper", 
            "1 1/2 teaspoons onion powder", 
            "1/8 to 1/4 teaspoon cayenne (adjust to your heat preference)", 
            "1/2 teaspoon dried oregano", 
            "1/2 teaspoon dried thyme", 
            "2 cups beef stock (unsalted or low salt)", 
            "1 cup ketchup*", 
            "1 cup chili sauce* (I’m realizing from comments that there are many many types; I used Heinz, which is not exactly spicy)", 
            "1 cup brown sugar (light or dark)", 
            "8 to 10 pound brisket"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/tangy-spiced-brisket.jpg?w=752", 
        "tags": [
            "Jewish", 
            "Meat", 
            "Passover", 
            "Photo", 
            "Slow Cooker"
        ], 
        "url": "https://smittenkitchen.com/2010/04/tangy-spiced-brisket/", 
        "title": "tangy spiced brisket", 
        "directions": [
            "Prepare the sauce: Heat a large skillet over medium high heat and sauté onions in vegetable oil, stirring occasionally, until caramelized and most of liquid has evaporated, about 15 minutes. Add halved garlic cloves and saute for 3 minutes more. Stir in spices and seasoning (paprika, salt, garlic and onion powders, black pepper, cayenne, oregano and thyme) and cook for 2 minutes. Set aside.", 
            "In a large bowl, stir together the beef stock, ketchup, chili sauce and brown sugar. Don’t worry if your brown sugar is lumpy (mine always is), the acidity of the ingredients will quickly break it down.", 
            "If baking in oven: Preheat oven to 350 degrees. Place brisket in a baking dish or casserole, spread onion mixture over the top, then pour sauce mixture over the entire dish. Cover tightly with foil bake until very tender but not falling apart, about 3 to 4 hours. ", 
            "If making in a slow cooker (which I highly, highly recommend): Place brisket in a slow cooker, spread onion mixture over the top, then pour sauce mixture over the entire dish. Cover with the lid and cook it on LOW for 10 hours. (I like to start it before I go to bed, and process it in the morning to rest over the course of the day in the fridge.) ", 
            "For both methods, rest the dish: When the brisket is cooked but still hot, use a spoon to scrape off any large fat deposits adhered to the top and bottom of the brisket. (This part is easiest to do when hot. The sauce will be de-fatted after it has chilled.)  ", 
            "If you’re using a slow cooker, transfer the brisket and all of its sauce to a baking dish. If you’ve baked it in the oven, you can continue in that same dish. ", 
            "Chill entire dish in the fridge for several hours and up to one day; this resting time will  significantly enhance the flavor and texture of the meat. ", 
            "An hour before you’re ready to serve it: Preheat your oven to 300°F, and remove the dish from the fridge. Remove all of the fat that has solidified with a slotted spoon for a less oily finish.", 
            "Carefully remove the meat from its sauce and place on a large cutting board. Cut the brisket into 1/2-inch slices. ", 
            "If you like a smoother sauce (I do) this is a good time to run it through a blender or literally just smash up the onion and garlic strands with a wooden spoon. They’ll be so soft, that’s all it takes. ", 
            "Carefully place the sliced meat (moving it in large sections with a spatula helps keep it together) back into the sauce and spoon the sauce over the meat.  Replace the lid or cover the dish tightly with foil and reheat in the oven until it is bubbling at the edges — this usually takes up to to 30 minutes. ", 
            "* If you are very strictly kosher for Passover — generally, at an Orthodox level — you’ll want to find versions without corn syrup in them."
        ], 
        "date": "2010-04-01T10:32:18+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "Grated zest of 1 lemon", 
            "1 cup powdered sugar", 
            "2 1/4 cups all-purpose flour", 
            "1/4 teaspoon table salt", 
            "2 large egg yolks", 
            "8 ounces (2 sticks) unsalted butter at room temperature, in small pieces", 
            "Poppy Seed Filling", 
            "1 cup milk", 
            "1/2 cup sugar", 
            "Grated zest of 1/2 orange", 
            "1 cup poppy seeds", 
            "1/3 cup raisins", 
            "Juice of 1/2 lemon", 
            "1/2 tablespoon brandy", 
            "1/2 tablespoon orange liqueur", 
            "1/2 tablespoon butter", 
            "1/2 tablespoon vanilla extract", 
            "Glaze", 
            "1 large egg, beaten"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/tiny-poppy-seed-taschen1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/03/tiny-poppy-seed-taschen/", 
        "title": "tiny poppy seed ‘taschen", 
        "directions": [
            "Make the dough: Place the lemon zest, powdered sugar, flour and salt in the bowl of a food processor and pulse to blend. Add the butter and egg yolks and process until the mixture forms a ball. Scrape onto a sheet of plastic and wrap it tightly. Chill the dough for an hour or overnight.", 
            "Prepare the filling: Grind seeds in a coffee grinder. Heat milk, sugar, orange zest, ground poppy seeds and raisins in a small saucepan over medium heat. On a low simmer, cook until the seeds absorb the milk, thickening the mixture, about 15 minutes. Add the lemon juice, brandy, orange liqueur and butter and cook for 2 minutes more. Finally, add the vanilla and stir to combine. Remove from heat to let cool completely. I sped this up in the fridge.", 
            "Form the cookies: Line two baking sheets with parchment paper. Roll out the dough to just under 1/4-inch thickness (1/4 was suggested; I found it a little thick for smaller cookies) and use a cookie cutter or glass to cut 2 1/4-inch circles (see Note up top for other sizes). Put a heaping half-teaspoon of the filling in the center of each and press up the sides to form triangles. If your dough comes out like mine did, this will be kind of annoying as the dough will crack when you want it to bend. Don’t be deterred, just smoosh the sides back on and mold it, if needed, into the proper shape. Arrange on prepared trays (transfer cookies with a spatula, as they are fragile before they are baked) and brush the tops with beaten egg for glaze. Return tray to the fridge for 20 to 30 minutes; chilling them again will help them hold their shape while they are baked. Meanwhile, preheat your oven to 350°F", 
            "Bake: Until cookies are golden, about 10 to 15 minutes. If trays are on different racks, switch them after about 5 minutes. "
        ], 
        "date": "2011-03-18T13:36:18+00:00"
    }
]