{
  "date": "2011-12-12T13:57:38+00:00",
  "directions": [
    "Place the eggs in a saucepan and cover with water. Bring to a boil over high heat. Once water begins to boil, reduce it to medium-low and simmer eggs for exactly 10 minutes. Drain eggs and cover with cold water. Sitting them in ice water will help the eggs chill more quickly.",
    "Do ahead: As I discovered giving your eggs two to four days to rest in the fridge ensures that they peel more easily. If you’ve got time, do this now.",
    "Arrange 12 small lettuce leaves on a serving platter. Carefully peel the eggs and cut in half lengthwise. Remove the yolks and place them in a small bowl. Arrange the whites on leaves. Mash the yolks with the mayo, Dijon, Worcestershire (if using), lemon juice and 1 tablespoon of the parsley until smooth. Season generously with salt and freshly ground black pepper. Set the filling aside.",
    "In a small skillet, heat the olive oil over medium heat. Add the anchovy and garlic and cook, stirring, until the anchovy begins to dissolve into the oil, about 1 minute. Add the lemon zest and bread crumbs and saute them until golden, about 2 to 3 minutes. Stir in Parmesan and set crumbs aside.",
    "When you’re ready to serve the eggs, spoon the yolk mixture back into the cavities of the egg whites, mounding it slightly in the center. (To make extra-cute eggs, you can pipe the filling with a star tip.) Sprinkle each egg with some of the crumb mixture (about 1 teaspoon), allowing some to spill onto the lettuce cups. Garnish with remaining chopped parsley and serve."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/caesar-salad-deviled-eggs.jpg?w=750",
  "ingredient_list": [
    "6 large eggs",
    "12 small romaine lettuce leaves",
    "2 to 3 tablespoons mayo (2 is suggested but 3 will make a creamier filling)",
    "2 teaspoons smooth Dijon mustard",
    "1/4 teaspoon Worcestershire sauce (optional)",
    "1/2 teaspoon lemon juice",
    "2 tablespoons chopped fresh flat-leaf parsley",
    "Salt and freshly ground black pepper",
    "1 tablespoon olive oil",
    "1 anchovy fillet, minced",
    "1 small clove garlic, minced",
    "1/4 teaspoon grated lemon zest",
    "1/4 cups (30 grams) panko bread crumbs",
    "2 tablespoons freshly grated Parmesan cheese or more to taste"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Easter",
    "Photo",
    "Snack"
  ],
  "title": "caesar salad deviled eggs",
  "url": "https://smittenkitchen.com/2011/12/caesar-salad-deviled-eggs/"
}