{
  "date": "2013-12-20T12:29:43+00:00",
  "directions": [
    "Make pie crust: Whisk together flour, and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in the water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough roughly in half (it’s okay if one is slightly larger). Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day. [Still freaked out about making your own pie dough? Read this for a ton of additional tips and details.]",
    "Heat oven  oven to 375 degrees F. Line bottom of 10x15x1-inch baking sheet or jellyroll pan with parchment paper.",
    "Prepare filling: Place potatoes in a medium saucepan and cover with cold water. Bring to a boil, then reduce to a simmer, cooking for 7 to 10 minutes, until potatoes are tender but not falling apart. Drain. ",
    "Wash spinach but no need to dry it. Place wet spinach in hot skillet and cook until it just wilts. Drain in a colander, pressing or squeezing out as much liquid as possible. You should have about 1 cup of spinach one wilted and squeezed. If spinach leaves were large, you might want to roughly chop the squeezed-out piles of spinach before adding it to the filling. ",
    "Assemble pie: On a lightly floured surface, roll one of your dough halves (the larger one, if you have two different sizes) into an 18-by-13-inch rectangle. This can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible and using enough flour that it doesn’t stick to the counter. Transfer to your prepared baking sheet and gently drape some of the overhang in so that the dough fills out the inner edges and corners. Some pastry will still hang over the sides of the pan; trim this to 3/4-inch overhang.",
    "Layer vegetables evenly over bottom pie crust. [You don’t want your pie to look like this, after all. NSFW language there, btw.] If using the fillings that I did, beat 11 whole eggs and 1 egg white lightly and pour over vegetables. If you’ve used other fillings, you might find that you need more or fewer eggs to mostly fill (I did not want to fill the crust to the top with eggs, as it would have been more difficult to bake without filling) the bottom crust; if you’re nervous, just beat a few eggs at a time and pour them in until your filling reaches the desired level. Sprinkle with salt and many grinds of black pepper.",
    "Roll the second of your dough halves (the smaller one, if they were different sizes) into a 16-by-11-inch rectangle. Drape over filling and fold the bottom crust’s overhang over the edges sealing them together. Cut only a couple tiny slits in the lid to act as vents — too many or too big, and the filling will want to leak out before the eggs set. Beat remaining egg yolk with 1 teaspoon water and brush over lid. ",
    "Bake pie: Until crust is golden and filling is set, about 40 to 45 minutes. Transfer to a wire rack and cool a bit before cutting into squares.",
    "Do ahead: I haven’t frozen this pie, but suspect that it will freeze well already baked. Or, you could make the pie doughs up to one month in advance (storing them in the freezer), four days in advance (to store in the fridge) and roll them out when you’re ready to bake the pie. Baked slab pie will keep in the fridge for 3 to 4 days. Squares can be reheated as needed. Vegetables can be prepped (spinach wilted, potato par-boiled) and stored in the fridge for 2 days before using."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/breakfast-slab-pie1.jpg?w=640",
  "ingredient_list": [
    "Crust",
    "3 3/4 (470 grams) cups all-purpose flour (feel free to replace up to half with whole-wheat)",
    "1 1/2 teaspoons table salt",
    "3 sticks (340 grams) unsalted butter, very cold",
    "3/4 cup very cold water",
    "Filling",
    "1 pound yukon gold potatoes, peeled if desired, cut into 1/2-inch slices",
    "10 ounces spinach (baby, “grown-up,” or frozen)",
    "1 cup coarsely grated sharp cheddar cheese",
    "4 scallions, thinly sliced",
    "11 large eggs + 1 large egg white (you’ll use the yolk in a minute)",
    "1 teaspoon kosher or coarse sea salt, plus more to taste",
    "Freshly ground black pepper",
    "To finish",
    "1 large egg yolk (leftover from filling)",
    "1 teaspoon water"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Eggs",
    "Photo",
    "Potatoes",
    "Spinach",
    "Tarts/Quiche",
    "Vegetarian"
  ],
  "title": "breakfast slab pie",
  "url": "https://smittenkitchen.com/2013/12/breakfast-slab-pie/"
}