{
  "date": "2013-08-05T12:19:43+00:00",
  "directions": [
    "Make dough: Whisk stir the flour and salt in a large bowl. Sprinkle bits of butter over dough and using a pastry blender or your fingertips, work it into the flour until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, stir together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball. Wrap with plastic and refrigerate for 1 hour, or up to 2 days.",
    "Make filling: Get down the saute pan with the lid. If you don’t have one, any large lid will do. Add olive oil, tomatoes, salt and a pinch of red pepper flakes (if that’s your thing) to your saute pan then cover and heat over high heat. Roll the tomatoes around from time to time so that they’ll cook evenly. In a few minutes, you’ll hear some putts and pops as the tomatoes burst a little. When most have, remove lid, turn heat down to medium and add zucchini chunks. Saute for two minutes, until they soften. Add corn and cook one minute. Add scallions, just stirring them in, then turn off heat. Adjust seasonings if needed. Transfer mixture to a large plate and spread it out, so that it will cool faster. You want it cooled to at least lukewarm before assembling the galette.",
    "Assemble galette: Heat oven to 400 degrees. On a floured counter, roll the dough out into a 12-inch round and it really doesn’t need to be perfectly shaped. Transfer to a parchment-lined baking sheet; I like to fold my dough gently, without creasing, in quarters then unfold it onto the baking pan. Sprinkle tomato-zucchini-corn mixture with half of parmesan and spoon the mixture into the center of the dough, leaving a 2-inch border. If any liquid has puddle in plate, try to leave it there as you spoon. Sprinkle with almost all of remaining parmesan, leaving a pinch or two behind for the crust. Fold the border over the filling, pleating the edge to make it fit. The center will be open. Brush crust with egg yolk glaze. Sprinkle glaze with last pinches of parmesan.",
    "Bake the galette: For 30 to 40 minutes, or until puffed and golden brown. Remove from the oven and let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/burst-tomato-zucchini-and-corn-galette.jpg?w=750",
  "ingredient_list": [
    "For the pastry:",
    "1 1/4 cups (160 grams) all-purpose flour",
    "1/4 teaspoon table salt",
    "8 tablespoons (4 ounces or 113 grams) cold unsalted butter, cut into pieces and chill again",
    "1/4 cup (60 grams) plain yogurt or sour cream",
    "2 teaspoons (10 ml) fresh lemon juice",
    "1/4 cup (60 ml) ice water",
    "For the filling:",
    "1 tablespoon (15 ml) olive oil",
    "1/4 teaspoon coarse Kosher or sea salt",
    "3 cups (about 450 grams) cherry or grape tomatoes",
    "1 ear corn, cut from the cob (about 1 cup)",
    "1 small (8 ounces or 225 grams) zucchini or summer squash, diced",
    "1 bundle (3 to 4 ounces or 85 to 115 grams) scallions, thinly sliced",
    "1/2 cup (2 ounces or 55 grams) grated parmesan",
    "Glaze:",
    "1 egg yolk beaten with 1 teaspoon water"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Corn",
    "Photo",
    "Picnics",
    "Summer",
    "Tarts/Quiche",
    "Tomatoes",
    "Vegetarian",
    "Zucchini"
  ],
  "title": "burst tomato galette with corn and zucchini",
  "url": "https://smittenkitchen.com/2013/08/burst-tomato-galette-with-corn-and-zucchini/"
}