{
  "date": "2006-12-26T13:39:32+00:00",
  "directions": [
    "Preheat oven to 375°F. Cook bacon in heavy large skillet until crisp, about 8 minutes. Transfer bacon to paper towels to drain. Coarsely crumble bacon. Discard all but 1/4 cup plus 2 teaspoons bacon fat (adding olive oil if necessary to equal that amount).",
    "Heat 2 teaspoons reserved bacon fat in heavy medium skillet over medium heat. Add chopped onion and saute until tender, about 5 minutes. Transfer to medium bowl and cool; mix in bacon, spinach, feta, cream cheese, and crushed red pepper. Season filling to taste with salt and pepper.",
    "Line 2 large rimmed baking sheets with foil. Toss mushrooms and reserved 1/4 cup bacon fat in large bowl to coat. Sprinkle mushrooms with salt and pepper. Place mushrooms, rounded side down, in single layer on prepared baking sheets. Bake mushrooms until centers fill with liquid, about 25 minutes. Turn mushrooms over. Bake mushrooms until brown and liquid evaporates, about 20 minutes longer. Turn mushrooms over again. Spoon 1 heaping teaspoon filling into each mushroom cavity. (Filled mushrooms can be prepared 1 day ahead. Cover and refrigerate.)",
    "Preheat oven to 375°F. Bake mushrooms until heated through, about 10 minutes. Transfer mushrooms to platter and serve warm."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/just-a-few-bites1.jpg?w=500",
  "ingredient_list": [
    "1 cup milk",
    "4 tablespoons unsalted butter (1/2 stick)",
    "1/4 teaspoon salt",
    "Dash cayenne pepper",
    "1 cup all-purpose flour",
    "3 large eggs",
    "1/2 teaspoon paprika",
    "1/2 cup grated Parmesan cheese",
    "1 1/2 cups grated Swiss cheese (Emmenthaler or Gruyere)",
    "Coarse salt (fleur de sel or kosher salt) to sprinkle on top ",
    "8 ounces bacon slices",
    "1 cup chopped onion",
    "1 10-ounce package chopped frozen spinach, thawed, squeezed dry",
    "4 ounces feta cheese, crumbled (about 3/4 cup)",
    "4 ounces cream cheese, room temperature",
    "1/4 teaspoon dried crushed red pepper",
    "2 3/4 pounds button mushrooms (about 48; each about 1 1/2 inches in diameter), stemmed"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Mushrooms",
    "Photo"
  ],
  "title": "gougères + stuffed mushrooms",
  "url": "https://smittenkitchen.com/2006/12/just-a-few-bites/"
}