{
  "date": "2014-11-13T11:46:18+00:00",
  "directions": [
    "Make dough: Warm milk and sugar together until they’re about 105 to 110°F (41 to 44°C) in the bottom of a large mixing bowl. If you don’t have a thermometer, the correct temperature is when you can dip your finger into the liquid without noticing any temperature change (i.e. not warmer or cooler than your finger). Add yeast to milk-sugar mixture and let stand for 5 to 7 minutes. It should dissolve and become slightly foamy. ",
    "Stir in butter, then 3/4 of flour, the salt, then remaining flour. Using spoon (for manual mixing) or dough hook (of a stand mixer), mix the dough until it forms a slightly sticky dough that balls together. If making by hand, turn out onto a floured counter and knead until smooth and elastic, about 10 minutes. If using a machine, let the dough hook do the work, running it for 5 minutes on low. If, at the end of the kneading process, the dough still feels quite sticky (a little sticky is good; more tips here), add 1 more tablespoon flour.",
    "First rise: With kneaded dough on counter, butter or oil your mixing bowl. Return dough to bowl, cover with plastic wrap and place in a draft-free warmish spot for 1 hour, or until doubled in bulk.",
    "Second rise: Butter an 8×8-inch square or equivalent size baking pan (such as a 9-inch round cake pan or deep-dish pie plate). Flour your counter and let dough fall out onto it. I like to take advantage of the round shape left by the bowl to divide my dough into even-enough wedges, like slices of a pie. Divide into 16 pieces. Form each into a round. Arrange seam side-down in prepared pan, with an even amount of space between rolls. Cover loosely with plastic wrap and let rise for another hour. About 10 minutes before the hour is up, begin the next step to heat the oven and prep pretzel wash.",
    "Pretzel it! Heat oven to 375°F (190°C). If using the baking soda option, bring your water to a boil and slowly stir in baking soda — it will foam up. If using the food-grade lye option, do not heat your water, just stir the lye into the water in a sink, wearing gloves (see more precautions in Notes below). ",
    "Thoroughly brush tops and creases between rolls (as best as your brush can get in) with the lye or soda pretzel wash. Rinse brush and beat your egg with 1 teaspoon water. Brush the rolls a second time, this time with the egg wash. Sprinkle rolls with either sesame seeds or coarse salt. Use a sharp paring knife to make +-sign slashes in the top of each roll; you want to cut at least 1/2-inch down (I always make my cuts too shallow and they get lost when baked). ",
    "Bake: Bake rolls for 20 to 25 minutes, until a lovely brown on top. Let cool in pan on rack. Salt-topped rolls are best on the first day. Sesame-topped rolls keep better, and can easily be frozen and stashed for future bread emergencies urgencies.",
    "Notes:"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/pretzel-parker-house-rolls1.jpg?w=640",
  "ingredient_list": [
    "Rolls",
    "3/4 cup plus 2 tablespoons milk",
    "1 1/2 tablespoons granulated sugar",
    "1 1/4 teaspoons (half a 1/4-ounce or 7-gram packet) active dry yeast",
    "3 tablespoons unsalted butter, melted, plus extra to coat bowl",
    "2 cups flour, either all-purpose or bread flour, or a mix thereof, plus extra for dusting",
    "1 teaspoon fine sea or table salt",
    "To finish",
    "1/2 cup water",
    "1 1/2 teaspoons baking soda or food-grade lye (see Notes below)",
    "1 egg, beaten with 1 teaspoon water",
    "Pretzel salt, coarse salt or sesame seeds"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Bread",
    "Photo",
    "Side Dish",
    "Thanksgiving"
  ],
  "title": "pretzel parker house rolls",
  "url": "https://smittenkitchen.com/2014/11/pretzel-parker-house-rolls/"
}