{
  "date": "2010-05-24T11:18:40+00:00",
  "directions": [
    "Set your table and pour your coffee. I am an absolutely nut about eating my eggs the second they come out of the pan, and to do this, your table needs to be ready for you; your troops should be gathered. Toast your bread, then smear it with the goat cheese and sprinkle it with half the chives. Set it aside. (P.S. If you decide to butter it before adding the goat cheese, I will not tell anyone.)",
    "Beat eggs with milk, salt and pepper in a small bowl, with a fork, until combined, with a few big bubbles. Heat a large sauté pan over medium-low heat; once hot, add butter. Once butter is melted and foamy, add eggs and pause; count to 20 if you must, but let those eggs begin to set up before you start nudging away at them. Using a wooden spoon or spatula, begin push your eggs once from the outside to the center of the pan and pause again; count to 5 if you must, before continuing with another push. Continue in this manner around the pan as if you were trying draw spokes of a wheel through your eggs with your spatula, pausing for 5 seconds after each push. Go around the pan as many times as needed, until your eggs in the center are ribbony damp pile — it should look only 75 percent cooked. Use your spoon or spatula to break up this pile into smaller chunks — to taste. Your eggs should now look almost 90 percent cooked.",
    "Immediately remove the pan from the heat and pile the scrambled eggs bits high on your goat cheese toast. Sprinkle with an additional grind of black pepper and remaining chives. Eat immediately."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/scrambled-egg-toast.jpg?w=750",
  "ingredient_list": [
    "2 large eggs",
    "2 tablespoons milk, half-and-half or cream",
    "1/8 teaspoon salt",
    "Few grinds black pepper",
    "2 teaspoons butter or olive oil",
    "A 1-inch thick piece of bread",
    "1 tablespoon goat cheese, softened a bit (though cream cheese is a great swap here)",
    "1 teaspoon chives or scallion greens, thinly sliced"
  ],
  "tags": [
    "Breakfast",
    "Eggs",
    "Photo",
    "Quick"
  ],
  "title": "scrambled egg toast",
  "url": "https://smittenkitchen.com/2010/05/scrambled-egg-toast/"
}