{
  "date": "2016-06-07T12:01:16+00:00",
  "directions": [
    "\nCook pasta: In very well salted water until 1 to 2 minutes before doneness and drain.\nPrepare eggplant: Trim eggplant and slice into 1/2-inch coins. Brush both sides with olive oil and sprinkle with salt and freshly ground black pepper. Heat grill to medium-high. Arrange eggplant in one layer and cook until charred underneath, about 8 minutes. (If it’s sticking to the grill, it wants to cook longer.) Flip pieces over and cook until charred on second side, about 5 to 8 minutes more. Set aside to cool slightly then chop into chunks.\nNo grill? Heat oven to 425. Trim eggplant and slice into 1/2-inch coins. Coat a baking sheet generously with olive oil, arrange eggplant on top and sprinkle with salt and pepper. Roast, without disturbing, for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release easily; if they don’t want to, cook them a few minutes longer. Flip each piece, sprinkle again with salt and pepper, and roast on the second side for 10 to 12 minutes, or until charred underneath again.\nMake dressing: In food processor, coarsely grind walnuts, cheese, garlic, thyme, salt and freshly ground black pepper and/or red pepper flakes. Stir in oil and tomatoes, then whisk in vinegar to taste.\nAssemble salad: Toss cooked pasta with walnut dressing and additional vinegar and oil to loosen (I used about 1 tablespoon extra oil and 2 tablespoons extra vinegar in total). Chop eggplant into chunks, add to bowl and toss again. Adjust seasonings to taste, then stir in cheese and herbs."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/06/charred-eggplant-and-walnut-pesto-pasta-salad1.jpg?w=750",
  "ingredient_list": [
    "Salt",
    "1/2 pound pasta (I used Setaro’s organietti, but other radiatore shapes are great here)",
    "1 medium eggplant (1 pound)",
    "Freshly ground black pepper",
    "Additional sherry or red wine vinegar",
    "2 ounces ricotta salata, crumbled",
    "2 tablespoons chopped flat-leaf parsley or basil",
    "3/4 cup (2 3/4 ounds ounces) walnuts, toasted and cooled first for best flavor",
    "3 tablespoons grated Parmesan cheese",
    "1 small garlic clove, peeled",
    "2 sprigs of thyme, cleaned",
    "Salt",
    "2 teaspoons sherry vinegar, plus more at end",
    "1/4 cup olive oil, plus more at end",
    "2 tablespoons (about 3) minced sun-dried tomatoes (oil or dry-packed will both work)",
    "Freshly ground black pepper and/or red pepper flakes"
  ],
  "tags": [
    "Eggplant",
    "Grilling",
    "Pasta",
    "Photo",
    "Salad",
    "Summer",
    "Vegetarian"
  ],
  "title": "charred eggplant and walnut pesto pasta salad",
  "url": "https://smittenkitchen.com/2016/06/charred-eggplant-and-walnut-pesto-pasta-salad/"
}