{
  "date": "2017-01-06T13:17:38+00:00",
  "directions": [
    "Make your filling: Combine chicken, soy sauce, salt, sesame oil, ginger, chives and pepper in a bowl with a fork. If you’d like to test for seasoning, put a tiny dab in a microwave-safe bowl or plate and cook for 10 very splattery seconds. Adjust flavors as desired.\nForm your wontons: Place a few wontons wrappers on your counter. Cover the remaining ones with a piece of plastic wrap. Place 1 heaped teaspoon (from a measuring spoon set) in the center. Use your fingers dipped in water to dampen the edges. Fold one corner diagonally across to the other, pressing air out as you seal it shut. Then, bring the two corners on the wide side of the triangle down below it and use a dab of water to seal them shut. You’re not trying to pull the corners across the belly, but pointing downward. Lightly sprinkle a big plate with cornstarch and place form wontons on it. Repeat with remaining wontons. I found that after I’d made a couple and got the hang of it, I could lay out 6 at a time and get each batch of 6 done in 2 minutes, meaning that this process took me about 20 minutes total.\nFix up your stock (optional): While you’re forming wontons, should you want to enhance your stock (see note up top first), chop the white and light green parts of your scallions into 1/2- to 1-inch segments. Cut dark green tops into thin slivers and save for garnish later. Place stock in 3 to 4-quart pot with sliced ginger, the white and light green scallions you’ve just chopped, garlic and soy sauce or salt, as needed, to season. Simmer them together for 20 minutes while you make the wontons, then strain out the ginger, scallions and garlic.",
    "Cook the wontons: Once your wontons are formed, you can cook them right in the simmering broth or you can do so in simmering water — the latter is better so that the cornstarch on the wrappers doesn’t make the soup cloudy. Boil wontons for 3 minutes to cook them inside; this is really all it takes, but if you’re nervous, cut one in half to make sure.\nTo finish soup: Add spinach to simmering broth and let cook for one minute, until softened. Add cooked wontons to broth and let them warm through again for 30 seconds. Ladle wontons and soup into bowls. I used about 1 1/4 cups broth and 6 wontons per serving. Drizzle each dish with a little toasted sesame oil, a bit of soy sauce (if desired) and scatter with reserved dark green scallion tops. Dig in.\nDo ahead: Wontons can be formed and refrigerated for a day, or frozen for a month or longer."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/01/chicken-wonton-soup.jpg?w=750",
  "ingredient_list": [
    "3/4 pound ground chicken",
    "1 teaspoon soy sauce",
    "3/4 teaspoon kosher salt",
    "1 1/2 teaspoons toasted sesame oil",
    "1 1/2 teaspoons grated fresh ginger",
    "3 tablespoons minced garlic chives, regular chives or scallions",
    "Ground white pepper, to taste",
    "50 wonton wrappers (about 12 ounces), thawed if frozen, thinnest ones you can find",
    "Cornstarch, to prevent sticking",
    null,
    "A 3-inch piece of ginger, peeled and sliced",
    "2 large garlic cloves, crushed",
    "1 bundle scallions, to be used here and to finish",
    "Soy sauce or salt, to taste",
    "3 ounces baby spinach leaves (a few handfuls)",
    "Toasted sesame oil and soy sauce, to taste"
  ],
  "tags": [
    "Chicken",
    "Chinese",
    "Photo",
    "Soup",
    "Weeknight Favorite",
    "Winter"
  ],
  "title": "chicken wonton soup",
  "url": "https://smittenkitchen.com/2017/01/chicken-wonton-soup/"
}