{
  "date": "2012-06-22T11:02:12+00:00",
  "directions": [
    "Make the dipping sauce: Whisk ingredients in a small serving bowl, making sure to dissolve the sugar. Leave to ripen for 15 minutes. Refrigerate any extra and use within a few days. ",
    "Make the peanut dressing: In a blender or small food processor, puree all ingredients to a smooth sauce, about the thickness of heavy cream. Pour into a serving bowl. ",
    "Marinate the chicken: Stir together 1/2 the dipping sauce and 1/3 the peanut dressing (you can eyeball this) in the bottom of a low-sided bowl or dish. Add the chicken to the mixture and toss to coat. Let marinate at least 15 minutes.",
    "Cook the noodles: Bring a large pot of water to the boil, then turn off the heat. Add the rice vermicelli and soak for 7 to 8 minutes. (Package directions may vary; check for doneness by tasting.) Drain when noodles are al dente, and cool under running water. Fluff and leave in strainer to drain well.",
    "Cook the chicken: Grill the chicken on an outdoor grill, a stove-top grill pan, or run under the broiler until nicely browned, about 3 to 4 minutes a side. Let cool slightly, then chop roughly into 3/4-inch pieces. ",
    "To serve: At this point, you can place everything on a large serving platter, with piles or small bowls for noodles, vegetables, chicken, the dressing and marinade and toppings (peanuts, herbs) and let your family and friends put it together in their own bowls as they wish. Or, you can assemble it for everyone as suggested:",
    "Toss vegetables with 1 tablespoon dipping sauce in a small bowl. Divide the cooked noodles among 4 to 6 bowls. Top each bowl equally with vegetable mixture and chopped chicken. Toss each bowl with 2 teaspoons of each the dipping sauce and dressing, or more to taste (we wanted more). Add the herbs, peanuts and scallions to each bowl and serve with additional dressing and dipping sauce on the side. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/06/cold-rice-noodles-with-peanut-lime-chicken.jpg?w=751",
  "ingredient_list": [
    "Dipping sauce",
    "6 tablespoons Asian fish sauce",
    "6 tablespoons brown sugar",
    "12 tablespoons lime juice",
    "2 garlic cloves, finely grated or minced",
    "Small Thai or Serrano chiles, thinly sliced, to taste ",
    "Peanut dressing",
    "3 tablespoons Asian fish sauce",
    "3 tablespoons rice vinegar",
    "9 tablespoons lime juice",
    "3 tablespoons soy sauce",
    "1 one-and-a-half inch chunk ginger, peeled and sliced",
    "6 tablespoons natural unsalted peanut butter",
    "1 tablespoon toasted sesame oil",
    "Pinch of cayenne ",
    "Chicken and noodle salad",
    "1 1/4 pounds boneless skinless chicken thighs (about 6)",
    "8 ounces dried rice vermicelli or other rice noodles",
    "2 small cucumbers, cut in 1/4-inch half moons",
    "2 medium carrots, cut in thin julienne",
    "Additional vegetables, as suggested above",
    "Small handful basil or mint or cilantro sprigs, or your favorite of the three (torn or roughly chopped)",
    "4 or more scallions, slivered",
    "1/4 cup crushed or chopped roasted peanuts",
    "Lime wedges (to serve)"
  ],
  "tags": [
    "Carrots",
    "Chicken",
    "Citrus",
    "Cucumber",
    "Pasta",
    "Photo",
    "Summer",
    "Thai",
    "Vietnamese"
  ],
  "title": "cold rice noodles with peanut-lime chicken",
  "url": "https://smittenkitchen.com/2012/06/cold-rice-noodles-with-peanut-lime-chicken/"
}