{
  "date": "2014-12-04T09:38:12+00:00",
  "directions": [
    "Combine all ingredients in a food processor and blend until powdery. Don’t have a food processor? Chop or grate the chocolate until it is as fine as you can get it, and stir it into the remaining ingredients. Mixture keeps in an airtight container at room temperature for up to 2 months.",
    "To use: Heat one cup of milk (coconut, almond or others would work here too) in a saucepan over medium heat until steamy. Add 3 tablespoons hot cocoa mix. Whisk over heat for another minute or two, until it begins to simmer and mix is completely dissolved. Pour into mug, top with mini-marshmallows or a dollop of whipped cream and hide somewhere nobody will make you share give it to someone you love.",
    "Other flavors: CI walks you through how to make variations including Mexican Hot Chocolate (with some chile powder, cayenne and cinnamon), Mint Hot Chocolate (with mint extract instead of vanilla), Mocha Hot Chocolate (with a couple tablespoons of espresso powder) and usually I’d say “have fun with it!” I mean, you can and should. But I have to admit to being a bit of a traditionalist with my cocoa, and would take the pure chocolate flavor of the above recipe over anything that would clutter my tastebuds. Then again, maybe you shouldn’t listen to someone who needs a minimum of two dozen mini-marshmallows on a single cup of hot chocolate?",
    "Packaging ideas: Had I more time, I might have picked up some charming Weck Juice Jars or Tulip Jars (.5 liter size, which will give you some space at the top — perfect for a handful of marshmallows?), either of which can be used later for pickling or storage. I used Mason jar-ish mugs with lids (1, 2), which could be used later for hot chocolate consumption. You could tie a a tablespoon measure on as well with ribbon, to make their end of the work even easier. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/decadent-hot-chocolate-mix1.jpg?w=640",
  "ingredient_list": [
    "1/2 cup (100 grams) granulated sugar",
    "1 tablespoon (8 grams) cornstarch",
    "3 ounces (85 grams) semi- or bittersweet chocolate, roughly chopped",
    "1/2 cup (40 grams) cocoa powder, any kind you like",
    "1/4 teaspoon vanilla extract or the seeds from a tiny segment of fresh vanilla bean",
    "1/8 teaspoon fine sea salt or 1/4 teaspoon kosher salt"
  ],
  "tags": [
    "Chocolate",
    "Drinks",
    "Photo",
    "Snack",
    "Winter"
  ],
  "title": "decadent hot chocolate mix",
  "url": "https://smittenkitchen.com/2014/12/decadent-hot-chocolate-mix/"
}