{
  "date": "2015-06-05T11:31:40+00:00",
  "directions": [
    "Heat your oven: To 350°F (175°C). ",
    "Prepare pans: Line the bottom and sides of 1 9×13-inch baking sheet or 2 8×8-inch cake pans with foil, then lightly coat foil with nonstick spray. Arrange crackers in a single layer so that they fit in the bottom of your pan. In a perfect world, you wouldn’t have to cut any to make them fit flat. In ours, I used a serrated knife to cut several to fit neatly. Having no crackers overlap will make it easier to spread the caramel in a few minutes.",
    "Make toffee: In a medium-sized saucepan over medium heat, melt butter and brown sugar together. Stir until it begins to boil, then whisk (which will help the butter and sugar come together) for 2 to 3 more minutes. Remove from heat and stir in vanilla. I only add salt at this point if using unsalted crackers, i.e. not saltines. Pour over cracker-lined pan(s) and use an offset spatula to evenly spread the caramel, working quickly as it will be eager to cool and set. ",
    "Bake: In heated oven for 10 to 15 minutes, checking in at 10 minutes to make sure the corners aren’t darkening too quickly. Remove from oven and scatter chocolate chips over caramel crackers. Wait 5 minutes for them to soften, then use a spatula to spread the chocolate into an even layer. Sprinkle with nuts and a couple pinches of sea salt. ",
    "Chill crackers: Transfer pan(s) to freezer until absolutely cold and solid, about 15 to 30 minutes. Using the foil to lift toffee sheet, carefully transfer the candy to a cutting board and remove the foil. If you’ve made this in one pan, cut your sheet evenly in half with a serrated knife. ",
    "Assemble ice cream sandwich block: Line the bottoms and sides of your baking pan (now foil-free) with a piece of plastic wrap. Place your first sheet of candy chocolate side down in the bottom of your pan. Scoop your desired amount of ice cream over the sheet and spread it into an even layer. Place second sheet of candy, chocolate side up, on top, pressing it onto the ice cream. Return to freezer for several hours, at least 4 but probably 8 is best to get the block of sandwiches solid enough to cut without being completely aggravating.",
    "Cut block into individual sandwiches: When sandwich block is frozen solid, transfer to a cutting board (you can also freeze your cutting surface for 10 minutes before using, to give you more time before things get too melty) and use a sharp serrated knife to very, very carefully saw your block into ice cream sandwich squares. I cut my 8×8-inch blocks into 16 2-inch sandwiches. This is definitely the peskiest part. If things warm and melt too fast, just place the whole thing back in the freezer for 10 minutes before continuing. ",
    "Once cut, return sandwiches to freezer to let them firm up again, before transferring them to a container or freezer bag for store, or, you know, your mouth for near-immediate gratification. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/saltine-crack-ice-cream-sandwiches1.jpg?w=640",
  "ingredient_list": [
    "32 (about 100 grams) saltine-style crackers",
    "1/2 cup (115 grams) unsalted butter, cut into a few large pieces",
    "1/2 cup (95 grams) packed light or dark brown sugar",
    "1/4 teaspoon vanilla extract",
    "1 1/3 cups (8 ounces) dark chocolate (semi- or bittersweet) chips or the equivalent amount of chopped chocolate",
    "2/3 cup toasted, chopped almonds or a nut of your choice (optional)",
    "Sea salt for sprinkling",
    "1 1/2 to 2 cups ice cream, any flavor (we used vanilla)"
  ],
  "tags": [
    "Ice Cream/Sorbet",
    "Photo",
    "Summer"
  ],
  "title": "saltine crack ice cream sandwiches",
  "url": "https://smittenkitchen.com/2015/06/saltine-crack-ice-cream-sandwiches/"
}