{
  "date": "2013-07-08T12:17:31+00:00",
  "directions": [
    "Brine the chicken: In a large plastic container, mix water, salt, sugar and vinegar. Add chicken parts and cover with a lid or plastic wrap in the fridge, for at least 1 hour and up to 6. ",
    "Make the rub: Mix ingredients.",
    "Prepare chicken: Heat oven to 300 degrees. Remove chicken parts from brine and pat dry. Place pieces of chicken on two very large pieces of foil, large enough to fold over chicken and form packets. Pat chicken pieces generously on all sides with rub; do not be shy about using more than seems… seemly. Turn the chicken pieces so their meatier sides are down, and tightly fold the foil around them to make two large packets.",
    "Place two cooling racks (which will act as baking racks) on two baking sheets (one on each). Place a chicken packet on each and place one sheet on an upper oven rack and one on a lower. Bake chicken for 1 hour, then rotate baking sheets. Bake for another 30 to 60 minutes, until the internal temperature of the thickest part of each chicken reads 155 degrees. (Chicken is done at 160. This leaves you a little heat window for the next step, without leading to overcooking. If you’d like to skip this, just cook the chicken in foil until it reaches 160.)",
    "Finish the chicken: Heat broiler. Carefully open each packet of chicken and pour accumulated juices into a saucepan (to make a sauce in a minute). Arrange chicken pieces on open foil packets and run each tray under the broiler until lightly crisped at edges and cooked through. Place on serving platter.",
    "Make a sauce* from the juices: Boil your accumulated juices in the saucepan over high heat for anywhere from 5 to 10 minutes, until it makes a syrupy sauce that coats a spoon. I like to add a squeeze of honey for flavor while it reduces. Once syrupy, add 1 teaspoon apple cider vinegar. Serve with chicken. ",
    "* I wanted to warn that I love making sauce this way, but it always ends up a bit too salty from all of that reduction. You could use less or simply skip this step, using instead another barbecue sauce of your choosing (this one says “Remember me?!”, should you desire sauce with your chicken."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/slow-and-low-dry-rub-oven-chicken.jpg?w=750",
  "ingredient_list": [
    "Brine",
    "4 cups water",
    "1/3 cup Kosher salt",
    "1/3 cup white or brown sugar",
    "1/3 cup white vinegar",
    "Dry Rub",
    "6 tablespoons packed dark brown sugar",
    "4 tablespoons sweet or smoked paprika",
    "3 tablespoons chili powder",
    "Up to 1 tablespoon ground red pepper (if you like things quite hot) or to taste (I used 1/2 teaspoon)",
    "2 teaspoons garlic powder",
    "1 teaspoon ground cumin",
    "1/2 teaspoon ground nutmeg",
    "2 tablespoons Kosher salt",
    "Up to 1 tablespoon coarsely ground black pepper",
    "Chicken",
    "5 1/2 to 6 pounds mixed bone-in skin-on chicken parts (we used 2 small chickens, each in 8 parts)",
    "Sauce",
    "A generous squeeze of honey",
    "1 teaspoon cider vinegar"
  ],
  "tags": [
    "Chicken",
    "Grilling",
    "Photo",
    "Summer"
  ],
  "title": "slow-and-low dry rub oven chicken",
  "url": "https://smittenkitchen.com/2013/07/slow-and-low-dry-rub-oven-chicken/"
}