{
  "date": "2010-07-01T17:35:06+00:00",
  "directions": [
    "Prepare the bottom crust: Roll out the chilled pie dough into a 12 inch round. Gently fit into a 9- or 9.5-inch pie plate. Fold the edges under and crimp decoratively. Either refrigerate until firm, about 30 minutes (if you don’t wish to blind-bake the crust first) or preheat oven to 425, line dough with foil and weigh it down with pie weights. Bake until crust is light golden brown, about 30 minutes (for a more stable, crisp bottom crust). [Updated to add] Reduce temperature to 375°F.",
    "Prepare the crumble: Grind oats to an oat flour in a food processor (you can also swap 1/2 cup oat flour, if you have it), then add the all-purpose flour, sugar, cinnamon, salt and whole almonds. Grind them together until the nuts are coarsely ground (if you don’t have a food processor, you can chop them medium-fine by hand). Stir together with melted butter in a bowl.",
    "Make the cherry filling: In a large bowl, mix the cherries with the sugar, cornstarch and kosher salt. Taste the mixture to see if you want more sugar than is called for.",
    "Assemble the pie: Pour the cherries into your unbaked or blind-baked pie shell. Sprinkle the almond crumble over the cherries. Place the pie plate on a foil-lined cookie sheet. Bake for about 1 hour and 10 minutes, or until the juices are bubbling and thick. Remove to a rack to cool to room temperature before serving."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sour-cherry-pie-with-almond-crumble1.jpg?w=500",
  "ingredient_list": [
    "For the almond crumble:",
    "2/3 cup whole oats, ground to a flour in a food processor (yielding 1/2 cup oat flour)",
    "1/2 cup all-purpose flour",
    "1/2 cup sugar",
    "1/4 teaspoon ground cinnamon",
    "1/2 teaspoon kosher salt (you might want to first read up on kosher salts)",
    "3/4 cup unsalted whole almonds, coarsely ground in a food processor or chopped medium fine by hand",
    "6 tablespoons unsalted butter, melted and cooled",
    "For the sour cherry filling:",
    "3/4 cup sugar",
    "3 tablespoons cornstarch",
    "1/4 teaspoon kosher salt",
    "2 1/4 pounds fresh sour cherries, pitted, or 2 pounds frozen sour cherries, partially thawed"
  ],
  "tags": [
    "Cherries",
    "Crumbles/Crisps",
    "Photo",
    "Summer",
    "Tarts/Pies"
  ],
  "title": "sour cherry pie with almond crumble",
  "url": "https://smittenkitchen.com/2010/07/sour-cherry-pie-with-almond-crumble/"
}