{
  "date": "2016-03-28T12:00:20+00:00",
  "directions": [
    "Heat oven to 425°. Place chicken on a small rimmed baking sheet and rub with 1 tablespoon olive oil. Season with salt and pepper and roast until golden brown and cooked through, about 25 to 30 minutes. Let cool, then remove skin and bones and shred meat into bite-sized pieces. ",
    "Place shredded chicken in a medium bowl and toss with 1 1/2 tablespoons olive oil, 1 tablespoon vinegar, 1/2 teaspoon kosher salt and freshly ground black pepper until evenly coated. Add cucumber, celery, radishes and scallion to salad and toss to combine. Adjust salt, pepper and vinegar to taste.",
    "If you need horseradish crème fraîche\tin your life — I know I always do — combine crème fraîche, horseradish and a couple pinches salt in a small dish and stir to combine. ",
    "Heap salad on 2 to 3 toasts (i.e. more on 2 or less on 3). Dollop with horseradish creme fraiche, if using, and garnish with herbs.",
    "Do Ahead: Chicken can be cooked 2 days ahead; cover and chill. Shred just before using."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/spring-chicken-salad-toasts1.jpg?w=750",
  "ingredient_list": [
    "1 large skin-on, bone-in chicken breast (about 12 to 14 ounces)",
    "About 2 1/2 tablespoons olive oil",
    "Kosher salt",
    "Freshly ground black pepper",
    "Salt and freshly ground black pepper",
    "1 tablespoon white wine vinegar",
    "1/2 small cucumber, such as a Persian variety, halved, thinly sliced",
    "1 small celery rib, sliced thin",
    "3 radishes, quartered lengthwise, sliced thin",
    "1 scallion, sliced thin",
    "1 tablespoon chopped dill, chives or parsley, or a mix, for garnish",
    "3 tablespoons creme fraiche",
    "1 1/2 teaspoons prepared horseradish, liquid drained off a little, plus more to taste",
    "2 to 3 thin slices rye, pumpernickel or another dense health bread, toasted "
  ],
  "tags": [
    "Celery",
    "Chicken",
    "Cucumber",
    "Photo",
    "Radishes",
    "Salad"
  ],
  "title": "spring chicken salad toasts",
  "url": "https://smittenkitchen.com/2016/03/spring-chicken-salad-toasts/"
}