{
  "date": "2008-06-22T12:22:30+00:00",
  "directions": [
    "Preheat oven to 400°F. ",
    "Stir together the cherries, cornstarch, sugar, salt, lemon and almond extract gently together in a large bowl. ",
    "Roll out half of chilled dough (use larger piece, if you’ve divided them unevenly) on a floured work surface to 13-inch round. Gently place it in 9-inch pie pan, either by rolling it around the rolling pin and unrolling it over the pan or by folding it into quarters and unfolding it in the pan. Trim edges to a half-inch overhang.",
    "Spoon filling into pie crust, discarding the majority of the liquid that has pooled in the bowl. Dot the filling with the bits of cold butter.",
    "Roll out the remaining dough into a 12-inch round on a lightly floured surface, drape it over the filling, and trim it, leaving a 1-inch overhang. Fold the overhang under the bottom crust, pressing the edge to seal it, and crimp the edge decoratively. Brush the egg wash over over pie crust, then sprinkle with coarse sugar. ",
    "Cut slits in the crust with a sharp knife, forming steam vents, and bake the pie in the middle of the oven for 25 minutes. Reduce the temperature to 350°F. and bake the pie for 25 to 30 minutes more, or until the crust is golden. Let the pie cool on a rack."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sweet-cherry-pie1.jpg?w=500",
  "ingredient_list": [
    "4 cups pitted fresh cherries (about 2 1/2 pounds unpitted)",
    "4 tablespoons cornstarch",
    "2/3 to 3/4 cup sugar (adjust this according to the sweetness of your cherries)",
    "1/8 teaspoon salt",
    "Juice of half a lemon",
    "1/4 teaspoon almond extract",
    "1 tablespoon cold unsalted butter, cut into small bits",
    "1 egg, beaten with 2 tablespoons water",
    "Coarse sugar, for decoration"
  ],
  "tags": [
    "Cherries",
    "Fruit",
    "Photo",
    "Summer",
    "Tarts/Pies"
  ],
  "title": "sweet cherry pie",
  "url": "https://smittenkitchen.com/2008/06/sweet-cherry-pie/"
}