{
  "date": "2015-05-20T12:05:56+00:00",
  "directions": [
    "If your berries are large, especially blackberries, cut them in half. Place berries in non-reactive (i.e. not aluminum or tin, which I suspect you weren’t using anyhow) bowl and squeeze 1 tablespoon lemon juice over it (save the peel; you’re about to use it). Add honey, stir to combine. Set aside.",
    "Place lemon peel, water and sugar in a saucepan. Cook, stirring, until it comes to a boil and sugar has dissolved. Gently simmer for 5 minutes more. Strain out peel and chill syrup completely. You can do this in the fridge, but I find it much quicker to set the bowl of syrup in a larger bowl of ice water. Within 15 minutes, it should be quite cold to the touch.",
    "Whisk yogurt and chilled syrup together. ",
    "Place the berry mixture and any juices that have accumulated in a blender and whirl until desired texture. (I left a few tiny chunks throughout.) If you loathe the seeds from raspberries or blackberries, puree fully and press through a fine-mesh strainer to remove seeds. Assemble popsicles by alternating pouring a little of the yogurt mixture, then a little of the berry mixture into each popsicle mold, repeating as desired until you reach 1/4-inch from the tops (to leave room for expansion as they freeze). Use a skewer to lightly swirl the mixtures together.",
    "If using conventional molds, snap on the lid and freeze until solid, 3 to 4 hours. If using glasses or other unconventional molds, freeze until the pops are beginning to set (45 minutes to 1 hour), then insert the sticks and freeze until solid, 3 to 4 hours. If using an instant ice pop maker, follow the manufacturer’s instructions.",
    "My popsicle molds: Can be found here."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/swirled-berry-yogurt-popsicles1.jpg?w=640",
  "ingredient_list": [
    "2 level cups fresh blackberries, or the berry of your choice",
    "2 tablespoons (40 grams) honey",
    "1/2 lemon or 1 small lime",
    "1/2 cup (120 grams) water",
    "1/2 cup (100 grams) granulated sugar",
    "1 1/2 cups (340 grams) plain unsweetened Greek-style yogurt (1 cup fage = 227 grams)"
  ],
  "tags": [
    "Blackberries",
    "Breakfast",
    "Photo",
    "Popsicles",
    "Summer"
  ],
  "title": "swirled berry yogurt popsicles",
  "url": "https://smittenkitchen.com/2015/05/swirled-berry-yogurt-popsicles/"
}