{
  "date": "2007-06-18T20:17:22+00:00",
  "directions": [
    "1. Bring the milk and vanilla bean (pulp and pod) to a boil in a small saucepan over medium heat. Cover the pan, turn off the heat, and set aside for 10 minutes. Or, if you are using vanilla extract, just bring the mil to a boil and proceed with the recipe, adding the extract before you add the butter to the hot pastry cream.",
    "2. Working in a heavy-bottomed medium saucepan, whisk the yolks, sugar, and cornstarch together until thick and pale.  Whisking all the while, very slowly drizzle a quarter of the hot milk onto the yolks.  Then, still whisking, pour the rest of the liquid in a steady stream over the tempered yolks.  Remove and discard the vanilla pod.",
    "3. Put the pan over medium heat and, whisking vigorously and without stop, bring the mixture to the boil.  Keep the mixture at the boil, whisking energetically, for 1 to 2 minutes, then remove the pan from the heat and scrape the pastry cream into a clean bowl.  Allow the pastry cream to cool on the counter for about 3 minutes.",
    "4. Cut the butter into chunks and stir the chunks into the hot pastry cream, continuing to stir until the butter is melted and incorporated.  At this point, the cream needs to be thoroughly chilled.  You can either set the bowl into a larger bowl filled with ice cubes and cold water and, to ensure even cooling, stir the cream from time to time, or refrigerate the cream, in which case you should press a piece of plastic wrap against the surface to create an airtight seal.",
    "(The cream can be kept tightly covered in the refrigerator for up to 3 days or packed airtight and frozen for 1 month.  Defrost overnight in the refrigerator and whip before using to return it to its smooth consistency.) "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/two-of-tarts1.jpg?w=500",
  "ingredient_list": [
    "1 fully baked 9-inch (24-cm) tart shell made from Sweet Tart Dough",
    "Pastry cream (recipe below)",
    "3 to 4 cups fresh strawberries, hulled",
    "1 1/4 cups (300 grams) whole milk",
    "1/2 moist, plump vanilla bean, split and scraped or 1 teaspoon vanilla extract",
    "3 large egg yolks",
    "1/2 cup (100 grams) sugar",
    "3 tablespoons (30 grams) cornstarch",
    "3 tablespoons unsalted butter, at room temperature"
  ],
  "tags": [
    "Photo",
    "Strawberries",
    "Summer",
    "Tarts/Pies"
  ],
  "title": "strawberry tart",
  "url": "https://smittenkitchen.com/2007/06/two-of-tarts/"
}