[
    {
        "ingredient_list": [
            "For the compote", 
            "1 pound strawberries, rinsed and hulled", 
            "1 pound rhubarb, trimmed", 
            "1 lemon", 
            "3/4 cup granulated sugar", 
            "For the almond cake", 
            "Butter and flour for the pan(s)", 
            "7 ounces almond paste", 
            "1/4 cup granulated sugar", 
            "4 ounces unsalted butter, cut into small pieces and chilled", 
            "2 tablespoons honey", 
            "3 large eggs", 
            "2 tablespoons amaretto, plus additional for brushing", 
            "1/3 cup all-purpose flour, sifted (we used matzo meal with success, though finely grinding it first would have been a better idea)", 
            "Kosher salt", 
            "1/3 to 1/2 cup sliced almonds, toasted", 
            "Confectioners’ sugar", 
            "3/4 cup crème fraîche, whipped to soft peaks     ", 
            "Make the compote", 
            "1. Select about 4 ounces of the smallest strawberries and cut lengthwise into quarters. These will be added raw to the cooked compote; set aside.", 
            "Make the cake", 
            "1. Preheat the oven to 350°F (175°C). Butter and flour four 4-by-1 3/4-inch-high miniature springform pans or butter and flour the bottom and sides of an 8-inch round cake pan. If using the 8-inch pan, line its bottom with a circle of parchment paper; this isn’t necessary with the small pans."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/almond-cake-with-strawberry-rhubarb-compote1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Easter", 
            "Everyday Cakes", 
            "Fruit", 
            "Passover", 
            "Photo", 
            "Rhubarb", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2008/04/almond-cake-with-strawberry-rhubarb-compote/", 
        "title": "almond cake with strawberry-rhubarb compote", 
        "directions": [
            "2. Place the almond paste and sugar in the bowl of a heavy-duty mixer fitted with the paddle attachment, or in another large bowl if using a handheld mixer. Begin to cream the mixture on low speed to break up the almond paste, then increase the speed to medium for about 2 minutes, or until the paste is broken into fine particles.", 
            "3. Add the butter and mix for 4 to 5 minutes, or until the mixture is light in color and airy; stop the machine and scrape down the sides as necessary. It is important to mix long enough or the cake will have a dense texture.", 
            "4. Mix in the honey, then add the eggs one at a time, beating until each one is fully incorporated before adding the next. Add the amaretto, flour, and a pinch of salt and mix just to combine.", 
            "5. Scrape the batter into the prepared pan(s) and smooth the top. Bake the small cakes for about 15 minutes, the large one for about 25 minutes, or until the cake is golden and springs back when pressed. Transfer to a rack to cool.", 
            "6. Unmold the small cakes or invert the large cake onto the rack, remove the parchment paper, and invert the cake again so that the top is once again facing upward. Brush the top of the cake(s) with amaretto and sprinkle with the toasted almonds. Dust with confectioners’ sugar. (The large and small cakes can be stored, well wrapped, at room temperature for up to 2 days.) To serve, cut the small cakes in half or the large cake into wedges. Serve with a dollop of whipped crème fraîche and the strawberry-rhubarb compote."
        ], 
        "date": "2008-04-21T16:27:14+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "3/4 cup (75 grams or 2 1/2 to 2 3/4 ounces) sliced almonds, ideally toasted and cooled", 
            "1 tablespoon (10 grams) all purpose flour", 
            "A few pinches of sea salt", 
            "6 tablespoons (75 grams) plus 1 teaspoon (5 grams) granulated sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/2 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1/2 pound rhubarb", 
            "To finish", 
            "Powdered sugar or 1/4 cup jam of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/almond-rhubarb-picnic-bars-e14640188536441.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2016/05/almond-rhubarb-picnic-bars/", 
        "title": "almond rhubarb picnic bars", 
        "directions": [
            "Heat oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] ", 
            "Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind almonds, 6 tablespoons sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. ", 
            "Arrange the fruit: Trim rhubarb and cut it half horizontally top to bottom, i.e. like splitting a hamburger bun, with the flatter part on the bottom. [Update: Does this diagram help?] Keep tops and bottoms matched/stacked and cut stalks on the diagonal into about 1 1/4-inch lengths. The top and bottom of each segment should nicely “V” together, color side up, in a chevron pattern. If you mostly reach for the more green segments first and the pink-er segments second, you’ll end up with an ombré look on top. Sprinkle fruit with 1 teaspoon granulated sugar.", 
            "Bake the bars: For 45 to 55 minutes, until they’re golden on top and a toothpick inserted into the almond cream underneath comes out cream-free. The rhubarb pieces are going to move around a little as it bakes so don’t be surprised if the pattern looks a little different when it’s done. ", 
            "Let cool in pan on a rack, or in the fridge, or even in the freezer. You can decorate the bars with a little powdered sugar, or warm some jam and brush it over for a glossier finish. I find it easiest to get very clean cuts when the bars are very cold. A serrated knife, used gently, can ensure the rhubarb stays perfectly put if it’s not cold enough. While bars do not need to be refrigerated if it will just be a day or so, they keep longer and (I think) more nicely chilled."
        ], 
        "date": "2016-05-23T11:56:10+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "1 cup all-purpose flour plus additional for kneading and rolling", 
            "3/4 cup cake flour (not self-rising)", 
            "2 large eggs", 
            "3/4 teaspoon salt", 
            "1/4 cup water", 
            "Filling", 
            "1/4 cup water", 
            "1/4 cup plus 2 tablespoons sugar", 
            "2 tablespoons apricot brandy (optional)", 
            "6 oz dried apricots (1 cup; preferably California)", 
            "1/2 cup walnuts (2 oz), finely chopped", 
            "Dough (recipe above)", 
            "1 stick (1/2 cup) unsalted butter", 
            "1/2 cup fresh bread crumbs", 
            "1/4 teaspoon cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apricot-and-walnut-vareniki1.jpg?w=500", 
        "tags": [
            "Apricots", 
            "Dumplings", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/apricot-and-walnut-vareniki/", 
        "title": "apricot and walnut vareniki", 
        "directions": [
            "Make filling: Bring water and 1/4 cup sugar to a boil, stirring until sugar is dissolved. Remove from heat and stir in brandy. Finely chop apricots in a food processor, then add sugar syrup and pulse until just combined (do not puree). Transfer to a bowl and stir in 1/4 cup walnuts. Cool.", 
            "Roll out dough and fill varenikis: Halve dough and roll out 1 piece on a lightly floured surface into a 15-inch round, keeping remaining dough wrapped. Trim dough to a 13-inch square. Cut lengthwise into 4 strips, then crosswise into fourths to form 16 (3 1/4-inch) squares. ", 
            "Put 1 slightly rounded teaspoon filling in center of each square. Working with 1 square at a time, moisten edges with water and fold in half diagonally to form a triangle, pressing edges firmly together to seal. overlap bottom points of triangle and press to seal (dumpling will look like a pointed hat). Transfer vareniki to a flour-dusted kitchen towel. Repeat with remaining squares, then make more dumplings with remaining dough and filling.", 
            "Cook varenikis in a large pot of lightly salted boiling water until tender, about 15 minutes. Make topping while varenikis cook:", 
            "Heat 2 tablespoons butter in a skillet over moderate heat, then cook bread crumbs and remaining 1/4 cup walnuts, stirring frequently, until golden, 2 to 3 minutes. Remove from heat and season lightly with salt. Stir together cinnamon and remaining 2 tablespoons sugar. Sprinkle 2 teaspoons cinnamon sugar over crumb mixture and toss. ", 
            "To serve varenikis: Melt remaining 6 tablespoons butter, then drizzle about 2 tablespoons on a warmed serving platter. Transfer varenikis with a slotted spoon to platter and drizzle with remaining 4 tablespoons butter. ", 
            "Serve hot, sprinkled with bread-crumb mixture and remaining cinnamon sugar to taste. "
        ], 
        "date": "2007-11-08T23:15:27+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine ", 
            "Filling", 
            "3/4 cup (a scant 4 ounces or 110 grams) shelled unsalted pistachios", 
            "1 tablespoon (10 grams) all purpose flour", 
            "Few pinches of sea salt", 
            "6 tablespoons (75 grams) sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/4 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1 pound firm-ripe apricots", 
            "To finish", 
            "Powdered sugar or 1/4 cup apricot jam"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/apricot-pistachio-squares1.jpg?w=640", 
        "tags": [
            "Apricots", 
            "Bars", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/08/apricot-pistachio-squares/", 
        "title": "apricot pistachio squares", 
        "directions": [
            "Heat your oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (If you have an 8-inch square springform, you can skip this and just butter it well.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. Transfer the dough clumps to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "(Don’t have a food processor? You might have an easier time using softened butter and preparing this cookie-style: cream it with the sugar with a hand mixer, then spoon in the salt and flour, beating until just combined. It might help to chill this mixture a bit before pressing it into the pan, or it might feel too greasy to easily spread.)", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind your pistachios, sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. ", 
            "Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. Cut apricots in half (or, you might find that you can tear them open at the seams with your fingers) and remove pits. From here, you have a few decoration options: you can place the apricot halves in facedown or up all over the pistachio base. You can do as I did, which is cut them into strips, then slide each cut half onto a butter knife or offset spatula, tilt it so that it fans a little, and slide it onto your pistachio filling decoratively. (With this method, I ended up not using all of my apricots.) You could also arrange the strips like petals of flower around the pan, for maximum pretties.]]", 
            "Bake the bars for 60 minutes, or until they are golden and a toothpick inserted into the pistachio portion comes out batter-free. This might take up to 10 minutes longer depending on the juiciness of your apricots and the amount you were able to nestle in. Let cool completely in pan; you can hasten this along in the fridge. ", 
            "To finish, you can make a shiny glaze for your tart by warming the jam in a small saucepan until it thins, and brushing this mixture over the top of the cooled tart. Or, you can keep it rustic with just a dusting of powdered sugar, as I did. ", 
            "Cut bars into squares — chilled bars will give you the cleanest cuts. Keep leftover bars chilled. "
        ], 
        "date": "2014-08-07T12:18:31+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/big-crumb-coffee-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Rhubarb"
        ], 
        "url": "https://smittenkitchen.com/2008/02/big-crumb-coffee-cake/", 
        "title": "big crumb coffee cake", 
        "directions": [
            "1. Preheat oven to 325 degrees. Grease an 8-inch-square baking pan. For filling, slice rhubarb 1/2 inch thick and toss with sugar, cornstarch and ginger. Set aside.", 
            "2. To make crumbs in a large bowl, whisk sugars, spices and salt into melted butter until smooth. Then, add flour with a spatula or wooden spoon. It will look and feel like a solid dough. Leave it pressed together in the bottom of the bowl and set aside.", 
            "3. To prepare cake, in a small bowl, stir together the sour cream, egg, egg yolk and vanilla. Using a mixer fitted with paddle attachment, mix together flour, sugar, baking soda, baking powder and salt. Add butter and a spoonful of sour cream mixture and mix on medium speed until flour is moistened. Increase speed and beat for 30 seconds. Add remaining sour cream mixture in two batches, beating for 20 seconds after each addition, and scraping down the sides of bowl with a spatula. Scoop out about 1/2 cup batter and set aside.", 
            "4. Scrape remaining batter into prepared pan. Spoon rhubarb over batter. Dollop set-aside batter over rhubarb; it does not have to be even.", 
            "5. Using your fingers, break topping mixture into big crumbs, about 1/2 inch to 3/4 inch in size. They do not have to be uniform, but make sure most are around that size. Sprinkle over cake. Bake cake until a toothpick inserted into center comes out clean of batter (it might be moist from rhubarb), 45 to 55 minutes. Cool completely before serving.", 
            "Yield: 6 to 8 servings."
        ], 
        "date": "2008-02-29T17:28:56+00:00"
    }, 
    {
        "ingredient_list": [
            "Fruit Base", 
            "1 pound apricots", 
            "3 tablespoons sugar", 
            "1 tablespoon flour", 
            "Grated fresh nutmeg, a pinch", 
            "Crisp Topping", 
            "1/2 stick (4 tablespoons, 2 ounces) butter, melted", 
            "6 tablespoons turbinado or regular sugar (turbinado, also sold as Sugar in the Raw, gives an excellent crunch)", 
            "1/2 cup oats", 
            "1/2 cup all-purpose flour (or a mixture of whole wheat and all-purpose flour)", 
            "Pinch of salt", 
            "2 tablespoons sliced almonds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/06/2554534909_1c47b6eccb_b.jpg?w=750", 
        "tags": [
            "Apricots", 
            "Breakfast", 
            "Brunch", 
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/06/breakfast-apricot-crisp/", 
        "title": "breakfast apricot crisp", 
        "directions": [
            "Prepare fruit: Preheat oven to 400 degrees. Pull apart apricots at their seam, remove pits, and tear them one more time into quarters, placing them in a small baking dish (one that holds two to three cups is ideal). Stir in sugar, flour and pinch of nutmeg. ", 
            "Make topping: Melt butter and stir in sugar, then oats, then flour, salt and almonds until large clumps form. Sprinkle mixture over the fruit.  Bake for about 30 to 40 minutes and serve warm.", 
            "Although you could dust this with powdered sugar and serve it warm with vanilla ice cream for dessert, as I noted, it is on the tart side for an after-dinner treat. Truly, this excels cooled in the fridge overnight, and mixed with a scoop of plain yogurt for a weekday breakfast that will cure you of all weekday breakfast doldrums. It sure did for me. "
        ], 
        "date": "2008-06-07T11:43:35+00:00"
    }, 
    {
        "ingredient_list": [
            "For the topping:", 
            "1 1/3 cup flour", 
            "1 teaspoon baking powder", 
            "3 tablespoons sugar", 
            "3 tablespoons Demerara sugar (or turbinado sugar aka Sugar in the Raw)", 
            "Zest of one lemon", 
            "1/4 pound (1 stick or 4 ounces) unsalted butter, melted ", 
            "For the filling:", 
            "1 1/2 cups rhubarb, chopped into 1-inch pieces", 
            "1 quart strawberries plus a few extras, hulled, quartered", 
            "Juice of one lemon", 
            "1/2 cup sugar", 
            "3 to 4 tablespoons cornstarch (some commenters found the flour option a little too, well, floury so this has been updated)", 
            "Pinch of salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/05/strawberry-rhubarb-crumble.jpg?w=750", 
        "tags": [
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2007/05/crumbling-crisp-convictions/", 
        "title": "strawberry-rhubarb crumble", 
        "directions": [
            "1. Heat oven to 375°F. Prepare topping: In a mixing bowl, combine flour, baking powder, sugars and lemon zest and add the melted butter. Mix until small and large clumps form. Refrigerate until needed. ", 
            "2. Prepare filling: Toss rhubarb, strawberries, lemon juice, sugar, cornstarch and a pinch of salt in a 9-inch deep-dish pie plate. (I used an oval dish this time, because they fit better in the bottom of a shopping bag.)", 
            "3. Remove topping from refrigerator and cover fruit thickly and evenly with topping. Place pie plate on a (foil-lined, if you really want to think ahead) baking sheet, and bake until crumble topping is golden brown in places and fruit is bubbling beneath, about 40 to 50 minutes. "
        ], 
        "date": "2007-05-29T15:09:19+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (6 ounces or 170 grams) unsalted butter, plus additional for greasing pan", 
            "1 1/2 cups (6 3/4 ounces or 190 grams) all purpose flour", 
            "2 teaspoons (9 grams) baking powder", 
            "3/4 teaspoon (4 grams) salt", 
            "Pinch of allspice", 
            "1 cup (7 ounces or 200 grams) sugar", 
            "2 large eggs", 
            "2/3 cup whole milk or buttermilk", 
            "1 1/2 pounds nectarines, halved, pitted and cut into 1/2-inch thick wedges (about 4 cups)", 
            "1 tablespoon lemon juice", 
            "Streusel", 
            "Reserved butter from cake (above)", 
            "1/2 cup (3 1/2 ounces or 100 grams) sugar", 
            "1/2 cup (2 1/4 ounces or 64 grams) all purpose flour", 
            "1/4 teaspoon cinnamon", 
            "Pinch of salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/4833941545_0c7c5409a1_o-1.jpg?w=751", 
        "tags": [
            "Brown Butter", 
            "Cake", 
            "Cookbooks", 
            "Everyday Cakes", 
            "Nectarine", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/07/nectarine-brown-butter-buckle/", 
        "title": "nectarine brown butter buckle", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns. Set aside and let cool (the fridge will hasten this along).", 
            "Prepare you pan: Preheat oven to 350°F. Line the bottom of a 10-inch round cake pan, springform or cast iron skillet with parchment paper and butter the paper and rest of the pan generously; set aside.", 
            "Make the cake: Whisk flour, baking powder, salt and allspice in medium bowl to blend. In a large bowl, whisk together 1/2 cup cooled browned butter (set aside remaining 1/4 cup for topping), sugar and then eggs, one at  a time. Stir in milk or buttermilk. Stir dry ingredients into this wet mixture; mix until just combined and spread batter in prepared pan. Toss nectarine wedges with lemon juice and arrange them in a single layer on top of the batter.", 
            "Make the streusel and bake the cake: Stir remaining brown butter, sugar, flour, cinnamon and salt together until large crumbs form. Sprinkle the nectarine-topped batter with crumbs. Bake until top is golden brown and tester inserted into center comes out with moist crumbs, about 40 to 45 minutes. Let cool in pan for 5 minutes before flipping out onto a cooling rack."
        ], 
        "date": "2010-07-28T10:13:53+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup unbleached all-purpose flour", 
            "1/2 teaspoons sugar", 
            "1/8 teaspoon salt", 
            "6 tablespoons (3/4 stick or 3 ounces) unsalted butter, chilled, cut into 1/2–inch pieces", 
            "Filling", 
            "1 tablespoon ground almonds", 
            "1 tablespoon flour", 
            "1/4 cup plus 3 tablespoons sugar", 
            "1 tablespoon amaretti, pulverized — or — 1 extra tablespoon ground almonds plus an extra teaspoon sugar", 
            "10 ounces galette dough, rolled into a 14-inch circle and chilled", 
            "1 and 1/2 pounds ripe nectarines (about 4 large)", 
            "1 tablespoon unsalted butter, melted", 
            "1/4 cup sliced almonds (optional)", 
            "Peach or nectarine jam (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/nectarine-galette1.jpg?w=500", 
        "tags": [
            "Fruit", 
            "Nectarine", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/08/nectarine-galette/", 
        "title": "nectarine galette", 
        "directions": [
            "Make the crust: Combine the flour, sugar, and salt in a large, wide mixing bowl. Cut in six tablespoons of the butter with a pastry blender or two knives, mixing until the dough resembles coarse cornmeal. Dribble four tablespoons ice water over the mixture, using a rubber spatula to pull the mixture together. Gather the dough into a mound (either in the bowl or on a counter) and gently knead it together, for just a few seconds. If it’s not coming together, add ice water, a tablespoon at a time, until it does. Wrap dough in a flat disc in plastic and refrigerate for at least 30 minutes before rolling out.", 
            "When you are ready to roll out the dough, take one disk and let it soften slightly so that it is malleable but still cold. On a lightly floured surface, roll out the disk into a 14-inch circle about 1/8 inch thick. Transfer the dough to a parchment-lined baking sheet and refrigerate at least 1/2 hour before using.", 
            "Make the galette: Preheat the oven to 400 degrees. Place a pizza stone, if you have one, on a lower rack. Toss the ground almonds, flour, one tablespoon of the sugar, and pulverized amaretti (or mix of extra ground almonds and sugar) together.", 
            "Remove the prerolled dough from the refrigerator or freezer and sprinkle the almond mixture evenly over the pastry, leaving a 1 1/2 to 2-inch border uncoated. Cut nectarines in half, removing pits, then each half into thirds (you’ll get six wedges per nectarine). Arrange the fruit, skin-side-down, in concentric circles on the dough, making a single layer of snugly touching pieces, leaving the border bare. Sprinkle 1/4 cup of the sugar evenly over the fruit.", 
            "While rotating the tart, fold the border of exposed dough up and over itself at regular intervals, crimping and pushing it up against the fruit. Pinch or trim off any excess dough. (Make sure there are no breaks that will let juices leak.) Brush the border with melted butter, and sprinkle it with two tablespoons sugar.", 
            "Bake in the lower third of the oven (preferably on a pizza stone) for about 45 to 50 minutes, until the crust is well browned and its edges are slightly caramelized. If you wish, sprinkle sliced almonds over the galette 15 minutes before the baking time ends, so they get toasty and extra-crisp. As soon as the galette is out of the oven, use a large metal spatula to slide it onto a cooling rack, to keep it from getting soggy. Let cool for 20 minutes. If you want to glaze the tart, brush the fruit lightly with a little warmed peach (or nectarine, if you have it) jam. Serve warm, with vanilla ice cream or with plain yogurt.", 
            "Do ahead: This galette keeps at room temperature for at least two days, and even longer in the fridge. The unbaked dough, wrapped in plastic, will keep in the freezer for a few weeks, the fridge for a day or more. Rolled-out dough may be frozen and used the next day."
        ], 
        "date": "2009-08-30T12:35:26+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "37 gingersnap cookies, coarsely broken (about 9 ounces; about 3 1/4 cups plus 2 tablespoons of pieces)", 
            "6 tablespoons unsalted butter, melted", 
            "Filling", 
            "1 8-ounce container mascarpone cheese", 
            "6 ounces cream cheese, room temperature", 
            "1/4 cup sour cream", 
            "1/4 cup sugar", 
            "1 teaspoon grated lemon peel", 
            "1/4 teaspoon vanilla extract", 
            "1 tablespoon finely chopped crystallized ginger (optional)", 
            "Topping", 
            "4 to 5 small nectarines, halved, pitted, cut into thin slices", 
            "1/4 cup peach jam, warmed", 
            "2 tablespoons finely chopped crystallized ginger (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2691000910_676f814784_o.jpg?w=750", 
        "tags": [
            "Fruit", 
            "Nectarine", 
            "Photo", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/07/nectarine-mascarpone-and-gingersnap-tart/", 
        "title": "nectarine, mascarpone and gingersnap tart", 
        "directions": [
            "For crust: Preheat oven to 350°F. Finely grind gingersnaps in processor. Add butter and blend until crumbs are evenly moistened. Press mixture over bottom and up sides of 9-inch-diameter tart pan with removable bottom. (I like to use a cold metal measuring cup to get a nice, clear demarcation between the base and sides.) Bake crust until color darkens, pressing sides with back of spoon if beginning to slide, about 8 minutes. Cool completely.", 
            "For filling: Beat first 6 ingredients in medium bowl until smooth. Beat in crystallized ginger if you’re using it. Spread filling in prepared crust. Cover loosely and refrigerate at least 2 hours and up to 1 day.", 
            "For topping: Overlap nectarine slices atop filling in concentric circles. Brush with jam. Sprinkle with chopped crystallized ginger if you’re using it. (Mint makes an excellent garnish, if you’re skipping the ginger.) Serve, or refrigerate up to 6 hours."
        ], 
        "date": "2008-07-22T09:47:07+00:00"
    }, 
    {
        "ingredient_list": [
            "For dough", 
            "1 2/3 cups all-purpose flour", 
            "3 1/2 tablespoons sugar", 
            "1 tablespoon plus 1/2 teaspoon baking powder", 
            "2 hard-boiled egg yolks", 
            "1/8 teaspoon salt", 
            "6 tablespoons cold unsalted butter, cut into 1/2-inch cubes", 
            "2/3 cup plus 1 tablespoon heavy cream", 
            "For rhubarb", 
            "2 pounds rhubarb, trimmed and cut into 1/2-inch pieces (about 6 cups)", 
            "1/2 cup sugar", 
            "1-inch piece of vanilla bean, split lengthwise, pulp scraped", 
            "2 tablespoons cornstarch", 
            "1 tablespoon turbinado sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/rhubarb-cobbler1.jpg?w=500", 
        "tags": [
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Rhubarb"
        ], 
        "url": "https://smittenkitchen.com/2009/05/rhubarb-cobbler/", 
        "title": "rhubarb cobbler", 
        "directions": [
            "In the bowl of a food processor, combine the flour, sugar, baking powder, egg yolks, and salt. Pulse to combine. Add the butter and pulse until the flour resembles coarse meal. Add 2/3 cup of cream and pulse until the dough comes together. Turn the dough onto a lightly floured surface and gently pat it together, incorporating any stray crumbs.", 
            "Using a small ice cream scoop or a large spoon*, form the dough into 2-inch balls, then flatten them slightly into thick rounds. Chill for 20 minutes (and up to 2 hours). Preheat oven to 350 degrees. Put the rhubarb in a shallow 21/2- quart casserole dish and toss with sugar, vanilla, and cornstarch. Allow to macerate 15 minutes.", 
            "Arrange the biscuit rounds on top, leaving about an inch between them. Brush the biscuits with cream and sprinkle with turbinado sugar. Bake the cobbler until the rhubarb is bubbling and the biscuits are golden brown, about 40 to 45 minutes. Serve with ice cream or crème fraîche.", 
            "* I haven’t unearthed my scoops yet, but I did find some cookie cutters, so I simply patted my dough out on a floured surface and cut them instead. Besides, who doesn’t like flower-shaped biscuits?"
        ], 
        "date": "2009-05-08T14:14:38+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "3 3/4 cups (470 grams) all-purpose flour", 
            "1/2 teaspoon fresh orange zest (optional)", 
            "1 1/2 (20 grams) tablespoons granulated sugar", 
            "1 1/2 (9 grams) teaspoons table salt", 
            "1 1/2 cups (12 ounces or 340 grams) unsalted butter, very cold and cut into small cubes", 
            "3/4 to 1 cup buttermilk (or, make your own buttermilk substitute)", 
            "Rhubarb Filling", 
            "1 pound (455 grams) rhubarb stalks, trimmed and cut into 1/2-inch segments", 
            "1/3 cup (65 grams) granulated sugar", 
            "Cream cheese filling", 
            "4 ounces cream cheese, at room temperature (i.e. very soft)", 
            "1/3 cup granulated sugar", 
            "1 teaspoon lemon zest", 
            "2 teaspoons lemon juice", 
            "1 large egg yolk", 
            "To assemble", 
            "1 large egg", 
            "1 tablespoon water", 
            "Coarse sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/rhubarb-cream-cheese-hand-pies1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2013/06/rhubarb-cream-cheese-hand-pies/", 
        "title": "rhubarb cream cheese hand pies", 
        "directions": [
            "Make pie dough: Whisk together flour, zest, sugar and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in 3/4 cup buttermilk with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. If it doesn’t come together, add remaining 1/4 cup buttermilk, 1 tablespoon at a time, until it does, then gently knead again. Divide dough in half. Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day.", 
            "Make rhubarb filling: Place rhubarb and sugar in a small-to-medium saucepan with sugar and stir to combine. Cover and cook at medium-low heat for 15 minutes, no need to stir. Increase the heat to medium, remove the lid and cook for another 10 to 15 minutes, until rhubarb is broken down and ideally thick enough that if you run a spoon across the bottom of the pot, you can see a trench quickly form and disappear. (No need to be overly fussy about this level of thickness, as a little wetter won’t harm your pies.) Spread mixture on a large plate in the fridge or freezer to cool quickly, then scrape into a bowl. Keep cold until needed; it will be thicker and easier to “scoop” onto the pie bases.", 
            "Make cream cheese filling: Whisk cream cheese, sugar, zest, juice and yolk together in a small bowl until smooth. Keep cold until needed as well.", 
            "Assemble pies: Heat oven to 400 degrees. Line two to three baking sheets with parchment paper. Beat your remaining egg and 1 tablespoon water and keep aside with a pastry brush. ", 
            "Flour the heck out of your counter, unwrap the first half of your dough and start rolling your dough by pressing down lightly with the pin and moving it from the center out. You’re not going to get it all flat in one roll or even twenty; be patient and it will crack less. Roll it a few times in one direction, lift it up and rotate it a quarter-turn. Continue to do, roll a couple times, lifting the dough and rotating it until the dough is just shy of 1/8-inch thick. Cut dough into 2 3/4-inch to 3-inch squares. (I had a 2 3/4-inch fluted cutter from this set. A knife, pizza wheel or even fluted pastry wheel would be sufficient.) ", 
            "Deb’s #1 Most Essnetial Pie Tip: No mushy pie dough! If your dough becomes soft (it’s a hot day or warm kitchen, aka summer) now or at any point in the assembly process, slide the dough squares onto a prepared baking sheet and freeze them for a couple minutes until they’re semi-firm again; it will make assembly less frustrating. Promise.", 
            "Brush half the squares very, very lightly with the egg wash; these will be your bases. Cut a small vent in the other half of the squares; these will be your lids. In the center of each egg washed square, put a small dollop (a measured teaspoon) of cream cheese, then rhubarb filling on top. Be ye not tempted to fill them more as they become almost impossible to seal without leakage, and why should your baking sheet get all the good stuff? Top each filled base with a vented square. Press outer edge of top and bottom all around to seal with your fingertips; a fork will work as well. Transfer pie to a baking sheet, spacing 1-inch apart. Brush the tops with egg wash and sprinkle generously with coarse sugar. Repeat with remaining dough, including second half from fridge, and fillings.", 
            "Bake for 15 to 20 minutes, until puffed and golden, and even more brown at edges. Transfer to cooling racks and cool to room temperature before serving. Okay, well, good luck with that. "
        ], 
        "date": "2013-06-07T13:08:29+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "1 1/4 pound (565 grams) rhubarb, trimmed and cut into 1/2-inch lengths on the diagonal", 
            "1 1/3 cup (265 grams) granulated sugar, divided", 
            "1 tablespoon lemon juice (psst, skip ahead and zest it for the cake before you cut it)", 
            "1/2 cup (1 stick, 4 ounces or 115 grams) unsalted butter, softened", 
            "1/2 teaspoon finely grated lemon zest", 
            "2 large eggs", 
            "1 1/3 cups (165 grams) all-purpose flour", 
            "1 teaspoon baking powder", 
            "3/4 teaspoon table salt", 
            "1/4 teaspoon ground ginger", 
            "1/3 cup (80 grams) sour cream", 
            "Crumb", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 cup (50 grams) light brown sugar", 
            "1/8 teaspoon table salt", 
            "1/4 teaspoon ground cinnamon", 
            "4 tablespoons (1/2 stick, 2 ounces, or 55 grams) unsalted butter, melted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/rhubarb-snacking-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/05/rhubarb-snacking-cake/", 
        "title": "rhubarb snacking cake", 
        "directions": [
            "Make the cake: Preheat your oven to 350°F. Coat the bottom and sides of a 9×13-inch baking pan with butter or a nonstick cooking spray, then line the bottom with parchment paper, extending the lengths up two sides. (It will look like a sling). Stir together rhubarb, lemon juice and 2/3 cup sugar and set aside. Beat butter, remaining sugar and lemon zest with an electric mixer until light and fluffy. Add eggs, one at at time, scraping down the sides after each addition. Whisk together flour, baking powder, 3/4 teaspoon table salt and ground ginger together in a small bowl. Add one-third of this mixture to the batter, mixing until just combined. Continue, adding half the sour cream, the second third of the flour mixture, the remaining sour cream, and then the remaining flour mixture, mixing between each addition until just combined. ", 
            "Dollop batter over prepared pan, then use a spatula — offset, if you have one, makes this easiest — to spread the cake into an even, thin layer. Pour the rhubarb mixture over the cake, spreading it into an even layer (most pieces should fit in a tight, single layer). ", 
            "Stir together the crumb mixture, first whisking the flour, brown sugar, table salt and cinnamon together, then stirring in the melted butter with a spoon or fork. Scatter evenly over rhubarb layer. Bake cake in preheated oven for 50 to 60 minutes. The cake is done when a tester comes out free of the wet cake batter below. It will be golden on top. Cool completely in the pan on a rack. ", 
            "Cut the two exposed sides of the cake free of the pan, if needed, then use the parchment “sling” to remove the cake from the pan. Cut into 2-inch squares and go ahead and eat the first one standing up. (If it’s written into the recipe, it’s not “sneaking” a piece but, in fact, following orders, right?) Share the rest with friends. Cake keeps at room temperature for a few days, but I didn’t mind it at all from the fridge, where I kept it covered tightly. "
        ], 
        "date": "2012-05-29T12:28:00+00:00"
    }, 
    {
        "ingredient_list": [
            "Streusel", 
            "1/4 cup (31 grams) all-purpose flour", 
            "1/4 cup (28 grams) white whole wheat flour", 
            "1 tablespoon (13 grams) granulated sugar", 
            "3 tablespoons (38 grams) light or dark brown sugar", 
            "1/4 teaspoon ground cinnamon", 
            "Pinch of nutmeg", 
            "Pinch of salt", 
            "3 tablespoons (42 grams) unsalted butter, melted", 
            "Muffin", 
            "1 large egg", 
            "1/4 cup (50 grams) light or dark brown sugar", 
            "3 tablespoons (38 grams) granulated sugar", 
            "5 tablespoons (71 grams) unsalted butter, melted and cooled to lukewarm", 
            "3/4 cup (177 ml) sour cream", 
            "1 cup (approx. 120 grams) white whole wheat flour or whole wheat pastry flour (see Note)", 
            "1/2 cup (63 grams) all-purpose flour", 
            "1 1/2 teaspoon baking powder", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon salt", 
            "1 cup diced rhubarb, in 1/2-inch pieces (from about 6 to 8 ounces of stalks)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/rhubarb-streusel-muffins.jpg?w=751", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Rhubarb"
        ], 
        "url": "https://smittenkitchen.com/2011/05/rhubarb-streusel-muffins/", 
        "title": "rhubarb streusel muffins", 
        "directions": [
            "Preheat oven to 375°F. Butter 12 muffin cups. ", 
            "Make streusel: In a small dish, stir together flours, sugars, spices and salt. Stir in butter until crumbly. Set aside.", 
            "Make muffins: Whisk egg in the bottom of a large bowl with both sugars. Whisk in butter, then sour cream. In a separate bowl, mix together flours, baking powder, baking soda and salt and stir them into the sour cream mixture, mixing until just combined and still a bit lumpy. Fold in rhubarb and 1/3 (feel free to eyeball this) of the streusel mixture.", 
            "Divide batter among prepared muffin cups. Sprinkle each muffin with remaining streusel, then use a spoon to gently press the crumbs into the batter so that they adhere. Bake for 15 to 20 minutes, until tops are golden and a tester inserted into the center of muffins comes out clean. Rest muffins in pan on cooling rack for two minutes, then remove muffins from tin to cool them completely."
        ], 
        "date": "2011-05-18T13:57:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (450 grams) rhubarb, trimmed", 
            "3/4 cup (150 grams) granulated sugar", 
            "Finely grated zest from half a lemon", 
            "4 tablespoons (2 ounces or 55 grams) unsalted butter, cold is fine", 
            "Two pinches of salt", 
            "6 tablespoons (85 grams) unsalted butter, softened", 
            "2/3 cup (125 grams) light or dark brown sugar", 
            "1/4 cup (50 grams) granulated sugar", 
            "2 large eggs", 
            "1/2 teaspoon vanilla extract", 
            "2 teaspoons baking powder", 
            "1/4 teaspoon fine sea salt", 
            "1 teaspoon ground cinnamon", 
            "1/2 teaspoon ground ginger", 
            "1/8 teaspoon ground cloves", 
            "A few gratings of fresh nutmeg", 
            "1/2 cup (120 ml) buttermilk", 
            "1 1/2 cups (195 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/rhubarb-upside-down-spice-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Rhubarb", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2017/05/rhubarb-upside-down-spice-cake/", 
        "title": "rhubarb upside-down spice cake", 
        "directions": [
            "Heat oven: To 350°F.", 
            "Make topping: In a 10-inch ovenproof skillet, trim your rhubarb to lengths that will fit across the bottom in one direction, i.e. some short and some taller. Remove rhubarb and cut each stalk lengthwise into thin (about 1/4-inch thick) ribbons. If your rhubarb is already quite thin, you might just want to halve each piece lengthwise.\nSprinkle sugar into skillet and add lemon zest; use your fingers to mix the zest into the sugar; the grit of the sugar will help release the most flavor from it. Add butter and salt and heat skillet over medium until butter has melted, stirring frequently. Add rhubarb and cook, turning gently, for 3 to 4 minutes, until it has softened slightly and released some of its liquid. Remove from heat and set skillet aside.\nMake cake: In a large bowl, beat butter and sugars until light and fluffy. Add eggs, one at a time, beating until combined, then vanilla. Sprinkle mixture with baking powder, salt, and all the spices and beat well to thoroughly mix them in. Add buttermilk; mixture will have a curdly texture but don’t worry, it’s all going to even out. Scrape down bowl and add flour; beat only until it disappears.\nCheck your rhubarb base to make sure all the pieces are in the order you’d like them to be; nudge around any that are not, then dollop cake batter over rhubarb mixture in small spoonfuls and smooth top as best as you can. As the rhubarb mixture will be very wet, this will seem almost impossible. I actually gave up and just put it in the oven, where the cake spread into one even layer on its own. (Thank you, cake.)\nBake cake: For about 35 minutes, until a toothpick inserted deep into the cake (but not the topping underneath) comes out batter-free. Transfer to a cooling rack and let cool for 5 minutes, then run a knife around the edges to loosen. Place a larger plate upside down over the skillet and use two potholdered hands to flip cake out onto it. If any rhubarb is stuck in the pan or slides down the side, just return it to the top of the cake cake.\nServe: Warm or at room temperature. Cake keeps for a couple days at room temperature and up to a week in the fridge, or so I hear."
        ], 
        "date": "2017-05-05T11:56:47+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup corn flour", 
            "1 cup all-purpose flour", 
            "1/2 cup fine cornmeal", 
            "1/4 cup plus 2 tablespoons sugar", 
            "1 teaspoon Kosher or coarse salt", 
            "1 stick (4 ounces) cold unsalted butter, cut into small pieces", 
            "1/4 cup plus 2 tablespoons heavy cream", 
            "2 egg yolks", 
            "1 batch Rhubarb Vanilla Compote (recipe below)", 
            "1 1/2 pounds rhubarb stalks", 
            "1 cup minus 1 tablespoon dark brown sugar (i.e. 15 tablespoons, if you want to drive yourself mad)", 
            "1/2 vanilla bean, split and seeds scraped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/rustic-rhubarb-tarts1.jpg?w=750", 
        "tags": [
            "Easter", 
            "Photo", 
            "Rhubarb", 
            "Spring", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2010/05/rustic-rhubarb-tarts/", 
        "title": "rustic rhubarb tarts", 
        "directions": [
            "Rinse the rhubarb stalks and trim the very ends. Cut them in half lengthwise (unless they’re very slim) and then on the diagonal into 3/4-inch chunks. Leaving the last 1 1/2 cups aside, put 3 cups of the rhubarb into a large, heavy-bottomed pot. Add the brown sugar, vanilla bean seeds and pods and turn the heat to medium low. (You want to start at a low temperature to encourage the rhubarb to release its liquid. Unlike most compotes, this one adds no water.) Cook the rhubarb mixture, covered, for about 15 minutes, or until the mixture is saucy. Remove the cover and increase the heat to medium, cooking an additional 15 to 17 minutes, or until the rhubarb is completely broken down and thick enough that a spoon leaves a trail at the bottom of the pan. Discard your vanilla bean pods and add remaining rhubarb chunks to the compote. Pour the compote out onto a large plate to cool.", 
            "Do ahead: This keeps for one week in the fridge. It can also be used to fill pies, crisps and cobblers."
        ], 
        "date": "2010-05-19T22:00:30+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup light brown sugar, packed", 
            "1/3 cup vegetable oil", 
            "1 egg", 
            "1/2 teaspoon vanilla", 
            "1 tablespoon rum", 
            "1 cup flour", 
            "1/4 cup whole wheat flour", 
            "1/2 teaspoon salt", 
            "1 teaspoon baking soda", 
            "1/4 cup sour cream", 
            "1/2 cup diced rhubarb", 
            "1/2 cup sliced strawberries", 
            "1/4 cup chopped pecans", 
            "Topping (Optional)", 
            "1 tablespoons granulated sugar", 
            "1/4 teaspoon cinnamon", 
            "3 to 3 1/2 tablespoons flour", 
            "2 tablespoons butter, melted", 
            "1/4 cup chopped pecans or walnuts"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/some-south-in-your-mouth1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Rhubarb", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2007/03/some-south-in-your-mouth/", 
        "title": "strawberry rhubarb pecan loaf", 
        "directions": [
            "Beat together the brown sugar, vegetable oil, egg, vanilla and rum. Combine the flours, salt and baking soda; stir. Add dry ingredients to first mixture with the sour cream. Stir in strawberries, rhubarb and pecans. ", 
            "Spread into a greased 9×5-inch loaf pan — the batter will be very thick. Combine topping ingredients except the pecans, they should be thick and clumpy; add the pecans last and sprinkle over the loaf.", 
            "Bake at 350° for about 55 to 65 minutes, or until a wooden pick or cake tester inserted in center comes out clean."
        ], 
        "date": "2007-03-10T13:44:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (80 grams) rolled oats", 
            "3/4 cup (95 grams) plus up to 2 tablespoons (15 grams) extra all-purpose flour", 
            "1/2 cup (95 grams) light brown sugar", 
            "Heaped 1/4 teaspoon table salt", 
            "6 tablespoons (85 grams) unsalted butter, melted", 
            "1 teaspoon cornstarch (optional, but helps firm up the filling)", 
            "1 tablespoon (15 ml) lemon juice", 
            "1 tablespoon (15 grams) granulated sugar, divided", 
            "1 cup (125 grams) small-diced rhubarb (from about 1 1/2 medium stalks)", 
            "1 cup (155 grams) small-diced strawberries", 
            "Powdered sugar, for decoration, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/strawberry-rhubarb-crisp-bars1.jpg?w=640", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Crumbles/Crisps", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Rhubarb", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/05/strawberry-rhubarb-crisp-bars/", 
        "title": "strawberry rhubarb crisp bars", 
        "directions": [
            "Heat oven to 375 degrees F. For easy removal, line bottom and two sides of 8-by-8-inch square baking pan with parchment paper. No need to bother (and no greasing needed) if you plan to serve them right in the pan, as I did. ", 
            "Place oats, 3/4 cup flour, brown sugar and salt in bottom of baking pan and mix. Pour melted butter over, and stir until clumps form. If the clumps feel soft or look overly damp, add the remaining 2 tablespoons flour. Set aside 1/2 cup of the crumble mixture. Press the rest of the crumb mixture evenly in the bottom of the pan.", 
            "Spread half the fruit over the crust. Sprinkle it evenly with cornstarch, then lemon juice, and 1/2 tablespoon of granulated sugar. Spread remaining fruit over this, and top with second 1/2 tablespoon sugar. Scatter reserved crumbs over fruit and bake bars for 30 to 40 minutes (firmer fruits will take longer), until fruit is bubbly and crisp portion is golden and smells toasty and amazing. ", 
            "Let cool in pan; I do this in the fridge, where they become crisp once chilled (less so at room temperature). Cut into squares and sprinkle with powdered sugar before serving. Store leftovers in fridge."
        ], 
        "date": "2014-05-09T11:20:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 recipe All Butter, Really Flaky Pie Dough or double-crust pie dough of your choice", 
            "3 1/2 cups (about 1 1/2 pounds, untrimmed) rhubarb, in 1/2-inch thick slices", 
            "3 1/2 cups (about 1 pound) strawberries, hulled and sliced if big, halved if tiny", 
            "1/2 cup granulated sugar", 
            "1/4 cup light brown sugar", 
            "1 tablespoon lemon juice", 
            "1/4 teaspoon salt", 
            "1/4 cup quick-cooking tapioca", 
            "2 tablespoons unsalted butter, cut into small pieces", 
            "1 large egg yolk beaten to blend with 1 teaspoon water (for glaze)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/strawberry-rhubarb-pie.jpg?w=750", 
        "tags": [
            "Photo", 
            "Rhubarb", 
            "Spring", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2010/06/strawberry-rhubarb-pie-improved/", 
        "title": "strawberry-rhubarb pie, improved", 
        "directions": [
            "Preheat oven to 400 degrees. On a well-floured counter, roll half of pie dough into a 12-inch circle and carefully transfer to a 9-inch pie plate.  (I like to fold my gently into quarters, to transfer it more easily, then unfold it in the pie plate.)", 
            "Stir together rhubarb, strawberries, sugars, lemon, salt and tapioca in a large bowl. Mound filling inside bottom pie crust and dot with bits of unsalted butter. Roll second half of pie dough into an 11-inch circle and cut decorative slits in it. Transfer it to center over the pie filling. Trim top and bottom pie dough so that their overhang beyond the pie plate lip is only 1/2-inch.  Tuck rim of dough underneath itself and crimp it decoratively.", 
            "Transfer pie to a baking sheet and brush egg yolk mixture over dough. Bake for 20 minutes then reduce temperature to 350 degrees and bake for an additional 25 to 30 minutes, until the pie is golden and the juices bubble visibly.", 
            "Transfer pie to wire rack to cool. When full cool (several hours later) the juices gel.", 
            "Do ahead:  Pie should keep for up to three days at room temperature but I have never, ever seen one last that long."
        ], 
        "date": "2010-06-24T14:59:40+00:00"
    }, 
    {
        "ingredient_list": [
            "For crust", 
            "3 cups all purpose flour", 
            "2 1/2 teaspoons sugar", 
            "3/4 teaspoon salt", 
            "2/3 cup chilled solid vegetable shortening, cut into pieces", 
            "1/2 cup plus 2 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into pieces", 
            "10 tablespoons (about) ice water", 
            "For filling", 
            "3 1/2 cups 1/2-inch-thick slices trimmed rhubarb (1 1/2 pounds untrimmed)", 
            "1 16-ounce container strawberries, hulled, halved (about 3 1/2 cups)", 
            "1/2 cup (packed) golden brown sugar", 
            "1/2 cup sugar", 
            "1/4 cup cornstarch", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/strawberry-rhubarb-pie1.jpg?w=500", 
        "tags": [
            "Fruit", 
            "Photo", 
            "Rhubarb", 
            "Spring", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/05/strawberry-rhubarb-pie/", 
        "title": "strawberry rhubarb pie", 
        "directions": [
            "1 large egg yolk beaten to blend with 1 teaspoon water (for glaze)", 
            "Make crust: Combine flour, sugar and salt in processor. [Alternately, you can use a pastry cutter to make your dough, as I did.] Using on/off turns, cut in shortening and butter until coarse meal forms. Blend in enough ice water 2 tablespoons at a time to form moist clumps. Gather dough into ball; cut in half. Flatten each half into disk. Wrap separately in plastic; refrigerate until firm, about 1 hour. (Can be made 1 day ahead. Keep chilled. Let dough soften slightly at room temperature before rolling.)", 
            "[Still worried about your pie dough? Check out my Pie Dough 101. I used this dough recipe this time, however, and found it just wonderful. It closely follows one I posted a while back.]", 
            "Make filling: Preheat oven to 400°F. Combine first 7 ingredients in large bowl. Toss gently to blend.", 
            "Assemble Pie: Roll out 1 dough disk on floured work surface to 13-inch round. Transfer to 9-inch-diameter glass pie dish [er, I used a metal one and it was just fine]. Trim excess dough, leaving 3/4-inch overhang.", 
            "Roll out second dough disk on lightly floured surface to 13-inch round. Cut into fourteen 1/2-inch-wide strips. Spoon filling into crust. Arrange 7 dough strips atop filling, spacing evenly. Form lattice by placing remaining dough strips in opposite direction atop filling. Trim ends of dough strips even with overhang of bottom crust. Fold strip ends and overhang under, pressing to seal. Crimp edges decoratively.", 
            "Brush glaze over crust. transfer pie to baking sheet. Bake 20 minutes. Reduce oven temperature to 350Â°F. Bake pie until golden and filling thickens, about another 25 minutes. [The original recipe suggested a total baking time of 1 hour and 55 minutes. No joke. Mine was done in just shy of an hour.] Transfer pie to rack and cool completely."
        ], 
        "date": "2008-05-27T13:12:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound strawberries, stems removed and halved", 
            "1 pound rhubarb, chopped into 1/2-inch segments", 
            "1 cup granulated sugar", 
            "1 cup water", 
            "1 lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/strawberry-rhubarb-soda-syrup1.jpg?w=750", 
        "tags": [
            "Drinks", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2015/04/strawberry-rhubarb-soda-syrup/", 
        "title": "strawberry rhubarb soda syrup", 
        "directions": [
            "Combine strawberries, rhubarb, sugar and water in a large saucepan. Remove several strips of peel from lemon with a knife or peeler and add them to the pot. Bring mixture to a boil and then reduce it to a gentle simmer. Simmer for 20 minutes, or until fruit has completely collapsed, stirring occasionally. Remove from heat, add the juice of half the lemon (or more, to taste) and let fruit cool in syrup for maximum infusion. Once cool, pour mixture through a fine-mesh strainer (or, if you only have a coarse one, line it with cheesecloth or a lint-free towel); press solids with the back of a spoon or spatula to get the most syrup from them. You should have 2 cups right away, but I had to run an errand, left mine sitting in the strainer and was delighted to find 3 full cups of syrup when I got back. Pour into a glass bottle and chill until needed. ", 
            "Save fruit pulp in a separate container; it can be used to stir into plain yogurt, oatmeal or even dollop on pancakes. (Be sure to fish out or at least look out for lemon peels if you do.)", 
            "To make 1 glass of soda, pour 2 tablespoons of the syrup in the bottom of a glass, fill with ice and then seltzer or sparkling water. Give it a stir and add more syrup to taste; for a large glass, you might use up to 2 tablespoons more. Garnish with a lemon wedge, if you wish. Drink and pretend it’s spring.", 
            "Do ahead: Syrup should keep in the fridge for at least three weeks, if not longer. "
        ], 
        "date": "2015-04-10T11:53:51+00:00"
    }
]