{
  "date": "2009-04-29T09:54:13+00:00",
  "directions": [
    "Special equipment: Spice grinder (optional), instant-read thermometer",
    "1.    In a small bowl, combine yeast and sugar with warm water. Stir to dissolve and let stand until foamy, about 10 minutes.",
    "2.    Heat two cups water, molasses, vinegar, butter and chocolate until the butter and chocolate are melted. Set aside and let cool to lukewarm warm.",
    "3.    Combine whole-wheat, rye and white flours in a large bowl. Set aside.",
    "4.    In bowl of a heavy mixer fitted with a paddle attachment, combine two cups mixed flours, bran, 2 tablespoons caraway seeds, fennel seeds, salt, espresso and shallots. At low speed, add yeast and chocolate mixtures. Mix until smooth and beat at medium speed for three minutes. (If you don’t like whole seeds in your bread, grinding them in a spice grinder, coffee grinder or mortar and pestle allows their flavor to come through without the texture. I always make my black bread this way.)",
    "[Note: This, or any bread, can also be made by hand, simply mixing the ingredients in a large bowl with a wooden spoon and kneading the dough on a counter until springy and smooth.] ",
    "5.    At low speed, add half cup of remaining mixed flours at a time, until dough clears sides of bowl and begins to work its way up paddle. It will be very sticky but firm.",
    "6.    Scrape dough off paddle, flour counter well, and knead to make a springy yet dense dough. You might not use all of the flour mixture.",
    "7.    Form into a ball and place in a greased bowl. Turn once to grease top. Cover with plastic wrap and let rise in a warm area until doubled, about 1 1/2 to 2 hours. Combine cornmeal, flour and remaining caraway seeds, if using, and set aside.",
    "8.    Gently deflate dough. Turn out onto a lightly floured surface. Divide into two portions and form into two rounds or loaves.  Loaves should be placed in a loaf pan sprayed with nonstick spray, while rounds should be placed seam down on a greased or parchment-lined baking sheet. Sprinkle loaves with cornmeal mixture, if using. Cover loosely with plastic wrap. Let rise until doubled and puffy, about 45 minutes to one hour. Slash an X into the top of a round before baking it; no such slashing is needed for bread in a loaf pan.",
    "9.    Bake in a preheated 350°F oven for 45 to 50 minutes or until loaves are well-browned, or register an internal temperature of 200 to 210°F on an instant-read thermometer. Baking time in your oven may vary — check in on the bread when it is 2/3 to 3/4 of the way through the baking time to make sure it has not super-speedily baked. Remove from baking sheet to cool completely on a rack."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/black-bread1.jpg?w=500",
  "ingredient_list": [
    "2 packages (1 1/2 tablespoons) active dry yeast",
    "Pinch of sugar",
    "1/2 cup warm water (105 to 115 degrees)",
    "2 cups water",
    "1/4 cup molasses",
    "1/4 cup apple cider vinegar",
    "4 tablespoons unsalted butter",
    "1 ounce unsweetened chocolate",
    "1/2 cup whole-wheat flour",
    "3 cups medium rye flour",
    "3 cups unbleached, all-purpose or bread flour",
    "1 cup bran",
    "2 tablespoons caraway seeds",
    "1/2 teaspoon fennel seeds",
    "1 tablespoon salt",
    "1 tablespoon instant espresso powder",
    "1 tablespoon minced shallots",
    "1/4 cup cornmeal (optional)",
    "1 tablespoon unbleached all-purpose flour  (optional)",
    "1 teaspoon caraway seeds  (optional)"
  ],
  "tags": [
    "Bread",
    "Photo",
    "Russian"
  ],
  "title": "black bread",
  "url": "https://smittenkitchen.com/2009/04/black-bread/"
}