{
  "date": "2008-03-03T12:44:14+00:00",
  "directions": [
    "Pat chicken dry and season with salt and pepper. In a large heavy skillet heat oil and 1 1/2 tablespoons butter over moderately high heat until hot but not smoking and brown chicken in 2 batches, transferring with tongs to a large plate as browned.",
    "Discard all but 1 tablespoon fat from skillet and sauté onion and mushrooms, stirring occasionally, until liquid mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until Marsala is almost evaporated. Add broth and chicken with any juices that have accumulated on plate and simmer, turning chicken once, until cooked through, about 15 minutes. Transfer chicken with tongs to a platter.",
    "Simmer mushroom sauce until liquid is reduced to about 1/2 cup. Remove skillet from heat and stir in remaining 2 tablespoons butter and salt and pepper to taste, stirring until butter is just incorporated. Spoon mushroom sauce around chicken and sprinkle with parsley. ",
    "New note, 11/21/13: Tonight, I made this with boneless, skinless chicken thighs and it was fantastic — and quick, with refreshingly few ingredients. This takes well under an hour to cook, and deserves to be placed back in the weeknight rotation. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2008/03/alexs-chicken-and-mushroom-marsala.jpg?w=750",
  "ingredient_list": [
    "3 whole boneless chicken breasts with skin (about 2 1/2 pounds), halved (see Note)",
    "1 1/2 tablespoons olive oil",
    "3 1/2 tablespoons unsalted butter",
    "1 onion, halved and sliced thin",
    "3/4 pound mushrooms, sliced thin, any variety you like",
    "1/2 cup dry Marsala",
    "1 cup chicken broth",
    "2 tablespoons minced fresh parsley leaves (optional, for garnish)"
  ],
  "tags": [
    "Chicken",
    "Date Night",
    "Gluten-Free",
    "Mushrooms",
    "Photo",
    "Weeknight Favorite"
  ],
  "title": "alex’s chicken and mushroom marsala",
  "url": "https://smittenkitchen.com/2008/03/alexs-chicken-and-mushroom-marsala/"
}