{
  "date": "2012-12-04T10:13:27+00:00",
  "directions": [
    "Cook cauliflower in simmering salted water, uncovered, until tender, about 5 to 6 minutes, until firm but tender. Using a slotted spoon, transfer to a bowl of ice water to stop cooking. Drain well. Spread on towels to dry as much as possible.",
    "In the bottom of a large bowl, whisk together egg, garlic and lemon zest. Add cauliflower florets and mash with a potato masher until they’re crushed into an average of pea-sized pieces (i.e. some will be bigger, some smaller, but most will be little nubs). Sprinkle in feta and stir to combine egg mixture, cauliflower and feta. In a small dish, whisk flour, salt, pepper and baking powder until evenly combined. Sprinkle over cauliflower batter and stir just until combined.",
    "Heat oven to 200 degrees F and place a tray inside. On the stove, heat a large, heavy skillet over moderate heat. Once hot, add a good slick of oil, about 2 to 3 tablespoons. Once the oil is hot (you can test it by flicking a droplet of water into it; it should hiss and sputter), scoop a two tablespoon-size mound of the batter and drop it into the pan, then flatten it slightly with your spoon or spatula. Repeat with additional batter, leaving a couple inches between each. Once brown underneath, about 2 to 3 minutes, flip each fritter and cook on the other side until equally golden, about another 1 to 2 minutes.",
    "Transfer briefly to paper towels to drain, then the tray in the oven to keep them warm until needed. Once all fritters are cooked, mix yogurt with cumin, salt and pepper. Spread fritters on serving platter. Dollop each with cumin yogurt and sprinkle with pomegranate arils.",
    "Do ahead: Fritters both freeze and reheat well. To warm and recrisp them, lay them on a tray and toast them at 400 degrees in the oven until crisp again."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/12/cauliflower-feta-fritters-with-pomegranate.jpg?w=751",
  "ingredient_list": [
    "1 small head cauliflower (1 pound florets, i.e. stems and leaves removed), cut into generous 1 to 2 inch chunks",
    "1 large egg",
    "1 garlic clove, minced",
    "Few gratings of fresh lemon zest",
    "3 ounces crumbled feta (about 1/2 cup)",
    "1/2 cup all-purpose flour",
    "1/4 teaspoon Aleppo pepper flakes; less if using regular red pepper flakes, which are hotter",
    "3/4 teaspoon table salt or more to taste",
    "1/2 teaspoon baking powder",
    "Olive oil for frying",
    "To serve",
    "3/4 cup yogurt",
    "1/2 teaspoon ground cumin",
    "Salt and pepper to taste",
    "Handful pomegranate arils"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Cauliflower",
    "Lunch",
    "Photo",
    "Pomegranate",
    "Snack",
    "Vegetarian"
  ],
  "title": "cauliflower-feta fritters with pomegranate",
  "url": "https://smittenkitchen.com/2012/12/cauliflower-feta-fritters-with-pomegranate/"
}