{
  "date": "2015-05-18T12:08:32+00:00",
  "directions": [
    "Prepare the meat: Form the meat into four equal-sized four-ounce meat “pucks,” roughly 2 1/2 inches thick. Place them on a plate lined with plastic wrap or waxed paper and freeze for 15 minutes, but no longer. We don’t want to freeze the meat, but we’d like it to be extra-cold when it hits the pan.",
    "Make the sauce: Combine all of the ingredients, tasting it and making any adjustments you’d prefer. A dash of hot sauce, perhaps?",
    "Toast the buns: Heat a griddle, large cast-iron skillet (my first choice and recommendation), or large heavy stainless-steel skillet over medium heat. Melt the butter and place the buns, cut-side down, in the pan. Cook until cut sides are golden-brown, about 1 to 2 minutes. Place toasted buns on four plates; you’ll keep using your griddle or skillet.",
    "Cook the burgers: Remove patties from freezer. Increase heat to high and add 2 tablespoons oil to the griddle or skillet — you’ll need this only for your first burger batch; after you’ve made a couple or if you’re scaling the recipe up, the fat from the earlier burgers will be sufficient — heat until oil begins to smoke, at least two minutes. Working one at a time, add a patty to griddle and immediately flatten it to a 1/2-inch thickness with a heavy spatula and something with weight and heft (the handle of a second spatula, a meat pounder, etc. see details up top) to help it along. You’ll have to “hammer” harder than you might think to flatten the patties out. A second spatula can be used to help remove the hamburger stuck to the flattening one, so not to tear the patty. Generously season with salt and pepper. Repeat with remaining patties.",
    "Once the first side is deeply browned with crisp, craggly edges, about 1 1/2 to 2 minutes for medium — mine were all quite black when they were flipped, and yet still totally pink inside when we cut into them; it will be hard to overcook them at this high heat — use a spatula to scrape underneath the patty and flip it over. Cover with a slice of cheese if making cheeseburgers, and cook 1 to 2 minutes more, until melted. Repeat process with remaining patties.",
    "Assemble burgers: Transfer cooked patties to toasted burger buns. Spread top buns with prepared sauce. Top burgers with tomatoes, lettuce, pickles (if using) and immediately dig in.",
    "Serve this this with: My favorite oven fries, slaw, glorious lemonade or milkshakes, and a big fat wedge of watermelon."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/fake-shack-burger1.jpg?w=640",
  "ingredient_list": [
    "Burgers",
    "1 pound freshly ground beef (3/4 pound ground sirloin + 1/4 pound brisket is recommended, but if you can’t find, use chuck) with an 80/20 fat ratio",
    "Sauce",
    "1/4 cup mayonnaise",
    "1 1/2 teaspoons juice from a pickle jar",
    "1 1/2 teaspoons ketchup",
    "1 teaspoon yellow mustard",
    "1/4 teaspoon smoked paprika",
    "1/4 teaspoon garlic powder",
    "1/4 teaspoon onion powder",
    "Assembly",
    "2 tablespoons unsalted butter, plus more if needed",
    "4 potato rolls, preferably Martin’s brand",
    "2 tablespoons vegetable oil",
    "Kosher salt, to taste",
    "Freshly ground black pepper, to taste",
    "4 slices cheese, American or whatever you like on burgers, if you’re making cheeseburgers",
    "Four 1/4-inch-thick tomato slices",
    "Thinly sliced pickles, if desired",
    "4 burger-sized pieces green-leaf lettuce (I used curly green leaf lettuce)"
  ],
  "tags": [
    "Budget",
    "Grilling",
    "Meat",
    "Photo",
    "Summer",
    "Weeknight Favorite"
  ],
  "title": "fake shack burger",
  "url": "https://smittenkitchen.com/2015/05/fake-shack-burger/"
}