{
  "date": "2013-01-22T11:36:49+00:00",
  "directions": [
    "Heat 1/4 cup olive oil (enough to coat bottom of pot) in a large pot on medium heat. When hot, add the sausage, breaking it up with a wooden spoon until it starts to brown, about five minutes. Add the onion, celery, carrots, first two garlic cloves, a pinch of salt, and if you like your soup spicy, a pinch of red pepper flakes. Cook with the sausage until the vegetables soften a bit, another 5 minutes. Add the lentils, bay leaves, tomatoes, water (6 cups is, conveniently, a little less than 2 empty 28-ounce cans, so you can get any tomato pulp you missed), more salt and black pepper to taste. Bring to a simmer and allow to cook until the lentils are tender, about 40 minutes. (It might be necessary to add more water if the soup gets too thick, though we preferred ours on the thick side.)",
    "When the lentils are cooked, add the chard and cook until the leaves are tender, just a few minutes more. Discard the bay leaves. ",
    "To finish, divide soup among bowls, then add the remaining 1/4 cup olive oil and 2 garlic cloves to a small skillet and heat over medium until the garlic softens and hisses. Drizzle this over soup bowls, and top with fresh Romano, passing more at the table. Leftovers will keep for several days in the fridge."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/01/lentil-soup-with-sausage-chard-and-garlic.jpg?w=750",
  "ingredient_list": [
    "1/2 cup olive oil, divided",
    "4 large links of sweet Italian sausage, casings removed (I used half of this, preferring the sausage to not dominate the soup’s flavor [update] and from the comments, it sounds like most of you preferred it with just 2 links as well)",
    "1 medium onion, diced",
    "2 celery stalks, sliced or diced",
    "2 medium carrots, peeled and sliced into half-moons or diced",
    "4 cloves garlic, sliced (reserve half for later in recipe)",
    "Kosher salt",
    "A pinch of crushed red pepper flakes (optional)",
    "1 cup brown lentils, sorted and rinsed",
    "2 bay leaves",
    "1 28-ounce can crushed tomatoes",
    "6 cups water",
    "Freshly ground black pepper",
    "3 to 4 cups shredded or thinly ribboned Swiss chard leaves or kale",
    "Grated Pecorino Romano cheese to finish"
  ],
  "tags": [
    "Beans",
    "Date Night",
    "Photo",
    "Soup",
    "Stew",
    "Winter"
  ],
  "title": "lentil soup with sausage, chard and garlic",
  "url": "https://smittenkitchen.com/2013/01/lentil-soup-with-sausage-chard-and-garlic/"
}