{
  "date": "2013-01-30T11:35:47+00:00",
  "directions": [
    "Pulse onion, carrot, celery, whole garlic cloves, parsley, and red pepper flakes (to taste) in a food processor until finely chopped. Heat 1/4 cup oil in a large, heavy pot over medium heat and add vegetable mixture to pot. (Quickly rinse, but no need to fully wash, food processor as you’ll use it again shortly.) Season generously with salt. Cook, stirring from time to time, until vegetables take on a bit of color, about 10 minutes. Add tomato paste (original recipe calls for 2T but we enjoyed it with 3) and cook it into the vegetables for another minute. Add 1 cup water or bean cooking liquid and use it to scrape up any bits stuck to the pot. Let simmer until liquid has almost disappeared, about 5 to 8 minutes. ",
    "Add beans and 2 more cups of water (or bean cooking liquid) to the pot and simmer until the flavors meld, about another 15 minutes. ",
    "Meanwhile, cook pasta until al dente, or still a little firm inside. I know you didn’t ask for one, but can I insert an argument for al dente pasta here? The thing is, you don’t want your pasta to fully cook in the water. If you do, it won’t have any absorbency left to drink up and become with that delicious sauce. I have really found that finishing pasta in its sauce is the single thing that most swiftly improved the quality of my pasta dishes.",
    "Reserve 1 1/2 cups cooking water from your drained pasta.",
    "Transfer one cup of the bean mixture to your rinsed food processor and purée it until smooth, then stir it back into the sauce to thicken it. Add drained pasta and 1/2 cup cooking liquid to bean sauce and cook the mixture together, adding more pasta cooking liquid as needed, until the sauce coats the pasta, about 1 to 2 more minutes. ",
    "To serve: Heat remaining 1/4 cup olive oil in a tiny saucepan over medium-low heat with garlic and rosemary, until sizzling stops. Divide pasta between serving bowls and drizzle garlic-rosemary oil over each. If you’re us, you’ll finish this with a few flakes of sea salt. Eat at once."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pasta-and-white-beans-with-garlic-rosemary-oil1.jpg?w=500",
  "ingredient_list": [
    "1 medium onion, cut into big chunks",
    "1 medium carrot, in big chunks",
    "1 celery stalk, in big chunks",
    "6 garlic cloves, 4 left whole, 2 finely chopped",
    "1/2 cup flat-leaf parsley leaves",
    "1/4 teaspoon crushed red pepper flakes (or to taste)",
    "1/2 cup olive oil, divided",
    "Coarse or kosh salt",
    "2 to 3 tablespoons tomato paste",
    "3 1/2 cups cooked, drained beans (save cooking liquid for water in recipe, if desired) or 2 15-ounce cans small white beans (such as Great Northern or Cannelini), rinsed",
    "1 pound short tube pasta (see suggestions above)",
    "1 tablespoon minced fresh rosemary"
  ],
  "tags": [
    "Beans",
    "Budget",
    "Italian",
    "Pasta",
    "Photo",
    "Vegetarian",
    "Winter"
  ],
  "title": "pasta and white beans with garlic-rosemary oil",
  "url": "https://smittenkitchen.com/2013/01/pasta-and-white-beans-with-garlic-rosemary-oil/"
}