{
  "date": "2016-05-17T11:57:35+00:00",
  "directions": [
    "Heat your oven to 400 degrees F. Cover 1 large (half-sheet) or 2 smaller (quarter-sheet) roasting pans with foil for easy cleanup. Pour 1/4 cup water in bottom of pan (or divide between both).\nMake your spice paste by either pounding the cumin, coriander, thyme, salt and peppers in a mortar and pestle until roughly ground, using an electric spice grinder (i.e. a coffee grinder you don’t mind smelling like spices) or small food processor to do the same, or, if using ground spices, just combining them in the bottom of the large bowl you’re about to use. In the bottom of a very large bowl, combine prepared spices, salt and pepper, garlic, vinegar and 1/4 cup olive oil and whisk to blend. Add carrots and toss to coat.\nSpread carrots, drizzling with any extra marinade, in prepared pans and cover tightly with foil. Roast for 25 minutes covered then remove the foil and roast for 35 minutes more, until the carrots are lightly browned and tender but not falling apart.\nMeanwhile, combine 2 tablespoons olive oil, orange and lemon juices in a small dish with salt and pepper. When carrots are done, scatter with avocado and sprouts then drizzle with this citrus dressing all over. Dollop yogurt over the top and sprinkle with seeds. Dig in."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/spiced-roasted-carrots-with-avocado-and-yogurt1.jpg?w=750",
  "ingredient_list": [
    "1/4 cup water",
    "1 1/2 teaspoons teaspoon cumin seeds, toasted and cooled if you have the patience, ground will work here as well",
    "1 1/2 teaspoons coriander seeds, toasted and cooled if you have the patience, ground will work here as well",
    "2 teaspoon fresh thyme leaves",
    "1 teaspoon coarse or kosher salt, plus more to taste",
    "Red chile flakes, to taste",
    "Freshly ground black pepper, to taste",
    "4 garlic cloves, minced or pressed",
    "1 tablespoon red wine vinegar",
    "1/4 cup olive oil",
    "3 pounds thin-to-medium carrots, scrubbed, not peeled; mixed colors are prettier here but not essential",
    "2 tablespoons olive oil",
    "2 tablespoons orange juice (from about 1/4 orange)",
    "2 tablespoons lemon juice (from about 1/2 lemon)",
    "1 large or 2 medium firm-ripe avocados, cut in thin slices",
    "Salt and pepper to taste",
    "1 to 2 cups radish sprouts, other sprouts or light salad greens of your choice",
    "1/4 cup plain yogurt",
    "2 tablespoons roasted hulled pumpkin seeds, sunflower seeds, toasted sesame seeds or a mix thereof"
  ],
  "tags": [
    "Avocado",
    "Carrots",
    "Photo",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "roasted carrots with avocado and yogurt",
  "url": "https://smittenkitchen.com/2016/05/roasted-carrots-with-avocado-and-yogurt/"
}