{
  "date": "2016-10-17T12:08:51+00:00",
  "directions": [
    "In a large bowl, whisk squash, yogurt, eggs, cheese, salt, pepper and baking powder until smooth. Add flour and stir until just combined. Batter will be thick.\nHeat a large frying over medium-low to medium heat. Coat the bottom with butter or olive oil, or a combination thereof, and spoon in pancake batter, a heaped soup spoon or scant 1/4 cup at a time. Press the back of the batter mound to flatten the pancake slightly. Cook until golden brown underneath, flip and then cook until the color until golden brown on the second side. If this is happening very fast, lower your heat. If you’re worried pancakes have not cooked in the center, you can finish them for 10 minutes in a 250 degrees oven. You can also keep your pancakes warm there until needed. Repeat with remaining batter.\nTo finish, wipe out frying pan and place butter, a pinch or two of salt and sage leaves back in it, heating over medium. The sage leaves will crisp and the butter will brown in a minute or two so keep a close watch on it. Pour leaves and butter over pancakes and quickly understand why you’ll never have them another way.\nTo roast squash: For butternut or kabocha, I halve the squash, scoop out the seeds and roast it face-down on an oiled baking sheet that I’ve sprinkled with coarse salt at 375 for 40 to 50 minutes, until tender. I get about 2 cups mashed squash from one 2-pound (i.e. small-medium) whole squash. If yours is already peeled and in, say, 1-inch chunks, it will likely be tender in just 25 minutes (just updated after rechecking my notes)."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/winter-squash-pancakes-with-crispy-sage-and-brown-butter.jpg?w=750",
  "ingredient_list": [
    "1 cup (8 to 8 1/4 ounces) roasted and mashed winter squash",
    "1/3 cup (80 grams) yogurt or sour cream",
    "2 large eggs",
    "1/2 cup (about 30 grams) finely grated gruyere, comte or parmesan",
    "3/4 teaspoon fine sea or table salt",
    "A few grinds of black pepper",
    "1 teaspoon baking powder",
    "1 cup (130 grams) all-purpose flour",
    "Butter or olive oil for frying pan",
    "2 to 3 tablespoons butter",
    "A pinch or two of salt",
    "A few fresh sage leaves"
  ],
  "tags": [
    "Fall",
    "Freezer Friendly",
    "Lunch",
    "Pancakes",
    "Photo",
    "Put An Egg On It",
    "Vegetarian",
    "Weeknight Favorite",
    "Winter Squash"
  ],
  "title": "winter squash pancakes with crispy sage and brown butter",
  "url": "https://smittenkitchen.com/2016/10/winter-squash-pancakes-with-crispy-sage-and-brown-butter/"
}