{
  "date": "2017-04-07T11:54:53+00:00",
  "directions": [
    "Heat oven to 350 degrees F. Line a large baking sheet with parchment paper.\nMake cookie dough: Cut, tear or grate paste and place in bowl with the paddle attachment of a stand mixer. (Mine was quite soft, so I just dropped it in in hand-torn chunks.) Add sugar and beat, covering lip of bowl with dishtowel to get bits from flying out, until almond paste cannot be broken up any further, approximately 3 to 5 minutes at a medium-high speed. Add egg white and salt and beat until uniform and creamy. Place sliced almonds in a wide-shallow bowl or plate. Have another bowl with water to get your hands wet.",
    "Form cookies: Wet hands and scoop 1 tablespoon of dough (can use a measuring spoon, a little overfilled is fine) into your palms. It’s going to be very soft and you’re going to think something has gone very wrong; it it has not. Just keep your hands wet and roll it into a 4-ish inch log (I just stretched it across my hand, as you can see in the photo above) and drop it into the bowl of almonds. Wipe your hands dry on a towel (or the almonds stick to your hands, pulling them off the cookie) and roll log through it. Again, it’s quite soft and will seem weird at first but do you best and transfer the soft almond-covered log to the prepared tray and arc it into a horn shape. Press any loose almonds back on. Repeat with remaining dough. ",
    "Bake cookies: For 15 minutes, or until almonds on cookies are gently toasted and horns are puffed. Let cool completely.\nTo finish: Melt chocolate in a small bowl and dip ends of cookies into it, then return to parchment-lined tray to set. Add sprinkles (optional, but of course you want to).\nDo ahead: Once chocolate is set, these keep in a tin for a week.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/04/almond-horns-mandelhoernchen.jpg?w=750",
  "ingredient_list": [
    "7 ounces (198 grams) almond paste",
    "1/4 cup (50 grams) granulated sugar",
    "1 large egg white",
    "Two pinches of sea salt",
    "1 1/4 cup (130 grams) sliced almonds, blanched are more traditional",
    "6 ounces semi- or bittersweet chocolate, chopped or in chips (about 1 cup)",
    "Colored sprinkles (optional, but not really)"
  ],
  "tags": [
    "Chocolate",
    "Cookie",
    "Gluten-Free",
    "Passover",
    "Photo",
    "Quick"
  ],
  "title": "almond horn cookies",
  "url": "https://smittenkitchen.com/2017/04/almond-horn-cookies/"
}