{
  "date": "2012-03-19T16:45:10+00:00",
  "directions": [
    "Place a rack in the upper third of your oven and preheat to 200°F. This will keep the pancakes warmed as they’re fried in batches.",
    "To make the pancakes: In a large bowl, whisk together flour, baking powder, baking soda, salt, cinnamon, nutmeg, ginger and, if using, nuts and raisins. In a small bowl, whisk together the egg, brown sugar, buttermilk and vanilla. Stir in carrots. Stir carrot mixture into dry ingredients, stirring until just Incorporated. Let rest for five minutes while you make the cream cheese topping.",
    "To make the cream cheese topping: In a small bowl, beat the cream cheese until fluffy and lump-free. Whisk in powdered sugar, two tablespoons milk, vanilla and cinnamon. If you’d like the mixture thinner, add the remaining tablespoon of milk (I did not).",
    "Over medium heat, melt 1 tablespoon butter in a cast-iron skillet or griddle pan. Spoon 2 tablespoons batter into the hot pan per pancake (to me, this seemed like too little but after experimenting with larger pancakes, I advise you to listen to Joy; It’s a wiggly batter and much easier to and cook in small puddles), flipping once, until pancakes are golden on both sides, about 2 minutes per side. Transfer finished pancakes to a serving dish or tray in the oven, to keep warm while you repeat the process with the remaining batter, adding more butter as needed.",
    "Serve warm with cream cheese topping. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/03/carrot-cake-pancakes.jpg?w=750",
  "ingredient_list": [
    "Pancakes",
    "1 cup all-purpose flour",
    "1 teaspoon baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon table salt",
    "1/2 teaspoon ground cinnamon",
    "1/2 teaspoon freshly grated nutmeg (I used a smidge less)",
    "1/8 teaspoon ground ginger",
    "2 tablespoons chopped walnuts (optional, I skipped them)",
    "2 tablespoons golden raisins (optional, ditto)",
    "1 large egg",
    "2 tablespoons packed brown sugar",
    "1 cup buttermilk",
    "1 teaspoon pure vanilla extract",
    "2 cups finely grated carrots (from about a 3/4 pound bundle whole carrots)",
    "3 tablespoons butter, for griddle",
    "Cream cheese topping",
    "4 ounces cream cheese, at room temperature",
    "1/4 cup powdered sugar",
    "2 to 3 tablespoons milk",
    "1/2 teaspoon pure vanilla extract",
    "Dash of ground cinnamon"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Carrots",
    "Pancakes",
    "Photo"
  ],
  "title": "carrot cake pancakes",
  "url": "https://smittenkitchen.com/2012/03/carrot-cake-pancakes/"
}