{
  "date": "2016-09-09T12:01:24+00:00",
  "directions": [
    "Prepare your pan: Heat your oven to 350 °F. Line your largest baking sheet — it needs to hold at least a 12-inch round because these can spread; I used a pizza pan — with a sheet of parchment paper. Draw a 9-inch circle on it with a pencil and flip the paper over so that you can see the line but it won’t get into the pavlova.",
    "Make the meringue: Beat the egg whites with a mixer until satiny peaks form and then beat in the sugar a spoonful at a time until the meringue is stiff and shiny. Sprinkle the sea salt, cocoa, vinegar and then the chopped chocolate over the egg whites and gently fold everything with a rubber spatula. I intentionally left mine a little swirly/undermixed.\nShape the pavlova: You can secure the parchment to the baking sheet with a dab of meringue underneath it. Mound the meringue into the 9-inch circle, smoothing the sides and top if you desire.",
    "Bake the meringue: Place in the oven and immediately turn the temperature down to 300 degrees. The pavlova will bake for 60 to 90 minutes, but most likely in the middle. When it’s ready it should look crisp on top and feel dry, but when you prod the center you should feel, in the delightful words of Nigella, “the promise of squidginess” beneath your fingers. Turn the oven off, leave the door slightly ajar, and let the meringue cool completely inside. You can leave it overnight. It can also be kept at room temperature until needed.\nTo serve: When you’re ready to serve, invert the cooled pavlova onto a big plate and peel off the parchment. Whip the cream with the sugar and vanilla until soft peaks form. Pile it onto the meringue. Scatter with berries and shave chocolate over with a vegetable peeler. Serve in wedges and keep leftovers in fridge."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/chocolate-pavlova.jpg?w=750",
  "ingredient_list": [
    "6 large egg whites",
    "1 1/2 (300 grams) cups granulated sugar",
    "A couple pinches of sea salt",
    "1 teaspoon (5 ml) balsamic or red wine vinegar",
    "1/4 cup (20 to 25 grams) cocoa powder, the best you have, sifted",
    "2 ounces (55 grams)  semi- or bittersweet chocolate, finely chopped",
    "1 1/2 cups (355 ml) heavy cream",
    "2 teaspoons (10 grams) granulated sugar",
    "1 teaspoon (5 ml) vanilla extract",
    "4 cups mixed fresh berries",
    "1 ounce (30 grams) semi- or bittersweet chocolate, to finish"
  ],
  "tags": [
    "Cake",
    "Chocolate",
    "Gluten-Free",
    "Passover",
    "Photo"
  ],
  "title": "chocolate pavlova",
  "url": "https://smittenkitchen.com/2016/09/chocolate-pavlova/"
}