{
  "date": "2009-04-09T20:34:24+00:00",
  "directions": [
    "Preheat the oven to 350°F. Line an 11-by-17-inch baking sheet completely with foil, and then line the base of the foil with parchment paper, cut to fit.",
    "Line the bottom of the baking sheet with matzo or crackers, covering all parts. [If using matzo, you’ll need to break pieces to fit any extra spaces, which will be annoying because despite being perforated, it does not actually break in straight lines. I have some luck pressing a serrated knife straight down along a section between perforations, if that (hopefully) makes sense.]",
    "In a medium heavy-duty saucepan, melt the butter and brown sugar together, and stir it over medium heat until it begins to boil. Once it has begun boiling, let it bubble for three more minutes, stirring it well. It will thicken a bit as it cooks. Remove from the heat and add the salt and vanilla, and then quickly pour it over the matzo or crackers. You’ll want to spread it quickly, as it will begin to set as soon as it is poured.",
    "Bake the caramel-covered crackers for 15 minutes, watching carefully as it will bubble and the corners might darken too quickly and/or burn. You can reduce the heat if you see this happening. ",
    "Remove from oven and immediately cover with chocolate chips. Let stand five minutes, and then spread them evenly across the caramel. An offset spatula works great here. If you’re using them, sprinkle the chocolate with toasted chopped nuts and/or sea salt. (The sea salt is great on matzo. On Saltines, it’s really not necessary.)",
    "Once completely cool — I sometimes speed this process up in the fridge, impatient as should be expected in the face of caramel crack(ers) — break it into pieces and store it in a container. It should keep for a week but I’ve never seen it last that long."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/04/chocolate-caramel-crackers.jpg?w=752",
  "ingredient_list": [
    "4 to 6 sheets matzo or approximately 40 Saltine crackers or crackers of your choice",
    "1 cup (2 sticks or 8 ounces) unsalted butter, cut into a few large pieces",
    "1 cup packed light brown sugar",
    "A big pinch of sea salt",
    "1/2 teaspoon pure vanilla extract",
    "1 1/2 cups semi- or bittersweet chocolate chips (or chopped bittersweet or semisweet chocolate)",
    "1 cup toasted chopped almonds, pecans, walnuts or a nut of your choice (optional)",
    "Extra sea salt for sprinkling (optional)"
  ],
  "tags": [
    "Candy",
    "Chocolate",
    "Passover",
    "Photo"
  ],
  "title": "chocolate caramel crack(ers)",
  "url": "https://smittenkitchen.com/2009/04/chocolate-caramel-crackers/"
}