{
  "date": "2009-08-14T11:59:02+00:00",
  "directions": [
    "To make this pizza on a grill, or in a grill pan: Stir together garlic and oil. Brush some of garlic oil on both sides of eggplant and season with 3/4 teaspoon salt and 1/2 teaspoon pepper. Grill over direct medium heat, covered, turning once, until tender, 6 to 8 minutes total. Cut into roughly one-inch pieces and set aside.",
    "Stretch dough into about a 12- by 10-inch rectangle (or into the shape of your grill pan, which in my case, was square) on a large baking sheet or your counter and lightly brush with garlic oil. Oil grill rack, then put dough, oiled side down, on grill. Brush top with more garlic oil. Grill, covered, until underside is golden-brown, about 2 to 3 minutes.",
    "Using tongs, return crust, grilled side up, to baking sheet. Scatter eggplant, cheese, olives, and parsley (whoops, forgot mine) over crust. Slide pizza from sheet onto grill and grill, covered, until underside is golden-brown and cheese is melted, about 3 to 5 minutes. (If you’re using an oven-safe grill pan, you can slide the pan into a preheated 500 degree oven at this point, as we did, which gets the toppings that much more blistered.) Season to taste with salt, pepper and a red pepper flakes.",
    "To make this pizza in the oven: You can either fry or roast the eggplant slices, brushed with garlic oil, until tender. Prepare the pizza as you would any other, rolling or stretching out the dough, mounding on the toppings and sliding it onto a baking sheet or pizza stone in an oven that has been preheated to its top temperature. It will be ready in about 10 minutes."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/08/grilled-eggplant-and-olive-pizza.jpg?w=753",
  "ingredient_list": [
    "1 garlic clove, minced",
    "1/3 cup extra-virgin olive oil",
    "1 1/4 pound eggplant, cut into 3/4-inch-thick rounds",
    "1 pound store-bought pizza or homemade pizza dough at room temperature (1 1/2 of this recipe will yield a 1-pound dough)",
    "5 ounces sliced provolone, cut into short thin matchsticks (1 1/4 cups)",
    "Handful pitted green olives, coarsely chopped (1/3 cup)",
    "1/4 cup chopped flat-leaf parsley"
  ],
  "tags": [
    "Eggplant",
    "Photo",
    "Pizza",
    "Vegetarian"
  ],
  "title": "grilled eggplant and olive pizza",
  "url": "https://smittenkitchen.com/2009/08/grilled-eggplant-and-olive-pizza/"
}