{
  "date": "2008-10-10T10:00:34+00:00",
  "directions": [
    "Make the meatballs: Place the ground meats, bread crumbs, parsley, Parmesan, salt, pepper, onion powder, egg, and 3/4 cup warm water in a bowl. Combine very lightly with a fork. Using your hands, lightly form the mixture into 2-inch meatballs. You will have 14 to 16 meatballs. (Or perhaps 24, which is what I ended up with. I’m sorry I cannot give you a more precise measure; I am sure your amount will fall somewhere in the middle.)",
    "Pour equal amounts of vegetable oil and olive oil into a large (12-inch) skillet to a depth of 1/4-inch. Heat the oil. Very carefully, in batches, place the meatballs in the oil and brown them well on all sides over medium-low heat, turning carefully with a spatula or a fork. This should take about 10 minutes for each batch. Don’t crowd the meatballs. Remove the meatballs to a plate covered with paper towels. Discard the oil but don’t clean the pan.",
    "Make the sauce: Heat the olive oil in the same pan. Add the onion and saute over medium heat until translucent, 5 to 10 minutes. Add the garlic and red pepper flakes, and cook for 1 more minute. Add the wine and cook on high heat, scraping up all the brown bits in the pan, until almost all the liquid evaporates, about 3 minutes. Stir in the tomatoes, parsley, salt, and pepper.",
    "Return the meatballs to the sauce, cover, and simmer on the lowest heat for 25 to 30 minutes, until the meatballs are cooked through. (The good news is that if, say, you’re still waiting for your pot of water to boil for the spaghetti when the meatballs are ready, it’s hard to overcook these. I ended up simmering ours a whole extra 20 to 30 minutes, and they were not in the least dried out. Heaven!)",
    "Serve hot on cooked spaghetti and pass the grated Parmesan."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/meatballs-and-spaghetti1.jpg?w=160",
  "ingredient_list": [
    "For the meatballs: ",
    "1/2 pound ground veal",
    "1/2 pound ground pork",
    "1 pound ground beef",
    "1 1/4 cups fresh white bread crumbs (about 5 slices, crusts removed)",
    "2 tablespoons chopped fresh flat-leaf parsley",
    "1/2 cup freshly grated Parmesan cheese",
    "2 teaspoons kosher salt",
    "1/2 teaspoon freshly ground black pepper, or more to taste",
    "1 teaspoon onion powder",
    "1 extra-large egg, beaten",
    "Vegetable oil",
    "Olive oil",
    "For the sauce:",
    "1 tablespoon good olive oil",
    "1 cup chopped yellow onion (1 onion)",
    "1 1/2 teaspoons minced garlic",
    "Pinch of red pepper flakes",
    "1/2 cup good red wine",
    "1 (14-ounce) can pureed tomatoes",
    "1 (14-ounce) can chopped or diced tomatoes",
    "1 tablespoon chopped fresh flat-leaf parsley",
    "1 1/2 teaspoons kosher salt",
    "1/2 teaspoon freshly ground black pepper",
    "For serving: ",
    "1 1/2 pounds spaghetti, cooked according to package directions",
    "Freshly grated Parmesan "
  ],
  "tags": [
    "Freezer Friendly",
    "Guest Post",
    "Italian",
    "Meat",
    "Pasta",
    "Photo"
  ],
  "title": "meatballs and spaghetti",
  "url": "https://smittenkitchen.com/2008/10/meatballs-and-spaghetti/"
}