{
  "date": "2009-12-19T10:16:51+00:00",
  "directions": [
    "Place the olive oil in a large, heavy skillet over medium-high heat. Add the onions and cook for one minute. Add the mushrooms and one teaspoon of the salt. Sauté, stirring occasionally, until all the moisture has evaporated and the mushrooms have cooked down, about 10 minutes (though this took me much less time). Add the Marsala and continue cooking until almost all the wine has evaporated, about 5 minutes.",
    "Meanwhile, bring a large pot of water to a boil over high heat. Stir in remaining salt. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, about 8 to 10 minutes. Drain pasta and add it into the mushrooms, Marsala and onions Add the artichoke hearts, Parmesan and cream and cook until the artichokes are heated through, about 5 minutes. Stir in the parsley and pepper, then adjust seasonings to taste. Transfer to a serving bowl and serve. ",
    "Update 12/30/13: I hadn’t made this and years and dusted it off tonight. Conclusion: I think I’d actually like this better with twice as many mushroom and no artichokes. I mentioned above that I thought it needed some lemon or acidity — actually, artichokes do. Mushrooms and marsala sauce are perfect together, after all. I’d rather save the artichokes for a more lemony pasta sauce."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-marsala-pasta-with-artichokes1.jpg?w=500",
  "ingredient_list": [
    "3 tablespoons olive oil",
    "1 small onion, finely chopped",
    "1 pound mushrooms, trimmed, cleaned and chopped into small bits (I used creminis)",
    "1 teaspoon kosher salt, plus 1 tablespoon for pasta water",
    "1 cup dry Marsala wine",
    "1 pound pasta, Giada recommends thimble-shaped pasta, ditalini, but I think I used snail-shaped or chiocciole",
    "1/2 pound frozen artichoke hearts, thawed",
    "3/4 cup grated Parmesan",
    "1/2 cup cream",
    "1/2 cup chopped fresh flat-leaf parsley",
    "1 teaspoon freshly ground black pepper"
  ],
  "tags": [
    "Artichokes",
    "Italian",
    "Mushrooms",
    "Pasta",
    "Photo",
    "Vegetarian"
  ],
  "title": "mushroom marsala pasta with artichokes",
  "url": "https://smittenkitchen.com/2009/12/mushroom-marsala-pasta-with-artichokes/"
}