{
  "date": "2011-03-30T10:15:12+00:00",
  "directions": [
    "Combine the flour, eggs and milk in a large bowl. Cover with plastic wrap and refrigerate for 1 hour, or overnight.*",
    "Prepare an ice bath. Bring a large pot of well salted water to boil. If you’ve got a spaetzle maker, use it. Otherwise, do not fret! Set a large colander with holes anywhere from 1/4 to 1/2-inch wide over the pot. Put on two potholders because you probably already know that steam is hot; I apparently did not. Pour 1/4 of the batter into the colander and press it through the holes with a flexible spatula. Boil for 2 to 3 minutes then use a slotted spoon to fish spaetzle out and drop it in the ice bath. Continue with remaining batter in 3 batches. I found it was important to use only a little batter at a time (and even less if your pot is smaller) because if you push too much batter in at a time, it becomes one freakish megaspaetzle as opposed to hundreds of tiny twisty ones. ",
    "When you’re done with the batter, drain the spaetzle well and toss it with a small amount of olive oil to keep it from sticking. You can use it right away, or keep it in the fridge for a day until needed.",
    "* The other spaetzle recipe I auditioned did not call for the resting time and worked just fine. I didn’t test this version without resting it in the fridge first for an hour, but suspect that you could get away with it if you were pinched for time. That said, the batter was really lovely — smoother, stretchier — after an hour, so if you can use that hour to prepare a salad or other parts of your meal, you should.",
    "Pan-Browned Spaetzle with Shallots and Herbs",
    "Heat a large skillet over medium-high. Heat 1 tablespoon unsalted butter. Once it is fully melted and beginning to turn golden add a couple cups of drained, cooled spaetzle and let it heat for a minute in the pan before starting to saute it about. Season with salt and freshly ground pepper and continue to cook it until each piece has a couple toasty brown edges. Add 1 tablespoon minced shallot and cook for one minute more. Adjust seasonings to taste and, off the heat, toss with 1 tablespoon minced herbs (I used parsley and dill but others, like tarragon or chives, would work well.) Eat immediately."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaetzle1.jpg?w=500",
  "ingredient_list": [
    "2 cups (250 grams) all-purpose flour",
    "7 large eggs",
    "1/4 cup (59 ml) milk"
  ],
  "tags": [
    "Pasta",
    "Photo",
    "Side Dish"
  ],
  "title": "spaetzle",
  "url": "https://smittenkitchen.com/2011/03/spaetzle/"
}