{
  "date": "2008-06-27T14:43:06+00:00",
  "directions": [
    "Bring a large pot of water to a boil and add salt. Add the pasta and cook until al dente, about 10 minutes.",
    "While the water comes to a boil and the pasta cooks, cut the zucchini with the fine French-fry cutter on a mandoline. If you do not have one, cut by hand into the longest, finest julienne you can manage. Season with salt and pepper. If your zucchini is very finely cut, it does not need to be cooked. Otherwise, place in a colander, suspend over the pasta pot, cover the pot, and steam the zucchini until still slightly crunchy, about 2 minutes.",
    "Heat 1/4 cup of the olive oil in a small skillet over medium-high heat until hot. Add the garlic and saute briefly until light brown. Turn on the exhaust fan and add the red pepper flakes. Quickly mix in the basil and remove from the heat. When the pasta is al dente, drain through a colander, reserving about 1/2 cup of the pasta cooking water.",
    "Pour the pasta into a warm serving bowl; add the zucchini, basil oil (optional, recipe below), the garlic mixture, and 1/2 cup of the cheese. Toss well, adding cooking water as needed to make a smooth sauce. Taste for seasoning and add salt and pepper, as needed. Grate about 2 tablespoons Parmesan over the top and serve at once.",
    "Basil Oil (or any other herb-flavored olive oil)",
    "Makes 1 1/3 cups",
    "For soft herbs, such as basil, parsley, cilantro or tarragon: Use 4 cups packed leaves to 2 cups pure olive oil. ",
    "For woody herbs, such as rosemary, sage, thyme, oregano or lemon verbena: Use 1 cup packed leaves to 2 cups pure olive oil.",
    "In a blender, puree the herbs and oil until completely smooth. Put the mixture in a saucepan and bring it to a simmer over moderate heat. Simmer for 45 seconds, then pour through a fine-mesh strainer into a bowl. Don’t press on the mixture, but you can tap the strainer against your hand to get the oil to drip through faster. ",
    "[Chirello has steps here to strain again through a coffee filter and let it settle for a few hours but I skipped all this and still had a gorgeous, delicious, unbelievably potent basil oil.]",
    "Note: Fresh herb oils are better to toss into pasta at the end rather than cook with, so the oil keeps its fresh, uncooked taste. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/zucchini-strand-spaghetti1.jpg?w=500",
  "ingredient_list": [],
  "tags": [
    "Pasta",
    "Photo",
    "Summer",
    "Vegetarian",
    "Zucchini"
  ],
  "title": "zucchini strand spaghetti",
  "url": "https://smittenkitchen.com/2008/06/zucchini-strand-spaghetti/"
}