{
  "date": "2010-01-12T14:00:01+00:00",
  "directions": [
    "Make the soup on the stove: Heat olive oil in the bottom of a 5-quart or larger Dutch oven or stock pot over medium-high heat. Add onions and both bell peppers and sauté until beginning to brown, about eight minutes. Add garlic and cumin; stir one minute. Add beans and chipotles, then 7 cups water. Bring to a full boil, boil for 1 minute, then reduce heat to a gentle simmer, partially cover pot, and cook until beans have softened, about 2 to 3 hours. (These times can vary a lot depending on the age of the beans and kind of water.)\nMake the soup in a slow-cooker: Heat olive oil in large skillet over medium-high heat. Add onions and both bell peppers and sauté until beginning to brown, about eight minutes. Add garlic and cumin; stir one minute. Transfer mixture to 6-quart slow cooker. Add beans and chipotles, then 7 cups hot water. Cover and cook on high until beans are very tender, about 6 hours. [But see note up top because mine finish sooner, although most others have not.]\nMake the soup in an InstantPot or electric pressure cooker: Heat olive oil in the bottom of your pressure cooker on the sauté function. Add onions and both bell peppers and sauté until beginning to brown, about eight minutes. Add garlic and cumin; stir one minute. Add beans and chipotles, then 7 cups hot water. Cover, locking lid and closing steam valve. Cook at high pressure on the manual setting for 30 minutes. If you have time, let the pressure release naturally. I didn’t have a lot of time, and let it release naturally for 10 to 15 minutes, then manually the rest of the way.\nWhile it cooks, make the topping: Place the cumin in a small sauté pan over medium heat. Toast until lightly golden brown. Place in spice grinder or mortar and pestle and grind until coarse. Stir it into the cream and season with salt and pepper, to taste.\nAll cooking methods: Transfer two cups bean mixture to blender; puree until smooth, then return the puree to remaining soup in slow cooker. Or, you can use an immersion blender to partially blend the soup right where you’ve cooked it. Stir in lime juice, salt, and pepper. Adjust seasonings to taste; we found we needed more salt. Ladle soup into bowls. Spoon dollop of toasted cumin seed cream (below) over each bowl and serve.",
    "Do ahead: This soup keeps great in the fridge, and even thickens a bit. In a good way!\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/black-bean-soup1.jpg?w=750",
  "ingredient_list": [
    "1 tablespoon olive oil",
    "2 medium-size red onions, chopped",
    "1 medium-size red bell pepper, chopped",
    "1 medium-size green bell pepper, chopped",
    "4 garlic cloves, minced",
    "4 teaspoons ground cumin",
    "1 16-ounce package dried black beans",
    "1 tablespoon chopped chipotle chiles from a can (this gives it a solid kick, dial back if you are wary)",
    "7 cups water",
    "2 tablespoons fresh lime juice",
    "2 teaspoons coarse kosher salt",
    "1/4 teaspoon ground black pepper",
    "1 tablespoon whole cumin seeds",
    null,
    "Salt and freshly ground pepper"
  ],
  "tags": [
    "Beans",
    "Budget",
    "Gluten-Free",
    "Peppers",
    "Photo",
    "Slow Cooker",
    "Soup",
    "Tex-Mex",
    "Vegetarian"
  ],
  "title": "black bean soup + toasted cumin seed crema",
  "url": "https://smittenkitchen.com/2010/01/black-bean-soup-toasted-cumin-seed-crema/"
}