{
  "date": "2014-09-05T11:14:24+00:00",
  "directions": [
    "Heat oven to 350 degrees F. Spread hazelnuts on a tray and bake for 10 minutes, then toss them around and return them to the oven for another 2 to 5 minutes, until they’re fragrant and golden brown under their skins. Let cool to lukewarm. Place in a large bowl or jar and cover with an inch or so of water. Let soak overnight or up to two days at room temperature.",
    "Drain hazelnuts and rinse, then place in a food processor or blender. (If you have both, I’d opt for the blender.) Add 3 1/2 cups water and blend for longer than seems necessary to puree them. Set a mesh strainer over a large bowl. Line it with a fine-mesh cheesecloth such as butter muslin or nut milk bag or a lint-free dish towel, leaving overhang so that you’ll have enough cloth to wring the mixture out in a few minutes.",
    "Pour blended hazelnut mixture through cloth; you can use a spoon to stir it and help it along. When you’ve got mostly semi-solids left in the cloth, pull up the sides and use it to wring what you can from the hazelnuts.* What’s in your bowl is now the toasted hazelnut milk.",
    "In a large saucepan or microwave-safe bowl, melt your chocolate halfway, then stir it off the heat until it it finishes melting. Whisk in 1 cup toasted hazelnut milk, at first one teaspoon at at time and then in a thin stream until you have a smooth chocolate-hazelnut sauce. Whisk this into the remaining toasted hazelnut milk. Chill until needed.",
    "Do ahead: I’ve read that nut milks only keep for two days, but could this be true? I would have guessed a week. I will update this with a firmer estimate once I learn/experiment more.",
    "* What to do with the leftover nut meal? I’ve seen suggestions to toast it in a pan to dry it out and then add the nut meal to baked goods and/or granola. Let me know if you have a creative use for it."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/chocolate-and-toasted-hazelnut-milk1.jpg?w=640",
  "ingredient_list": [
    "2 cups (10 ounces or 285 grams) hazelnuts",
    "3 1/2 cups (830 grams) water, plus more for soaking",
    "1 1/4 cups (7 1/2 ounces 215 grams) semisweet chocolate chips or rough-chopped chocolate",
    "Sugar or a sweetener to taste (optional)"
  ],
  "tags": [
    "Chocolate",
    "Drinks",
    "Photo",
    "Snack",
    "Vegan"
  ],
  "title": "chocolate and toasted hazelnut milk",
  "url": "https://smittenkitchen.com/2014/09/chocolate-and-toasted-hazelnut-milk/"
}