{
  "date": "2010-04-25T13:25:41+00:00",
  "directions": [
    "Wash your chard, but no need to dry it, just place it in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 6 minutes.",
    "Press or squeeze out the excess liquid any number of ways, either by wringing it out in cheesecloth (my favorite method), putting it in a mesh strainer and pressing the moisture out with a spatula or large spoon or letting it cool long enough to grab small handfuls and squeezing them to remove as much water as possible.",
    "Wipe out the large pot so you can use it again. Heat milk or cream in a small saucepan over moderate heat, stirring, until warm. Keep warm. Meanwhile, cook onion and garlic, if using, in butter in your wiped-out large pot over moderately low heat, stirring occasionally, until softened, about six minutes. Whisk in flour and cook roux, whisking, about three minutes. Add warm milk or cream in a slow stream, whisking constantly to prevent lumps, and simmer, whisking, until thickened, three to four minutes. Stir in chard, then salt and pepper to taste and cook, stirring, until heated through.",
    "To make Creamed Chard and Spring Onion Pasta: Use 1 3/4 cups of milk instead of 1 1/4 cups. Stir 1/4 cup finely grated parmesan into the sauce while cooking, and keep extra on hand for serving. This should be enough to toss with about half a pound of pasta (more or less depending on how saucy you like yours)."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creamed-chard-and-spring-onions1.jpg?w=500",
  "ingredient_list": [
    "1 1-pound bunch Swiss chard, thick stems removed and leaves sliced into ribbons",
    "3 spring onions, ends trimmed, white and some green parts sliced into thin coins",
    "3 tablespoons butter",
    "3 tablespoons all-purpose flour",
    "1 1/4 cups milk",
    "Salt and pepper"
  ],
  "tags": [
    "Onions",
    "Pasta",
    "Photo",
    "Side Dish",
    "Spring",
    "Swiss Chard",
    "Vegetarian"
  ],
  "title": "creamed chard and spring onions",
  "url": "https://smittenkitchen.com/2010/04/creamed-chard-and-spring-onions/"
}