{
  "date": "2013-01-08T11:55:50+00:00",
  "directions": [
    "Olive oil, paprika or sumac, pita wedges (brushed with olive oil and sprinkled with za’atar, or a combination of sesame seeds and sea salt), and/or carrot sticks [optional] to serve",
    "If using dried chickpeas: There are multiple methods to cooking them, and you can use whichever is your favorite, or Ottolenghi’s, or mine. Ottolenghi’s is to put the chickpeas in a large bowl and cover them with at least twice their volume of cold water, leaving them to soak overnight. The next day, drain them, and saute them in a medium saucepan with the baking soda (which many find reduces the gassy effects of fresh beans) for about three minutes. Add 3 1/4 cups water and bring it to a boil. Skim any foam that floats to the surface. They’ll need to cook for 20 to 40 minutes, sometimes even longer, depending on freshness, to become tender. When tender, one will break up easily between your thumb and forefinger. My method is similar, but I often put mine in a slow-cooker on high with the baking soda for approximately three hours, so I don’t have to monitor them as much. ",
    "Drain the chickpeas (saving the chickpea broth for soups or to thin the hummus, if desired) and cool enough that you can pick one up without burning your fingers. ",
    "Whether fresh or canned chickpeas: Peel your chickpeas. I find this is easiest when you take a chickpea between your thumb and next two fingers, arranging the pointy end in towards your palm, and “pop!” the naked chickpea out. Discard the skin. I get into a rhythm and rather enjoy this, but it’s also already established that I’m a weirdo.",
    "In a food processor, blend the chickpeas until powdery clumps form, a full minute, scraping down the sides. Add the tahini, lemon juice, garlic and salt and blend until pureed. With the machine running, drizzle in water or reserved chickpea cooking water, 1 tablespoon at a time, until you get very smooth, light and creamy mixture. I find I need about 4 tablespoons for this volume, but you may need slightly more or less. ",
    "Taste and adjust seasonings, adding more salt or lemon if needed. I do recommend that you hold off on adding more garlic just yet, however. I find that it “blooms” as it settles in the fridge overnight, becoming much more garlicky after a rest, so that even if it doesn’t seem like enough at first, it likely will be in the long run.",
    "Transfer the hummus to a bowl and rest it in the fridge for at least 30 minutes, longer if you can. To serve, drizzle it with a little olive oil, and sprinkle it with paprika. Serve it with pita wedges or carrot sticks. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/01/ethereally-smooth-hummus.jpg?w=750",
  "ingredient_list": [
    "1 3/4 cups cooked, drained chickpeas (from a 15-ounce can) or a little shy of 2/3 cup dried chickpeas (for same yield)",
    "1/2 teaspoon baking soda (for dried chickpeas only)",
    "1/2 cup tahini paste",
    "2 tablespoons freshly squeezed lemon juice, or more to taste",
    "2 small cloves garlic, roughly chopped",
    "3/4 teaspoon table salt, or more to taste",
    "Approximately 1/4 cup water or reserved chickpea cooking water"
  ],
  "tags": [
    "Beans",
    "Middle Eastern",
    "Photo",
    "Snack",
    "Vegan",
    "Vegetarian"
  ],
  "title": "ethereally smooth hummus",
  "url": "https://smittenkitchen.com/2013/01/ethereally-smooth-hummus/"
}