{
  "date": "2010-10-13T10:03:18+00:00",
  "directions": [
    "Preheat oven to 400°F. Arrange tomatoes, eggplant, onion and garlic on a large baking sheet, or two smaller ones if you, like me, have a tiny oven. Brush or drizzle vegetables with oil then roast them for 20 minutes, pausing only to remove the garlic cloves (the original recipe had you keep them in the whole time, and mine, sadly, burned) and returning the pans to the oven for another 25 minutes, until the remaining vegetables are tender and brown in spots. Remove from oven and scoop eggplant from skin into a heavy, large saucepan or soup pot. Add the rest of the vegetables, the thyme and the chicken or vegetable stock and bring to a boil, then reduce to a simmer. Cook until onion is very tender, about 45 minutes (mine took longer). Cool slightly.",
    "Working in batches, puree soup in blender until it is as smooth as you’d like it to be. (Or, if you have an immersion blender, you can do this in the pot.) Back in the pot, add the cream and bring the soup back to a simmer. Season with salt and pepper. Serve in four bowls, sprinkled with goat cheese.",
    "A spicier riff: As I mentioned above, if you like to play with spices, this soup has a lot of potential. The next time I make it, I might give it a spin with 1 to 2 teaspoons ground cumin, 1 teaspoon ground coriander and a pinch of red pepper flakes or Aleppo pepper added in with the broth. I might finish the soup with a squeeze of lemon juice and I might use feta, which has a stronger flavor than the soft chevre that I used. If you add any spices or made any changes, I’d love to hear what you came up with in the comments."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-eggplant-soup1.jpg?w=500",
  "ingredient_list": [
    "3 medium tomatoes, halved",
    "1 large eggplant (about 1 1/2 pounds), halved lengthwise (I used 3 smaller ones)",
    "1 small onion, halved (eh, mine was medium)",
    "6 large garlic cloves, peeled",
    "2 tablespoons olive oil",
    "1 tablespoon chopped fresh thyme or 1 teaspoon dried",
    "4 cups chicken stock or vegetable broth",
    "1/4 cup heavy cream (you can add more to taste, or skip this entirely)",
    "3/4 cup (about 3 1/2 ounces) crumbled goat cheese"
  ],
  "tags": [
    "Eggplant",
    "Fall",
    "Photo",
    "Soup",
    "Tomatoes",
    "Vegetarian"
  ],
  "title": "roasted eggplant soup",
  "url": "https://smittenkitchen.com/2010/10/roasted-eggplant-soup/"
}