{
  "date": "2010-02-24T20:05:57+00:00",
  "directions": [
    "Soak the rice, cinnamon sticks, lemon or orange zest and whole or powdered cloves in the water in a heavy saucepan for 1 hour.",
    "After soaking, bring the rice mixture to a boil on high heat, uncovered. When it starts to boil (about 5 minutes), lower the heat to medium and cook for 10 to 12 more minutes or until water is almost evaporated.",
    "While rice is cooking, beat the egg in a bowl. Add the milk and stir well to mix. Add the egg mixture, condensed milk, salt, vanilla extract and raisins, if using, to the rice and cook over medium-low heat, stirring carefully, until it thickens slightly or until desired consistency about 25 to 35 minutes (see notes that follow).",
    "(About cooking time: Many reviewers said 25 to 35 minutes was way too much cooking time for them, and that 15 to 20 minutes would have been better. I was all ready to pull my pot off early, but actually needed almost 30 minutes. Still, want to give you a heads up that yours might be done sooner.)",
    "(About “desired consistency”: I cooked mine until all but 10 percent of the liquid had been absorbed, which yielded a creamy, not-too-thick pudding. If you like your arroz con leche thinner, pull it off the stove when more liquid is left. This pudding does most of its thickening as it cools, but the end result should still be thinner than traditional rice pudding.)",
    "Remove citrus zest and cinnamon sticks. Let cool uncovered, then chill the rest of the way in the fridge.",
    "Mexican cinnamon: A long time ago, I bought a jar of canela (Mexican \"soft cinnamon\") sticks from Rancho Gordo and this was the perfect time to bust it out. The cinnamon flavor is just a little different than we’re used to, a little less loud and one note, a little dynamic. It smells exactly like a cross between a cinnamon stick and apple cider. Seriously! When simmered with the pudding for almost an hour, the pudding had an almost spicy edge to it and an unmistakable flavor I associate only with arroz con leche."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/02/arroz-con-leche.jpg?w=751",
  "ingredient_list": [
    "1 cup long-grain white rice",
    "2 cinnamon sticks (I had very large canela sticks — see bottom for more info — so I only used one)",
    "2 strips of lemon or orange zest (can use a peeler to get a larger piece)",
    "3 whole cloves or a tiny pinch of ground cloves",
    "4 cups water",
    "1 egg",
    "3 cups whole milk (updated to note that many people, including my  mother, successfully made this with lower fat milks)",
    "1 (12-ounce) can sweetened condensed milk (I realized after the fact that my can had been 14 ounces, had no averse effect)",
    "1/4 teaspoon salt",
    "1 tablespoon vanilla",
    "1/2 cup raisins (optional)"
  ],
  "tags": [
    "Coconut",
    "Photo",
    "Pudding"
  ],
  "title": "arroz con leche (rice pudding)",
  "url": "https://smittenkitchen.com/2010/02/arroz-con-leche-rice-pudding/"
}