{
  "date": "2011-11-16T11:27:48+00:00",
  "directions": [
    "Preheat oven to 350°F.",
    "The quickest method: In a medium bowl, whisk together all of the pudding ingredients.",
    "For creamier, silkier pudding: Combine pumpkin, sugar, salt and spices in a food processor and blend for 30 seconds. Transfer to a saucepan and heat over medium-high. Once glurping and simmering in the pot, cook for another 5 minutes, stirring frequently. The mixture will thicken and get a bit darker. Reduce heat slightly and whisk in milk and cream. Off the heat, slowly whisk in eggs.",
    "Both methods: Divide between 7 to 8 (I had just shy of enough to make eight 1/2-cup puddings) ovenproof 6-ounce pudding cups or ramekins on a baking sheet. Bake for 35 to 40 minutes, until puddings barely jiggle when shimmied and/or a knife tip inserted into the center of puddings comes out clean. Try not to overbake.",
    "While they bake, combine topping ingredients in a small bowl. When the puddings are cooked through, transfer to a cooling rack on the counter and leave oven on. Spoon 2 tablespoons of sour cream mixture onto first pudding and use a small offset spatula, butter knife or spoon to quickly (it will get melty fast) spread it over the top of the first pudding. Repeat with remaining puddings.",
    "Return puddings to oven for 5 more minutes, then cool completely at room temperature, about 1 to 2 hours. Chill until ready to serve. Eat with a gingersnap."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/11/baked-pumpkin-puddings-with-sour-cream.jpg?w=750",
  "ingredient_list": [
    "Pudding",
    "1 3/4 cups (from a 15-ounce can, 415 grams) pumpkin puree (unsweetened; not pumpkin pie filling)",
    "1/2 cup (100 grams) granulated sugar",
    "1 teaspoon (2 grams) ground cinnamon",
    "1/2 teaspoon (3 grams) table salt",
    "1/2 teaspoon ground ginger",
    "1/4 teaspoon ground cloves",
    "1 cup (237 ml) whole milk",
    "1/2 cup (118 ml) heavy cream",
    "2 large eggs, lightly beaten",
    "Topping",
    "1 cup (227 grams) sour cream",
    "1 tablespoon (13 grams) granulated sugar",
    "1/4 teaspoon (1 ml) vanilla extract"
  ],
  "tags": [
    "Fall",
    "Gluten-Free",
    "Photo",
    "Pudding",
    "Pumpkin",
    "Thanksgiving"
  ],
  "title": "baked pumpkin and sour cream puddings",
  "url": "https://smittenkitchen.com/2011/11/baked-pumpkin-and-sour-cream-puddings/"
}