{
  "date": "2008-02-06T13:08:40+00:00",
  "directions": [
    "Make crust: Put oven rack in middle position and preheat oven to 325°F. Line bottom and sides of an 8-inch square baking pan with 2 sheets of foil (crisscrossed), leaving a 2-inch overhang on all sides.",
    "Finely grind crackers with sugar and a pinch of salt in a food processor. With motor running, add butter, blending until combined. Press mixture evenly onto bottom of baking pan. Bake 10 minutes, then cool in pan on a rack 5 minutes.",
    "Make filling: Sprinkle gelatin over milk in a small bowl and let stand 2 minutes to soften. Beat together cream cheese, eggs, salt, and gelatin mixture in a bowl with an electric mixer at medium speed until well combined, about 2 minutes, then stir in dulce de leche gently but thoroughly. Pour filling over crust, smoothing top, then bake in a hot water bath (I was able to fit mine in a 9×13-inch baking pan) in oven until center is just set, about 45 minutes. Cool cheesecake completely in pan on rack, about 2 hours. Chill, covered, at least 6 hours.",
    "Glaze cake within 2 hours of serving: Heat all glaze ingredients in a double boiler or a small metal bowl set over a saucepan of barely simmering water, stirring until smooth, then pour over cheesecake, tilting baking pan to coat top evenly. Chill, uncovered, 30 minutes.",
    "Lift cheesecake from pan using foil overhang and cut into 1-inch squares with a thin knife, wiping off knife after each cut. (Don’t skip this step! A clean knife is essential for uber-neat squares.)",
    "Note: Cheesecake (without glaze) can be chilled up to 3 days.",
    "Dulce de Leche (Milk Caramel)",
    "I know that most of the world makes this by boiling the milk inside a closed can, but honestly, that scares the bejesus out of me and according to the Carnation can label I pulled this technique from, is not recommended by them (likely because they do not want to get sued, but still). This method works just as well.",
    "Pour one can (14 ounce) sweetened condensed milk into top of double-boiler pan; cover. Place over boiling water. Cook over low heat, stirring occasionally, for 40 to 50 minutes, or until thick and light caramel-colored.",
    "Remove from heat. Whisk until smooth."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/dulce-de-leche-cheesecake-squares.jpg?w=750",
  "ingredient_list": [
    "For crust",
    "3 1/2 ounces (100 grams or 1 cup) graham crackers, crumbled",
    "2 tablespoons (25 grams) sugar",
    "3 tablespoons (45 grams) unsalted butter, melted",
    "For filling",
    "1 teaspoon unflavored gelatin (from a 1/4-ounce or 7-gram envelope, will be just about half an envelope)",
    "1/4 cup (60 ml) whole milk",
    "8 ounces (225 grams) cream cheese, softened",
    "2 large eggs",
    "3/8 teaspoon salt",
    "1 cup dulce de leche (12 1/2-ounce or 355-gram can) (recipe follows)",
    "For glaze",
    "3 ounces (85 grams) fine-quality bittersweet chocolate (not unsweetened), coarsely chopped",
    "1/2 stick (2 ounces or 55 grams) unsalted butter, cut into pieces",
    "2 teaspoons light corn syrup"
  ],
  "tags": [
    "Bars",
    "Cake",
    "Chocolate",
    "Photo"
  ],
  "title": "dulce de leche cheesecake squares",
  "url": "https://smittenkitchen.com/2008/02/dulce-de-leche-cheesecake-squares/"
}