[
    {
        "ingredient_list": [
            "For squash soup", 
            "3/4 stick (6 tablespoons) unsalted butter, cut into pieces", 
            "1 medium onion, halved lengthwise and thinly sliced crosswise", 
            "1/2 teaspoon salt", 
            "2 lb yellow summer squash, halved and thinly sliced", 
            "2 carrots, thinly sliced", 
            "1 yellow-fleshed potato (1/2 pound), peeled, halved, and thinly sliced", 
            "4 cups chicken stock or reduced-sodium chicken broth", 
            "For pistou**", 
            "3/4 cup loosely packed fresh mint leaves", 
            "1/2 cup loosely packed fresh flat-leaf parsley sprigs", 
            "1 large scallion, chopped (1/2 cup)", 
            "1/4 cup extra-virgin olive oil", 
            "2 tablespoons water", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/a-soup-to-build-dream-on1.jpg?w=500", 
        "tags": [
            "Carrots", 
            "Gluten-Free", 
            "Photo", 
            "Potatoes", 
            "Soup", 
            "Summer", 
            "Summer Squash"
        ], 
        "url": "https://smittenkitchen.com/2006/09/a-soup-to-build-dream-on/", 
        "title": "summer squash soup", 
        "directions": [], 
        "date": "2006-09-11T09:26:32+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups cooked, drained and chopped artichoke hearts (will start as 3 cups from a 12-ounce frozen bag, prep directions below)", 
            "1 medium (about 6 ounces) Yukon gold potato, peeled and diced very small (1/4 to 1/2-inch pieces)", 
            "1/4 cup heavy cream, plus up to 2 tablespoons more to taste", 
            "1 small clove garlic, minced", 
            "Kosher salt and freshly ground black pepper", 
            "Few gratings of lemon zest", 
            "Juice of half a lemon", 
            "1 cup (2 1/2 ounces) finely grated aged Asiago cheese, though Parmesan or Pecorino should work well here too", 
            "6 slices hearty bread, your favorite kind (see Note up top for mine)", 
            "Parsley to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/16947742118_f951543925_k.jpg?w=751", 
        "tags": [
            "Artichokes", 
            "Photo", 
            "Potatoes", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/04/artichoke-gratin-toasts/", 
        "title": "artichoke gratin toasts", 
        "directions": [
            "Cook frozen artichokes on the stove artichokes in simmering water until firm-tender, which took 4 to 5 minutes for the brand I used. Drain well in a colander, then spread out on layers of paper towels and do you best to press all of the water out. You can keep them on towels while you prepare the other ingredients.", 
            "Cover diced potatoes with in inch of cold water and a few pinches of salt (using the same pot as the artichokes, because doing dishes is the worst) and set a timer for 8 minutes. Bring to a simmer and cook until potatoes are tender but not falling apart, usually about the allotted 8 minutes but go by texture, not timer. Drain potatoes, wipe out pot, and put cream, garlic, lemon zest, salt and pepper back in. Bring to a simmer and cook for one minute, stirring because this will be a tiny amount in a bigger pot. Add drained potatoes and cook together for 1 to 2 minutes more. ", 
            "Chop drained and patted dry artichokes into bite-sized (about 1/2-inch) chunks and place in a large bowl. Season with salt and lemon juice to taste. Add potato-cream mixture and 3/4 cup grated cheese and stir to combine. Taste for seasoning and adjust salt and pepper if needed (will probably be needed). Add up to 2 extra tablespoons heavy cream if the mixture seems a little dry. ", 
            "Heat the broiler on your oven, or simply your oven itself to 450°F. Arrange slices of bread on a foil-lined tray (for easy clean up) and heap artichoke-potato mixture evenly over slices. Sprinkle with reserved cheese, and bake or broil until browned and melty, anywhere from 5 minutes under a good broiler to 10 to 15 minutes in a less-intense oven. Eat hot and repeat again tomorrow."
        ], 
        "date": "2015-04-13T12:05:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 ounce walnuts (about 1/3 cup)", 
            "1 1/2 pounds fingerling potatoes, cut crosswise into 1/2-inch-thick rounds", 
            "6 ounces haricots, verts, or other green beans, trimmed and cut into 2-inch segments", 
            "2 tablespoons white wine or other mild vinegar", 
            "2 tablespoons plain yogurt", 
            "1 teaspoon Dijon mustard", 
            "1 teaspoon coarse salt", 
            "Freshly ground pepper", 
            "2 tablespoons walnut oil", 
            "3 ounces baby arugula"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/arugula-potato-and-green-bean-salad1.jpg?w=500", 
        "tags": [
            "Arugula", 
            "Green Beans", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/07/arugula-potato-and-green-bean-salad/", 
        "title": "arugula, potato and green bean salad", 
        "directions": [
            "Preheat oven to 375°. Place walnuts on a rimmed baking sheet and toast in oven until fragrant, about 8 minutes. Let cool slightly, then coarsely chop and set aside.", 
            "Bring a medium saucepan of water to a boil. Add potatoes, and cook until tender, about 10 minutes. Using a slotted spoon, transfer potatoes to a colander to drain and cool. Set aside.", 
            "Prepare an ice-water bath; set aside. Return pan of water to a boil. Add green beans, and cook until tender and bright green, about 3 to 4 minutes. Using a slotted spoon, transfer to ice-water bath to stop the cooking. Drain.", 
            "Whisk together vinegar, yogurt, mustard and 1/2 teaspoon salt in a small bowl; season with pepper. Add oil in a slow, steady stream, whisking until emulsified. Set dressing aside.", 
            "Arrange arugula, potatoes, and green beans on a platter. Season with remaining 1/2 teaspoon salt and 1/4 teaspoon pepper. Drizzle with dressing and sprinkle with toasted walnuts; toss to coat."
        ], 
        "date": "2009-07-16T15:31:03+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound thick-cut bacon, cut into small dice", 
            "1 pound red potatoes, scrubbed clean and diced into 1/4- to 1/2-inch cubes (about 3 to 3 1/4 cups)", 
            "Salt and freshly ground black pepper", 
            "4 medium-large ears corn, kernels cut from the cob (2 1/2 to 3 cups)", 
            "1 bundle scallions, thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/bacon-corn-hash.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Budget", 
            "Corn", 
            "Gluten-Free", 
            "Meat", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Summer", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2012/07/bacon-corn-hash/", 
        "title": "bacon corn hash", 
        "directions": [
            "Toss bacon into a large skillet over medium heat, no need to heat the pan first. Let rest for a few minutes until it starts sizzling, then move the bits around so that they begin to brown evenly. Again, wait a couple minutes before shuffling the pieces around; you’re looking for them to get evenly golden and crisp. This should take about 10 minutes. Remove the bacon bits with a slotted spoon, leaving the drippings in the pan and transferring the bacon to paper towels to drain.", 
            "If your bacon is like mine, you’ll be left with a spectacular amount of fat behind. You’ll be tempted to drain it off. May I ask you not to? The potatoes that cook in this will be gorgeous and you will have a chance to remove this extra in a bit. It will mostly stay in the pan.", 
            "Heat the pan to medium/medium-high, making sure the bacon fat is nicely sizzly, then add your potatoes all at once in a single layer. Sprinkle them with 1/2 teaspoon table salt and several grinds of black pepper. Let them cook for a few minutes in one place and get a bit golden underneath before turning them over and moving them around. Repeat this process until the potatoes are browned on all sides; this takes about 20 minutes.", 
            "At this point, you can push aside the potatoes and pour or spoon off all but a small amount of the fat. I won’t tell you how much I was able to remove but it rhymes with shmoo to shmee shmablespoons. If you save it, you can use it to fry an egg in a bit.", 
            "Bump up the heat a little and add the corn to the skillet. Saute the potatoes and corn together until the corn gets a bit brown but stays fairly crisp, about 4 to 5 minutes. Add the drained bacon, and stir the mixture together until it’s evenly warm, about 1 more minute. Remove the skillet from the burner and sprinkle the scallions (reserving a couple spoonfuls if you’d like to use them as fried egg garnish) over the hash. In two minutes, they should be warm and mellowed. Season with more salt or pepper to taste, if needed.", 
            "Add a fried egg to it: Heat a small skillet over medium-high heat and swirl in one to two teaspoons bacon fat or butter. Crack one egg into the skillet and reduce heat to medium. I like to cover the skillet with a small lid at this point, as it seems to help the egg cook faster and more evenly. In one minute, you should have a perfect sunny-side-up egg. Season with salt and pepper, serve on top of a pile of bacon corn hash. "
        ], 
        "date": "2012-07-17T14:28:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 head garlic", 
            "3 tablespoons unsalted butter", 
            "2 medium leeks, white and light green parts halved lengthwise, washed, and chopped small", 
            "5 to 6 cups low-sodium chicken or vegetable broth (I used 5 cups; add the extra cup after pureeing if you’d like a thinner soup)", 
            "2 bay leaves", 
            "Table salt", 
            "2 1/2 pounds russet potatoes, peeled and cut into 1/2-inch cubes", 
            "1/3 cup sour cream", 
            "Ground black pepper", 
            "Toppings, optional:", 
            "Minced fresh chives or scallions", 
            "Bacon bits", 
            "Sour cream", 
            "Grated cheddar", 
            "A drizzle of melted (or melted and browned) butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/01/baked-potato-soup.jpg?w=751", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Soup", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/01/baked-potato-soup/", 
        "title": "baked potato soup", 
        "directions": [
            "Rinse the head of garlic to remove any outside grit or dirt. Cut the top third off the head and peel any loose papery skins off the bottom two-thirds. Instead of discarding the top third (CI’s suggestion), pop out a bunch (or all) of the garlic clove tips and mince them. If you’re Deb, breathe a sigh of relief that you have wasted nothing.", 
            "In a large, heavy pot or Dutch oven, melt the butter over medium heat. Add leeks and cook them until soft (but not brown), about 5 minutes. Add the minced garlic and cook another minute. Add the larger part of the garlic head (whole, not chopped), broth, bay leaves and 3/4 teaspoon salt. Reduce heat and simmer until garlic is very tender when pierced with tip of knife, 30 to 40 minutes. Add potatoes and continue to simmer, partially covered, until potatoes are tender, about 15 to 20 minutes.", 
            "Discard bay leaves. Remove garlic heads. Optional: If you’d like an extra garlic boost to the soup, using tongs or paper towels, squeeze garlic head at root end until cloves slip out of their skins. Using a  fork, mash the garlic cloves to smooth paste and add it back to the soup. [I felt our soup was garlicky enough without this. It had a great suggestion of garlic without overpowering the baked potato flavor.]", 
            "Add sour cream to soup and cook for another 2 to 3 minutes. Adjust seasonings, adding more salt and pepper to taste. Using immersion blender, process soup until chunky-creamy, leaving lots of potato texture intact. (Alternatively, transfer a portion of the potatoes and broth to a food processor or blender and puree until smooth.) Serve with whatever makes you happy on top, or nothing at all."
        ], 
        "date": "2011-01-19T12:42:08+00:00"
    }, 
    {
        "ingredient_list": [
            "4 baking potatoes (about 2 pounds)", 
            "3 tablespoons olive oil, divided", 
            "3 tablespoons butter, divided", 
            "1 small white onion, finely chopped", 
            "2 garlic cloves minced", 
            "1 1/2 pounds mixed mushrooms, wild are wonderful, but sliced cremini or white mushrooms will also work", 
            "Salt and freshly ground pepper", 
            "1/2 cup white wine or vermouth, or 1/4 cup sherry or marsala (optional)", 
            "1/2 cup vegetable or beef broth, plus a splash or two extra if needed", 
            "1/2 teaspoon chopped thyme", 
            "4 ounce-log soft goat cheese", 
            "1 tablespoon minced fresh chives or flat-leaf parsley, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/baked-potatoes-with-wild-mushroom-ragu1.jpg?w=750", 
        "tags": [
            "Fall", 
            "Mushrooms", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/10/baked-potatoes-with-wild-mushroom-ragu/", 
        "title": "baked potatoes with wild mushroom ragù", 
        "directions": [
            "Heat oven to 425°F. Pierce potatoes all over with a fork and rub with 1 tablespoon olive oil. Place on rack and bake for 1 hour, or until tender in center when pierce with a skewer.", 
            "Meanwhile, in a large, deep skillet, melt the 2 tablespoons butter with 2 tablespoons olive oil over medium heat. Add the onion and garlic and sauté until softened, about 8 minutes. Turn heat to high, add mushrooms, salt and pepper and cook until the mushrooms brown, then release their juices and cook them off, about 10 minutes. Add wine, if using, scrape up any bits stuck to pan. Cook until evaporated. Add broth and thyme and bring to a simmer. Stir in final tablespoon of butter until melted. Adjust seasonings to taste.", 
            "Slit the potatoes and fluff the insides with a fork. Sprinkle with a little salt and pepper, a few goat cheese crumbles, a ladleful of the mushrooms and chives. Serve with extra mushrooms and goat cheese on the side."
        ], 
        "date": "2015-10-19T12:07:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 Savory Tart Shell, below, or recipe of your choice, in a 9-inch tart pan and ready to fill", 
            "1 pound small red potatoes, scrubbed and cut into 1/4-inch slices", 
            "1 cup heavy cream", 
            "1 large egg yolk", 
            "1/4 pound blue cheese, crumbled (about 3/4 cup)", 
            "1 tablespoons finely chopped herb or herbs of your choice, such as a mixture of thyme and rosemary", 
            "Fine sea salt for sprinkling", 
            "1 1/4 (5 1/2 ounces) cups flour", 
            "1 tablespoon plus 2 teaspoons cornstarch", 
            "1/4 teaspoon salt", 
            "6 tablespoons (3 ounces) butter, diced", 
            "1 large egg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/blue-cheese-and-red-potato-tart.jpg?w=749", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/06/blue-cheese-and-red-potato-tart/", 
        "title": "blue cheese and red potato tart", 
        "directions": [
            "In a large bowl, combine the flour, cornstarch and salt. Cut the butter in with a pastry blender, fork or two knives until it is in very tiny bits. Add one egg and mix with a fork until a dough forms. If this does not happen easily, toss it out onto a counter and knead it together. This dough is rather tough but with a little elbow grease, it does come together nicely.", 
            "This dough can also be made a food processor, or in a stand mixer, though I’ve only tried it in a food processor.", 
            "On a lightly floured surface, roll the dough out to a 12-inch circle. Place the dough in a 9-inch pie plate or tart pan and press to remove any air bubbles. Level the edges, and refrigerate for 30 minutes. Proceed with a filling of your choice, no parbaking required."
        ], 
        "date": "2010-06-22T13:31:17+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "3 3/4 (470 grams) cups all-purpose flour (feel free to replace up to half with whole-wheat)", 
            "1 1/2 teaspoons table salt", 
            "3 sticks (340 grams) unsalted butter, very cold", 
            "3/4 cup very cold water", 
            "Filling", 
            "1 pound yukon gold potatoes, peeled if desired, cut into 1/2-inch slices", 
            "10 ounces spinach (baby, “grown-up,” or frozen)", 
            "1 cup coarsely grated sharp cheddar cheese", 
            "4 scallions, thinly sliced", 
            "11 large eggs + 1 large egg white (you’ll use the yolk in a minute)", 
            "1 teaspoon kosher or coarse sea salt, plus more to taste", 
            "Freshly ground black pepper", 
            "To finish", 
            "1 large egg yolk (leftover from filling)", 
            "1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/breakfast-slab-pie1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Potatoes", 
            "Spinach", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/12/breakfast-slab-pie/", 
        "title": "breakfast slab pie", 
        "directions": [
            "Make pie crust: Whisk together flour, and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in the water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough roughly in half (it’s okay if one is slightly larger). Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day. [Still freaked out about making your own pie dough? Read this for a ton of additional tips and details.]", 
            "Heat oven  oven to 375 degrees F. Line bottom of 10x15x1-inch baking sheet or jellyroll pan with parchment paper.", 
            "Prepare filling: Place potatoes in a medium saucepan and cover with cold water. Bring to a boil, then reduce to a simmer, cooking for 7 to 10 minutes, until potatoes are tender but not falling apart. Drain. ", 
            "Wash spinach but no need to dry it. Place wet spinach in hot skillet and cook until it just wilts. Drain in a colander, pressing or squeezing out as much liquid as possible. You should have about 1 cup of spinach one wilted and squeezed. If spinach leaves were large, you might want to roughly chop the squeezed-out piles of spinach before adding it to the filling. ", 
            "Assemble pie: On a lightly floured surface, roll one of your dough halves (the larger one, if you have two different sizes) into an 18-by-13-inch rectangle. This can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible and using enough flour that it doesn’t stick to the counter. Transfer to your prepared baking sheet and gently drape some of the overhang in so that the dough fills out the inner edges and corners. Some pastry will still hang over the sides of the pan; trim this to 3/4-inch overhang.", 
            "Layer vegetables evenly over bottom pie crust. [You don’t want your pie to look like this, after all. NSFW language there, btw.] If using the fillings that I did, beat 11 whole eggs and 1 egg white lightly and pour over vegetables. If you’ve used other fillings, you might find that you need more or fewer eggs to mostly fill (I did not want to fill the crust to the top with eggs, as it would have been more difficult to bake without filling) the bottom crust; if you’re nervous, just beat a few eggs at a time and pour them in until your filling reaches the desired level. Sprinkle with salt and many grinds of black pepper.", 
            "Roll the second of your dough halves (the smaller one, if they were different sizes) into a 16-by-11-inch rectangle. Drape over filling and fold the bottom crust’s overhang over the edges sealing them together. Cut only a couple tiny slits in the lid to act as vents — too many or too big, and the filling will want to leak out before the eggs set. Beat remaining egg yolk with 1 teaspoon water and brush over lid. ", 
            "Bake pie: Until crust is golden and filling is set, about 40 to 45 minutes. Transfer to a wire rack and cool a bit before cutting into squares.", 
            "Do ahead: I haven’t frozen this pie, but suspect that it will freeze well already baked. Or, you could make the pie doughs up to one month in advance (storing them in the freezer), four days in advance (to store in the fridge) and roll them out when you’re ready to bake the pie. Baked slab pie will keep in the fridge for 3 to 4 days. Squares can be reheated as needed. Vegetables can be prepped (spinach wilted, potato par-boiled) and stored in the fridge for 2 days before using."
        ], 
        "date": "2013-12-20T12:29:43+00:00"
    }, 
    {
        "ingredient_list": [
            "200 grams (1 1/4 cups) red split lentils (masoor dal), picked over, washed and drained", 
            "1.2 liters (5 cups) water", 
            "1/2 teaspoon ground turmeric", 
            "5 tablespoons vegetable oil", 
            "1 teaspoon cumin seeds", 
            "2 to 4 cloves garlic, peeled and finely chopped", 
            "1 medium onion, peeled and cut into fine slices", 
            "225 grams (1/2 pound) cored and finely shredded cabbage", 
            "1 to 2 fresh, hot green chilies, finely sliced", 
            "1 1/2 teaspoons salt", 
            "1 medium tomato, peeled (ahem, Deb did not peel her tomato) and finely chopped", 
            "1/2 teaspoon peeled, finely grated fresh ginger", 
            "1 (1 3/4-lb) head cauliflower, cut into 3/4-inch-wide florets", 
            "1 1/4 lb Yukon Gold potatoes, peeled and cut into 1/2-inch cubes", 
            "5 tablespoons vegetable oil", 
            "1/2 teaspoon cumin seeds", 
            "3/4 teaspoon salt", 
            "1 medium onion, finely chopped", 
            "2 garlic cloves, finely chopped", 
            "2 teaspoons minced fresh jalapeño, including seeds", 
            "2 teaspoons minced peeled fresh ginger", 
            "1 teaspoon ground cumin", 
            "1/2 teaspoon ground coriander", 
            "1/4 teaspoon turmeric", 
            "1/4 teaspoon cayenne", 
            "1/2 cup water", 
            "1/4 cup finely chopped English (seedless cucumber)", 
            "1 thinly sliced scallion", 
            "3/4 cup yogurt", 
            "1/2 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/confessions-of-a-cumin-junkie1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Cabbage", 
            "Cauliflower", 
            "Gluten-Free", 
            "Indian", 
            "Photo", 
            "Potatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/02/confessions-of-a-cumin-junkie/", 
        "title": "recipes from a cumin junkie", 
        "directions": [
            "Mix!"
        ], 
        "date": "2007-02-26T21:39:55+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pork chops", 
            "6 boneless pork chops (about 3 ounces each)", 
            "About 3 cups buttermilk, whole milk if you can find it", 
            "Kosher salt and freshly cracked black pepper", 
            "2 cups yellow cornmeal", 
            "Cayenne pepper", 
            "Canola oil (or high heat safflower or sunflower, what I used) for shallow-frying", 
            "For the potatoes", 
            "3 pounds small-to-medium red potatoes", 
            "Kosher salt", 
            "1 cup half-and-half (or 1/2 cup milk plus 1/2 cup heavy cream)", 
            "6 ounces soft goat cheese", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, diced and chilled", 
            "1/2 cup finely sliced fresh chives", 
            "Freshly ground black or white pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/16531757598_bac3f9a735_k.jpg?w=751", 
        "tags": [
            "Gluten-Free", 
            "Meat", 
            "Photo", 
            "Potatoes", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/03/cornmeal-fried-pork-chops-goat-cheese-smashed-potatoes/", 
        "title": "cornmeal-fried pork chops + smashed potatoes", 
        "directions": [
            "Marinate the pork chops: Pound each pork chop (using a meat pounder or, in a pinch, I’ve also used a cast iron skillet, rather dramatically) between two pieces of plastic wrap to 1/8-inch thick. Place the chops in a container and cover them with the buttermilk. Cover and marinate at least four hours or overnight or in the refrigerator.", 
            "Prep the smashed potatoes: Put the potatoes in a large pot, cover with water and add 1/4 cup salt. Bring the water to a simmer over medium-high heat, reduce the heat to medium-low, and cook the potatoes until fork-tender, about 20 minutes for small potatoes or 30 minutes for medium ones; try not to let the water boil.", 
            "Cook the chops: Heat your oven to 200 degrees. Remove the chops from the buttermilk, discarding it and patting most of the buttermilk off the chops. Season the chops with salt and cracked pepper. Put the cornmeal in a shallow bowl and season it with salt and cayenne pepper. Dredge the chops in the cornmeal, gently shaking off the excess, and put on a large plate.", 
            "[Brock wants you to cook these in two large cast-iron skillets, using the oil in each only once, discarding it and putting new oil in for the next chop. I used one 12-inch skillet that fit two chops and reused the oil a couple times, but the downside of this is that it will pick up black bits that fall into the oil as it cooks.]", 
            "Heat a large cast-iron skillet over high heat. When the skillet is hot, add a  1/4-inch of oil to each and heat for 1 minute. Carefully place 2 pork chops in each skillet; do not shake the skillets or touch the chops for 1 minute. Reduce the heat to medium-high and cook the chops until golden brown, about 4 minutes. Carefully turn the chops over and cook until golden brown and crispy on both sides, about 3 to 4 minutes more. I found that my chops really wanted to stick on the second side, so slide a thin spatula underneath them to loosen them from the bottom of the pan before transferring the chops to a baking sheet to keep them warm in the oven. Discard the oil the skillet if it gets too murky and repeat with remaining chops.", 
            "Finish the potatoes: When the potatoes are almost cooked, bring the half-and-half to a simmer in a small saucepan over medium heat. Drain the potatoes and place them in a large bowl. Using a wooden spoon, carefully smash each potato without breaking it apart. Pour the hot half-and-half over the potatoes; crumble the goat cheese, butter and chives over them then fold it together — I only did this once or twice, preferring to keep as many small pockets of goat cheese throughout as possible. Season with salt, if needed, and white or black pepper. ", 
            "Serve: The potatoes and chops together. Repeat as soon as possible.", 
            "Serve with: Brock recommends that you serve these with a cucumber and pickled green tomato relish, which sounds like everything I want to eat right now, but I would have had to have had 3 1/2 pounds heirloom green tomatoes and gotten started on it two weeks ago (1 week for each pickling stage). I’ll be trying it out this summer. In a pinch, I wish I’d made these pickles instead. "
        ], 
        "date": "2015-03-05T11:38:05+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons salted or unsalted butter, melted", 
            "3 tablespoons extra-virgin olive oil", 
            "Coarse salt", 
            "1/2 to 1 teaspoon red-pepper flakes (optional)(I used aleppo, which is milder and can therefore be used more generously)", 
            "4 pounds russet potatoes, peeled (smaller diameter potatoes are great, if you can find them)", 
            "4 shallots, peeled", 
            "8 sprigs thyme", 
            "Garnishes (optional): Bits of goat cheese, crumbles of bacon and/or bits of crisped pancetta"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/crispy-potato-roast1.jpg?w=640", 
        "tags": [
            "Budget", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/04/crispy-potato-roast/", 
        "title": "crispy potato roast", 
        "directions": [
            "Preheat oven to 375°F. In a small bowl, combine butter and oil. With a sharp knife or manoline, slice potatoes crosswise very thinly. Figure out what baking dish you’d like to use [see Note above]; Martha suggests a 9-inch round baking dish (a deep dish pie pan would fit this bill) though I think you could go an inch bigger, an oval 1 1/2 to 2 quart casserole dish might also be pretty. ", 
            "Once you’ve picked the dish that seems the best fit for your slices, pour a tablespoon or so of the butter/oil mixture in the bottom and spread it evenly. Sprinkle the oil mixture with a few pinches of coarse salt and red pepper flakes, if using; this will allow you to season both the top and underside of the potatoes. Arrange your potato slices vertically in the dish. ", 
            "Thinly slice shallots with your mandoline and slide shallot slivers between potato wedges, distributing them as evenly as possible. Brush with remaining oil/butter mixture. Generously season your dish with salt; go easier on the red pepper flakes, if using. Bake 1 1/4 hours, then arrange thyme sprigs on top and bake until potatoes are cooked through with a crisped top, about 35 minutes more. If casserole seems to brown too fast, cover it with foil to slow it down. Add any garnishes, if using, and serve immediately. "
        ], 
        "date": "2011-04-23T10:38:26+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons salted or unsalted butter, melted", 
            "3 tablespoons olive oil", 
            "Coarse salt and black pepper or red pepper flakes to taste", 
            "5 pounds sweet potatoes, peeled and sliced thin", 
            "2 shallots, peeled and sliced thin"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/crispy-sweet-potato-roast1.jpg?w=640", 
        "tags": [
            "Fall", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/11/crispy-sweet-potato-roast/", 
        "title": "crispy sweet potato roast", 
        "directions": [
            "Heat oven to 375°F (190°C). Heat butter and oil together until butter has melted. Pour 2 tablespoons of the mixture in the bottom of a 2-quart baking dish. (Mine is 9.5-by-12-inches, if that helps.) Sprinkle butter/oil puddle with some salt and pepper. Arrange your potato slices vertically in the dish. Add a sliver of shallot between every few slices of potato, if desired. Brush tops of potatoes with remaining butter/oil and season generously with more salt and pepper. Cover dish with foil and bake for 45 to 50 minutes, until potatoes are tender and almost fully cooked. Increase oven heat to 450æF (230°C), remove foil and let roast another 10 to 20 minutes, until tops of potatoes are nicely browned. ", 
            "If you’d like to finish this with the Thanksgiving Salsa Verde I show here, or at least serve it on the side, place 1 scant cup of parsley leaves, 1 tablespoon fresh rosemary, 1 generous teaspoon of fresh thyme and sage leaves, 1 small garlic clove, the zest of 1/2 a lemon and 2 teaspoons capers (rinsed and drained if salted) in a food processor or blender and blend until finely chopped. Drizzle in 7 tablespoons olive oil with the machine running, or enough the mixture is loose and somewhat pourable. Season well with salt and pepper flakes. ", 
            "[For more finishing suggestions, see last paragraph of post above.]"
        ], 
        "date": "2014-11-20T11:57:04+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons extra virgin olive oil", 
            "1 medium onion, chopped", 
            "4 garlic cloves, minced", 
            "1 1-inch piece fresh ginger root, peeled and grated", 
            "1 1/2 teaspoons garam masala", 
            "1 1/2 teaspoons curry powder", 
            "1 jalapeño pepper, seeded if desired, then minced", 
            "4 to 5 cups vegetable broth as needed", 
            "2 pounds orange-fleshed sweet potatoes, peeled and cut into", 
            "1/2-inch cubes (about 4 cups)", 
            "1 1/2 cups dried lentils", 
            "1 bay leaf", 
            "1 pound Swiss chard, center ribs removed, leaves thinly sliced", 
            "1 teaspoon kosher salt, more to taste", 
            "1/2 teaspoon ground black pepper", 
            "1/3 cup chopped fresh cilantro", 
            "Finely grated zest of 1 lime", 
            "Juice of 1/2 lime", 
            "1/3 cup finely chopped tamari almonds, for garnish (optional), available in health food stores", 
            "1/4 cup chopped scallions, for garnish. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/curried-lentils-and-sweet-potatoes1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Indian", 
            "Photo", 
            "Potatoes", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/11/curried-lentils-and-sweet-potatoes/", 
        "title": "curried lentils and sweet potatoes", 
        "directions": [
            "1. In large saucepan, heat oil over medium heat. Add onion and saute until translucent, 5 to 7 minutes. Add garlic, ginger, garam masala, curry powder and jalapeno. Cook, stirring, for 1 minute. ", 
            "2. Stir in 4 cups broth, sweet potatoes, lentils and bay leaf. Increase heat to high and bring to a boil; reduce heat to medium, partially cover, and simmer for 25 minutes. (If lentils seem dry, add up to 1 cup stock, as needed.) Stir in chard and salt and pepper, and continue cooking until lentils are tender and chard is cooked, about 30 to 45 minutes total.", 
            "3. Just before serving, stir in cilantro, lime zest and juice. Spoon into a large, shallow serving dish. Garnish with almonds if desired and scallions. "
        ], 
        "date": "2007-11-25T23:47:07+00:00"
    }, 
    {
        "ingredient_list": [
            "6 tablespoons distilled white vinegar", 
            "4 teaspoons coarse kosher salt", 
            "2 1-pound English (also sold as hothouse or seedless) cucumbers, very thinly sliced", 
            "A few branches plus 3 tablespoons chopped fresh dill", 
            "3 1/4 pounds Yukon Gold potatoes (about 10 medium), unpeeled", 
            "Additional coarse kosher salt", 
            "1 cup very thinly sliced white onion", 
            "8 radishes, trimmed, thinly sliced", 
            "3/4 cup mayonnaise"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/06/dilled-potato-and-pickled-cucumber-salad.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Photo", 
            "Pickled", 
            "Potatoes", 
            "Radishes", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/06/dilled-potato-and-pickled-cucumber-salad/", 
        "title": "dilled potato and pickled cucumber salad", 
        "directions": [
            "The day before, make pickles: Pour vinegar and 4 teaspoon salt into gallon-size resealable plastic bag and swish around to combine. Add cucumbers and dill branches; turn several times to coat with mixture. Refrigerate overnight. If and when you pop into the fridge, turn the bag to keep things well mixed.", 
            "Cook your potatoes: Although you don’t have to, I also like to boil my potatoes the day before, because I like them very cold, and it seems easier to get it out of the way. Boil them in a large pot salted water until tender, about 30 minutes. Drain, then cool completely. I leave them in the fridge overnight.\nThe next day: Drain cucumber mixture in a colander; if you’ve got an hour, you can drain it that long, but I never do. Discard brine and dill.\nAssemble your salad: The original directions called for peeling your cold potatoes but I never do. Cut potatoes crosswise into 1/2-inch-thick slices. Place potatoes in large bowl; sprinkle generously with coarse salt and pepper. Add drained cucumbers, onion, sliced radishes, and remaining 3 tablespoons dill; toss to blend.\n1 to 2 hours before serving: Stir mayonnaise into salad to taste. Season with additional salt and pepper. Serve cold or at room temperature.\nDo ahead: Salad keeps dressed for a day. Salad keeps without mayo for a few days; I add mayo before serving. In both cases, keep it covered in the fridge."
        ], 
        "date": "2007-06-20T09:41:43+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 pounds (1 1/8 kg) Yukon Gold potatoes (about 6 medium)", 
            "6 cups (1.4 liters) peanut oil", 
            "Fine sea or table salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/easier-french-fries.jpg?w=750", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/03/easiest-french-fries/", 
        "title": "easiest french fries", 
        "directions": [
            "Cover your largest baking sheet with paper towels or paper bags for draining.\nScrub potatoes and dab them dry, then cut into 1/4-inch batons (see here for how I do it). Place in a 4 to 5-quart heavy, deep frying pan or Dutch oven and add oil; it will barely cover the potatoes. Turn burner to high and bring oil to a boil, which will take about 5 minutes. Cook potatoes for another 15 minutes; do not stir; they’ll just break. At this 20 minute mark, you can use tongs or a thin spatula to gently scrape loose any potatoes that have stuck to the pan. Continue to cook, stirring only if absolutely necessary, for 5 to 10 minutes longer, or until crisp and as golden as you like them.\nUse a large slotted spoon or spider to scoop potatoes from and spread them on prepared tray drain, tossing immediately with salt as you do.", 
            "You can keep fries warm in a 200 degree oven but the texture is really best right from the fryer."
        ], 
        "date": "2017-03-13T12:01:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound Purple Majesty or other purple potatoes, washed", 
            "4 small shallots, minced", 
            "2 tablespoons fresh-squeezed lemon juice", 
            "6 tablespoons good extra-virgin olive oil (we used half, and it was plenty for us)", 
            "Fleur de sel to taste", 
            "White pepper to taste", 
            "2 tablespoons parsley, chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/fork-crushed-purple-potatoes1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/04/fork-crushed-purple-potatoes/", 
        "title": "fork-crushed purple potatoes", 
        "directions": [
            "In a large pot, cook potatoes with skins on in heavily salted boiling water until tender, approximately 15 minutes. Remove potatoes from pot, and peel them while still warm. Place potatoes in a large bowl and, using a fork, gently smash them, maintaining a fairly chunky consistency. Fold in minced shallots, lemon juice, olive oil, fleur de sel, and white pepper. Finish with parsley. "
        ], 
        "date": "2008-04-09T15:45:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds baking potatoes, peeled and cut into chunks", 
            "4 to 5 tablespoons unsalted butter + a little extra to melt and drizzle over the dumplings (Deb note: I was able to make do with just 2 T butter in a non-stick)", 
            "3 onions, finely chopped", 
            "Salt and black pepper to taste", 
            "1 to 2 packages of gyoza (pot sticker) wrappers", 
            "3 to 5 green onions, thinly sliced or 1/4 cup chopped chives or 2 tablespoons chopped parsley or additional fried onions (see note), to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/from-insert-your-origin-here-with-love1.jpg?w=500", 
        "tags": [
            "Dumplings", 
            "Photo", 
            "Potatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/07/from-insert-your-origin-here-with-love/", 
        "title": "quick potato pierogi", 
        "directions": [
            "Sour cream, melted butter or vinegar to serve ", 
            "Cook the potatoes in a large pot of salted boiling water until just tender. Drain and set aside. ", 
            "Melt the butter in a large heavy frying pan and cook the onions until they soften then lightly brown, darkly browned in spots. ", 
            "Mash the potatoes in a bowl then mix in the onions and their cooking butter. Season generously with salt and pepper. ", 
            "Using a round cookie or biscuit cutter the width of the smaller side of the dumpling wrapper, cut 10 to 12 wrappers at a time into circles, discarding the extra. Working on at a time, brush the edge of the round wrapper with water and place a spoonful of filling in the center. Fold dumpling in half, pressing the edges together to thoroughly seal. ", 
            "Place each dumpling on a parchment or waxed paper lined baking sheet and repeat until all filling has been used. ", 
            "Chill in the refrigerator if you are making them ahead of time. If you wish to freeze the dumplings for later use, make sure they are not touching, then freeze them until solid and later gather them into a freezer bag. This ensures that you will avoid having one mega-pierogi clump when you are ready to cook them.", 
            "To cook the pierogi: Bring a large pot of salted water to a boil and add the dumplings one at a time, until the surface of the pan is covered with dumplings. Do not overcrowd; you’ll have to work in batches. When they are done, about 2-3 minutes, remove with a slotted spoon. ", 
            "Transfer to bowls and serve sprinkled with green onions, parsley or chives, drizzled with a little melted butter or vinegar or topped with a deb of sour cream. ", 
            "Alternatively, you can pan-brown the pierogi. Heat some oil in a heavy frying pan and add dumplings in a single layer. When they are golden and in spots, browned, turn and brown other side. Add enough water to reach about 1/4-1/2 inch in depth. Cover and cook 3-4 minutes; remove lid and check for doneness. When pierogi are tender but not mushy to the tooth, and the liquid is evaporated, they are ready. ", 
            "Note: To make fried onions, saute 2 to 3 thinly sliced onions, in butter in a heavy frying pan until they are limp and lightly browned; add several tablespoons water and cook until the onions are soft and silky, the liquid mostly evaporated. Season with salt and pepper. "
        ], 
        "date": "2007-07-08T13:54:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1 bunch green onions, thinly sliced", 
            "1 cup grated Parmesan cheese", 
            "2 tablespoons all-purpose flour", 
            "1 tablespoon chopped fresh thyme leaves", 
            "1 1/2 teaspoons salt", 
            "3/4 teaspoon ground black pepper", 
            "2 pounds Yukon Gold potatoes, peeled, cut into 1/8-inch-thick rounds", 
            "12 ounces yellow crookneck squash or regular yellow or green summer squash, cut into 1/8-inch-thick rounds", 
            "6 teaspoons olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/herbed-summer-squash-and-potato-torte.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Potatoes", 
            "Summer", 
            "Summer Squash", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/07/herbed-summer-squash-and-potato-torte/", 
        "title": "herbed summer squash and potato torte", 
        "directions": [
            "Preheat oven to 375°F. Butter two 8-inch-diameter cake pans. (Deb note: I had only a 9-inch pan around, so what you see in my pictures is slightly thinner.) Set aside 1/4 cup sliced green onions. Toss remaining green onions, cheese, flour, thyme, salt and pepper in medium bowl to blend.", 
            "Layer 1/6 of potatoes in concentric circles in bottom of 1 prepared pan, overlapping slightly. Layer 1/4 of squash in concentric circles atop potatoes. Drizzle with 1 teaspoon oil. Sprinkle with 1/6 of cheese mixture. Repeat with 1/6 of potatoes, then 1/4 of squash and 1 teaspoon oil. Sprinkle with 1/6 of cheese mixture. Top with 1/6 of potatoes. Drizzle with 1 teaspoon oil. Sprinkle with 1/6 of cheese mixture and press gently to flatten. Repeat procedure with second cake pan and remaining potatoes, squash, oil, and cheese mixture.", 
            "Cover pans with foil. Bake until potatoes are almost tender, about 40 minutes. Remove foil; bake uncovered until tortes begin to brown and potatoes are tender, about 25 minutes longer. (Can be made 6 hours ahead. Cool. Cover with foil and chill. Rewarm, covered with foil, in 350°F oven until heated through, about 30 minutes.)", 
            "Cut each torte into wedges. Sprinkle wedges with 1/4 cup green onions; serve."
        ], 
        "date": "2008-07-23T11:44:03+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds Yukon Gold potatoes, scrubbed and cut into 1/2-inch to 3/4-inch cubes", 
            "4 tablespoons salted butter", 
            "1 onions, finely chopped", 
            "Salt and pepper to taste", 
            "Seasoning of your choice: Garlic powder or salt work great, as does smoky Spanish paprika or chopped chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/home-fries1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It"
        ], 
        "url": "https://smittenkitchen.com/2008/11/home-fries/", 
        "title": "home fries", 
        "directions": [
            "1. Arrange potatoes in large microwave-safe bowl, top with 1 tablespoon butter, and cover tightly with plastic wrap. Microwave on high until edges of potatoes begin to soften, 5 to 7 minutes, shaking bowl (without removing plastic) to redistribute potatoes halfway through cooking.", 
            "2. Meanwhile, melt 1 tablespoon butter in large regular or nonstick skillet over medium heat. Add onion and cook until softened and golden brown, about 6 minutes. Transfer to small bowl.", 
            "3. Melt remaining 2 tablespoons butter in now-empty skillet over medium heat. Add potatoes and pack down with spatula. Cook, without moving, until underside of potatoes is brown, 5 to 7 minutes. Turn potatoes, pack down again, and continue to cook until well browned and crisp, 5 to 7 minutes. Reduce heat to medium-low and continue cooking, stirring potatoes every few minutes, until crusty and golden on all sides, 9 to 12 minutes. Stir in onion, seasonings of your choice and salt and pepper to taste."
        ], 
        "date": "2008-11-08T20:40:44+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds small (2-inch) potatoes, your choice of variety (I found a rainbow-colored pack, and couldn’t resist, clearly)", 
            "1/4 cup red onion, chopped", 
            "1 tablespoon white-wine vinegar", 
            "1 cup sour cream (or 1/2 cup sour cream, 1/2 cup yogurt)", 
            "2 tablespoons fresh dill, finely chopped", 
            "1/4 cup chopped fresh chives (frustratingly, couldn’t find these)", 
            "1 tablespoon Dijon mustard", 
            "3 tablespoons prepared horseradish", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/horseradish-potato-salad1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/06/horseradish-potato-salad/", 
        "title": "horseradish potato salad", 
        "directions": [
            "Boil the potatoes until fork tender, cool them to room temperature and quarter them. In a large bowl, mix the remaining ingredients and fold over the potatoes. Adjust seasoning to taste — you might add another tablespoon of vinegar if you feel it needs more ‘zing’ — and prepare to wow the Eastern Europeans in your life!"
        ], 
        "date": "2009-06-21T11:57:10+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive or peanut oil", 
            "1/2 teaspoon whole cumin seeds", 
            "1/4 teaspoon whole fennel seeds", 
            "1 medium onion, peeled and chopped", 
            "1 medium potato (about 6 ounces), peeled and chopped", 
            "2 teaspoons peeled and chopped fresh ginger", 
            "2 cloves garlic, peeled and chopped", 
            "1 fresh hot green chili, chopped (more or less to taste)", 
            "2 teaspoons ground coriander", 
            "1 teaspoon ground cumin", 
            "1/4 teaspoon ground turmeric", 
            "1/4 teaspoon red chili powder or cayenne (to taste)", 
            "About 3 1/2 cups cauliflower florets (from about 1/2 a large 2.75-pound head)", 
            "2 medium tomatoes, peeled and chopped or 1 1/2 cups canned chopped tomatoes", 
            "1 1/2 teaspoons salt, or to taste (we wanted more)", 
            "A couple spoonfuls heavy cream or dollops of yogurt", 
            "1/2 cup cooked basmati or other long-grain white rice", 
            "Handful of fresh cilantro, chopped", 
            "Freshly ground black pepper", 
            "Lime wedges", 
            "Toasted pita or naan wedges"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/indian-spiced-cauliflower-soup.jpg?w=750", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Freezer Friendly", 
            "Indian", 
            "Photo", 
            "Potatoes", 
            "Soup", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/09/indian-spiced-cauliflower-soup/", 
        "title": "indian-spiced cauliflower soup", 
        "directions": [
            "Heat oil in the bottom of a 4 to 5-quart pot over medium-high heat. Once hot, add the cumin seeds and a few seconds later, the fennel seeds. Pause 2 seconds and then add the onions and potatoes. Stir and sauté for 5 minutes. Add the ginger, garlic and green chiles and stir for 1 minute more.\nTurn the heat to medium low and add the ground coriander, cumin, turmeric and red pepper. Stir for 1 minute. Add the cauliflower, tomatoes and salt and stir for 1 minute. Add 4 cups water, stir, and bring to a boil over medium-high heat. Cover, lower the heat again, and simmer gently for 25 minutes.\nLet the soup cool slightly, then blend it to your desired texture. Taste for seasoning and adjust as needed. Ladle into bowls and add a dollop of yogurt or tiny swirl (about 1/2 teaspoon) heavy cream, if desired. Squeeze lime juice over, add a few grinds of black pepper and place 2 tablespoons cooked rice to the center of each bowl. Scatter with cilantro and serve with pita wedges on the side, if desired. Dig in.\n"
        ], 
        "date": "2016-09-27T12:07:56+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups all-purpose flour", 
            "1 1/2 teaspoons salt", 
            "3/4 teaspoon sugar", 
            "1 cup cold water", 
            "Olive oil, for bowl and pans", 
            "1 teaspoon instant dry yeast", 
            "2 potatoes, thinly sliced (about 2 cups) [I used Yukon Golds, and I believe this is what Lahey uses as well]", 
            "1/2 onion, diced into 1/4- to 1/2-inch pieces", 
            "4 tablespoons extra-virgin olive oil", 
            "Fresh rosemary (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/jim-laheys-potato-pizza1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Pizza", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/06/jim-laheys-potato-pizza/", 
        "title": "jim lahey’s potato pizza", 
        "directions": [
            "1. Combine flour, 1/2 teaspoon salt, sugar, and yeast in the bowl of an electric mixer, and slowly add 1 cup cold water. Mix on low speed until ingredients begin to combine. Switch to a dough hook and continue to mix for about 10 minutes until the dough is smooth and elastic and cleanly pulls away from the sides of the mixing bowl.", 
            "2. Place dough in an oiled bowl, and allow to rest for 2 to 4 hours until it has doubled in size. Split the dough into halves, and form each into a log. Place each log on a generously floured surface, and allow it to rest until the formed dough doubles in size again, at least 1 hour.", 
            "3. While the dough rises for the second time, repare the potato topping. Slice potatoes very thin using a knife or a mandoline. Then soak them in several changes of ice water to remove excess starch and prevent discoloration. Drain slices in a colander, toss with 1/2 teaspoon salt, and set aside for 10 minutes. Drain any accumulated water. In a medium bowl, combine potatoes, onions, and 1 tablespoon olive oil, and set aside.", 
            "4. Preheat oven to 450 degrees. Prepare two rimmed baking sheets with vegetable oil. Divide dough in half. Place each piece on its own baking sheet. Using the palms of your hands, flatten dough out to the edges of the pan. Evenly spread potatoes over the surface of the dough up to the very edge, or about 1 inch from the edge if you desire a crust on your pizza. Season with remaining 1/2 teaspoon salt and remaining 3 tablespoons olive oil. Sprinkle with rosemary if using.", 
            "5. Bake potato pizza until it has shrunk away from the edges of a pan and the bottom is golden brown, about 20 minutes. Remove from oven, and allow to cool slightly; slice into pieces, and serve. Potato pizza is also delicious served at room temperature."
        ], 
        "date": "2008-06-04T22:21:42+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/latke-redux1.jpg?w=500", 
        "tags": [
            "Hanukah", 
            "Jewish", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2007/12/latke-redux/", 
        "title": "latke redux", 
        "directions": [], 
        "date": "2007-12-04T17:43:13+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large or 4 medium (2 pounds or just under 1 kg) Russet or baking potato, peeled", 
            "1 medium onion (about 6 to 8 ounces), peeled", 
            "2 teaspoons baking powder", 
            "1 1/2 teaspoons (about 9 grams) table or fine sea salt", 
            "Freshly ground black pepper", 
            "1/2 cup plus 2 tablespoons (80 grams) all-purpose flour", 
            "4 large eggs", 
            "Nonstick spray, for waffle iron", 
            "2 tablespoons fresh chives, finely chopped, for garnish (totally optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/latke-waffles1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2014/09/latke-waffles/", 
        "title": "latke waffles", 
        "directions": [
            "Heat oven to 350. Lightly oil a large baking sheet and set aside. ", 
            "In a food processor or on a box grater, coarsely shred the potato and onion. For longer strands, lay the potato sideways in the chute of your food processor. Transfer grated mixture to a bowl lined with a fuzz-free dishcloth (linen is great here) or cheesecloth. Pull up the sides of the cloth, forming a bag of grated ingredients, and twist it until you’ve squeezed out all of the excess liquid. Let stand for 1 to 2 minutes, then squeeze out one more time. ", 
            "Discard the liquid in the bowl, then add wrung-out shredded potato and onion to it. Sprinkle baking powder, salt and several grinds of black pepper over mixture and stir with a fork until it distributes throughout the shreds. Add flour, and again, stir into the potato-onion mixture until the pieces are evenly coated. Crack eggs on top; use your fork to break up the yolks and stir them so that they’re evenly distributed through the batter. ", 
            "Heat your waffle iron to high heat. Once hot, coat lightly with a nonstick spray. Heap some latke mixture on top and spread it into an even layer. Cook until the latkes are a nice, deep golden brown underneath. (I found that the bottom colors better than the top, but you’ll even this out in the oven.) ", 
            "Transfer to oiled baking sheet, paler side down, and place in warmed oven. Continue with remaining latke batter. Keep latke waffles in oven until crisp (about 5 to 10 minutes), or until all the other parts of your meal are ready. ", 
            "Serve with applesauce or sour cream, latke-style, or breakfast-style, with eggs and bacon. Sour cream is pretty good with the eggs, too. Chives make it pretty.  "
        ], 
        "date": "2014-09-29T11:51:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds unpeeled small Yukon gold (Ina’s suggestion) or fingerling (what I used) potatoes", 
            "Coarse, kosher or sea salt", 
            "3 tablespoons Champagne or white wine vinegar", 
            "1/2 teaspoon Dijon mustard", 
            "1/2 teaspoon minced or pressed garlic", 
            "1 large or extra-large egg yolk, ideally at room temperature", 
            "Freshly ground black pepper", 
            "1/2 cup olive oil", 
            "1/4 cup dry white wine (you can skip this, or use less, with little harm; I used 1 tablespoon vermouth instead)", 
            "3 tablespoons drained capers (I imagine minced cornichons would be a good alternative)", 
            "6 scallions, thinly sliced (yielding about 1 cup)", 
            "2 medium stalks celery, diced small (about 1/4 inch) (yielding about 1/2 cup)", 
            "1/2 cup finely diced red onion", 
            "1 1/2 pounds cooked lobster meat, cooked and cooled, in a 1-inch dice (from about 7 to 8 pounds fresh lobster; see post above for better budgeted suggestions)", 
            "1 lemon", 
            "3 tablespoons coarsely chopped fresh tarragon (Ina’s suggestion) or flat-leaf parsley (what we used)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/lobster-and-potato-salad.jpg?w=750", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad", 
            "Seafood", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/05/lobster-and-potato-salad/", 
        "title": "lobster and potato salad", 
        "directions": [
            "Cook the potatoes: Place the potatoes in a large pot and cover with an inch or two over water. Add 1 tablespoon salt and bring to a boil. Lower the heat and simmer for 15 to 25 minutes, depending on the size of the potatoes, until just tender. (A bamboo skewer is ideal to test them.) Drain in a colander, and let potatoes cool for 5 minutes. Cut potatoes into quarters or halves (or fingerlings into 1/2- to 1-inch segments) and place them in a large bowl.", 
            "Make the vinaigrette: Whisk together the vinegar, mustard, garlic, egg yolk, 1 teaspoon salt, and many grinds of black pepper (Ina recommends you use a full teaspoon of pepper). Whisking constantly and vigorously, pour the oil in in a thin drizzle, ideally making an emulsion. Stir in the wine (if using) and capers. ", 
            "Assemble the salad: While the potatoes are still very warm, pour half the vinaigrette on the potatoes and toss them gently, allowing them to soak up the vinaigrette. Stir in the scallions, celery, red onion, lobster, and add enough vinaigrette to moisten. Reserve any remaining vinaigrette for later. Add the zest and juice of the lemon, the tarragon or parsley, and more salt and pepper to taste (Ina calls for another 2 teaspoons salt and 1 teaspoon pepper, but this felt like overkill). Cover with plastic wrap and refrigerate for at least an hour to allow flavors to blend. Taste for seasonings and add more vinaigrette, if necessary. ", 
            "Serve: This salad is especially good served closer to room temperature. Don’t forget to share."
        ], 
        "date": "2013-05-29T10:56:52+00:00"
    }, 
    {
        "ingredient_list": [
            "For the bowl", 
            "1 cup dried rice or another cooking grain of your choice", 
            "1 to 2 sweet potatoes (about 1.5 pounds)", 
            "1 large bundle broccoli (about 1 pound)", 
            "1 to 2 tablespoons olive oil", 
            "Coarse or kosher salt", 
            "Freshly ground black pepper", 
            "1 teaspoon white sesame seeds", 
            "1 teaspoon black sesame seeds", 
            "For the miso-sesame dressing", 
            "1 tablespoon minced fresh ginger", 
            "1 small garlic clove, minced", 
            "2 tablespoons white miso (the mildest kind)", 
            "2 tablespoons tahini (other nut butters can work in a pinch)", 
            "1 tablespoon honey", 
            "1/4 cup rice vinegar", 
            "2 tablespoons toasted sesame oil", 
            "2 tablespoons olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/10/10129849956_5b4c826237_o.jpg?w=750", 
        "tags": [
            "Broccoli", 
            "Budget", 
            "Fall", 
            "Grain/Rice", 
            "Lunch", 
            "Photo", 
            "Potatoes", 
            "Vegan", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/10/miso-sweet-potato-and-broccoli-bowl/", 
        "title": "miso sweet potato and broccoli bowl", 
        "directions": [
            "Heat oven to 400 degrees. Place rice or grain and cooking liquid in a rice cooker or on the stove. Cook according to package directions.", 
            "Peel sweet potatoes and cut into 1-inch cubes. Cut tops off broccoli and separate into bite-sized florets. If your broccoli stems feel especially woody, I like to peel them (with the same vegetable peeler), then cut them into 1/2- to 1-inch segments. ", 
            "Coat one large or two smaller trays with a thin slick of olive oil. Layer sweet potatoes on tray(s) and sprinkle with salt and pepper. Roast for 20 minutes, until browning underneath. Flip and toss chunks around, then add broccoli to the tray(s), season again with salt and pepper, and roast for another 10 to 20 minutes, until broccoli is lightly charred at edges and sweet potato is fully bronzed and tender. Toss chunks around one more time if it looks like they’re cooking unevenly.", 
            "In a small skillet, toast black and white sesame seeds until fragrant. (You can do this in the oven if using an oven-proof skillet.) Let cool.", 
            "While vegetables roast, prepare sesame-miso dressing: Combine everything in a blender and run until smooth, scraping down sides once. Taste and adjust ingredients if needed, but try to resist adding more honey if it tastes salty, as that extra pop of saltiness is exactly what I think sweet potato needs.", 
            "Assemble bowls: Scoop some rice/grains into each, then pile on the roasted sweet potatoes and broccoli. Coat lightly with sesame-miso dressing and finish with toasted sesame seed duo. Serve with extra dressing on the side."
        ], 
        "date": "2013-10-07T12:03:49+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/11/mustard-roasted-potatoes.jpg?w=753", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2008/11/mustard-roasted-potatoes/", 
        "title": "mustard-roasted potatoes", 
        "directions": [
            "Position 1 rack in top third of oven and 1 rack in bottom third of oven and preheat to 425°F. Spray 2 large rimmed baking sheets with nonstick spray. Whisk mustard, olive oil, butter, lemon juice, garlic, oregano, lemon peel, and salt in large bowl to blend. Add potatoes; sprinkle generously with freshly ground black pepper and toss to coat. Divide potatoes between prepared baking sheets, leaving any excess mustard mixture behind in bowl. Spread potatoes in single layer. Roast potatoes 20 minutes. Reverse baking sheets and roast until potatoes are crusty outside and tender inside, turning occasionally, about 25 minutes longer. ", 
            "Transfer potatoes to serving bowl.", 
            "Do ahead: Can be made 2 hours ahead. Let stand on baking sheets at room temperature. Rewarm potatoes in 425°F oven 10 minutes."
        ], 
        "date": "2008-11-20T23:22:33+00:00"
    }, 
    {
        "ingredient_list": [
            "4 medium Yukon Gold or 3 smallish Russet potatoes (I find these to be equivalent in size, although the specific size isn’t terribly important)", 
            "3 to 4 tablespoons olive oil", 
            "Fine sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/oven-fries1.jpg?w=750", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/10/oven-fries/", 
        "title": "oven fries", 
        "directions": [
            "Heat oven to 450 degrees F.", 
            "Peel your potatoes if you wish; scrub them well if you do not. Cut potatoes into just-shy-of 1/2-inch batons. Place in a large pot and cover with an inch or two of water. Set heat to high and set timer for 10 minutes. If potatoes come to a boil in this time (mine usually do not), reduce the heat to medium. Otherwise, when timer rings, whether or not the potatoes have boiled, test one. You’re looking for a very “al dente” potato — one that is too firm to eat enjoyable, but has no crunch left. A good sign that they’re not too cooked is when you roughly tumble them into a colander, only one or two break.", 
            "Meanwhile, coat a large baking sheet with 2 to 3 tablespoons of olive oil and place it in the oven for a few minutes, so the oil gets very hot and rolls easily around the pan.", 
            "Drain your potatoes and immediately spread them on oiled baking sheet in one layer. Drizzle with last tablespoon of olive oil, sprinkle with salt and roast for 20 minutes, until golden underneath. Toss potatoes around to encourage them to color evenly and return them to the oven for another 5 minutes. Repeat this 1 or 2 more times (for me, 30 minutes total roasting time is the sweet spot), until your “fries” are deeply golden, brown at the edges and impossible not to eat.", 
            "Season with more salt while they’re hot, pile them on a platter and dig in."
        ], 
        "date": "2015-10-28T12:00:48+00:00"
    }, 
    {
        "ingredient_list": [
            "3 ounces (6 tablespoons) unsalted butter", 
            "8 small-medium baking potatoes (about 4 pounds), scrubbed", 
            "16 fresh flat-leaf parsley leaves", 
            "Coarse salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/parsley-leaf-potatoes1.jpg?w=640", 
        "tags": [
            "Budget", 
            "Herbs", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/parsley-leaf-potatoes/", 
        "title": "parsley leaf potatoes", 
        "directions": [
            "Heat oven to 450 degrees F. Place roasting pan in oven with butter; once butter has melted, just a minute or two later, remove pan from oven. Halve each potato lengthwise. Place one parsley leaf in the center of each cut half, then sprinkle cut sides generously with salt. Arrange face-down in pan with melted butter; try not to nudge them around or the leaves will move (as mine did) off-center. Roast potatoes for 35 to 45 minutes (depending on size) until tender. There’s no need to turn the potatoes over unless they get so dark underneath (this can happen with a thinner roasting pan or oven than runs hotter) that they risk overcooking before becoming fully tender; if so, just flip the potatoes for the remaining roasting time.", 
            "Serve immediately; cut sides up."
        ], 
        "date": "2013-11-22T14:14:13+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1/2 pound (about 1 large) Russet potato", 
            "1 tablespoon fresh lemon juice", 
            "1 pound parsnips (about 2 large or 4 medium)", 
            "1/4 cup all-purpose flour", 
            "1 teaspoon baking powder", 
            "2 large eggs, lightly beaten", 
            "2 tablespoons chopped fresh dill", 
            "1 teaspoon table salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "Olive oil (or a mix of olive and vegetable or peanut oil) for frying", 
            "Sauce", 
            "1 cup sour cream", 
            "1 tablespoon lemon juice", 
            "1/2 teaspoon table salt", 
            "1 tablespoon freshly grated or prepared horseradish", 
            "1 tablespoon chopped dill"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/parsnip-latkes-with-horseradish-and-dill.jpg?w=749", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Parsnips", 
            "Photo", 
            "Potatoes", 
            "Snack", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/12/parsnip-latkes-with-horseradish-and-dill/", 
        "title": "parsnip latkes with horseradish and dill", 
        "directions": [
            "Preheat: Oven to 250 degrees. Line one large or two smaller baking sheets with foil and leave them in the oven until needed.", 
            "Prepare vegetables: Peel vegetables and grate them on the large holes of a box grater or (my preferred method) using the shredding blade of a food processor. If using the food processor, I like to lay the vegetables sideways in the chute, in an attempt to get the longest strands of vegetables. This creates latkes that look like little piles of mops, which is my goal.", 
            "Transfer shredded vegetables to a lint-free dishtowel or square of cheesecloth, and wring out as much liquid as possible. Let stand for two minutes, then wring again. Wetness is the enemy of crisp, light latkes, so we want to get rid of as much as possible.", 
            "Make batter: Transfer wrung-out vegetables to a large bowl. Add lemon juice. In a tiny dish, stir together the flour, baking powder, salt, pepper and any herbs or additional seasonings and toss with vegetables, evenly coating the strands. In the same tiny dish, whisk your egg(s) and then stir this into the vegetable-flour mixture, evenly coating the strands.", 
            "Prepare pan: Heat a large, heavy skillet, preferably cast iron, over medium heat. Once skillet is hot, add 3 tablespoons oil and heat oil until shimmering. If you’re unsure, you can flick a droplet of water onto the oil; if it hisses and sputters, you’re good to go.", 
            "Cook: Using a fork or your fingertips (letting the eggy batter drain off a little is good), gather spoonful-sized mounds of battered vegetables and drop them onto the heated skillet. When golden underneath, 3 to 4 minutes later, flip pancakes. [If you’re using a gas range, you’ll likely have to rotate your pancakes 180 degrees halfway through the cooking time so that they color evenly underneath.] Cook on the other side until nicely bronzed underneath, another 2 to 3 minutes, and transfer to paper towels briefly to drain pancakes, before transferring them again to tray(s) in warm oven. If latkes cook too quickly or slowly on the stove, adjust the heat accordingly.", 
            "Add more oil if needed (you want to keep the pan at that 3 tablespoon level), being sure it is heated before adding more pancakes to the skillet. Repeat with remaining batter.  I like to keep the latkes in the oven for at least 10 minutes to ensure they’ve cooked through before serving them. This gives you time to…", 
            "Make sauce: Mix sauce ingredients in a small dish. Adjust seasonings to taste.", 
            "Serve: Warm with a dollop of the sauce."
        ], 
        "date": "2011-12-22T13:13:41+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/penne-with-potatoes-and-rocket1.jpg?w=500", 
        "tags": [
            "Arugula", 
            "Pasta", 
            "Photo", 
            "Potatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/03/penne-with-potatoes-and-rocket/", 
        "title": "penne with potatoes and rocket", 
        "directions": [
            "Meanwhile, wash the rocket* (older, larger leaves are preferable to the tender sprouts), drain, and set aside. Slice the red onion thin. Peel and chop fine the garlic cloves and the rosemary leaves. Put a large pot of salter water on to boil for the pasta.", 
            "When the potatoes are done, remove them from teh oven and put the pasta on to boil. Heat a saute pan, add some of olive oil, and saute the sliced onion until it is soft and translucent and starting to brown, about 5 minutes. Add the rocket and garlic, and saute both until they just begin to wilt and soften. Lower the heat, add the potato slices and rosemary and toss together for a minutre or two. When the noodles are done, drain them and add them to the potatoes and onion. Add a squeeze of lemon juice and toss everything together. Drizzle with a little olive oil and serve.", 
            "* I’m kind of a nut about arugula-washing techniques, so here is my tried-and-true method: Get a very big bowl. Fill it with cold, cold water. Cut the attached part of the arugula bundle off (so they’re in individual sprigs) and drop the bundle in the water. Have a colander nearby. Swish, swish, swish the arugula around with your hand and then scoop it up and dump it in the colander, being careful not to pick up the sandy dirt you’ve just dropped to the bottom of the water. (That’s the genius, by the way, the dirt always drops off.) If the water is still foggy/beige, rinse the bowl out and repeat this process until it is clear, and the sand at the bottom is at a minimum. Shake out the lettuce in the colander and either spin it in a salad spinner or spread it out on a big dish towel until it is dry. I actually wash all lettuces this way, but arugula, being particularly dirt-crusted, is particularly made for this technique."
        ], 
        "date": "2009-03-16T15:57:07+00:00"
    }, 
    {
        "ingredient_list": [
            "4 pounds small Yukon gold or red-skinned potatoes, quartered", 
            "1 pound green beans, cut into one-inch segments", 
            "1 to 2 small garlic cloves, peeled", 
            "2 bunches of basil (about one ounce each)", 
            "1/4 to 1/2 cup olive oil", 
            "6 tablespoons (or more to taste) mild vinegar, such as champagne, white wine or a white balsamic", 
            "1/4 cup chopped green onions (scallions)", 
            "1/2 cup pine nuts, toasted", 
            "Parmesan cheese to taste", 
            "Salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/pesto-potato-salad-with-green-beans.jpg?w=753", 
        "tags": [
            "Green Beans", 
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/06/pesto-potato-salad-with-green-beans/", 
        "title": "pesto potato salad with green beans", 
        "directions": [
            "Cook potatoes in large pot of boiling salted water until just tender, about 10 minutes. Add beans; cook four minutes longer. Drain well and let cool, then transfer potatoes and beans to a large bowl.", 
            "Meanwhile, discard the stems from the basil and wash and dry the leaves. Puree them in a food processor with garlic, drizzling in enough olive oil that it gets saucy. Season the pesto with salt and pepper. [Alternately, you can swap this step with one cup of prepared pesto, but seriously, I think you’ll be missing out.]", 
            "Toss the beans and potatoes with pesto. Stir in vinegar, green onions, pine nuts and season with salt, pepper and/or additional vinegar to taste. Finally, shave some wide flecks of parmesan over the salad with a vegetable peeler.", 
            "Serve immediately, or make this up to two hours in advance. It can be stored at room temperature."
        ], 
        "date": "2009-06-01T13:58:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups (7 oz.) biga (this recipe makes a 16 ounce biga; I halved it and deemed it close enough)", 
            "3 cups plus 2 tablespoons (14 oz.) unbleached high-gluten or bread flour", 
            "1 1/2 teaspoons (.38 oz) salt", 
            "1/4 teaspoon (.03 oz) black pepper, coarsely ground (optional)", 
            "1 1/4 teaspoons (.14 oz) instant yeast", 
            "1 cup (6 oz.) mashed potatoes", 
            "1 tablespoon (.5 oz.) olive oil", 
            "2 tablespoons (.25 oz.) coarsely chopped fresh rosemary", 
            "3/4 cup plus 2 tablespoons to 1 cup (7 to 8 oz.) water, at room temperature (or warm if the potatoes are cold)", 
            "4 tablespoons (1 oz.) coarsely chopped roasted garlic (optional)", 
            "Semolina flour or cornmeal for dusting", 
            "Olive oil for brushing on top"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pettiness-and-panmarino1.jpg?w=500", 
        "tags": [
            "Bread", 
            "Italian", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2007/04/pettiness-and-panmarino/", 
        "title": "potato rosemary bread", 
        "directions": [
            "Reinhart’s commentary: You can attractively garnish this bread by embossing a sprig of fresh rosemary in the top of the loaf.  Mist the dough just after the final shaping with water and lay the spring flat so that it adheres fully.  Don’t leave any of the needles hanging in the air, as they will burn during the baking stage without the protection of the dough."
        ], 
        "date": "2007-04-10T12:51:29+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds (680 grams) baby potatoes (I used a mix of red and yellow)", 
            "2 heaped cups (8 ounces or 225 grams) coarsely grated sharp cheddar cheese, ideally a mix of yellow and white", 
            "1/2 cup (2.75 ounces) finely chopped drained pimentos or roasted red peppers (from 1 4-ounce jar of pimentos)", 
            "1/4 cup (50 grams) mayonnaise", 
            "1 to 2 scallions, finely minced", 
            "1/4 teaspoon celery salt", 
            "Cayenne or hot sauce, to taste", 
            "Salt and freshly ground pepper", 
            "Smoked hot or sweet paprika, more cayenne, chipotle powder and/or minced chives to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/12/pimento-cheese-potato-bites.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/12/pimento-cheese-potato-bites/", 
        "title": "pimento cheese potato bites", 
        "directions": [
            "Put potatoes in a large pot, cover them with two inches of water, set them over high heat and set your time — as soon as you turn on the flame — for 25 minutes and bring to a boil. When the timer rings, the potatoes are either done or need up to 5 minutes more. If a skewer goes in them easily, they’re done. Drain and let cool until you can pick them up. Or, you can chill them for up to 2 days, until needed.\nMeanwhile, make the pimento cheese by mixing the cheddar(s), pimentos, mayo, scallions, celery salt and cayenne or hot sauce together until evenly combined. Season to taste with salt and freshly ground black pepper. Either use this right away or keep it chilled for a week, until needed.\nCover a large baking sheet with foil and lightly coat foil with nonstick spray. Heat oven to 425 degrees.\nWhen potatoes are cool enough to handle, halve lengthwise and scoop out all but the last 1/4-inch thickness of skin and potato (essentially, you want to leave a shell inside for stability). A melon baller makes easy work of this. Arrange potatoes on prepared baking sheet. Season cavities with salt and pepper. Mash the potato centers in a bowl until smooth and mix with half (3/4 cup plus 1 tablespoon) of prepared pimento cheese. Season with more salt and pepper to taste. Use a small spoon, butter knife or small offset spatula to press/pack filling back into emptied potatoes, smoothing the tops. Nestle them in the pan tightly to discourage them from toppling and spilling their contents.\nBake 15 to 20 minutes, until melty and sizzling, then run under broiler until lightly browned on top. Let cool 5 to 10 minutes before serving, garnishing with paprika and/or chives when you do.\n"
        ], 
        "date": "2016-12-29T12:57:09+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/potato-and-artichoke-tortilla1.jpg?w=500", 
        "tags": [
            "Budget", 
            "Eggs", 
            "Photo", 
            "Potatoes", 
            "Spanish"
        ], 
        "url": "https://smittenkitchen.com/2009/01/potato-and-artichoke-tortilla/", 
        "title": "potato and artichoke tortilla", 
        "directions": [
            "1. Heat 2 tablespoons of the olive oil in a medium-sized skillet over medium heat. Add the onion and cook until limp but not brown, 3 to 5 minutes. Add the potato and cook, stirring gently, for 5 minutes. Stir in the artichokes and peppers and cook, stirring, for another 2 to 3 minutes. Using a slotted spoon, transfer the vegetable mixture to a bowl and let cool completely.", 
            "2. Place the eggs, chicken stock, and a few small pinches of salt in a medium-sized bowl and beat until just scrambled. Add the potato mixture and mix until well combined. Let stand for about 10 minutes.", 
            "3. Heat 5 teaspoons of the reserved olive oil in a heavy 8-inch skillet, preferably nonstick, over medium-high heat until it is just beginning to smoke. Pour the egg mixture into the skillet and flatten the potatoes with a spatula until the top is fairly even. Reduce the heat to medium-low. Cook, moving and shaking the skillet, running a thin spatula around the edge and sliding it into the middle so that some of the egg runs under for about one minute, then let it cook undisturbed until the top is a little wet but not liquid, 6 to 8 minutes. ", 
            "4. Run the thin spatula under the tortilla to make sure that no part of the bottom is stuck to the skillet. Top the skillet with a rimless plate slightly larger than the skillet and, using oven mitts, quickly invert the tortilla onto the plate. If the skillet looks dry, add a little more olive oil. Carefully slide the tortilla back into the skillet, uncooked side down. Shake the skillet to straighten the tortilla and push the edges in with the spatula. Reduce the heat to very low and cook the tortilla until a toothpick inserted in the center comes out dry, 3 to 4 minutes. Invert the tortilla again, as before, to cook on the first side for another minute.", 
            "5. Invert the tortilla onto a serving plate and pat the top with a paper towel to get rid of excess oil. Let it cool a little, then cut the tortilla into wedges and serve warm or at room temperature. To serve as a tapa, cut the tortilla into squares and serve with toothpicks."
        ], 
        "date": "2009-01-03T13:24:14+00:00"
    }, 
    {
        "ingredient_list": [
            "8 to 10 small waxy potatoes (about 1 ounce each), scrubbed and quartered", 
            "1 cup vegetable or another broth; just use salted water if you don’t have it around", 
            "1/4 cup olive oil", 
            "8 ounces (usually 1 bundle) broccolini, trimmed and halved lengthwise or chopped into 1-inch pieces", 
            "1 small red or white onion, thinly sliced", 
            "8 large eggs", 
            "1 cup (about 3 to 3 1/2 ouncesgrated Parmesan cheese", 
            "Salt and freshly ground black pepper, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/potato-and-broccolini-frittata1.jpg?w=640", 
        "tags": [
            "Broccoli", 
            "Brunch", 
            "Eggs", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Potatoes", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/10/potato-and-broccolini-frittata/", 
        "title": "potato and broccolini frittata", 
        "directions": [
            "Place the potatoes and broth in a large, ovenproof frying pan, ideally one that is 12 inches. Bring to a boil and simmer for 10 minutes, turning the potatoes often, until almost all of the stock has been absorbed and the potatoes are tender. ", 
            "Add olive oil, broccolini and onion to the potatoes in the frying pan and cook over medium heat for 1 minute, turning frequently, just to get everything coated with oil, Then, reduce the heat to medium-low and cover the pan, cooking for 3 to 4 more minutes, or until the broccolini has become mostly tender.", 
            "Heat your broiler.", 
            "Beat eggs with half the parmesan, salt and pepper, and pour it over the vegetables in the frying pan. Cover and cook over medium (or medium-low, if yours seems to be browning too quickly) until the eggs are mostly, set. Sprinkle remaining parmesan over frittata and run the whole pan under the broiler, until the top is bronzed and the eggs are just set throughout, approximately 5 minutes, but this could vary due to how robust your broiler is (mine is terrible; it took longer).", 
            "Let cool slightly before slicing into wedges or squares."
        ], 
        "date": "2013-10-28T12:08:52+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "2 1/2 cups all-purpose flour", 
            "1 teaspoon baking powder", 
            "1/2 teaspoon table salt", 
            "1 large egg", 
            "1/2 cup vegetable oil (Joe also recommends schmaltz, or rendered chicken fat, if you’ve got some)", 
            "1 teaspoon white vinegar", 
            "1/2 cup water (see Update, above)", 
            "Filling", 
            "1 1/2 pounds (about 3 medium) russet potatoes, peeled and quartered", 
            "1 small yellow onion, peeled and diced small", 
            "1 tablespoon vegetable or olive oil", 
            "1 tablespoon unsalted butter", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "To finish", 
            "1 large egg yolk", 
            "1 teaspoon water", 
            "1 1/2 pounds medium red potato (about 3 to 4), peeled and quartered", 
            "1 big leek (about 1/2 pound), white and light-green parts only, halved lengthwise, and thinly sliced (you’ll clean the grit out in a moment)", 
            "1 tablespoon vegetable or olive oil", 
            "1 tablespoon unsalted butter", 
            "1 generous cup lacinato kale ribbons (about 3 ounces or 1/4 to 1/3 bundle), tough stems and ribs removed and leaves cut into strips  (you’ll wash it in a moment)", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "3 ounces cream cheese, at room temperature "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/potato-knish-two-ways1.jpg?w=500", 
        "tags": [
            "Jewish", 
            "Kale", 
            "Leeks", 
            "Photo", 
            "Potatoes", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2012/03/potato-knish-two-ways/", 
        "title": "potato knish, two ways", 
        "directions": [
            "Cook potatoes: Put potatoes into a large pot, cover with cold water, and bring to a boil over high heat. Reduce heat to medium and cook until soft, about 20 to 25 minutes. Drain, then transfer to a large bowl to cool. ", 
            "Meanwhile, prepare leeks and kale: Fill a medium bowl with very cold water and drop in leek rings. Swish them around with your fingers, letting any sandy dirt fall to the bottom. Scoop out the leeks and drain them briefly on a towel, but no need to get them fully dry. Do the same with the kale, but you can leave the leaves to nearly fully dry, patting them if necessary, on the towels while you cook the leeks.", 
            "Heat a large, heavy skillet over medium heat. Once hot, add butter and oil and once they’re fully melted and a bit sizzly, add the leek slices. Reduce heat to low, cover with a lid and cook leek for 20 minutes, stirring occasionally. Raise heat back to medium, add the kale ribbons and cook until they wilt, about 5 minutes.", 
            "Transfer mixture to bowl with potatoes, add the cream cheese and mash together until combined. Stir in salt and many grinds of black pepper and set filling aside. "
        ], 
        "date": "2012-03-15T13:01:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large or 2 small yellow onions", 
            "3 pounds or about 5 large baking — Russet or Idaho — potatoes, peeled", 
            "1/3 cup potato starch*", 
            "2 teaspoons kosher salt", 
            "Lots of freshly ground black pepper", 
            "3 large eggs", 
            "5 tablespoons olive oil, schmaltz or another oil of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/23422902976_b1b17d03a6_k.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Gluten-Free", 
            "Hanukah", 
            "Jewish", 
            "Onions", 
            "Passover", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/12/potato-kugel/", 
        "title": "potato kugel", 
        "directions": [
            "Heat oven to 350°F.", 
            "By hand: Chop onions very finely and coarsely grate potatoes.", 
            "With a food processor: Blend onions in food processor with regular blade until finely ground. Switch to grating blade and grate potatoes — I like to do this one their sides, for the longest strands.", 
            "Both methods: Place onions and potatoes in a large bowl. Sprinkle salt, pepper and starch evenly over potatoes and toss together with two forks or, as I do it, your very clean hands, evenly coating strands. Break eggs right on top and again use forks or your fingers to work them into the strands, evenly coating the mixture. ", 
            "Heat a 1/4 cup oil or fat in a 10-inch cast-iron skillet** over high heat until very hot. Pour potato-egg mixture into pan carefully (it’s going to splatter) and spread evenly in pan. I like to twist and tousle the top strands a little for a pretty final texture on top. Drizzle with last tablespoon of oil. Bake in heated oven for 75 to 80 minutes, until browned on top and tender in the middle. If top browns too quickly, before center is baked, cover with foil for all but the last two minutes of baking time, though this has never been necessary in my oven.", 
            "Serve in squares, either right from the skillet or unmolded onto a platter. Kugel reheats exceptionally well in a warm oven. It keeps in the fridge for up to 4 days, and much longer (months, even) in the freezer. I like to defrost it in the fridge before rewarming it in an oven. ", 
            "* Cornstarch works too. As does flour. Matzo meal is traditional. I like potato starch because it’s the least distracting and lightest. I buy mine from Bob’s Red Mill; usually in a section with other BRM products at just about any store these days (hooray).", 
            "** Without a cast-iron — Use a casserole baking dish. Just heat the oil first so it’s hot when the potato mixture lands in it. (You can do this in the oven, but it will take a good 5 minutes to get very hot. Might as well do it in 60 seconds on the stove.)"
        ], 
        "date": "2015-12-01T12:05:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large baking potato (1 pound), peeled", 
            "1 small onion (4 ounces), peeled", 
            "1/4 cup all-purpose flour", 
            "1 large egg, lightly beaten", 
            "1 teaspoon salt", 
            "1/4 teaspoon freshly ground pepper", 
            "Peanut oil, for frying"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/potato-latkes1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/12/potato-pancakes-even-better/", 
        "title": "potato pancakes, even better", 
        "directions": [
            "In a food processor or on a box grater, coarsely shred the potato and onion. For longer strands, lay the potato sideways in the chute of your food processor. Transfer to a colander or wrap in a cheesecloth sling, and squeeze as dry as possible. Let stand for 2 minutes, then squeeze dry again.", 
            "In a large bowl, whisk the flour, egg, salt and pepper together. Stir in the potato onion mixture until all pieces are evenly coated.", 
            "In a medium skillet, heat 2 tablespoons of vegetable oil until shimmering. Drop packed tablespoons of the potato mixture into the skillet and flatten them with the back of a spoon. Cook the latkes over moderately high heat until the edges are golden, about 1 1/2 minutes; flip and cook until golden on the bottom, about 1 minute. Drain on paper towels. Repeat with the remaining potato mixture, adding more oil to the skillet as needed.", 
            "Do ahead: Latkes are a do-ahead-er’s dream. You can also keep latkes warm in the oven for an hour or more, if you’re waiting for stragglers to arrive. Cooked, they keep well in the fridge for a day or two, or in the freezer, well wrapped, for up to two weeks. Reheat them in a single layer on a cookie sheet in a 400 degree oven until they’re crisp again. Bonus: If you undercooked them a bit or didn’t get the browning on them you’d hoped for, you can compensate for this in the oven. "
        ], 
        "date": "2008-12-21T20:54:03+00:00"
    }, 
    {
        "ingredient_list": [
            "4 teaspoons fine sea or table salt", 
            "6 to 8 (1 kilo) small to medium Yukon Gold potatoes, peeled", 
            "1 medium yellow onion, diced", 
            "1/2 teaspoon freshly ground black pepper", 
            "4 to 5 tablespoons olive oil", 
            "About 1 tablespoon fresh rosemary leaves", 
            "2 cups minus 1 tablespoon (250 grams) all-purpose or bread flour", 
            "1 1/4 teaspoons (5 grams) instant or active dry yeast", 
            "A heaped 1/4 teaspoon fine sea or table salt", 
            "A heaped 1/4 teaspoon granulated sugar", 
            "2/3 cups (150 grams) room temperature water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/potato-pizza-pizza-con-potate1.jpg?w=640", 
        "tags": [
            "Dairy-Free", 
            "Photo", 
            "Pizza", 
            "Potatoes", 
            "Vegan", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/04/potato-pizza-even-better/", 
        "title": "potato pizza, even better", 
        "directions": [
            "In a medium bowl, stir together the flour, yeast, salt, and sugar. Add the water and, using a wooden spoon or your hand, mix until well blended, about 30 seconds. Cover the bowl and let sit at room temperature until the dough has more than doubled in volume, about 2 hours. Continue using instructions above."
        ], 
        "date": "2016-04-04T12:04:43+00:00"
    }, 
    {
        "ingredient_list": [
            "12 scallions (mine were very thin; I’d use fewer if yours are on the thick side)", 
            "1 handful kale leaves, rolled in a stack and sliced into very thin ribbons", 
            "2 eggs, lightly beaten", 
            "1/4 teaspoon freshly ground nutmeg (I totally skipped this)", 
            "1/2 teaspoon coarse or kosher salt (use less if your mashed potatoes are already seasoned)", 
            "Freshly ground pepper", 
            "1/3 cup fresh bread crumbs or panko (plain and lightweight)", 
            "1 1/2 cups cold leftover mashed potatoes", 
            "1 tablespoon olive oil", 
            "2 tablespoons vegetable oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/potato-scallion-and-kale-cakes1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Kale", 
            "Pancakes", 
            "Photo", 
            "Potatoes", 
            "Spring", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/04/potato-scallion-and-kale-cakes/", 
        "title": "potato scallion and kale cakes", 
        "directions": [
            "Clean and trim the scallions, leaving about 2 inches of green stems; I reserved the darker green tops for garnish and salad additions. Cook in boiling water until tender, about 5 minutes. Drain, wring out well, and chop finely. Place the scallions in a medium-sized bowl, add the kale, eggs, nutmeg (if using), salt, pepper, bread crumbs and potatoes and stir to combine. The batter will be loose and wet; this is just fine.", 
            "Heat the oils in a large skillet over medium-high heat until very hot but not smoking. Use about 2 tablespoons batter (I used a cookie scoop that holds slightly less) per pancake, flattening them as they hit the pan. Cook until golden brown underneath, just a couple minutes, before flipping them and cooking them on the reverse side until golden and crisp as well. Drain on paper towels, but be gentle as they are still fragile. You can keep them warm in a 200 degree oven while cooking off the rest of the batter, adding more oil as needed and letting pan cool between batches if it gets too hot.", 
            "Serve scattered with reserved scallion stems, if desired, topped with a crispy egg or alongside a dollop of sour cream or plain yogurt. They also make a wonderful meal with a big salad. Leftovers keep well in the fridge for a few days"
        ], 
        "date": "2015-04-21T11:58:49+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (65 grams) finely grated aged Pecorino Romano", 
            "1 tablespoon (10 grams) potato starch or cornstarch", 
            "1/2 teaspoon fine sea or table salt, or to taste", 
            "1/2 teaspoon finely ground black pepper, or a larger amount coarsely ground", 
            "3 tablespoons (45 grams) unsalted butter, melted, or olive oil", 
            "2 pounds (roughly 1 kg) Yukon Gold potatoes, peeled, cut into 1/8-inch-thick, ideally on a mandolin", 
            "8 cups (5 2/3 ounces or 160 grams) loosely packed arugula", 
            "1 tablespoon (15 ml) olive oil", 
            "2 teaspoons (10 ml) white wine vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/cacio-e-pepe-potatoes-anna.jpg?w=750", 
        "tags": [
            "Announcements", 
            "Cookbooks", 
            "Potatoes", 
            "Put An Egg On It", 
            "Recipes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/05/potatoes-anna-new-cookbook-preview/", 
        "title": "potatoes anna + new cookbook preview", 
        "directions": [
            "Assemble the potatoes: Heat your oven to 375°F. Combine the cheese, potato starch or cornstarch, salt, and pepper in a small dish. Taste a pinch; you want it to have a strong salty-peppery kick, because it’s going to be distributed all over the galette.\nPour 1 tablespoon butter or oil into the bottom of a 9-inch-diameter cast-iron or ovenproof skillet, and swirl it up the sides. Arrange the potatoes in overlapping concentric circles in a single layer at the bottom of the pan. (This will use approximately a quarter of your sliced potatoes.) Drizzle with 1 teaspoon butter or oil, and sprinkle with 2 tablespoons of the cheese-pepper mixture. You’ll need to repeat this three or four times to use up your potatoes (depending on their size). At the end, you should have about 1 tablespoon cheese-pepper mixture left over; reserve this. Drizzle any remaining melted butter over the top.\nTo bake: Lightly coat a piece of foil with nonstick spray and cover the skillet tightly with it. Put in heated oven for 35 minutes, at which point the potatoes will be almost tender. Use potholdered hands to press firmly on the foil to compact the potatoes a bit. Remove and reserve the foil and bake for 25 to 30 minutes more, until lightly brown all over. Press again with the foil, remove, then briefly run under the broiler for an even golden-brown finish.\nTo finish and serve: While the galette bakes, toss the arugula with the olive oil and vinegar, keeping the dressing very light.\nOnce the galette is out of the oven, let it rest in the skillet for a few minutes before running a knife around to ensure that it is loose. Gently tip the skillet over your sink to drain any excess butter or oil. Invert it onto a plate or cutting board, then flip right side up. Cut the galette into wedges, then top with the dressed greens, and sprinkle with the reserved cheese-pepper mixture.\nDo ahead: This galette can be made up to 3 days in advance. Rewarm at 350 degrees for 15 minutes with foil on top."
        ], 
        "date": "2017-05-16T11:51:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds fingerlings, or small red or yukon gold potatoes", 
            "4 large eggs", 
            "1/4 pound frisee (French curly endive) or another sturdy lettuce", 
            "6 ounces slab bacon or thick-cut bacon slices", 
            "2 tablespoons finely chopped shallot", 
            "3 tablespoons red wine vinegar", 
            "1/2 teaspoon smooth Dijon mustard", 
            "2 ounces crumbled blue cheese, or more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/potatoes-with-soft-eggs-and-warm-bacon-vinaigrette1.jpg?w=750", 
        "tags": [
            "Brunch", 
            "Budget", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2015/03/potatoes-with-soft-eggs-and-bacon-vinaigrette/", 
        "title": "potatoes with soft eggs and bacon vinaigrette", 
        "directions": [
            "Cook potatoes: In a large saucepan, cover potatoes with cold water, set a timer for 25 minutes (for small red or gold potatoes), and bring to a boil. Once boiling, reduce to a simmer. Cook until tender but not falling apart, which for small red potatoes usually takes me 25 minutes (fingerlings, because they’re thinner, might be worth checking at 20). Drain and when cool enough to touch, but still hot, halve lengthwise and arrange cut side up on a platter.", 
            "Meanwhile, cook eggs: Bring medium saucepan of water to a boil. Lower eggs into it and boil for five (for a runnier egg) to six (for a less-runny but still loose egg) minutes. Drain and rinse egg briefly under cool water until cool enough to handle and carefully peel — because the egg inside is so soft, I recommend chipping off smaller pieces at a time and running it under water as needed so you don’t accidentally rip it open. Set aside. ", 
            "Prep salad: Tear frisee into bite-size pieces and put in a large bowl. ", 
            "Right before you’re ready to serve everything, make vinaigrette: If using slab bacon, cut lengthwise into 1/4-inch thick slices, then 1/4-inch thick sticks (lardons); if using bacon slices, just cut them crosswise into 1/4-inch lardons. Cook bacon in a heavy skillet over moderate heat, until bacon is 3/4 as crisp as you’d like it to get. Add shallots, and cook for 1 minute more. Whisk in red wine vinegar and Dijon and let simmer for 10 seconds. Immediately pour 3/4 hot dressing over potatoes and last 1/4 over frisee in bowl, tossing the lettuce to combine evenly. Season both with salt and pepper. ", 
            "To finish: Top dressed potatoes with peeled eggs and use a knife to cut them into quarters, so they break open over the potatoes. Season cut eggs with salt and pepper again, sprinkle potato dish with blue cheese. Serve with frisee on the side or on top.", 
            "Note: I’ve made this a few times (can you blame me?) and sometimes I got a lot of “renderings” from the bacon and had more than enough dressing for the potatoes and side bowl of lettuce and a couple times it felt a little scant. If you don’t feel like you have enough dressing to stretch over the potatoes and lettuce, just cover the potatoes well. The lettuce can be always be lightly dressed with a splash of olive oil, teaspoon of red wine vinegar plus the salt and pepper."
        ], 
        "date": "2015-03-16T12:00:58+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups all-purpose flour (have successfully swapped whole wheat flour for half)", 
            "1 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon table salt", 
            "1 teaspoon pumpkin-pie spice (or 1/2 teaspoon cinnamon + 1/4 teaspoon fresh nutmeg + 1/4 teaspoon ginger + pinch of ground cloves and allspice)", 
            "1 cup (original recipe) to 1 1/3 cup (what I use these days; makes it even more rich) canned solid-pack pumpkin (from a 15 ounce can, not pumpkin pie filling, which is sweetened and spiced)", 
            "1/3 cup vegetable or another neutral cooking oil", 
            "2 large eggs", 
            "1 1/4 cups plus 1 tablespoon granulated sugar", 
            "1 teaspoon cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/10/pumpkin-muffins.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Fall", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Potatoes", 
            "Pumpkin"
        ], 
        "url": "https://smittenkitchen.com/2006/10/promise-keeper-pumpkin-eater/", 
        "title": "pumpkin muffins", 
        "directions": [
            "Heat oven to 350 degrees. Put liners in 12 standard-sized muffin cups.", 
            "Stir or whisk together flour, baking powder, baking soda, salt and spice in small/medium bowl. ", 
            "In a larger bowl, whisk together pumpkin, oil, eggs and 1 1/4 cups sugar. Add dry ingredients to wet and stir until just combined. Divide batter among muffin cups (each about 3/4 full).", 
            "Stir together last tablespoon of sugar and teaspoon of cinnamon. Sprinkle over each muffin. ", 
            "Bake until puffed and golden brown and wooden pick or skewer inserted into the center of a muffin comes out clean, 25 to 30 minutes.", 
            "Cool in pan on a rack five minutes, then transfer muffins from pan to rack and cool to warm or room temperature.", 
            "Do ahead: Most muffins don’t keep well, but these are excellent on Day 2 (after being stored in an airtight container at room temperature) and not bad at all on Day 3. If longer, I’d keep them in the freezer until needed."
        ], 
        "date": "2006-10-24T09:45:32+00:00"
    }, 
    {
        "ingredient_list": [
            "3 large yams or orange-fleshed sweet potatoes, cut into 4 lengthwise wedges, or 8, if your yams are very thick", 
            "1 to 2 tablespoons honey (I used 1; 2 are called for)", 
            "1 tablespoon crushed red-pepper flakes (Espelette are called for; I used mild Aleppo)", 
            "1 3/4 cups (1 15-ounce can) chickpeas, drained and patted dry on towels", 
            "4 tablespoons olive oil", 
            "1/4 teaspoon smoked paprika", 
            "Kosher salt and freshly ground black pepper", 
            "1/2 cup Greek-style plain yogurt", 
            "4 tablespoons fresh lime juice, from approximately 2 limes", 
            "2 scallions, both green and white parts, trimmed and thinly sliced, for garnish "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/roasted-yams-and-chickpeas-with-yogurt1.jpg?w=640", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/02/roasted-yams-and-chickpeas-with-yogurt/", 
        "title": "roasted yams and chickpeas with yogurt", 
        "directions": [
            "Heat oven to 425 degrees F.", 
            "Line two baking sheets with foil, for minimal mess. Coat one, the one you’ll use for the yams, with 1 tablespoon olive oil.", 
            "Toss yams with honey, 1 tablespoon olive oil and 1/2 tablespoon of pepper flakes. Let sit in bowl for 5 to 10 minutes. Toss chickpeas with 1 tablespoon olive oil, smoked paprika and salt, to taste. ", 
            "Spread yams out on olive oil-ed baking sheet in one layer. Season with salt and pepper. Roast for 30 minutes, until nicely toasted underneath. Flip/move wedges around and roast for 5 to 10 more minutes, until soft and singed. For extra color, run them under the broiler for a final minute.", 
            "Meanwhile, spread chickpeas on second uncoated baking sheet. Roast in oven for 20 minutes, rolling around once or twice so that they cook evenly, until lightly browned and crispy on the outside. Set aside.", 
            "Whisk yogurt, remaining tablespoon olive oil and lime juice together in a small dish, then season with salt and pepper to taste.", 
            "Arrange yams on plate or platter, drizzle some of the yogurt over, then about half the chickpeas. Garnish with scallions and remaining pepper flakes, plus flaky sea salt, if you have any. Keep extra chickpeas and yogurt on the side. Dig in."
        ], 
        "date": "2016-02-29T12:04:34+00:00"
    }, 
    {
        "ingredient_list": [
            "Romesco Sauce", 
            "5 ancho chiles*", 
            "2 tablespoons raw almonds", 
            "2 tablespoons blanched hazelnuts (or, you can rub their skins off once they are toasted and cooled)", 
            "1 1/4 cups extra-virgin olive oil", 
            "1 slice country bread, about 1-inch thick", 
            "1/3 cup canned San Marzano tomatoes (I bought whole tomatoes, not sure why; I’d use purée next time)", 
            "1 clove garlic, chopped", 
            "1 tablespoon chopped flat-leaf parsley", 
            "1/2 lemon, for juicing", 
            "A splash of sherry vinegar (can’t find it? Use a mild wine or balsamic vinegar instead)", 
            "Kosher salt", 
            "Potatoes", 
            "1 1/2 pounds Yukon Gold potatoes (full size or minis work)", 
            "1/4 cup extra virgin olive oil", 
            "4 to 5 cloves garlic, unpeeled", 
            "2 bay leaves", 
            "6 springs thyme, plus 2 teaspoons thyme leaves (I left this out, accidentally; it was fine without it)", 
            "1 cup Romesco sauce (from above)", 
            "2 tablespoons chopped flat-leaf parsley", 
            "Kosher salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/romesco-potatoes1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Spanish", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/03/romesco-potatoes/", 
        "title": "romesco potatoes", 
        "directions": [
            "Make the sauce: Preheat the oven to 375°F. Remove and discard the seeds and stems from the chiles, then soak them in warm water for 15 minutes to soften. Strain the chiles, and pat dry with paper towels. Meanwhile, spread the nuts on a baking sheet and toast for 8 to 10 minutes, until they smell nutty and are golden brown.", 
            "Heat a large sauté pan over high heat for 2 minutes. Add 2 tablespoon olive oil, wait a moment (for it to heat) and fry the slice of bread on both sides until golden brown. Remove the bread from the pan and cool. Cut it into 1-inch cubes and set aside.", 
            "Return the pan to the stove over high heat. Add 2 tablespoon olive oil and the chiles and sauté for a minute or two. Add the tomatoes. Season with 1/2 teaspoon salt and cook for 2 to 3 minutes, stirring often until the tomato juices have evaporated.  Turn off the heat and leave the mixture in the pan. ", 
            "In a food processor, pulse together the toasted nuts, garlic and fried bread until the bread and nuts are coarsely ground. Add the chile-tomato mixture and process for 1 minute more. With the machine running, slowly pour in the remaining 1 cup of olive oil and process until you have a smooth purée. Don’t worry, the romesco will “break” (separate into solids and oil); this is normal. Add the parsley, season to taste with lemon juice, sherry vinegar and more salt, if you feel it needs it. ", 
            "Make the potatoes: Place the potatoes in a roasting pan (I used my 12-inch cast iron skillet, which turned out to be a brilliant idea as I could transfer it to the stove and continue cooking there — highly recommended if you have one) and toss well with 2 tablespoons olive oil, garlic cloves, bay leaves, thyme sprigs and a heaping teaspoon of salt. Cover tightly with aluminum foil and roast the potatoes until tender when pierced (this took 30 minutes for my tiny ones, larger ones may need 50). Discard the bay and thyme and squeeze the garlic out of its skin and set aside.", 
            "Either transfer potatoes to a large sauté pan or transfer cast iron skillet to stove-top and heat on high for 2 minutes. Pour in the remaining 2 tablespoons oil (you can get away with 1 tablespoon if you are using the same cast-iron you roasted the potatoes in and it is well seasoned) turn the heat to medium-high and wait 1 minute more. Add the potatoes and smash them with your spatula or a fork until a little broken up. Season with thyme leaves, salt and pepper and sauté them for 6 to 8 minutes until they are crispy on one side. (If they are stuck to the pan, don’t try to move them, they will eventually release themselves). After they’ve browned nicely on the first side, turn them until they color on all sides. Spoon the romesco sauce and reserved garlic over the potatoes and stir.  Toss in the parsley. Adjust seasoning if necessary.", 
            "Do ahead: Sauce can be made up to 2 weeks in advance and kept in the fridge. Use the extra on sandwiches, with cheese, eggs, grilled fish and roasted meats. One the dish is assembled, if you’re not ready to serve it yet, turn off the heat and leave the potatoes in the pan; just before serving reheat for a few minutes and add the parsley at the last minute.", 
            "* Guys, I’m chile clueless. It’s pathetic. Kitchen Market — stocking everything, knowing all — once helped me hide this fact from the public, but in their absence, left to fend for myself, I was only able to find something called New Mexico Red Chiles and you don’t want to know how long (very) I spent trying to figure out whether they were hotter or less hot or bigger or smaller than the chiles I was supposed to use. I ended up using 3 instead of 5, and regretting it as the sauce could have had 5 without being more than just moderately hot. "
        ], 
        "date": "2010-03-22T11:00:12+00:00"
    }, 
    {
        "ingredient_list": [
            "Olive oil", 
            "1 large onion, sliced (1 1/2 cups)", 
            "2 cups (1/4-inch-sliced) fennel, top and core, if thick, removed", 
            "3 cloves garlic, minced (1 tablespoon)", 
            "1 pound sweet potatoes, peeled and sliced 1/4-inch thick", 
            "1 pound celery root, peeled and sliced 1/4-inch thick", 
            "1 pound yukon gold, peeled and sliced 1/4-inch thick", 
            "1 cup heavy cream (see Note up top)", 
            "2 cups chicken or vegetable stock or brother", 
            "2 cups grated gruyere cheese (6 ounces with rind)", 
            "2 teaspoons minced fresh thyme leaves", 
            "Kosher salt and freshly ground black pepper", 
            "2 1/2 cups coarse fresh breadcrumbs or panko (what I used)", 
            "2 to 3 tablespoons melted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/root-vegetable-gratin.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Fennel", 
            "Freezer Friendly", 
            "Onions", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/11/root-vegetable-gratin/", 
        "title": "root vegetable gratin", 
        "directions": [
            "Heat your oven to 350°F. Butter a 13×9-inch deep baking dish.\nHeat 2 tablespoons olive oil in a large deep (ideally 12-inch) saute pan over medium heat and add the onions and fennel. Cooking, tossing occasionally, until lightly browned and tender, about 10 minutes. Add the garlic and cook for one minute more.\nMeanwhile, in the largest bowl you own, combine the onion mixture with remaining vegetables, cream, stock, cheese, thyme, 1 tablespoon kosher salt and 1 1/2 teaspoons black pepper. Pour mixture into prepared dish and spread until even. Mix breadcrumbs and butter until evenly coated and distribute evenly over top of dish.\nBake 1 1/2 hours uncovered, or until vegetables are very tender when tested with a small knife and the top is browned and bubbly. Allow to set for 15 minutes at room temperature and serve hot."
        ], 
        "date": "2016-11-10T13:09:08+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds medium red-skinned potatoes, unpeeled, scrubbed", 
            "8 dill pickle spears or a handful of cornichon, coarsely chopped (about 1 1/2 cups)", 
            "3 celery stalks, chopped (about 1 cup)", 
            "1 small red onion, chopped (about 1 cup)", 
            "3 hard-boiled eggs, peeled, chopped", 
            "2/3 cup mayonnaise", 
            "2 tablespoons Dijon mustard", 
            "2 tablespoons apple cider vinegar", 
            "2 tablespoons minced fresh dill", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/roseanne-cash-all-american-potato-salad.jpg?w=750", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2007/07/rosanne-cash-all-american-potato-salad/", 
        "title": "rosanne cash’s all-american potato salad", 
        "directions": [
            "A few hours before serving or, even better, the day before: Place potatoes in medium-sized pot and cover with a few inches of salted water. Bring to a boil and cook until fork-tender, about 30 minutes. Drain and cool completely. (Overnight in the fridge makes this easy, and the potatoes even easier to slice cleanly the next day.)\nTo assemble and serve: Cut cooled potatoes into chunks and transfer to large bowl. Add pickles, celery, onion, and eggs. Combine mayonnaise, mustard, vinegar, and dill in a jar. Stir about half of dressing into salad, tossing to combine evenly. Add more dressing to taste, and season well with salt and pepper.", 
            "Do ahead: Keep dressing and vegetables separate until just before serving. Potato salad keeps for up to 4 days in fridge. Leftover dressing should keep for a couple weeks."
        ], 
        "date": "2007-07-05T23:23:15+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large russet (baking) potatoes (preferably organic; 3/4 pound each, scrubbed", 
            "3 tablespoons mayonnaise", 
            "1 tablespoon plus 1/2 teaspoon water, divided", 
            "3/4 teaspoon tomato paste", 
            "1/2 teaspoon anchovy paste", 
            "2 tablespoons Dijon mustard, divided", 
            "1/2 medium onion, finely chopped", 
            "1 tablespoon olive oil plus additional for coating potatoes", 
            "1/2 slice firm white sandwich bread", 
            "1 tablespoon milk", 
            "1/2 pound bulk breakfast sausage (1 cup) or 1/2 pound of breakfast sausage, casings removed", 
            "1 tablespoon chopped parsley", 
            "1/2 teaspoon fresh lemon juice", 
            "5 cups salad greens (2 ounces)(we used arugula, which paired with the dijon sauce was deliciously kicky)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sausage-stuffed-potatoes-a-green-salad1.jpg?w=500", 
        "tags": [
            "Budget", 
            "Greens", 
            "Meat", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/12/sausage-stuffed-potatoes-a-green-salad/", 
        "title": "sausage-stuffed potatoes + a green salad", 
        "directions": [
            "Prick potatoes with a fork. Microwave, covered with a paper towel, on high power until tender, 10 to 12 minutes.", 
            "Cutting lengthwise, remove top fourth of each potato and scoop out centers (reserve for another use), leaving 1/2-inch-thick walls.", 
            "Whisk together mayonnaise, 1 tablespoon water, tomato paste, anchovy paste, and 1 1/2 tablespoons mustard.", 
            "Preheat oven to 350°F with rack in middle.", 
            "Cook onion in oil with a pinch of salt in a small heavy skillet over medium heat, stirring occasionally, until golden, about 10 minutes.", 
            "Meanwhile, tear bread into small pieces, then soak in milk in a medium bowl until very soft. Mix in sausage, parsley, onion, and 2 tablespoons mayonnaise sauce with your hands.", 
            "Divide filling between potatoes, then coat skins lightly with oil. Bake in a 4-sided sheet pan until sausage is cooked through, about 30 minutes.", 
            "While potatoes bake, whisk 1 tablespoon mayonnaise sauce with lemon juice, remaining 1 1/2 teaspoon mustard and 1/2 teaspoon water, and salt and pepper to taste.", 
            "Remove potatoes from oven and turn on broiler. Spoon remaining mayonnaise sauce over filling and broil 3 to 4 inches from heat until charred in spots, 3 to 5 minutes. Cool slightly.", 
            "Toss greens with dressing and serve with potatoes."
        ], 
        "date": "2008-12-15T16:13:37+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds Russet potatoes", 
            "1 1/2 cups flour", 
            "1 teaspoon salt", 
            "1 large egg, lightly beaten"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/saved-by-a-grater1.jpg?w=500", 
        "tags": [
            "Pasta", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2007/04/saved-by-a-grater/", 
        "title": "gnocchi with a grater", 
        "directions": [], 
        "date": "2007-04-12T10:05:14+00:00"
    }, 
    {
        "ingredient_list": [
            "For the chicken", 
            "1 3/4-inch piece of ginger, peeled and minced (see Note up top)", 
            "4 cloves of garlic, minced or pressed", 
            "1 fresh green chili (I used a jalapeno), seeded and minced", 
            "1/2 cup whole-milk yogurt", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon chili powder or cayenne, or adjusted to taste (I used 1/4 teaspoon)", 
            "1/2 teaspoon ground turmeric", 
            "1/2 teaspoon ground cumin", 
            "3/4 teaspoon granulated sugar", 
            "1 teaspoon paprika", 
            "1 teaspoon garam masala", 
            "2 pounds chicken thighs, drumsticks or halved chicken breasts (all skin-on, bone-in)", 
            "For the vegetables", 
            "3 tablespoons olive oil", 
            "1 1/4 pounds (about 4 medium) Yukon Gold potatoes, peeled if desired, cut into 3/4-inch chunks", 
            "1 3/4 pounds (1 small or half a very large head) cauliflower, cut into 3/4-inch-wide florets", 
            "1/2 teaspoon kosher salt", 
            "1/2 teaspoon cumin seeds", 
            "To finish, if desired", 
            "A few thin slices of red onion", 
            "Lemon wedges", 
            "Salt", 
            "Dollops of yogurt", 
            "A few tablespoons roughly chopped cilantro, parsley or mint, or a mix therof"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/sheet-pan-chicken-tikka1.jpg?w=640", 
        "tags": [
            "Cauliflower", 
            "Chicken", 
            "Gluten-Free", 
            "Indian", 
            "Photo", 
            "Potatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/04/sheet-pan-chicken-tikka/", 
        "title": "sheet pan chicken tikka", 
        "directions": [
            "Combine ginger, garlic, fresh chili, yogurt, salt, spices and sugar in a freezer bag, bowl or container. Add chicken pieces and toss to coat evenly. Let marinate for 15 minutes or up to a day in the fridge.", 
            "When you’re ready to cook the dish, heat your oven to 425°F. Line a half-sheet (13×18-inch) with foil and coat it with 1 tablespoon of the olive oil. Add potatoes, cauliflower, salt, cumin and remaining 2 tablespoons olive oil and toss together with you hands until evenly coated.", 
            "Remove chicken from marinade and leave excess behind. Make spaces in the vegetables for chicken parts throughout the pan. Roast in oven for 20 minutes, then toss the potato and cauliflower to ensure they’re cooking evenly, and return the pan to the oven for 10 to 20 minutes more (i.e. 30 to 40 minutes total roasting time), until chicken and vegetables are cooked through. ", 
            "While it roasts, if you’d like to use the lightly pickled onion rings that we did on top, which added a nice tangy fresh zip to the dish, separate the rings and toss them in a small bowl with a squeeze of lemon juice and a pinch of salt. Set aside until needed.", 
            "When chicken and vegetables are cooked, top with garnishes of your choice — we used dollops of yogurt, herbs and scattered the above onion rings all over. Serve right in the pan."
        ], 
        "date": "2016-04-12T11:59:44+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons butter, cut into pieces, plus an additional pat for buttering gratin dish", 
            "4 large yellow potatoes* (about 1 1/2 pounds), peeled", 
            "Salt and freshly ground black pepper", 
            "1 cup milk, half-and-half or cream (if using something richer than milk, you can skip the butter)", 
            "2 ounces cheese, grated or crumbled (Parmesan or Gruyere are the classics, but that doesn’t mean that goat cheese, blue cheese or any of your favorites won’t work as well) [optional]"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/simple-potato-gratin1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/04/simple-potato-gratin/", 
        "title": "simple potato gratin", 
        "directions": [
            "Preheat the oven to 350°F and grease a 9- by 12-inch gratin dish with the pat of butter. Slice the potatoes as thinly as you can (a mandoline works great for this) and arrange them in a layer, overlapping the edges slightly like shingles. Sprinkle the potatoes with salt and freshly ground pepper and don’t be stingy — this is where the bulk of your flavor comes from and a third of the cheese before before repeating this process with your remaining potato slices. (If you are using a sauteed vegetable filling, this is where you’d want to add half of it.) Depending on how thinly sliced your potatoes are, you should end up with approximately three layers, with a third of the cheese between each layer. Reserve the last third of your cheese for later.", 
            "Carefully pour the milk over the potatoes. It should come up to the bottom of the top layer of potatoes; add more if this was not enough. Dot the top of the gratin with the three tablespoons of butter and bake it for about an hour. Halfway through the baking time, take the gratin dish out of the oven and gental press the potatoes flat with a spatula to keep the top moist. Sprinkle the remaining cheese on top of the gratin for the last 15 minutes of baking. The gratin is done when the potatoes are soft and the top is golden brown.", 
            "More gratin ideas: Use duck fat instead of butter. Swap celery root, parsnips or turnip slices for half the potatoes. Add chopped herbs such as parsley, thyme, chives or chervil between the layers. Sauté mushrooms, sorrel, spinach or leeks, with or without a finely-chopped shallot, and layer them between the potato slices.", 
            "* Yukon Golds and other waxy, yellow-fleshed potatoes work best in gratins, keeping their texture without getting floury and falling apart as Russets do."
        ], 
        "date": "2009-04-13T17:52:30+00:00"
    }, 
    {
        "ingredient_list": [
            "Vinaigrette", 
            "1 tablespoon Dijon mustard", 
            "1 tablespoon Sherry wine vinegar", 
            "1/4 cup canola oil", 
            "1 teaspoon chopped fresh Italian parsley", 
            "1/2 teaspoon chopped fresh tarragon", 
            "Fine sea salt", 
            "Freshly ground black pepper", 
            "Potatoes", 
            "2 cups coarse sea salt", 
            "2 pounds fingerling potatoes (such as Ruby Crescent or Russian Banana)", 
            "2 small shallots, thinly sliced", 
            "2 hard-boiled eggs, peeled, chopped", 
            "2 green onions, thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/some-very-good-things1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2006/11/some-very-good-things/", 
        "title": "potato salad with sherry mustard vinaigrette", 
        "directions": [
            "For vinaigrette: Combine mustard and vinegar in small bowl. Whisk in oil, then herbs. Season with sea salt and pepper.", 
            "For potatoes: Preheat oven to 400°F. Spread sea salt in even layer on rimmed baking sheet; arrange potatoes over salt, spacing slightly apart. Cover sheet with foil and bake until potatoes are tender, about 1 hour. Remove from oven, uncover, and cool to lukewarm.", 
            "Meanwhile, cook bacon in medium skillet over medium heat until brown and crisp. Transfer to paper towels to drain. ", 
            "Peel potatoes; cut in half lengthwise. Place warm potatoes in medium bowl. Add bacon, shallots, eggs, onions, and vinaigrette. Toss well and serve."
        ], 
        "date": "2006-11-27T11:49:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 teaspoon coriander seeds", 
            "1/2 teaspoon fennel seeds", 
            "1/2 teaspoon dried oregano", 
            "1/4 to 1/2 teaspoon dried hot red pepper flakes (the latter will make them quite spicy, so using according to your preferences)", 
            "1 teaspoon kosher salt", 
            "2 pounds medium sweet potatoes", 
            "3 tablespoons vegetable oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spicy-sweet-potato-wedges-plus-five-etceteras1.jpg?w=500", 
        "tags": [
            "Elsewhere", 
            "Photo", 
            "Potatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/02/spicy-sweet-potato-wedges-plus-five-etceteras/", 
        "title": "spicy sweet potato wedges + five etceteras", 
        "directions": [
            "Preheat oven to 425°F.  Coarsely grind coriander, fennel, oregano, and red pepper flakes in an electric coffee/spice grinder or with a mortar and pestle. Stir together spices and salt. ", 
            "Cut potatoes lengthwise into 1-inch wedges. Toss wedges with oil and spices in a large roasting pan and roast in middle of oven 20 minutes. Turn wedges over with a spatula and roast until tender and slightly golden, 15 to 20 minutes more. "
        ], 
        "date": "2008-02-27T15:50:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound pancetta (a cured pork that is less salty than proscuitto, and not smoked like bacon), cut into 1/4-inch dice", 
            "1 pound Yukon gold potatoes, peeled and cut into a 1/2-inch dice", 
            "1 small yellow onion, chopped small", 
            "1/2 pound asparagus, tough ends trimmed and cut into 1-inch segments", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/spring-asparagus-pancetta-hash.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Spring", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/05/spring-asparagus-pancetta-hash/", 
        "title": "spring asparagus pancetta hash", 
        "directions": [
            "Serving ideas: Fried eggs, dabs of goat cheese and slivers of green onions", 
            "Heat a 12-inch cast iron frying pan over medium heat. Fry the pancetta, turning it frequently so that it browns and crisps on all sides; this takes about 10 minutes. Remove it with a slotted spoon and drain it on paper towels. Leave the heat on and the renderings in the pan. (With a well-seasoned cast iron, this should be all the fat you need to cook the remainder of the hash. If you’re not using a cast iron, you might need to add a tablespoon or so of oil; if you’ve skipped the pork, you’ll want to start with 2 tablespoons oil.)", 
            "Add the potatoes don’t move them for a couple minutes. Use this time to season them well with salt and pepper. Once they’ve gotten a little brown underneath, begin flipping and turning them, then letting them cook again for a few minutes. The idea is not to fight them off the frying pan, once they’ve gotten a little color, it’s easier to flip them and you’ve gotten closer to your goal of getting them evenly browned. ", 
            "When the potatoes are about three-fourths as crisped and brown as you’d like them — this takes about 15 minutes — add the onion. (I add this now, not earlier, because I find it often burns before the potatoes are done.) Cook for an additional 5 minutes. Add the asparagus, cover the pan and cook for 5 to 8 minutes, or until crisply cooked. (Skinny asparagus will take just 5 minutes; thicker asparagus will take longer.) Remove the lid, return the pancetta to the pan for another minute, to reheat. Taste for seasoning and adjust if needed. Serve immediately. "
        ], 
        "date": "2010-05-05T11:42:37+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds small new or fingerling potatoes (I used a mix of reds and yukon golds)", 
            "1 pound asparagus", 
            "1/4 pound sugar snap peas, green beans or other spring pea", 
            "4 small-to-medium radishes, thinly sliced", 
            "Pickled spring onions", 
            "3 spring onions (about 6 ounces)", 
            "1/4 cup white wine vinegar", 
            "1/4 cup water", 
            "1 tablespoon kosher salt (I use Diamond brand; use less if you’re using Morton or table salt)", 
            "1 1/2 teaspoons sugar", 
            "Sharp mustard vinaigrette", 
            "1/4 cup olive oil", 
            "2 tablespoons whole grain mustard (both Roland and Maille make a whole seed one I’m tremendously fond of)", 
            "2 teaspoons smooth Dijon mustard", 
            "2 tablespoons white wine vinegar", 
            "Salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/spring-salad-with-new-potatoes.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Peas", 
            "Photo", 
            "Potatoes", 
            "Radishes", 
            "Salad", 
            "Spring", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/05/spring-salad-with-new-potatoes/", 
        "title": "spring salad with new potatoes", 
        "directions": [
            "Place potatoes in a medium saucepan and cover with one inch of water. Bring to a boil and cook for about 15 minutes, or until the tip of a knife easily pierces through a potato. Drain the potatoes and let them cool until they’re almost room temperature. You can hasten this by covering them with cold water, and replacing the water a few times as it warms up.", 
            "Meanwhile, pickle your spring onions. Whisk vinegar, water, salt and sugar together in the bottom of a small container with a lid until the salt and sugar dissolve. Slice the bulbs and paler green parts into very thin coins and submerge them in the vinegar mixture. Cover and put in fridge until you’re ready to use them; if you can put them aside for an hour or even overnight, even better. Reserve the onion greens.", 
            "Refill the saucepan you used for the potatoes (here’s to fewer dishes!) with salted water and bring it to a boil. Prepare an ice bath, a large bowl with ice and water in it. Trim the tough ends off the asparagus. Once the water is boiling, add the asparagus. One minute later, add the sugar snap peas. Two minutes later, drain both together then dump them in the ice bath until chilled. Drain the vegetables and spread them out on towel to absorb excess water.", 
            "Slice the cooked asparagus spears and sugar snaps into 1/2-inch segments and place them in a large bowl. Chop potatoes into moderate-sized chunks and add them to the bowl. Cut the radishes as thinly as possible, with a mandoline if you have one. If they’re especially big (mine were), you can first quarter them lengthwise. Cut some of the reserved onion greens into thin slivers (no need to use all of them, as the onion flavor might take over) and add them to the bowl.", 
            "When you’re ready to serve the salad, or an hour or two in advance, whisk the dressing ingredients and toss it with the vegetables, to taste. (You may find you don’t want to use all of it.) Stir in as many pickled onion coins as you please, save the rest for anything and everything. Season with salt and freshly ground black pepper, to taste. Eat and enjoy!.", 
            "Do ahead: Pickles can be started in the day or days before. Potatoes can be boiled and chilled in fridge overnight, as can other vegetables. Vinaigrette can be made in advance as well, but I might wait until the last minute to toss it with the vegetables as the vinegar, over a long sitting time, can ever-so-slightly discolor the cut edges of the asparagus and beans."
        ], 
        "date": "2011-05-30T10:20:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound sweet potatoes (red skinned are my favorite)", 
            "1/3 cup (79 ml) buttermilk", 
            "2 cups (250 grams) all-purpose flour", 
            "1 tablespoon (15 grams) baking powder", 
            "3 tablespoons (38 grams) granulated sugar", 
            "1 teaspoon ground (2 grams) cinnamon", 
            "1/4 teaspoon ground nutmeg", 
            "1/4 teaspoon ground ginger", 
            "1/8 teaspoon ground cloves", 
            "1/2 teaspoon (2 grams) table salt", 
            "5 tablespoons (71 grams) unsalted butter, cold", 
            "1 cup miniature marshmallows (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sweet-potato-and-marshmallow-biscuits1.jpg?w=500", 
        "tags": [
            "Fall", 
            "Photo", 
            "Potatoes", 
            "Scones/Biscuits", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2011/11/sweet-potato-and-marshmallow-biscuits/", 
        "title": "sweet potato (and marshmallow) biscuits", 
        "directions": [
            "The day before or a couple hours in advance: Preheat oven to 400°F. Place sweet potato on a tray and roast until soft, about 40 to 45 minutes. Let cool completely in skin (the fridge can speed this up) then peel. Either run potato flesh through a potato ricer or mash it until very smooth. You’re looking for 3/4 cup (191 grams) sweet potato puree (I get closer to 1 1/3 cups from 1 pound. Melt some salted butter over any remainder and sprinkle with chives — happy lunch!) ", 
            "You’ll probably have turned your oven off by now, so preheat it again to 400°F. Line a baking sheet with parchment paper and set aside. Whisk 3/4 cup reserved sweet potato puree with buttermilk until smoothly combined. Keep nearby.", 
            "In the bottom of a large, wide-ish bowl, whisk flours, baking powder, sugar, spices and salt together. If you have a  pastry blender, add the butter (if you have a sturdy pastry blender, no need to chop it first) and use the blender to cut the butter into the flour mixture until the biggest pieces are the size of small peas. If you don’t have a pastry blender, cut the butter into small pieces with a knife and work the butter into the flour mixture with your fingertips until the mixture resembles a coarse meal. ", 
            "For both methods, continue by adding the sweet potato mixture and stir and break it up until the mixture is in big, soft chunks. Get your hands in the bowl and gently knead the dough into an even mass, using as few motions as possible (and thus, warming the dough as little as possible.). ", 
            "With marshmallows: Roll or pat dough out on a floured counter to a 1/2-inch thickness and divide evenly in half. Sprinkle marshmallows loosely over half of dough. Place the second half on top of marshmallow and use rolling pin to gently press the sides together, keeping the final dough thickness at a full inch. ", 
            "Without marshmallows: Roll or pat dough out on a floured counter to a 1-inch thickness. ", 
            "Both methods: Dip a 2-inch biscuit cutter in flour then form biscuits by cutting straight down and not twisting — this will help give your biscuits the maximum rise. Bake biscuits on prepared sheet for 13 to 15 minutes, until puffed and slightly golden on top. Cool on rack and enjoy as soon as possible.", 
            "Do ahead: Biscuits are best on the first day that they’re baked. To make them ahead of time, arrange cut biscuits on a tray to freeze them. Once frozen, transfer them to a freezer bag until needed. Bake at same temperature straight from freezer; biscuits will take about 2 minutes longer to bake."
        ], 
        "date": "2011-11-22T17:15:25+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons extra-virgin olive oil, divided", 
            "1 10- to 11-ounce fully cooked smoked Portuguese linguica sausage or chorizo sausage, cut crosswise into 1/4-inch-thick slices (Spanish chorizo can be substituted)", 
            "2 medium onions, chopped", 
            "2 large garlic cloves, minced", 
            "2 pounds red-skinned sweet potatoes (yams; about 2 large), peeled, quartered lengthwise, cut crosswise into 1/4-inch-thick slices", 
            "1 pound white-skinned potatoes, peeled, halved lengthwise, cut crosswise into 1/4-inch-thick slices", 
            "6 cups low-salt chicken broth", 
            "1 9-ounce bag fresh spinach"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sweet-potato-and-sausage-soup1.jpg?w=500", 
        "tags": [
            "Fall", 
            "Meat", 
            "Photo", 
            "Potatoes", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2007/10/sweet-potato-and-sausage-soup/", 
        "title": "sweet potato and sausage soup", 
        "directions": [
            "Heat 2 tablespoons oil in heavy large pot over medium-high heat. Add sausage; cook until brown, stirring often, about 8 minutes. Transfer sausage to paper towels to drain. (I poured off some of the oil in the pot at this point, but the original recipe doesn’t think this is needed.) Add onions and garlic to pot and cook until translucent, stirring often, about 5 minutes. Add all potatoes and cook until beginning to soften, stirring often, about 12 minutes. Add broth; bring to boil, scraping up browned bits. Reduce heat to medium-low, cover, and simmer until potatoes are soft, stirring occasionally, about 20 minutes. Using potato masher, mash some of potatoes in pot. Add browned sausage to soup. Stir in spinach and simmer just until wilted, about 5 minutes. Stir in remaining 1 tablespoon oil. Season with salt and pepper. Divide among bowls and serve.", 
            "Other options to consider: Kielbasa (suggested by commenter Wendy) instead of chorizo/linguica, adding a can or two of drained white beans or using more spinach. I love spinach wilted in soups and could have used even more. "
        ], 
        "date": "2007-10-28T10:07:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds sweet potatoes (about 2 medium potatoes), peeled and chopped into a 1/2-inch dice", 
            "4 tablespoons unsalted butter, melted", 
            "2 tablespoons fresh lemon juice (optional)", 
            "1/2 teaspoon freshly grated nutmeg", 
            "1/2 teaspoon ground cinnamon", 
            "1/2 teaspoon kosher salt", 
            "3 large eggs, separated", 
            "1/2 cup sugar", 
            "2 tablespoons all-purpose flour", 
            "3/4 cup full- or lowfat buttermilk (or, you can make your own)", 
            "1 All-Butter, Really Flaky Pie Crust (a half recipe will yield a single crust), prebaked (instructions below)", 
            "Whipped cream, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/sweet-potato-pie.jpg?w=753", 
        "tags": [
            "Fall", 
            "Photo", 
            "Potatoes", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2009/11/sweet-potato-buttermilk-pie/", 
        "title": "sweet potato buttermilk pie", 
        "directions": [
            "Preheat the oven to 375°F.", 
            "Pour 1 1/2 inches of water into a 3-quart stock part with a strainer basket suspended over it and bring to a boil over medium-high heat. Add the sweet potatoes, cover and steam until fork-tender, about 20 minutes. Place the steamed sweet potatoes in a large bowl and let cool to room temperature. Mash them into a smooth puree with a fork or potato masher (though I suspect that a potato ricer would also do a great job). You should have 1 1/4 cups puree; discard any excess (by topping with a pat of butter, sprinkling with salt and making yourself a most-excellent snack). Add the butter, lemon juice if using, nutmeg, cinnamon and salt and mix thoroughly with a wooden spoon or rubber spatula after each addition.", 
            "In a small bowl, beat the egg yolks lightly with a whisk, about 30 seconds. Add the sugar and beat until they’re a creamy lemon-yellow color, about 1 1/2 minutes. Add the egg mixture to the sweet potato mixture and stir until the eggs are thoroughly incorporated and the filling is a consistent bright orange color. Add the flour a little at a time, stirring after each addition until thoroughly incorporated. Add the buttermilk and again stir until smooth and even.", 
            "With a cleaned whisk (or electric hand mixer), whisk the egg whites to soft peaks in a clean, dry bowl. With a wooden spoon or rubber spatula, gently fold the egg whites into the sweet potato-buttermilk mixture until thoroughly combined. Pour the mixture into the prebaked crust and bake on the middle rack of the oven until the center is firm and set, 35 to 40 minutes.", 
            "Remove the pie from the oven and cool completely on a rack. Serve at room temperature (or cold from the fridge; you can cover it with plastic wrap before chilling) with a dollop of whipped cream.", 
            "To pre-bake your pie crust, choose a method: “Proper” method — Lay a sheet of aluminum foil over the dough and carefully scatter pie weights, dried beans or pennies over it. Bake on the middle rick of your oven at 325°F for 12 to 15 minutes. Remove the pie weights and the foil, prick the bottom of the crust with a fork, and bake for 10 minutes more.", 
            "Deb’s “Cheater” method — Freeze your rolled-out pie shell for 20 to 30 minutes until solid. Press a piece of buttered foil, buttered side down, very frozen shell and blind bake it at 325°F for 20 minutes, then carefully pull back the foil, press any part of the crust that has bubbled up gently back with the back of a spoon, prick the bottom of the crust with a fork, and bake for 10 minutes more."
        ], 
        "date": "2009-11-17T11:37:41+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "1 1/2 pounds sweet potatoes (about 2 to 3 medium or 2 large)", 
            "2 cups (250 grams) all-purpose flour", 
            "1 3/4 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon table salt", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon (more to taste) ground ginger", 
            "Two pinches (more to taste) ground cloves", 
            "1/2 cup (1 stick or 115 grams) unsalted butter, at room temperature", 
            "1 cup (190 grams) packed light brown sugar", 
            "1/2 teaspoon vanilla extract", 
            "2 large eggs", 
            "Frosting", 
            "3 large egg whites", 
            "3/4 cup granulated sugar", 
            "Pinch of salt", 
            "1/4 teaspoon cream of tartar (will help stabilize egg whites, don’t worry if you don’t have it)", 
            "1/2 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/sweet-potato-cake-with-toasted-marshmallow-frosting1.jpg?w=640", 
        "tags": [
            "Celebration Cakes", 
            "Everyday Cakes", 
            "Fall", 
            "Photo", 
            "Potatoes", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2013/11/sweet-potato-cake-with-marshmallow-frosting/", 
        "title": "sweet potato cake with marshmallow frosting", 
        "directions": [
            "Roast sweet potatoes: Heat oven to 375 degrees. Prick potatoes all over with a fork. Rest on a baking sheet. Roast for 45 minutes to 1 hour, turning once or twice, until soft. Let cool completely. Can be kept in fridge for up to 3 days, if baked in advance.", 
            "Make cake: Heat oven to 350 degrees F. Line the bottom of an 8- to 9-inch square pan with parchment paper, then butter the paper and sides of the pan. [If you trust your nonstick pan, you might be able to skip the parchment, but I don’t like to live on the edge when it comes to getting cakes out of a pan.]", 
            "Peel cooled sweet potatoes and run flesh through a potato ricer, or mash until very smooth. (Do not blend in a blender or food processor.) Measure 1 1/2 packed cups (about 12 to 13 ounces) from sweet potato mash; you may have a little extra, which you should warm up with a pat of butter and sprinkle of sea salt and not share with anyone.", 
            "Whisk flour, baking powder, baking soda, salt and spices together in a medium bowl. In a large bowl, beat butter and brown sugar together with an electric mixer until light and fluffy, about 2 to 3 minutes. Add vanilla and eggs, and beat until just combined. Mix in sweet potato puree, then stir in dry ingredients just until they disappear. ", 
            "Spread batter in prepared pan, and bake cake until a toothpick inserted into the center comes out clean, about 35 to 40 minutes. Let cake rest in pan for 5 minutes on a cooling rack, then invert onto cooling rack, and let cool completely. You can speed this up, as I always do, in the fridge.", 
            "Make frosting: Place egg whites, granulated sugar, a pinch of salt and cream of tartar in a heatproof bowl set over a saucepan of gently simmering water. Whisk mixture for 3 minutes, until whites are warmed and sugar granules feels mostly dissolved. Remove bowl from top of saucepan, then, with an electric mixer, beat egg white mixture on high speed until stiff, glossy peaks form, about 4 to 7 minutes longer. Add vanilla and mix until combined.", 
            "Frost and decorate: If you’d like to make huge, marshmallow-like dollops, spread a bit of frosting thinly over cooled sweet potato cake. Then, using a very large round piping tip (I have an almost comically large one with a 1/2-inch opening) or the corner snipped off a freezer bag, pipe large dollops of frosting all over thin frosting layer. If you’d like to skip the dollops, you can just spread the frosting, thick and swirly, all over.", 
            "Using a kitchen torch, lightly brown the dollops so that they look (and smell!) like toasted marshmallows. ", 
            "Serve: At room temperature cut into squares. Cake keeps at room temperature for two days; any longer, I like to keep it in the fridge."
        ], 
        "date": "2013-11-26T12:51:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds sweet potato, scrubbed, unpeeled, in 3/4- to 1-inch coins", 
            "4 tablespoons olive oil, divided", 
            "1/4 cup toasted and cooled pecan halves", 
            "2 tiny or 1 small shallot", 
            "2 stalks celery", 
            "2 tablespoons flat-leaf parsley", 
            "1 tablespoon dried cranberries or cherries (optional)", 
            "2 ounces firmish goat cheese", 
            "Salt and freshly ground black pepper", 
            "2 teaspoons red wine vinegar", 
            "1/2 teaspoon smooth Dijon mustard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/11/sweet-potatoes-with-pecans-and-goat-cheese.jpg?w=749", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/11/sweet-potatoes-with-pecans-and-goat-cheese/", 
        "title": "sweet potatoes with pecans and goat cheese", 
        "directions": [
            "Preheat oven to 450 degrees. Coat a large baking sheet generously with olive oil, about 1 to 2 tablespoons. Lay sweet potatoes in one layer on the oiled sheet. Sprinkle with salt and freshly ground black pepper. Roast, without disturbing, for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release from the pan with no effort. If they’re not, let it cook longer. Sprinkle them with additional salt and freshly ground black pepper and return the pan to the oven for another 10 minutes or so, until the undersides match the tops.", 
            "Meanwhile, prepare your salad. Chop your pecans well, mince your shallot, chop your celery and parsley, mince cranberries if using them. Crumble your goat cheese. If you, like me, got too soft of a goat cheese for mixing, set it aside and sprinkle it on top. If it’s firmer, stir it into the mixture. In a small dish, whisk together 2 tablespoons olive oil, 2 teaspoons red wine vinegar and 1/2 teaspoon dijon. Pour half over salad.", 
            "When the sweet potatoes are done, set a couple coins aside just in case the baby isn’t into the toppings. Lay the rest on a serving platter. Scoop a spoonful of the salsa over each round. Pour remaining salad dressing over top, to taste. Eat immediately."
        ], 
        "date": "2010-11-15T16:43:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (1/2 stick or 2 ounces) butter", 
            "1 small onion, finely chopped", 
            "3 pounds Swiss chard, leaves and stems separated and both cut into 1-inch pieces", 
            "Pinch of freshly grated nutmeg", 
            "2 cups heavy cream or whole milk", 
            "2 garlic cloves, minced", 
            "2 tablespoons flour", 
            "2 pounds medium red-skinned sweet potatoes (yams), peeled and cut into 1/8-inch thick rounds", 
            "1 tablespoon minced fresh Italian parsley", 
            "1 tablespoon minced fresh thyme", 
            "Fine sea salt", 
            "Freshly ground black pepper", 
            "1 1/4 cups (about 5 ounces) coarsely grated Gruyére cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/swiss-chard-and-sweet-potato-gratin.jpg?w=753", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Freezer Friendly", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Swiss Chard", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/11/swiss-chard-and-sweet-potato-gratin/", 
        "title": "swiss chard and sweet potato gratin", 
        "directions": [
            "Prep greens: Cook onion in 2 tablespoons butter in a wide 8-quart heavy pot over moderately low heat, stirring, until softened. Add chard stems, pinch of nutmeg, and salt and pepper to taste and cook, stirring, until vegetables are tender but not browned, about 8 minutes. Increase heat to moderately high and add chard leaves by large handfuls, stirring, until all greens are wilted. Season with salt and pepper then transfer greens to a colander to drain well and press out liquid with back of a large spoon.", 
            "Make sauce: Combine cream or milk and garlic in small saucepan; bring to simmer; keep warm. Melt two tablespoons butter in a medium heavy saucepan over moderate heat and stir in flour. Cook roux, whisking, one minute, then slowly whisk in warm cream/milk and boil, whisking, one minute. Season sauce with salt and pepper.", 
            "Assemble gratin: Preheat oven to 400°F. Butter deep 9×13 baking dish. Spread half of sweet potatoes in the prepared baking dish. Sprinkle with salt, pepper, a quarter of the herbs and a 1/4 cup of the cheese. Distribute half of the greens mixture over the cheese, then sprinkle salt, pepper, a quarter of the herbs and 1/4 cup of the cheese over it. Pour half of bechamel sauce over the first two layers then continue with the remaining sweet potatoes, more salt, pepper, herbs and cheese and then the remaining greens, salt, pepper and herbs. Pour the remaining sauce over the top of the gratin, pressing the vegetables slightly to ensure that they are as submerged as possible. Sprinkle with the last 1/4 cup of cheese.", 
            "Bake gratin for about 1 hour until golden and bubbly, and most of the liquid is absorbed. Let stand 10 minutes before serving. ", 
            "Do ahead: You can make the entire gratin but not bake it up to a day in advance and keep it in the fridge. You can also make and bake the gratin and reheat it. Gratins reheat well, but they take almost as much time to gently heat through as they do to bake in the first place, especially deep ones like this. As for reheating, already baked and frozen, I will find out very soon! But I am near-positive it will be fine."
        ], 
        "date": "2009-11-12T17:08:23+00:00"
    }, 
    {
        "ingredient_list": [
            "4 teaspoons vegetable oil", 
            "1/4 cup (60 grams) tomato paste", 
            "2 tablespoons cider vinegar", 
            "2 teaspoons honey", 
            "2 teaspoons Worcestershire sauce", 
            "2 teaspoons smooth dijon mustard", 
            "1/4 teaspoon table salt", 
            "2 slices sandwich bread", 
            "1/2 medium onion, roughly chopped", 
            "1 garlic clove, chopped", 
            "1 medium stalk celery, roughly chopped", 
            "1 medium carrot, roughly chopped", 
            "Olive oil, for cooking", 
            "1 teaspoon fine sea or table table salt, plus more for vegetables", 
            "Freshly ground black pepper", 
            "2 pounds ground beef", 
            "2 large eggs", 
            "1 tablespoon tomato paste", 
            "1 teaspoon dijon mustard", 
            "1 teaspoon smoked paprika", 
            "2 tablespoons Worcestershire sauce", 
            "1/4 cup chopped fresh flat-leaf parsley", 
            "1/2 cup (120 grams) milk", 
            "2 pounds (905 grams) yukon gold potatoes (about 6)", 
            "8 tablespoons (4 ounces or 115 grams) unsalted butter", 
            "1 cup (235 ml) buttermilk", 
            "1 teaspoon fine sea or table salt", 
            "Finely ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/tomato-glazed-meatloaves-with-brown-butter-mashed-potatoes.jpg?w=750", 
        "tags": [
            "Beef", 
            "Freezer Friendly", 
            "Meat", 
            "Photo", 
            "Potatoes", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2017/02/tomato-glazed-meatloaves-with-brown-butter-mashed-potatoes/", 
        "title": "tomato-glazed meatloaves with brown butter mashed potatoes", 
        "directions": [
            "Make the glaze: Combine glaze ingredients in a small saucepan, and simmer, whisking constantly, for 2 minutes until and glaze is satiny smooth. Set aside.\nPrepare the meatloaves: Heat your oven to 350 degrees F. Lightly coat 2 9×13-inch baking dishes with nonstick spray or oil. Tear the bread into chunks and then blend it, in a food processor, into breadcrumbs. Place the breadcrumbs in a large bowl. You should have about 1 cup.\nAdd the onion, garlic, celery, and carrot to the food processor, and pulse it until they are finely chopped. Heat a large skillet over medium heat. Once the skillet is hot, coat the bottom with olive oil, and heat the oil for a minute; add the finely chopped vegetables. Season with salt and pepper, and cook, stirring frequently, until they begin to brown, about 10 minutes.\nAdd the vegetables to the large bowl with breadcrumbs, then add the remaining ingredients. Stir the ingredients together with a fork or your hands until evenly blended.\nPause for a moment to start mashed potatoes: Place the potatoes in a medium pot, and cover with a couple inches of cold water. Bring to a boil over high heat, and once it’s boiling, reduce the heat to a simmer. Cook for about 20 minutes once the simmering begins; the potatoes are ready when a paring knife or fork can be inserted into the center with little resistance. Drain potatoes, then wipe the pot dry.", 
            "Resume your meatloaves while the potatoes boil: Form the meatloaf mixture into twelve 3-inch meatballs; each will weigh about 4 ounces. Arrange 6 in each prepared baking pan, evenly. Drizzle or brush each meatball with a teaspoon or so of the tomato glaze you made earlier, and bake until cooked through, about 20 to 25 minutes (an instant-read thermometer inserted into the center of a cooked meatball will register 160 to 165F).\nFinish mashed potatoes: As soon as you can hold them (I use potholders), peel your potatoes. The skins should come right off with a paring knife. Run the potatoes through a potato ricer or mash them with a masher until smooth. In your empty potato pot, melt butter over medium heat and continue cooking once it has melted, stirring almost constantly, until brown bits form around edge and bottom and it smells nutty. Pour the hot butter and any browned bits over the potatoes. Add buttermilk to pot and warm it gently (so it doesn’t cool down your potatoes when you add it). Pour this over the potatoes too. Add salt and pepper and stir to combine.\nTo serve: Place a dollop of potatoes in the bottom of a plate or shallow bowl. Top with a meatloaf. Garnish with extra chopped parsley, if desired.\n"
        ], 
        "date": "2017-02-16T13:08:33+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 (1 1/4 to 1 1/2 pounds) Yukon Gold potatoes", 
            "1 small onion", 
            "1 cup olive oil", 
            "6 extra-large or 7 large eggs", 
            "Salt and freshly ground black pepper (don’t skimp)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/09/tortilla-de-patatas-potato-tortilla.jpg?w=750", 
        "tags": [
            "Brunch", 
            "Budget", 
            "Eggs", 
            "Passover", 
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Spanish", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2007/09/tortilla-de-patatas/", 
        "title": "tortilla de patatas", 
        "directions": [
            "Prepare potatoes and onions: Peel potatoes and onion and slice them very thin with a mandoline, the slicing blade of a food processor, or by hand. If either are on the large side, first cut them in a half lengthwise so the slices will be in half-moons.", 
            "Cook potatoes and onions: Heat oil in an 8- to 10-inch skillet, ideally nonstick, over medium-high until very hot, about 3 minutes. Add potatoes and onions in even layers and reduce heat to medium-low. Cook for 15 minutes, flipping and nudging potatoes around to ensure they cook evenly. Potatoes are done when they are tender when pierced with the tip of a knife. They should not get brown or fall apart in flipping (unless you like your tortillas with softer, more broken-up potatoes, as some do).\nDrain potatoes and onions: Transfer potatoes and onion to a colander set over a bowl and drain them. Season potatoes and onion with salt and pepper and let cool slightly, about 5 minutes. [Go make your salad now! Or start cracking those eggs…]\nMake the tortilla batter: In the bottom of a large bowl, lightly beat eggs with a couple good pinches of salt and freshly ground black pepper. Stir in drained potatoes and onions. If you have 10 minutes, definitely let them soak together for that long; it makes a difference in how well the finally tortilla stays together. If you’re in a rush, it’s not going to ruin the dish if you skip it.\nCook the tortilla: Add 2 tablespoons of the drained cooking oil* (back to the skillet over medium-high heat. Pour potato mixture into skillet and flatten the potatoes with a spatula until they’re mostly even. Reduce heat to medium-low. Cook, moving and shimmying the skillet and nudging the egg around (so it runs underneath) for a minute before letting the tortilla cook undisturbed until the top is wet but not very runny, and it is golden underneath.", 
            "Loosen the tortilla with a spatula then slide it onto a large dinner plate.  With your hands in potholders, invert the skillet over the plate, take a deep breath, and flip it back into the skillet. You can do it! Shake the skillet to straighten the tortilla and use a spatula to gently tuck the edges back under, if needed.", 
            "Return the skillet to the stove and cook tortilla to your desired doneness, another 2 to 3 minutes if you like an ever-so-slightly loose center (try it and see if you can go back), 3 to 4 minutes, or until a toothpick inserted into the center comes out dry, for full doneness.\nServe: Slice onto a plate and serve in wedges, hot, cold or at room temperature, plain, or with a dusting of smoked paprika and/or squiggle of aioli or mayo.", 
            "*Save the rest of the cooking in the fridge for future tortillas, or eggs, or potatoes, or anything you want with a faint onion infusion.\n"
        ], 
        "date": "2007-09-10T22:31:50+00:00"
    }, 
    {
        "ingredient_list": [
            "3 russet potatoes (mine were 9 to 10 ounces each)", 
            "1 bundle lacinato kale (aka dinosaur, tuscan or black kale), swiss chard or spinach (10 ounces)", 
            "Coarse salt", 
            "1 tablespoon olive oil", 
            "1 tablespoon butter", 
            "1 large leek", 
            "1 cup coarsely grated cheddar, gruyere or comté, 2/3 cup finely grated parmesan or pecorino, or 1/2 to 2/3 cup cream cheese or goat cheese, softened", 
            "3/4 cup sour cream", 
            "Freshly ground black pepper or red pepper flakes to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/twice-baked-potatoes-with-kale1.jpg?w=640", 
        "tags": [
            "Budget", 
            "Gluten-Free", 
            "Kale", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/12/twice-baked-potatoes-with-kale/", 
        "title": "twice-baked potatoes with kale", 
        "directions": [
            "Heat oven to 400°F (205°C).", 
            "Cook potatoes the first time: Gently scrub potatoes but do not peel. Pierce all over with a fork so that steam escapes [raise your hand if you’ve forgotten to do this and had the pleasure of jumping three inches off the sofa due to an oven ka-pow!] Bake 1 hour to 1 hour 15 minutes or until potatoes are tender when pierced in center with a skewer. Leave oven on.", 
            "Alternatively, you could microwave fork-pierced potatoes for 10, turning them over halfway through to ensure even cooking. You could also boil the whole potato for 15 minutes.", 
            "While potatoes cook, prepare your filling: Tear kale, chard or spinach leaves from stems (you can save the stems for another use, such as a vegetable stock or juicing) and plunge leaves in cold water to remove any residual dirt or grit. No need to dry them when you’re done. Tear leaves into large chunks. Heat a skillet over medium-high and add greens and a pinch of salt. Cook them in the pan with just the water clinging to the leaves until they wilt and collapse. Transfer to a colander and when cool enough to handle, wring out any extra moisture in small fistfuls. On a cutting board, finely chop greens. You should have about a cup of wrung-out, well-chopped greens; don’t worry if you have a little more or less.", 
            "Trim leek down to just yellow and pale green part. Halve lengthwise — if it’s gritty inside, plunge it in cold water to remove grit, then pat dry. Cut leek halves lengthwise again, so that they’re in quarter-stalks, and thinly slice.  ", 
            "Heat a large skillet over medium heat; add butter and oil. Once both are warm, add leek and reduce heat to medium-low. Cook until mostly tender and sweet, about 10 to 15 minutes, stirring occasionally. Try to avoid letting it brown. Add chopped greens back to skillet and warm with leeks, 1 minute. Transfer mixture to a bowl.", 
            "Prepare potatoes: When potatoes are cool enough to handle, halve lengthwise and scoop out all but the last 1/4-inch thickness of skin and potato (essentially, you want to leave a shell inside for stability) and add potato filling to bowl with leeks and greens. Arrange the potato shells on a baking sheet. Mash potatoes, leeks and greens together until smooth. Stir in the sour cream, 3/4 of cheese and more salt and pepper than you think you’ll need. Heap filling in prepared potato skins. Sprinkle with remaining 1/4 of cheese. ", 
            "Bake potatoes a second time: For 20 to 30 minutes, until bronzed and crisp on top. "
        ], 
        "date": "2014-12-01T12:07:44+00:00"
    }, 
    {
        "ingredient_list": [
            "4 pounds potatoes (I like tiny Yukon golds, but you can use whatever boiling potatoes you like for salads)", 
            "1 3/4 cups Greek yogurt (I used full-fat but I think other fat levels would work)", 
            "1/4 cup sour cream", 
            "2 tablespoons freshly squeezed lemon juice (from half a big lemon)", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon minced fresh dill", 
            "1 medium garlic clove, minced", 
            "2 teaspoons kosher salt (I use Diamond brand; use less if you use another, read why here)", 
            "Freshly ground black pepper", 
            "1 hothouse or English cucumber (1 pound), unpeeled but quartered lengthwise, seeds removed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/tzatziki-potato-salad.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/05/tzatziki-potato-salad/", 
        "title": "tzatziki potato salad", 
        "directions": [
            "More ideas for additions: Crumbled feta, chopped green olives, chopped fresh mint leaves or a minced hot chile", 
            "In a medium pot, cover your potatoes with cold water and bring them to a boil over high heat. Once boiling, reduce heat to medium-high and let potatoes simmer until tender enough that they can be pierced easily with a skewer or slim knife. I find that small potatoes tend to be done in roughly 30 minutes from the time I put them on the stove cold, but it’s best to start checking 5 to 10 minutes sooner. Drain potatoes and let them cool completely. (This is a great step to do ahead, as it seems to take potatoes forever to cool. If you’re really in a rush, spread them on a tray and pop them in the freezer for 10 minutes.) ", 
            "Meanwhile, in the bottom of a large bowl, stir together yogurt, sour cream, lemon juice, vinegar, dill, garlic, salt and lots of freshly ground black pepper. ", 
            "Grate the cucumber on a box grater (or in your food processor’s shredding blade, if you like to get things done in one hundredth of the time) and try to remove some of the excess by squeezing out handfuls, pressing it in a mesh sieve with a spoon or wringing it in a square of cheesecloth or a lint-free dishtowel. Add to yogurt mixture. ", 
            "Once potatoes are cool, cut tiny ones into quarters or larger ones into generous chunks. Add to cucumbers and yogurt and stir to coat. Add any extra ingredients desired. Adjust seasonings to taste. Either eat immediately or keep in the fridge for up to three days."
        ], 
        "date": "2012-05-24T15:44:11+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large shallots, 1 halved, 1 finely diced,", 
            "4 sprigs of thyme", 
            "1 small bay leaf", 
            "1 cup dry small green lentils (see Note up top for varieties)", 
            "1 small bay leaf", 
            "Salt and pepper", 
            "1 pound fingerling potatoes", 
            "2 tablespoons red wine vinegar", 
            "1 to 2 garlic cloves, minced or smashed to a paste (I use less)", 
            "1 tablespoon smooth Dijon mustard", 
            "1/4 cup of your favorite olive oil", 
            "2 teaspoons capers, rinsed if salted, drained if brined, and roughly chopped", 
            "2 tablespoons cornichons or other sour gherkins, roughly chopped", 
            "1 to 2 scallions, thinly sliced", 
            "1/2 cup chopped flat leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/01/warm-lentil-and-potato-salad.jpg?w=750", 
        "tags": [
            "Beans", 
            "Lunch", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Side Dish", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/01/warm-lentil-and-potato-salad/", 
        "title": "warm lentil and potato salad", 
        "directions": [
            "Cook lentils: Pick over and rinse lentils. Place them in a small/medium saucepan with the halved shallot, thyme branches, bay leaf, some salt and 4 cups of water. Simmer the lentils over medium heat for 25 to 30 minutes, until firm-tender. Drain (discarding shallot, thyme and bay leaf) and keep warm.", 
            "Meanwhile, cook potatoes: In a separate saucepan, cover potatoes with 1 to 2 inches cold water. Set timer for 15 minutes, then bring potatoes to a simmer. When the timer rings, they should be easily pierced with a toothpick or knife. Drain and keep warm. ", 
            "Make the dressing: Place the chopped shallot and red wine vinegar in the bottom of a small bowl and let sit for 5 minutes. Whisk in minced garlic, dijon, a pinch of salt, a few grinds of black pepper and olive oil. Stir in chopped capers, cornichon and scallions. ", 
            "Assemble salad: Slice potatoes into 1/2-inch segments and place in serving bowl. Add lentils, dressing and all but 1 tablespoon parsley and combine. Adjust seasoning with additional salt and pepper if needed. Scatter salad with remaining parsley. ", 
            "Serve alone, with a soft-cooked egg on top, or as a side to a larger roast, chop or sausages. Reheat as needed. If you plan to make this at the outset of several meals and would like to eat it warm, I’d keep the dressing separate, warming only the lentils and potatoes and stirring in the cold dressing to taste.", 
            "Keeps in fridge for up to 5 days."
        ], 
        "date": "2014-01-21T12:32:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound very large (16 to 20 per pound) shrimp, peeled, de-veined, and rinsed, shells reserved", 
            "1 teaspoon salt", 
            "1 cup dry white wine", 
            "4 peppercorns", 
            "5 coriander seeds", 
            "1/2 bay leaf", 
            "5 sprigs fresh parsley", 
            "1 sprig fresh tarragon", 
            "1teaspoon juice from 1 small lemon", 
            "1 cup ketchup", 
            "2 1/2 teaspoons prepared horseradish (I believed we used slightly more)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "1 teaspoon ancho or other mild chili powder", 
            "Pinch cayenne pepper", 
            "1 tablespoon juice from 1 small lemon", 
            "3 tablespoons good olive oil", 
            "1 small French bread or boule, cut into 1-inch cubes (6 cups)", 
            "1 teaspoon kosher salt", 
            "2 large ripe tomatoes, cut into 1-inch cubes", 
            "1 hothouse cucumber, unpeeled, seeded, and sliced 1/2 inch thick", 
            "1 red bell pepper, seeded and cut into 1-inch cubes", 
            "1 yellow bell pepper, seeded and cut into 1-inch cubes", 
            "1/2 red onion, cut in half and thinly sliced", 
            "20 large basil leaves, coarsely chopped", 
            "3 tablespoons capers, drained", 
            "1 lemon", 
            "4 small\tartichokes", 
            "2/3 cup\theavy cream", 
            "1 teaspoon garlic, finely chopped (about 1 medium clove)", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon ground white pepper", 
            "2 tablespoons olive oil", 
            "6 medium Yukon Gold potatoes", 
            "4 ounces Asiago cheese, grated (I used cave-aged Gruyere, because it’s my favorite)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/when-the-stars-make-you-drool1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Artichokes", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Seafood", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2006/11/when-the-stars-make-you-drool/", 
        "title": "shrimp cocktail + artichoke-potato gratin", 
        "directions": [
            "1.\tBring reserved shells, 3 cups water and salt to boil in medium saucepan over medium-high head; reduced heat to low; cover, and simmer until fragrant, about 20 minutes. Strain stock through sieve, pressing on shells to extract all liquid.", 
            "2.\tBring stock and remaining ingredients except shrimp to boil in 3- or 4-quart saucepan over high heat; boil 2 minutes. Turn off heat and stir in shrimp; cover and let stand until firm and pink, 8 to 10 minutes. Drain shrimp, reserving stock for another use. Plunge shrimp into ice water to stop coking, then draining again. Serve shrimp chilled with cocktail sauce.", 
            "1. Heat the oil in a large saute pan. Add the bread and salt; cook over low to medium heat, tossing frequently, for 10 minutes, or until nicely browned. Add more oil as needed.", 
            "2. For the vinaigrette, whisk together the ingredients.", 
            "3. In a large bowl, mix the tomatoes, cucumber, red pepper, yellow pepper, red onion, basil, and capers. Add the bread cubes and toss with the vinaigrette. Season liberally with salt and pepper.", 
            "4. Serve immediately, or allow the salad to sit for about half an hour for the flavors to blend."
        ], 
        "date": "2006-11-06T17:25:43+00:00"
    }
]