{
  "date": "2008-12-21T20:54:03+00:00",
  "directions": [
    "In a food processor or on a box grater, coarsely shred the potato and onion. For longer strands, lay the potato sideways in the chute of your food processor. Transfer to a colander or wrap in a cheesecloth sling, and squeeze as dry as possible. Let stand for 2 minutes, then squeeze dry again.",
    "In a large bowl, whisk the flour, egg, salt and pepper together. Stir in the potato onion mixture until all pieces are evenly coated.",
    "In a medium skillet, heat 2 tablespoons of vegetable oil until shimmering. Drop packed tablespoons of the potato mixture into the skillet and flatten them with the back of a spoon. Cook the latkes over moderately high heat until the edges are golden, about 1 1/2 minutes; flip and cook until golden on the bottom, about 1 minute. Drain on paper towels. Repeat with the remaining potato mixture, adding more oil to the skillet as needed.",
    "Do ahead: Latkes are a do-ahead-er’s dream. You can also keep latkes warm in the oven for an hour or more, if you’re waiting for stragglers to arrive. Cooked, they keep well in the fridge for a day or two, or in the freezer, well wrapped, for up to two weeks. Reheat them in a single layer on a cookie sheet in a 400 degree oven until they’re crisp again. Bonus: If you undercooked them a bit or didn’t get the browning on them you’d hoped for, you can compensate for this in the oven. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/potato-latkes1.jpg?w=640",
  "ingredient_list": [
    "1 large baking potato (1 pound), peeled",
    "1 small onion (4 ounces), peeled",
    "1/4 cup all-purpose flour",
    "1 large egg, lightly beaten",
    "1 teaspoon salt",
    "1/4 teaspoon freshly ground pepper",
    "Peanut oil, for frying"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Hanukah",
    "Jewish",
    "Pancakes",
    "Photo",
    "Potatoes"
  ],
  "title": "potato pancakes, even better",
  "url": "https://smittenkitchen.com/2008/12/potato-pancakes-even-better/"
}