{
  "date": "2016-02-29T12:04:34+00:00",
  "directions": [
    "Heat oven to 425 degrees F.",
    "Line two baking sheets with foil, for minimal mess. Coat one, the one you’ll use for the yams, with 1 tablespoon olive oil.",
    "Toss yams with honey, 1 tablespoon olive oil and 1/2 tablespoon of pepper flakes. Let sit in bowl for 5 to 10 minutes. Toss chickpeas with 1 tablespoon olive oil, smoked paprika and salt, to taste. ",
    "Spread yams out on olive oil-ed baking sheet in one layer. Season with salt and pepper. Roast for 30 minutes, until nicely toasted underneath. Flip/move wedges around and roast for 5 to 10 more minutes, until soft and singed. For extra color, run them under the broiler for a final minute.",
    "Meanwhile, spread chickpeas on second uncoated baking sheet. Roast in oven for 20 minutes, rolling around once or twice so that they cook evenly, until lightly browned and crispy on the outside. Set aside.",
    "Whisk yogurt, remaining tablespoon olive oil and lime juice together in a small dish, then season with salt and pepper to taste.",
    "Arrange yams on plate or platter, drizzle some of the yogurt over, then about half the chickpeas. Garnish with scallions and remaining pepper flakes, plus flaky sea salt, if you have any. Keep extra chickpeas and yogurt on the side. Dig in."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/roasted-yams-and-chickpeas-with-yogurt1.jpg?w=640",
  "ingredient_list": [
    "3 large yams or orange-fleshed sweet potatoes, cut into 4 lengthwise wedges, or 8, if your yams are very thick",
    "1 to 2 tablespoons honey (I used 1; 2 are called for)",
    "1 tablespoon crushed red-pepper flakes (Espelette are called for; I used mild Aleppo)",
    "1 3/4 cups (1 15-ounce can) chickpeas, drained and patted dry on towels",
    "4 tablespoons olive oil",
    "1/4 teaspoon smoked paprika",
    "Kosher salt and freshly ground black pepper",
    "1/2 cup Greek-style plain yogurt",
    "4 tablespoons fresh lime juice, from approximately 2 limes",
    "2 scallions, both green and white parts, trimmed and thinly sliced, for garnish "
  ],
  "tags": [
    "Photo",
    "Potatoes",
    "Vegetarian",
    "Weeknight Favorite",
    "Winter"
  ],
  "title": "roasted yams and chickpeas with yogurt",
  "url": "https://smittenkitchen.com/2016/02/roasted-yams-and-chickpeas-with-yogurt/"
}