{
  "date": "2010-03-22T11:00:12+00:00",
  "directions": [
    "Make the sauce: Preheat the oven to 375°F. Remove and discard the seeds and stems from the chiles, then soak them in warm water for 15 minutes to soften. Strain the chiles, and pat dry with paper towels. Meanwhile, spread the nuts on a baking sheet and toast for 8 to 10 minutes, until they smell nutty and are golden brown.",
    "Heat a large sauté pan over high heat for 2 minutes. Add 2 tablespoon olive oil, wait a moment (for it to heat) and fry the slice of bread on both sides until golden brown. Remove the bread from the pan and cool. Cut it into 1-inch cubes and set aside.",
    "Return the pan to the stove over high heat. Add 2 tablespoon olive oil and the chiles and sauté for a minute or two. Add the tomatoes. Season with 1/2 teaspoon salt and cook for 2 to 3 minutes, stirring often until the tomato juices have evaporated.  Turn off the heat and leave the mixture in the pan. ",
    "In a food processor, pulse together the toasted nuts, garlic and fried bread until the bread and nuts are coarsely ground. Add the chile-tomato mixture and process for 1 minute more. With the machine running, slowly pour in the remaining 1 cup of olive oil and process until you have a smooth purée. Don’t worry, the romesco will “break” (separate into solids and oil); this is normal. Add the parsley, season to taste with lemon juice, sherry vinegar and more salt, if you feel it needs it. ",
    "Make the potatoes: Place the potatoes in a roasting pan (I used my 12-inch cast iron skillet, which turned out to be a brilliant idea as I could transfer it to the stove and continue cooking there — highly recommended if you have one) and toss well with 2 tablespoons olive oil, garlic cloves, bay leaves, thyme sprigs and a heaping teaspoon of salt. Cover tightly with aluminum foil and roast the potatoes until tender when pierced (this took 30 minutes for my tiny ones, larger ones may need 50). Discard the bay and thyme and squeeze the garlic out of its skin and set aside.",
    "Either transfer potatoes to a large sauté pan or transfer cast iron skillet to stove-top and heat on high for 2 minutes. Pour in the remaining 2 tablespoons oil (you can get away with 1 tablespoon if you are using the same cast-iron you roasted the potatoes in and it is well seasoned) turn the heat to medium-high and wait 1 minute more. Add the potatoes and smash them with your spatula or a fork until a little broken up. Season with thyme leaves, salt and pepper and sauté them for 6 to 8 minutes until they are crispy on one side. (If they are stuck to the pan, don’t try to move them, they will eventually release themselves). After they’ve browned nicely on the first side, turn them until they color on all sides. Spoon the romesco sauce and reserved garlic over the potatoes and stir.  Toss in the parsley. Adjust seasoning if necessary.",
    "Do ahead: Sauce can be made up to 2 weeks in advance and kept in the fridge. Use the extra on sandwiches, with cheese, eggs, grilled fish and roasted meats. One the dish is assembled, if you’re not ready to serve it yet, turn off the heat and leave the potatoes in the pan; just before serving reheat for a few minutes and add the parsley at the last minute.",
    "* Guys, I’m chile clueless. It’s pathetic. Kitchen Market — stocking everything, knowing all — once helped me hide this fact from the public, but in their absence, left to fend for myself, I was only able to find something called New Mexico Red Chiles and you don’t want to know how long (very) I spent trying to figure out whether they were hotter or less hot or bigger or smaller than the chiles I was supposed to use. I ended up using 3 instead of 5, and regretting it as the sauce could have had 5 without being more than just moderately hot. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/romesco-potatoes1.jpg?w=500",
  "ingredient_list": [
    "Romesco Sauce",
    "5 ancho chiles*",
    "2 tablespoons raw almonds",
    "2 tablespoons blanched hazelnuts (or, you can rub their skins off once they are toasted and cooled)",
    "1 1/4 cups extra-virgin olive oil",
    "1 slice country bread, about 1-inch thick",
    "1/3 cup canned San Marzano tomatoes (I bought whole tomatoes, not sure why; I’d use purée next time)",
    "1 clove garlic, chopped",
    "1 tablespoon chopped flat-leaf parsley",
    "1/2 lemon, for juicing",
    "A splash of sherry vinegar (can’t find it? Use a mild wine or balsamic vinegar instead)",
    "Kosher salt",
    "Potatoes",
    "1 1/2 pounds Yukon Gold potatoes (full size or minis work)",
    "1/4 cup extra virgin olive oil",
    "4 to 5 cloves garlic, unpeeled",
    "2 bay leaves",
    "6 springs thyme, plus 2 teaspoons thyme leaves (I left this out, accidentally; it was fine without it)",
    "1 cup Romesco sauce (from above)",
    "2 tablespoons chopped flat-leaf parsley",
    "Kosher salt and freshly ground black pepper"
  ],
  "tags": [
    "Photo",
    "Potatoes",
    "Side Dish",
    "Spanish",
    "Vegan",
    "Vegetarian"
  ],
  "title": "romesco potatoes",
  "url": "https://smittenkitchen.com/2010/03/romesco-potatoes/"
}