{
  "date": "2011-11-22T17:15:25+00:00",
  "directions": [
    "The day before or a couple hours in advance: Preheat oven to 400°F. Place sweet potato on a tray and roast until soft, about 40 to 45 minutes. Let cool completely in skin (the fridge can speed this up) then peel. Either run potato flesh through a potato ricer or mash it until very smooth. You’re looking for 3/4 cup (191 grams) sweet potato puree (I get closer to 1 1/3 cups from 1 pound. Melt some salted butter over any remainder and sprinkle with chives — happy lunch!) ",
    "You’ll probably have turned your oven off by now, so preheat it again to 400°F. Line a baking sheet with parchment paper and set aside. Whisk 3/4 cup reserved sweet potato puree with buttermilk until smoothly combined. Keep nearby.",
    "In the bottom of a large, wide-ish bowl, whisk flours, baking powder, sugar, spices and salt together. If you have a  pastry blender, add the butter (if you have a sturdy pastry blender, no need to chop it first) and use the blender to cut the butter into the flour mixture until the biggest pieces are the size of small peas. If you don’t have a pastry blender, cut the butter into small pieces with a knife and work the butter into the flour mixture with your fingertips until the mixture resembles a coarse meal. ",
    "For both methods, continue by adding the sweet potato mixture and stir and break it up until the mixture is in big, soft chunks. Get your hands in the bowl and gently knead the dough into an even mass, using as few motions as possible (and thus, warming the dough as little as possible.). ",
    "With marshmallows: Roll or pat dough out on a floured counter to a 1/2-inch thickness and divide evenly in half. Sprinkle marshmallows loosely over half of dough. Place the second half on top of marshmallow and use rolling pin to gently press the sides together, keeping the final dough thickness at a full inch. ",
    "Without marshmallows: Roll or pat dough out on a floured counter to a 1-inch thickness. ",
    "Both methods: Dip a 2-inch biscuit cutter in flour then form biscuits by cutting straight down and not twisting — this will help give your biscuits the maximum rise. Bake biscuits on prepared sheet for 13 to 15 minutes, until puffed and slightly golden on top. Cool on rack and enjoy as soon as possible.",
    "Do ahead: Biscuits are best on the first day that they’re baked. To make them ahead of time, arrange cut biscuits on a tray to freeze them. Once frozen, transfer them to a freezer bag until needed. Bake at same temperature straight from freezer; biscuits will take about 2 minutes longer to bake."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sweet-potato-and-marshmallow-biscuits1.jpg?w=500",
  "ingredient_list": [
    "1 pound sweet potatoes (red skinned are my favorite)",
    "1/3 cup (79 ml) buttermilk",
    "2 cups (250 grams) all-purpose flour",
    "1 tablespoon (15 grams) baking powder",
    "3 tablespoons (38 grams) granulated sugar",
    "1 teaspoon ground (2 grams) cinnamon",
    "1/4 teaspoon ground nutmeg",
    "1/4 teaspoon ground ginger",
    "1/8 teaspoon ground cloves",
    "1/2 teaspoon (2 grams) table salt",
    "5 tablespoons (71 grams) unsalted butter, cold",
    "1 cup miniature marshmallows (optional)"
  ],
  "tags": [
    "Fall",
    "Photo",
    "Potatoes",
    "Scones/Biscuits",
    "Thanksgiving"
  ],
  "title": "sweet potato (and marshmallow) biscuits",
  "url": "https://smittenkitchen.com/2011/11/sweet-potato-and-marshmallow-biscuits/"
}