{
  "date": "2009-02-08T08:00:22+00:00",
  "directions": [
    "Cut the core out of the cabbage but leave it whole. Place it, with the empty core area facing up, in a large bowl. Boil a small pot of water and pour the water over the cabbage and let it sit for ten minutes.",
    "Heat the oil in a saute pan. (I like to use the large one I will cook the final dish in — a deep 12-inch saute pan — to save dishes.) Cook the onions until they are soft, add the carrot, celery and parsnip and saute them for a couple extra minutes — until they are also soft. Season the mixture with salt and pepper, transfer it to a bowl and let it cool a bit. Mix in the meat, rice and tomato paste and season again with salt and pepper.",
    "Drain the head of cabbage. Pull off large leaves, cut out the large vein — if the leaf is very large, you can make two rolls from each, if it is smaller, you can cut the vein out partially and pull the sides to overlap before you roll it into one roll. Pat the leaves dry with towels. Roll about 1/4 to 1/3 cup of filling in each leaf (depending on the size of your leaf) and arrange in a large, wide pot. Pour in enough juice or sauce to cover the rolls. Bring to a boil and reduce the heat, letting them simmer covered on the stove on low for about 45 minutes. Serve immediately. If sauce has thinned a bit, you can heat up any additional sauce you didn’t use and pour it over as you serve the rolls.",
    "[These also freeze very well.]"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/alexs-moms-stuffed-cabbage1.jpg?w=500",
  "ingredient_list": [
    "1 head Savoy cabbage",
    "1 pound ground beef",
    "1 small to medium onion, chopped small",
    "2 tablespoons olive oil",
    "1 carrot, shredded",
    "1 celery stalk, thinly sliced",
    "1 parsnip, shredded",
    "1/2 cup uncooked white rice",
    "1 to 2 tablespoons tomato paste",
    "3 to 4 cups of your favorite simple tomato sauce, tomato juice or V8"
  ],
  "tags": [
    "Budget",
    "Cabbage",
    "Freezer Friendly",
    "Meat",
    "Photo",
    "Russian"
  ],
  "title": "alex’s mom’s stuffed cabbage",
  "url": "https://smittenkitchen.com/2009/02/alexs-moms-stuffed-cabbage/"
}