[
    {
        "ingredient_list": [
            "1 head Savoy cabbage", 
            "1 pound ground beef", 
            "1 small to medium onion, chopped small", 
            "2 tablespoons olive oil", 
            "1 carrot, shredded", 
            "1 celery stalk, thinly sliced", 
            "1 parsnip, shredded", 
            "1/2 cup uncooked white rice", 
            "1 to 2 tablespoons tomato paste", 
            "3 to 4 cups of your favorite simple tomato sauce, tomato juice or V8"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/alexs-moms-stuffed-cabbage1.jpg?w=500", 
        "tags": [
            "Budget", 
            "Cabbage", 
            "Freezer Friendly", 
            "Meat", 
            "Photo", 
            "Russian"
        ], 
        "url": "https://smittenkitchen.com/2009/02/alexs-moms-stuffed-cabbage/", 
        "title": "alex’s mom’s stuffed cabbage", 
        "directions": [
            "Cut the core out of the cabbage but leave it whole. Place it, with the empty core area facing up, in a large bowl. Boil a small pot of water and pour the water over the cabbage and let it sit for ten minutes.", 
            "Heat the oil in a saute pan. (I like to use the large one I will cook the final dish in — a deep 12-inch saute pan — to save dishes.) Cook the onions until they are soft, add the carrot, celery and parsnip and saute them for a couple extra minutes — until they are also soft. Season the mixture with salt and pepper, transfer it to a bowl and let it cool a bit. Mix in the meat, rice and tomato paste and season again with salt and pepper.", 
            "Drain the head of cabbage. Pull off large leaves, cut out the large vein — if the leaf is very large, you can make two rolls from each, if it is smaller, you can cut the vein out partially and pull the sides to overlap before you roll it into one roll. Pat the leaves dry with towels. Roll about 1/4 to 1/3 cup of filling in each leaf (depending on the size of your leaf) and arrange in a large, wide pot. Pour in enough juice or sauce to cover the rolls. Bring to a boil and reduce the heat, letting them simmer covered on the stove on low for about 45 minutes. Serve immediately. If sauce has thinned a bit, you can heat up any additional sauce you didn’t use and pour it over as you serve the rolls.", 
            "[These also freeze very well.]"
        ], 
        "date": "2009-02-08T08:00:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 small red cabbage, trimmed, cored, and shredded (about 6 cups)", 
            "1/2 small green cabbage, trimmed, cored, and shredded (about 6 cups)", 
            "1 tablespoon kosher salt, plus more to taste", 
            "1 bunch fresh baby spinach, stemmed and cut into 1/2-inch wide ribbons (about 4 cups loosely packed)", 
            "1/4 cup fresh lime juice (from about 2 small limes)", 
            "1 tablespoon Dijon or other salty prepared mustard", 
            "1/2 teaspoon ground cumin", 
            "1/4 cup peanut oil", 
            "1/2 cup roasted unsalted peanuts, coarsely chopped", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-and-lime-salad-with-roasted-peanuts1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Citrus", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spinach", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/04/cabbage-and-lime-salad-with-roasted-peanuts/", 
        "title": "cabbage and lime salad with roasted peanuts", 
        "directions": [
            "In a large bowl, toss the shredded red and green cabbage with the salt. Transfer the cabbage to a colander and let it drain for two hours. (I was in a rush and did this in one. It was still nicely wilted, but of course could have been even softer.)", 
            "If you’re worried about the cabbage being too salty when you’re done with the salting process, taste a piece of cabbage and if it concerns you, rinse and drain the cabbage well. This is not a suggestion in the original recipe, but something I suspect might bother some people.", 
            "Put the salted, drained cabbage back into your (rinsed and dried) large bowl and add the spinach. In a medium bowl, whisk the lime juice, mustard and cumin together. Add the peanut oil in a thin stream, whisking constantly until the ingredients are thoroughly emulsified. Toss the salad with the dressing and add the roasted peanuts. Season to taste with salt and pepper.", 
            "This salad is best served immediately, but it does keep surprisingly well in the fridge for a day or two. "
        ], 
        "date": "2010-04-28T22:35:23+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry", 
            "1 1/4 cups all-purpose flour", 
            "1/4 teaspoon salt", 
            "8 tablespoons (1 stick) unsalted butter, cut into", 
            "pieces", 
            "1/4 cup sour cream", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup ice water", 
            "For the filling", 
            "2 tablespoons butter", 
            "1 large onion, finely diced", 
            "4 ounces fresh shiitake mushrooms, stems discarded, caps thinly diced", 
            "1 teaspoon chopped thyme or 1/2 teaspoon dried", 
            "1 teaspoon chopped tarragon or 1/2 teaspoon dried", 
            "1 tablespoon chopped dill or 1 teaspoon dried", 
            "6 cups thinly sliced cabbage, preferably Savoy, or 4 cups cabbage plus 2 cups other greens, such as beet, chard, or kale", 
            "salt and freshly milled pepper", 
            "1/4 cup chopped parsley", 
            "1 hard-cooked egg, chopped", 
            "1/4 cup sour cream or yogurt", 
            "1 teaspoon tarragon vinegar", 
            "2 tablespoons melted butter", 
            "For the horseradish sauce", 
            "1/4 cup prepared horseradish", 
            "1 cup yogurt or sour cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-and-mushroom-galette1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Mushrooms", 
            "Photo", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/10/cabbage-and-mushroom-galette/", 
        "title": "cabbage and mushroom galette", 
        "directions": [
            "1. Make pastry: In a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour.", 
            "2. Prepare the filling: Heat the butter in a large skillet over medium heat. Add the onion, mushrooms, and herbs and cook until softened, about 10 minutes. Add the cabbage, 1 teaspoon salt, and 1/2 cup water. Cover and cook slowly until the cabbage is tender, 15 to 20 minutes, turning it occasionally. Add more liquid. When tender, uncover and raise the heat to evaporate any excess moisture. The mixture should be fairly dry. Stir in the parsley, egg, and sour cream. Season with vinegar and taste for salt and pepper.", 
            "3. Assemble galette: Preheat the oven to 400» F. Roll the dough into a large thin circle and set it on the back of a sheet pan or cookie sheet. The edges will hang over the sides. Add the filling, making a mound 7 to 8 inches across, then fold the edges over and brush with the melted butter. Pour any extra butter into the vegetables. Bake until browned, 25 to 30 minutes. While it is baking, mix the horseradish and cream to form a sauce, and season to taste. When galette is done, carefully slide it onto a serving plate. Serve with the horseradish sauce on the side."
        ], 
        "date": "2008-10-26T20:17:15+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/cabbage-and-sausage-casserole1.jpg?w=640", 
        "tags": [
            "Cabbage", 
            "Casserole", 
            "French", 
            "Meat", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/01/cabbage-and-sausage-casserole/", 
        "title": "cabbage and sausage casserole", 
        "directions": [
            "Heat oven to 300 degrees. Bring a large pot of salted water to a boil and butter a 9-by-13-by-2-inch baking dish. If using sausages, remove casings and discard them.", 
            "Place cabbage in boiling water, cover, and let water come back to the boil. Uncover and boil for 3 minutes. Drain cabbage in a colander and run cold water over it to stop cooking. Drain well. ", 
            "Put about 1/3 of the cabbage in buttered dish and cover with 1/2 the meat. Sprinkle with salt and pepper and dot with butter. Repeat, ending with a final layer of cabbage, and dot top with butter.", 
            "Cover dish tightly with a layer of parchment paper (commenters who skipped the parchment said that their vegetables discolored against the foil), then top with a lid or a layer of aluminum foil. Cook for about 2 1/2 hours, until cabbage is soft and sweet, and top is lightly browned. After 2 hours, uncover the dish; if there is a lot of liquid in the bottom, leave uncovered for the rest of the cooking time. If not, re-cover and finish cooking. In our case, there was not a lot of liquid but I hoped to get a little color on the top so left it uncovered for the remaining time."
        ], 
        "date": "2016-01-19T12:03:35+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small savoy cabbage", 
            "1/3 cup walnuts", 
            "2 tablespoons cider vinegar", 
            "1 tablespoon lemon juice", 
            "Salt and pepper", 
            "1/2 cup olive oil", 
            "2 tablespoons creme fraiche or heavy cream (we used sour cream)", 
            "2 apples (any crisp, tasty eating variety, such as Sierra Beauty, Granny Smith, or Fuji)", 
            "1/3 cup crumbled blue cheese (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-apple-and-walnut-salad1.jpg?w=500", 
        "tags": [
            "Apple", 
            "Cabbage", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/11/cabbage-apple-and-walnut-salad/", 
        "title": "cabbage, apple and walnut salad", 
        "directions": [
            "Preheat the oven to 375°F.", 
            "Tear off and discard the tough outer leaves of the cabbage. Cut it in half and cut out its core. Slice the halves crosswise into a fine chiffonade.", 
            "Toast the walnuts in the oven for 8 minutes. While they are still warm, first rub them in a clean dishtowel to remove some of the skins, then chop or coarsely crumble them.", 
            "To prepare the dressing, mix the vinegar with the lemon juice, some salt, and a generous amount of pepper.", 
            "Whisk in the olive oil and then the creme fraiche or cream. Taste and adjust the acid and salt as desired.", 
            "Quarter, peel, and core the apples. Slice the quarters lengthwise fairly thin and cut these slices lengthwise into a julienne. Toss the cabbage, apples, and walnuts (and blue cheese, if you’re using it) with the dressing and an extra pinch of salt. Let the salad sit for 5 minutes, taste again, adjust the seasoning as needed, and serve."
        ], 
        "date": "2008-11-28T23:58:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup gold tequila", 
            "1 cup freshly squeezed lime juice (5 to 6 limes)", 
            "1/2 cup freshly squeezed orange juice (2 oranges)", 
            "1 tablespoon chili powder", 
            "1 tablespoon minced fresh jalapeno pepper (1 pepper seeded)", 
            "1 tablespoon minced fresh garlic (3 cloves)", 
            "2 teaspoons kosher salt", 
            "1 teaspoon freshly ground black pepper", 
            "3 whole (6 split) boneless chicken breasts, skin on*", 
            "Combine the tequila, lime juice, orange juice, chili powder, jalapeno pepper, garlic, salt, and pepper in a large bowl. Add the chicken breasts. Refrigerate overnight. ", 
            "1 cup green onions, coarsely chopped", 
            "1/4 cup red wine vinegar", 
            "2 serrano chiles", 
            "2 tablespoons mayonnaise", 
            "Salt and pepper", 
            "1/2 cup pure olive oil", 
            "1 head purple cabbage, finely shredded", 
            "1 small red onion, halved and thinly sliced", 
            "1/4 cup chopped cilantro leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chicken-jealousy1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Chicken", 
            "Citrus", 
            "Photo", 
            "Salad", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2007/04/chicken-jealousy/", 
        "title": "tequila lime chicken + green onion slaw", 
        "directions": [
            "Blend green onions, vinegar, chiles, mayonnaise, salt, pepper and oil in a blender until emulsified. Place cabbage and red onions in a bowl, add the dressing and stir until combined. Fold in the cilantro and season with salt and pepper to taste.  "
        ], 
        "date": "2007-04-26T16:21:34+00:00"
    }, 
    {
        "ingredient_list": [
            "200 grams (1 1/4 cups) red split lentils (masoor dal), picked over, washed and drained", 
            "1.2 liters (5 cups) water", 
            "1/2 teaspoon ground turmeric", 
            "5 tablespoons vegetable oil", 
            "1 teaspoon cumin seeds", 
            "2 to 4 cloves garlic, peeled and finely chopped", 
            "1 medium onion, peeled and cut into fine slices", 
            "225 grams (1/2 pound) cored and finely shredded cabbage", 
            "1 to 2 fresh, hot green chilies, finely sliced", 
            "1 1/2 teaspoons salt", 
            "1 medium tomato, peeled (ahem, Deb did not peel her tomato) and finely chopped", 
            "1/2 teaspoon peeled, finely grated fresh ginger", 
            "1 (1 3/4-lb) head cauliflower, cut into 3/4-inch-wide florets", 
            "1 1/4 lb Yukon Gold potatoes, peeled and cut into 1/2-inch cubes", 
            "5 tablespoons vegetable oil", 
            "1/2 teaspoon cumin seeds", 
            "3/4 teaspoon salt", 
            "1 medium onion, finely chopped", 
            "2 garlic cloves, finely chopped", 
            "2 teaspoons minced fresh jalapeño, including seeds", 
            "2 teaspoons minced peeled fresh ginger", 
            "1 teaspoon ground cumin", 
            "1/2 teaspoon ground coriander", 
            "1/4 teaspoon turmeric", 
            "1/4 teaspoon cayenne", 
            "1/2 cup water", 
            "1/4 cup finely chopped English (seedless cucumber)", 
            "1 thinly sliced scallion", 
            "3/4 cup yogurt", 
            "1/2 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/confessions-of-a-cumin-junkie1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Cabbage", 
            "Cauliflower", 
            "Gluten-Free", 
            "Indian", 
            "Photo", 
            "Potatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/02/confessions-of-a-cumin-junkie/", 
        "title": "recipes from a cumin junkie", 
        "directions": [
            "Mix!"
        ], 
        "date": "2007-02-26T21:39:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 15-ounce can black beans, drained", 
            "1 teaspoon ground cumin", 
            "5 teaspoons olive oil, divided", 
            "2 tablespoons (or more) fresh lime juice", 
            "2 cups coleslaw mix or shredded cabbage", 
            "2 green onions, thinly sliced", 
            "1/3 cup chopped fresh cilantro", 
            "4 white or yellow corn tortillas", 
            "1/3 cup crumbled feta cheese", 
            "Hot sauce"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/02/crisp-black-bean-tacos.jpg?w=753", 
        "tags": [
            "Beans", 
            "Budget", 
            "Cabbage", 
            "Photo", 
            "Quick", 
            "Tex-Mex", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2009/02/crispy-black-bean-tacos-with-feta-and-slaw/", 
        "title": "crisp black bean tacos with feta and slaw", 
        "directions": [
            "Place beans and cumin in small bowl; partially mash. Season to taste with salt and pepper. Mix 2 teaspoons olive oil and lime juice in medium bowl; add coleslaw, green onions, and cilantro and toss to coat. Season slaw to taste with salt and pepper.", 
            "Heat 1 tablespoon olive oil in large nonstick or cast iron skillet over medium-high heat. Add tortillas in single layer. Spoon 1/4 of bean mixture onto half of each tortilla; cook 1 minute. Fold tacos in half. Cook until golden brown, about 1 minute per side. Fill tacos with feta and slaw. Pass hot sauce alongside, or if your name is Alex, drown your taco in a puddle of it."
        ], 
        "date": "2009-02-02T18:24:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 to 1 1/4 pounds red cabbage (1 small head or half of a large one), sliced very thin", 
            "3 tablespoons olive oil", 
            "2 tablespoons lime or lemon juice (I use lime)", 
            "Salt and red pepper flakes (I used the mild Aleppo variety) to taste", 
            "About 1/2 cup pitted dates, coarsely chopped or sliced", 
            "4 ounces feta, crumbled into chunks", 
            "1 tablespoon chopped flat-leaf parsley", 
            "2 teaspoons well-toasted sesame seeds "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-feta-and-red-cabbage-salad1.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Dates", 
            "Fall", 
            "Gluten-Free", 
            "Photo", 
            "Salad", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/11/date-feta-and-red-cabbage-salad/", 
        "title": "date, feta and red cabbage salad", 
        "directions": [
            "Toss cabbage with olive oil and first tablespoons of lime juice, plus salt and pepper, coating leaves evenly. Taste and add more lime juice, salt and pepper to taste. I do this a few times, making sure I really get this base well seasoned because it will be hard to do it as well later.", 
            "Toss dressed cabbage gently with half of dates and feta. Sprinkle with remaining dates, then feta, then parsley and sesame seeds. Dig in.", 
            "Do ahead: The whole salad can sit assembled for at least an hour, if not longer in the fridge. Mine is going strong on the second day. You can also prepare the parts separately (feta, chopped dates, sliced cabbage) to assemble right before serving, if you’re planning ahead for Thanksgiving or a dinner party."
        ], 
        "date": "2015-11-10T12:01:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 lb green cabbage, cored and cut into 3-inch chunks, then finely chopped or shredded", 
            "1 medium onion, finely chopped", 
            "1 large green bell pepper, finely chopped", 
            "1 large carrot, coarsely grated", 
            "1 1/4 cups mayonnaise", 
            "1/3 cup cider vinegar", 
            "2 teaspoons sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/06/dead-simple-slaw.jpg?w=750", 
        "tags": [
            "Budget", 
            "Cabbage", 
            "Photo", 
            "Round-Up", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/06/dead-simple-slaw-6-heat-wave-reprieves/", 
        "title": "dead simple slaw + 6 heat wave reprieves", 
        "directions": [
            "Toss all vegetables in a large bowl with 1 tsp each of salt and pepper. Whisk together mayonnaise, vinegar, and sugar, then toss with slaw. Chill, covered, stirring occasionally, at least 1 hour (for vegetables to wilt and flavors to blend).", 
            "Do ahead: Slaw can be chilled up to 1 day."
        ], 
        "date": "2008-06-10T11:05:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large savoy cabbage", 
            "7-ounce (200-gram) hunk of bread (see above), crusts cut away, torn into small scraps (you’ll have about 3 loose cups of scraps)", 
            "2/3 cup (approximately 150 ml) whole milk", 
            "14 ounces (400 grams) or approximately 4 plain pork sausages (I used sweet — i.e. non-spicy — Italian), casings removed", 
            "1 small sprig of sage, finely chopped", 
            "1 small sprig of rosemary, finely chopped", 
            "2 tablespoons grated parmesan", 
            "Salt and freshly ground black pepper, to taste", 
            "1 28-ounce can peeled plum tomatoes", 
            "2 tablespoons (30 ml) olive oil", 
            "1 clove garlic, peeled and minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/02/italian-stuffed-cabbage.jpg?w=750", 
        "tags": [
            "Budget", 
            "Cabbage", 
            "Italian", 
            "Meat", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2013/02/italian-stuffed-cabbage/", 
        "title": "italian stuffed cabbage", 
        "directions": [
            "Prepare cabbage: Bring a large pot of salted water to boil. Discard any messy or broken outer cabbage leaves and carefully peel 12 nice, large leaves. (I think the cabbage can tell if you’re in a rush, and will tear more easily. Work carefully. That said, a torn leaf will hardly ruin the dish.) Blanch leaves for about 30 seconds to 1 minute (you can do a few at at time), until wilted, and spread out on towels so that they dry and cool.", 
            "Make filling: Place bread scraps in bottom of large bowl and pour milk over. Let sit for a few minutes, then mash it gently with a spoon until something close to a paste forms. Mix with sausage meat, herbs, parmesan and a pinch or two of salt and black pepper; I find this easiest with a fork or bare hands. ", 
            "Make the cabbage rolls: Lay your first cabbage leaf on the counter. If it doesn’t want to lay flat, pare away some of the thickest stalk (with a paring knife or vegetable peeler) to make it easier. Form some of the filling mixture into a golf ball-sized round. Wrap cabbage leaf around it (see Note about shape up top) and pin at the top with a toothpick. Repeat with remaining leaves and mixture.", 
            "Make the sauce: To prepare your tomatoes, either break them up with your hands (for bigger chunks), run them through a food mill or roughly chop them right in their can with scissors (what I did here). In a heavy saute pan with a lid or a medium (5 to 6-quart) Dutch oven, heat olive oil over medium heat. Add the garlic and saute for about 30 seconds (just until golden, not a moment longer) then add the tomatoes, bringing the sauce to a gently boil. Season with salt if needed. Add cabbage packages, arranging them carefully in the pan so they all fit, cover the pot and gently simmer them for 25 minutes. Remove the toothpicks and carefully turn the rolls over, cooking them for another 25. Remove the lid and simmer for another 10 minutes to cook off some of the wetness. They’re all cooked now, but if you can rest them for another 15 minutes before eating them, the flavors settle and they become even better.", 
            "Okay, now you can dig in. Repeat frequently, yes?"
        ], 
        "date": "2013-02-18T14:48:57+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1/2 small head cabbage, very thinly sliced (1 pound or 5 to 6 cups shreds) which will be easiest on a mandoline if you have one", 
            "4 medium carrots, peeled into ribbons with a vegetable peeler", 
            "5 lacinato kale leaves, ribs removed, leaves cut into thin ribbons", 
            "4 scallions, thinly sliced on an angle", 
            "1 teaspoon kosher salt", 
            "1/2 cup all-purpose flour", 
            "6 large eggs, lightly beaten", 
            "Canola, safflower or peanut oil for frying", 
            "Tangy Sauce", 
            "1/4 cup ketchup", 
            "1 1/2 tablespoons Worcestershire sauce (note: this is not vegetarian)", 
            "1/4 teaspoon dijon mustard", 
            "1 tablespoon rice cooking wine or sake", 
            "1 teaspoon soy sauce", 
            "1 tablespoon honey (use 2 if you like a sweeter sauce)", 
            "1/8 teaspoon ground ginger"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/japanese-vegetable-pancakes.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cabbage", 
            "Carrots", 
            "Japanese", 
            "Kale", 
            "Lunch", 
            "Pancakes", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/05/japanese-cabbage-and-vegetable-pancakes/", 
        "title": "japanese vegetable pancakes", 
        "directions": [
            "Make the pancakes: Toss cabbage, carrot, kale, scallions and salt together in a large bowl. Toss mixture with flour so it coats all of the vegetables. Stir in the eggs. Heat a large heavy skillet on medium-high heat. Coat the bottom with oil and heat that too. ", 
            "To make a large pancake, add 1/4 of the vegetable mixture to the skillet, pressing it out into a 1/2- to 3/4-inch pancake. Gently press the pancake down flat. Cook until the edges beging to brown, about 3 minutes. 30 seconds to 1 minute later, flip the pancake with a large spatula. (If this is terrifying, you can first slide the pancake onto a plate, and, using potholders, reverse it back into the hot skillet.) Cook on the other side until the edges brown, and then again up to a minute more (you can peek to make sure the color is right underneath).", 
            "To make small pancakes, you can use tongs but I seriously find using my fingers and grabbing little piles, letting a little batter drip back into the bowl, and depositing them in piles on the skillet easier, to form 3 to 4 pancakes. Press down gently with a spatula to they flatten slightly, but no need to spread them much. Cook for 3 minutes, or until the edges brown. Flip the pancakes and cook them again until brown underneath. ", 
            "Regardless of pancake size, you can keep them warm on a tray in the oven at 200 to 250 degrees until needed. ", 
            "If desired, make okonomiyaki sauce: Combine all sauce ingredients in a small saucepan and let simmer for 3 to 5 minutes, until smooth and thick. ", 
            "Serve pancakes with sauce and any of the other fixings listed above, from Japanese mayo to scallions and toasted sesame seeds. ", 
            "Do ahead: Extra pancakes will keep in the fridge for a couple days, or can be spread on a tray in the freezer until frozen, then combined in a freezer bag to be stored until needed. Reheat on a baking sheet in a hot oven until crisp again."
        ], 
        "date": "2013-05-15T11:01:47+00:00"
    }, 
    {
        "ingredient_list": [
            "2 mangoes, peeled, pitted and julienned", 
            "1 to 1 1/4 pounds Napa cabbage, halved and sliced very thinly", 
            "1 red pepper, julienned", 
            "1/2 red onion, thinly sliced", 
            "6 tablespoons of fresh lime juice, from about two limes", 
            "1/4 cup rice vinegar", 
            "2 tablespoons oil of your choice", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon red pepper flakes, or to taste (or omit this and whisk in a chile paste to taste)", 
            "1/4 cup thinly sliced fresh mint leaves", 
            "1/4 cup toasted cashews, coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/mango-slaw-with-cashews-and-mint.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Mango", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2010/07/mango-slaw-with-cashews-and-mint/", 
        "title": "mango slaw with cashews and mint", 
        "directions": [
            "Toss mangoes, cabbage, pepper and onion in a large bowl. Whisk lime juice, vinegar, oil, salt and red pepper in a smaller bowl and pour over slaw. You can either serve this immediately or leave the flavors to muddle for an hour in the fridge. Before serving, toss with mint leaves and sprinkle with cashews.", 
            "About your mango: This salad will work with almost any variety or ripeness of mango, whether sour or sweet. Use the one you can get, or that you enjoy the most. In general, a firmish not overly ripe mango (unlike the very ripe, sweet one I used) holds up best but all will be delicious in this salad."
        ], 
        "date": "2010-07-08T12:58:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup well-shaken buttermilk", 
            "2 tablespoons mayonnaise", 
            "2 tablespoons cider vinegar", 
            "2 tablespoons minced shallot", 
            "1 tablespoon sugar", 
            "3 tablespoons finely chopped chives", 
            "1 pound Napa cabbage, cored and thinly sliced crosswise (4 cups)", 
            "6 radishes, diced", 
            "2 celery ribs, thinly sliced diagonally"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/napa-cabbage-salad-with-buttermilk-dressing.jpg?w=751", 
        "tags": [
            "Cabbage", 
            "Photo", 
            "Picnics", 
            "Radishes", 
            "Salad", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2008/07/napa-cabbage-salad-with-buttermilk-dressing/", 
        "title": "napa cabbage salad with buttermilk dressing", 
        "directions": [
            "Whisk together buttermilk, mayonnaise, vinegar, shallot, sugar, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a large bowl until sugar has dissolved, then whisk in chives.", 
            "Toss cabbage, radishes, and celery with dressing."
        ], 
        "date": "2008-07-31T12:22:28+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups (415 grams or 15 ounces) mayonnaise, low-fat is fine, as is swapping half with yogurt", 
            "1/4 cup smooth (60 grams) Dijon mustard", 
            "3 tablespoons (45 grams) whole grain mustard (I use whole grain Dijon)", 
            "2 tablespoons (30 ml) apple cider vinegar", 
            "1 teaspoon celery seed", 
            "1/2 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "1 1/2 cups (170 grams or 6 ounces) crumbled blue cheese (optional)", 
            "1/2 of a small head (about 430 grams or 15 ounces for half) green cabbage", 
            "1/2 small (about 375 grams or 13 ounces for half) head red cabbage", 
            "1 giant carrot (about 6 ounces) or 4 slim ones, scrubbed or peeled and shredded", 
            "1 cup chopped fresh parsley leaves or 1 cup slivered kale leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/not-your-mamas-coleslaw.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2006/11/not-your-mamas-coleslaw/", 
        "title": "not your mama’s coleslaw", 
        "directions": [
            "Make the dressing: Mix the mayonnaise, mustards, vinegar, celery seed, salt, and pepper in a smaller bowl. Stir in blue cheese, if using.", 
            "Prepare the vegetables: Halve the cabbage halves and cut out the cores. Slice the cabbage as thinly as you can with a sharp knife, on a mandoline, or with a food processor’s slicing blade (lay the cabbage horizontally in the feed tube). Transfer chopped cabbage into a large bowl, fishing out any very large pieces and slicing them thinly by hand. Stir in the shredded carrot. If you’re going to dress this later, this is the best stopping point.", 
            "To serve: Up to an hour before you’ll eat the slaw, toss the cabbage mixture with dressing to taste –- you will want to start with half and add more as needed — and parsley. Adjust seasonings as needed.", 
            "Note: No matter how gargantuan the salad looks right now, it will soon wilt down a bit and yield moderate portions for 8 to 10 people.\n"
        ], 
        "date": "2006-11-01T14:37:22+00:00"
    }, 
    {
        "ingredient_list": [
            "Brine", 
            "1 1/2 cups white vinegar", 
            "1 1/2 cups water", 
            "1/3 cup granulated sugar", 
            "1/2 teaspoon celery seed", 
            "1 tablespoon plus 2 teaspoons kosher salt* plus more to taste  ", 
            "Salad", 
            "1 small head (2 pounds) green cabbage", 
            "1 red bell pepper", 
            "1 carrot (I used only 1/2 my very thick one)", 
            "1 kirby cucumber"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/pickled-cabbage-salad1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cabbage", 
            "Gluten-Free", 
            "Photo", 
            "Pickled", 
            "Salad", 
            "Side Dish", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/11/pickled-cabbage-salad/", 
        "title": "pickled cabbage salad", 
        "directions": [
            "Mix brine ingredients in the bottom of a medium bowl and set aside. ", 
            "Prepare your vegetables: Trim and core cabbage and slice thinly with a knife, food processor slicing blade or adjustable-blade slicer. Place in a large bowl. Core, seed and thinly slice red pepper; peel and thinly slice or julienne carrot; thinly slice cucumber (I quartered mine first). Add vegetables to cabbage bowl.", 
            "By the time you’re done preparing your vegetables, the sugar and salt should in the pickling mixture should have dissolved. If not, whisk a few times until they do. Taste and adjust if you’d like it a little saltier — I added 1 more teaspoon of kosher salt in the end. ", 
            "Pour pickling brine over vegetables and cover bowl with a lid or plastic wrap. Refrigerate for 1 hour or up to 1 week. Salad becomes more pickled as it rests. Eat with everything. ", 
            "* Not all salts are weighted equally: Read more here. I used Morton brand, which for 1 tablespoon plus 2 teaspoons clocks in at 24 grams. If using table or fine sea salt, use only 4 teaspoons. "
        ], 
        "date": "2014-11-10T11:46:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup chopped red onion", 
            "1/4 cup roughly chopped capers", 
            "1/4 cup chopped cornichons, plus 2 tablespoons of the juice", 
            "1 tablespoon Dijon mustard", 
            "2 cups mayonnaise (the book recommends Hellmans, amusingly enough)", 
            "3/4 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "5 tablespoons sherry vinegar", 
            "1/2 teaspoon sugar", 
            "5 cups julienned Savoy or green cabbage (or 3 cups red cabbage, julienned, and 2 cups green cabbage for a more colorful presentation)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/slaw-tartare1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Disasters", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/05/slaw-tartare/", 
        "title": "slaw tartare", 
        "directions": [
            "Mix everything but the cabbage in a small bowl. In a larger one, toss the cabbage with as much dressing as you like. Adjust the salt and pepper to taste. Refrigerating a couple hours before serving allows the flavors to meld well, and the cabbage to soften slightly."
        ], 
        "date": "2009-05-21T12:18:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound pork butt, cut into small cubes", 
            "1 1/2 quarts chicken stock", 
            "4 cups water", 
            "3 allspice berries", 
            "3 bay leaves", 
            "1 tablespoon dried marjoram", 
            "1 cup sauerkraut, plus around 4 tablespoons juice", 
            "1 large potato, peeled and diced", 
            "2 carrots, minced", 
            "3 stalks celery, minced", 
            "1 small onion, diced", 
            "2 cups fresh cabbage, shredded thin"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/veselkas-cabbage-soup1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/11/veselkas-cabbage-soup/", 
        "title": "veselka’s cabbage soup", 
        "directions": [
            "Place the pork in a medium stockpot with the chicken stock, water, allspice, bay leaves, and marjoram. Bring to a boil and then simmer on low heat for about 2 hours. Remove the pork and set aside on a plate to cool. Skim fat from stock, leaving a few “eyes” of fat for flavor.", 
            "Add sauerkraut and simmer for 20 minutes. Add potato and simmer for 5 minutes. Add the carrots, celery, onion, and cabbage and simmer for 20 minutes. Add the pork and simmer for 10 more minutes. Season with salt and pepper. Add sauerkraut juice."
        ], 
        "date": "2008-11-30T23:20:25+00:00"
    }
]