{
  "date": "2006-11-01T14:37:22+00:00",
  "directions": [
    "Make the dressing: Mix the mayonnaise, mustards, vinegar, celery seed, salt, and pepper in a smaller bowl. Stir in blue cheese, if using.",
    "Prepare the vegetables: Halve the cabbage halves and cut out the cores. Slice the cabbage as thinly as you can with a sharp knife, on a mandoline, or with a food processor’s slicing blade (lay the cabbage horizontally in the feed tube). Transfer chopped cabbage into a large bowl, fishing out any very large pieces and slicing them thinly by hand. Stir in the shredded carrot. If you’re going to dress this later, this is the best stopping point.",
    "To serve: Up to an hour before you’ll eat the slaw, toss the cabbage mixture with dressing to taste –- you will want to start with half and add more as needed — and parsley. Adjust seasonings as needed.",
    "Note: No matter how gargantuan the salad looks right now, it will soon wilt down a bit and yield moderate portions for 8 to 10 people.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/not-your-mamas-coleslaw.jpg?w=750",
  "ingredient_list": [
    "2 cups (415 grams or 15 ounces) mayonnaise, low-fat is fine, as is swapping half with yogurt",
    "1/4 cup smooth (60 grams) Dijon mustard",
    "3 tablespoons (45 grams) whole grain mustard (I use whole grain Dijon)",
    "2 tablespoons (30 ml) apple cider vinegar",
    "1 teaspoon celery seed",
    "1/2 teaspoon kosher salt",
    "1/2 teaspoon freshly ground black pepper",
    "1 1/2 cups (170 grams or 6 ounces) crumbled blue cheese (optional)",
    "1/2 of a small head (about 430 grams or 15 ounces for half) green cabbage",
    "1/2 small (about 375 grams or 13 ounces for half) head red cabbage",
    "1 giant carrot (about 6 ounces) or 4 slim ones, scrubbed or peeled and shredded",
    "1 cup chopped fresh parsley leaves or 1 cup slivered kale leaves"
  ],
  "tags": [
    "Cabbage",
    "Gluten-Free",
    "Photo",
    "Picnics",
    "Salad"
  ],
  "title": "not your mama’s coleslaw",
  "url": "https://smittenkitchen.com/2006/11/not-your-mamas-coleslaw/"
}