{
  "date": "2015-01-26T12:05:48+00:00",
  "directions": [
    "Heat oven to 350°F (175°C). Line a baking sheet with parchment paper or a silicone mat. ",
    "In a large skillet over medium heat, melt 1 tablespoon butter and add olive oil. Add the onions, reduce the heat to low and place a lid on top, letting them steam for about 10 minutes, stirring occasionally. Remove the lid and continue to cook the onions, stirring occasionally, until they’re deep brown about 10 to 20 more minutes. If, for whatever reason, your onions need more time, up to 10 minutes more, don’t fret, they’ll only be more delicious for it. (Mine took a total of 22 minutes, but my stove at the lowest setting is closer to what I’d call medium, so things cook/brown too quickly.) Set aside to cool. ",
    "In a medium bowl or the workbowl of a food processor, combine flour, sugar, baking powder, baking soda and salt. Dice 8 tablespoons remaining cold butter into 1/2-inch bits. If proceeding by hand, use your fingertips or a pastry blender to work the butter into the flour mixture until the mixture is crumbly with butter in pieces no larger than a small pea. If proceeding in a food processor, add the butter and pulse the machine in short bursts until you get the same texture, then transfer the butter-flour mixture back to a medium bowl. ",
    "Stir in diced cheese. Pour buttermilk over cooled onions and stir to combine. Add buttermilk-onion mixture to bowl and stir until combined. It’s going to seem a little dry and will help to use your hands to knead it together a few times in the bowl; don’t worry if a couple floury spots remain. Turn the dough out onto a floured counter and roll out to a 1-inch thickness. Use a floured 3-inch cutter to stamp out circles and space them apart on prepared baking sheet. Gather the scrap and re-roll them as needed. Sprinkle biscuits with sea salt and pepper and bake until the scones are deep golden-brown and the cheese is melted and bubbly around the edges, 20 to 23 minutes.",
    "Eat warm. They’re best on the first day, but if any survive it, they will taste better re-warmed on day two."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/caramelized-onion-and-gruyere-biscuits1.jpg?w=750",
  "ingredient_list": [
    "9 tablespoons (127 grams) cold unsalted butter",
    "1 tablespoon olive oil",
    "2 small onions, halved and thinly sliced",
    "2 3/4 cups (345 grams) all-purpose flour",
    "1 tablespoon (15 grams) granulated sugar",
    "2 teaspoons baking powder",
    "1 teaspoon baking soda",
    "3/4 teaspoon coarse or kosher salt",
    "4 ounces (about 1 cup or 115 grams) gruyère or another Swiss-style cheese in 1/2-inch cubes",
    "1 cup buttermilk (or make your own)",
    "Flaky sea salt",
    "Freshly ground black pepper "
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Onions",
    "Photo",
    "Scones/Biscuits"
  ],
  "title": "caramelized onion and gruyère biscuits",
  "url": "https://smittenkitchen.com/2015/01/caramelized-onion-and-gruyere-biscuits/"
}