[
    {
        "ingredient_list": [
            "2 pounds cipollini or small (1 1/2-inch) onions", 
            "4 tablespoons virgin olive oil", 
            "3 tablespoons sweet butter", 
            "2 tablespoons sugar", 
            "1 cup balsamic vinegar", 
            "1/2 cup tomato sauce of your choice (I cheated and used canned. Don’t tell!)", 
            "1 cup water", 
            "1 teaspoon chopped fresh rosemary leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/balsamic-glazed-sweet-and-sour-cippoline1.jpg?w=500", 
        "tags": [
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/09/balsamic-glazed-sweet-and-sour-cippoline/", 
        "title": "balsamic-glazed sweet and sour cipollini", 
        "directions": [
            "Blanche the onions in boiling water for one minute and let them cool so that they can easily be peeled. Peel the onions, leaving and washing any root strand you may find.", 
            "In a 12 to14-inch saute pan over a medium high flame, heat virgin olive oil until just smoking. Add butter and cook until foam subsides. Add onions and saute until light golden brown on all sides, about 8 to 10 minutes. [Batali doesn’t mention this but listen to me and my messily-splattered walls, floor, ceiling and arms that still hurt at the thought of it: this will splatter a lot. You either want to use a splatter screen, should you be savvy enough to have one, or a lid. Consider yourself warned.]", 
            "Add sugar, vinegar, tomato sauce and water and bring to a boil. Cook onions uncovered covered (again, the splatter effect is such that a lid is worth using) until just al dente, about 10 minutes. If liquid dissipates too quickly, add more water, a 1/4 cup at a time, realizing that it is essential not to overcook the onions. The sauce should just adhere to the onions. Remove from saute pan to an earthenware dish and hold in a warm place, or allow to cool if you are serving them later or as an antipasto. Sprinkle with rosemary as a garnish."
        ], 
        "date": "2008-09-23T14:16:35+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 large red onion, diced small", 
            "2 tablespoons red wine vinegar", 
            "2 teaspoons ground sumac", 
            "1/4 teaspoon kosher salt, plus more to season salad", 
            "2 cups shredded brussels sprouts", 
            "1/2 cup fresh pomegranate seeds (from about 1/2 a large one)", 
            "1/2 a large unpeeled apple, cored and diced (I used Granny Smith, the book recommends Pink Lady or Honeycrisp)", 
            "Juice of half a lemon, plus more to taste", 
            "1 1/2 to 2 tablespoons honey, plus more to taste", 
            "1/4 cup olive oil", 
            "3/4 cup toasted, cooled walnuts, lightly crushed or coarsely chopped", 
            "Ground chipotle chile pepper, urfa biber peppers, hot smoked paprika or another chile flake, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad.jpg?w=750", 
        "tags": [
            "Apple", 
            "Brussels Sprouts", 
            "Fall", 
            "Gluten-Free", 
            "Onions", 
            "Photo", 
            "Pomegranate", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Tips", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad/", 
        "title": "brussels sprouts, apple and pomegranate salad", 
        "directions": [
            "Make the sumac-pickled onions: Combine red onion, wine vinegar, sumac and 1/4 teaspoon kosher salt in a small dish and set aside while you prepare the other ingredients, or ideally at least 15 minutes.\nCombine all salad ingredients, including red onions and their pickling liquid, in a medium bowl and season to taste with salt and red pepper. Taste and adjust ingredients as desired — I’ve seen versions of the recipe with more honey, olive oil and lemon; I didn’t need them but you might find you do.\nThis salad can be prepped ahead, but I’d keep the dressing off of it until at most an hour before serving so it doesn’t discolor the sprouts."
        ], 
        "date": "2016-11-21T13:06:43+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups all-purpose flour", 
            "1/4 teaspoon salt", 
            "8 tablespoons (1 stick) unsalted butter, cut into", 
            "pieces", 
            "1/4 cup sour cream or plain yogurt", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup ice water", 
            "For the filling:", 
            "1 small butternut squash (about one pound)", 
            "2 tablespoons olive oil", 
            "1 to 2 tablespoons butter (if you have only non-stick, the smaller amount will do)", 
            "1 large onion, halved and thinly sliced in half-moons", 
            "1 teaspoon salt", 
            "Pinch of sugar", 
            "1/4 teaspoon cayenne, or to taste", 
            "3/4 cup fontina cheese (about 2 1/2 ounces), grated or cut into small bits", 
            "1 1/2 teaspoons chopped fresh sage leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/10/butternut-squash-and-caramelized-onion-galette.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Onions", 
            "Photo", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2007/10/butternut-squash-and-caramelized-onion-galette/", 
        "title": "butternut squash and caramelized onion galette", 
        "directions": [
            "1.\tMake pastry: In a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour.", 
            "2.\tPrepare squash: Preheat oven to 375 degrees F. Peel squash, then halve and scoop out seeds. Cut into a 1/2-inch dice. Toss pieces with olive oil and a half-teaspoon of the salt and roast on foil lined (for neatness sake) sheet for 30 minutes or until pieces are tender, turning it midway if your oven bakes unevenly. Set aside to cool slightly. ", 
            "3.\tCaramelize onions: While squash is roasting, melt butter in a heavy skillet and cook onion over low heat with the remaining half-teaspoon of salt and pinch of sugar, stirring occasionally, until soft and lightly golden brown, about 20 minutes. Stir in cayenne. ", 
            "4.\tRaise the oven temperature to 400 degrees. Mix squash, caramelized onions, cheese and herbs together in a bowl.", 
            "5.\tAssemble galette: On a floured work surface, roll the dough out into a 12-inch round. Transfer to an ungreased baking sheet. Spread squash, onions, cheese and herb mixture over the dough, leaving a 1 1/2-inch border. Fold the border over the squash, onion and cheese mixture, pleating the edge to make it fit. The center will be open.", 
            "6.\tBake until golden brown, 30 to 40 minutes. Remove from the oven, let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature. Serves 6."
        ], 
        "date": "2007-10-11T09:30:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (6 ounces) coarse cornmeal (also packaged as “polenta”) but regular old cornmeal will also work.", 
            "2 cups (16 ounces) buttermilk", 
            "1 to 2 tablespoons oil, butter or a combination thereof", 
            "1 cup onion in a 3/4-inch dice (I think you could also go up to 2 cups, if you’re really into the caramelized onion thing)", 
            "1 3/4 cups (8 ounces) unbleached, all-purpose flour", 
            "1 1/2 tablespoons (.75 ounce) baking powder", 
            "1/4 teaspoon (.05 ounce) baking soda", 
            "1 teaspoon (.25 ounce) salt", 
            "6 ounce log of goat cheese, at room temperature for a good while, so it’s very soft", 
            "2 tablespoons (1.5 ounces) honey", 
            "1/4 cup (2 ounces) granulated sugar", 
            "3 large (5 ounces) eggs, at room temperature", 
            "2 tablespoons (1 ounce) unsalted butter, mleted", 
            "2 1/2 cups (16 ounces) fresh or frozen corn kernels", 
            "2 tablespoons (1 ounce) bacon fat, vegetable oil or butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/caramelized-onion-and-goat-cheese-cornbread1.jpg?w=500", 
        "tags": [
            "Bread", 
            "Onions", 
            "Photo", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2009/03/caramelized-onion-and-goat-cheese-cornbread/", 
        "title": "caramelized onion and goat cheese cornbread", 
        "directions": [
            "The night before baking the cornbread, soak the cornmeal in the buttermilk. Cover and leave at room temperature overnight. [Though this step is optional, you might appreciate it if you use coarse cornmeal or if you often find cornbread on the gritty side.] If you don’t do this in advance, mix them in before you start the next step.", 
            "Preheat the oven to 350°F.", 
            "The next day, prepare the onions. Heat a large saute pan to medium and coat the bottom with 1 to 2 tablespoons of oil, butter or a combination thereof. Add the onions and cook them until they’re well-caramelized with browned edges. Season with salt and set aside.", 
            "Sift together the flour, baking powder, baking soda and salt and set aside.", 
            "In a large mixing bowl, beat the goat cheese until fluffy. Add the eggs, one at a time and scraping down the bowl between each. (It may look a little curdly at this point, don’t worry. It all comes back together in the oven.) Add the melted butter, honey, sugar and cornmeal/buttermilk mixture and mix until smooth. Add the flour mixture and stir until combined and then gently stir in the corn kernels, mixing them until the ingredients are evenly distributed.", 
            "Place two tablespoons of bacon fat, vegetable oil or butter in a 10 inch round cake pan (you can also use a cast-iron skillet, 9 by 13-inch baking pan or a 12-inch square pan). Place the pan in the oven for 5 to 7 minutes, until the fat gets very hot. With good pot holders, remove the pan and tilt it to grease the corners and sides. Pour in the batter, spreading it evenly and sprinkle the caramelized onion evenly over the top.", 
            "Bake for about 30 minutes, or until the cornbread is firm and springing (the baking time will depend on the size and type of pan) and a toothpick inserted into the center comes out clean.", 
            "Allow the bread to cool in the pan for at least 15 minutes before slicing it into squares or wedges. Serve immediately."
        ], 
        "date": "2009-03-18T13:49:47+00:00"
    }, 
    {
        "ingredient_list": [
            "9 tablespoons (127 grams) cold unsalted butter", 
            "1 tablespoon olive oil", 
            "2 small onions, halved and thinly sliced", 
            "2 3/4 cups (345 grams) all-purpose flour", 
            "1 tablespoon (15 grams) granulated sugar", 
            "2 teaspoons baking powder", 
            "1 teaspoon baking soda", 
            "3/4 teaspoon coarse or kosher salt", 
            "4 ounces (about 1 cup or 115 grams) gruyère or another Swiss-style cheese in 1/2-inch cubes", 
            "1 cup buttermilk (or make your own)", 
            "Flaky sea salt", 
            "Freshly ground black pepper "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/caramelized-onion-and-gruyere-biscuits1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Onions", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2015/01/caramelized-onion-and-gruyere-biscuits/", 
        "title": "caramelized onion and gruyère biscuits", 
        "directions": [
            "Heat oven to 350°F (175°C). Line a baking sheet with parchment paper or a silicone mat. ", 
            "In a large skillet over medium heat, melt 1 tablespoon butter and add olive oil. Add the onions, reduce the heat to low and place a lid on top, letting them steam for about 10 minutes, stirring occasionally. Remove the lid and continue to cook the onions, stirring occasionally, until they’re deep brown about 10 to 20 more minutes. If, for whatever reason, your onions need more time, up to 10 minutes more, don’t fret, they’ll only be more delicious for it. (Mine took a total of 22 minutes, but my stove at the lowest setting is closer to what I’d call medium, so things cook/brown too quickly.) Set aside to cool. ", 
            "In a medium bowl or the workbowl of a food processor, combine flour, sugar, baking powder, baking soda and salt. Dice 8 tablespoons remaining cold butter into 1/2-inch bits. If proceeding by hand, use your fingertips or a pastry blender to work the butter into the flour mixture until the mixture is crumbly with butter in pieces no larger than a small pea. If proceeding in a food processor, add the butter and pulse the machine in short bursts until you get the same texture, then transfer the butter-flour mixture back to a medium bowl. ", 
            "Stir in diced cheese. Pour buttermilk over cooled onions and stir to combine. Add buttermilk-onion mixture to bowl and stir until combined. It’s going to seem a little dry and will help to use your hands to knead it together a few times in the bowl; don’t worry if a couple floury spots remain. Turn the dough out onto a floured counter and roll out to a 1-inch thickness. Use a floured 3-inch cutter to stamp out circles and space them apart on prepared baking sheet. Gather the scrap and re-roll them as needed. Sprinkle biscuits with sea salt and pepper and bake until the scones are deep golden-brown and the cheese is melted and bubbly around the edges, 20 to 23 minutes.", 
            "Eat warm. They’re best on the first day, but if any survive it, they will taste better re-warmed on day two."
        ], 
        "date": "2015-01-26T12:05:48+00:00"
    }, 
    {
        "ingredient_list": [
            "6 tablespoons (3/4 stick) unsalted butter", 
            "2 pounds fresh shallots, peeled, with roots intact", 
            "3 tablespoons sugar", 
            "3 tablespoons good red wine vinegar", 
            "1/2 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "2 tablespoons chopped fresh flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/caramelized-shallots1.jpg?w=640", 
        "tags": [
            "Easter", 
            "Onions", 
            "Photo", 
            "Spring", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/04/caramelized-shallots/", 
        "title": "caramelized shallots", 
        "directions": [
            "Preheat the oven to 400 degrees F.", 
            "Melt the butter in a 12-inch ovenproof* saute pan, add the shallots and sugar, and toss to coat. Cook over medium heat for 10 minutes, tossing occasionally, until the shallots start to brown. Add the vinegar, salt, and pepper and toss well.", 
            "Place the saute pan in the oven and roast for 15 to 30 minutes, depending on the size of the shallots, until they are tender. Season, to taste, sprinkle with parsley, and serve hot.", 
            "* If yours, like mine, is not ovenproof, it works to start this dish in your frying pan then scrape the shallots and sauce into a baking dish when it’s ready to go in the oven."
        ], 
        "date": "2008-04-14T10:05:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small head of cauliflower (about 1 pound) or 1 pound of a larger head of cauliflower, cut into 1-inch flowerets (Romanesco cauliflower, especially orange or green, would be a pretty substitute)", 
            "3 1/2 tablespoons olive oil", 
            "1 tablespoon truffle oil or a few pinches of truffle salt (optional) (see Notes below)", 
            "1 refrigerated pie crust or a homemade tart shell (recipe below)", 
            "1 large onion, halved lenghtwise and thinly sliced", 
            "1 tablespoon Dijon mustard", 
            "2 large eggs", 
            "1 (7- to 8- ounce) container mascarpone cheese (see Note below for suggested substitutions)", 
            "1/2 cup whipping cream (although any low- or full-fat milk or light cream will work as well)", 
            "1/4 teaspoon ground white or black pepper", 
            "Pinch of ground nutmeg", 
            "1 cup grated Gruyère cheese (Swiss or Comté are great swaps)", 
            "1/3 cup Parmesan cheese", 
            "1 1/4 cups flour", 
            "1 tablespoon plus 2 teaspoons cornstarch", 
            "1/4 teaspoon salt", 
            "6 tablespoons butter, diced", 
            "1 egg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/02/cauliflower-and-caramelized-onion-tart.jpg?w=753", 
        "tags": [
            "Cauliflower", 
            "Freezer Friendly", 
            "Onions", 
            "Photo", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2010/02/cauliflower-and-caramelized-onion-tart/", 
        "title": "cauliflower and caramelized onion tart", 
        "directions": [
            "In a large bowl, combine the flour, cornstarch and one-fourth teaspoon salt. Cut the butter in with a pastry blender, fork or two knives until it is in very tiny bits. Add one egg and mix with a fork until a dough forms. If this does not happen easily, toss it out onto a counter and knead it together. This dough is rather tough but with a little elbow grease, it does come together nicely. (Dough can also be made in a food processor, or as the original recipe suggests, in a stand mixer, though I have not tested in in the latter.)", 
            "On a lightly floured surface, roll the dough out to a 12-inch circle. Place the dough in a 9-inch pie plate or tart pan and press to remove any air bubbles. Crimp the edges, and refrigerate for 30 minutes. Proceed with a filling of your choice, no parbaking required."
        ], 
        "date": "2010-02-19T12:26:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            "Zest and juice of 1 lemon", 
            "3 cloves garlic, minced", 
            "1 1/2 teaspoon kosher salt", 
            "3/4 teaspoon paprika", 
            "1/4 teaspoon hot smoked paprika, plus more to taste", 
            "1 1/2 teaspoons dried oregano, crumbled", 
            "Freshly ground black pepper", 
            "10 boneless, skinless chicken thighs (about 3 pounds)", 
            "2 cups (554 grams) plain, unsweetened Greek yogurt", 
            "1 hothouse, English or seedless cucumber, unpeeled (about 1 pound)", 
            "2 tablespoons freshly squeezed lemon juice", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon minced fresh dill", 
            "2 medium cloves garlic, minced", 
            "1 1/2 teaspoons kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "1 head romaine lettuce, chopped", 
            "1 red onion, thinly sliced", 
            "About 1 pound small-medium tomatoes, chopped", 
            "1 hothouse, English or seedless cucumber, chopped", 
            "4 large pitas (intending 1/2 per person) or more as needed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/chicken-gyro-salad1.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Cucumber", 
            "Greek", 
            "Greens", 
            "Grilling", 
            "Onions", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/05/chicken-gyro-salad/", 
        "title": "chicken gyro salad", 
        "directions": [
            "Prepare the chicken: Combine all ingredients in a large freezer bag. Rub all around, coating chicken as evenly as possible. Let marinate for 20 minutes or up to 24 hours, whatever time you have.\nMake tzatziki: Place the yogurt in a medium bowl. Quarter your cucumber lengthwise and cut out the seeded area. Coarsely grate your cucumber onto a clean dishcloth and wring it out as well as you can. All of that liquid makes for a soggy sauce. Add wrung-out cucumber to yogurt bowl along with lemon, vinegar, dill, garlic, salt and pepper and stir to combine. Taste and adjust seasonings. Chill until needed.\nPrepare salad components: Arrange lettuce, onion, tomatoes and cucumbers on a platter. If desired, toss onion with a squeeze of lemon and/or dash or two of vinegar and salt so that it mellows/lightly pickles while it rests.\nCook chicken: Heat your grill to high heat or a grill pan to medium-high. Remove chicken from marinade and grill on first side until dark lines appear, about 5 minutes, then flip and grill for 3 minutes more on second side. Cooking times will vastly range by the thickness and coldness of your chicken, as well as variations between grills. Transfer cooked chicken to a cutting board, let rest for a couple minutes while you quickly heat/toast your pitas on the grill.\nCut chicken into thin strips. Cut pitas into wedges. Add to platter with vegetables and let everyone dig in. Repeat all summer."
        ], 
        "date": "2016-05-31T12:01:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1-pound bunch Swiss chard, thick stems removed and leaves sliced into ribbons", 
            "3 spring onions, ends trimmed, white and some green parts sliced into thin coins", 
            "3 tablespoons butter", 
            "3 tablespoons all-purpose flour", 
            "1 1/4 cups milk", 
            "Salt and pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creamed-chard-and-spring-onions1.jpg?w=500", 
        "tags": [
            "Onions", 
            "Pasta", 
            "Photo", 
            "Side Dish", 
            "Spring", 
            "Swiss Chard", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/04/creamed-chard-and-spring-onions/", 
        "title": "creamed chard and spring onions", 
        "directions": [
            "Wash your chard, but no need to dry it, just place it in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 6 minutes.", 
            "Press or squeeze out the excess liquid any number of ways, either by wringing it out in cheesecloth (my favorite method), putting it in a mesh strainer and pressing the moisture out with a spatula or large spoon or letting it cool long enough to grab small handfuls and squeezing them to remove as much water as possible.", 
            "Wipe out the large pot so you can use it again. Heat milk or cream in a small saucepan over moderate heat, stirring, until warm. Keep warm. Meanwhile, cook onion and garlic, if using, in butter in your wiped-out large pot over moderately low heat, stirring occasionally, until softened, about six minutes. Whisk in flour and cook roux, whisking, about three minutes. Add warm milk or cream in a slow stream, whisking constantly to prevent lumps, and simmer, whisking, until thickened, three to four minutes. Stir in chard, then salt and pepper to taste and cook, stirring, until heated through.", 
            "To make Creamed Chard and Spring Onion Pasta: Use 1 3/4 cups of milk instead of 1 1/4 cups. Stir 1/4 cup finely grated parmesan into the sauce while cooking, and keep extra on hand for serving. This should be enough to toss with about half a pound of pasta (more or less depending on how saucy you like yours)."
        ], 
        "date": "2010-04-25T13:25:41+00:00"
    }, 
    {
        "ingredient_list": [
            "100 or so pearl onions, unpeeled (from 3 10-ounce bags)", 
            "2 1/2 ounces bacon (applewood-smoked is suggested), cut into a small dice", 
            "1 1/4 cups heavy cream", 
            "1/4 teaspoon freshly grated nutmeg", 
            "2 tablespoons sherry", 
            "1/2 bunch chives, cut into 1/2-inch segments", 
            "Kosher salt, to taste (I used 1 teaspoon of Diamond Kosher salt)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creamed-onions-with-bacon-and-chives1.jpg?w=500", 
        "tags": [
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2010/11/creamed-onions-with-bacon-and-chives/", 
        "title": "creamed onions with bacon and chives", 
        "directions": [
            "Blanch the pearl onions for 3 minutes in a pot of boiling salted water. Drain, shock in a bath of ice water, and drain again. Peel the onions (making a slit with a paring knife down the side made this easiest for me), leaving a little of the root end intact.", 
            "[Want to use frozen, already peeled onions instead? I list some potential sources in the post.]", 
            "in a medium saucepan, cook the bacon until crisp, then remove it with a slotted spoon and drain it on paper towels. Leave only two tablespoons of the cooking fat in the pan, and add the pearl onions, heavy cream and nutmeg. Add salt to taste.", 
            "Cover the pot with a lid, leaving it a little ajar. Cook onions until they are nearly cooked through, about 90 percent of the way then remove the lid and finish cooking the onions while reducing the cream by half. Stir in the sherry.", 
            "If your onions are done cooking before the cream has sufficiently reduced or if you’re unsure about the alcohol in the sherry, remove the onions with a slotted spoon and transfer them to your serving dish. Continue cooking the remaining sauce to the desired consistency and taste and pour it back over the onions.", 
            "Garnish with bacon and chives and don’t forget to share."
        ], 
        "date": "2010-11-17T14:05:35+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds (680 grams or 24 ounces or about 5 cups) thinly sliced yellow onions", 
            "3 tablespoons (42 grams or 1 1/2 ounces) unsalted butter", 
            "1 tablespoon (15 ml) olive oil", 
            "1 teaspoon (5 grams) table salt, plus additional to taste", 
            "1/4 teaspoon (1 gram) granulated sugar (helps the onions to brown)", 
            "3 tablespoons (24 grams or 7/8 ounce) all-purpose flour", 
            "2 quarts (8 cups or 1.9 liters) beef or other brown stock*", 
            "1/2 cup (118 ml) dry white wine or dry white vermouth", 
            "Freshly ground black pepper", 
            "3 tablespoons (45 ml) cognac or brandy (optional)", 
            "To finish [Gratinée] (Optional)", 
            "1 tablespoon grated raw onion", 
            "1 to 2 cups (to taste) grated Swiss (I often use Gruyere) or a mixture of Swiss and Parmesan cheese", 
            "1 tablespoon butter, melted", 
            "12 to 16 1-inch thick rounds French bread, toasted until hard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/04/french-onion-soup.jpg?w=750", 
        "tags": [
            "Budget", 
            "French", 
            "Onions", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2011/04/french-onion-soup/", 
        "title": "french onion soup", 
        "directions": [
            "Melt the butter and oil together in the bottom of a 4- to 5-quart saucepan or Dutch oven over moderately low heat. Add the onions, toss to coat them in oil and cover the pot. Reduce the heat to real low and let them slowly steep for 15 minutes. They don’t need your attention; you can even go check your email.", 
            "After 15 minutes, uncover the pot, raise the heat slightly and stir in the salt and sugar. Cook onions, stirring frequently, for 30 to 40 minutes until they have turned an even, deep golden brown. Don’t skimp on this step, as it will build the complex and intense flavor base that will carry the rest of the soup. Plus, from here on out, it will be a cinch.", 
            "After the onions are fully caramelized, sprinkle them with flour and cook, stirring, for 3 minutes. Add the wine in full, then stock, a little at a time, stirring between additions. Season to taste with salt and pepper. Bring to a simmer and simmer partially covered for 30 to 40 more minutes, skimming if needed. Correct seasonings if needed but go easy on the salt as the cheese will add a bit more saltiness and I often accidentally overdo it. Stir in the cognac, if using. I think you should.", 
            "Set aside until needed. I find that homemade onion soup is so deeply fragrant and flavor-rich that it can stand alone, but that doesn’t mean we don’t enjoy the graitinéed top once in a while. Here’s how to pull it off:", 
            "Preheat oven to 325. Arrange six ovenproof soup bowls or crocks on a large, foil-lined baking sheet. Bring the soup back to a boil and divide among six bowls. To each bowl, add 1/2 teaspoon grated raw onion and a tablespoon of grated cheese. Stir to combine. Dab your croutons with a tiny bit of butter and float a few on top of your soup bowls, attempting to cover it. Mound grated cheese on top of it; how much you use will be up to you. [Julia Child, in another era, felt that 1/2 cup of grated cheese could be divided among 6 bowls. I can assure you that if you’d like your gooey bubbling cheese lid to be anything like what you get at your local French restaurant, you are looking to use more, such as a generous 1/4 cup.]", 
            "Bake soups on tray for 20 minutes, then preheat broiler. Finish for a minute or two under the broiler to brown the top lightly. Grab pot holders, and serve immediately.", 
            "*  Porcini or mushroom stock are a robust vegetarian substitution."
        ], 
        "date": "2011-04-09T11:48:38+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "2 cups (250 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "1/2 cup (1 stick, 4 ounces or 113 grams) chilled butter, in cubes", 
            "3 tablespoons cold water", 
            "Filling", 
            "1 1/2 pounds yellow onions (about 4 medium), halved and thinly sliced", 
            "1 tablespoons butter", 
            "1 tablespoon olive oil", 
            "Scant 1/2 teaspoon table salt", 
            "Pinch of sugar", 
            "1 cup low-sodium beef, veal or mushroom stock/broth", 
            "2 teaspoons cognac, brandy or vermouth (optional)", 
            "Freshly ground black pepper", 
            "1/2 cup (about 2 ounces or 60 grams) grated Gruyere, Comte or Swiss cheese", 
            "1 large egg", 
            "1/2 cup heavy cream (half-and-half and milk work too, but cream tastes best)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/french-onion-tart-uk-cookbook-release1.jpg?w=500", 
        "tags": [
            "Announcements", 
            "Budget", 
            "French", 
            "Onions", 
            "Photo", 
            "Tarts/Quiche", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2013/03/french-onion-tart-uk-cookbook-release/", 
        "title": "french onion tart + uk cookbook release", 
        "directions": [
            "Make crust: Mix flour and salt together in a large bowl or the work bowl of a food processor. Add butter; either rub the butter bits into the flour with your fingertips, with a pastry blender or (in the food processor option) by pulsing the machine on in short bursts until the mixture resembles breadcrumbs. Sprinkle in cold water and mix it with a spoon, a few more cuts with a handheld pastry blender, or by pulsing the machine a couple more times. The mixture should form large clumps. Knead it gently into a ball; it will be on the firm side but should be easy to roll. ", 
            "Lightly butter a 9-inch round tart pan with a removable base. Don’t have one? Try a standard pie dish or even a 9-inch cake pan. The second two options will be hard/impossible to unmold later, but there’s no harm in serving the tart from its baking pan.", 
            "Roll your dough out between two pieces of plastic wrap until it is about 11 inches in diameter. Peel the top plastic layer off and reverse the dough into the prepared tart pan, lifting the sides to drape (rather than pressing/stretching the dough) the dough into the corners. Press the dough the rest of the way in and up the sides. Trim edges, which you can leave ever-so-slightly extended above the edge of the tart pan, to give you some security against shrinkage. Chill for 15 minutes in your freezer. ", 
            "If par-baking the crust (see notes up top for pros/cons): Heat oven to 400 degrees. Lightly butter a piece of foil and press it tightly into your firm-from-the-freezer tart shell. Fill tart shell with pie weights, dried beans or rice or pennies and blind bake for 12 to 14 minutes. Remove from oven, carefully remove foil and weights, and return to oven for another 5 to 7 minutes, until lightly golden at edges. Set aside until needed.", 
            "Make filling: Melt the butter and olive oil together in a large skillet over medium heat. Add the onions to the pan, toss them gently with the butter and oil, reduce the heat to medium-low, and cover the pan. Cook the onions for 15 minutes, then remove the lid, stir in the salt and sugar and saute without the lid for about 10 to 15 minutes, until the onions are fully caramelized and have taken on a deep golden color. Pour in cognac, if using it, and the stock, then turn the heat all the way up and scrape up any brown bits stuck to the pan. Simmer the mixture until the broth nearly completely disappears (wetter onions will make for a wetter quiche), about 5 to 10 minutes. Adjust the salt, if needed, and season with freshly ground black pepper. [Updated to add.] Let cool until warm. You can hasten this process by spreading the onions out on a plate in the fridge, or even faster, in the freezer.", 
            "In a mediu bowl, beat the egg and cream together. [Update] Gently stir the lukewarm onions into the custard.", 
            "Heat oven to 400 degrees.", 
            "Assemble and bake tart: Fill prepared tart shell with onion-egg mixture. Ideally, this will bring your filling level to 1/4-inch from the top, however, variances in shells, pans, pan sizes and even onion volume might lead you to have a lower fill line. You can beat another egg with cream together and pour it in until it reaches that 1/4-inch-from-top line if you wish. Sprinkle cheese over custard and bake 25 to 30 minutes, or until a sharp knife inserted into the filling and turned slightly releases no wet egg mixture. Serve hot or warm, with a big green salad."
        ], 
        "date": "2013-03-04T11:34:28+00:00"
    }, 
    {
        "ingredient_list": [
            "2 quarts whole milk", 
            "2 cups buttermilk", 
            "2 tablespoons olive oil, divided", 
            "2 cups thinly sliced red onions", 
            "1 1/2 teaspoons golden brown sugar", 
            "2 tablespoons balsamic vinegar", 
            "Pinch of dried crushed red pepper", 
            "1 cup fresh ricotta cheese", 
            "6 to 8 thin slices prosciutto (speck works as well)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/fresh-ricotta-and-red-onion-pizza1.jpg?w=500", 
        "tags": [
            "Onions", 
            "Photo", 
            "Pizza"
        ], 
        "url": "https://smittenkitchen.com/2008/06/fresh-ricotta-and-red-onion-pizza/", 
        "title": "fresh ricotta and red onion pizza", 
        "directions": [
            "Pizza dough for one pizza [a simple recipe, a wine and honey version]", 
            "Heat 1 tablespoon oil in large nonstick skillet over medium-high heat. Add onions and sugar. Cook until dark brown and tender, stirring frequently, about 16 minutes. Mix in vinegar and crushed pepper. Cook until mixture is thick, about 1 to 2 minutes more. Season marmalade generously to taste with salt and pepper.", 
            "Meanwhile, preheat oven to 500°F. Roll pizza dough out onto the back of a baking sheet, sprinkled with cornmeal. Brush with remaining 1 tablespoon of oil; sprinkle with salt. Spread onion marmalade over the crust, dollop ricotta all over the onion layer and top with slices of prosciutto. Bake until caramelized and crusty, about 10 to 12 minutes."
        ], 
        "date": "2008-06-19T17:07:43+00:00"
    }, 
    {
        "ingredient_list": [
            "Crispy Onions", 
            "2 medium yellow onions, halved and thinly sliced", 
            "1/4 cup all-purpose flour", 
            "2 tablespoons panko or plain breadcrumbs", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "Canola, safflower, peanut or other high-heat oil, for deep-frying", 
            "Mushroom Sauce", 
            "3 tablespoons butter", 
            "12 ounces mushrooms, thinly sliced or coarsely chopped", 
            "Few gratings fresh nutmeg (optional)", 
            "Freshly ground black pepper", 
            "3/4 teaspoon table salt", 
            "2 garlic cloves, minced", 
            "3 tablespoons all-purpose flour", 
            "1 1/2 cups vegetable or chicken broth", 
            "1/2 cup heavy cream", 
            "Assembly", 
            "1 to 1 1/2 pounds green beans, trimmed and halved (see note about volume)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/green-bean-casserole-with-crispy-onions1.jpg?w=640", 
        "tags": [
            "Fall", 
            "Green Beans", 
            "Mushrooms", 
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/green-bean-casserole-with-crispy-onions/", 
        "title": "green bean casserole with crispy onions", 
        "directions": [
            "Make the crispy onions: Toss onion with flour, breadcrumbs, salt and pepper. Heat a 1/2-inch or so of oil in a 12-inch cast iron skillet until a drop of water flicked into it will hiss and sputter. Add onions, just a handful at a time in something close to a single layer, and fry until a light golden brown (they’ll get more color in the oven; I overcooked mine a bit, forgetting this). Remove with a spider or large slotted spoon, let oil drip off a little, back into the skillet, then spread onions out on paper towels to drain. Repeat with remaining onions. Set aside until needed; this makes a lot.", 
            "Heat oven to 400 degrees F.", 
            "Prepare the beans: Bring a large pot of salted water to boil and boil greens for 5 minutes (for standard green beans) or 2 to 3 minutes (for haricot vert, or skinny ones). Drain beans, then plunge them into ice water to full stop them from cooking. Drain again, and set aside. (If you are adamant about only using one pot, you can boil them in your 12-inch cast iron skillet that you use for the other steps. But a saucepan can be easier.)", 
            "Make the mushroom sauce: Over medium-high heat, melt butter in the bottom of a 12-inch cast iron skillet. Add the mushrooms, salt and pepper and saute them until they start releasing their liquid, anywhere from 3 to 5 minutes, depending on how they were chopped. Add the garlic and saute one minute more. Add the flour and stir it until it fully coats the mushrooms. Add the broth, 1/4 cup at a time, stirring the whole time. Simmer mixture for 1 minute, then add cream and bring back to a simmer, cooking until the sauce thickens a bit, about 5 to 6 minutes, stirring frequently. ", 
            "Assemble and bake: Add cooked greens beans to sauce and stir until they are coated. Sprinkle crispy onions over the top. Bake for 15 minutes, or until sauce is bubbling and onions are a shade darker. Eat at once.", 
            "Do ahead, a few ways: Onions can be made long in advance (up to a day) and keep at room temperature, loosely wrapped (they’d get soggy in an airtight container). Green beans can be cooked and kept in fridge until needed, at least one day. Green beans can also be combined with mushroom sauce and kept refrigerated for up to a day. Add onions and bake shortly before serving. Finally, it’s less ideal, but the entire dish can be cooked, loosely wrapped (so the crispy top doesn’t get soggy) and then rewarmed in a low oven before serving. Just keep an eye on the topping so it doesn’t get too brown while reheating.", 
            "A few notes: "
        ], 
        "date": "2013-11-18T11:56:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/4-pound (20 ounce) round of sourdough or dense country-style white bread", 
            "1/2 cup olive oil, divided", 
            "3 tablespoons unsalted butter, divided", 
            "3 medium yellow onions, thinly sliced in half-moons", 
            "Kosher salt", 
            "1/2 teaspoon sugar or honey", 
            "2 tablespoons sherry vinegar", 
            "1 pound (large bundle) curly kale, center ribs and stems removed, chopped or torn into large chunks", 
            "2 garlic cloves, minced", 
            "2 cups vegetable, chicken or turkey broth, divided", 
            "Red pepper flakes, to taste", 
            "2 tablespoons sherry"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/kale-and-caramelized-onion-stuffing1.jpg?w=750", 
        "tags": [
            "Kale", 
            "Onions", 
            "Photo", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/11/kale-and-caramelized-onion-stuffing/", 
        "title": "kale and caramelized onion stuffing", 
        "directions": [
            "Heat oven to 400°F. Slice crusts off bread (you can save them for breadcrumbs) and tear loaf into rough 1-ish-inch pieces. Place in a large bowl and drizzle with 4 tablespoons olive oil and toss well. Spread on a large rimmed baking sheet and toast in oven, tossing once or twice for even color, until golden brown and crisp on the outside but still a little tender inside, about 20 minutes. Let cool on sheet, then tip back into that large bowl.", 
            "Meanwhile, melt 1 tablespoon butter in 2 tablespoons oil in the bottom of a large saute pan over low heat. Add the onions, toss to coat them in oil and cover the pan and with the stove on the lowest heat possible, let them cook undisturbed for 15 minutes. (The steaming and wilting will help them caramelize much faster, yay.) Remove lid, raise heat to medium/medium-high, add sugar and 1 teaspoon salt and cook onions, stirring frequently, for another 15 to 20 minutes, until they’re a deep golden brown. Add 1 tablespoon sherry vinegar and use to scrape any stuck bits off bottom of pan, then cook off. Taste onions. If desired, add a second tablespoon of sherry vinegar and cook off in the same method. (I prefer them with 2 tablespoons.) Add onions to bowl with croutons.", 
            "Add 2 more tablespoons olive oil to pan and heat garlic for half a minute, before adding kale. Get kale coated with garlicky oil, then add 2 tablespoons broth. Cook kale until wilted and somewhat tender, seasoning well with salt and pepper, about 6 minutes. Add sherry to pan and cook until it almost disappears. Add remaining broth and last two tablespoons of butter and bring mixture to a simmer. ", 
            "Pour kale-broth mixture over croutons and caramelized onions. Toss well to combine. Pour mixture into a 3-quart casserole dish and cover with foil. Bake for 15 minutes, then remove foil, and bake for another 15 to 20, until golden and crisp on top.", 
            "Do ahead: Each part of this (the croutons, the onions and the kale) can prepared up to 3 days in advance, and assembled and baked when needed. Keep the croutons at room tempearture in a container or bag. Keep the onions in the fridge, as well as the kale and broth mixture. "
        ], 
        "date": "2015-11-04T11:59:12+00:00"
    }, 
    {
        "ingredient_list": [
            "Meatballs", 
            "The baguettes or seeded sandwich rolls you’ll use for your sandwiches (see Note above for how to estimate)", 
            "2 pounds ground meat of your choice (I used pork but have in the past used beef, veal, chicken, turkey or a blend thereof)", 
            "2 tablespoons chopped parsley", 
            "1/3 cup finely grated Parmesan or Romano cheese", 
            "3/4 teaspoon salt", 
            "Pinch of red pepper flakes", 
            "2 small garlic cloves, minced", 
            "1 teaspoon onion powder", 
            "1 teaspoon Worcestershire sauce", 
            "1 large egg", 
            "Olive oil", 
            "4 cups prepared tomato sauce (plus extra if you like a lot of extra sauce)", 
            "Caramelized onions", 
            "2 large yellow onions, thinly sliced", 
            "1 tablespoon butter", 
            "1 tablespoon olive oil", 
            "Salt", 
            "Assembly", 
            "2 cups coarsely shredded Gruyère"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/meatball-sub-with-caramelized-onions.jpg?w=750", 
        "tags": [
            "Meat", 
            "Onions", 
            "Photo", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2011/02/meatball-sub-with-caramelized-onions/", 
        "title": "meatball subs with caramelized onions", 
        "directions": [
            "Make the meatballs: Split your rolls almost the whole way through, leaving one side attached. Scoop out some of the roll to create a channel for the meatballs to rest in. Grind the bread you pulled out in a food processor or tear it into minuscule bits. You will need 1 1/3 cups or 2 3/4 ounces of fresh breadcrumbs for the meatballs. If you’re not making subs, you can get this same amount of breadcrumbs from 2 to 3 sandwich bread slices. Set rolls aside until later.", 
            "Place the fresh breadcrumbs in a large bowl with 3/4 cup warm water and all of the meatball ingredients except for the olive oil and tomato sauce. Combine with a fork, breaking up clumps of meat until the ingredients are evenly distributed. Form mixture into 2-inch meatballs are arrange on a tray. I find wet hands make it easier to form meatballs without them sticking too much.", 
            "Heat a generous slick of oil (few tablespoons) in a large saute pan with a lid. Brown meatballs in batches, being careful not to crowd the pan or nudge them before they are nicely browned or they will stick and you’ll leave delicious meatball bits in the pan. These meatballs are soft, so use a gentle hand. Transfer meatballs to a paper towel-lined tray and continue until they are all browned.", 
            "Discard the oil and heat your tomato sauce in the pan. Add the meatballs, cover the pan and simmer them on the lowest heat possible for 25 to 30 minutes, until the meatballs are cooked through.", 
            "Caramelize onions: While the meatballs are simmering, you can cook the onions. Heat the olive oil and butter in a heavy large skillet over medium-low heat. Add onion, sprinkle with salt and a little pepper and cook until they’re tender, sweet, and a deep golden brown, stirring occasionally. This takes me about 30 minutes.", 
            "Assemble subs: Arrange meatballs with sauce in the hollowed-out roll(s). Drape caramelized onions over the top and sprinkle with shredded cheese. Place subs under a broiler or in an oven at top heat to melt the cheese."
        ], 
        "date": "2011-02-04T13:40:16+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 teaspoons active dry yeast (a 1/4-ounce package)", 
            "1/2 cup warm water (105 to 115°F)", 
            "1 1/2 to 1 3/4 cups all-purpose flour", 
            "1 large egg", 
            "1/3 cup plus 1 tablespoon extra-virgin olive oil, divided", 
            "2 1/2 teaspoons salt, divided", 
            "2 teaspoons fennel seeds", 
            "3 pound yellow onions, halved and thinly sliced", 
            "1 tablespoon Dijon mustard (I use a bit more)", 
            "1/2 cup grated Parmigiano-Reggiano (I like it coarsely grated for this)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/onion-tart-with-mustard-and-fennel1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Onions", 
            "Photo", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2008/11/onion-tart-with-mustard-and-fennel/", 
        "title": "onion tart with mustard and fennel", 
        "directions": [
            "Stir together yeast and warm water in a small bowl and let stand until foamy, about 5 minutes. (If mixture doesn’t foam, start over with new yeast.)", 
            "Put 1 1/2 cups flour in a medium bowl, then make a well in center of flour and add yeast mixture to well. Stir together egg, 1 tablespoon oil, and 1 1/2 teaspoons salt with a fork. Add egg mixture to yeast mixture and mix with a wooden spoon or your fingertips, gradually incorporating flour, until a soft dough forms. Transfer dough to a floured surface and knead, working in additional flour (up to 1/4 cup) as necessary, until smooth and elastic, about 5 minutes. Transfer dough to an oiled bowl and turn to coat. Cover with plastic wrap and let rise in a draft-free place at warm room temperature until doubled, 1 to 1 1/2 hours.", 
            "While dough rises, heat remaining 1/3 cup oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then sauté fennel seeds until a shade darker, about 30 seconds. Stir in onions, remaining teaspoon salt, and 1/2 teaspoon pepper, then reduce heat to medium-low and cover onions directly with a round of parchment paper. Cook, stirring occasionally, until onions are very tender and golden brown, 1 to 1 1/4 hours.", 
            "[Do ahead: I made the dough several hours in advance and let it rise in the fridge, and the onions too, which I let sit covered at room temperture until I was ready to assemble and bake the tart.]", 
            "Preheat oven to 375°F with rack in middle.", 
            "Knead dough gently on a floured surface with floured hands to deflate. Pat out dough on a large heavy baking sheet (preferably blue steel) into a 15- by 12-inch rectangle, turning up or crimping edge, then brush mustard evenly over dough, leaving a 1/2-inch border around edge. Spread onions evenly over mustard, then sprinkle evenly with cheese.", 
            "Bake tart until crust is golden brown, 30 to 35 minutes. Cut into 2-inch squares or diamonds and serve warm or at room temperature."
        ], 
        "date": "2008-11-06T16:59:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound pizza dough", 
            "Olive oil, for oiling baking sheets", 
            "1/2 cup fromage blanc or ricotta", 
            "1/2 cup crème fraîche or sour cream", 
            "1 tablespoon all-purpose flour", 
            "Salt and freshly ground pepper", 
            "1/4 pound thickly sliced smoky bacon, cut crosswise into 1/4-inch strips", 
            "1 medium onion, thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pizza-with-bacon-onions-and-cream1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Onions", 
            "Photo", 
            "Pizza"
        ], 
        "url": "https://smittenkitchen.com/2011/01/pizza-with-bacon-onions-and-cream/", 
        "title": "pizza with bacon, onions and cream", 
        "directions": [
            "Preheat oven to 450°F. In a medium skillet, cook the bacon over medium heat until the fat is rendered and the bacon crisps up. Remove with a slotted spoon and drain on paper towels. Add onion to skillet and cook until softened and beginning to caramelize, an amount of time I forgot to write down but would estimate at 7 to 10 minutes.", 
            "Whisk together (or blend together in a food processor, if you want it silky-smooth) fromage blanc and crème fraîche with flour, then season with salt and freshly ground black pepper.", 
            "Divide the dough into 4 pieces. Roll each piece out to a rough 8-inch round, about 1/8 inch thick. If the dough becomes difficult to roll, let it rest for 10 minutes, then continue.", 
            "Oil two large baking sheets. Transfer two dough rounds to each. Spread the fromage blanc mixture over the rounds to within 1/4 inch of the edge. Sprinkle with the bacon and onion. Bake on the bottom shelf of the oven for about 12 minutes, or until the crust is golden brown. Cut into wedges and serve."
        ], 
        "date": "2011-01-13T20:59:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium yellow onion", 
            "Salt and pepper", 
            "Olive oil", 
            "2 sprig thyme (optional)", 
            "1 bunch broccoli raab (aka broccoli rabe or rapini)", 
            "1 clove garlic", 
            "1 pinch hot pepper flakes", 
            "Pizza dough for one recipes (super-simple recipe here and an almost as simple recipe here)", 
            "1/2 cup grated mozzarella cheese", 
            "16 niçoise olives, pitted", 
            "1 lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pizza-with-broccoli-rabe-and-roasted-onions1.jpg?w=500", 
        "tags": [
            "Broccoli Rabe", 
            "Onions", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/12/pizza-with-broccoli-rabe-and-roasted-onions/", 
        "title": "pizza with broccoli rabe and roasted onions", 
        "directions": [
            "Preheat the oven to 375°F.", 
            "Dice the onion and toss it in a small ovenproof sauté pan with a pinch of salt and enough olive oil to coat lightly, and the leaves of the thyme. Put the pan in the oven to roast, stirring occasionally, until the onion is cooked and golden, about 30 minutes.", 
            "While the onion is roasting, wash and drain the broccoli raab, remove the heavy stems, and roughly chop the leaves and sprouts into coarse chiffonade. There should be enough to make about 2 cups. Peel and finely chop the garlic. Heat a large sauté pan and coat it with olive oil. Ad the broccoli raab, season with salt, pepper, and the hot pepper flakes, and fry over high heat until the broccoli raab is tender. Add the garlic and fry, tossing, for a few seconds.", 
            "When the onions are done, take them out of the oven and turn the heat up to 450° to 500°F. Put a pizza stone in the oven. Roll out of shape a 12- to 14-inch disk of pizza dough and slide it onto a floured pizza peel or the back of a baking sheet. Lightly brush the dough with olive oil, leave a 1/2-inch boarder dry. Evenly sprinkle the cheese on the oiled surface,spread the onions over, and top with the broccoli raab and the olives. Drizzle about 1 tablespoon olive oil over the pizza. Slide the pizza onto the preheated stone in the oven and bake from 5 to 10 minutes, until the crust is brown and crisp. Remove the pizza from the oven, sprinkle a few drops of lemon juice on it, slice and serve."
        ], 
        "date": "2008-12-28T15:25:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large or 2 small yellow onions", 
            "3 pounds or about 5 large baking — Russet or Idaho — potatoes, peeled", 
            "1/3 cup potato starch*", 
            "2 teaspoons kosher salt", 
            "Lots of freshly ground black pepper", 
            "3 large eggs", 
            "5 tablespoons olive oil, schmaltz or another oil of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/23422902976_b1b17d03a6_k.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Gluten-Free", 
            "Hanukah", 
            "Jewish", 
            "Onions", 
            "Passover", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/12/potato-kugel/", 
        "title": "potato kugel", 
        "directions": [
            "Heat oven to 350°F.", 
            "By hand: Chop onions very finely and coarsely grate potatoes.", 
            "With a food processor: Blend onions in food processor with regular blade until finely ground. Switch to grating blade and grate potatoes — I like to do this one their sides, for the longest strands.", 
            "Both methods: Place onions and potatoes in a large bowl. Sprinkle salt, pepper and starch evenly over potatoes and toss together with two forks or, as I do it, your very clean hands, evenly coating strands. Break eggs right on top and again use forks or your fingers to work them into the strands, evenly coating the mixture. ", 
            "Heat a 1/4 cup oil or fat in a 10-inch cast-iron skillet** over high heat until very hot. Pour potato-egg mixture into pan carefully (it’s going to splatter) and spread evenly in pan. I like to twist and tousle the top strands a little for a pretty final texture on top. Drizzle with last tablespoon of oil. Bake in heated oven for 75 to 80 minutes, until browned on top and tender in the middle. If top browns too quickly, before center is baked, cover with foil for all but the last two minutes of baking time, though this has never been necessary in my oven.", 
            "Serve in squares, either right from the skillet or unmolded onto a platter. Kugel reheats exceptionally well in a warm oven. It keeps in the fridge for up to 4 days, and much longer (months, even) in the freezer. I like to defrost it in the fridge before rewarming it in an oven. ", 
            "* Cornstarch works too. As does flour. Matzo meal is traditional. I like potato starch because it’s the least distracting and lightest. I buy mine from Bob’s Red Mill; usually in a section with other BRM products at just about any store these days (hooray).", 
            "** Without a cast-iron — Use a casserole baking dish. Just heat the oil first so it’s hot when the potato mixture lands in it. (You can do this in the oven, but it will take a good 5 minutes to get very hot. Might as well do it in 60 seconds on the stove.)"
        ], 
        "date": "2015-12-01T12:05:07+00:00"
    }, 
    {
        "ingredient_list": [
            "10 medium red and yellow onions (4 lb)", 
            "1 lb sliced bacon, cut crosswise into 1-inch-wide pieces", 
            "3 celery ribs, cut crosswise into 1/2-inch-thick slices", 
            "1 teaspoon salt", 
            "1 teaspoon black pepper", 
            "3 garlic cloves, minced", 
            "15 oz baby spinach, trimmed and coarsely chopped (14 cups)", 
            "1 (9-inch) round loaf country-style bread (1 1/4 lb), cut into 1/2-inch cubes (10 cups), lightly toasted", 
            "2 cups salted roasted cashews (10 oz), coarsely chopped", 
            "1 stick (1/2cup) unsalted butter, melted", 
            "1 1/4 cups turkey giblet stock"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-stuffed-onions1.jpg?w=500", 
        "tags": [
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2007/11/roasted-stuffed-onions/", 
        "title": "roasted stuffed onions", 
        "directions": [
            "Make onion shells: Cut a 1/2-inch-thick slice from tops of onions, discarding tops, and trim just enough from bottoms for onions to stand upright. Scoop out all but outer 2 or 3 layers from each using a small ice cream scoop or spoon (don’t worry if you make a hole in the bottom), reserving scooped-out onion and onion shells separately. ", 
            "Make stuffing: Coarsely chop enough scooped-out onion to measure 3 cups. ", 
            "Cook bacon in 2 batches in a 12-inch heavy skillet over moderate heat, stirring, until crisp, about 10 minutes, then transfer with a slotted spoon to paper towels to drain, reserving about 1/3 cup fat in skillet. ", 
            "Add chopped onion, celery, salt, and pepper to skillet and sautÃƒÂ© over moderately high heat, stirring, until vegetables are softened, about 5 minutes. Add garlic and sautÃƒÂ©, stirring, 1 minute. Transfer mixture to a large bowl and stir in spinach, bread, cashews, butter, 1 cup stock, and bacon, then cool completely. ", 
            "Roast onions: Preheat oven to 425Â°F. Arrange onion shells, open sides up, in a 13- by 9- by 2-inch baking pan, then add 1/2cup water and cover pan tightly with foil. Roast onions in middle of oven until tender but not falling apart, 25 to 30 minutes. ", 
            "Stuff and bake onions: Reduce oven temperature to 350Â°F. Transfer shells to a work surface and pour off water in pan. Fill shells with stuffing, mounding it, and return to pan. Reserve 5 to 7 cups stuffing for turkey cavity, then put remaining stuffing in a buttered shallow 3 1/2-quart baking dish and drizzle with remaining 1/4 cup stock. ", 
            "Bake stuffed onions and stuffing in dish in middle of oven, uncovered, until heated through, about 25 minutes. "
        ], 
        "date": "2007-11-05T00:43:26+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound cipollini onions", 
            "1 pound small Roma or large cherry tomatoes", 
            "1/4 cup olive oil", 
            "Coarse salt", 
            "4 slices of country or ciabatta bread, one-inch thick", 
            "1 15-ounce can of white beans, drained and rinsed or 1 1/2 cups cooked beans of your choice", 
            "Garlic clove (optional)", 
            "Few fresh basil leaves, slivered"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-tomatoes-and-cipollini1.jpg?w=500", 
        "tags": [
            "Herbs", 
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/09/roasted-tomatoes-and-cipollini/", 
        "title": "roasted tomatoes and cipollini", 
        "directions": [
            "Preheat oven to 375°F. Boil a small pot of water and blanche the cipollini for 10 seconds, then plunging them into cold water. Use a paring knife to make a small slit in each, and slide them out of their skins and outer layer.", 
            "Spread peeled onions and tomatoes in a roasting pan. Drizzle with olive oil and a few good pinches of coarse salt. Toss everything together until well-coated and roast in preheated oven for about 45 minutes, reaching in every 15 minutes with a spatula to roll the tomatoes and onions around to ensure all sides get blistered.", 
            "Just before you take the tomatoes and onions out, place your bread slices on the oven rack (or a tray, if you’re more refined than us) and let them toast lightly. You can rub the toasts with a halved garlic clove, if you like, while still hot. Use tongs to arrange toasts in one layer on a serving platter. Dump the white beans over the bread, and using a pot holder, scrape the entire contents of the tomato-and-onion roasting pan, still hot, over the white beans. Do not skimp on the juices that have collected, all of them — don’t leave any in the pan. They could make a religious person out of you.", 
            "Sprinkle the dish with the basil and eat at once. "
        ], 
        "date": "2009-09-09T12:02:01+00:00"
    }, 
    {
        "ingredient_list": [
            "Olive oil", 
            "1 large onion, sliced (1 1/2 cups)", 
            "2 cups (1/4-inch-sliced) fennel, top and core, if thick, removed", 
            "3 cloves garlic, minced (1 tablespoon)", 
            "1 pound sweet potatoes, peeled and sliced 1/4-inch thick", 
            "1 pound celery root, peeled and sliced 1/4-inch thick", 
            "1 pound yukon gold, peeled and sliced 1/4-inch thick", 
            "1 cup heavy cream (see Note up top)", 
            "2 cups chicken or vegetable stock or brother", 
            "2 cups grated gruyere cheese (6 ounces with rind)", 
            "2 teaspoons minced fresh thyme leaves", 
            "Kosher salt and freshly ground black pepper", 
            "2 1/2 cups coarse fresh breadcrumbs or panko (what I used)", 
            "2 to 3 tablespoons melted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/root-vegetable-gratin.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Fennel", 
            "Freezer Friendly", 
            "Onions", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/11/root-vegetable-gratin/", 
        "title": "root vegetable gratin", 
        "directions": [
            "Heat your oven to 350°F. Butter a 13×9-inch deep baking dish.\nHeat 2 tablespoons olive oil in a large deep (ideally 12-inch) saute pan over medium heat and add the onions and fennel. Cooking, tossing occasionally, until lightly browned and tender, about 10 minutes. Add the garlic and cook for one minute more.\nMeanwhile, in the largest bowl you own, combine the onion mixture with remaining vegetables, cream, stock, cheese, thyme, 1 tablespoon kosher salt and 1 1/2 teaspoons black pepper. Pour mixture into prepared dish and spread until even. Mix breadcrumbs and butter until evenly coated and distribute evenly over top of dish.\nBake 1 1/2 hours uncovered, or until vegetables are very tender when tested with a small knife and the top is browned and bubbly. Allow to set for 15 minutes at room temperature and serve hot."
        ], 
        "date": "2016-11-10T13:09:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup wild rice, uncooked", 
            "3 tablespoons unsalted butter", 
            "2 1/2 pounds (about 4) Vidalia onions, or other sweet onions, quartered and very thinly sliced", 
            "6 cups chicken or vegetable stock", 
            "Herb bundle (see Note above)", 
            "Salt and pepper", 
            "8 slices baguette", 
            "2 tablespoons extra-virgin olive oil", 
            "4 ounces Maytag or other young, not too sharp, blue cheese, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/vidalia-onion-soup-with-wild-rice-and-blue-cheese.jpg?w=750", 
        "tags": [
            "Easter", 
            "Grain/Rice", 
            "Onions", 
            "Photo", 
            "Soup", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/05/vidalia-onion-soup-with-wild-rice/", 
        "title": "vidalia onion soup with wild rice", 
        "directions": [
            "Cook the wild rice in a small saucepan according to package directions. Usually, 2 cups of water is the amount needed for 1/2 cup wild rice. Bring to a boil, reduce heat to a very low simmer and cover the pot. Let it cook, undisturbed, until the rice is tender and the water is absorbed, about 50 to 55 minutes. Set aside. ", 
            "Melt the butter in the bottom of a 4- to 5-quart saucepan or Dutch oven over moderately low heat. Add the onions, toss to coat them in oil and cover the pot. Reduce the heat to real low and let them slowly steep for 15 minutes. They don’t need your attention; you can even check your email, eh, who are we kidding, Facebook.", 
            "After 15 minutes, uncover the pot, raise the heat slightly and season the onions with a bit of salt and pepper. Cook onions, stirring frequently, for another 15 to 25 minutes, until they are tender, limp and sweet. Add the stock and simmer for 20 minutes. Wrap the herbs (see Note up top) in a small piece of cheesecloth and tie with kitchen string. Trotter suggests you drop the bundle into the broth for one minute, then remove it, but after going through such an effort to make one, I decided to leave mine in a little longer; it made me feel better. Adjust seasonings with additional salt and pepper, if needed.", 
            "Heat oven to 400 degrees. Brush both sides of the baguette slices with oil. Bake on a baking sheet until light golden brown, 5 to 10 minutes. While the croutons are still warm, spread them with blue cheese.", 
            "To serve, divide the rice among four bowls, and ladle broth and onions on top. Float two croutons in the center of each bowl, and sprinkle with more pepper. Eat immediately."
        ], 
        "date": "2012-05-21T16:02:02+00:00"
    }
]