{
  "date": "2017-06-07T12:03:49+00:00",
  "directions": [
    "Make crispy lamb and lentils: Heat a large skillet over medium-high heat. Once hot, add oil, and once oil is hot, arrange lamb in a large even patty about 1/4-inch thick. Season with salt and pepper. Cook until underside and browned and very crisp, about 5 minutes. Carefully pour off most of excess fat and discard. Flip meat in spatula-sized parts, sprinkle top with garlic, a good pinch of red pepper flakes (up to 1 teaspoon for real heat; I used 1/4 teaspoon), cumin and coriander, plus more salt and pepper, and cook until underside is browned, which should only take 2 to 3 more minutes. Use spatula to break lamb into smaller chunks and add lentils. Cook, stirring occasionally, until lamb is cooked through, about 2 minutes more. Transfer lamb-lentil mixture to a bowl.\nTo assemble: Arrange lettuce leaves on a platter and divide lamb-lentil mixture between them. Top with yogurt, tahini, or yogurt-tahini sauce, tomato-cucumber relish and herbs. Serve with hot sauce, if desired.",
    "Extras:\nTo make a tomato-cucumber “relish” salad: Chop a handful of tomatoes and 1 large or a few smaller cucumbers into very small pieces. Finely chop 1/4 a medium red onion. Mix vegetables and onion in a bowl and dress to taste with olive oil, fresh lemon juice, salt and pepper. No matter how much it looks like, I promise it will be gone before the end of the meal.\nTo make a lemony-tahini yogurt dressing: Whisk 4 tablespoons well-stirred tahini in the bottom of a bowl. Whisk in the juice of 3/4 of a lemon, 1 minced garlic clove and 3 tablespoons water until smooth. Whisk in 2/3 cup plain yogurt, about 1/4 at a time, until smooth. Season with salt. Adjust everything to taste.\nTo make a lemony-tahini no-yogurt (so not thick and creamy, but still full of flavor) dressing: Combine 1/2 cup well-stirred tahini, 1 minced garlic clove, juice of 1 lemon, and 2 tablespoons olive oil in a bowl. Whisk in water as needed to loosen, you’ll likely need a few tablespoons. Season well with salt and pepper."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/crispy-spiced-lamb-and-lentil.jpg?w=750",
  "ingredient_list": [
    "1 tablespoon vegetable oil",
    "1/2 pound ground lamb",
    "Kosher salt and freshly ground black pepper",
    "2 garlic cloves, minced",
    "Red pepper flakes, to taste",
    "1/2 teaspoon cumin seeds or a heaped 1/2 teaspoon ground",
    "1/2 teaspoon ground coriander",
    "1 1/2 cups cooked brown or green lentils (from a scant 1 cup dried)",
    "8 to 10 cup-shaped leaves from 1 medium head bibb or butter lettuce",
    "Tomato-cucumber “relish” salad",
    "Lemon-tahini dressing, with or without yogurt, or 1 cup plain yogurt, seasoned with salt and pepper",
    "A couple tablespoons chopped fresh herbs such as parsley, cilantro, and mint, or a mixture thereof"
  ],
  "tags": [
    "Gluten-Free",
    "Greens",
    "Meat",
    "Photo",
    "Weeknight Favorite"
  ],
  "title": "crispy spiced lamb and lentils",
  "url": "https://smittenkitchen.com/2017/06/crispy-spiced-lamb-and-lentils/"
}