{
  "date": "2014-05-06T12:28:39+00:00",
  "directions": [
    "Wash spinach but no need to dry. With water droplets still clinging to the leaves, wilt spinach in a hot skillet until completely soft, about 4 minutes. Let cool and wring all the water — seriously, every drop you can get out — out of the spinach in small fistfuls, and then pressing these little bundles out against a fine-mesh strainer. Rest spinach on paper towels to remove even more water, then mince spinach on a cutting board.",
    "Dump spinach, smaller amount of flour and salt on countertop and mix with your fingers, then form into a pile. Make a deep well in the center and add the whole eggs and yolks to it. Use your fingertips to break up the eggs and begin moving your fingers in a circular motion, keeping the eggs within the well (or you’ll have egg lava running everywhere and be in a very bad mood). Each circular movement pulls in a little bit of flour from the sides. In a few minutes, the mixture will become thicker and thicker, finally becoming too tight to move easily with your fingers. At this point, you can use a bench scraper (a perfect tool here) or spatula to start adding the remaining, a little pile at a time. Once a shaggy dough has formed, begin kneading the mixture, scraping it up when it sticks, until a ball is formed. It will look flaky but will hold together.",
    "Knead the dough, pressing it away with the heels of your hands then forming it back into a blob, for 1 to 2 minutes, until the dough is moist but not sticky. Add remaining flour, a spoonful at a time, only if dough is too sticky. Add a drop or two of water only if it’s cracking when you knead it. In almost all cases, I find that erring on the side of firmer pasta is safer than softer pasta, which doesn’t hold shapes well and will want to stick a pasta roller. Let it rest for 5 minutes, then knead it again for 5 to 8 minutes. Wrap dough in plastic and let rest at room temperature for an hour.",
    "Divide dough into sixths. On a floured surface, roll the pasta as thin as you can; as thin as a credit card and translucent is ideal. Letting rolled-out pasta rest for 10 minutes before cutting it into your desired shape helps yield cleaner, easier cuts. ",
    "Cook pasta in a large pot of boiling, well-salted water for anywhere from 2 to 6 minutes (depending on thickness), until al dente. Drain and toss with fixings of your choice — garlic-sizzled olive oil or melted butter, parmesan or pecorino, dollops of ricotta or mascarpone. Eat immediately.",
    "Many notes:"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/fresh-spinach-pasta1.jpg?w=640",
  "ingredient_list": [
    "5 ounces baby spinach leaves",
    "2 3/4 to 3 cups all-purpose flour, preferably unbleached",
    "1/2 teaspoon sea salt or kosher salt",
    "3 large eggs",
    "3 large egg yolks",
    "Water (only if absolutely needed)",
    "Additional flour for rolling"
  ],
  "tags": [
    "Italian",
    "Pasta",
    "Photo",
    "Spinach",
    "Spring",
    "Vegetarian"
  ],
  "title": "fresh spinach pasta",
  "url": "https://smittenkitchen.com/2014/05/fresh-spinach-pasta/"
}