{
  "date": "2008-12-15T16:13:37+00:00",
  "directions": [
    "Prick potatoes with a fork. Microwave, covered with a paper towel, on high power until tender, 10 to 12 minutes.",
    "Cutting lengthwise, remove top fourth of each potato and scoop out centers (reserve for another use), leaving 1/2-inch-thick walls.",
    "Whisk together mayonnaise, 1 tablespoon water, tomato paste, anchovy paste, and 1 1/2 tablespoons mustard.",
    "Preheat oven to 350°F with rack in middle.",
    "Cook onion in oil with a pinch of salt in a small heavy skillet over medium heat, stirring occasionally, until golden, about 10 minutes.",
    "Meanwhile, tear bread into small pieces, then soak in milk in a medium bowl until very soft. Mix in sausage, parsley, onion, and 2 tablespoons mayonnaise sauce with your hands.",
    "Divide filling between potatoes, then coat skins lightly with oil. Bake in a 4-sided sheet pan until sausage is cooked through, about 30 minutes.",
    "While potatoes bake, whisk 1 tablespoon mayonnaise sauce with lemon juice, remaining 1 1/2 teaspoon mustard and 1/2 teaspoon water, and salt and pepper to taste.",
    "Remove potatoes from oven and turn on broiler. Spoon remaining mayonnaise sauce over filling and broil 3 to 4 inches from heat until charred in spots, 3 to 5 minutes. Cool slightly.",
    "Toss greens with dressing and serve with potatoes."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sausage-stuffed-potatoes-a-green-salad1.jpg?w=500",
  "ingredient_list": [
    "2 large russet (baking) potatoes (preferably organic; 3/4 pound each, scrubbed",
    "3 tablespoons mayonnaise",
    "1 tablespoon plus 1/2 teaspoon water, divided",
    "3/4 teaspoon tomato paste",
    "1/2 teaspoon anchovy paste",
    "2 tablespoons Dijon mustard, divided",
    "1/2 medium onion, finely chopped",
    "1 tablespoon olive oil plus additional for coating potatoes",
    "1/2 slice firm white sandwich bread",
    "1 tablespoon milk",
    "1/2 pound bulk breakfast sausage (1 cup) or 1/2 pound of breakfast sausage, casings removed",
    "1 tablespoon chopped parsley",
    "1/2 teaspoon fresh lemon juice",
    "5 cups salad greens (2 ounces)(we used arugula, which paired with the dijon sauce was deliciously kicky)"
  ],
  "tags": [
    "Budget",
    "Greens",
    "Meat",
    "Photo",
    "Potatoes"
  ],
  "title": "sausage-stuffed potatoes + a green salad",
  "url": "https://smittenkitchen.com/2008/12/sausage-stuffed-potatoes-a-green-salad/"
}