{
  "date": "2012-02-03T22:40:51+00:00",
  "directions": [
    "Make dough: In a small saucepan, heat the 4 tablespoons butter and 1/4 cup of beer, just until the butter has melted. Remove from heat and add the remaining 1/3 cup beer. Set aside to cool down slightly. You want the mixture warm (110 to 116 degrees), but not steaming hot. ",
    "Meanwhile, in the bowl of a stand mixer, stir together 2 cups of the all-purpose flour, sugar, yeast and table salt.  With the mixer on low, pour in the butter-beer mixture, mixing only until the flour is moistened. Add eggs, one at a time, and mix until combined. The batter will look lumpy, but will become smooth in a moment. Add the remaining 1/2 cup all-purpose flour and all of the rye flour, mixing until just combined. Replace paddle with a dough hook and let the machine knead the dough for 3 to 4 minutes on low. ",
    "Oil a medium/large bowl and transfer dough to it. Cover loosely with plastic wrap and set aside for 50 to 60 minutes, until doubled. Meanwhile, prepare fillings. ",
    "[Do ahead: You can also rest the dough in the fridge overnight — wrapped tightly with plastic. The next day, let it rest at room temperature for an hour before rolling out.]",
    "Make fillings: Back in the same small saucepan you used for the butter and beer, melt the 3 tablespoons butter. Remove from heat and whisk in mustard, Worcestershire and hot sauce until smooth. Set aside.",
    "In the bottom of a medium bowl, stir together mustard powder, paprika, table salt and several grinds of black pepper. Add shredded cheddar and toss until grated strands are evenly coated with spices. I like to keep this in the fridge until needed so it doesn’t get soft and clumpy, making it harder to sprinkle over the dough in a bit.",
    "Assemble bread: Either coat a 9-by-5 loaf pan lightly with butter or a nonstick spray and set aside. ",
    "Turn dough out onto a well-floured counter and roll the dough into a 20-by-12-inch rectangle, making sure it doesn’t stick to the counter by lifting sections and re-flouring the counter as needed. Brush the butter-mustard-Worcestershire mixture evenly over the whole surface, right up to the edges. Cut the dough crosswise into 5 strips; each should be 12-by-4 inches.  Sprinkle the first one evenly with a heaping 1/4 cup of the grated cheese (which is now fine to leave out at room temperature). Gently place another strip on top of it, coat it with another heaping 1/4 cup of cheese, and repeat with remaining strips until they are stacked 5-high and all of the cheese is used.",
    "With your very sharpest serrated knife, gently — so gently! The lightest sawing motions the weight of the blade will allow! — cut your stack into 6 to 7 2-inch segments (each stacked segment should be 4-by-2 inches). I say 6 to 7 range because while your 12-inch length should clearly yield only 6 2-inch segments, I find that the soft dough stretches so much when you lift and stack it that I end up with 7. Either amount will fit; this is totally not something to fret over.",
    "Arrange stacks of dough down the length of your prepared loaf pan as if filling a card catalog drawer. I make this easier by standing my loaf pan up on its short end to make the next part easier. If, when you finish filing all of your dough stacks, you ended up with less than needed for the dough “cards” to reach the end of the pan, when you return the pan to rest flat on the counter again, just shimmy it a little so the dough centers. It will all even out in the final rise/oven. If you ended up with too many dough cards, before you add the last stack, simply press gently on the dough already filed to make room for it.  ",
    "Loosely cover the pan with more plastic wrap and set it aside to rise again for 30 to 45 more minutes. Meanwhile, preheat your oven to 350 degrees.",
    "Bake loaf for 25 to 35 minutes, until puffed and brown. Transfer it to a wire rack and let it cool for 5 minutes before flipping it out onto a serving plate/cutting board. Serve warm with cold beer. ",
    "Loaf “pulls” apart the easiest when it is hot or warm. If it has cooled beyond the point that the layers wish to easily separate, simply serve it in thin slices. Wrap leftovers in plastic and keep at room temperature for a day. I bet the leftovers would be fantastic reheated with scrambled eggs.  "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cheddar-beer-and-mustard-pull-apart-bread1.jpg?w=500",
  "ingredient_list": [
    "Bread",
    "4 tablespoons (55 grams) unsalted butter",
    "1/4 cup plus 1/3 cup beer (140 ml), preferably dark but really, use whatever you like to drink",
    "2 1/2 cups (315 grams) all-purpose flour, divided",
    "1/3 cup (40 grams) rye flour (use additional a-p flour if you don’t have this)",
    "2 tablespoons (25 grams) granulated sugar",
    "2 1/4 teaspoons (1 envelope, 1/4 ounce or 7 grams) instant yeast",
    "1 teaspoon (6 grams) table salt",
    "2 large eggs, at room temperature",
    "Filling",
    "3 tablespoon (42 grams) unsalted butter",
    "1 tablespoon (15 grams) Dijon or a mustard of your choice",
    "1 1/2 teaspoons (8 ml) Worcestershire sauce",
    "Dash of hot sauce",
    "1 teaspoon (3 grams) mustard powder",
    "1 teaspoon (2 grams) paprika",
    "1/2 teaspoon (3 grams) table salt",
    "Several grinds black pepper",
    "1 1/2 cups (170 grams) shredded cheddar"
  ],
  "tags": [
    "Bread",
    "Photo",
    "Snack"
  ],
  "title": "cheddar, beer and mustard pull-apart bread",
  "url": "https://smittenkitchen.com/2012/02/cheddar-beer-and-mustard-pull-apart-bread/"
}