{
  "date": "2016-02-04T12:07:49+00:00",
  "directions": [
    "Heat oven to 300°F. Line a rimmed baking sheet with parchment paper; set aside. Lightly coat parchment and a the very largest bowl you own with nonstick spray. ",
    "Place 2 tablespoons oil and 2 to 3 kernels in a 3-quart or larger pot. Turn heat to medium-high and cover with a lid. When you hear these first kernels pop, add the remaining kernels and replace the lid. Using potholders, shimmy the pot around to keep the kernels moving as they pop. When several seconds pass between pops, remove from heat. Transfer to coated bowl. You should have about 8 cups popcorn. ",
    "Wipe out pot you used to pop corn. Add sugar and water to it, and bring to a boil over medium-high heat, only stirring until sugar has dissolved. Boil, swirling pan around (wear potholders) until caramel is a deep amber color, which took about 8 to 9 minutes in my already-heated-from-the-popcorn pot. Remove from heat and stir in butter (mixture will hiss and bubble furiously). Return to stove, reduce heat to medium-low, and cook for another 2 to 3 minutes, removing from the stove if it appears smoky sooner. Remove from heat and whisk (a whisk will best break it up) in the salt, baking soda and miso. ",
    "Quickly pour it over the prepared popcorn and toss to coat. You’ll be glad you used a gigantic bowl. I use two silicone spatulas to mix it up because it’s a messy project and popcorn will want to fall out. Whatever you do, do not pick up any caramel-coated popcorn that falls out unless you like burned fingertips. (Wait until it cools.) Coat popcorn as best as you can, but don’t fret if there are gaps. ",
    "Spread popcorn on prepared baking sheet. Sprinkle sesame seeds over. Bake in oven, tossing occasionally (which will also help coat any scantily-clad popped kernels) until mixture is dry, about 15 to 20 minutes. Let cool completely on baking sheet, then break it up into a large bowl. ",
    "Do ahead: Keeps at its very best for 4 hours. Longer, it can be stored in containers or bags at room temperature, but if the day is humid, it might get just a tiny bit sticky. Nobody will care.",
    " "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/miso-black-sesame-caramel-corn1.jpg?w=640",
  "ingredient_list": [],
  "tags": [
    "Candy",
    "Photo",
    "Snack"
  ],
  "title": "miso black sesame caramel corn",
  "url": "https://smittenkitchen.com/2016/02/miso-black-sesame-caramel-corn/"
}