{
  "date": "2013-05-15T11:01:47+00:00",
  "directions": [
    "Make the pancakes: Toss cabbage, carrot, kale, scallions and salt together in a large bowl. Toss mixture with flour so it coats all of the vegetables. Stir in the eggs. Heat a large heavy skillet on medium-high heat. Coat the bottom with oil and heat that too. ",
    "To make a large pancake, add 1/4 of the vegetable mixture to the skillet, pressing it out into a 1/2- to 3/4-inch pancake. Gently press the pancake down flat. Cook until the edges beging to brown, about 3 minutes. 30 seconds to 1 minute later, flip the pancake with a large spatula. (If this is terrifying, you can first slide the pancake onto a plate, and, using potholders, reverse it back into the hot skillet.) Cook on the other side until the edges brown, and then again up to a minute more (you can peek to make sure the color is right underneath).",
    "To make small pancakes, you can use tongs but I seriously find using my fingers and grabbing little piles, letting a little batter drip back into the bowl, and depositing them in piles on the skillet easier, to form 3 to 4 pancakes. Press down gently with a spatula to they flatten slightly, but no need to spread them much. Cook for 3 minutes, or until the edges brown. Flip the pancakes and cook them again until brown underneath. ",
    "Regardless of pancake size, you can keep them warm on a tray in the oven at 200 to 250 degrees until needed. ",
    "If desired, make okonomiyaki sauce: Combine all sauce ingredients in a small saucepan and let simmer for 3 to 5 minutes, until smooth and thick. ",
    "Serve pancakes with sauce and any of the other fixings listed above, from Japanese mayo to scallions and toasted sesame seeds. ",
    "Do ahead: Extra pancakes will keep in the fridge for a couple days, or can be spread on a tray in the freezer until frozen, then combined in a freezer bag to be stored until needed. Reheat on a baking sheet in a hot oven until crisp again."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/japanese-vegetable-pancakes.jpg?w=750",
  "ingredient_list": [
    "Pancakes",
    "1/2 small head cabbage, very thinly sliced (1 pound or 5 to 6 cups shreds) which will be easiest on a mandoline if you have one",
    "4 medium carrots, peeled into ribbons with a vegetable peeler",
    "5 lacinato kale leaves, ribs removed, leaves cut into thin ribbons",
    "4 scallions, thinly sliced on an angle",
    "1 teaspoon kosher salt",
    "1/2 cup all-purpose flour",
    "6 large eggs, lightly beaten",
    "Canola, safflower or peanut oil for frying",
    "Tangy Sauce",
    "1/4 cup ketchup",
    "1 1/2 tablespoons Worcestershire sauce (note: this is not vegetarian)",
    "1/4 teaspoon dijon mustard",
    "1 tablespoon rice cooking wine or sake",
    "1 teaspoon soy sauce",
    "1 tablespoon honey (use 2 if you like a sweeter sauce)",
    "1/8 teaspoon ground ginger"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Cabbage",
    "Carrots",
    "Japanese",
    "Kale",
    "Lunch",
    "Pancakes",
    "Put An Egg On It",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "japanese vegetable pancakes",
  "url": "https://smittenkitchen.com/2013/05/japanese-cabbage-and-vegetable-pancakes/"
}