{
  "date": "2008-11-07T21:11:29+00:00",
  "directions": [
    "Preheat oven to 400 degrees F.",
    "Roll out dough on generously floured (up to 1/4 cup) work surface to make 12-inch circle about 1/8-inch thick.  Roll dough loosely around rolling pin and unroll into pie plate, leaving at least 1-inch overhang all around pie plate.",
    "Working around circumference, ease dough into plate by gently lifting edge of dough with one hand while pressing into plate bottom with other hand. Refrigerate 15 minutes. Trim overhang to 1/2 inch beyond lip of pie plate. Fold overhang under itself; edge should be flush with edge of pie plate. Using thumb and forefinger, flute edge of dough. Refrigerate dough-lined plate until firm, about 15 minutes.",
    "Remove pan from refrigerator, line crust with foil and fill with pie weights or pennies. Bake on rimmed baking sheet 15 minutes. Remove foil and weights, rotate plate. Bake 5 to 10 more minutes until crust is golden brown and crisp. Remove plate and baking sheet from oven.",
    "Make the filling: While pie shell is baking, whisk cream, milk, eggs, yolks and vanilla together in medium bowl. Combine pumpkin puree, yams, sugar, maple syrup, ginger, cinnamon, nutmeg and salt in large heavy-bottomed saucepan; bring to sputtering simmer over medium heat, 5 to 7 minutes. Continue to simmer pumpkin mixture, stirring constantly and mashing yams against sides of pot, until thick and shiny, 10 to 15 minutes.",
    "Remove pan from heat. Whisk in cream mixture slowly, until fully incorporated. Strain mixture through fine-mesh strainer set over medium bowl, using back of ladle or spatula to press solids through strainer. Re-whisk mixture and transfer to warm pre-baked pie shell. Return pie plate with baking sheet to oven and bake pie for 10 minutes. Reduce heat to 300 degrees. Continue baking until edges are set (instant-read thermometer inserted in center registers 175 degrees), 20 to 35 minutes longer. Transfer pie to wire rack and cool to room temperature, 2 to 3 hours. (The pie finishes cooking with resident heat; to ensure the filling sets, cool it at room temperature and not in the refrigerator.)"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/silky-smooth-pumpkin-pie1.jpg?w=753",
  "ingredient_list": [
    "1 cup heavy cream",
    "1 cup whole milk (I used 2 cups of half and half instead of one cup each of cream and milk)",
    "3 large eggs plus 2 large egg yolks",
    "1 teaspoon vanilla extract",
    "1 (15-ounce) can pumpkin puree",
    "1 cup drained candied yams from 15-ounce can (regular canned yams can be substituted)",
    "3/4 cup sugar",
    "1/4 cup maple syrup",
    "2 teaspoons grated fresh ginger (I used 1 1/2 teaspoons of ground because I’m not a huge fan of fresh ginger)",
    "1/2 teaspoon ground cinnamon",
    "1/4 teaspoon ground nutmeg",
    "1 teaspoon table salt"
  ],
  "tags": [
    "Photo",
    "Pumpkin",
    "Tarts/Pies",
    "Thanksgiving"
  ],
  "title": "silky smooth pumpkin pie",
  "url": "https://smittenkitchen.com/2008/11/silky-smooth-pumpkin-pie/"
}