[
    {
        "ingredient_list": [
            "1 1/8 cups (225 grams) sugar, divided", 
            "4 teaspoons finely grated lemon peel (from two large lemons)", 
            "2 cups (260 grams) all purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "3/4 teaspoon fine sea or table salt", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, at room temperature", 
            "1 large egg", 
            "1 cup (235 ml) buttermilk", 
            "2 teaspoons (10 ml) vanilla extract", 
            "1 1/2 1/2-pint containers (about) fresh raspberries"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/05/raspberry-topped-lemon-muffins.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Fruit", 
            "Lemon", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Raspberries"
        ], 
        "url": "https://smittenkitchen.com/2007/05/a-new-muffin-in-town/", 
        "title": "raspberry-topped lemon muffins", 
        "directions": [
            "Preheat oven to 375°F. Line 14 standard muffin cups (or 56 minis) with paper liners. Mash 1/8 cup (25 grams) sugar and lemon peel in small bowl until sugar is slightly moist. Whisk flour, baking powder, and salt in medium bowl to blend. Using electric mixer, beat remaining 1 cup sugar and butter in large bowl until smooth. Beat in egg. Beat in buttermilk, then vanilla and lemon sugar. Beat in flour mixture.", 
            "Divide batter among muffin cups (the 2/3-3/4 level worked well for minis). Top each large muffin with 4 raspberries (or mini muffins with one each). Bake muffins until lightly browned on top and tester inserted into center comes out clean, about 35 minutes (baking time was on the shy side of 20 minutes for mini muffins). "
        ], 
        "date": "2007-05-11T15:19:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound spiral-shaped pasta", 
            "1 pound slender asparagus spears, trimmed, cut into 1- to 1 1/2-inch pieces", 
            "1/4 cup olive oil", 
            "1 tablespoon finely grated lemon peel", 
            "2 teaspoons chopped fresh tarragon plus more for garnish", 
            "1 5- to 5 1/2-ounce log soft fresh goat cheese (the pre-crumbled stuff will not melt as well)", 
            "Fresh lemon juice to taste (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/asparagus-goat-cheese-and-lemon-pasta1.jpg?w=500", 
        "tags": [
            "Asparagus", 
            "Budget", 
            "Lemon", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2009/05/asparagus-goat-cheese-and-lemon-pasta/", 
        "title": "asparagus, goat cheese and lemon pasta", 
        "directions": [
            "Cook your pasta in a large pot of well-salted water until it is almost tender, or about three minutes shy of what the package suggests. Add asparagus and cook until firm-tender, another two to three minutes. Drain both pasta and asparagus together, reserving one cup of pasta water.", 
            "Meanwhile, combine olive oil, lemon peel, tarragon and cheese in a large bowl, breaking up the goat cheese as you put it in. Add hot pasta and asparagus to bowl, along with a couple slashes of the pasta water. Toss until smoothly combined, adding more pasta water if needed. Season generously with salt and pepper, and lemon juice if you feel it needs a little extra kick. (We did.)"
        ], 
        "date": "2009-05-17T17:50:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup water", 
            "2 tea bags (whatever you like for iced tea)", 
            "1 cup bourbon", 
            "1/4 cup granulated sugar", 
            "1 1/2 cups orange juice (about 3 well-squeezed oranges)", 
            "6 tablespoons lemon juice (about 2 lemons)", 
            "16 to 17 ounces (about 5 cups of small pieces of ice) ice cubes", 
            "Mint sprigs or lemon slices, for garnish "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/bourbon-slush-punch1.jpg?w=640", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Lemon", 
            "Orange", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/07/bourbon-slush-punch/", 
        "title": "bourbon slush punch", 
        "directions": [
            "Boil 1 cup water for tea. Add the tea bags and let steep until cool. Discard the tea bags and set aside. Pour tea into a pitcher. Add bourbon, sugar, orange juice and lemon juice and refrigerate until needed. Don’t worry about stirring the sugar so that it dissolves; after 30 minutes in the fridge, it will have. ", 
            "To serve: Shake or stir punch base to ensure ingredients are evenly distributed. To make two liters of punch, add base and full amount of ice cubes to your blender, blending until the ice is crushed and slushy. For each individual glass of punch, place 1/2 cup punch base and slightly heaped 1/2 cup small pieces of ice (mine were chipped off an ice block; don’t ask) and blend until slushy. Add an extra whole ice cube or two to glasses if desired. Garnish glass with a sprig of mint or slice of lemon."
        ], 
        "date": "2014-07-24T12:01:28+00:00"
    }, 
    {
        "ingredient_list": [
            "Sponge", 
            "6 tablespoons (3 ounces) warm water", 
            "1 teaspoon sugar", 
            "1 1/2 teaspoons instant yeast", 
            "1/4 cup (1 ounce) unbleached all-purpose flour", 
            "Dough", 
            "Sponge (above)", 
            "6 tablespoons (3 ounces) sour cream or yogurt", 
            "1/4 cup (4 tablespoons or 2 ounces) unsalted butter, softened", 
            "2 large eggs, 1 beaten for dough, 1 beaten with 1 teaspoon water for brushing bread", 
            "1/4 cup (1 3/4 ounces) sugar", 
            "1 teaspoon salt", 
            "1 teaspoon vanilla extract", 
            "2 1/2 cups (10 5/8 ounces) unbleached all-purpose flour", 
            "Pearl sugar* or sparkling white sugar for sprinkling", 
            "Lemon cream cheese filling", 
            "1/3 cup (2 1/2 ounces) cream cheese, softened", 
            "2 tablespoons (5/8 ounces) sugar", 
            "2 tablespoons (1 ounce) sour cream", 
            "1 teaspoon fresh lemon juice", 
            "2 tablespoons (1/2 ounce) unbleached all-purpose flour", 
            "1/4 cup (2 ounces) homemade (recipe below) or prepared lemon curd  ", 
            "3 tablespoons fresh lemon juice", 
            "3/4 teaspoon fresh lemon zest, finely grated", 
            "3 tablespoons sugar", 
            "1 large egg", 
            "2 tablespoons unsalted butter, cut into small pieces"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/braided-lemon-bread.jpg?w=750", 
        "tags": [
            "Bread", 
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Easter", 
            "Lemon", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/05/braided-lemon-bread/", 
        "title": "braided lemon bread", 
        "directions": [
            "Whisk together juice, zest, sugar, and egg in a 1-quart heavy saucepan. Stir in butter and cook over moderately low heat, whisking frequently, until curd is thick enough to hold marks of whisk and first bubble appears on surface, about 4 to 5 minutes. Transfer lemon curd to a bowl and chill, its surface covered with plastic wrap, until cold, at least 1 hour. "
        ], 
        "date": "2010-05-13T20:50:56+00:00"
    }, 
    {
        "ingredient_list": [
            "6 cups canned low-salt chicken broth", 
            "3 1/2 tablespoons butter", 
            "1 1/2 tablespoons olive oil", 
            "2 large shallots, chopped", 
            "2 cups arborio rice or medium-grain white rice", 
            "1/4 cup dry white wine", 
            "1 cup freshly grated Parmesan cheese (about 3 ounces)", 
            "2 tablespoons chopped fresh parsley", 
            "2 tablespoons fresh lemon juice", 
            "4 teaspoons grated lemon peel"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/catch-up-solstice-edition1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Fruit", 
            "Grain/Rice", 
            "Italian", 
            "Lemon", 
            "Photo", 
            "Seafood"
        ], 
        "url": "https://smittenkitchen.com/2007/06/catch-up-solstice-edition/", 
        "title": "lemon risotto", 
        "directions": [
            "Bring broth to simmer in large saucepan over medium heat. Reduce heat to low; cover to keep warm. Melt 1 1/2 tablespoons butter with oil in heavy large saucepan over medium heat. Add shallots and saute until tender, about 6 minutes. Add rice; stir 1 minute. Add wine and stir until evaporated, about 30 seconds. Add 1 1/2 cups hot broth; simmer until absorbed, stirring frequently. Add remaining broth 1/2 cup at a time, allowing broth to be absorbed before adding more and stirring frequently until rice is creamy and tender, about 35 minutes. Stir in cheese and remaining 2 tablespoons butter. Stir in parsley, lemon juice, and lemon peel. Season risotto with salt and pepper. Transfer to bowl and serve."
        ], 
        "date": "2007-06-21T23:18:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound fresh broccoli", 
            "3 tablespoons olive oil, divided", 
            "1/2 teaspoon coarse or kosher salt", 
            "A few pinches of pepper flakes, to taste", 
            "Finely grated zest of half a lemon, or more to taste", 
            "1 large or 2 small garlic cloves, minced", 
            "Juice of half a lemon, or more to taste, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/crispy-broccoli-with-lemon-and-garlic1.jpg?w=750", 
        "tags": [
            "Broccoli", 
            "Budget", 
            "Citrus", 
            "Lemon", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/04/crispy-broccoli-with-lemon-and-garlic/", 
        "title": "crispy broccoli with lemon and garlic", 
        "directions": [
            "Heat oven to 425°F (220°C). ", 
            "Prep your broccoli: Wash broccoli well — seriously, there is always a stem-colored worm hidden in the florets when I buy organic or from a farmer’s market, hooray for fewer pesticides! — and pat dry. Slice straight through the broccoli stem(s) as close to the crown of florets as possible. The crown should naturally break into several large florets, and you can cut these down into more manageable chunks. I find that less mess is made and less broccoli rubble is lost when I cut not down through the florets tops to halve chunks but up through the attached stems. (See 2nd photo above.) After cutting through the stem, I use my hands to break the floret the rest of the way in two. Don’t let the stems go to waste. I peel off the tough outer skin and knots and cut the stems into 1/2-inch segments; they cook up wonderfully this way, and at the same speed as the florets.", 
            "Drizzle the first tablespoon of oil over your baking sheet or roasting pan and brush or roll it around so it’s evenly coated. In a large bowl, toss prepared florets and stems with remaining olive oil, garlic, pepper flakes, salt and lemon zest until they’re evenly coated. Spread broccoli in an even layer in prepared pan. ", 
            "Roast for 20 minutes, then use a spatula to flip and move pieces around for even cooking. Roast another 10 to 15 minutes, checking every 5, until broccoli is toasty and as crisp as you like it. (As you can see, we like a serious char on ours.)", 
            "From the oven, taste a floret for seasoning and add more salt and pepper flakes if needed. Shower with fresh lemon juice and eat immediately, as-is or follow one of the adventures below.", 
            "7 More Insanely Delicious Things To Do With Crispy Broccoli "
        ], 
        "date": "2015-04-28T12:00:13+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound cucumber(s), peeled or unpeeled, cut into large chunks, plus a few extra thin cucumber slices for garnish", 
            "1 cup lemon juice (from about 7 to 8 lemons, although juiciness will vary)", 
            "1/3 cup granulated sugar", 
            "2 cups cold water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cucumber-lemonade1.jpg?w=640", 
        "tags": [
            "Citrus", 
            "Cucumber", 
            "Drinks", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/09/cucumber-lemonade/", 
        "title": "cucumber lemonade", 
        "directions": [
            "Run cucumber through a blender or food processor until pureed, then run it for a full extra minute to ensure that it’s as processed as possible. Set a fine-mesh strainer or a regular strainer lined with a couple layers of cheesecloth or a coffee filter over a pitcher and pour cucumber puree through it, stirring to help it move along faster. Discard solids. In the pitcher, you should have about 1 cup cucumber juice.* Add lemon juice and sugar to it, then water. Give it a good stir or shake, and let it sit in the fridge (to get it started chilling) for 15 minutes, after which a couple more stirs or shakes should leave the sugar fully dissolved. Taste lemonade, adding more sugar or water if desired. (See Notes up top about concentration and sweetness.) Serve chilled over ice, with or without a splash of seltzer on top. You can fancy up the glass with a garnish of cucumber slice, if desired.", 
            "Can we put gin in this? Of course you can.", 
            "* Of course, if you have a juicer, you can use it here to the same effect."
        ], 
        "date": "2014-09-18T11:59:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 fresh pizza dough", 
            "1 large onion, halved and thinly sliced", 
            "1 to 2 tablespoons heavy cream", 
            "Fresh sage leaves (I slivered up about 5 of them)", 
            "1 piece of thick-cut bacon, cut into lardons", 
            "1 to 2 tablespoons onion marmalade", 
            "Salt and pepper to taste", 
            "1 lemon, seeded and roughly chopped", 
            "2 cups sugar", 
            "2 pounds strawberries, hulled", 
            "Juice of 1 to 2 lemons"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/i-do-salad-pizza-sorbet-and-the-loot-it-rode-it-on1.jpg?w=500", 
        "tags": [
            "Ice Cream/Sorbet", 
            "Lemon", 
            "Photo", 
            "Pizza", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2006/07/i-do-salad-pizza-sorbet-and-the-loot-it-rode-it-on/", 
        "title": "onion pizza + strawberry sorbet", 
        "directions": [
            "Makes 1 1/2 quarts."
        ], 
        "date": "2006-07-23T18:01:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1-2-3-4 Cake", 
            "Adapted from several sources: this cake is a classic", 
            "1 cup (2 sticks) butter, at room temperature", 
            "2 cups sugar", 
            "4 eggs", 
            "3 cups sifted self-rising flour*", 
            "1 cup milk", 
            "1 teaspoon pure vanilla extract ", 
            "8 egg yolks", 
            "1 1/2 cups sugar", 
            "1/4 cup (1/2 stick) butter", 
            "3 lemons, zest grated and juiced", 
            "Place the ingredients in the double boiler over boiling water. Don’t let top pan touch the water. Cook and stir until mixture begins to gel or thicken ever-so-slightly. Remove from heat and allow to cool. Cover and refrigerate it to thicken. ", 
            "5 tablespoons water", 
            "1/4 teaspoon cream of tartar", 
            "1 1/3 cups sugar", 
            "2 large eggs whites at room temperature", 
            "1 tablespoon light corn syrup", 
            "1 teaspoon vanilla", 
            "1/2 to 1 cup chopped nuts or shredded sweetened dried coconut (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/layered-lemon-love1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Citrus", 
            "Fruit", 
            "Lemon", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/09/layered-lemon-love/", 
        "title": "lemon layer cake", 
        "directions": [
            "Whisk first five ingredients together in a large, stainless-steel bowl. Set the bowl in a wide, deep skillet filled with about 1 inch of simmering water. Make sure the water level is at least as high as the depth of the egg whites in the bowl. Beat the whites on low speed until the mixture reaches 140 degrees F on an instant-read thermometer. Do not stop beating while the bowl is in the skillet, or the egg whites will be overcooked. If you cannot hold the thermometer stem in the egg whites while continuing to beat, remove the bowl from the skillet just to read the thermometer, then return the bowl to the skillet, or yell “[Insert your husband/wife/sig-other’s name here]!! Halp! Can you check the temperature of this for me!!!” It might or might not work. ", 
            "Beat on high speed for exactly five minutes. Remove the bowl from the skillet and add vanilla, beating on high speed for two to three more minutes to cool. Stir in coconut or nuts, if you are using them. ", 
            "Use this frosting the day it is made.", 
            "Lemon Layer Cake Assembly: Add 1 tablespoon of filling to the cake pedestal. Run hands along the side of the cake to remove excess crumbs. Place the cake layers on the pedestal, spreading filling between the layers and on top. Spread the sides and top of the cake with the remaining filling. Frost top and sides of cake with frosting.  ", 
            "Why my cake might look thinner than yours: Or, d’oh!  From the looks of Paula Deen’s cake, I assumed it would be too tall for my cake carrier, and made the third layer into cupcakes instead that I’d save for another occasion. Turns out, the cakes might have been just fine (or, I took out too much batter), so I split them into halves, creating a thin four-layer cake instead. Nobody noticed!"
        ], 
        "date": "2007-09-06T16:23:42+00:00"
    }, 
    {
        "ingredient_list": [
            "For the crust: ", 
            "1/2 pound unsalted butter, at room temperature", 
            "1/2 cup granulated sugar", 
            "2 cups flour", 
            "1/8 teaspoon kosher salt", 
            "For the full-size lemon layer: ", 
            "6 extra-large eggs at room temperature", 
            "2 1/2 cups granulated sugar", 
            "2 tablespoons grated lemon zest (4 to 6 lemons)", 
            "1 cup freshly squeezed lemon juice", 
            "1 cup flour", 
            "4 extra-large eggs at room temperature", 
            "1 2/3 cups granulated sugar", 
            "1 tablespoon + 1 teaspoon grated lemon zest (3 to 4 lemons)", 
            "2/3 cup freshly squeezed lemon juice", 
            "2/3 cup flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/01/lemon-bars.jpg?w=750", 
        "tags": [
            "Bars", 
            "Citrus", 
            "Cookie", 
            "Fruit", 
            "Lemon", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/01/lemon-bars/", 
        "title": "lemon bars", 
        "directions": [
            "Confectioners’ sugar, for dusting", 
            "Preheat the oven to 350°F and grease a 9 by 13 by 2-inch baking sheet.", 
            "For the crust, cream the butter and sugar until light in the bowl of an electric mixer fitted with the paddle attachment. Combine the flour and salt and, with the mixer on low, add to the butter until just mixed. Dump the dough onto a well-floured board and gather into a ball. Flatten the dough with floured hands and press it into the greased baking sheet, building up a 1/2-inch edge on all sides. Chill.", 
            "Bake the crust for 15 to 20 minutes, until very lightly browned. Let cool on a wire rack. Leave the oven on.", 
            "For the lemon layer, whisk together the eggs, sugar, lemon zest, lemon juice, and flour. Pour over the crust and bake for 30 to 35 minutes (less if you are using the thinner topping), or about five minutes beyond the point where the filling is set. Let cool to room temperature.", 
            "Cut into rectangles and dust with confectioners’ sugar."
        ], 
        "date": "2008-01-07T23:12:57+00:00"
    }, 
    {
        "ingredient_list": [
            "4 lemons", 
            "4 cups water", 
            "Sugar, to taste (we used 3 tablespoons, like a tart lemonade)", 
            "Handful of fresh mint leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/lemon-mint-granita1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Fruit", 
            "Ice Cream/Sorbet", 
            "Lemon", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/06/lemon-mint-granita/", 
        "title": "lemon mint granita", 
        "directions": [
            "Clean and wash the lemons. Cut off the top quarter of the lemons and slice a thin bevel off the bottom, so they can stand up straight. (You can skip this step if you don’t want to serve them in frozen lemon cups.) Using a grapefruit knife, carefully remove all of the lemon flesh and juice (working over a bowl ensures you won’t lose any), being careful not to cut through the bottom. Stand the lemons on a plate or cookie sheet and freeze until solid.", 
            "Using a food processor (a blender will work as well), toss a handful of washed and dried fresh mint leaves into the work bowl. (I used about 25 to 30 leaves from 6 to 9 sprigs.) Add the scooped out lemon flesh and juice, and pulse until mostly pureed. Let mixture stand for 15 minutes, so the mint releases its flavor, then press the mixture through a fine-mesh strainer. You’ll end up with approximately one cup of lemon-mint juice.", 
            "Stir in the water, then sugar, one tablespoon at a time until the sugar is dissolved and the mixture is to your desire level of sweetness. Pour the mixture into a large roasting pan or baking dish, large enough that the liquid isn’t more than one-inch deep. (Otherwise it takes forever to freeze, trust me. A 9×13-inch pan worked great here.)", 
            "Freeze for one hour, then remove the mixture and scrape with two forks to break up the ice. (Your freezing time will vary, depending on the temperature and muscle of your freezer.) Return to the freezer and freeze until solid, about 2 to 3 hours, scraping it again with forks every hour or so.", 
            "When the granita is frozen, rake until glittery. Scoop into frozen lemon shells (or, you know, plain old dishes) and serve before Deb gets to it."
        ], 
        "date": "2009-06-03T11:47:31+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/lemon-ricotta-pancakes-with-sauteed-apples11.jpg?w=640", 
        "tags": [
            "Apple", 
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Fruit", 
            "Lemon", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/lemon-ricotta-pancakes-with-sauteed-apples/", 
        "title": "lemon ricotta pancakes with sauteed apples", 
        "directions": [
            "Serve the pancakes with the sauteed apples and the maple syrup. "
        ], 
        "date": "2007-11-03T21:57:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups (190 grams) + 1 tablespoon (10 grams) all-purpose flour (if you’re skipping the fruit, you can also skip the last tablespoon of flour)", 
            "2 teaspoons (10 grams) baking powder", 
            "1/2 teaspoon kosher salt", 
            "1 cup (230 grams) plain whole-milk yogurt", 
            "1 cup plus 1 tablespoon (215 grams) sugar", 
            "3 extra-large eggs", 
            "2 teaspoons grated lemon zest (approximately 2 lemons)", 
            "1/2 teaspoon pure vanilla extract", 
            "1/2 cup (120 ml) vegetable oil", 
            "1 1/2 cups (about 255 grams) blueberries, fresh or frozen, [updated to note] no need to thaw (I used wild blueberries, hence the tiny size)", 
            "1/3 cup (80 ml) freshly squeezed lemon juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/04/lemon-yogurt-anything-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Citrus", 
            "Everyday Cakes", 
            "Fruit", 
            "Lemon", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/04/lemon-yogurt-anything-cake/", 
        "title": "lemon yogurt anything cake", 
        "directions": [
            "Preheat the oven to 350°F. Grease an 8 1/2 by 4 1/4 by 2 1/2-inch loaf pan. Line the bottom with parchment paper. Grease and flour the pan.", 
            "Sift together 1 1/2 cups flour, baking powder, and salt into 1 bowl. In another bowl, whisk together the yogurt, 1 cup sugar, the eggs, lemon zest, vanilla and oil. Slowly whisk the dry ingredients into the wet ingredients. Mix the blueberries with the remaining tablespoon of flour, and fold them very gently into the batter. Pour the batter into the prepared pan and bake for about 50 (+) minutes, or until a cake tester placed in the center of the loaf comes out clean.", 
            "Meanwhile, cook the 1/3 cup lemon juice and remaining 1 tablespoon sugar in a small pan until the sugar dissolves and the mixture is clear. Set aside.", 
            "When the cake is done, allow it to cool in the pan for 10 minutes before flipping out onto a cooling rack. Carefully place on a baking rack over a sheet pan. While the cake is still warm, pour the lemon-sugar mixture over the cake and allow it to soak in (a pastry brush works great for this, as does using a toothpick to make tiny holes that draw the syrup in better). Cool."
        ], 
        "date": "2008-04-07T11:50:17+00:00"
    }, 
    {
        "ingredient_list": [
            "2 sticks (225 grams or 8 ounces) unsalted butter, at room temperature", 
            "2 1/2 cups (500 grams) sugar", 
            "4 extra-large eggs, at room temperature", 
            "1/3 cup grated lemon zest (6 to 8 large lemons)", 
            "3 cups (375 grams) all-purpose flour", 
            "1/2 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1 teaspoon (5 grams) kosher salt", 
            "3/4 cup (175 ml) plus 3 1/2 tablespoons (50 ml) freshly squeezed lemon juice", 
            "3/4 cup (175 ml) buttermilk, at room temperature", 
            "1 teaspoon (5 ml) vanilla extract", 
            "2 cups (240 grams) confectioners’ sugar, sifted."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/10/lemon-cake.jpg?w=750", 
        "tags": [
            "Celebration Cakes", 
            "Citrus", 
            "Easter", 
            "Everyday Cakes", 
            "Lemon", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/10/lemony-persnick/", 
        "title": "lemon cake", 
        "directions": [
            "1. Heat oven to 350 degrees F (175 degrees C). Grease and flour two 8 1/2-by-4 1/4-by-2 1/2-inch loaf pans, and line the bottoms with parchment paper.", 
            "2. Cream butter and 2 cups sugar in the bowl of an electric mixer fitted with a paddle attachment for about 5 minutes, or until light and fluffy. Mixing at medium speed, add eggs, one at a time, and lemon zest.", 
            "3. Sift together flour, baking powder, baking soda and salt in a bowl. In another bowl, combine 1/4 cup lemon juice, buttermilk and vanilla. Add flour and buttermilk mixtures alternately to butter and sugar mixture, beginning and ending with flour. Divide batter evenly between pans, smooth tops, and bake for 45 minutes to 1 hour, until a cake tester comes out clean.", 
            "4. Combine 1/2 cup sugar with 1/2 cup lemon juice in a small saucepan, and cook over low heat until sugar dissolves.", 
            "5. When cakes are done, let them cool 10 minutes. Invert them onto a rack set over a tray, and spoon lemon syrup over cakes. Let cakes cool completely.", 
            "6. For glaze, combine confectioners’ sugar and remaining 3 1/2 tablespoons lemon juice in a bowl, mixing with a whisk until smooth. Pour over top of cakes, and allow glaze to drizzle down the sides."
        ], 
        "date": "2006-10-09T09:18:58+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 tablespoons freshly grated lemon zest (from about 2 lemons; preferably Meyer)", 
            "2 1/2 cups all-purpose flour", 
            "1/2 cup sugar plus 3 tablespoons additional if using fresh cranberries", 
            "1 tablespoon baking powder", 
            "1/2 teaspoon salt", 
            "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits", 
            "1 1/4 cups fresh cranberries, chopped coarse, or 1 1/4 cups dried cranberries, if you insist", 
            "1 large egg", 
            "1 large egg yolk", 
            "1 cup heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/meyer-lemon-and-fresh-cranberry-scones1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Cranberries", 
            "Fall", 
            "Fruit", 
            "Lemon", 
            "Photo", 
            "Scones/Biscuits", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/11/meyer-lemon-and-fresh-cranberry-scones/", 
        "title": "meyer lemon and fresh cranberry scones", 
        "directions": [
            "Accompaniment: creme fraiche or whipped cream", 
            "Preheat oven to 400°F. and line a large baking sheet with parchment paper.", 
            "With a vegetable peeler remove the zest from lemons and chop fine, reserving lemons for another use.", 
            "In a food processor pulse flour, 1/2 cup sugar, baking powder, salt, butter and zest until mixture resembles coarse meal and transfer to a large bowl.", 
            "In a small bowl toss together fresh cranberries and 3 tablespoons sugar and stir into flour mixture. If using dried fruit, add to flour mixture.", 
            "In another small bowl lightly beat egg and yolk and stir in cream. Add egg mixture to flour mixture and stir until just combined.", 
            "On a well-floured surface with floured hands pat dough into a 1-inch-thick round (about 8 inches in diameter) and with a 2-inch round cutter or rim of a glass dipped in flour cut out as many rounds as possible, rerolling scraps as necessary. Arrange rounds about 1 inch apart on baking sheet and bake in middle of oven 15 to 20 minutes, or until pale golden.", 
            "[I decided to rebel and pat them into a square and cut them into smaller ones. The square shapes didn’t keep very well, so I don’t recommend this! Learn from me, people.]", 
            "Serve scones warm with creme fraiche or whipped cream. Scones keep, individually wrapped in plastic wrap and foil, chilled, 1 day or frozen 1 week."
        ], 
        "date": "2008-11-15T11:58:01+00:00"
    }, 
    {
        "ingredient_list": [
            "For the base:", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 teaspoon freshly grated lemon zest", 
            "1/8 teaspoon table salt", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cut into chunks", 
            "1 cup (125 grams) flour", 
            "For the lemonade layer", 
            "1 cup (about 5 ounces or 140 grams) raspberries", 
            "2 large eggs", 
            "3/4 cup (150 grams) granulated sugar", 
            "1/4 cup freshly squeezed lemon juice; this should only require 2 lemons", 
            "1/3 cup (40 grams) all-purpose flour", 
            "Confectioners’ sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Citrus", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/08/pink-lemonade-bars/", 
        "title": "pink lemonade bars", 
        "directions": [
            "Preheat your oven to 350°F (180°C) and line an 8x8x2-inch baking pan with parchment, letting it extend up two sides. Butter or coat the bottom and sides with a nonstick spray and set the pan aside.", 
            "Make the base: In a food processor, pulse together the sugar, zest and salt until combined. Add the butter and pulse until it is evenly dispersed in the dough. Add the flour and pulse the machine until it’s just combined and the mixture is crumbly. Press the dough into the prepared pan and about 1/2-inch up the sides. Don’t worry about making this perfect; mine was an uneven mess and nobody can tell. Bake for 15 minutes, until lightly browned at edges. Let cool on a rack while you prepare the filling (though no need for it to be completely cool when you fill it). Leave oven on.", 
            "Make the pink lemonade layer: Puree the raspberries in your food processor until they’re as liquefied as they’ll get. I don’t even bother cleaning mine between steps, but I’m also probably lazier than you. Run the puree through a fine-mesh sieve, trying to press out all the raspberry puree that you can, leaving the seeds behind. I ended up with 1/3 cup strained puree; don’t worry if you get a smidge less.", 
            "In a medium bowl, whisk together the eggs, sugar and lemon juice until smooth. Whisk in 3 tablespoons of raspberry puree. Stir in flour. Pour into cooling crust and return pan to the oven, baking the bars until they’re set (they’ll barely jiggle) and slightly golden at the edges, about 25 to 30 minutes. Cool completely before cutting into rectangles. (You can speed this up in the fridge.)", 
            "I intended to cut mine into 32 2×1-inch rectangles but actually cut them into 28 2×1-ish rectangles. I like lemony bars small but you could also cut them into 16 2×2-inch squares. Dust with powdered sugar before serving. Store in fridge for up to a week."
        ], 
        "date": "2012-08-03T13:26:11+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup granulated sugar", 
            "1 3/4 cups water (1 cup can be very cold)", 
            "1 cup (about 5 ounces or 140 grams) fresh or frozen raspberries", 
            "1 cup lemon juice (from approximately 7 to 8 lemons)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/9625541640_9753729a31_o.jpg?w=750", 
        "tags": [
            "Citrus", 
            "Lemon", 
            "Photo", 
            "Popsicles", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/08/pink-lemonade-popsicles/", 
        "title": "pink lemonade popsicles", 
        "directions": [
            "No popsicle molds? You could any kind of tiny cup to mold them instead, but my favorite is a champagne flute for shape; you could even use those disposable plastic ones. When the mixture is halfway frozen, insert a popsicle stick and now no retro popsicle mold needs to come between you and Popsicle Week.", 
            "To unmold: To unmold popsicles, dip the frozen molds in a warm bowl of water. I give them a tug every couple seconds to see if they’re loose yet because I don’t want to soften them any more thn absolutely necessary. If the stick comes out before the popsicle (boo!), they just weren’t frozen enough. You’ll want to freeze most popsicles for 5 to 6 hours, just to be certain they’re hard enough to unmold.", 
            "To store popsicles: Here’s how I do it: I put a tray in the freezer and cover it with waxed or parchment paper, just long enough for it to get cold. I unmold all of the popsicles and place them on the tray, and refreeze them for 10 minutes out of their molds before putting them in a freezer bag. This extra step ensures that any melting/softening that happens when you unmold them doesn’t mess up their shapes or cause them to stick to one another. You can also separate them in their freezer bags by extra strips of waxed or parchment paper. Then you can wash the molds and use them again for everything you may have missed this week."
        ], 
        "date": "2013-08-30T08:47:00+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups cold water", 
            "1/4 cup plus 1 tablespoon granulated sugar, divided", 
            "1 cup (about 5 ounces) fresh raspberries, blackberries or sliced strawberries", 
            "1 cup lemon juice (from 4 to 6 lemons, depending on size and juicer efficiency)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade1.jpg?w=640", 
        "tags": [
            "Blackberries", 
            "Citrus", 
            "Drinks", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/05/pink-lemonade/", 
        "title": "picnic pink lemonade", 
        "directions": [
            "In a 1-liter carafe, combine water and 1/4 cup granulated sugar and shake it several times. Set this aside in the fridge to chill and dissolve while you prepare the other ingredients.", 
            "Combine your berry of choice with remaining tablespoon of sugar; it’s best to let the strawberries sit with the sugar for 10 minutes to get the color and juices flowing; blackberries and raspberries can be used right away. Blend the berries and sugar until fully pureed, and then a minute longer. Press through a fine-mesh strainer if you, like me, prefer your lemonade without seeds. You should have a generous 1/4 cup of each puree.", 
            "Remove sugar water carafe from the fridge; if sugar hasn’t fully dissolved, give it a few more shakes and it will. Add lemon juice and berry puree. For the pink hues you see above, use 1 tablespoon blackberry puree, 2 tablespoons raspberry puree or 4 tablespoons (or all) of the strawberry puree. If you don’t mind a dark red/purple color and want a stronger black- or raspberry flavor, you can use all of the puree. Extra puree makes an ideal yogurt or yogurt popsicle stir-in, or can be used for additional batches of pink lemonade, because this will go on repeat.", 
            "Give the carafe another shake, and drink right away or chill until your next picnic. ", 
            "A whole bunch of things about lemonade, from an obsessive: "
        ], 
        "date": "2015-05-29T12:03:04+00:00"
    }, 
    {
        "ingredient_list": [
            "2/3 cup sugar", 
            "8 large egg yolks", 
            "1 large whole egg", 
            "1 1/2 tablespoons finely grated lemon zest (from 2 lemons)", 
            "1/2 cup all-purpose flour", 
            "1/2 cup cornstarch", 
            "Pinch of salt (edited to add this)", 
            "2 sticks (1/2 pound) unsalted butter, melted and cooled a bit", 
            "1/2 cup poppy seeds (I got this from one 3-ounce spice bottle)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/poppy-seed-lemon-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Citrus", 
            "Lemon", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/01/poppy-seed-lemon-cake/", 
        "title": "poppy seed lemon cake", 
        "directions": [
            "Preheat the oven to 325°F Butter and flour an 8-inch*  fluted Bundt or tube pan generously. (This cake very much wants to stick. Don’t let it!)  Butter the dull side of a 10-inch piece of foil.", 
            "* I only had a 10-inch and it worked fine; the cake was done about 10 minutes sooner.", 
            "In the bowl of an electric mixer fitted with the whisk, beat the sugar with the egg yolks and whole egg at medium-high speed until the mixture is pale yellow and very fluffy, about 8 minutes. Beat in the lemon zest. Sift the flour and cornstarch over the egg mixture and fold in along with the pinch of salt with a rubber spatula. At medium speed, beat in the butter, then beat in the poppy seeds.", 
            "Pour the batter into the prepared pan and cover tightly with the buttered foil. Bake for 45 minutes, or until the cake pulls away from the side of the pan and a cake tester inserted in the center of the cake comes out clean. Remove the foil and let the cake cool in the pan on a rack for 15 minutes. Invert the cake onto the rack and let cool completely before serving, at least 30 minutes.", 
            "Do ahead: The cake can be wrapped in plastic and foil and left at room temperature for up to 3 days. "
        ], 
        "date": "2010-01-09T13:17:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 ounces (3 tablespoons) gin (Hendricks is specified; Tanqueray was used)", 
            "1 1/2 ounces (3 tablespoons) Pimm’s No. 1 liqueur (what’s Pimm’s?)", 
            "4 ounces (1/2 cup) homemade lemonade (recipe below)", 
            "7-Up or another lemon/lime soda", 
            "10 paper-thin half moon slices of cucumber (I used an “English”, unwaxed, cucumber)", 
            "1 part freshly squeezed lemon juice", 
            "1 part simple syrup, or to taste (I will use perhaps 1/2 or 3/4 of a part next time, see Note above)", 
            "2 parts water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/porch-swing.jpg?w=748", 
        "tags": [
            "Drinks", 
            "Lemon", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/07/porch-swing/", 
        "title": "porch swing", 
        "directions": [
            "Make simple syrup: [Please don’t buy it. I see it in stores and it vexes me.] Simmer one part water with one part sugar (I did a cup of each and ended up with about 1 1/2 cups simple syrup) until sugar has dissolved. Let cool. Or, you can use my speedier method where you simmer one part sugar with half as much water and once it has dissolved, add the second half of the water, cold, which cools the mixture down faster (when you like nothing to slow your pace to the nearest drink)."
        ], 
        "date": "2010-07-06T11:23:29+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large lemons, preferably Meyers", 
            "2 cups sugar", 
            "1/4 teaspoon salt", 
            "4 eggs", 
            "4 tablespons butter, melted", 
            "3 tablespoons all-purpose flour", 
            "1 egg white", 
            "Coarse sugar, for sprinkling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/shaker-lemon-pie1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Lemon", 
            "Photo", 
            "Tarts/Pies", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/04/shaker-lemon-pie/", 
        "title": "shaker lemon pie", 
        "directions": [
            "Dough for one double-crust pie [See recipes here and here.]", 
            "Thoroughly wash lemons, then dry with paper towel. Finely grate lemon zest into a bowl. Using a mandoline, slice lemons as paper thin as you can get them; remove and discard seeds. Add slices to zest and toss with sugar and salt. Cover and set aside at room temperature for 24 hours.", 
            "Preheat the oven to 425°F. Roll out half the dough 1/8 inch thick on a lightly floured surface, fit it into a 9-inch (1-quart) pie plate, and trim the edge, leaving a 1/2-inch overhang.", 
            "Mix the macerated lemon-sugar mixture with eggs, melted butter and flour until combined well. Pour in to prepared pie shell.", 
            "Roll out the remaining dough into a 12-inch round on a lightly floured surface, drape it over the filling, and trim it, leaving a 1-inch overhang. Fold the overhang under the bottom crust, pressing the edge to seal it, and crimp the edge decoratively. Beat one egg white until frothy and brush over pie crust, then sprinkle with coarse sugar. Cut slits in the crust with a sharp knife, forming steam vents, and bake the pie in the middle of the oven for 25 minutes. Reduce the temperature to 350°F. and bake the pie for 20 to 25 minutes more, or until the crust is golden. Let the pie cool on a rack and serve it warm at room temperature."
        ], 
        "date": "2008-04-02T15:28:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound spaghetti or linguine", 
            "Salt", 
            "3 lemons", 
            "1/4 cup extra virgin olive oil , plus additional for serving", 
            "1/4 cup heavy cream", 
            "1 ounce finely grated Parmesan cheese (about 1/2 cup), plus additional for serving", 
            "Ground black pepper", 
            "Small handful fresh basil or arugula (what I used, deliciously, in a pinch) leaves, shredded"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaghetti-with-lemon-and-olive-oil-al-limone1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Date Night", 
            "Italian", 
            "Lemon", 
            "Pasta", 
            "Photo", 
            "Travel", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/02/spaghetti-with-lemon-and-olive-oil-al-limone/", 
        "title": "spaghetti with lemon and olive oil", 
        "directions": [
            "Cook linguine or spaghetti in well-salted water to your al dente tastes in a large, wide-bottomed pot. (You’ll have fewer dishes to wash if you use this pot to assemble the dish as well.) ", 
            "While pasta is cooking, zest lemons until you have a little shy of a tablespoon of zest. Juice lemons — you’ll have anywhere from 1/3 to 1/2 cup lemon juice.  ", 
            "Drain pasta, reserving 1 1/2 cups of pasta cooking water. Dry out your pot, then boil the olive oil, cream, zest and 1 cup of the reserved pasta water together for two minutes over high heat.  Return pasta to pot and stir until coated. Add the cheese and 1/4 cup lemon juice and toss, toss, toss everything together. Add more pasta water, 1/4 cup at a time, if you’d like your dish a little looser. Quickly taste a strand of pasta and see if you want to add the remaining lemon juice (we did). Stir in basil or arugula and season generously with salt and pepper. ", 
            "Serve immediately, drizzling individual portions with a bit of extra olive oil and sprinkling with extra Parmesan cheese."
        ], 
        "date": "2011-02-24T12:00:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup freshly squeezed lemon juice (with an efficient squeezer, you should get this plus up to 1/3 cup extra from 2 pounds of 8 lemons)", 
            "2 1/2 cups cold water, plus additional if needed", 
            "1/4 to 1/2 cup maple syrup", 
            "Bourbon", 
            "Lots of ice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/5719436567_ffb51c3a26_b.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Citrus", 
            "Drinks", 
            "Lemon", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2011/05/vermontucky-lemonade/", 
        "title": "vermontucky lemonade", 
        "directions": [
            "Mix lemon juice with 2 1/2 cups water and 1/4 cup maple syrup. Taste for sweetness. If you like your lemonade sweeter, add remaining 1/4 cup maple syrup. If you found the sweetness just right, add an additional 1/4 cup cold water instead. Stir to mix. This will yield 1 quart of maple lemonade.", 
            "Fill a glass with ice. We have a fiery debate at my house about whether this drink needs 1 or 1 1/2 shots of bourbon; my husband prefers more, but I like this drink a bit weaker. I’ll let you choose. Pour your desired amount of bourbon over the ice, fill the glass the rest of the way with maple lemonade and let the force of summer be with you."
        ], 
        "date": "2011-05-14T18:17:20+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (2 ounces) fresh-squeezed lemon juice", 
            "1/2 cup (4 ounces) fresh watermelon puree, strained through a coarse strainer to remove seeds", 
            "3 tablespoons (1 1/2 ounces) simple syrup*", 
            "3/4 cup (6 ounces) cold water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/watermelon-lemonade.jpg?w=750", 
        "tags": [
            "Citrus", 
            "Drinks", 
            "Fruit", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2009/07/watermelon-lemonade/", 
        "title": "watermelon lemonade", 
        "directions": [
            "Stir it all together and serve over ice. Garnish it with a thin watermelon or lemon wedge, if you’re feeling fancy.", 
            "Spritzy variation: I have never met a beverage I didn’t think would taste better bubbly, thus, if you’re looking for a spritzier version of this, swap one-third (1/4 cup) or more of the water with seltzer or sparkling water.", 
            "Boozy variation: My husband thinks this would taste even better with a splash of vodka. I am not one to argue.", 
            "* Make your own simple syrup: Please. I see it sold in stores and it just boggles my mind. Simmer one part water with one part sugar (I did a cup of each and ended up with more than I needed for a quadruple batch) until sugar has dissolved. Let cool. Or, you can use my speedier method where you simmer one part sugar with half as much water and once it has dissolved, add the second half of the water, cold, which cools the mixture down faster (when you like nothing to slow your pace to the nearest mocktail)."
        ], 
        "date": "2009-07-02T17:48:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1 average-sized lemon (about 4 1/2 ounces; 130 grams), rinsed and dried*", 
            "1 1/2 cups (300 grams) sugar", 
            "1 stick (4 ounces or 115 grams) unsalted butter, cut into chunks", 
            "4 large eggs", 
            "2 tablespoons (14 grams) cornstarch", 
            "1/4 teaspoon table salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/02/whole-lemon-tart.jpg?w=753", 
        "tags": [
            "Citrus", 
            "Fruit", 
            "Lemon", 
            "Photo", 
            "Tarts/Pies", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2009/02/whole-lemon-tart/", 
        "title": "whole lemon tart", 
        "directions": [
            "Center a rack in the oven and preheat the oven 350°F (175°C). Place the tart shell on a baking sheet, which you can line with foil or parchment paper to make any spills a breeze to clean up.", 
            "Cut the lemon in half and take a look at the thickness of the white ring of the skin. Does it look thick to you, perhaps 1/4-inch thick or larger? If so, go ahead and remove the skin from one half of the lemon before proceeding. If it looks normal or not especially thick, you’ll be just fine. In both cases, slice the lemon halves into thin wheels, remove any seeds, and toss the rounds — lemon flesh and peel — sugar and chunks of butter into the container of a food processor. Process, scraping down the sides of the container as needed, until the lemon is thoroughly pureed. Add the eggs, cornstarch and salt and pulse until the batter is smooth. ", 
            "Pour into prepared tart shell. It will fill it completely but if due to slight variances in tart pans, egg sizes, lemon sizes or crust thickness, you have too much, do not pour it past the top of of your crust or it will become difficult to unmold later. ", 
            "Bake for 35 to 40 minutes or until the filling is set. You can test this by bumping the pan a little; it should only jiggle slightly. In my oven, I find that the point at which the filling is set is also when it starts to get very light brown on top. ", 
            "Let cool on rack, unmold tart pan and serve. I actually prefer this tart completely chilled, which makes it a great dessert to make in advance of a dinner or party. ", 
            "*  Meyer lemons might seem the obvious choice here, and they will work, but I actually prefer this with the sharp, less floral, intensity of standard grocery store lemons (Eureka variety). "
        ], 
        "date": "2009-02-04T18:46:17+00:00"
    }
]