{
  "date": "2010-06-04T09:48:17+00:00",
  "directions": [
    "To make the pistachio tapenade: In a food processor combine the pistachios, olives, capers, garlic, herbs and puree. While the machine is running, slowly drizzle in olive oil until the mixture becomes a paste. Add the zest and pulse 1 more time, drizzling in more oil if necessary. Reserve until ready to use.",
    "If using a rack of ribs: Remove 2 rib bones from the 8 rib rack to make it a 6-rib rack. Counting from either end, remove the 2nd and 7th bones; this will create 6 even chops that are thicker than a normal lamb chop. Cut 6 even chops.",
    "Cook your chops: Season your six lamb chops generously on either side with salt and freshly ground black pepper. Allow them to sit for 10 to 15 minutes before cooking.",
    "Preheat oven to 425 degrees F. Coat a large saute pan generously with olive oil and bring to medium-high heat. When the oil is hot but not smoking, add the lamb chops and cook for about 2 minutes on each side to brown. If the pan begins to smoke, lower the heat. The chops should be beautifully caramelized on both sides. Remove the chops to a sheet pan and schmear generously with the pistachio tapenade. Place in preheated oven and cook another 4 to 5 minutes for medium rare. Remove chops from oven and let rest for at least 5 minutes before serving.",
    "* My addition. Does anyone know why not a single Anne Burrell recipe calls for black pepper, only salt? I would love to hear your theories!"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/lamb-chops-with-pistachio-tapenade.jpg?w=749",
  "ingredient_list": [
    "1/2 cup pistachios, shelled and toasted",
    "1/2 cup pitted green (what I used) or Cerignola (what Burrell recommends) olives",
    "2 tablespoons capers",
    "1 clove garlic, smashed",
    "1 tablespoon freshly chopped oregano leaves (nixed because mine had gone bad)",
    "2 tablespoons freshly chopped parsley leaves",
    "Extra-virgin olive oil",
    "1 lemon, zested",
    "1 (8-rib) rack of lamb or 6 lamb chops",
    "Salt",
    "Freshly ground black pepper*"
  ],
  "tags": [
    "Easter",
    "Meat",
    "Photo",
    "Quick"
  ],
  "title": "lamb chops with pistachio tapenade",
  "url": "https://smittenkitchen.com/2010/06/lamb-chops-with-pistachio-tapenade/"
}