{
  "date": "2017-06-30T12:24:31+00:00",
  "directions": [
    "Heat your grill over medium-high.",
    "Divide your dough into four quarters. Use your hands to gently stretch it into a thinner blob — it doesn’t need to be round — then lay it on a plate where you can stretch it further. We’re looking for a thin dough but it doesn’t need to be paper-thin or it might get too cracker-like once cooked. For this reason, I absolutely prefer hand-stretched over rolling pin-rolled for grilled pizza. You want an uneven, hand-stretched, thinness with some thicker spots. Repeat with other three quarters.\nBrush tops of each thinly with olive oil. Place doughs oil-side-down on the grill (it will not fall through, promise) and cook for just a minute or two, until lightly browned underneath but still very doughy and soft on top. While they’re cooking, brush the tops of the doughs lightly with olive oil.\nOnce undersides are lightly cooked, remove doughs from grill and place cooked-side-up on a large tray. Thinly coat each cooked top with prepared sauce, then scatter with cheese. I like to season my pizzas at this point with a little salt and pepper before cooking them.\nSlide each pizza back onto the grill and cook, lid down, until undersides are browned with a tiny char spot or two, and cheese has melted. If you abhor a pale pizza top, you could run these under your oven’s broiler for a minute for a toastier lid, but we rarely bother as the whole point is to cook and eat outside. Finish with fresh basil and eat immediately."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/how-to-grill-pizza.jpg?w=750",
  "ingredient_list": [
    null,
    "Olive oil, for brushing",
    "1 generous cup prepared tomato sauce (see note up top about doctoring your own)",
    "8 ounces aged mozzarella (sold in plastic, not water) (this amount is light on the cheese, use more if that’s your preference)",
    "1/4 cup finely grated parmesan or pecorino romano cheese",
    "Salt and pepper, to taste",
    "A few leaves of fresh basil, torn or sliced"
  ],
  "tags": [
    "Grilling",
    "Pizza",
    "Recipes",
    "Summer",
    "Tips"
  ],
  "title": "grilled pizza",
  "url": "https://smittenkitchen.com/2017/06/grilled-pizza/"
}