{
  "date": "2015-11-20T11:50:15+00:00",
  "directions": [
    "Heat oven to 400 degrees. Either grease bottom and sides of an 8×8-inch pan or line the bottom and sides with parchment paper. ",
    "In a small saucepan, combine dates, water and zest over low heat, simmering for 5 to 10 minutes, until liquid has absorbed and mixture has thickened. Set aside while you make the crumbs.",
    "In a large bowl, mix the sugars and oil or butter together. Add the oats, flour, spices, baking soda and salt and stir to combine; the mixture should form a coarse rubble. ",
    "Press half into the bottom of your prepared pan. Dollop the date mixture over it and use a small offset spatula (or whatever you have on hand) to spread the mixture smoothly over the crumbs. Don’t worry if the crumbs move around a little underneath; these bars don’t require perfection. Sprinkle remaining crumbs over date layer and press lightly to cover. ",
    "Bake bars for 25 minutes, or until light brown at the edges. Cool in pan. Cut into squares. They’ll keep just fine at room temperature but will last up to a week in the fridge and longer in the freezer."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-breakfast-squares1.jpg?w=750",
  "ingredient_list": [
    "For the filling",
    "1 1/2 cups (8 ounces) pitted dates, chopped",
    "3/4 cup water",
    "1 teaspoon finely grated orange (or mandarin or clementine) zest",
    "For the crumbs",
    "2 tablespoons packed brown sugar",
    "1/4 cup raw or turbinado sugar",
    "1/2 cup olive oil, coconut oil, melted butter or a mix of the above",
    "3/4 cups rolled oats, I used quick-cooking but old-fashioned should work just fine",
    "3/4 cup plus 2 tablespoons whole wheat flour, or a wholegrain flour mix of your choice",
    "1/2 teaspoon ground cinnamon",
    "A few gratings of fresh nutmeg",
    "A pinch or two of ground cloves",
    "1/4 teaspoon baking soda",
    "1/4 teaspoon coarse sea salt"
  ],
  "tags": [
    "Bars",
    "Breakfast",
    "Dates",
    "Photo",
    "Snack",
    "Vegan"
  ],
  "title": "date breakfast squares",
  "url": "https://smittenkitchen.com/2015/11/date-breakfast-squares/"
}