[
    {
        "ingredient_list": [
            "3/4 cup (177 ml) warm water  (105° to 110°F)", 
            "2 tablespoons (30 ml) milk, slightly warmed", 
            "1 1/2 teaspoons (6 grams) sugar", 
            "1 1/4 teaspoons (5 grams) active dry yeast", 
            "2 cups (250 grams) all-purpose flour", 
            "1/2 teaspoon (3 grams) salt", 
            "6 tablespoons (90 ml) olive oil", 
            "1 1/2 cups halved Concord, red or black grapes, seeded", 
            "1 teaspoon fresh rosemary needles", 
            "2 tablespoons (8 grams) raw or another coarse sugar", 
            "2 teaspoons coarse sea salt (heads up: some are finding this too salty; if you’re worried, use less)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/grape-focaccia-with-rosemary1.jpg?w=500", 
        "tags": [
            "Bread", 
            "Grapes", 
            "Photo", 
            "Picnics", 
            "Snack", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/09/grape-focaccia-with-rosemary/", 
        "title": "grape focaccia with rosemary", 
        "directions": [
            "In the bowl of an electric mixer fitted with the paddle attachment, stir together the water, milk, sugar, and yeast. Let the mixture sit until foamy, about 10 minutes. Add the flour, salt and 2 tablespoons of the olive oil to the yeast mixture and mix well on low. Attach the dough hook, raise the speed to medium-low and knead the dough for 8 minutes longer.", 
            "[And yes, you can stir this together entirely by hand with a wooden spoon, then smash it around on a floured counter to “knead” it for a bit. It’ll be sticky, but doable, and of course you’ll get to say you made bread “old school” style.]", 
            "Brush a large bowl with a generous amount of olive oil. Scrape dough into the bowl and brush the top with additional oil. Cover with plastic wrap and let it rise in a cool place until it doubles in bulk, 1 1/2 to 2 hours.", 
            "Press the dough down with a floured hand. Turn the dough out onto a floured surface and divide it into two balls. Brush a large baking sheet (or two small ones) with olive oil, place the balls of dough on it and brush the top with more oil. Set it aside for 20 minutes, lightly covered with a kitchen towel. After 20 minutes, dip your fingers in olive oil and press and stretch each ball of dough into a 8 to 9-inch circle-ish shape. It will be dimpled from your fingers. Cover again with the towel and let it rise for another 1 1/4 hours in a cool place.", 
            "Preheat the oven to 450°F. Brush tops of dough with remaining olive oil and top the sprinkle grapes, rosemary, coarse sugar and coarse sea salt evenly over the dough. Bake for 15 minutes, until the crust is golden brown and puffed around edges. Let cool before serving. Serve warm or at room temperature. Try not to eat the whole thing like, uh, some people we might know."
        ], 
        "date": "2010-09-07T20:30:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound red or black grapes, preferably seedless", 
            "1 cup white wine vinegar", 
            "1 cup granulated sugar", 
            "1 1/2 teaspoons brown mustard seeds (hm, mine might have been yellow? I was unconcerned.)", 
            "1 teaspoon whole black peppercorns", 
            "1 (2 1/2-inch) cinnamon stick, cut in half (if using two jars, otherwise leave whole)", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/04/3447237193_064b81a107_b.jpg?w=753", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Fruit", 
            "Grapes", 
            "Photo", 
            "Pickled", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/04/pickled-grapes-with-cinnamon-and-black-pepper/", 
        "title": "pickled grapes with cinnamon and black pepper", 
        "directions": [
            "Rinse and dry the grapes, and pull them carefully from their stems. Using a small sharp knife, trim away the “belly button” at the stem end of the grape (and try not to eat all of the belly buttons at once, m’kay?), exposing a bit of the flesh inside. Divide the grapes among 2 pint-sized clean, dry canning jars.", 
            "In a medium saucepan, combine the remaining ingredients. Bring to a boil over medium heat and then you have two choices. The original recipe has you pour the bring mixture over the grapes and let them cool together. I personally prefer a cold brine on certain foods, not wanting to wilt the fresh fruit, so I cool the brine completely before pouring it over. The former will yield a more tender pickle, and it will pick up the brine’s flavor faster. The latter will take a bit longer to souse, but the grapes will stay more firm. Both will be delicious.", 
            "Once cool, chill the grape and brine mixture in their jars in the refrigerator for at least eight hours or overnight. Serve cold, perhaps at a cheese course, and I say you should let people figure out for themselves what they’re eating."
        ], 
        "date": "2009-04-17T10:35:07+00:00"
    }
]