[
    {
        "ingredient_list": [
            "8 tablespoons (1 stick, 4 ounces or 113 grams) butter, melted", 
            "1 cup (218 grams or 7 3/4 ounces for light; 238 grams or 8 3/8 ounces for dark) brown sugar", 
            "1 large egg", 
            "1 teaspoon vanilla or 1/2 teaspoon almond extract", 
            "Pinch salt", 
            "1 cup (4 3/8 ounces or 125 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/blondies.jpg?w=749", 
        "tags": [
            "Bourbon", 
            "Brown Butter", 
            "Brownies/Blondies", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/blondies/", 
        "title": "blondies, infinitely adaptable", 
        "directions": [
            "Further additions, use one or a combination of: ", 
            "New favorite combination of late (added 5/24/14): We’ve gotten on a kick making these again, but I’ve really wanted to increase the toasty butterscotch flavor and have done so by: browning the butter, using dark brown sugar but only 3/4 cup (I prefer these less sweet these days), increasing the vanilla to 1 1/2 teaspoons and the salt to 1/4 teaspoon fleur de sel or flaky sea salt, plus a few flakes crumbled on top. I use 1 cup chopped bittersweet chocolate and 1/2 cup chopped walnuts or pecans as the mix-ins. Hope this provides some inspiration!"
        ], 
        "date": "2006-11-25T19:37:39+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/08/2804182114_6d9ebd8506_b.jpg?w=753", 
        "tags": [
            "Bourbon", 
            "Fruit", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/08/bourbon-peach-hand-pies/", 
        "title": "bourbon peach hand pies", 
        "directions": [
            "1. To make the pastry, in a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour. If preparing ahead of time, the dough can be stored at this point for up to one month in the freezer.", 
            "2. Divide the refrigerated dough in half. On a lightly floured work surface, roll out one half of the dough to 1/8-inch thickness. Using a 4 1/2-inch-round biscuit cutter, cut seven circles out of the rolled dough. Transfer the circles to a parchment-lined baking sheet, and place in the refrigerator to chill for about 30 minutes. Repeat the rolling, cutting, and chilling process with the remaining half of dough. (I used a 4-inch cutter–if you can call a “cutter” the tin edge of the container that holds my smaller round cutters–and managed to get 12 from each dough half, after rerolling the scraps.)", 
            "3. Make the filling: Peel and chop the peaches into small bits (approx. 1/2-inch dice), much smaller than you’d use for a regular-sized pie. Mix them with the flour, sugar and pinch of salt, and add the bourbon and vanilla, if you wish.", 
            "4. Remove the chilled dough from the refrigerator, and let stand at room temperature until just pliable, 2 to 3 minutes. Spoon about 1 to 2 tablespoons filling (use the smaller amount for a 4-inch circle) onto one half of each circle of dough. Quickly brush a little cold water around the circumference of the dough, and fold it in half so the other side comes down over the filling, creating a semicircle. Seal the hand pie, and make a decorative edge by pressing the edges of the dough together with the back of a fork. Repeat process with remaining dough. Place the hand pies back on the parchment-lined baking sheet, and return to the refrigerator to chill for another 30 minutes.", 
            "5. Heat oven to 375 degrees. Remove the chilled hand pies from the refrigerator, cut a small slit in each and lightly brush with the egg yolk wash. Sprinkle sanding sugar generously over the pies, and place pies in the oven to bake. Bake until the hand pies are golden brown and just slightly cracked, about 20 minutes. Remove the pies from the oven, and let stand to cool slightly before serving."
        ], 
        "date": "2008-08-28T16:12:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup water", 
            "2 tea bags (whatever you like for iced tea)", 
            "1 cup bourbon", 
            "1/4 cup granulated sugar", 
            "1 1/2 cups orange juice (about 3 well-squeezed oranges)", 
            "6 tablespoons lemon juice (about 2 lemons)", 
            "16 to 17 ounces (about 5 cups of small pieces of ice) ice cubes", 
            "Mint sprigs or lemon slices, for garnish "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/bourbon-slush-punch1.jpg?w=640", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Lemon", 
            "Orange", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/07/bourbon-slush-punch/", 
        "title": "bourbon slush punch", 
        "directions": [
            "Boil 1 cup water for tea. Add the tea bags and let steep until cool. Discard the tea bags and set aside. Pour tea into a pitcher. Add bourbon, sugar, orange juice and lemon juice and refrigerate until needed. Don’t worry about stirring the sugar so that it dissolves; after 30 minutes in the fridge, it will have. ", 
            "To serve: Shake or stir punch base to ensure ingredients are evenly distributed. To make two liters of punch, add base and full amount of ice cubes to your blender, blending until the ice is crushed and slushy. For each individual glass of punch, place 1/2 cup punch base and slightly heaped 1/2 cup small pieces of ice (mine were chipped off an ice block; don’t ask) and blend until slushy. Add an extra whole ice cube or two to glasses if desired. Garnish glass with a sprig of mint or slice of lemon."
        ], 
        "date": "2014-07-24T12:01:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup firmly packed brown sugar", 
            "2 tablespoons butter", 
            "1 tablespoon vanilla", 
            "2 teaspoons bourbon (optional)", 
            "1 1/2 cups whipping cream", 
            "2 cups half-and-half (light cream)", 
            "6 large egg yolks (hint: if you make a hazelnut brown butter cake, you should have these in your fridge already!)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/butterscotch-ice-cream1.jpg?w=500", 
        "tags": [
            "Bourbon", 
            "Ice Cream/Sorbet", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/03/butterscotch-ice-cream/", 
        "title": "butterscotch ice cream", 
        "directions": [
            "1. In a 1- to 2-quart pan over medium heat, stir brown sugar and butter until butter is melted, sugar is dissolved, and mixture is bubbly, 3 to 4 minutes. Whisk in 1/2 cup whipping cream until smooth; remove butterscotch mixture from heat. Add vanilla and bourbon, if using.", 
            "2. In a 3- to 4-quart pan over medium-high heat, combine remaining 1 cup whipping cream and the half-and-half; bring to a simmer.", 
            "3. Meanwhile, in a bowl, beat egg yolks to blend. Whisk 1/2 cup of the warm cream mixture into egg yolks, then pour egg yolk mixture into pan with cream. Stir constantly over low heat just until mixture is slightly thickened, 2 to 4 minutes. Immediately remove from heat.", 
            "4. Pour through a fine strainer into a clean bowl and whisk in butterscotch mixture. Chill until cold, stirring occasionally, about 2 hours; or cover and chill up to 1 day.", 
            "5. Freeze mixture in an ice cream maker according to manufacturer’s instructions. Serve softly frozen, or transfer ice cream to an airtight container and freeze until firm, at least 6 hours or up to 1 week.", 
            "Note: If you serve with espresso-chocolate shortbread cookies, your friends might never leave. Proceed with caution."
        ], 
        "date": "2008-03-14T18:56:02+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/bourbon-pumpkin-cheesecake.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Cake", 
            "Celebration Cakes", 
            "Photo", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2006/11/candy-corn-for-really-lucky-grown-ups/", 
        "title": "bourbon pumpkin cheesecake", 
        "directions": [
            "Garnish: pecan halves ", 
            "Make crust: Invert bottom of a 9-inch springform pan (to create flat bottom, which will make it easier to remove cake from pan), then lock on side and butter pan.", 
            "Stir together crumbs, pecans, sugars, and butter in a bowl until combined well. Press crumb mixture evenly onto bottom and 1/2 inch up side of pan, then chill crust, 1 hour.", 
            "Make filling and bake cheesecake: Put oven rack in middle position and Preheat oven to 350°F.", 
            "Whisk together pumpkin, eggs, brown sugar, cream, vanilla, and liqueur (if using) in a bowl until combined.", 
            "Stir together granulated sugar, cornstarch, cinnamon, nutmeg, ginger, and salt in large bowl. ", 
            "Add cream cheese and beat with an electric mixer at high speed until creamy and smooth, about 3 minutes. Reduce speed to medium, then add pumpkin mixture and beat until smooth.", 
            "Pour filling into crust, smoothing top, then put springform pan in a shallow baking pan (in case springform leaks). Bake until center is just set, 50 to 60 minutes. Transfer to rack and cool 5 minutes. (Leave oven on.)", 
            "Make topping: Whisk together sour cream, sugar, and liqueur (if using) in a bowl, then spread on top of cheesecake and bake 5 additional minutes.", 
            "Cool cheesecake completely in pan on rack, about 3 hours.", 
            "Chill, covered, until cold, at least 4 hours. Remove side of pan and bring to room temperature before serving.", 
            "Do ahead: Baked cheesecake can be chilled, covered, up to 2 days."
        ], 
        "date": "2006-11-22T14:12:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup sweetened condensed milk", 
            "1/2 cup unsweetened coconut milk", 
            "2 tablespoons salted or unsalted butter (salted will give the candy more contrast)", 
            "2 teaspoons light corn syrup", 
            "1/3 cup finely shredded unsweetened coconut (I lightly toasted mine, for crunch)", 
            "1/3 cup ground pistachios (see Note below)", 
            "1/3 cup chocolate sprinkles or “vermicelli” (see Note below)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/coconut-milk-fudge1.jpg?w=500", 
        "tags": [
            "Brazilian", 
            "Candy", 
            "Coconut", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/03/coconut-milk-fudge/", 
        "title": "coconut milk fudge", 
        "directions": [
            "In a medium-size heavy saucepan, combine condensed milk, coconut milk, butter and corn syrup. Bring to a boil over medium heat. Reduce heat to low and whisk constantly until fudgy. The recipe notes that when mixture is ready, it will pull together into one soft piece, leaving browned residue on bottom of pan and that this should take 8 to 10 minutes. This took me 20 to 25 minutes, and the candy began taking on a beige, caramelized color.", 
            "Slide mixture into a bowl. (Don’t scrape the pan; leave any residue behind.) Let cool to room temperature, then refrigerate until very firm, at least 4 hours. Or, you could realize that the nanny has to leave in an hour, chill it for only 30 and discover that nothing bad will happen if you don’t wait the whole cooling time. You’ll have to be more careful if you use “real” i.e. meltable chocolate sprinkles but otherwise it will have no ill-effect to speed the process up.) ", 
            "Scoop out teaspoonfuls of the mixture (I used my one teaspoon measure) and use your hands to roll into balls, about 3/4-inch in diameter. I found having just a drop or two of water in my palms — not wet, just a little moist — helped form them. Set aside on a baking sheet.", 
            "Place toppings in wide bowls and roll brigadeiros through them, covering the surface completely.  Store in an airtight container at room temperature for 2 days, or refrigerate for up to 1 month. Serve at room temperature.", 
            "Chocolate “vermicelli”: I got a little freaked out when I saw the ingredient list on the chocolate sprinkles I had brought home from the store. Look, I don’t need to pretend that chocolate sprinkles are health food, but I like to imagine I’m eating something with at least a minute smidgen of chocolate in it. I ended up spending way too much on a bottle of “chocolate vermicelli” (they look like chocolate sprinkles but are almost 100% pure chocolate, and delightfully, taste that way too) but I’d buy them next time from Amazon or King Arthur Flour’s Baker’s Catalog for much less.", 
            "Pistachios: Since toasted nuts always, always taste better than raw ones, I toasted and ground a batch to coat the candy only to find the brown/green shade… um, a little unpretty. Looks won out and I used ground raw pistachios in the end. I actually ended up preferring the softness of the coating.", 
            "Those tiny cups: I know someone is going to ask me where I bought those colorful little candy cups and I’m sorry, as my answer could not be more inconvenient: Vienna. A grocery store. I’m kind of obsessed with going to grocery stores in foreign countries and always walk out with random stuff like this. Anyway, Amazon sells #4 size cups (1-inch base) in brown and white; however, mine are actually #3 size (3/4 to 7/8-inch base) which I found online at a smaller store."
        ], 
        "date": "2010-03-08T13:02:22+00:00"
    }, 
    {
        "ingredient_list": [
            "Winter Warmth Syrup", 
            "1 1/2 cups water", 
            "1 cup raw, demerara or turbinado sugar (granulated will do just fine if you do not have them)", 
            "1/2 apple, peeled, cored, and diced", 
            "1/2 pear, peeled, cored, and diced", 
            "12 walnut halves", 
            "3 cinnamon sticks, broken up", 
            "6 whole cloves", 
            "1 whole nutmeg", 
            "For Each Cocktail", 
            "1 piece of orange peel (about 1 by 2 inches)", 
            "3/4 ounce Winter Warmth Syrup (recipe above)", 
            "2 dashes of bitters (Fee Brothers black walnut bitters are recommended, I used orange bitters)", 
            "2 ounces bourbon, rye or Canadian whisky"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/the-fairytale-of-new-york1.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Christmas", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/fairytale-of-new-york/", 
        "title": "fairytale of new york", 
        "directions": [
            "Make the winter warmth syrup: Combine all ingredients in a saucepan over medium heat. Bring to a simmer, stirring until the sugar dissolves, and simmer for 15 to 20 minutes. Remove from the heat and cool. Strain into a clean glass bottle, cover and refrigerate for up to 2 weeks. Makes about 2 cups.", 
            "Make a drink: Place the orange peel, syrup and bitters in a low glass and muddle. Pour in whiskey, add a large ice cube and don’t forget to share. ", 
            "Make a carafe: We brought 2 4-cup carafes of this to a party, using all of the syrup and about 5 1/2 cups bourbon. We tossed a few orange peels into each jar. Don’t forget to remind friends to pour it over ice (we forgot), so they are not asleep before, you know, Santa comes down the chimney."
        ], 
        "date": "2014-12-23T11:56:26+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups chocolate cookie crumbs or about 260 grams chocolate cookies", 
            "1 1/2 cups pecans, toasted and cooled", 
            "1/2 cup bourbon", 
            "1 cup powdered sugar", 
            "3 tablespoons unsweetened cocoa powder", 
            "1 1/2 tablespoons honey or molasses", 
            "Sprinkles, sanding or coarse sugar, additional chopped nuts, extra cookie crumbs or coconut to roll balls in"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/fudgy-bourbon-balls1.jpg?w=640", 
        "tags": [
            "Bourbon", 
            "Candy", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/12/fudgy-bourbon-balls/", 
        "title": "fudgy bourbon balls", 
        "directions": [
            "In the bowl of a food processor, pulse together the cookies, whole or already in crumbs, and pecans until the nuts are finely ground. In small dish, whisk together the bourbon, powdered sugar, cocoa and honey until smooth. Add to the food processor bowl and pulse until just combined. ", 
            "Set aside at room temperature, uncovered, for 30 minutes to 1 hour, or up to 4 hours, to give the crumbs a chance to absorb the liquid and become more fudgy and easier to roll.", 
            "Scoop dough into about 1-inch or 1 tablespoon-sized balls and roll them in toppings of your choice. The balls can be stored at room temperature or in the fridge. If at room temperature, you can leave them covered for more moisture or uncovered if you like them with more of a crust. Balls will keep for as long as you can hide them from people. ", 
            "Notes: I’m going to do a little Q&A with the comment section that lives in my head. :) "
        ], 
        "date": "2015-12-31T11:25:56+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 ripe bananas, smashed", 
            "1/3 cup (75 grams) melted salted butter", 
            "3/4 to 1 cup (145 to 190 grams) light brown sugar (depending on the level of sweetness you prefer, I always use the smaller amount)", 
            "1 egg, beaten", 
            "1 teaspoon (5 ml) vanilla", 
            "1 tablespoon (15 ml) bourbon (optional)", 
            "1 teaspoon (5 grams) baking soda", 
            "Pinch of salt", 
            "1 teaspoon (3 grams) cinnamon", 
            "Up to 1/2 teaspoon (1) nutmeg", 
            "Pinch of ground cloves", 
            "1 1/2 cups (190 grams) flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/jacked-up-banana-bread.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Bourbon", 
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/jacked-up-banana-bread/", 
        "title": "jacked-up banana bread", 
        "directions": [
            "Preheat the oven to 350°F. With a wooden spoon, mix butter into the mashed bananas in a large mixing bowl. Mix in the sugar, egg, vanilla and bourbon, then the spices. Sprinkle the baking soda and salt over the mixture and mix in. Add the flour last, mix. Pour mixture into a buttered 4×8 inch loaf pan. Bake for 50 minutes to one hour, or until a tester comes out clean. Cool on a rack. Remove from pan and slice to serve.", 
            "Note: Due to my unhealthy obsession with tiny things, I split this into two mini-loaf pans. It took 45 minutes to bake two perfect halves, but of course, may run longer or shorter in your oven."
        ], 
        "date": "2006-11-16T18:00:50+00:00"
    }, 
    {
        "ingredient_list": [
            "5 cups of a mixture of whole milk and half-and-half (4:1 is suggested, but I might go more like 3:2 next time)", 
            "1 1/2 cups bourbon, another whiskey or brandy", 
            "1 cup powdered sugar, sifted", 
            "1 tablespoon vanilla extract", 
            "Freshly grated nutmeg, for garnish."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/12/milk-punch.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2010/12/milk-punch/", 
        "title": "milk punch", 
        "directions": [
            "In a pitcher, whisk together milk, half-and-half, bourbon, sugar and vanilla. Freeze until slushy, which will take 3 to 4 hours, but you can leave it in there up to a day. Stir before serving it in chilled glasses, finished with a few gratings of fresh nutmeg."
        ], 
        "date": "2010-12-31T17:52:35+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup granulated (50 grams) or powdered (30 grams) sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "6 tablespoons (85 grams) unsalted butter", 
            "1/3 cup dark brown sugar", 
            "1/3 cup granulated sugar", 
            "1 large egg", 
            "1 large egg yolk", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 tablespoon bourbon (optional)", 
            "1 teaspoon vanilla extract", 
            "6 tablespoons all-purpose flour", 
            "3/4 cup (4 1/2 ounces or 130 grams) chocolate chips or chopped chocolate", 
            "3/4 cup toasted (always) and coarsely chopped walnuts or pecans", 
            "Flaky sea salt on top, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/not-derby-pie-bars1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Bourbon", 
            "Chocolate", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2015/04/not-derby-pie-bars/", 
        "title": "not derby pie bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. A little nonstick spray underneath helps keep the strips in place. (If you have an 8-inch square springform, you can skip this and just butter it lightly.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take another 30 seconds for it to come together, but it will. Transfer the dough clumps to prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. Meanwhile, prepare the filling.", 
            "Make the filling: Melt your butter and, if desired, brown it too, by continuing to cook the butter in a small saucepan over medium heat, stirring frequently, until golden brown bits form at the bottom, about 5 minutes. Transfer butter to a large bowl and let it cool; you can hasten this along by setting it in the freezer for a couple minutes or stirring it over an ice water bath.", 
            "Whisk sugars into butter until smooth, then egg, (edited to add) yolk, salt, bourbon (if using) and vanilla. Stir in flour until just combined, then mix in chocolate and nuts. Pour over par-baked crust, spreading evenly. Sprinkle lightly with sea salt before baking, if desired. ", 
            "Bake bars: For 20 to 25 minutes, until top is firm and golden. Bars are much easier to cut if you let them cool almost completely, but I suspect there’s little fun in that. Once they’re cool, however, you can easily transfer them from the pan to a cutting board with the parchment paper sling you created. Serve plain, with whipped cream or a tiny scoop of vanilla ice cream. Can dust with powdered sugar for extra pretties. ", 
            "Store at room temperature for up to 3 days, or in the fridge for longer."
        ], 
        "date": "2015-04-30T12:00:22+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/the-perfect-manhattan1.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Fall", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/09/the-perfect-manhattan/", 
        "title": "the perfect manhattan", 
        "directions": [
            "Add rye, vermouths and bitters to a cocktail shaker with ice and stir (if you want to be uber-traditional about it) or shake them together. Strain ice as you pour into a rocks or martini glass, or pour ice and drink into a tumbler. Garnish and enjoy slowly because this is bonkers potent.", 
            "Rye vs. bourbon and other whiskeys from a non-expert, i.e. corrections welcome: American rye whiskey must be distilled from at least 51% rye, but rye does not, by definition, have to be made in America. Canada produces a lot of rye whiskey, but by their own regulations. Bourbon must be distilled from at least 51% corn. It must be made in America and is most often made in Kentucky. Tennessee whiskey, basically bourbon whiskey from Tennessee, uses something called the Lincoln County Process in which whiskey, after it is distilled, is filtered through sugar-maple charcoal, making it amazing. American rye tends to be more dry and spicy than bourbon, which is fuller in body with a vanilla/caramel vibe. Rye is more traditional in the Manhattan cocktail, largely because Manhattan was a rye town when the drink was hatched in the late 1800s. How did I do? ", 
            "Angostura vs. peychauds vs. orange bitters: Angostura, traditional for the Manhattan, is made from a secret recipe, and is quite aromatic. Peychauds, slightly spicier and more sweet, is a great second choice (and what I used instead). Orange bitters are not traditional, but I think taste great in an Manhattan, although giving it more of an old-fashioned vibe."
        ], 
        "date": "2015-09-25T11:26:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup freshly squeezed lemon juice (with an efficient squeezer, you should get this plus up to 1/3 cup extra from 2 pounds of 8 lemons)", 
            "2 1/2 cups cold water, plus additional if needed", 
            "1/4 to 1/2 cup maple syrup", 
            "Bourbon", 
            "Lots of ice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/5719436567_ffb51c3a26_b.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Citrus", 
            "Drinks", 
            "Lemon", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2011/05/vermontucky-lemonade/", 
        "title": "vermontucky lemonade", 
        "directions": [
            "Mix lemon juice with 2 1/2 cups water and 1/4 cup maple syrup. Taste for sweetness. If you like your lemonade sweeter, add remaining 1/4 cup maple syrup. If you found the sweetness just right, add an additional 1/4 cup cold water instead. Stir to mix. This will yield 1 quart of maple lemonade.", 
            "Fill a glass with ice. We have a fiery debate at my house about whether this drink needs 1 or 1 1/2 shots of bourbon; my husband prefers more, but I like this drink a bit weaker. I’ll let you choose. Pour your desired amount of bourbon over the ice, fill the glass the rest of the way with maple lemonade and let the force of summer be with you."
        ], 
        "date": "2011-05-14T18:17:20+00:00"
    }
]