{
  "date": "2014-01-30T12:12:20+00:00",
  "directions": [
    "Heat oven to 350°F. Being careful not to cut through the bottom crust (i.e., leave slices attached), cut bread loaf into 1-inch slices in one direction, then perpendicular, forming porcupine-like bread fingers. Transfer to baking sheet or roasting pan. In a small saucepan or your microwave, combine butter, salt and garlic until butter is melted and sizzling. Pour over bread, making sure to separate any fingers leaning on each other to ensure the bread is evenly butter-soaked. Scatter with grated cheese, again making sure to get cheese all the way to the bottom crust too (helps finger separation, too) with a spoon. Sprinkle with first teaspoon of herbs. Cover dish with foil and bake loaf for 15 minutes, until warmed through. Remove foil and bake another 15 to 20 minutes, until edges of loaf are toasty and cheese has melted. Scatter with any additional green herbs for garnish and serve warm."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/garlicky-party-bread-with-herbs-and-cheese1.jpg?w=640",
  "ingredient_list": [
    "1 round (about 1 pound) loaf firm sourdough bread",
    "1/2 cup (4 ounces or 115 grams) salted or unsalted butter",
    "1/2 teaspoon coarse or flaky salt, or 1/4 teaspoon table salt (if butter is unsalted)",
    "4 medium cloves garlic, minced",
    "Pinch or two of red pepper flakes or freshly ground black pepper to taste",
    "1 cup finely grated cheese (I used a mix of 2/3 firm aged cheeses — pecorino and asiago — and 1/3 fontina for meltiness)",
    "1 teaspoon finely minced fresh herbs (I used 1/2 each rosemary and oregano; use more to taste)",
    "1 tablespoon extra fresh herbs (such as chives or parsley) to finish (optional)"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Bread",
    "Photo",
    "Snack"
  ],
  "title": "garlicky party bread with cheese and herbs",
  "url": "https://smittenkitchen.com/2014/01/garlicky-party-bread-with-cheese-and-herbs/"
}