{
  "date": "2015-11-24T12:08:24+00:00",
  "directions": [
    "Heat oven to 425 degrees F. Stir together flour, baking powder, baking soda, and salt in the bottom of a large bowl, then use your fingertips or a pastry blender to work the butter into the dry mixture, until the largest chunks are the size of tiny peas. Stir in cheese, scallions and chopped parsley, then buttermilk, stirring just until combined. Knead once or twice right inside the bowl to form into a rough dough.",
    "Pat or roll it out to a 1/2-inch thickness on a floured counter. Cut into 2-inch rounds, pressing straight down and not twisting the cutter. Place on an parchment-lined baking sheet. Brush the tops of each with egg wash, then place one leaf at the center of each biscuit top. Use brush to dab leaf with egg wash.",
    "Bake biscuits for 11 to 13 minutes, until golden brown. Eat right away, or at least before the day is out. ",
    "Because biscuits are best on the first day, if planning ahead, I like to make the dough, cut in into rounds and freeze it until needed. Biscuits can be baked right from the freezer and will only require about 2 minutes extra. Brush egg wash and leaf on right before baking. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/parsley-pecorino-biscuits1.jpg?w=750",
  "ingredient_list": [
    "2 1/4 cups all-purpose flour",
    "2 1/2 teaspoons baking powder",
    "3/4 teaspoon baking soda",
    "1/2 teaspoon fine sea salt",
    "6 tablespoons cold unsalted butter, diced",
    "1 1/4 cups (2 7/8 ounces) finely grated aged pecorino or parmesan cheese",
    "2 slim scallions, minced (optional)",
    "2 tablespoons flat-leaf parsley, chopped small plus 16 extra leaves for garnish",
    "1 cup well-shaken buttermilk",
    "1 large egg, lightly beaten with 1 teaspoon water for wash"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Breakfast",
    "Brunch",
    "Herbs",
    "Photo",
    "Put An Egg On It",
    "Scones/Biscuits",
    "Thanksgiving"
  ],
  "title": "parsley pecorino biscuits",
  "url": "https://smittenkitchen.com/2015/11/parsley-pecorino-biscuits/"
}