{
  "date": "2015-02-23T12:00:46+00:00",
  "directions": [
    "Make crispy crumbs (pangrattato): Heat olive oil in a medium skillet over medium heat. Once hot, add garlic and let sizzle for barely a minute, just until it begins to turn a pale golden color. Add breadcrumbs, salt, pepper, rosemary and lemon zest and reduce heat to low, cooking mixture slowly until all of the crumbs are an even golden color, about 5 minutes. Set aside. ",
    "Cook pasta: Bring a large pot of well salted water to a generous boil and cook pasta until al dente about 1 to 2 minutes shy of package directions. Reserve 1/2 cup pasta cooking water before draining pasta. ",
    "Meanwhile, make crispy eggs: Wipe out breadcrumbs skillet. Return to stove over high heat and add a generous glug of olive oil per egg. Once hot enough that the oil begins to smoke, add egg(s). They’re going to hiss and splatter so step back as soon as you do. Spoon some of the cooking oil over the eggs, carefully. Season with salt and pepper. In 1 to 2 minutes, the egg(s) will be brown and very crisp underneath and around the edges. Shimmy a thin spatula underneath the egg(s) (a flexible fish spatula works great here), being careful not to break the yolk. If you’re cooking for someone who shouldn’t be eating runny yolks (ahem), you can flip the egg over and cook it for another 30 seconds or so before removing it. Transfer cooked egg(s) to paper towels to drain. ",
    "Assemble dish: Once pasta is drained, return it to the empty pot or a large skillet with 1 tablespoon olive oil and a splash or two (or all, if needed to loosen pasta) of reserved cooking water. Over high heat, toss with capers and parsley for 1 minute. Divide among bowls or plates. Sprinkle with Pecorino, if using, then 1/3 of breadcrumb (pangrattato) mixture. Place an egg over each dish, and break up with a fork. Eat immediately."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/spaghetti-pangrattato-with-fried-eggs1.jpg?w=750",
  "ingredient_list": [
    "",
    "\t\t",
    "\t",
    "\t\tSeveral years ago, because we didn’t have a kid yet, didn’t know about things like school break schedules and figured midway through February was as good of a time to escape the snow as any, we decided to get away to someplace warm and winter-free during Presidents’ Day week. We found ourselves smack dab in the middle of a beach resort that had to have easily been 75% children, and the kind that were at that time my worst nightmare of what kids could be [insert yours here, then multiply it as far as you can see] and we decided to both never have kids and never ever go away on Presidents’ Week again.",
    "",
    "",
    "",
    "Flash forward seven or so years and last week we went to probably one of the most kid-centric, kid-mobbed resorts* one can go to on the most kid-centric and kid-mobbed week of the year and it was the best thing, ever. Previous to last week, I wouldn’t say we’ve exactly mastered the art of family vacations. Sure, we always have fun together but it often either feels like we’re either someplace exciting for adults but less so for little kid, or someplace awesome for a little kid but it feels more like this for the adults. This may not be for everyone, but at least for now, the resolution turned out to be a place where us grownups could lay on the beach, reading books, napping, and being total slackers for most of the day while the kid attended a day camp with everything from pony rides to water slides, trapeze school and circus training and also a pirate-themed treasure hunt for … underwear which if you’ve ever been around 4 and 5 year-olds, know was the greatest. We’d retrieve our kid, sticky with ice cream, chocolate pastries and sugar cereals from his mid-afternoon goûter and then play on the beach or in the pool for a couple hours before dinner, stories, bed and everybody won. Everyone had an awesome vacation. Thank goodness we’re not doing anything in the coming months that would upset the chances of repeating this bliss next year!",
    "",
    "",
    "Alas, the fridge didn’t fill itself while we were away (technology, can you get on that?) and we pretty much had a family lazy-off yesterday, in which we tried to see how long we could go on pre-vacation remains before one of us caved and went to the store. It turned out — you know, along with some Sunday night soup dumplings — all day, if you can scrounge a few staples together. Before vacation, when I was deep in my 2nd Trimester Carb Immersion Plan, I fell in love on sight alone with a dish called Rhonda’s Spaghetti with Fried Eggs with Pangritata for One on Food52. I mean, how could I not, as it basically contained all of my trigger foods: pasta, bread and my ongoing obsession that I find as many excuses as I can to work into dishes, the crispy egg.  ",
    "",
    "Pangrattato translates from Italian as grated bread, referring to breadcrumbs themselves, but in dishes, it’s often known to as the poor man’s Parmesan because when you take that stale bread and lightly toast in in olive oil, herbs and seasonings — anything from just salt and pepper to garlic and anchovies, lemon zest and capers or olives — it adds remarkable texture and complex flavor to pasta without the expense of Parmesan. These crumbs it would be equally welcome to as a topping for canned fish, steamed mussels, warm vegetable salads, sautéed greens, or even on eggs without the pasta. We loved the crunch throughout our tangles of al dente lunchtime spaghetti, and the fried egg broken up on top, a nod to Rhonda’s version, adds a gorgeous richness that, well… I’ll be repeating in about one hour. ",
    "",
    "* as always on this site, this is not a sponsored or paid post, vacation, opinion, etc. all costs of vacation absorbed by author, with a grimace ",
    "One year ago: Dijon and Cognac Beef Stew",
    "Two years ago: French Onion Tart",
    "Three years ago: Fried Egg Sandwich with Bacon and Blue Cheese",
    "Four years ago: Spaghetti with Lemon and Olive Oil",
    "Five years ago: Monkey Bread with Cream Cheese Glaze and Cauliflower and Caramelized Onion Tart",
    "Six years ago: Red Kidney Bean Curry and Thick Chewy Oatmeal Raisin Cookies",
    "Seven years ago: Pear and Almond Tart",
    "Eight years ago: Vegetable Dumplings",
    "And for the other side of the world:",
    "Six Months Ago: Strawberries and Cream with Graham Crumbles",
    "1.5 Years Ago: Almond-Crisped Peaches",
    "2.5 Years Ago: Mediterranean Baked Feta with Tomatoes",
    "3.5 Years Ago: Zucchini Fritters",
    "\t",
    "",
    "\t",
    " ",
    "Spaghetti Pangrattato with Crispy Eggs",
    "Adapted from and inspired by Rhonda’s Spaghetti with Fried Eggs with Pangritata for One on Food52",
    "This is a big green salad and maybe a few slices of proscuitto (if you’re into such things) away from being a perfect mid-winter weeknight meal, budget-friendly, quick to make, vegetarian and, with luck, from ingredients you already have around. And if you don’t, nobody is going to know if you skip the parsley or try sage or thyme instead of rosemary. There is no one correct way to make pangrattato, only the way you like it. I couldn’t resist adding a little Pecorino here anyway, but you’d be fine without it if you’d like to keep the dish dairy-free. ",
    "Serves 2, in generous heaps, or 3, petitely",
    "Crumbs",
    "2 tablespoon olive oil",
    "1 large or 2 small garlic cloves, minced",
    "1/2 cup fresh or stale coarse plain breadcrumbs (panko worked great here)",
    "Salt and red pepper flakes, to taste",
    "1 teaspoon fresh rosemary, minced",
    "Few fine gratings fresh lemon zest ",
    "Crispy Egg",
    "1 glug of olive oil per egg",
    "3 eggs",
    "Salt and pepper",
    "Pasta and Assembly",
    "8 ounces dried spaghetti",
    "1 tablespoon olive oil",
    "2 teaspoons small capers, drained (rinsed if salted), chopped",
    "Handful flat-leaf parsley, chopped",
    "1/3 cup grated Pecorino Romano cheese (optional)",
    "Make crispy crumbs (pangrattato): Heat olive oil in a medium skillet over medium heat. Once hot, add garlic and let sizzle for barely a minute, just until it begins to turn a pale golden color. Add breadcrumbs, salt, pepper, rosemary and lemon zest and reduce heat to low, cooking mixture slowly until all of the crumbs are an even golden color, about 5 minutes. Set aside. ",
    "Cook pasta: Bring a large pot of well salted water to a generous boil and cook pasta until al dente about 1 to 2 minutes shy of package directions. Reserve 1/2 cup pasta cooking water before draining pasta. ",
    "Meanwhile, make crispy eggs: Wipe out breadcrumbs skillet. Return to stove over high heat and add a generous glug of olive oil per egg. Once hot enough that the oil begins to smoke, add egg(s). They’re going to hiss and splatter so step back as soon as you do. Spoon some of the cooking oil over the eggs, carefully. Season with salt and pepper. In 1 to 2 minutes, the egg(s) will be brown and very crisp underneath and around the edges. Shimmy a thin spatula underneath the egg(s) (a flexible fish spatula works great here), being careful not to break the yolk. If you’re cooking for someone who shouldn’t be eating runny yolks (ahem), you can flip the egg over and cook it for another 30 seconds or so before removing it. Transfer cooked egg(s) to paper towels to drain. ",
    "Assemble dish: Once pasta is drained, return it to the empty pot or a large skillet with 1 tablespoon olive oil and a splash or two (or all, if needed to loosen pasta) of reserved cooking water. Over high heat, toss with capers and parsley for 1 minute. Divide among bowls or plates. Sprinkle with Pecorino, if using, then 1/3 of breadcrumb (pangrattato) mixture. Place an egg over each dish, and break up with a fork. Eat immediately.",
    "Rate this:Do More:TwitterFacebookPinterestPrintEmail\t\t\t",
    "Crumbs",
    "2 tablespoon olive oil",
    "1 large or 2 small garlic cloves, minced",
    "1/2 cup fresh or stale coarse plain breadcrumbs (panko worked great here)",
    "Salt and red pepper flakes, to taste",
    "1 teaspoon fresh rosemary, minced",
    "Few fine gratings fresh lemon zest ",
    "Crispy Egg",
    "1 glug of olive oil per egg",
    "3 eggs",
    "Salt and pepper",
    "Pasta and Assembly",
    "8 ounces dried spaghetti",
    "1 tablespoon olive oil",
    "2 teaspoons small capers, drained (rinsed if salted), chopped",
    "Handful flat-leaf parsley, chopped",
    "1/3 cup grated Pecorino Romano cheese (optional)"
  ],
  "tags": [
    "Budget",
    "Eggs",
    "Italian",
    "Pasta",
    "Photo",
    "Put An Egg On It",
    "Quick",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "spaghetti pangrattato with crispy eggs",
  "url": "https://smittenkitchen.com/2015/02/spaghetti-pangrattato-with-fried-eggs/"
}