{
  "date": "2016-02-01T12:03:10+00:00",
  "directions": [
    "Heat the oven to 400°F. Line a 9-inch round cake pan or cast-iron skillet tightly with foil and spray it with a nonstick spray. Or, you can coat a 9-inch springform with nonstick spray and skip the foil, since it’s easier to remove from a springform.",
    "Heat the oil in a large skillet over medium heat. Add the onion, garlic, fresh chile pepper (if using), cumin, chili powder, and and cook until you can smell the spices and the onion is softened, about 3 minutes. Stir in the tomatoes with the 1/3 cup of reserved juice and the tomato paste, then stir in the beans. Season with salt and pepper to taste. Let the bean mixture simmer until everything is hot, about 3 minutes. Add the corn and spinach and stir until the spinach has wilted and everything is well blended and hot, about 3 minutes. Taste for seasoning, adding more salt and/or pepper as necessary.",
    "Place 1 tortilla in the prepared cake pan. Spread one-sixth (just eyeball it) of the bean and vegetable mixture evenly over the tortilla, then sprinkle 1/4 to 1/3 cup of the shredded cheese evenly over the top. Repeat with 5 more layers, ending with the last of the bean mixture and shredded cheese.",
    "Bake the tortilla stack until it is hot throughout and the top is lightly browned, about 20 minutes. You can run it under the broiler for extra color on top, if you wish. Let the it sit at room temperature for 5 minutes, before removing it from the pan, either by carefully lifting the foil that lines the pan or by opening the sprinform sides. Cut it into wedges using a sharp knife and serve it with a spatula or better yet a pie server. Sprinkle the top with cilantro, if desired, and serve with sour cream and/or salsa on the side, if you like.",
    "Do ahead: You can make this ahead of time, cover it in the fridge overnight then leave it at room temperature for 20 to 30 minutes before baking it. The torte also reheats well."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/taco-torte1.jpg?w=640",
  "ingredient_list": [],
  "tags": [
    "Appetizers + Party Snacks",
    "Beans",
    "Photo",
    "Tex-Mex",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "taco torte",
  "url": "https://smittenkitchen.com/2016/02/taco-torte/"
}