{
  "date": "2007-09-10T22:31:50+00:00",
  "directions": [
    "Prepare potatoes and onions: Peel potatoes and onion and slice them very thin with a mandoline, the slicing blade of a food processor, or by hand. If either are on the large side, first cut them in a half lengthwise so the slices will be in half-moons.",
    "Cook potatoes and onions: Heat oil in an 8- to 10-inch skillet, ideally nonstick, over medium-high until very hot, about 3 minutes. Add potatoes and onions in even layers and reduce heat to medium-low. Cook for 15 minutes, flipping and nudging potatoes around to ensure they cook evenly. Potatoes are done when they are tender when pierced with the tip of a knife. They should not get brown or fall apart in flipping (unless you like your tortillas with softer, more broken-up potatoes, as some do).\nDrain potatoes and onions: Transfer potatoes and onion to a colander set over a bowl and drain them. Season potatoes and onion with salt and pepper and let cool slightly, about 5 minutes. [Go make your salad now! Or start cracking those eggs…]\nMake the tortilla batter: In the bottom of a large bowl, lightly beat eggs with a couple good pinches of salt and freshly ground black pepper. Stir in drained potatoes and onions. If you have 10 minutes, definitely let them soak together for that long; it makes a difference in how well the finally tortilla stays together. If you’re in a rush, it’s not going to ruin the dish if you skip it.\nCook the tortilla: Add 2 tablespoons of the drained cooking oil* (back to the skillet over medium-high heat. Pour potato mixture into skillet and flatten the potatoes with a spatula until they’re mostly even. Reduce heat to medium-low. Cook, moving and shimmying the skillet and nudging the egg around (so it runs underneath) for a minute before letting the tortilla cook undisturbed until the top is wet but not very runny, and it is golden underneath.",
    "Loosen the tortilla with a spatula then slide it onto a large dinner plate.  With your hands in potholders, invert the skillet over the plate, take a deep breath, and flip it back into the skillet. You can do it! Shake the skillet to straighten the tortilla and use a spatula to gently tuck the edges back under, if needed.",
    "Return the skillet to the stove and cook tortilla to your desired doneness, another 2 to 3 minutes if you like an ever-so-slightly loose center (try it and see if you can go back), 3 to 4 minutes, or until a toothpick inserted into the center comes out dry, for full doneness.\nServe: Slice onto a plate and serve in wedges, hot, cold or at room temperature, plain, or with a dusting of smoked paprika and/or squiggle of aioli or mayo.",
    "*Save the rest of the cooking in the fridge for future tortillas, or eggs, or potatoes, or anything you want with a faint onion infusion.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/09/tortilla-de-patatas-potato-tortilla.jpg?w=750",
  "ingredient_list": [
    "3 to 4 (1 1/4 to 1 1/2 pounds) Yukon Gold potatoes",
    "1 small onion",
    "1 cup olive oil",
    "6 extra-large or 7 large eggs",
    "Salt and freshly ground black pepper (don’t skimp)"
  ],
  "tags": [
    "Brunch",
    "Budget",
    "Eggs",
    "Passover",
    "Photo",
    "Picnics",
    "Potatoes",
    "Spanish",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "tortilla de patatas",
  "url": "https://smittenkitchen.com/2007/09/tortilla-de-patatas/"
}