{
  "date": "2015-03-31T12:02:01+00:00",
  "directions": [
    "Combine dried mushrooms and boiling water in a small bowl and let soak for 30 minutes. Remove mushrooms, finely chop and set aside. Strain soaking liquid through a paper towel or coffee filter to remove any grit and set it aside.",
    "Heat olive oil and 2 tablespoons butter over medium-high heat. Add onions and shallots, if using, and cook for 7 to 8 minutes, until they brown at the edges. Raise heat to high and add fresh mushrooms, thyme, salt and pepper. Cook, sauteeing, until mushrooms brown further and release their liquid. Cook until all of the liquid has evaporated, then add Madeira, Marsala, sherry or wine and do the same. Add rehydrated mushrooms and their soaking liquid, and cook this almost completely off. No liquid should run into the center if you drag your spoon through the mushrooms, clearing a path. Adjust seasonings to taste — seasoning is everything here — then stir in last tablespoon of butter. ",
    "Let mixture cool to lukewarm, then blend in a food processor or blender until desired consistency — I like mine almost but not completely smooth, although pâté is traditionally very smooth. Let chill in fridge for a few hours before serving, giving the flavors a chance to settle. Pâté keep in fridge for 5 days, in an airtight container.",
    "Serve with crackers and garnishes of your choice. To make an egg “mimosa”, peel a fully cooled hard-boiled egg. I like to cut mine into quarters and press each quarter, yolk side down, through a fine-mesh sieve until the flecks of egg fall decoratively on top. To pickle red onions or shallots, combine 1/4 cup red wine vinegar, 1/4 cup cold water, 1 tablespoon kosher salt and 1 tablespoon granulated sugar in a jar. Add thinly sliced onion or shallot and cover with lid; let pickle in fridge ideally for at least an hour. Pickled onions will keep for two weeks in the fridge."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/wild-mushroom-pc3a2tc3a91.jpg?w=640",
  "ingredient_list": [
    "Pâté",
    "1 ounce dried porcini or cepe mushrooms",
    "1 cup boiling water",
    "1/4 cup olive oil",
    "3 tablespoons butter, divided",
    "1 1/2 cups diced yellow onion or a combination of chopped onions and shallots (I used 1 cup onion, 1/2 cup shallots)",
    "Coarse salt and freshly ground black pepper to taste",
    "1 1/2 pounds mixed fresh mushrooms, any tough stems discarded and roughly chopped",
    "1 teaspoon fresh thyme leaves (use half if dry)",
    "1/4 cup Madeira, Marsala or sherry, or 1/2 cup white wine",
    "To serve",
    "Crackers or matzo, sieved hard-boiled egg, chopped flat-leaf parsley and/or chives, small pickles or cornichons, additional caramelized onions or pickled shallots or red onions (recipe below) "
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Mushrooms",
    "Passover",
    "Photo",
    "Vegetarian"
  ],
  "title": "wild mushroom pâté",
  "url": "https://smittenkitchen.com/2015/03/wild-mushroom-pate/"
}