{
  "date": "2012-01-18T13:20:43+00:00",
  "directions": [
    "Make syrup: Melt the sugar over medium to moderately high heat in a larger pot than you think you’ll need–at least two quarts, whisking or stirring the sugar as it melts to ensure it heats evenly. Cook the liquefied sugar to a nice copper color. Add the sea salt and butter and stir until the butter melts. Lower the heat and slowly drizzle in the heavy cream, whisking the whole time. The sauce will foam and hiss; just ignore it and whisk until the sauce is smooth.  Set aside until needed. Store in the fridge for up to a week. Rewarm gently to thin it out.",
    "Make pancake: Heat oven to 400 degrees. Whisk the flours, sugar, salt, milk and eggs together in a medium bowl. Leaving a couple lumps behind is fine. Melt butter in a 12-inch cast skillet, preferably cast iron but any heavy ovenproof skillet should work. Roll the butter around a bit so it goes up the sides. Pour in the batter and transfer skillet to the oven. Bake for 15 to 17 minutes, until the pancake browns lightly at the edges and rumpled. Transfer to a trivet, dust with powdered sugar (if using), drizzle with salted caramel syrup and serve immediately in halves or wedges."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/buckwheat-baby-with-salted-caramel-syrup1.jpg?w=500",
  "ingredient_list": [
    "Caramel syrup",
    "1/2 cup granulated sugar",
    "3 tablespoons unsalted butter (or, salted but ease up on the sea salt)",
    "Two pinches flaked or fine sea salt",
    "1/3 cup heavy cream",
    "Pancake",
    "3 tablespoons buckwheat flour",
    "3 tablespoons all-purpose flour",
    "1 tablespoon granulated sugar",
    "1/8 teaspoon table or fine sea salt",
    "1/2 cup whole milk",
    "2 large eggs",
    "3 tablespoons unsalted butter",
    "Confectioners’ sugar, to dust (optional)",
    "Salted caramel syrup"
  ],
  "tags": [
    "Breakfast",
    "Pancakes",
    "Photo"
  ],
  "title": "buckwheat baby with salted caramel syrup",
  "url": "https://smittenkitchen.com/2012/01/buckwheat-baby-with-salted-caramel-syrup/"
}