{
  "date": "2014-02-13T13:55:29+00:00",
  "directions": [
    "Make chocolate crust: If planning to use a water bath, double-wrap outside of a 9-inch springform with 3-inch high sides with aluminum foil (heavy-duty if you have it). In a food processor, blend cookies, chopped chocolate and brown sugar together until finely ground. Drizzle in melted butter and process until crumbs begin to stick together, scraping down the bowl if needed. Transfer crumbs to prepared pan. Wrap fingers with plastic wrap and press crumb mixture up sides to within 1/2 inch of top, then evenly over bottom of pan. Chill crust until next step.",
    "Make fudge layer: Bring cream to simmer in large saucepan. Remove from heat; whisk in chocolate and peanut butter, if using, until chocolate is melted and mixture is smooth. Pour into bottom of chilled crust and spread in an even layer. Freeze until fudge layer is firm, about 30 minutes.",
    "Heat oven: To 325°F.",
    "Make cheesecake layer: Using electric mixer, beat cream cheese, peanut butter, and sugar in large bowl until well-blended and fluffy. Beat in sour cream, then eggs, one at a time, and vanilla. Mix until smooth. Pour over fudge layer that has set in the freezer.",
    "To bake in a water bath: Place foil-wrapped springform pan in a roasting pan large enough to hold it. Fill roasting pan with enough hot water to come 1-inch up the sides of the springform and carefully transfer to middle oven rack. ",
    "To bake without a water bath: Place springform (no need to wrap with foil) on middle baking rack. ",
    "Both methods, to bake: Bake cake until slightly firm to the touch and the top appears dry, about 1 hour 75 to 90 minutes. I find cheesecake baking times to be the hardest to pin down; it is safest to use this visual guide: The center two inches should only move slightly when pan is gently shaken. Transfer cheesecake to rack in the fridge until fully cool, at least three hours.",
    "Make ganache topping: Heat cream in a small saucepan until simmering. Off the heat, whisk in choocolate and peanut butter, if using. Pour onto chilled cheesecake and spread to the edges. Return cheesecake to the fridge until the ganache sets, about 30 minutes. ",
    "To serve: Remove foil from outside cheesecake pan if you have not already. Gently cut around between edge of cheesecake crust and springform pan to make sure it isn’t sticking. Unhinge the sides. You can serve it on the springform base, or, if you’re feeling confident, slide a knife gently under the bottom crust to loosen it from the springform base and slide the cake onto a serving plate. Serve in very skinny wedges (trust me). Cake keeps in fridge for up to a week, and longer in the freezer.",
    "* To write on the cake: I beat 1/3 cup smooth peanut butter beaten with 1 tablespoon unsalted butter (softened) + a scant 1/4 cup powdered sugar together until lightly and fluffy for a peanut butter frosting that could be piped on top (or squeezed from a sandwich bag with the corner snipped off). It made double what was needed (you could make some decorative stars or dots, too) but seems too hard to scale down with regular measurements. I’m sure it won’t go to waste."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/chocolate-peanutbutter-cheesecake.jpg?w=750",
  "ingredient_list": [
    "Chocolate Crust",
    "9 ounces (255 grams) chocolate wafers (such as these; the cookie portion of these are best for homemade crumbs)",
    "6 ounces (170 grams) bitter- or semisweet chocolate, coarsely chopped or 1 cup chips",
    "1/2 cup (95 grams) packed dark brown sugar",
    "7 tablespoons (100 grams) unsalted butter, melted and still hot",
    "Fudge Layer",
    "1 cup (235 ml) heavy or whipping cream",
    "13 ounces (370 grams) bittersweet or semisweet chocolate, chopped",
    "2 tablespoons (30 grams) smooth peanut butter (optional)",
    "Cheesecake Layer",
    "2 8-ounce packages (455 grams) cream cheese, at room temperature",
    "1 1/4 cups (320 grams) smooth peanut butter",
    "1 cup (200 grams) granulated sugar",
    "3/4 cup (180 grams) sour cream",
    "3 large eggs",
    "2 teaspoons (10 ml) vanilla extract",
    "Ganache Topping",
    "1/3 cup (80 ml) heavy or whipping cream",
    "4 1/2 ounces (130 grams) bittersweet or semisweet chocolate, chopped",
    "1 tablespoon (15 grams) smooth peanut butter (optional)"
  ],
  "tags": [
    "Celebration Cakes",
    "Chocolate",
    "Peanut Butter"
  ],
  "title": "chocolate peanut butter cheesecake",
  "url": "https://smittenkitchen.com/2014/02/chocolate-peanut-butter-cheesecake/"
}