{
  "date": "2013-10-17T10:12:12+00:00",
  "directions": [
    "Place tomatoes in a colander set over a bowl and give the tomatoes a little squeeze so they release any trapped juices. Let them drain for 30 minutes, if you can spare it. (We think you should save the reserved juices for Bloody Marys.)",
    "Meanwhile, heat oven, if you have not already, to its top temperature, usually 500 to 550 degrees F. If you’re using a pizza stone, place this in the oven so that it heats too. ",
    "Add salt, garlic, red pepper flakes and sugar (if the tomatoes taste overly acidic to you), to the tomatoes and blend in a blender or with an immersion blender until they reach your desired sauce texture. (I like it smooth, personally.) This will make more sauce than you need; you can save the remainder in the fridge for up to a week, or in the freezer for longer.",
    "Add 1/3 cup of sauce to each stretched-out dough and spread it evenly. Tear or crumble mozzarella into tiny bits and scatter it over the pizzas. Some people like their basil and parmesan or pecorino added only after the pizza comes out of the oven, some like it baked on; I tend to add half the sharp cheese before and half after. I’ll let you decide. Finally, give each assembled pizza a quick drizzle with olive oil and bake it for 10 to 15 minutes, rotating once if needed, until the top is bubbled and lightly charred and the crust is golden. (You’ll get better color than I did on the crust if you use a baking pan without sides, or if you bake it on the back of your baking sheet.) As soon as the pizza comes out of the oven and is still blazing hot, finish with basil and parmesan or pecorino, if this is when you prefer to add it. ",
    "Slide pizza onto cutting board or serving plate and cut into squares or wedges.",
    "Toppings: Favorites include spinach or other greens, thinly sliced mushrooms or thin shaves of whatever vegetables are in season (cough, being neglected in the fridge). Here’s my toppings advice: Whenever you can, saute the vegetable gently in olive oil on the stove until it softens or wilts. Just a minute or two will make a huge difference in outcome. Mushrooms will be roasted, not just dried. Spinach will merge into the pizza. Is someone at the table skeptical of vegetables on their pizza? I’ve “heard” that if you lay them on top of the sauce, below the cheese, few are the wiser.",
    "* My other influence in fleshing out some of my pizza theories listed above was a lovely book I was lucky enough to preview over the summer from beloved food blogger Molly Wizenberg called Delancey, about building the pizza restaurant in Seattle. It won’t be out until May but I loved it so much, I think it’s well worth preordering. Aren’t I pushy?"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/lazy-pizza-dough-favorite-margherita-pizza1.jpg?w=640",
  "ingredient_list": [
    "3 cups (375 grams) all-purpose flour (bread flour works too)",
    "Slightly heaped 1/8, 1/4 or 1/2 teaspoon active dry yeast (for Overnight, All-Day, or Part-Day Schedules respectively, above)",
    "1 1/2 teaspoons sea or kosher salt",
    "1 1/4 cup water, plus an additional tablespoon or two if needed (updated) ",
    "2 12-inch round or 9×13 rectangular pizza doughs",
    "1 28-ounce can whole peeled tomatoes",
    "1 clove garlic, minced",
    "1/2 teaspoon sea or kosher salt",
    "Red pepper flakes, to taste",
    "Pinch of sugar, if desired",
    "8 ounces aged mozzarella (sold in plastic, not water) (use more if you like your pizza with extra cheese)",
    "1/4 cup finely grated parmesan or pecorino romano cheese",
    "Two glugs of olive oil",
    "Few leaves of fresh basil, torn or sliced"
  ],
  "tags": [
    "Photo",
    "Pizza",
    "Weeknight Favorite"
  ],
  "title": "lazy pizza dough + favorite margherita pizza",
  "url": "https://smittenkitchen.com/2013/10/lazy-pizza-dough-favorite-margarita-pizza/"
}