{
  "date": "2008-10-28T15:39:11+00:00",
  "directions": [
    "Make the crispy crust: Lightly spray a paper towel with nonstick cooking spray and use it to rub the bottom and sides of an 8-inch square baking pan.",
    "Put the cereal in a large bowl and set aside.",
    "Pour 1/4 cup water into a small saucepan. Gently add the sugar and corn syrup (do not let any sugar or syrup get on the sides of the pan) and use a small wooden spoon to stir the mixture until just combined. Put a candy thermometer in the saucepan. Cook over medium-high heat and bring to a boil; cook until the mixture reaches the soft ball stage, 235 degrees F.",
    "Remove from the heat, stir in the butter, and pour the mixture over the cereal. Working quickly, stir until the cereal is thoroughly coated, then pour it into the prepared pan. Using your hands, press the mixture into the bottom of the pan (do not press up the sides). Let the crust cool to room temperature while you make the next layer.",
    "Make the milk chocolate peanut butter layer: In a large nonreactive metal bowl, stir together the chocolate and the peanut butter. Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is smooth. Remove the bowl from the pan and stir for about 30 seconds to cool slightly. Pour the mixture over the cooled crust. Put the pan in the refridgerator for 1 hour, or until the top layer hardens.",
    "Make the chocolate icing: In a large nonreactive metal bowl, combine the chocolate, corn syrup, and butter.",
    "Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is completely smooth. Remove the bowl from the pan and stir for 30 seconds to cool slightly. Pour the mixture over the chilled milk chocolate peanut butter layer and spread (actually, I found it easier to just roll it around until it coated smoothly, avoiding the risk of picking up any of the peanut butter layer with it) into an even layer. Put the pan into the refrigerator for 1 hour, or until the topping hardens.",
    "Cut into 9 (they say, I say 16, at least!) squares and serve. The bars can be stored in the refrigerator, covered tightly, for up to 4 days."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peanut-butter-crispy-bars1.jpg?w=500",
  "ingredient_list": [
    "",
    "\t\t",
    "\t",
    "\t\tPeople, these things are nothing but trouble, so whatever you do, don’t do this:",
    "",
    "",
    "Do not start with a bowl of vaguely healthful and intensely fortified bowl of Snap, Crackle and Pop.",
    "",
    "Do not boil some sugar, because obviously unsweetened cereal will not do.",
    "",
    "(Try not to do this to your lens, either, when you take a picture.)",
    "",
    "Do not mix the caramel with the Krispies and press them into a pan.",
    "",
    "",
    "Definitely don’t melt some chocolate and peanut butter together. ",
    "",
    "Or do this.",
    "",
    "And this.",
    "",
    "Then this.",
    "",
    "Or sit back and scratch your head as they disappear, because there’s only two of you at home. Just don’t, okay?",
    "I’m sorry, are you still there? I figure that by now, half of you rebels have already run to the grocery store to buy your first box of Rice Krispies in half a lifetime, and the other half of you are appalled, simply appalled, at the syrupy, overindulgent, processed and fattening “treats” we Americans are so fond of.",
    "Well, here’s a warning to those of you in the latter camp (those of you in the former one already know this): these bars will win you over. I wholly admit that as awesome as they sound, I really made them because I live with a 3rd grader 34 year old that has only one reaction to the suggestion of chocolate and peanut butter: WANT. ",
    "But when I first tried them, I was a little taken aback. The crispy layer crumbled to the point that I couldn’t get a clean cut and I thought the peanut butter layer was too thick and sweet. Were I a more patient cook this week–you see, I am quietly considering partaking in this NaBloPoMo madness again this year, because I never learn, which would mean that I should preserve my cooking energy–I might have tried it over again with a few tweaks…",
    "But a day or two later now, they’ve completely won me over and I now realize why the Baked boys say that this is, hands down, the most popular refrigerated bar they make at the bakery. Curious about the others? The Rasberry Breakfast Bars and Baked Brownies weren’t enough for you? (And how could they be, with as yet un-auditioned recipes for Pumpkin Whoopie Pies and S’more Nut Bars and Butterscotch Pudding Tarts?) You’ve got to get your own copy.",
    "Chocolate and peanut butter, previously: Chocolate and Peanut Butter Cake, Peanut Butter Brownies and Peanut Butter Cookies",
    "One year ago: Sweet Potato and Sausage Soup",
    "Two years ago Bretzel Rolls",
    "\t",
    "",
    "\t",
    "Peanut Butter Crispy Bars",
    "Adapted from Baked: New Frontiers in Baking",
    "These bars are sticky and indulgent and not good for you in any way, so before you even ask, perhaps you can make them with organic, low-fat peanut butter, whole grain bio-crisped rice cereal or a sugar substitute but you shouldn’t. Nobody likes a party pooper.",
    "For the crispy crust",
    "1 3/4 cups crisped rice cereal",
    "1/4 cup sugar",
    "3 tablespoons light corn syrup",
    "3 tablespoons unsalted (their recommendation) or salted (what I used, and liked) butter, melted",
    "For the milk chocolate peanut butter layer",
    "5 ounces good-quality milk (their recommendation) or semi-sweet (what I’d use next time) chocolate, coarsely chopped",
    "1 cup creamy peanut butter",
    "For the chocolate icing",
    "3 ounces dark chocolate (60 to 72 percent cocoa), coarsely chopped",
    "1/2 teaspoon light corn syrup",
    "4 tablespoons (1/2 stick or 2 ounces) unsalted (their recommendation) or salted (what I used, and liked) butter",
    "Make the crispy crust: Lightly spray a paper towel with nonstick cooking spray and use it to rub the bottom and sides of an 8-inch square baking pan.",
    "Put the cereal in a large bowl and set aside.",
    "Pour 1/4 cup water into a small saucepan. Gently add the sugar and corn syrup (do not let any sugar or syrup get on the sides of the pan) and use a small wooden spoon to stir the mixture until just combined. Put a candy thermometer in the saucepan. Cook over medium-high heat and bring to a boil; cook until the mixture reaches the soft ball stage, 235 degrees F.",
    "Remove from the heat, stir in the butter, and pour the mixture over the cereal. Working quickly, stir until the cereal is thoroughly coated, then pour it into the prepared pan. Using your hands, press the mixture into the bottom of the pan (do not press up the sides). Let the crust cool to room temperature while you make the next layer.",
    "Make the milk chocolate peanut butter layer: In a large nonreactive metal bowl, stir together the chocolate and the peanut butter. Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is smooth. Remove the bowl from the pan and stir for about 30 seconds to cool slightly. Pour the mixture over the cooled crust. Put the pan in the refridgerator for 1 hour, or until the top layer hardens.",
    "Make the chocolate icing: In a large nonreactive metal bowl, combine the chocolate, corn syrup, and butter.",
    "Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is completely smooth. Remove the bowl from the pan and stir for 30 seconds to cool slightly. Pour the mixture over the chilled milk chocolate peanut butter layer and spread (actually, I found it easier to just roll it around until it coated smoothly, avoiding the risk of picking up any of the peanut butter layer with it) into an even layer. Put the pan into the refrigerator for 1 hour, or until the topping hardens.",
    "Cut into 9 (they say, I say 16, at least!) squares and serve. The bars can be stored in the refrigerator, covered tightly, for up to 4 days.",
    "Rate this:Do More:TwitterFacebookPinterestPrintEmail\t\t\t",
    "For the crispy crust",
    "1 3/4 cups crisped rice cereal",
    "1/4 cup sugar",
    "3 tablespoons light corn syrup",
    "3 tablespoons unsalted (their recommendation) or salted (what I used, and liked) butter, melted",
    "For the milk chocolate peanut butter layer",
    "5 ounces good-quality milk (their recommendation) or semi-sweet (what I’d use next time) chocolate, coarsely chopped",
    "1 cup creamy peanut butter",
    "For the chocolate icing",
    "3 ounces dark chocolate (60 to 72 percent cocoa), coarsely chopped",
    "1/2 teaspoon light corn syrup",
    "4 tablespoons (1/2 stick or 2 ounces) unsalted (their recommendation) or salted (what I used, and liked) butter"
  ],
  "tags": [
    "Bars",
    "Candy",
    "Peanut Butter",
    "Photo"
  ],
  "title": "peanut butter crispy bars",
  "url": "https://smittenkitchen.com/2008/10/peanut-butter-crispy-bars/"
}