{
  "date": "2016-08-22T12:32:56+00:00",
  "directions": [
    "Cook eggplant: Trim eggplant and cut into 1/4-inch slices.",
    "To bread and bake or fry: Set up three wide, deep bowls on your counter, one with flour, one with the three eggs and one with the breadcrumbs. Season the flour very heavily (at least a teaspoon of kosher salt and many grinds of black pepper) and stir to combine. Beat the eggs until combined. Dip each slice of eggplant in the flour, tapping off excess, then the egg, letting excess drip off, and then the breadcrumbs, packing them on.\nTo bake breaded eggplant: Heat oven to 400 degrees. Place two racks (such as a metal cooling rack for cookies) over two large baking sheets and brush or spray them with olive oil. Arrange breaded eggplant slices in one layer on racks, season well with salt and pepper, and bake for 20 minutes on first side and 15 on the second, until edges are crisp and eggplant inside is soft. Set aside.\nTo fry breaded eggplant: Heat a large skillet with 1/2-inch olive oil over medium/medium-high heat. Feeling stingy with the good olive oil? Use half olive oil and half of another good oil for frying, such as sunflower, safflower, vegetable, grapeseed or canola. (Most restaurants do!) Once hot enough that a droplet of water hisses and splatters when added to the oil, fry breaded eggplant, a few slices at a time, until golden underneath, about 3 to 4 minutes, then flip and cook until browned on the second side, 2 to 3 minutes more. Drain on paper towels and immediately, while they’re still very hot, season with salt and pepper. Repeat with remaining slices.\nTo roast un-breaded eggplant: Brush two large baking sheets with a couple tablespoons of olive oil. Arrange eggplant slices in one layer and season well with salt and pepper. Roast for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release from the pan with no effort. If they’re not, let it cook longer. Once flipped, sprinkle them with additional salt and freshly ground black pepper and return the pan to the oven for another 10 to 12 minutes or so, until the undersides match the tops.\nMeanwhile, make sauce: Heat 1 tablespoon olive oil in a large frying pan over medium heat. Once hot, add garlic and cook for one minute, until faintly golden. Add tomato puree, which is going to sputter and splash, so step back. Season with salt, black pepper, pepper flakes and stir in oregano. Simmer, stirring from time to time, for 15 minutes.\nAssemble melts: Heat broiler. Split bread in half and briefly run under broiler, just to lightly toast it so that the sauce doesn’t make it soggy. Split each bread half into 6 smaller toasts and arrange on 1 to 2 large baking sheets that have been lined with foil. Spread a little prepared sauce over each toast and sprinkle with some of the parmesan. Add a few eggplant slices to each, fanning them out. Top with more sauce (to taste, but not so much that eggplant is drenched), parmesan and then place a slice or so off mozzarella over the top of each, enough that when it melts, it should drape down easily. Run trays of melts under the broiler until cheese on top is melted and blistery, 5 minutes in my oven but possibly more or less in yours, so please keep an eye on it. Garnish with additional basil and dig in."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/eggplant-parmesan-melts-e1471881049161.jpg?w=750",
  "ingredient_list": [
    "2 pounds eggplant (about 2 medium)",
    "1/2 cup all-purpose flour",
    "Kosher salt",
    "Freshly ground black pepper",
    "3 large eggs",
    "2 1/2 cups panko breadcrumbs",
    "Olive oil, for baking, roasting or frying",
    "3 1/2 cups prepared sauce or the following ingredients to make your own:",
    "1 tablespoon olive oil (or frying oil)",
    "2 garlic cloves, minced",
    "1 28-ounce can tomato puree",
    "1 teaspoon dried oregano",
    "Salt and freshly ground black pepper, to taste",
    "Pinches of red pepper flakes, to taste",
    "2 tablespoon chopped fresh basil, plus more to garnish",
    "About a 1-pound loaf seeded Italian bread or baguette",
    "3/4 cup grated parmesan",
    "3/4 pounds mozzarella, in thin slices"
  ],
  "tags": [
    "Eggplant",
    "Italian",
    "Photo",
    "Sandwich",
    "Summer",
    "Vegetarian"
  ],
  "title": "eggplant parmesan melts",
  "url": "https://smittenkitchen.com/2016/08/eggplant-parmesan-melts/"
}