[
    {
        "ingredient_list": [
            "Lid", 
            "2 cups (250 grams) all- purpose flour", 
            "1/2 teaspoon fine sea or table salt", 
            "13 tablespoons (185 grams or 6 1/2 ounces) cold unsalted butter, diced", 
            "6 tablespoons (90 grams) sour cream or Greek-style yogurt", 
            "1 tablespoon (15 ml) cider vinegar", 
            "1/4 cup (60 ml) very cold water", 
            "1 egg, beaten with 1 teaspoon water, for egg wash", 
            "Filling", 
            "Salt and freshly ground black pepper", 
            "3 1/2 to 4 pounds bone-in, skin-on chicken parts (breasts, thighs and drumsticks are ideal)", 
            "1 to 2 glugs olive oil", 
            "2 medium leeks, white and light green parts only, cut in half lengthwise and then into 1/2-inch slices", 
            "1 large onion, diced small", 
            "1/4 cup dry sherry (optional)", 
            "3 cups low-sodium chicken broth", 
            "1/4 cup milk or heavy cream", 
            "1 bay leaf", 
            "1 teaspoon minced fresh thyme", 
            "3 tablespoons unsalted butter, at room temperature", 
            "4 1/2 tablespoons all-purpose flour", 
            "1 cup fresh or frozen green peas (no need to defrost)", 
            "2 large carrots, diced small (about 1 cup carrots)", 
            "2 tablespoons chopped flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/img_92401.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Fall", 
            "Photo", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/10/better-chicken-pot-pies/", 
        "title": "better chicken pot pies", 
        "directions": [
            "Make pastry lids: In a large, wide bowl (preferably one that you can get your hands into), combine the flour and salt. Add the butter and, using a pastry blender or your fingertips, cut them up and into the flour mixture until it resembles little pebbles. Keep breaking up the bits of butter until the texture is closer to uncooked couscous. In a small dish, whisk together the sour cream, vinegar, and water, and combine it with the butter-flour mixture. Using a flexible spatula, stir the wet and the dry together until a craggy dough forms. If needed, get your hands into the bowl to knead it a few times into one big ball. Pat it into a flattish ball, wrap it in plastic wrap, and chill it in the fridge for 1 hour or up to 2 days. Meanwhile…", 
            "Make filling: Generously season all sides of the chicken parts with salt and freshly ground black pepper. If your chicken breasts are particularly large, I find that halving them can ensure they cook at the same pace at the other parts. Heat first glug of olive oil over medium-high  heat in the bottom of a large Dutch oven (minimum of 4 quarts; mine is 5). Brown chicken in two parts, cooking until golden on both sides. Transfer to a plate and repeat with second half of chicken. Set aside. ", 
            "Heat second glug of olive oil in the same pot. Add onions and leeks, season with salt and pepper, and saute them until softened, about 7 minutes. If using, pour in sherry and use it to scrape up any bits stuck to the bottom of the pan. Simmer until mostly cooked off. Add milk or cream, chicken broth, thyme and bay leaf and bring to a simmer. Nestle the browned chicken and any accumulated juices into the pot. Cover and gently simmer to 30 minutes, after which the chicken should be fully cooked and tender.", 
            "Transfer the chicken to a cutting board to cool slightly. Discard the bay leaves. Allow the sauce to settle for a few minutes, then skim the fat from the surface using a wide spoon; reserve it for another use, or this:", 
            "In a medium bowl, mash butter (feel free to replace any part of it with skimmed chicken fat from the previous step, thanks to a commenter below for the suggestion) and flour together with a fork until a paste forms and no flour is still visibly dry. Pour one ladleful of filling over it, and whisk until smooth. Add a second ladleful, whisking again. Return this butter-flour-filling mixture to the larger pot, stir to combine, and bring mixture back to a simmer for 10 minutes. The brothy base should thicken to a gravy-like consistency. Adjust seasonings, if needed.", 
            "Add carrots and peas to stew and simmer for 3 minutes, until firm-tender. Shred or dice the chicken, discarding the bones and skin or saving it for another use. Return chicken to stew and re-simmer for 1 minute. Stir in parsley. ", 
            "Assemble and bake pies: Heat your oven to 375 degrees F.", 
            "Divide chilled dough into quarters. Roll each quarter out into rounds that will cover 4 2-cup ovenproof bowls or baking dishes with a 1-inch overhang. Cut vents into rounds. Ladle filling into four bowls, filling only to 1 to 1 1/2 inches below the rim to leave room for simmering. Whisk egg with water to make an egg wash. Brush edges of bowls with egg wash, or if you like lids that easily lift off your bowls and are willing to risk that they may slip slightly into the bowl when baking, you can skip this. Place a lid over each bowl, pressing gently to adhere it to the outer sides of the bowl. Brush the lids with egg wash. Bake until crust is bronzed (more than mine, please, if nobody in your family is having a hangry meltdown) and filling is bubbling, 30 to 35 minutes.", 
            "Do ahead: The dough for the lids can be made up to 3 days in advance and chilled. The filling can be made up to a day in advance and re-warmed before assembling and baking the pot pies. "
        ], 
        "date": "2014-10-06T12:15:46+00:00"
    }, 
    {
        "ingredient_list": [
            "2 lemons, halved", 
            "5 large artichokes (about 12 ounces each)", 
            "11/2 cups shelled fresh or frozen fava beans, or shelled frozen edamame", 
            "1/4 cup extra-virgin olive oil, plus more as needed", 
            "1 large onion, thinly sliced", 
            "1 sprig oregano, optional", 
            "2 ounces guanciale or pancetta, slivered", 
            "Salt", 
            "2 cups shelled (fresh or frozen) peas", 
            "1/4 cup chopped parsley", 
            "2 tablespoons chopped mint", 
            "* teaspoon lemon juice, plus more to taste", 
            "Freshly ground black pepper. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/box-one-of-two1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Beans", 
            "Easter", 
            "Italian", 
            "Photo", 
            "Spring", 
            "Stew"
        ], 
        "url": "https://smittenkitchen.com/2007/06/box-one-of-two/", 
        "title": "spring vegetable stew", 
        "directions": [
            "1. To prepare the artichokes: Fill a large bowl halfway with cold water. Squeeze the lemons into the water and add the rinds to the bowl. Using a serrated knife, cut off the top third of an artichoke. Pull back and snap off the dark green, leafy blades, one by one, until only the pale yellow leaves remain. Using a paring knife, trim the artichoke bottom and stem to the pale green flesh, then cut it in half lengthwise. Drop into the water (to keep the artichoke from turning brown) and repeat with the remaining artichokes. Using a spoon, scoop out the prickly leaves and hairy choke. Cut each half into 4 wedges and return to the water until ready to use. ", 
            "2. If using fresh fava beans, bring a large pot of water to a boil. Fill a large bowl two-thirds full with ice water. When the water comes to a boil, add the beans and cook for 1 minute, then drain and immediately submerge the beans in the ice water. Peel the beans by gently tearing the pale skins and pinching at one end. Discard the skins, reserving the dark green interiors. ", 
            "3. To cook the ragout: Heat a 12-inch nonreactive pan over medium heat. Add 1/4 cup olive oil and when hot, add the onion, oregano (if using) and guanciale. Cook, stirring occasionally until the onion and guanciale are translucent, about 10 minutes. Drain artichokes and add to the pan, along with 2 cups water and 11/4 teaspoons salt. Bring the liquid to a boil, then reduce heat to a simmer and cook until artichokes are just tender, about 25 minutes. If using frozen favas, add them and cook for 2 minutes. If using fresh favas or frozen edamame, add them, along with the peas, and cook until warm and tender, about 5 minutes more. Remove the oregano sprig. Sprinkle in parsley and mint. Season with lemon juice, freshly ground black pepper and, if desired, additional salt. Drizzle with extra-virgin olive oil and serve."
        ], 
        "date": "2007-06-05T23:38:32+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound broccolini or regular broccoli", 
            "2 tablespoons olive oil", 
            "3 cloves garlic, minced", 
            "A few pinches red pepper flakes, to taste", 
            "Finely grated zest, then juice, of 1/2 lemon (juice before zesting only if you enjoy being grumpy)", 
            "Coarse salt, to taste", 
            "1/2 cup finely grated aged pecorino romano cheese", 
            "8 thin slices totally unfancy deli provolone", 
            "8 slices bread of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/broccoli-melts1.jpg?w=640", 
        "tags": [
            "Broccoli", 
            "Cheese", 
            "Photo", 
            "Sandwich", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/02/broccoli-melts/", 
        "title": "broccoli melts", 
        "directions": [
            "If using broccolini, cut it into 2-inch segments. If regular broccoli, peel the stems with a vegetable peeler first so that they cook evenly, and cut the rest into large chunks.", 
            "Pour about 1-inch puddle of salted water into a large sauté pan and bring to a boil. Add broccoli and cover with a lid and boil/steam for 2 minutes. Drain well and pat dry on paper towels, wringing out as much extra liquid as possible. Chop into small (roughly 1/2-inch) bits.", 
            "Wipe sauté pan dry and heat over medium. Add olive oil and let it heat for a full minute. Add garlic and pepper flakes, cooking for 1 minutes, or until the garlic is just beginning to turn golden. Add the broccoli and cook 1 to 2 minutes more, seasoning with salt. Transfer mixture to a bowl and add lemon zest, juice, pecorino and more salt and pepper flakes to taste.", 
            "Heat broiler. Arrange slices of bread on a tray and lightly toast on both sides. Scoop broccoli mixture onto each slice of bread, lay a slice of provolone over it and run under the broiler until cheese has melted and begun to blister. Eat. Repeat. Don’t forget to share, or at least hide the evidence if you decide not to."
        ], 
        "date": "2016-02-16T12:02:07+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds mussels", 
            "1 cup white wine (they suggest 1/2 cup but I need more to steam that volume)", 
            "4 tablespoons butter, softened", 
            "1 handful fresh flat-leaf parsley leaves, minced", 
            "1 small clove garlic, minced", 
            "4 pinches smoked paprika (pimenton)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/broiled-mussels1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Seafood"
        ], 
        "url": "https://smittenkitchen.com/2010/12/broiled-mussels/", 
        "title": "broiled mussels", 
        "directions": [
            "Clean your mussels. There are a zillion ways to do this, this is mine: I put them in a big bowl of very cold water for about 10 minutes. This encourages them to expel their sand. Scoop them out (not dump, if you dump the sandy water over them, it defeats the purpose) one by one and scrub them under running water. Most cultivated mussels have the bissus (beard) removed but if one lingers, yank it toward the hinge (if you do it away from the hinge, it can kill the mussel prematurely) or cut it with a knife. Discard any mussels with chipped shells or that are not completely shut; they are more than likely dead and it’s not worth finding out if it may or may not make you sick, right?", 
            "Boil your wine in a medium pot. Add the mussels, cover and steam them open over high heat until they open. You can start checking at 3 minutes, but it can take up to 6. I like to use the lid and potholders and shake them around a little from time to time, to make sure they’re getting equal access to the wine and heat.", 
            "Once open, let the mussels cool. Twist off and discard one of the shells from each mussels (discard any that didn’t open), making sure that the remaining shell contains the mussel. Reserve the mussel broth for another use. Mash butter, parsley, garlic, pimenton and salt to taste in a small bowl and slather each mussel with the compound butter. Arrange them in a broiler-safe tray and chill them in the fridge until the butter is hard. [This is a great do-ahead interval, if you’d like to prepare these for when you entertain.]", 
            "Preheat the broiler (or your oven to 500, if you don’t have a broiler). Broil the mussels until the butter is bubbling hot, about 2 minutes (or up to 4 in an oven). Serve immediately, with crusty bread or my favorite, baked pommes frites."
        ], 
        "date": "2010-12-20T19:50:17+00:00"
    }, 
    {
        "ingredient_list": [
            "6 cups canned low-salt chicken broth", 
            "3 1/2 tablespoons butter", 
            "1 1/2 tablespoons olive oil", 
            "2 large shallots, chopped", 
            "2 cups arborio rice or medium-grain white rice", 
            "1/4 cup dry white wine", 
            "1 cup freshly grated Parmesan cheese (about 3 ounces)", 
            "2 tablespoons chopped fresh parsley", 
            "2 tablespoons fresh lemon juice", 
            "4 teaspoons grated lemon peel"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/catch-up-solstice-edition1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Fruit", 
            "Grain/Rice", 
            "Italian", 
            "Lemon", 
            "Photo", 
            "Seafood"
        ], 
        "url": "https://smittenkitchen.com/2007/06/catch-up-solstice-edition/", 
        "title": "lemon risotto", 
        "directions": [
            "Bring broth to simmer in large saucepan over medium heat. Reduce heat to low; cover to keep warm. Melt 1 1/2 tablespoons butter with oil in heavy large saucepan over medium heat. Add shallots and saute until tender, about 6 minutes. Add rice; stir 1 minute. Add wine and stir until evaporated, about 30 seconds. Add 1 1/2 cups hot broth; simmer until absorbed, stirring frequently. Add remaining broth 1/2 cup at a time, allowing broth to be absorbed before adding more and stirring frequently until rice is creamy and tender, about 35 minutes. Stir in cheese and remaining 2 tablespoons butter. Stir in parsley, lemon juice, and lemon peel. Season risotto with salt and pepper. Transfer to bowl and serve."
        ], 
        "date": "2007-06-21T23:18:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound Swiss chard (can also swap kale, spinach or another green), ribs and stems removed and cleaned", 
            "3 tablespoons olive oil", 
            "1 cup (5 1/4 ounces) chopped carrots", 
            "1 cup (5 ounces) chopped celery", 
            "1 cup (4 1/4 ounces) chopped shallots, about 4 medium", 
            "2 garlic cloves, finely chopped", 
            "1 cup dry white wine", 
            "2 15-ounce cans (or about 3 3/4 cups) white beans, drained and rinsed", 
            "2 cups (or more to taste) vegetable broth", 
            "1 cup pureed tomatoes (from a can/carton/your jarred summer supply)", 
            "Salt and freshly ground black pepper", 
            "3 fresh thyme sprigs", 
            "1 bay leaf", 
            "1 tablespoon sherry vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/01/chard-and-white-bean-stew.jpg?w=750", 
        "tags": [
            "Beans", 
            "Budget", 
            "Freezer Friendly", 
            "Gluten-Free", 
            "Photo", 
            "Put An Egg On It", 
            "Stew", 
            "Swiss Chard", 
            "Vegan", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/01/chard-and-white-bean-stew/", 
        "title": "chard and white bean stew", 
        "directions": [
            "Toasted bread slices, poached eggs (tutorial), chopped herbs such as tarragon, parsley or chives or grated Parmesan or Romano to serve (optional)", 
            "Bring medium pot of salted water to boil. Cook chard (or any heavier green; no need to precook baby spinach) for one minute, then drain and squeeze out as much extra water as possible. Coarsely chop chard.", 
            "Wipe out medium pot to dry it, and heat olive oil over medium. Add carrots, celery, shallots and garlic and saute for 15 minutes. Barber warns not to brown them but I didn’t mind a light golden color on them. Add wine (scraping up any bits that have stuck to the pot) and cook it until it reduced by three-fourths. Add beans, broth, tomatoes, a few pinches of salt, freshly ground black pepper, thyme and bay leaf and bring to a boil. Reduce heat to medium-low and simmer for 20 minutes. Add chard and cook for 5 minutes more. Remove thyme and bay leaf. Add more broth if you’d like a thinner stew and adjust salt and pepper to taste.", 
            "Serve as is drizzled with sherry vinegar. Or you can ladle the stew over thick piece of toasted country bread or baguette that has been rubbed lightly with half a clove of garlic, top that with a poached egg and a few drops of sherry vinegar and/or some grated cheese. "
        ], 
        "date": "2011-01-04T09:55:42+00:00"
    }, 
    {
        "ingredient_list": [
            "2 small or 1 large fresh poblano chiles", 
            "1 small head cauliflower, cored and cut into rough 1-inch chunks", 
            "Salt and freshly ground black pepper to taste", 
            "3 tablespoons olive oil, plus more for cooking quesadillas", 
            "3 scallions, thinly sliced", 
            "1 tablespoon lime juice", 
            "2 cups (about 8 ounces) coarsely grated monterey jack cheese", 
            "12 small (7-inch) flour tortillas", 
            "1/2 cup sour cream or Mexican crema", 
            "A few gratings fresh lime zest", 
            "1 tablespoon freshly squeezed lime juice", 
            "1/2 teaspoon ground cumin", 
            "Pinch of salt", 
            "1 bag coleslaw mix or (as used here) 3 cups finely shredded red cabbage and 1 coarsely grated carrot", 
            "Coarse salt", 
            "Juice of half a lime", 
            "2 scallions, sliced thin", 
            "A dollop of mayonnaise, sour cream or plain yogurt", 
            "A dash of hot sauce (optional)", 
            "1/4 cup roughly chopped cilantro or flat-leaf parsley leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/charred-cauliflower-quesadillas1.jpg?w=751", 
        "tags": [
            "Cauliflower", 
            "Peppers", 
            "Photo", 
            "Sandwich", 
            "Tex-Mex", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/02/charred-cauliflower-quesadillas/", 
        "title": "charred cauliflower quesadillas", 
        "directions": [
            "Toss cabbage mix, salt and lime together in a large bowl; set aside for 5 minutes. It will shrink down a bit. Stir in scallions, then mayo and hot sauce. Adjust seasonings/ingredients to taste, then stir in cilantro leaves. Serve alongside quesadillas or any of your favorite tortilla-clad meals. "
        ], 
        "date": "2015-02-02T11:54:41+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds boneless skinless chicken parts, cut into 3 to 4 large chunks (I use a 50/50 mix of breasts and thighs)", 
            "1 small yellow onion, chopped small", 
            "2 large garlic cloves, minced", 
            "1 tablespoon ground cumin", 
            "1 1/2 teaspoons dried oregano", 
            "2 teaspoons fine sea salt", 
            "Heat via 1 to 2 jalapenos or other fresh hot pepper, minced, or a ground chili powder of your choice, to taste", 
            "1 28-ounce can crushed tomatoes, fire-roasted if you can find them or 2 10-ounce cans Ro-Tel (yield is a little less but not noticeable in final chili)", 
            "2 2/3 cups small dried beans (I use half black beans, half small red beans; I do not presoak but do read the updated note up top; read the note at the bottom if you’re using kidney beans)", 
            "5 1/3 cups water (can replace all or part with broth)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/chicken-chili1.jpg?w=640", 
        "tags": [
            "Beans", 
            "Gluten-Free", 
            "Photo", 
            "Slow Cooker", 
            "Stew", 
            "Tex-Mex", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/01/chicken-chili/", 
        "title": "chicken chili", 
        "directions": [
            "To serve: Lime wedges, sour cream or Mexican crema, finely chopped white onion or thinly sliced scallion, chopped cilantro, corn or flour tortilla chips, and hot sauce", 
            "(I have always wanted to write recipe instructions just like this!) Throw everything in the pot and turn the heat on:", 
            "To finish: The chicken will likely have fallen apart, but you can help it along by reaching into the pot with two forks and shredding it to your desired texture. Taste and adjust seasonings. Serve with fixings of your choice.", 
            "P.S. We like this with baked tortilla chips. I estimate two small corn tortillas per person and cut them into 8 wedges. Brush a large baking sheet lightly with olive oil, arrange tortilla wedges in one layer, lightly dab the tops with more olive oil and sprinkle with fine salt. Bake at 350 for 10 minutes, check for color, and add more baking time as needed until they’re golden and crisp.", 
            "A note about kidney beans: I do not use kidney beans here, but small red ones, and I do not presoak my beans however if you are using red kidney beans, do keep in mind that due to a pathogen known as phytohaemagglutinin the FDA advises people who wish to use kidney beans in slow-cookers to first soak the beans for at least 5 hours, dump the water, boil them in fresh water for 10 minutes and then continue with the recipe. As your beans will have soaked up more liquid before they go in, you will find you need less to cook them in for the final chili. In terms of how freaked out you should be over kidney beans, from the FDA website: “Reports of this syndrome in the United States are anecdotal and have not been formally published.” And that this was mostly a concern reported in the last 70s in the UK. "
        ], 
        "date": "2016-01-04T11:45:09+00:00"
    }, 
    {
        "ingredient_list": [
            "2 (28-ounce) cans whole tomatoes packed in juice, drained, 3 cups juice reserved", 
            "1 1/2 tablespoons dark brown sugar", 
            "4 tablespoons unsalted butter", 
            "4 large shallots, minced (about 1/2 cup)", 
            "1 tablespoon tomato paste", 
            "Pinch ground allspice", 
            "2 tablespoon all-purpose flour", 
            "1 3/4 cups chicken stock, homemade or canned low-sodium", 
            "1/2 cup heavy cream", 
            "2 tablespoons brandy or dry sherry", 
            "Salt and cayenne pepper", 
            "3 ounces cheese (preferably mild cheddar) or combination of cheese, grated on large holes of box grater (about 3/4 cup)", 
            "4 slices (1/2 inch-thick) from white sandwich bread, such as Pepperidge Farm Toasting White", 
            "2 tablespoons butter (preferably salted), melted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/come-on-thunder1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Sandwich", 
            "Soup", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2006/11/come-on-thunder/", 
        "title": "classic grilled cheese + cream of tomato soup", 
        "directions": [
            "1.\tHeat heavy 12-inch skillet over low to medium-low heat. Meanwhile, sprinkle a portion of cheese over two bread slices. Top each with a remaining bread slice, pressing down gently to set. ", 
            "2.\tBrush sandwich tops completely with half of melted butter; place each sandwich, buttered-size down, in skillet. Brush remaining side of each sandwich completely with remaining butter. Cook until crisp and deep golden brown, 5 to 10 minutes per side, flipping sandwiches back to first side to reheat and crisp, about 15 seconds. Serve immediately. "
        ], 
        "date": "2006-11-09T13:54:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound salt pork, pancetta or bacon, diced", 
            "1 large onion, finely diced", 
            "3 shallots, chopped", 
            "4 tablespoons butter, as needed", 
            "2 pounds beef chuck, in 1-inch cubes", 
            "2 tablespoons flour", 
            "Salt and freshly ground black pepper", 
            "1/2 cup Cognac (see Note)", 
            "2 cups unsalted beef stock", 
            "1/2 cup smooth Dijon mustard", 
            "4 tablespoons coarse Dijon or Pommery mustard (see Note)", 
            "4 medium carrots, peeled and cut into half-moon slices", 
            "1/2 pound mushrooms, stemmed, cleaned and quartered", 
            "1/4 cup red wine (see Note)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/dijon-and-cognac-beef-stew.jpg?w=750", 
        "tags": [
            "Beef", 
            "Date Night", 
            "French", 
            "Photo", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/02/dijon-and-cognac-beef-stew/", 
        "title": "dijon and cognac beef stew", 
        "directions": [
            "Place salt pork in a Dutch oven or a large heavy kettle over low heat, and cook until fat is rendered. Remove solid pieces with a slotted spoon, and save for another use, like your salad, vegetables or, uh, snacking. Raise heat to medium-low, and add onion and shallots. Cook until softened but not browned, about 10 to 15 minutes. Use a slotted spoon to transfer to a large bowl.", 
            "If necessary, add 2 tablespoons butter to the pan to augment fat. Dust beef cubes with flour, and season lightly with salt and more generously with pepper. Shake off excess flour, and place half the cubes in the pan. Cook over medium-high heat until well browned, almost crusty, on all sides, then transfer to a bowl with onions. Repeat with remaining beef.", 
            "Add Cognac to the empty pan, and cook, stirring, until the bottom is deglazed and any crusted-on bits come loose. Add stock, smooth Dijon mustard and 1 tablespoon coarse or Pommery mustard. Whisk to blend, then return meat and onion mixture to pan. Lower heat, cover pan partway, and simmer gently until meat is very tender, about 1 1/4 hours.", 
            "Add carrots, and continue simmering for 40 minutes, or until slices are tender. As they cook, heat 2 tablespoons butter in medium skillet over medium-high heat, and sauté mushrooms until browned and tender. Stir mushrooms into stew along with remaining mustard and red wine. Simmer 5 minutes, then taste, and adjust seasoning. Serve hot."
        ], 
        "date": "2014-02-24T12:16:34+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds eggplant (about 2 medium)", 
            "1/2 cup all-purpose flour", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "3 large eggs", 
            "2 1/2 cups panko breadcrumbs", 
            "Olive oil, for baking, roasting or frying", 
            "3 1/2 cups prepared sauce or the following ingredients to make your own:", 
            "1 tablespoon olive oil (or frying oil)", 
            "2 garlic cloves, minced", 
            "1 28-ounce can tomato puree", 
            "1 teaspoon dried oregano", 
            "Salt and freshly ground black pepper, to taste", 
            "Pinches of red pepper flakes, to taste", 
            "2 tablespoon chopped fresh basil, plus more to garnish", 
            "About a 1-pound loaf seeded Italian bread or baguette", 
            "3/4 cup grated parmesan", 
            "3/4 pounds mozzarella, in thin slices"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/eggplant-parmesan-melts-e1471881049161.jpg?w=750", 
        "tags": [
            "Eggplant", 
            "Italian", 
            "Photo", 
            "Sandwich", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/08/eggplant-parmesan-melts/", 
        "title": "eggplant parmesan melts", 
        "directions": [
            "Cook eggplant: Trim eggplant and cut into 1/4-inch slices.", 
            "To bread and bake or fry: Set up three wide, deep bowls on your counter, one with flour, one with the three eggs and one with the breadcrumbs. Season the flour very heavily (at least a teaspoon of kosher salt and many grinds of black pepper) and stir to combine. Beat the eggs until combined. Dip each slice of eggplant in the flour, tapping off excess, then the egg, letting excess drip off, and then the breadcrumbs, packing them on.\nTo bake breaded eggplant: Heat oven to 400 degrees. Place two racks (such as a metal cooling rack for cookies) over two large baking sheets and brush or spray them with olive oil. Arrange breaded eggplant slices in one layer on racks, season well with salt and pepper, and bake for 20 minutes on first side and 15 on the second, until edges are crisp and eggplant inside is soft. Set aside.\nTo fry breaded eggplant: Heat a large skillet with 1/2-inch olive oil over medium/medium-high heat. Feeling stingy with the good olive oil? Use half olive oil and half of another good oil for frying, such as sunflower, safflower, vegetable, grapeseed or canola. (Most restaurants do!) Once hot enough that a droplet of water hisses and splatters when added to the oil, fry breaded eggplant, a few slices at a time, until golden underneath, about 3 to 4 minutes, then flip and cook until browned on the second side, 2 to 3 minutes more. Drain on paper towels and immediately, while they’re still very hot, season with salt and pepper. Repeat with remaining slices.\nTo roast un-breaded eggplant: Brush two large baking sheets with a couple tablespoons of olive oil. Arrange eggplant slices in one layer and season well with salt and pepper. Roast for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release from the pan with no effort. If they’re not, let it cook longer. Once flipped, sprinkle them with additional salt and freshly ground black pepper and return the pan to the oven for another 10 to 12 minutes or so, until the undersides match the tops.\nMeanwhile, make sauce: Heat 1 tablespoon olive oil in a large frying pan over medium heat. Once hot, add garlic and cook for one minute, until faintly golden. Add tomato puree, which is going to sputter and splash, so step back. Season with salt, black pepper, pepper flakes and stir in oregano. Simmer, stirring from time to time, for 15 minutes.\nAssemble melts: Heat broiler. Split bread in half and briefly run under broiler, just to lightly toast it so that the sauce doesn’t make it soggy. Split each bread half into 6 smaller toasts and arrange on 1 to 2 large baking sheets that have been lined with foil. Spread a little prepared sauce over each toast and sprinkle with some of the parmesan. Add a few eggplant slices to each, fanning them out. Top with more sauce (to taste, but not so much that eggplant is drenched), parmesan and then place a slice or so off mozzarella over the top of each, enough that when it melts, it should drape down easily. Run trays of melts under the broiler until cheese on top is melted and blistery, 5 minutes in my oven but possibly more or less in yours, so please keep an eye on it. Garnish with additional basil and dig in."
        ], 
        "date": "2016-08-22T12:32:56+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://i0.wp.com/farm1.static.flickr.com/213/464605524_cb4d9eef9a.jpg", 
        "tags": [
            "Guest Post", 
            "Photo", 
            "Seafood", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2007/04/fish-tacos/", 
        "title": "fish tacos", 
        "directions": [
            "Ciao foodies,", 
            "Jocelyn, Bloggysitter Extraordinaire"
        ], 
        "date": "2007-04-18T21:36:18+00:00"
    }, 
    {
        "ingredient_list": [
            "2 to 3 tablespoons olive oil", 
            "1/2 small yellow onion, chopped", 
            "2 cloves garlic, crushed then minced", 
            "1 red bell pepper, cored and sliced into thin strips", 
            "1 yellow bell pepper, cored and sliced into thin strips", 
            "1 Anaheim or 1 jalapeño chile, cored and sliced into thin strips", 
            "1/2 teaspoon ground cumin", 
            "1 teaspoon paprika", 
            "1/4 teaspoon table salt", 
            "1 14-ounce can crushed tomatoes, fire-roasted if you can get them", 
            "6 eggs", 
            "1/2 cup feta cheese, crumbled", 
            "2 teaspoons (or more to taste) za’atar", 
            "1 to 2 tablespoons chopped flat-leaf parsley (optional), to garnish", 
            "6 small or 4 large pitas", 
            "Pickled shallots", 
            "1/4 cup red or white wine vinegar", 
            "2 teaspoons kosher salt", 
            "1 1/2 teaspoons sugar", 
            "1/4 cup water", 
            "3 small shallots, peeled and thinly sliced", 
            "Asparagus pesto", 
            "1/2 pound asparagus spears, trimmed of tough ends", 
            "1 garlic clove, peeled and chopped", 
            "1/4 cup grated Parmesan cheese", 
            "3 tablespoons pine nuts or almonds, toasted and cooled, divided", 
            "1/4 teaspoon table salt, or a little more of a coarse sea salt", 
            "2 tablespoons olive oil", 
            "To assemble", 
            "6 large slices whole-wheat sourdough bread, miche, or another sliced country bread of your choice, toasted", 
            "2 tablespoons whole grain Dijon mustard", 
            "6 large hard-boiled eggs", 
            "2 to 3 slices of bacon, halved to approximate sandwich lengths", 
            "2 thin slices white, sourdough or a country bread, toasted", 
            "4 thin slices of tomato", 
            "A few leaves of iceberg lettuce", 
            "1 tablespoon mayonnaise", 
            "1 large egg", 
            "1 teaspoon butter", 
            "Salt and freshly ground black pepper to taste", 
            "1 pound Yukon Gold potatoes, cut into small (about 1/2-inch) cubes", 
            "1 tablespoon olive or vegetable oil", 
            "1/2 small onion, finely chopped", 
            "1/2 pound Mexican chorizo, casings removed", 
            "Salt", 
            "Freshly ground black pepper", 
            "6 large eggs", 
            "8 small corn tortillas, warmed or blistered in a hot pan", 
            "To finish", 
            "Crumbled queso freso (cotija, ricotta salata and feta are decent substitutes, if you can’t find it)", 
            "Chopped cilantro, diced tomatoes, diced white onions (you can also sink these in the same pickle brine as the shallots in the earlier recipe), pickled jalapenos, a dollop of crèma or sour cream, a squeeze of lime juice, a dash or hot sauce or all of the above", 
            "Waffles", 
            "3/4 cups all-purpose flour", 
            "3/4 cups cornmeal", 
            "1 1/2 teaspoons baking powder", 
            "1 teaspoon granulated sugar", 
            "1/2 teaspoon table salt", 
            "1 cup buttermilk", 
            "1 tablespoon unsalted butter, melted and cooled slightly", 
            "1 large egg", 
            "1/2 cup finely grated cheddar cheese", 
            "Spray cooking oil to coat waffle iron", 
            "Creamed greens", 
            "5 ounces baby spinach or another fairly quick-cooking green of your choice, stemmed if stems are heavy", 
            "Butter", 
            "1/4 small onion, finely chopped", 
            "3 tablespoons heavy cream", 
            "To assemble", 
            "4 large eggs", 
            "Hot sauce and diced fresh tomatoes (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/five-new-ways-to-make-egg-sandwiches1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2014/05/five-egg-sandwiches/", 
        "title": "five egg sandwiches", 
        "directions": [
            "Preheat your oven to warm and place a tray on a middle rack.", 
            "Make waffles: Whisk flour, cornmeal, baking powder, sugar and salt in a medium bowl. In a smaller bowl, whisk together buttermilk, butter and egg. Stir wet ingredients and grated cheese into the dry mixture until combined. ", 
            "Make waffles according to your manufacturer’s directions. In the waffle iron I used – a thin one that made 6 rectangular waffles per batch – I cooked the waffles on the middle heat setting and needed 1 1/4 to 1 1/2 cups batter per batch. I made about 1 1/2 batches, yielding 9 small waffles. ", 
            "Transfer waffles to tray in warmed oven and leave them there while you cook your greens.", 
            "Prepare creamed greens: Wash greens but no need to dry them. In a large skillet over medium-high heat, cook the greens until wilted. For baby spinach, we prefer it just barely wilted, which takes just a minute. For heartier greens, you’ll want to cook them a few minutes longer. Transfer greens to a colander and press out as much extra liquid as you can. If desired, coarsely chop greens. ", 
            "Wipe out pan and return it to medium heat. Melt butter and then cook onion until soft and tender, about 5 minutes. Return greens to pan and drizzle heavy cream over them. Cook, stirring, until cream simmers for a minute and mixture is evenly combined. Season with salt and freshly ground black pepper and set aside.", 
            "Poach eggs: Poach eggs according to your favorite method. If you don’t have one, here’s mine: Heat a saucepan with a few couple inches of water to the point right before it simmers. Using a cooking spoon, create a whirlpool and crack your egg right into the center of it and stop swirling. The egg should mostly wrap around itself. Continue to let the egg cook, keeping the water from fully simmering, until the white is firmed up but it the egg still jiggles from the middle when nudged with a spoon, about 3 to 4 minutes. Scoop out with a slotted spoon and repeat with remaining eggs.", 
            "Assemble sandwiches: Place one square or wedge of waffle on a plate. Top with 1/4 of the creamed greens and a single poached egg. Dash with hot sauce, if desired, or a scattering of chopped tomatoes. Top with a second square or wedge of waffle and eat, precariously. "
        ], 
        "date": "2014-05-16T10:36:40+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large garlic cloves, chopped", 
            "1/4 cup plus 1/2 tablespoon extra-virgin olive oil", 
            "1 (14- to 15-oz) can stewed tomatoes", 
            "1 3/4 cups reduced-sodium chicken broth", 
            "2 (19-oz) cans cannellini beans, rinsed and drained (3 cups)", 
            "1 (1/2-lb) piece baked ham (1/2 to 3/4 inch thick), cut into 1/2-inch cubes", 
            "1/4 teaspoon black pepper", 
            "1 (5-oz) bag baby romaine (er, what? I used spinach) or baby arugula (10 cups loosely packed)", 
            "8 (3/4-inch-thick) slices baguette"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/four-cool-things-plus-white-bean-stew1.jpg?w=500", 
        "tags": [
            "Announcements", 
            "Beans", 
            "Photo", 
            "Stew", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/03/four-cool-things-plus-white-bean-stew/", 
        "title": "four cool things plus white bean stew", 
        "directions": [
            "Cook garlic in 1/4 cup oil in a 3 1/2- to 4 1/2-quart heavy pot over moderately high heat, stirring, until golden, 1 to 2 minutes. Coarsely cut up tomatoes in can with kitchen shears, then add (with juice) to garlic in oil. Stir in broth, beans, ham, and pepper and bring to a boil. Reduce heat and simmer, uncovered, 5 minutes. Stir in greens and cook until wilted, 3 minutes for romaine or 1 minute for arugula.", 
            "While stew is simmering, preheat broiler. Put bread on a baking sheet and drizzle with remaining 1/2 tablespoon oil. Broil 3 to 4 inches from heat until golden, 1 to 1 1/2 minutes.", 
            "Serve stew with toasts."
        ], 
        "date": "2008-03-12T17:21:20+00:00"
    }, 
    {
        "ingredient_list": [
            "2 slices bread of your choice", 
            "2 teaspoons butter, salted or unsalted", 
            "1/2 cup (2 ounces) coarsely grated cheddar "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/frico-grilled-cheese-sandwiches1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Quick", 
            "Sandwich", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/10/frico-grilled-cheese-sandwiches/", 
        "title": "frico grilled cheese sandwiches", 
        "directions": [
            "Spread butter on one side of each slice of bread, the one that will be on the outside of the sandwich. Scatter all but 2 tablespoons cheese unbuttered side of one slice. Top with second slice, so that the buttered side faces out. Heat skillet over low-to-moderate heat. (I like to use a well-seasoned cast iron frying pan here.) Sprinkle 1 tablespoon cheese roughly in center of skillet. Place sandwich on top. Cook sandwich until golden underneath and cheese browns and crisps, about 2 to 4 minutes. Carefully lift melted (frico-ed) cheese and bread onto spatula, sprinkle remaining spoonful of cheese back in skillet, then flip sandwich over on top of it. Cook on second side until golden and crisp as well, pressing down on it with the spatula to encourage it to all come together. ", 
            "Transfer to a plate, cut in half if desired, and dig in.", 
            "Alternate riffs on the classic: Are you a purist or do you like to put other things on your grilled cheese? I’m a sucker for sweet and sour red onions with a baby Swiss or gruyere cheese (this recipe in the book). But when I’m using classic cheddar, I either like a thin slice of tomato inside my sandwich, or sometimes, like the day I made these, the thinnest schmear of smooth Dijon and a dash of onion powder. "
        ], 
        "date": "2013-10-03T11:19:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups frisée (French curly endive), torn into-bite size pieces (about 2 ounces)", 
            "1 bacon slice, preferably thick-cut", 
            "1 tablespoon minced shallot (from 1 small)", 
            "1 teaspoon smooth Dijon mustard", 
            "4 teaspoons red wine vinegar", 
            "Salt and freshly ground black pepper", 
            "1/4 cup crumbled blue cheese ", 
            "1 to 2 teaspoons unsalted butter, divided", 
            "2 large eggs", 
            "Salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/02/fried-egg-sandwich-with-bacon-and-blue-cheese.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Eggs", 
            "Photo", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2012/02/fried-egg-sandwich-with-bacon-and-blue-cheese/", 
        "title": "fried egg sandwich with bacon and blue cheese", 
        "directions": [
            "Split your rolls and put them in to toast.", 
            "Place frisée in a medium bowl. Cut bacon crosswise into 1/4-inch wide lardons. In a small heavy skillet, cook bacon over moderate heat, until pieces are crisp. With a slotted spoon, transfer bacon to paper towels, reserving bacon fat in pan. Add shallot to bacon fat and cook for one minute, stirring. Add red wine vinegar and let hiss and bubble for 20 to 30 seconds, then remove from heat and whisk in Dijon. Immediately pour hot dressing over frisée and toss with drained lardons, salt and pepper. Don’t try the salad just yet or you will be tempted to eat it just the way it is when, I promise, it’s even better with an egg on top.", 
            "Remove rolls from toaster and divide bacon-frisee salad between each bottom bun. You’ll want to heap on more than seems feasible or needed, especially once you realize how tasty it is. Top each salad pile with half (2 tablespoons) of the blue cheese.", 
            "Reheat skillet over medium-high heat. Add the butter and swirl it to coat the pan. Crack one egg into the skillet, season with salt and pepper and reduce heat to medium. I like to cover the skillet with a small lid at this point, as it seems to help the egg cook faster and more evenly. In one minute, you should have a perfect sunny-side-up egg. However, I find that for this sandwich, to somewhat rein in the mess, it helps to then flip the egg for 20 to 30 seconds, until the yolk is still runny, but less likely to run right off your sandwich.", 
            "Remove the egg from the pan and place it on top of the bacon-frisée salad on the bun. Repeat with remaining egg and come on, what are you waiting for? Dig in."
        ], 
        "date": "2012-02-27T17:54:54+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds small (I used Manila) clams", 
            "2 thick slices country or sourdough bread", 
            "1/2 tablespoon olive oil to brush bread (optional)", 
            "2 tablespoons butter", 
            "2 cloves garlic, thinly sliced or minced", 
            "1 large or 2 small shallots, minced or 1/4 cup minced white onion", 
            "Salt and red pepper flakes", 
            "1/2 cup dry white wine", 
            "1 tablespoon chopped fresh herbs — parsley, cilantro, chives or a mix", 
            "1 lemon, in wedges"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/garlic-wine-and-butter-steamed-clams.jpg?w=750", 
        "tags": [
            "Budget", 
            "Date Night", 
            "Photo", 
            "Portuguese", 
            "Quick", 
            "Seafood", 
            "Summer", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/09/garlic-wine-and-butter-steamed-clams/", 
        "title": "garlic wine and butter steamed clams", 
        "directions": [
            "If you think your clams may not be clean, wash them first: Fill a large bowl with cool tap water and place the clams in it. Let them soak for 20 minutes during which they’ll expel any sand and grit.", 
            "While they’re soaking, grill or broil your bread: Dab both sides lightly with olive oil, if using, and grill or broil until well-toasted on both sides.", 
            "Lightly scrub your clams. Discard any with chipped shells.", 
            "In a large saute pan with a lid, melt butter and add garlic, shallots, salt and pepper flakes. Cook for 1 to 2 minutes over medium-high. Add wine — and as soon as it simmers, add all the clams and cover with a lid. In three minutes, almost all should be wide open; discard any that do not open. Transfer to a bowl and ladle cooking liquid over. Scatter with herbs and serve with grilled bread and lemon."
        ], 
        "date": "2016-09-20T11:58:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup ketchup", 
            "1 tablespoon prepared horseradish", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "1 teaspoon ancho or other mild chili powder", 
            "Pinch cayenne pepper", 
            "1 tablespoon juice from 1 small lemon (we use more)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/3564906953_91d36a4607_o.jpg?w=753", 
        "tags": [
            "Grilling", 
            "Photo", 
            "Seafood", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2009/05/grilled-shrimp-cocktail/", 
        "title": "grilled shrimp cocktail", 
        "directions": [
            "Stir all ingredients together in a small bowl; adjust seasonings as necessary. Cocktail sauce keeps for up to two weeks in the fridge.", 
            "To Grill Your Shrimp Peel and devein shrimp, leaving the tails attached. Toss the shrimp in a large bowl with a generous amount of olive oil, salt and fresh pepper. Grill them for just a minute or two on each side — threading them first on skewers that you’ve soaked in water makes this even easier — being careful not to overcook them. You can squeeze some lemon juice on when you’re done, for an extra hit of flavor. Serve with cocktail sauce.", 
            "To Poach Your Shrimp: Peel and devein shrimp, leaving the tails attached. Bring shrimp stock (you can make this by boiling the shrimp shells for 20 minutes in three cups of water with a tablespoon of salt and straining the liquid) or water to a boil. Additionally, you might add some lemon peels, several glugs of white wine, peppercorns, a bay leaf or tarragon to the boiling liquid for extra flavor. Turn off heat and stir in shrimp; cover and let stand until firm and pink, 8 to 10 minutes. Drain shrimp. Plunge shrimp into ice water to stop cooking, then drain again. Serve shrimp chilled with cocktail sauce."
        ], 
        "date": "2009-05-26T15:07:38+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup olive oil, divided", 
            "4 large links of sweet Italian sausage, casings removed (I used half of this, preferring the sausage to not dominate the soup’s flavor [update] and from the comments, it sounds like most of you preferred it with just 2 links as well)", 
            "1 medium onion, diced", 
            "2 celery stalks, sliced or diced", 
            "2 medium carrots, peeled and sliced into half-moons or diced", 
            "4 cloves garlic, sliced (reserve half for later in recipe)", 
            "Kosher salt", 
            "A pinch of crushed red pepper flakes (optional)", 
            "1 cup brown lentils, sorted and rinsed", 
            "2 bay leaves", 
            "1 28-ounce can crushed tomatoes", 
            "6 cups water", 
            "Freshly ground black pepper", 
            "3 to 4 cups shredded or thinly ribboned Swiss chard leaves or kale", 
            "Grated Pecorino Romano cheese to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/01/lentil-soup-with-sausage-chard-and-garlic.jpg?w=750", 
        "tags": [
            "Beans", 
            "Date Night", 
            "Photo", 
            "Soup", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2013/01/lentil-soup-with-sausage-chard-and-garlic/", 
        "title": "lentil soup with sausage, chard and garlic", 
        "directions": [
            "Heat 1/4 cup olive oil (enough to coat bottom of pot) in a large pot on medium heat. When hot, add the sausage, breaking it up with a wooden spoon until it starts to brown, about five minutes. Add the onion, celery, carrots, first two garlic cloves, a pinch of salt, and if you like your soup spicy, a pinch of red pepper flakes. Cook with the sausage until the vegetables soften a bit, another 5 minutes. Add the lentils, bay leaves, tomatoes, water (6 cups is, conveniently, a little less than 2 empty 28-ounce cans, so you can get any tomato pulp you missed), more salt and black pepper to taste. Bring to a simmer and allow to cook until the lentils are tender, about 40 minutes. (It might be necessary to add more water if the soup gets too thick, though we preferred ours on the thick side.)", 
            "When the lentils are cooked, add the chard and cook until the leaves are tender, just a few minutes more. Discard the bay leaves. ", 
            "To finish, divide soup among bowls, then add the remaining 1/4 cup olive oil and 2 garlic cloves to a small skillet and heat over medium until the garlic softens and hisses. Drizzle this over soup bowls, and top with fresh Romano, passing more at the table. Leftovers will keep for several days in the fridge."
        ], 
        "date": "2013-01-22T11:36:49+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds unpeeled small Yukon gold (Ina’s suggestion) or fingerling (what I used) potatoes", 
            "Coarse, kosher or sea salt", 
            "3 tablespoons Champagne or white wine vinegar", 
            "1/2 teaspoon Dijon mustard", 
            "1/2 teaspoon minced or pressed garlic", 
            "1 large or extra-large egg yolk, ideally at room temperature", 
            "Freshly ground black pepper", 
            "1/2 cup olive oil", 
            "1/4 cup dry white wine (you can skip this, or use less, with little harm; I used 1 tablespoon vermouth instead)", 
            "3 tablespoons drained capers (I imagine minced cornichons would be a good alternative)", 
            "6 scallions, thinly sliced (yielding about 1 cup)", 
            "2 medium stalks celery, diced small (about 1/4 inch) (yielding about 1/2 cup)", 
            "1/2 cup finely diced red onion", 
            "1 1/2 pounds cooked lobster meat, cooked and cooled, in a 1-inch dice (from about 7 to 8 pounds fresh lobster; see post above for better budgeted suggestions)", 
            "1 lemon", 
            "3 tablespoons coarsely chopped fresh tarragon (Ina’s suggestion) or flat-leaf parsley (what we used)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/lobster-and-potato-salad.jpg?w=750", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad", 
            "Seafood", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/05/lobster-and-potato-salad/", 
        "title": "lobster and potato salad", 
        "directions": [
            "Cook the potatoes: Place the potatoes in a large pot and cover with an inch or two over water. Add 1 tablespoon salt and bring to a boil. Lower the heat and simmer for 15 to 25 minutes, depending on the size of the potatoes, until just tender. (A bamboo skewer is ideal to test them.) Drain in a colander, and let potatoes cool for 5 minutes. Cut potatoes into quarters or halves (or fingerlings into 1/2- to 1-inch segments) and place them in a large bowl.", 
            "Make the vinaigrette: Whisk together the vinegar, mustard, garlic, egg yolk, 1 teaspoon salt, and many grinds of black pepper (Ina recommends you use a full teaspoon of pepper). Whisking constantly and vigorously, pour the oil in in a thin drizzle, ideally making an emulsion. Stir in the wine (if using) and capers. ", 
            "Assemble the salad: While the potatoes are still very warm, pour half the vinaigrette on the potatoes and toss them gently, allowing them to soak up the vinaigrette. Stir in the scallions, celery, red onion, lobster, and add enough vinaigrette to moisten. Reserve any remaining vinaigrette for later. Add the zest and juice of the lemon, the tarragon or parsley, and more salt and pepper to taste (Ina calls for another 2 teaspoons salt and 1 teaspoon pepper, but this felt like overkill). Cover with plastic wrap and refrigerate for at least an hour to allow flavors to blend. Taste for seasonings and add more vinaigrette, if necessary. ", 
            "Serve: This salad is especially good served closer to room temperature. Don’t forget to share."
        ], 
        "date": "2013-05-29T10:56:52+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds cooked lobster meat*, chopped roughly into 1/2 and 3/4-inch pieces", 
            "1 small celery rib, finely chopped", 
            "1/4 cup mayonnaise (Charles insists on Hellman’s; I didn’t argue)", 
            "Squeeze or two of lemon juice", 
            "Pinch of kosher salt and freshly ground black pepper", 
            "2 top-loading hot dog buns or 64 miniature burger buns (described above) or small dinner rolls", 
            "Unsalted butter", 
            "Snipped fresh chives for garnish (though we mixed ours right into the salad, for convenience)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/lobster-rolls1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Salad", 
            "Seafood"
        ], 
        "url": "https://smittenkitchen.com/2009/08/lobster-rolls/", 
        "title": "lobster rolls", 
        "directions": [
            "In a large bowl, combine the lobster meat, celery, mayonnaise, lemon and salt and pepper and mix thoroughly. Adjust seasonings to taste.", 
            "Do ahead: Cover the mixture and store it in the refrigerator until ready to serve. It will last for up to two days.", 
            "How they prepare the buns at the restaurant: In a small sauté pan over low to medium heat, melt two teaspoons of butter. Place the hot dog buns on their sides in the butter. Flip the buns a couple of times so that both sides soak up an equal amount of butter and brown evenly. Remove the buns from the pan and place them on a large plate. Fill the toasted buns with lobster salad.", 
            "How we prepared our miniature rolls: On large roasting pans, we split each of our rolls and lightly toasted them, open side up, before quickly slathering both sides with butter and filling each with a generous tablespoon of lobster salad.", 
            "Sprinkle your rolls with chives and serve with a salad, slaw or shoestring fries.", 
            "* We bought our lobster meat, cooked that morning and shelled, from The Lobster Place, for those of you who were going to ask. However, not all markets are as trustworthy when it comes to lobster meat that they label “fresh” — it is often overcooked and not as recently-rendered as they promise. If you’re up for it, cooking and cracking your own will ensure freshness while reducing your grocery tab. About 20 percent of the weight of a lobster is its meat, so you would need, for example, five one-pound lobsters to get one pound of meat. Don’t panic — as I did — when you see how tiny the mass of two pounds of lobster meat might look. Once diced, our salad nearly filled a six-cup bowl."
        ], 
        "date": "2009-08-10T11:45:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound small shrimp, shelled and deveined or pre-cooked and defrosted", 
            "2 firm-ripe avocados, halved, scored into a small dice", 
            "2 cups grape tomatoes, quartered or 2 cups chopped tomatoes, drained a little", 
            "1/2 small white onion, very finely chopped (use red if you can’t find white)", 
            "1 small jalapeño, seeded and finely chopped (optional)", 
            "Drizzle of olive oil", 
            "Juice of 1 to 2 limes", 
            "Salt", 
            "Handful cilantro leaves, roughly chopped", 
            "Hot sauce, on the side", 
            "Tortilla chips, to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/9349257784_815a1814b7_o.jpg?w=750", 
        "tags": [
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Seafood", 
            "Side Dish", 
            "Summer", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2013/07/mama-canales-garcias-avocado-shrimp-salsa/", 
        "title": "mama canales-garcia’s avocado-shrimp salsa", 
        "directions": [
            "To cook the shrimp: Bring salted water* to a boil and turn off heat. Add shrimp, cover pot and let stand until firm and pink, about 5 to 7 minutes. Drain shrimp, pat dry and chill. ", 
            "Make salsa: Chop shrimp into small bites and put in medium bowl. Scoop avocados into bowl. Add tomatoes, white onion, jalapeño (if using, to taste) and a drizzle of olive oil. Add the juice of one lime, and a second one, if needed. Add salt to taste, then cilantro. Serve with tortilla chips.", 
            "* If you have more time, you can first make a shrimp stock with about 3 cups water, 1 cup beer or wine, the reserved shrimp shells, additional lime juice or the peels from the lime juice you’ll use in the salad and some peppercorns or red pepper flakes. Boil these together for 20 minutes, then strain the mixture. Cook the shrimp in this stock instead."
        ], 
        "date": "2013-07-23T12:01:06+00:00"
    }, 
    {
        "ingredient_list": [
            "Meatballs", 
            "The baguettes or seeded sandwich rolls you’ll use for your sandwiches (see Note above for how to estimate)", 
            "2 pounds ground meat of your choice (I used pork but have in the past used beef, veal, chicken, turkey or a blend thereof)", 
            "2 tablespoons chopped parsley", 
            "1/3 cup finely grated Parmesan or Romano cheese", 
            "3/4 teaspoon salt", 
            "Pinch of red pepper flakes", 
            "2 small garlic cloves, minced", 
            "1 teaspoon onion powder", 
            "1 teaspoon Worcestershire sauce", 
            "1 large egg", 
            "Olive oil", 
            "4 cups prepared tomato sauce (plus extra if you like a lot of extra sauce)", 
            "Caramelized onions", 
            "2 large yellow onions, thinly sliced", 
            "1 tablespoon butter", 
            "1 tablespoon olive oil", 
            "Salt", 
            "Assembly", 
            "2 cups coarsely shredded Gruyère"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/meatball-sub-with-caramelized-onions.jpg?w=750", 
        "tags": [
            "Meat", 
            "Onions", 
            "Photo", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2011/02/meatball-sub-with-caramelized-onions/", 
        "title": "meatball subs with caramelized onions", 
        "directions": [
            "Make the meatballs: Split your rolls almost the whole way through, leaving one side attached. Scoop out some of the roll to create a channel for the meatballs to rest in. Grind the bread you pulled out in a food processor or tear it into minuscule bits. You will need 1 1/3 cups or 2 3/4 ounces of fresh breadcrumbs for the meatballs. If you’re not making subs, you can get this same amount of breadcrumbs from 2 to 3 sandwich bread slices. Set rolls aside until later.", 
            "Place the fresh breadcrumbs in a large bowl with 3/4 cup warm water and all of the meatball ingredients except for the olive oil and tomato sauce. Combine with a fork, breaking up clumps of meat until the ingredients are evenly distributed. Form mixture into 2-inch meatballs are arrange on a tray. I find wet hands make it easier to form meatballs without them sticking too much.", 
            "Heat a generous slick of oil (few tablespoons) in a large saute pan with a lid. Brown meatballs in batches, being careful not to crowd the pan or nudge them before they are nicely browned or they will stick and you’ll leave delicious meatball bits in the pan. These meatballs are soft, so use a gentle hand. Transfer meatballs to a paper towel-lined tray and continue until they are all browned.", 
            "Discard the oil and heat your tomato sauce in the pan. Add the meatballs, cover the pan and simmer them on the lowest heat possible for 25 to 30 minutes, until the meatballs are cooked through.", 
            "Caramelize onions: While the meatballs are simmering, you can cook the onions. Heat the olive oil and butter in a heavy large skillet over medium-low heat. Add onion, sprinkle with salt and a little pepper and cook until they’re tender, sweet, and a deep golden brown, stirring occasionally. This takes me about 30 minutes.", 
            "Assemble subs: Arrange meatballs with sauce in the hollowed-out roll(s). Drape caramelized onions over the top and sprinkle with shredded cheese. Place subs under a broiler or in an oven at top heat to melt the cheese."
        ], 
        "date": "2011-02-04T13:40:16+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups light, dry white win or 1 cup dry white vermouth", 
            "An 8- to 10-quart enameled kettle with cover, though I’ve made this in many other pots successfully", 
            "1/2 cup minced shallots, or green onions, or very finely minced onions", 
            "8 parsley sprigs", 
            "1/2 bay leaf", 
            "1/4 teaspoon thyme", 
            "1/8 teaspoon pepper", 
            "6 tablespoons butter", 
            "6 quarts scrubbed, soaked mussels", 
            "1/2 cup roughly chopped parsley ", 
            "6 russet potatoes", 
            "1/4 cup extra-virgin olive oil*", 
            "Salt and freshly ground black pepper "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/08/moules-frites.jpg?w=750", 
        "tags": [
            "French", 
            "Gluten-Free", 
            "Photo", 
            "Seafood"
        ], 
        "url": "https://smittenkitchen.com/2006/08/moules-frites/", 
        "title": "moules à la marinière", 
        "directions": [
            "Preheat the oven to 400 degrees F. Peel potatoes (if peeled fries are your thing, skip it if you couldn’t care) and cut into half-inch thick slices (lengthwise) cut again into 1/2-inch thick fries. Place the potatoes into a pot with cold water and 1 tablespoon of salt. Bring up to a gentle boil and simmer until a paring knife tip goes through easily, cooked about 3/4 of the way through. ", 
            "Drain carefully and put potatoes a bowl. Add olive oil, 1 tablespoon salt, 1/2 teaspoon black pepper. Toss well and lay out in 1 layer on baking sheet. Bake until light brown. ", 
            "* I used less this time, oiling the baking sheet first to limit sticking. He suggests you use a non-stick baking sheet if you have one. (I don’t.)"
        ], 
        "date": "2006-08-26T11:10:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2-inch slice seven-grain sandwich bread", 
            "1/2 a large, ripe avocado", 
            "1 tablespoon olive oil", 
            "1 tablespoon lemon juice, or more to taste", 
            "Salt", 
            "An unholy amount of red pepper flakes"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/nolita-style-avocado-toast1.jpg?w=640", 
        "tags": [
            "Avocado", 
            "Budget", 
            "Photo", 
            "Quick", 
            "Sandwich", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/03/nolita-style-avocado-toast/", 
        "title": "nolita-style avocado toast", 
        "directions": [
            "Toast the bread so that it’s dark and firm. Scoop the avocado into a bowl and lightly mash/chop it, or directly onto your toast and do the same. Spread the avocado from edge to edge of the toast, leaving no bread uncovered, mounding it smoothly in the center. Drizzle olive oil over so that it rolls off onto the plate. Repeat with lemon juice. Shake or grind on some fine salt and cover with red pepper flakes. Slice toast on the diagonal and eat with a knife and fork, if before noon, with a cup of coffee or tea, if after, a petite glass of rose wine. ", 
            "On the side: If trying to stretch this into a fuller meal, you cannot go wrong with David Lebovitz’s simple carrot salad on the side, or the Moroccan-hinted harissa and feta version in the archives here."
        ], 
        "date": "2016-03-08T12:05:25+00:00"
    }, 
    {
        "ingredient_list": [
            "5 cups (635 grams) whole-wheat flour", 
            "2 cups (160 grams) rolled oats (I used quick-cooking for the least noticable texture)", 
            "1 tablespoon kosher or coarse salt", 
            "3 tablespoons raw or brown sugar, honey or agave nectar", 
            "1 large egg", 
            "1/4 cup (55 grams grams) vegetable or olive oil, plus a little more to coat bowl", 
            "1 1/4 cups lukewarm water", 
            "1 1/4 cups lukewarm milk, any kind", 
            "1 1/2 tablespoons (about 14 grams) instant yeast"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/oat-and-wheat-sandwich-bread1.jpg?w=750", 
        "tags": [
            "Bread", 
            "Freezer Friendly", 
            "Photo", 
            "Sandwich", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/09/oat-and-wheat-sandwich-bread/", 
        "title": "oat and wheat sandwich bread", 
        "directions": [
            "Make bread dough: In the bottom of large mixing bowl, combine water, milk and sugar or honey, then stir in yeast. Add egg and oil and whisk until combined. Add flour, oats and salt and if mixing with a machine, combine with paddle attachment at the lowest speed for 1 minute. If mixing by hand, use a large spoon and stir for 1 minute. The dough will be wet and coarse; do not fret. Let it rest for 5 minutes.", 
            "If using a mixer, switch to the dough hook and mix the dough on medium-low for 2 more minutes. By hand, do the same with your spoon. The dough will seem firm and more smooth, ideally supple and sticky, but if it’s still very wet, add a bit more flour, a spoonful at a time. If it seems excessively stiff, add a little more water, a spoonful at a time. Continue to mix with dough hook or by hand for 4 minutes.", 
            "Scrape dough out onto lightly floured counter. Knead a few times, then form the dough into a ball. Oil your empty mixing bowl and return dough to it. Cover with plastic wrap and let proof at room temperature for 60 to 70 minutes, or until doubled in buik or transfer to the fridge and let it ferment overnight or up to 5 days. If proofing in the fridge, remove the dough before the fridge about 3 hours before you plan to bake it.", 
            "Form loaves: [Edited to add:] Lightly coat two standard loaf pans with oil, butter or a nonstick spray. Turn dough onto a floured counter and divide it into two equal pieces. Press each gently into a rough rectangle-ish shape. Fold in sides so that the first dough is roughly the width of your prepared bread loaf pan (about 9 inches). Roll from bottom to top and then put this log into your bread loaf pan, seam side down. Repeat with remaining dough. Let proof at room temperature for about an hour, or until the dough has crowned 1 inch above the rim of the baking pan. Halfway through, heat oven to 350 degrees F.", 
            "Bake bread: For 35 to 40 minutes, rotating pans once for even color. A cooked loaf of bread will sound a bit hollow when tapped and the internal temperature should read 190 degrees F. Remove loaves from tins and let cool on a rack. If you’re planning to freeze bread, I like to let it cool completely before slicing it, then sliding the sliced loaf into freezer bags. You can mark them with a date, but they rarely last long enough to be forgotten."
        ], 
        "date": "2015-09-21T12:24:24+00:00"
    }, 
    {
        "ingredient_list": [
            "Pickling mixture", 
            "1 cup distilled white vinegar", 
            "4 tablespoons sugar", 
            "2 tablespoons Kosher salt", 
            "2 tablespoons yellow mustard seeds", 
            "1 cup cold water", 
            "Slaw mixture", 
            "4 to 5 cups mixed slivered or julienned* firm, raw vegetables (see above for vegetable suggestions, below for slicing tips)", 
            "Optional: Few slivers of jalapeno"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/06/pickled-vegetable-sandwich-slaw.jpg?w=750", 
        "tags": [
            "Photo", 
            "Pickled", 
            "Picnics", 
            "Salad", 
            "Sandwich", 
            "Side Dish", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/06/pickled-vegetable-sandwich-slaw/", 
        "title": "pickled vegetable sandwich slaw", 
        "directions": [
            "Heat vinegar, sugar, salt and mustard seeds to a simmer in a small, non-reactive pot over moderate heat, stirring only until sugar and salt dissolve. Stir in water, which should bring the mixture’s temperature down significantly. Let cool to lukewarm. ", 
            "Divide vegetables between jars. (I used two 3/4 liter jars.) Pour vinegar mixture over vegetables and refrigerate until needed. You’ll find the vegetables to be lightly pickled within an hour, and deliciously pickled within a day. They will get slightly more pickled as they sit, but the change shouldn’t be too dramatic from the 24 hour level.", 
            "Eat with/on sandwiches, aside grilled food and pack it along for picnics — it goes with almost anything. Then make more, because this stuff is habit-forming.", 
            "Do ahead: Mine have kept in the fridge for a month without any change in taste or appearance. Updated to add (thanks, Erika!) that you’ll want to make sure that your vegetables are submerged in the brine for them to keep this long.", 
            "* I used a mix of a sharp knife, a simple mandoline (that includes julienne blades) and a julienne peeler (the Kuhn one), which I was embarrassed to admit I bought last year until I realized how much easier it makes getting juliennes from long, thin vegetables (carrots, cucumbers, parsnips and zucchini). Don’t fret if you don’t have a fancy peeler or mandoline; you can cut thin strips with your knife, then slice them into skinny matchsticks quite easily."
        ], 
        "date": "2013-06-27T11:28:55+00:00"
    }, 
    {
        "ingredient_list": [
            "2 teaspoons good olive oil", 
            "2 cups large-diced yellow onions (2 onions)", 
            "2 cups large-diced carrots (3 to 4 carrots)", 
            "1 tablespoon minced garlic (3 cloves)", 
            "1 (28-ounce) can whole plum tomatoes", 
            "1 cup French green lentils (7 ounces)", 
            "2 cups vegetable or chicken broth", 
            "2 teaspoons mild curry powder", 
            "2 teaspoons chopped fresh thyme leaves", 
            "2 teaspoons kosher salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "1 tablespoon red wine vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/queens-and-contessas1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Freezer Friendly", 
            "Photo", 
            "Stew", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2006/10/queens-and-contessas/", 
        "title": "stewed lentils and tomatoes", 
        "directions": [
            "Heat the oil in a large saucepan. Add the onions and the carrots and cook over medium-low heat for 8 to 10 minutes, until the onions start to brown. Stir occasionally with a wooden spoon. Add the garlic and cook for one minute more.", 
            "Meanwhile, place the canned plum tomatoes, including the juice, in the bowl of a food processor fitted with a steel blade and pulse several times until the tomatoes are coarsely chopped. Rinse and pick over the lentils to make sure there are no stones in the package.", 
            "Add the tomatoes, lentils, broth, curry powder, thyme, salt and pepper to the pan. Raise the heat to bring to a boil, then lower the heat and simmer covered for about 40 minutes, until the lentils are tender. Check occasionally to be sure the liquid is still simmering. Remove from the heat and allow the lentils to sit covered for another 10 minutes. Add the vinegar, season to taste and serve hot."
        ], 
        "date": "2006-10-30T12:45:45+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup extra virgin olive oil", 
            "1/4 cup chopped fresh ginger (I use half this; I’m tepid in the fresh ginger department)", 
            "1 medium onion, finely chopped", 
            "1 plum tomato, diced", 
            "3 cloves garlic, chopped", 
            "1 large green chili, chopped (optional)", 
            "1 teaspoon salt", 
            "1 teaspoon ground cumin", 
            "1 teaspoon ground coriander", 
            "1/2 teaspoon cumin seeds", 
            "1/2 teaspoon ground tumeric", 
            "1/4 teaspoon cayenne", 
            "8 ounce can of tomato sauce or 8 ounces of one of your choice", 
            "3 cups boiled red kidney beans or 30 ounces canned red kidney beans, undrained", 
            "1/2 cup chopped fresh cilantro (or parsley, if you’re cilantro-averse)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/02/red-kidney-bean-curry.jpg?w=753", 
        "tags": [
            "Beans", 
            "Freezer Friendly", 
            "Indian", 
            "Photo", 
            "Quick", 
            "Stew", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/02/red-kidney-bean-curry/", 
        "title": "red kidney bean curry", 
        "directions": [
            "Heat oil in a deep sauce pan over medium heat for one minute. Add ginger, garlic, onion, green chili, and let sizzle for one minute. Add the tomato sauce, salt and remaining spices and cook for an additional five minutes, stirring frequently. Add the kidney beans with water or canned red kidney beans (undrained) plus one additional cup of water, and tomatoes. Bring it to a boil, then reduce to medium heat and let cook uncovered for 10 minutes. Remove from heat. Garnish with cilantro.", 
            "Serve over rice or with naan. A dollop of plain yougurt on top is heavenly."
        ], 
        "date": "2009-02-17T19:21:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1 head cauliflower", 
            "2 tablespoons extra-virgin olive oil", 
            "1 small onion, chopped", 
            "2 cloves garlic, minced", 
            "1 quart low-sodium chicken stock", 
            "1/2 cup finely grated Parmesan", 
            "Salt and freshly ground black pepper ", 
            "2 tablespoons mayonnaise – or – 1 egg", 
            "1 tablespoon fresh lemon juice", 
            "1/2 teaspoon Dijon mustard", 
            "1 small garlic clove, minced", 
            "1/2 teaspoon Worcestershire sauce", 
            "1 oil-packed anchovy fillet, finely chopped (optional)", 
            "1/4 cup extra-virgin olive oil", 
            "10 to 12 ounces good-quality solid tuna packed in olive oil, well drained*", 
            "2 scallions washed, trimmed and chopped fine", 
            "6 pepperoncini peppers, destemmed and julienned", 
            "3 tablespoons chopped fresh dill", 
            "1/4 cup roasted or smoked almonds, chopped roughly, or a small handful toasted pine nuts", 
            "1/4 cup good-quality olive oil (or the oil the tuna was packed in)", 
            "1 tablespoon smooth Dijon mustard", 
            "1 tablespoon whole-grain mustard", 
            "1 teaspoon balsamic vinegar", 
            "1 teaspoon fresh lemon juice or more to taste", 
            "1/4 to 1/2 teaspoon freshly ground black pepper. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/09/silky-cauliflower-soup.jpg?w=749", 
        "tags": [
            "Cauliflower", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Seafood", 
            "Soup", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2006/09/silky-cauliflower-soup/", 
        "title": "silky cauliflower soup", 
        "directions": [
            "Mix all the ingredients well with a fork in a medium-size, nonreactive bowl. Taste and adjust the lemon juice and pepper. The salad can be made up to 3 days in advance and refrigerated. ", 
            "* I’ve done this two ways, with oil-packed and the reserved oil, as well as using drained water-packed and adding in 1/4 cup olive oil, and have to say that I find the latter to be a far less oil-slicked result. You can always add more olive oil, but I found it hard to take away the heaviness the oil-packed came with."
        ], 
        "date": "2006-09-03T11:54:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 15-ounce can chickpeas, drained and rinsed", 
            "2 tablespoons pitted, halved and very thinly sliced black olives", 
            "1 tablespoon finely chopped red onion", 
            "1 tablespoon chopped fresh parsley", 
            "Zest and juice from half a lemon (if you’ve got one of those sad, juiceless lemons, use both sides for juice)", 
            "Couple good pinches of salt", 
            "A few grinds of black pepper", 
            "A few glugs of olive oil (the original is quite oily, like bread-soaking oily, I went a little lighter. Both ways are delicious)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/smashed-chickpea-salad1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Budget", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2009/01/smashed-chickpea-salad/", 
        "title": "smashed chickpea salad", 
        "directions": [
            "Mix everything but the olive oil in a small to midsize bowl. Very lightly smash the chickpea mixture with the back of a fork or a potato masher. You’re not looking for a hummus-like puree but something closer to a coarse chop with a few smaller bits to hold it together. Add the glugs of olive oil, mix it lightly and enjoy.", 
            "This is also awesome as a sandwich on toasted bread, and it needs nothing else on it. But, if you want to doll it up, here are some ideas: A slice of roasted red pepper (as they do at ‘wichcraft), watercress (ditto), a slice of pickled garlicky red pepper (our way). We schmeared the bread with a tahini dressing, which was just tahini, lemon juice and a minced garlic clove thinned with water, but if you’ve got some harissa, I bet that would also be delicious."
        ], 
        "date": "2009-01-19T14:07:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup mayonnaise", 
            "1/2 cup sour cream", 
            "1 tablespoon prepared horseradish", 
            "1 tablespoon Worcestershire sauce", 
            "2 tablespoons Creole mustard, or a mustard that you prefer", 
            "1 teaspoon smoked paprika", 
            "Zest and juice from 2 lemons", 
            "2 tablespoons Tabasco sauce (see Note; I skipped this)", 
            "1 teaspoon cayenne powder (I used much less)", 
            "3 green onions, thinly sliced (white and green parts)", 
            "1 stalk celery, finely diced", 
            "1/2 jalapeño, finely chopped (I skipped this)", 
            "1/2 medium yellow onion, finely diced (and this)", 
            "1 pound skinned and flaked smoked whitefish", 
            "Salt and pepper, to taste", 
            "Saltine crackers to serve", 
            "1 tablespoons finely chopped chives, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/smoked-whitefish-dip-horseradish1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Photo", 
            "Recipes", 
            "Salad", 
            "Seafood", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2014/11/smoked-whitefish-dip-with-horseradish/", 
        "title": "smoked whitefish dip with horseradish", 
        "directions": [
            "Make the dressing by mixing mayonnaise, sour cream, horseradish, Worcestershire, mustard, paprika, zest and lemon juice, hot sauce (if using), cayenne (to taste), green onions, celery, jalapeño (if using) and onion in a medium bowl. Season with salt and pepper to taste.\nPlace skinned and flaked whitefish in a larger bowl. Add dressing to taste (we used about 3/4 of it total) and adjust seasonings with salt and pepper. Serve with crackers, garnished with chives.\n"
        ], 
        "date": "2014-11-03T11:53:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon unsalted butter", 
            "1 tablespoon olive oil", 
            "1 medium yellow onion, small dice", 
            "4 medium cloves garlic, thinly sliced", 
            "2 teaspoons ground cumin", 
            "1 (3-inch) cinnamon stick", 
            "Salt and freshly ground black pepper", 
            "1 pound butternut squash, large dice", 
            "3/4 pound red potatoes, large dice", 
            "2 cups low-sodium chicken or vegetable broth", 
            "2 cups cooked chickpeas, drained", 
            "1 (14-ounce) can diced tomatoes, with juices", 
            "Pinch saffron threads (optional)", 
            "1/2 preserved lemon, finely chopped", 
            "1 cup brined green olives (Aida recommended Cerignola)", 
            "Steamed couscous, for serving (directions here and elsewhere on the web)", 
            "Fresh cilantro leaves, roughly chopped, for garnish", 
            "Toasted slivered almonds, for garnish", 
            "Plain yogurt, for garnish", 
            "Hot sauce of your choice (for serving)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/squash-and-chickpea-moroccan-stew1.jpg?w=500", 
        "tags": [
            "Beans", 
            "North African", 
            "Photo", 
            "Stew", 
            "Vegan", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2009/01/squash-and-chickpea-moroccan-stew/", 
        "title": "squash and chickpea moroccan stew", 
        "directions": [
            "Heat butter and olive oil in a 3- to 4-quart Dutch oven or heavy-bottomed saucepan with a tight fitting lid over medium heat. When oil shimmers, add onion, garlic, cumin, and cinnamon, and season with salt and freshly ground black pepper. Cook, stirring occasionally, until spices are aromatic and onions are soft and translucent, about 5 minutes.", 
            "Add squash and potatoes, season with salt and freshly ground black pepper, stir to coat, and cook until just tender, about 3 minutes. Add broth, chickpeas, tomatoes and their juices, and saffron, if using. Bring mixture to a boil then reduce heat to low. Cover and simmer until squash is fork tender, about 10 minutes.", 
            "Remove from heat and stir in preserved lemon and olives. Serve over couscous garnished with cilantro, almonds, and yogurt. "
        ], 
        "date": "2009-01-07T13:39:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (12-ounce) 1-inch thick New York strip boneless beef top loin steak", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "Olive oil", 
            "2 yellow onions, sliced in rings", 
            "1/2 teaspoon fresh thyme leaves", 
            "Mustard Mayo, recipe follows", 
            "2 mini focaccia buns, sliced in 1/2 (we used a small ciabatta)", 
            "1/2 cup baby arugula", 
            "1/3 cup good mayonnaise", 
            "2 tablespoons Dijon mustard", 
            "1 tablespoon whole-grain mustard", 
            "2 tablespoons sour cream", 
            "1/8 teaspoon kosher salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/steak-sandwiches1.jpg?w=500", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Picnics", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2009/02/steak-sandwiches/", 
        "title": "steak sandwiches", 
        "directions": [
            "Whisk the ingredients together in a small bowl. Serve at room temperature."
        ], 
        "date": "2009-02-28T17:00:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            "1 medium onion, chopped small", 
            "1 to 2 peppers of your choice (see Notes, below), finely chopped", 
            "3 cloves garlic, minced", 
            "2 tablespoons chili powder", 
            "2 teaspoons ground cumin", 
            "1 teaspoon dried oregano", 
            "1 1/2 teaspoons table salt or 2 1/2 teaspoons kosher or coarse salt", 
            "1 12-ounce bottle beer", 
            "1 28-ounce can crushed tomatoes, fire-roasted if you can find them", 
            "1 1/2 cups mixed dried beans (see Note)", 
            "3 1/2 to 4 cups water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/three-bean-chili.jpg?w=750", 
        "tags": [
            "Beans", 
            "Photo", 
            "Slow Cooker", 
            "Stew", 
            "Tex-Mex", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/04/three-bean-chili/", 
        "title": "three-bean chili", 
        "directions": [
            "To serve: Lime wedges, sour cream, diced white onion, cilantro, corn or flour tortillas or tortilla chips or rice", 
            "Heat oil in the bottom of a medium-sized heavy pot or Dutch oven (if finishing it on the stove), in the pot of your pressure-cooker (if using one) or in a large skillet (if finishing in a slow-cooker). Once warm, add onion and cook for 5 minutes, until translucent. Add any fresh peppers and cook for 3 more minutes. Add garlic, chili powder, cumin, oregano and salt and cook for 2 minutes, until browned and deeply fragrant. Add beer and scrape up any bits stuck to the pot. Boil until reduced by half, or, if you’re nervous about alcohol content, until it has all but disappeared. ", 
            "If finishing on the stove: Add tomatoes, dried beans, any dried or rehydrated-and-pureed chiles and the smaller amount of water. Bring mixture to a full boil and boil for one minute, then reduce heat to a very low, gentle simmer, place a lid on your pot, and cook for 2 1/2 to 3 hours, until the beans are tender, stirring occasionally. Add the last 1/2 cup water if mixture seems to be getting dry, though I didn’t need it in most of my tested batches. If a slightly more sloshy chili wouldn’t bother you, you can add it from the get-go.", 
            "If finishing in a slow-cooker: Scrape onion, spice and beer mixture into a slow-cooker and add tomatoes, dried beans, any dried or rehydrated-and-pureed chiles and the smaller amount of water. Cook on HIGH for 6 to 7 hours, until beans are tender. You can add the last 1/2 cup water if needed, but probably will not find it necessary.", 
            "If finishing in a pressure-cooker: Follow the directions from your pressure cooker manufacturer. I failed to get this fully tested in my new one (boo) but estimate that it will take 20 to 22 minutes on high. ", 
            "Serve as-is or with fixings of your choice.", 
            "Notes:"
        ], 
        "date": "2014-04-02T12:13:23+00:00"
    }, 
    {
        "ingredient_list": [
            "4 1/2-inch thick slices your favorite sturdy bread*", 
            "4 tablespoons mayonnaise", 
            "Two to four 1/4-inch slices provolone cheese (use larger amount for smaller slices)", 
            "Olive oil2 medium-sized perfectly ripe tomatoes, sliced", 
            "Flaky salt and freshly cracked black pepper, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/07/tomato-and-fried-provolone-sandwich1.jpg?w=640", 
        "tags": [
            "Photo", 
            "Quick", 
            "Sandwich", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/07/tomato-and-fried-provolone-sandwich/", 
        "title": "tomato and fried provolone sandwich", 
        "directions": [
            "Spread each slice of bread with mayonnaise and set aside.", 
            "Heat a skillet, preferably nonstick, over medium-low heat. Add a thin layer of olive oil and let it heat until shimmering. Add first slice of provone to skillet and fry it until crusty and golden underneath. Using a very thin spatula (this “flexible fish spatula” style is my favorite, for everything) carefully flip slice. It’s probably not going to flip neatly and you’ll probably curse me and also Hess but a messy slice will taste no less delicious than a photogenic one, promise. Just do your best. Fry the slice on the other side until golden underneath, then lift this browned cheese mess out of the pan and onto your first prepared bread slice. Repeat with remaining slices of cheese, frying more than one at a time if you’re now more comfortable with the process. ", 
            "Arrange slices of tomatoes over fried provolone on bread, sprinkle with salt and pepper and eat with one hand while calming an irate newborn with the other (if you’re me) or with two hands, from a plate, sitting down with a napkin on your lap, you civilized thing (if you’re not me, clearly). ", 
            "* Forgive me if I sound like a broken record, but my favorite is the whole wheat sourdough (a.k.a. miche or pain de campagne; think: Poilâne, but not requiring a ticket to Paris) you see here and elsewhere on the site. If you live near a Le Pain Quotidien, they sell theirs in quarters from gigantic loaves. Balthazar also makes their own, which is wonderful, and also sells it in quarters, inexpensively. "
        ], 
        "date": "2015-07-29T11:11:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound very large (16 to 20 per pound) shrimp, peeled, de-veined, and rinsed, shells reserved", 
            "1 teaspoon salt", 
            "1 cup dry white wine", 
            "4 peppercorns", 
            "5 coriander seeds", 
            "1/2 bay leaf", 
            "5 sprigs fresh parsley", 
            "1 sprig fresh tarragon", 
            "1teaspoon juice from 1 small lemon", 
            "1 cup ketchup", 
            "2 1/2 teaspoons prepared horseradish (I believed we used slightly more)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "1 teaspoon ancho or other mild chili powder", 
            "Pinch cayenne pepper", 
            "1 tablespoon juice from 1 small lemon", 
            "3 tablespoons good olive oil", 
            "1 small French bread or boule, cut into 1-inch cubes (6 cups)", 
            "1 teaspoon kosher salt", 
            "2 large ripe tomatoes, cut into 1-inch cubes", 
            "1 hothouse cucumber, unpeeled, seeded, and sliced 1/2 inch thick", 
            "1 red bell pepper, seeded and cut into 1-inch cubes", 
            "1 yellow bell pepper, seeded and cut into 1-inch cubes", 
            "1/2 red onion, cut in half and thinly sliced", 
            "20 large basil leaves, coarsely chopped", 
            "3 tablespoons capers, drained", 
            "1 lemon", 
            "4 small\tartichokes", 
            "2/3 cup\theavy cream", 
            "1 teaspoon garlic, finely chopped (about 1 medium clove)", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon ground white pepper", 
            "2 tablespoons olive oil", 
            "6 medium Yukon Gold potatoes", 
            "4 ounces Asiago cheese, grated (I used cave-aged Gruyere, because it’s my favorite)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/when-the-stars-make-you-drool1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Artichokes", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Seafood", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2006/11/when-the-stars-make-you-drool/", 
        "title": "shrimp cocktail + artichoke-potato gratin", 
        "directions": [
            "1.\tBring reserved shells, 3 cups water and salt to boil in medium saucepan over medium-high head; reduced heat to low; cover, and simmer until fragrant, about 20 minutes. Strain stock through sieve, pressing on shells to extract all liquid.", 
            "2.\tBring stock and remaining ingredients except shrimp to boil in 3- or 4-quart saucepan over high heat; boil 2 minutes. Turn off heat and stir in shrimp; cover and let stand until firm and pink, 8 to 10 minutes. Drain shrimp, reserving stock for another use. Plunge shrimp into ice water to stop coking, then draining again. Serve shrimp chilled with cocktail sauce.", 
            "1. Heat the oil in a large saute pan. Add the bread and salt; cook over low to medium heat, tossing frequently, for 10 minutes, or until nicely browned. Add more oil as needed.", 
            "2. For the vinaigrette, whisk together the ingredients.", 
            "3. In a large bowl, mix the tomatoes, cucumber, red pepper, yellow pepper, red onion, basil, and capers. Add the bread cubes and toss with the vinaigrette. Season liberally with salt and pepper.", 
            "4. Serve immediately, or allow the salad to sit for about half an hour for the flavors to blend."
        ], 
        "date": "2006-11-06T17:25:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (about 2 large) zucchini or other summer squash, trimmed", 
            "1 1/4 teaspoons fine sea or table salt, plus more if needed", 
            "1 cup (3 ounces or 85 grams) coarsely grated gruyere cheese", 
            "3/4 cup (2 1/2 ounces or 70 grams) coarsely grated fontina or provolone cheese", 
            "1/4 cup (20 grams) finely grated parmesan or pecorino cheese", 
            "Freshly ground black pepper", 
            "8 thin slices bread of your choice, I used a country-style white bread", 
            "A couple tablespoons softened butter or olive oil for brushing bread"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/zucchini-grilled-cheese.jpg?w=750", 
        "tags": [
            "Picnics", 
            "Recipes", 
            "Sandwich", 
            "Summer Squash", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2017/06/zucchini-grilled-cheese/", 
        "title": "zucchini grilled cheese", 
        "directions": [
            "Prepare zucchini: Use a food processor with a grater attachment or the large holes of a box grater to grate the zucchini. In a large colander, toss together the zucchini and salt. Let stand for 20 to 30 minutes, until the zucchini has wilted and begun to release liquid. Drain the zucchini in a colander and then use your hands to squeeze out as much water as possible, a fistful at a time. Place wrung-out zucchini on paper towels to drain further.\nMake filling and assemble sandwiches: Mix zucchini with grated cheese, a lot of freshly ground black pepper, and more salt if needed.", 
            "Brush or spread the bread sides that will form the outsides of the sandwiches with olive oil or softened butter. Spread zucchini-cheese on insides and close the sandwiches.", 
            "Cook the sandwiches: Place sandwiches on a large griddle or frying pan over low-medium heat. I like to cook grilled cheese slowly to give the centers a chance to really melt before the outsides get too brown. When the undersides are a deep golden brown, flip the sandwiches and cook until the color underneath matches the lid. Cut sandwiches in half and dig in. Perhaps some pickled vegetable sandwich slaw on the side?"
        ], 
        "date": "2017-06-22T12:04:08+00:00"
    }
]