[
    {
        "ingredient_list": [
            "1/2 cup (80 grams) raisins", 
            "2 tablespoons (30 ml) dark rum", 
            "1 cup plus 3 tablespoons (150 grams) all-purpose flour, plus more for dusting", 
            "Pinch of salt", 
            "3 tablespoons (45 ml) sunflower, safflower or another neutral oil", 
            "1/3 cup (80 ml) water", 
            "2 pounds (905 grams) firm apples (about 5 to 6)", 
            "Juice of 1 lemon", 
            "1/3 cup (65 grams) granulated sugar or vanilla sugar (see note above)", 
            "1/2 teaspoon ground cinnamon (optional)", 
            "8 tablespoons (115 grams) unsalted butter, divided", 
            "3/4 cup (40 grams) plain, unseasoned dried breadcrumbs (I used, and recommend, panko, see note above)", 
            "1 tablespoon granulated sugar or vanilla sugar", 
            "1/8 teaspoon salt", 
            "Confectioners’ sugar, for dusting", 
            "Lightly sweetened whipped cream or vanilla ice cream, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/apple-strudel-apfelstrudel.jpg?w=750", 
        "tags": [
            "Apple", 
            "Austrian", 
            "Cake", 
            "Fall", 
            "German", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/11/apple-strudel/", 
        "title": "apple strudel", 
        "directions": [
            "Prepare the raisins: The day before, combine the raisins and the rum in a small bowl and cover; set aside for 24 hours. However, should you be reading this and want to make it right now, I found microwaving the two together for 10 to 15 seconds and setting them aside until you’re ready to mix the filling allowed them to absorb almost as well.\nMake the dough: The day of, combine the flour and salt in a medium bowl. Add the oil and water and mix with a spoon or your index finger until a rough dough forms. Turn it out onto a very lightly floured counter and knead for 10 minutes. It sounds like it will be forever, but set a timer and chat with a friend, it goes quickly. After 10 minutes, the dough should be soft and silky to the tough. Form it into a ball, place it on the counter and upend the mixing bowl over it. Set aside for 30 minutes.\nMeanwhile, prepare the apples: Peel, halve, core and slice thin in one direction, then halve the slices crosswise, creating thin squarish rectangles of apples. Place them in a large bowl and toss with lemon juice, sugar and cinnamon, if using. Add the raisins and any rum left in the bowl.\nPrepare the breadcrumbs: In a small skillet over medium-low heat, melt 3 tablespoons butter and add the breadcrumbs, sugar and salt. Stir to coat and cook, stirring frequently as they can burn quickly, until crumbs are an even golden brown and very fragrant. Don’t let them burn. Scrape into a dish (or they’ll keep cooking in the pan) and set aside.\nHeat your oven to 400 degrees F (200 degrees C). Line 1 large or 2 smaller baking sheets with parchment paper.\nMelt the remaining 5 tablespoons butter in a small dish.\nRoll out your dough (these directions are for a full-sized strudel): Cover your work surface with a cleaning linen towel or sheet that’s at least 24-by-32 inches. The long side should be horizontal. Sprinkle the cloth lightly with flour. Place the dough in the middle, sprinkle it very lightly with flour and roll in both directions until it’s about 10-by-13 inches, or about as far as the rolling pin can take it. Make sure the dough hasn’t stuck to the cloth; reflour if it has. Now the stretching begins! Ball your hands to loose fists, put them under the rolled-out dough and gently start stretching the dough using the back of your hands. Alternate with pulling the dough gently with your fingers to continue stretching it, stretching the edges thin too. This is all much easier than it sounds, but be patient. If holes form, pinch the dough back together. Continue stretching until the dough is about 16-by-24 inches.", 
            "Assemble strudel: Brush evenly with about half the melted butter. On the right side of the rectangle, a few inches from the end, spread the breadcrumbs top to bottom in a thick line, leaving a little more than an inch margin at the top and bottom of the strip. Scoop the apples with a slotted spoon, leaving any accumulated juices in the bowl, and pile them over the crumbs. Gently pull the top and bottom edges of the dough over the apple mixture. Pull the right edge of the dough up and over the filling as far as it will go without tearing. Working carefully, use the towel to roll up the strudel all the way. Place the parchment paper from your baking sheet at the edge of the roll and roll the strudel onto it. Ideally, it should be breadcrumb side-down on the parchment, you can roll it again if it’s not. Use the parchment like a sling to gently place the strudel on the baking sheet.\nBrush the strudel generously all over with some of the remaining butter. Bake for 15 minutes, then brush again and return to the oven in a rotated position. Repeat this once, baking a total of 45 minutes. (Half-size strudels seem to bake 5 or so minutes faster.) The finished strudel should be crisp to the touch and a deep golden brown.", 
            "Remove the baking sheet from the oven and let cool on a rack for at least 20 minutes before serving. Dust with confectioners’ sugar and slice into pieces to serve.", 
            "Strudel is best the day it is made, but it keeps for 1 to 2 days at room temperature. I’ve also read that you can freeze it (am trying this as we speak, will give more notes once it defrosts). Before serving, you can crisp up leftover strudel in a 350 degree F (180 degree C) oven."
        ], 
        "date": "2016-11-04T12:07:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (455 grams) loaf white sandwich or pullman bread or 14 to 16 slices, stale is fine", 
            "3 tablespoons (45 grams) unsalted butter, softened or melted, plus a smidge to butter the pan", 
            "1 cup (170 grams) fresh blueberries", 
            "6 tablespoons (75 grams) granulated sugar", 
            "Zest of 1/2 lemon", 
            "2 teaspoons (10 ml) vanilla extract", 
            "6 large eggs", 
            "3 cups (710 ml) whole milk", 
            "1/4 teaspoon fine sea or table salt", 
            "Powdered sugar, golden or maple syrup to finish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/07/img_4275.jpg?w=750", 
        "tags": [
            "Blueberries", 
            "Breakfast", 
            "British", 
            "Brunch", 
            "Photo", 
            "Recipes"
        ], 
        "url": "https://smittenkitchen.com/2016/07/blueberry-bread-and-butter-pudding/", 
        "title": "blueberry bread and butter pudding", 
        "directions": [
            "Dab bread slices with 3 tablespoons melted butter. If your bread is already stale, no need to pre-toast/dry it out. If it’s fresh, heat oven to 350 degrees. Spread slices on two trays and bake for 5 to 10 minutes, until firm to the touch but not yet browned. If desired, you can cut the slices on the diagonal now too. (I find this easier once the bread is firm.)", 
            "Lightly butter a 9×13-inch or other 3-quart casserole dish. Fan bread slices out in pan. Scatter blueberries over and be sure to tuck some between slices so that they can burrow and collapse. Place sugar and lemon zest in the bottom of a small dish and use your fingertips to rub the zest into the sugar, so it breaks up a bit and also releases the most flavor. Sprinkle half of lemon sugar over bread and blueberries. Whisk eggs in a large bowl and slowly whisk in milk. Stir in vanilla and salt. Pour custard slowly and evenly over bread, berries and sugar. Sprinkle with remaining lemon sugar.", 
            "Let mixture soak for 15 minutes at room temperature or overnight in the fridge. When you’re ready to bake it, heat oven (or increase temperature) to 375 degrees. Bake pudding until a knife inserted into the center of the casserole and turned slightly causes no liquid custard to spill into the crack, approximately 30 to 40 minutes. This can vary by the density of your bread; it can sometimes take up to 45 minutes.", 
            "Let cool slightly before cutting into squares. Dust with powdered sugar or serve with a syrup on the side, if desired."
        ], 
        "date": "2016-07-29T11:58:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium head (about 2 to 2 1/4 pounds) cauliflower", 
            "4 tablespoons (55 grams or 2 ounces) unsalted butter", 
            "4 tablespoons (30 grams or 1 ounce) all-purpose flour", 
            "2 teaspoons mustard powder", 
            "Salt, to taste", 
            "Freshly ground black pepper or ground cayenne", 
            "2 cups (475 ml) milk, whole is best but low-fat will probably work just fine", 
            "1 1/4 cups plus 2 tablespoons (about 155 grams or 5 1/2 ounces total) grated cheddar, the strongest you can get, preferably English or Irish", 
            "Chopped chives or flat-leaf parsley, for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-cheese1.jpg?w=640", 
        "tags": [
            "British", 
            "Cauliflower", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/10/cauliflower-cheese/", 
        "title": "cauliflower cheese", 
        "directions": [
            "Heat oven to 400 degrees.", 
            "Trim cauliflower and remove tough core. Cut into 1 to 2-inch florets. Steam (for about 10 minutes) or par-boil (6 to 7 minutes) florets until firm but tender. Drain, if needed, and spread florets on a towel so that it can wick out as much moisture as possible", 
            "Meanwhile, in a medium saucepan, melt butter over medium-high heat. Add flour and whisk to combine; cook for 1 minute to ensure you get rid of the floury taste. Add mustard powder and a pinch of cayenne or few grinds of black pepper, and stir to combine. Drizzle in milk in a thin, steady stream, whisking the whole time so that no lumps form. Season with salt and bring mixture to a simmer, stirring with a spoon; mixture should thicken. Stir in 1 1/4 cups cheddar, a handful at a time, letting each handful melt before adding the next. Taste sauce and adjust seasonings if needed.", 
            "Spread cauliflower florets in a 2-quart baking ovenproof baking dish. Spoon sauce over florets and sprinkle with remaining 2 tablespoons cheese. Bake until until bronzed and bubbly, about 30 minutes. For reference, f I wasn’t in such a rush to get dinner out on the table, I’d have baked mine a minute or two longer, up to 35 minutes.", 
            "Sprinkle with herbs, if desired. Eat with abandon.", 
            "P.S. A hat tip to Kate, who reminded me earlier this week that this site is way overdue for cauliflower cheese, and immediately solving my what-to-make-for-dinner crisis du jour."
        ], 
        "date": "2014-10-23T12:03:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup sweetened condensed milk", 
            "1/2 cup unsweetened coconut milk", 
            "2 tablespoons salted or unsalted butter (salted will give the candy more contrast)", 
            "2 teaspoons light corn syrup", 
            "1/3 cup finely shredded unsweetened coconut (I lightly toasted mine, for crunch)", 
            "1/3 cup ground pistachios (see Note below)", 
            "1/3 cup chocolate sprinkles or “vermicelli” (see Note below)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/coconut-milk-fudge1.jpg?w=500", 
        "tags": [
            "Brazilian", 
            "Candy", 
            "Coconut", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/03/coconut-milk-fudge/", 
        "title": "coconut milk fudge", 
        "directions": [
            "In a medium-size heavy saucepan, combine condensed milk, coconut milk, butter and corn syrup. Bring to a boil over medium heat. Reduce heat to low and whisk constantly until fudgy. The recipe notes that when mixture is ready, it will pull together into one soft piece, leaving browned residue on bottom of pan and that this should take 8 to 10 minutes. This took me 20 to 25 minutes, and the candy began taking on a beige, caramelized color.", 
            "Slide mixture into a bowl. (Don’t scrape the pan; leave any residue behind.) Let cool to room temperature, then refrigerate until very firm, at least 4 hours. Or, you could realize that the nanny has to leave in an hour, chill it for only 30 and discover that nothing bad will happen if you don’t wait the whole cooling time. You’ll have to be more careful if you use “real” i.e. meltable chocolate sprinkles but otherwise it will have no ill-effect to speed the process up.) ", 
            "Scoop out teaspoonfuls of the mixture (I used my one teaspoon measure) and use your hands to roll into balls, about 3/4-inch in diameter. I found having just a drop or two of water in my palms — not wet, just a little moist — helped form them. Set aside on a baking sheet.", 
            "Place toppings in wide bowls and roll brigadeiros through them, covering the surface completely.  Store in an airtight container at room temperature for 2 days, or refrigerate for up to 1 month. Serve at room temperature.", 
            "Chocolate “vermicelli”: I got a little freaked out when I saw the ingredient list on the chocolate sprinkles I had brought home from the store. Look, I don’t need to pretend that chocolate sprinkles are health food, but I like to imagine I’m eating something with at least a minute smidgen of chocolate in it. I ended up spending way too much on a bottle of “chocolate vermicelli” (they look like chocolate sprinkles but are almost 100% pure chocolate, and delightfully, taste that way too) but I’d buy them next time from Amazon or King Arthur Flour’s Baker’s Catalog for much less.", 
            "Pistachios: Since toasted nuts always, always taste better than raw ones, I toasted and ground a batch to coat the candy only to find the brown/green shade… um, a little unpretty. Looks won out and I used ground raw pistachios in the end. I actually ended up preferring the softness of the coating.", 
            "Those tiny cups: I know someone is going to ask me where I bought those colorful little candy cups and I’m sorry, as my answer could not be more inconvenient: Vienna. A grocery store. I’m kind of obsessed with going to grocery stores in foreign countries and always walk out with random stuff like this. Anyway, Amazon sells #4 size cups (1-inch base) in brown and white; however, mine are actually #3 size (3/4 to 7/8-inch base) which I found online at a smaller store."
        ], 
        "date": "2010-03-08T13:02:22+00:00"
    }, 
    {
        "ingredient_list": [
            "Base and lattice", 
            "4 1/2 cups (1 pound or 455 grams) shelled walnuts", 
            "3 cups (375 grams) all-purpose flour", 
            "2 teaspoons ground cinnamon", 
            "1/2 teaspoon ground cloves (I halved this, using only 1/4 teaspoon)", 
            "1/4 to 1/2 teaspoon table salt (Heatter says 1/4, I really prefer this with 1/2)", 
            "2 1/2 sticks (10 ounces or 285 grams) cold, unsalted butter, cut into chunks", 
            "1 2/3 cup (330 grams) granulated sugar", 
            "1 egg plus 1 egg yolk", 
            "Finely grated zest of 1 lemon", 
            "Filling", 
            "1/4 cup (about 20 to 25 grams) fine, dry breadcrumbs", 
            "2 cups (about 575 grams) seedless raspberry jam", 
            "To finish", 
            "1 egg yolk", 
            "1 teaspoon water", 
            "2/3 to 1 cup (75 to 115 grams) to slivered almonds (julienne-shaped pieces) (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/linzer-torte1.jpg?w=640", 
        "tags": [
            "Austrian", 
            "Christmas", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/12/linzer-torte/", 
        "title": "linzer torte", 
        "directions": [
            "Make base: Heat oven to 400 degrees. Butter two 9-inch round layer cake pans (preferably with removable bottoms if you plan to serve this in wedges, like a cake), two 8-inch square pans (what I used, then cut each into square bars, like cookies), one 9×13-inch rectangular pan (again, for bar cookies) or one 11- to 12-inch round cake pan (again ideally with a removable bottom). Line the bottom of each with a piece of parchment paper cut to fit, then butter then paper. ", 
            "In a food processor, process walnuts and 1/2 cup of the flour (reserve remaining 2 1/2 cups for next step) for 15 seconds, or until the nuts are finely ground but have not formed a paste. ", 
            "Place remaining 2 1/2 cups flour, cinnamon, cloves and salt in a large, wide-ish mixing bowl. With a pastry blender, work the butter into the dry mixture until it forms coarse crumbs. Stir in the sugar and walnut-flour mixture. In a small dish, beat the whole egg, yolk, and lemon rind utnil combined, and stir into crumb mixture. Stir the mixture in as best as you can with a spoon, then work the rest in with your hands. Knead the dough a few times inside the bowl until a cohesive mass, one that holds together, forms. ", 
            "Divide dough into quarters if making two tortes, or halves if making one.", 
            "Place one portion into the bottom of each pan, and press evenly and firmly over the bottoms and then about 1 1/4 to 1 1/2 inches up the sides with your fingers. Don’t worry about making it smooth or level on the sides; it gets filled in later.", 
            "Bake shell(s) for 15 minutes, or until it barely begins to color at the edges.", 
            "While the shell(s) bakes, roll remaining piece(s) of dough between two pieces of waxed paper, until 1/4- to 3/8-inch in thickness one inch bigger than your pan size. [I.e., for each 9-inch round torte, you’ll want a 10-inch diameter circle; for each 8-inch square torte, a 9-inch square, etc.] Transfer to freezer until the dough is well-chilled, about 20 minutes.", 
            "Remove shell(s) from oven and let cool slightly; reduce baking temperature to 350 degrees. ", 
            "Make filling: If you’re using panko or another coarse dry breadcrumb, you can pulse it in a food processor until it is fine powder. I found I needed almost double the volume in panko (7 tablespoons) to yield 1/4 cup of a fine breadcrumb powder.", 
            "Sprinkle 2 tablespoons finely ground breadcrumbs over each par-baked shell, or all 1/4 cup over your single large one. If jam is not already soft, stir it until it is, then spread 1 cup over each shell. Cut dough(s) into 1/2- to 3/4-inch wide strips, cutting through the bottom of the waxed paper at the same time. Lift each strip-and-waxed paper over the jam and reverse it onto the jam, then peel off waxed paper. Cut the ends of the dough by pressing them onto the sides of the pan. Arrange strips 1/2- to 3/4-inch apart, crisscrossing them on an angle to make a lattice top with diamond-shaped openings. [Note: I neither “wove” my lattice or ended up making “diamond-shaped” openings. Oops.] Use leftover pieces to fill in any gaps between lattice-strips and tall sides of shells. The two doughs will blend together in the oven. ", 
            "To finish: Mix egg yolks and water. Brush it all over lattice top and border. Sprinkle with almonds, if using. (I prefer to use 1/3 cup per smaller torte, instead of the 1/2 cup Heatter recommends. I only sprinkled them on one.) Bake torte(s) for 45 to 60 minutes (Heatter recommends 60, I find it perfect, but ovens and baking pans vary, check yours sooner if you’re nervous), until crust and almonds on top are well-browned. ", 
            "Remove from oven and place on racks. If you’ve baked it in a cake pan and wish to serve it as a “cake,” i.e. in wedges, Heatter recommends that you remove it from the pan while still warm by cutting around the torte carefully (the crust is very fragile) with a small, sharp knife and loosening the torte in the pan, before reversing it onto a cooling rack, and then back again onto another rack to finish cooling. If using a pan with a removable base, you should safely be able to remove it once it has fully cooled. Personally, I had no trouble letting my cool fully in the square pan but the first square did not come out cleanly. ", 
            "Once fully cool, Heatter recommends you let the tortes stand overnight (covered with foil) before serving for best flavor. You can decorate the tortes with powdered sugar before serving in wedges or squares. "
        ], 
        "date": "2013-12-13T12:34:39+00:00"
    }
]