{
  "date": "2015-01-08T11:58:44+00:00",
  "directions": [
    "In a medium saucepan over medium heat, melt the butter. Add the brown sugar and reduce heat to medium-low. Let it heat and bubble for 1 to 2 minutes, stirring frequently. Don’t let it smoke or burn, which brown sugar is always very eager to do. Reduce heat to low. Add salt and cornstarch, stirring until combined — it’s going to look like a thick paste. Switch to a whisk and add the milk in a thin drizzle, whisking the whole time, so that no lumps form. Once all of the milk is added, you can switch back to a spoon. Cook over low to medium-low, stirring frequently, until the mixture comes to a gentle simmer. Let it simmer for a full minute, stirring, it should clearly thicken at this stage, although it will finish thickening in the fridge. Off the heat, stir in the vanilla extract. Divide into glasses or pudding cups and let chill in fridge for 1 to 2 hours, until set. ",
    "Those decorations on top: A dollop of whipped cream and chocolate crunchy pearls. I highly recommend the dark chocolate ones (you can get them from Callebaut, Valrhona and a few other brands); they’re so much more delicious and fun to eat than chocolate sprinkles. I highly recommend that whatever you do, you never try the beige ones, which are made from Valrhona’s Dulcey Chocolate, their in-house take on salted, caramelized white chocolate. I regret ever discovering it. Trust me, the safest thing is to never find out how good it is. ",
    "Variation: Coconut Butterscotch Pudding: Okay, I realize that making butterscotch without butter is of questionable logic. But, I did it anyway, using coconut oil instead of butter, and canned full-fat (and well-shaken) coconut milk for the milk above, yielded a totally dairy-free pudding. The result is something distinctly delicious, a little darker and more translucent in color than the dairy version, with a nuttier butterscotch flavor. Don’t skimp on the salt here."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/old-school-butterscotch-pudding1.jpg?w=750",
  "ingredient_list": [
    "2 tablespoons (30 grams) unsalted butter",
    "1/2 cup (95 grams) dark brown sugar",
    "Several pinches of sea salt (I use a scant 1/2 teaspoon of flaky Maldon salt)",
    "1/4 cup (30 grams) cornstarch",
    "3 cups (710 ml) whole milk",
    "2 teaspoons (10 ml) vanilla extract"
  ],
  "tags": [
    "Photo",
    "Pudding"
  ],
  "title": "butterscotch pudding",
  "url": "https://smittenkitchen.com/2015/01/butterscotch-pudding/"
}