[
    {
        "ingredient_list": [
            "1 cup long-grain white rice", 
            "2 cinnamon sticks (I had very large canela sticks — see bottom for more info — so I only used one)", 
            "2 strips of lemon or orange zest (can use a peeler to get a larger piece)", 
            "3 whole cloves or a tiny pinch of ground cloves", 
            "4 cups water", 
            "1 egg", 
            "3 cups whole milk (updated to note that many people, including my  mother, successfully made this with lower fat milks)", 
            "1 (12-ounce) can sweetened condensed milk (I realized after the fact that my can had been 14 ounces, had no averse effect)", 
            "1/4 teaspoon salt", 
            "1 tablespoon vanilla", 
            "1/2 cup raisins (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/02/arroz-con-leche.jpg?w=751", 
        "tags": [
            "Coconut", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2010/02/arroz-con-leche-rice-pudding/", 
        "title": "arroz con leche (rice pudding)", 
        "directions": [
            "Soak the rice, cinnamon sticks, lemon or orange zest and whole or powdered cloves in the water in a heavy saucepan for 1 hour.", 
            "After soaking, bring the rice mixture to a boil on high heat, uncovered. When it starts to boil (about 5 minutes), lower the heat to medium and cook for 10 to 12 more minutes or until water is almost evaporated.", 
            "While rice is cooking, beat the egg in a bowl. Add the milk and stir well to mix. Add the egg mixture, condensed milk, salt, vanilla extract and raisins, if using, to the rice and cook over medium-low heat, stirring carefully, until it thickens slightly or until desired consistency about 25 to 35 minutes (see notes that follow).", 
            "(About cooking time: Many reviewers said 25 to 35 minutes was way too much cooking time for them, and that 15 to 20 minutes would have been better. I was all ready to pull my pot off early, but actually needed almost 30 minutes. Still, want to give you a heads up that yours might be done sooner.)", 
            "(About “desired consistency”: I cooked mine until all but 10 percent of the liquid had been absorbed, which yielded a creamy, not-too-thick pudding. If you like your arroz con leche thinner, pull it off the stove when more liquid is left. This pudding does most of its thickening as it cools, but the end result should still be thinner than traditional rice pudding.)", 
            "Remove citrus zest and cinnamon sticks. Let cool uncovered, then chill the rest of the way in the fridge.", 
            "Mexican cinnamon: A long time ago, I bought a jar of canela (Mexican \"soft cinnamon\") sticks from Rancho Gordo and this was the perfect time to bust it out. The cinnamon flavor is just a little different than we’re used to, a little less loud and one note, a little dynamic. It smells exactly like a cross between a cinnamon stick and apple cider. Seriously! When simmered with the pudding for almost an hour, the pudding had an almost spicy edge to it and an unmistakable flavor I associate only with arroz con leche."
        ], 
        "date": "2010-02-24T20:05:57+00:00"
    }, 
    {
        "ingredient_list": [
            "Pudding", 
            "1 3/4 cups (from a 15-ounce can, 415 grams) pumpkin puree (unsweetened; not pumpkin pie filling)", 
            "1/2 cup (100 grams) granulated sugar", 
            "1 teaspoon (2 grams) ground cinnamon", 
            "1/2 teaspoon (3 grams) table salt", 
            "1/2 teaspoon ground ginger", 
            "1/4 teaspoon ground cloves", 
            "1 cup (237 ml) whole milk", 
            "1/2 cup (118 ml) heavy cream", 
            "2 large eggs, lightly beaten", 
            "Topping", 
            "1 cup (227 grams) sour cream", 
            "1 tablespoon (13 grams) granulated sugar", 
            "1/4 teaspoon (1 ml) vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/11/baked-pumpkin-puddings-with-sour-cream.jpg?w=750", 
        "tags": [
            "Fall", 
            "Gluten-Free", 
            "Photo", 
            "Pudding", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2011/11/baked-pumpkin-and-sour-cream-puddings/", 
        "title": "baked pumpkin and sour cream puddings", 
        "directions": [
            "Preheat oven to 350°F.", 
            "The quickest method: In a medium bowl, whisk together all of the pudding ingredients.", 
            "For creamier, silkier pudding: Combine pumpkin, sugar, salt and spices in a food processor and blend for 30 seconds. Transfer to a saucepan and heat over medium-high. Once glurping and simmering in the pot, cook for another 5 minutes, stirring frequently. The mixture will thicken and get a bit darker. Reduce heat slightly and whisk in milk and cream. Off the heat, slowly whisk in eggs.", 
            "Both methods: Divide between 7 to 8 (I had just shy of enough to make eight 1/2-cup puddings) ovenproof 6-ounce pudding cups or ramekins on a baking sheet. Bake for 35 to 40 minutes, until puddings barely jiggle when shimmied and/or a knife tip inserted into the center of puddings comes out clean. Try not to overbake.", 
            "While they bake, combine topping ingredients in a small bowl. When the puddings are cooked through, transfer to a cooling rack on the counter and leave oven on. Spoon 2 tablespoons of sour cream mixture onto first pudding and use a small offset spatula, butter knife or spoon to quickly (it will get melty fast) spread it over the top of the first pudding. Repeat with remaining puddings.", 
            "Return puddings to oven for 5 more minutes, then cool completely at room temperature, about 1 to 2 hours. Chill until ready to serve. Eat with a gingersnap."
        ], 
        "date": "2011-11-16T11:27:48+00:00"
    }, 
    {
        "ingredient_list": [
            "Custard", 
            "3⁄4 cup (150 grams) granulated sugar", 
            "1⁄4 cup (35 grams) cornstarch", 
            "1/4 teaspoon fine salt", 
            "6 large egg yolks", 
            "3 1⁄2 cups (830 ml) milk, preferably whole", 
            "2 tablespoons (30 grams) butter, cut into a few bits", 
            "1 tablespoon (15 ml) vanilla", 
            "1 tablespoon (15 ml) dark rum (optional, but think it has an amazing impact here)", 
            "Wafers", 
            "1 cup (200 grams) granulated sugar", 
            "Seeds from 1/2 of a fresh vanilla bean", 
            "1/2 cup (115 grams) unsalted butter, softened", 
            "1 large egg", 
            "1 tablespoon (15 ml) vanilla extract", 
            "3/4 teaspoon baking powder", 
            "1/4 teaspoon fine sea salt", 
            "1 1/3 cups (176 grams) all-purpose flour", 
            "Assembly", 
            "1/2 cup heavy cream", 
            "2 teaspoons granulated sugar", 
            "4 large firm-ripe bananas, thinly slices"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/banana-puddings-with-vanilla-bean-wafers1.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Cookie", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2016/01/banana-pudding-with-vanilla-bean-wafers/", 
        "title": "banana puddings with vanilla bean wafers", 
        "directions": [
            "Make the custard: Whisk sugar, cornstarch, salt and yolks together in the bottom of a large saucepan, ideally 4-quarts to protect against splattering as it simmers. Drizzle in milk, whisking the whole time so that no lumps form. Place over medium heat on the stove and bring up to a simmer, stirring. Once simmering, stirring, until custard thickens, 4 to 7 minutes. Remove from heat; whisk in butter, vanilla, and rum. Let chill in fridge for several hours or overnight to finish thickening. You’ll have 4 cups custard.", 
            "Make the wafers: Heat oven to 350°F. In the bottom of a large bowl, combine sugar and vanilla been seeds, rubbing them together so that the abrasion from the sugar granules helps release the maximum vanilla flavor. Add the butter and beat with an electric mixer until light and fluffy. Add egg and vanilla, beat to combine. Sprinkle baking powder and salt over batter, beat to combine. Add flour and once again, beat just to combine.", 
            "Line two large baking sheets with parchment paper or nonstick baking mats. Using your tiniest scoop (yes, I actually have one that holds about 1 teaspoon), spoon or even a 1-teaspoon measuring spoon, scoop the dough (you can then roll it in your palms for a more perfect final round shape) and space at least 2 inches apart on prepared sheets. Bake 10 to 11 minutes, keeping a close eye on them. You’ll want them to be nicely golden at the edges before you take them out. Let cool on racks. Yield: About 80 1 3/4-inch cookies.", 
            "Assembly: Beat heavy cream with 2 teaspoons sugar until soft peaks form. Line the bottom of 8 1-cup dishes with a wafer cookie. Add custard (you’re looking to use about 1/3 of it total right now). Top with a layer of bananas. Repeat twice with more cookies (you can break them up to get them to fit better in small cups), custard and bananas. Dollop each pudding with whipped cream; chill (I prefer to do so with lids on so the whipped cream doesn’t dry out) for a few hours and up to a few days.", 
            "Jars Are Weck Tulip Jelly Jars (which I’d bought to keep baby food organized then, predictably, co-opted). I urge everyone to buy “keep fresh covers” for Weck jars. Clamps are adorable and photogenic but definitely annoying in the long run. I order them from Weck directly and save the gaskets and clamps for future canning projects."
        ], 
        "date": "2016-01-28T12:00:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (30 grams) cornstarch", 
            "1/2 cup (100 grams) sugar", 
            "1/8 teaspoon salt", 
            "3 cups (710 ml) whole milk", 
            "6 ounces (170 grams) semi- or bittersweet chocolate, coarsely chopped (or 1 cup good chocolate chips)", 
            "1 teaspoon (5 ml) pure vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/best-chocolate-pudding11.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2008/02/best-chocolate-pudding/", 
        "title": "best chocolate pudding", 
        "directions": [
            "Combine the cornstarch, sugar and salt in a medium saucepan, Slowly whisk in the milk, in a thin steam at first so that lumps don’t form, then more quickly once the cornstarch mixture is smoothly incorporated. Place over medium-low heat and stir occasionally, scraping the bottom and sides. Use a whisk as necessary should lumps begin to form. After 10 minutes or so (slower over lower heat is better, to give the cornstarch time to cook), before it starts to simmer, the mixture should begin to thicken, enough that it will coat the back of a spoon. Add the chocolate, and continue stirring for another 2 to 4 minutes, until chocolate is fully incorporated and mixture is quite thick. Remove from heat and stir in the vanilla.", 
            "If you’re concerned about lumps: Run mixture through a fine-mesh strainer.", 
            "Distribute among individual pudding cups or one large serving bowl, and chill until it is cool and set, about 2 to 3 hours.", 
            "If you dislike pudding skin: Put plastic on top of the pudding and smooth it gently against the surface before refrigerating. ", 
            "Do ahead: Pudding is good for 3 days in the fridge but nobody I know would allow it to last that long."
        ], 
        "date": "2008-02-13T14:37:18+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons (30 grams) unsalted butter", 
            "1/2 cup (95 grams) dark brown sugar", 
            "Several pinches of sea salt (I use a scant 1/2 teaspoon of flaky Maldon salt)", 
            "1/4 cup (30 grams) cornstarch", 
            "3 cups (710 ml) whole milk", 
            "2 teaspoons (10 ml) vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/old-school-butterscotch-pudding1.jpg?w=750", 
        "tags": [
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2015/01/butterscotch-pudding/", 
        "title": "butterscotch pudding", 
        "directions": [
            "In a medium saucepan over medium heat, melt the butter. Add the brown sugar and reduce heat to medium-low. Let it heat and bubble for 1 to 2 minutes, stirring frequently. Don’t let it smoke or burn, which brown sugar is always very eager to do. Reduce heat to low. Add salt and cornstarch, stirring until combined — it’s going to look like a thick paste. Switch to a whisk and add the milk in a thin drizzle, whisking the whole time, so that no lumps form. Once all of the milk is added, you can switch back to a spoon. Cook over low to medium-low, stirring frequently, until the mixture comes to a gentle simmer. Let it simmer for a full minute, stirring, it should clearly thicken at this stage, although it will finish thickening in the fridge. Off the heat, stir in the vanilla extract. Divide into glasses or pudding cups and let chill in fridge for 1 to 2 hours, until set. ", 
            "Those decorations on top: A dollop of whipped cream and chocolate crunchy pearls. I highly recommend the dark chocolate ones (you can get them from Callebaut, Valrhona and a few other brands); they’re so much more delicious and fun to eat than chocolate sprinkles. I highly recommend that whatever you do, you never try the beige ones, which are made from Valrhona’s Dulcey Chocolate, their in-house take on salted, caramelized white chocolate. I regret ever discovering it. Trust me, the safest thing is to never find out how good it is. ", 
            "Variation: Coconut Butterscotch Pudding: Okay, I realize that making butterscotch without butter is of questionable logic. But, I did it anyway, using coconut oil instead of butter, and canned full-fat (and well-shaken) coconut milk for the milk above, yielded a totally dairy-free pudding. The result is something distinctly delicious, a little darker and more translucent in color than the dairy version, with a nuttier butterscotch flavor. Don’t skimp on the salt here."
        ], 
        "date": "2015-01-08T11:58:44+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups milk, whole or 2% (no, I haven’t tried skim, if you do, let us know how it goes)", 
            "6 tablespoons cornstarch", 
            "2 teaspoons pure vanilla extract", 
            "1/4 teaspoon salt", 
            "1 cup sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/caramel-pudding1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2010/01/caramel-pudding/", 
        "title": "caramel pudding", 
        "directions": [
            "In a small bowl, whisk 1/2 cup of the milk with the cornstarch, vanilla and salt until smooth. Set aside. In a large saucepan, combine the sugar with 6 tablespoons of water and bring to a boil. Cook over moderately high heat, undisturbed, until a deep amber caramel forms, about 8 minutes. Be patient but watch the stove like a hawk as caramel changes color quickly, and only burns when you think you are safe leave the room for a second. Remove from the heat. Very gradually whisk in the remaining 3 1/2 cups of milk. (This is another great place for your whisk for the corners.) As you begin whisking it in, the caramel will get very dark, and likely make you nervous that you’ve burnt it. Fear not; that there is your flavor base.", 
            "Return the pot to the stove and whisk over moderate heat until the caramel has dissolved again. Once again, watch this closely as the milk will foam up quickly as it comes to a simmer. Simmer over moderately low heat until the mixture thickens slightly and deepens in color, about 10 minutes.", 
            "Gradually whisk the cornstarch mixture into the caramel. Cook again over moderate heat, stirring, until the pudding thickens, about one minute. If you’re not lazy like me, strain the pudding fine strainer set over a large measuring cup; if you are, you can skip this and nothing terrible will happen. Scrape the pudding into eight 1/2-cup ramekins and refrigerate until chilled and set, about 2 hours.", 
            "To avoid a pudding skin if you, like everyone in the world but me, are pudding skin-averse: Press a piece of plastic wrap onto the surface of each pudding dish as it chills."
        ], 
        "date": "2010-01-04T23:52:01+00:00"
    }, 
    {
        "ingredient_list": [
            "Pudding filling:", 
            "1/4 cup cornstarch", 
            "1/3 cup plus 2 tablespoons sugar, divided", 
            "3 tablespoons unsweetened cocoa powder", 
            "1/4 teaspoon salt", 
            "3 cups whole milk", 
            "4 ounces bittersweet chocolate (not more than 60% cacao), finely chopped", 
            "1 teaspoon pure vanilla extract", 
            "1 cup chilled heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/09/chocolate-pudding-pie.jpg?w=753", 
        "tags": [
            "Chocolate", 
            "Photo", 
            "Pudding", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/09/chocolate-pudding-pie/", 
        "title": "chocolate pudding pie", 
        "directions": [
            "Bittersweet chocolate shavings for garnish (optional)", 
            "Prepare pie dough: Roll out dough on a lightly floured surface with a lightly floured rolling pin into an 11-inch round, then fit into a 9-inch pie plate. Trim edge, leaving a 1/2-inch overhang, then fold overhang under and crimp edge decoratively. Prick bottom and side of shell all over with a fork, then chill shell 30 minutes. While shell chills, preheat oven to 375°F with a baking sheet on middle rack. Line shell with foil and fill with pie weights*.", 
            "Bake on baking sheet until pastry is set and edge is pale golden, about 25 minutes. Carefully remove weights and foil, then bake shell on baking sheet until pale golden all over, 15 to 20 minutes more. Cool shell.", 
            "Make pudding filling: Whisk together cornstarch, 1/3 cup sugar, cocoa powder, and salt in a 2-quart heavy saucepan, then gradually whisk [tips alert!] in milk. Bring to a boil over medium heat, whisking constantly, then boil, whisking, two  minutes (mixture will thicken). Remove from heat and whisk in chocolate and vanilla until smooth.", 
            "Pour filling into cooled shell and chill, its surface covered with wax paper (if you want to prevent a skin from forming), until cold, at least two hours.", 
            "Just before serving, beat cream with remaining two tablespoons sugar until it just holds soft peaks. Spoon onto pie and garnish with bittersweet chocolate shavings, if you’re feeling fancy.", 
            "Do ahead: Pie dough can be made and chilled up to two days. Pie, without whipped cream, can be chilled up to one day before serving. Whipped cream is best added at the last minute, however, I did find that ours held up surprisingly well for a day (so far), if you feel like winging it.", 
            "* Detour! This is where I admit that I for reasons both lengthy and boring, I really loathe working with pie weights and use a different technique to blind bake pie and pastry shells. Instead, I freeze my rolled-out shells for 20 to 30 minutes until solid, press a piece of buttered foil, buttered side down, very tightly against the frozen shell and blind bake it according to regular directions. When it is time to remove the weights, I carefully pull back the foil, and press any part of the crust that has bubbled up gently back with the back of a spoon and continue baking the shell. Try it!"
        ], 
        "date": "2009-09-07T11:58:53+00:00"
    }, 
    {
        "ingredient_list": [
            "Pudding", 
            "1/3 cup small pearl tapioca (I used this)", 
            "2 1/2 cups coconut milk (light or full-fat; a 13.5-ounce can will contain 1 3/4 cups)", 
            "1 egg yolk", 
            "1/3 cup granulated sugar", 
            "1/4 teaspoon table salt or a heaped 1/4 teaspoon sea salt", 
            "1/2 teaspoon vanilla extract or the seeds from a 1-inch segment of vanilla bean", 
            "Mango puree", 
            "1 very ripe mango, peeled, pitted and roughly chopped", 
            "2 teaspoons granulated sugar (optional; I used it but would skip it next time)", 
            "A squeeze or two of fresh lime juice", 
            "Optional garnishes", 
            "Whipped coconut cream", 
            "1/2 cup toasted coconut flakes", 
            "Few gratings of lime zest"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/coconut-tapioca-pudding-with-mango1.jpg?w=500", 
        "tags": [
            "Coconut", 
            "Gluten-Free", 
            "Mango", 
            "Photo", 
            "Pudding", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/01/coconut-tapioca-pudding-with-mango/", 
        "title": "coconut tapioca pudding with mango", 
        "directions": [
            "Make pudding: In a medium saucepan, soak tapioca in coconut milk for 30 minutes. Whisk in egg yolk, sugar, salt and vanilla bean seeds, if using (if using extract, you’ll add it in a bit). Place saucepan over medium heat until mixture comes to a simmer, then reduce it to very low heat so it’s barely bubbling, and cook it until it thickens, about 15 minutes, stirring frequently. Remove from heat and add vanilla extract, if using. [Pudding will be the consistency of thick gravy — i.e. worrisomely thin — going into the cups but after chilling in the fridge, it will set.] Pour into pudding cups to chill for several hours or overnight. ", 
            "Make mango puree: Place mango chunks in food processor with sugar (if using) and lime juice and blend until very smooth, scraping down the sides several times, if needed. Refrigerate puree until needed.", 
            "Serve with mango puree on top, plus whipped coconut cream, toasted coconut flakes or a few gratings of lime zest.", 
            "To make whipped coconut cream: This a bit of advance planning. Place 1 can of full-fat coconut milk in the fridge overnight; in most brands, this will cause the coconut fats and thin milk/watery part to separate. Place a small/medium mixing bowl in the freezer, ideally metal. The next day, turn it upside-down before opening it, so that the thickened coconut fat will be at the bottom. Pour off the thin coconut milk; you should have about 1 cup and this can be used towards the 2 1/2 cups needed for your pudding. About 2/3 cup thickened coconut fat will remain at the bottom of the can; scrape this into your chilled bowl, add about 1 tablespoon granulated sugar (for a light sweetness; use more to taste) and beat it with an electric mixer until thick and whipped cream-like. Dollop it over desserts such as this, though you’ll have more than you need for 6 puddings. ", 
            "To toast coconut chips: Heat an oven to 350 degrees F. Spread coconut flakes on a rimmed baking sheet and toast until golden brown and fragrant, about 5 minutes, tossing once if needed to help them brown evenly. Let cool before using.", 
            "How to use a vanilla bean: Cut off desired amount of bean. With a sharp paring knife, split the segment lengthwise. Use the back of the knife to scrape the seeds out of the open pod; they’ll be on both sides and look a bit like sticky tar. Use these in your pudding. Go ahead and throw the pods in, too, for extra flavor, just remember to fish them out before chilling the pudding."
        ], 
        "date": "2014-01-09T12:12:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup Arborio rice", 
            "4 cups milk", 
            "1/4 cup sugar", 
            "1/2 vanilla bean, split", 
            "3/4 teaspoon almond extract or 1 bay leaf", 
            "1/2 pint raspberries, other berries or dried fruit (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/04/arborio-rice-pudding.jpg?w=750", 
        "tags": [
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2007/04/odds-ends/", 
        "title": "arborio rice pudding", 
        "directions": [
            "In a large saucepan, place all the ingredients, except the almond extract and raspberries. Bring it to a gentle boil and then turn it down to a gentle simmer, stirring occasionally to keep it from sticking to the bottom, for about 30 to 40 minutes. Taste the rice to check for doneness. The rice should be very soft and plump. ", 
            "Take the pudding off the heat and stir in the extract. Pour into dessert bowls and stir in some fresh raspberries, or other dried or fresh fruit. Serve immediately."
        ], 
        "date": "2007-04-07T16:00:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound bakery white or challah bread, crusts removed, cut into 1-inch cubes", 
            "1 Granny Smith apple, peeled and cut into 1/2-inch pieces", 
            "1 cup (6 ounces) golden raisins, plumped in hot water for 15 minutes", 
            "3 large eggs", 
            "3/4 cup sugar", 
            "1/4 teaspoon cinnamon", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1/8 teaspoon ground ginger", 
            "1/4 teaspoon pure vanilla extract", 
            "1/4 teaspoon salt", 
            "3 cups whole milk", 
            "2 tablespoons unsulfured molasses", 
            "1/4 cup sliced almonds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/raisin-studded-apple-bread-pudding1.jpg?w=500", 
        "tags": [
            "Apple", 
            "Fall", 
            "Photo", 
            "Pudding", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2009/11/raisin-studded-apple-bread-pudding/", 
        "title": "raisin-studded apple bread pudding", 
        "directions": [
            "Preheat the oven to 350°F. Spread the bread cubes on a baking sheet and toast in the oven for 6 minutes, until crisp. Transfer to a bowl and add the apple and raisins.", 
            "Generously butter either a 9×13-inch deep baking dish or six 8-ounce ramekins. If using ramekins, set them on the baking sheet.", 
            "In a medium bowl, using a handheld electric mixer or whisk, beat the eggs with the sugar. Beat in the ground spices, vanilla and salt.", 
            "In a medium saucepan, heat the milk with the molasses until just warm to the touch. Gradually beat the warm milk into the egg mixture, scraping the bottom and side of the bowl.", 
            "Spread bread mixture out in your large baking dish, or distribute it among ramekins. Pour the custard over the bread mixture, nudging the bread around a bit to make sure it soaks all of the pieces. Let stand for 5 minutes. Sprinkle the almonds on top. Bake in the center of the oven for about 40 minutes, until puffed and set, with the tops lightly browned. Let the bread pudding(s) rest for at least 15 minutes before serving."
        ], 
        "date": "2009-11-10T09:53:03+00:00"
    }, 
    {
        "ingredient_list": [
            "8 ounces bittersweet chocolate (no more than 60% cacao), chopped", 
            "3/4 stick (3 ounces) unsalted butter, cut into 6 pieces", 
            "3 large eggs, separated", 
            "1 tablespoon Cognac or other brandy (or swap with a liqueur of your choice)", 
            "1 cup very cold heavy or whipping cream", 
            "1/8 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/old-school-chocolate-mousse1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "French", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2009/10/silky-decadent-old-school-chocolate-mousse/", 
        "title": "silky, decadent old-school chocolate mousse", 
        "directions": [
            "Get out one large heatproof, two medium and one small mixing bowl and dust off your electric hand mixer.", 
            "Set the large bowl over a saucepan of barely simmering water and melt the chocolate and butter in it, gently stirring it until smooth. Remove from heat. Alternately, you can melt them in your microwave, stirring thoroughly at 30 seconds and every 15 seconds thereafter until the mixture is smooth.", 
            "In the small bowl, beat yolks with your electric mixer until thick enough to form a ribbon that takes a few seconds to dissolve — this will take about two to four minutes to achieve. Whisk yolks into chocolate mixture along with Cognac, then cool to warm.", 
            "In one of the medium bowls, beat the cream with cleaned beaters until it just holds stiff peaks.", 
            "In the other medium bowl, beat the egg whites and salt with cleaned beaters until they just hold soft peaks.", 
            "Fold the whipped cream and beaten whites into the chocolate mixture, gently but thoroughly. Transfer to 8 (4 ounce) ramekins or one large serving bowl, or go restaurant-style, serving it in stemmed glasses with white or dark chocolate shavings on top.", 
            "Do ahead: Mousse can be chilled, its surface covered with parchment paper, up to 2 days, though I’ve never heard of it lasting that long with hungry people named Deb around. Let stand at room temperature at least 30 minutes before serving."
        ], 
        "date": "2009-10-26T11:52:59+00:00"
    }, 
    {
        "ingredient_list": [
            "24 ladyfingers (savioardi) cookies (storebought or from recipe below)", 
            "3 large eggs, separated", 
            "1/3 cup (65 grams) plus 1 tablespoon (13 grams) granulated sugar, divided", 
            "1 8.8-ounce (250 ml) package mascarpone", 
            "1/3 cup (80 ml) sweet or dry marsala", 
            "1 cup (235 ml) strong, warm espresso coffee", 
            "A couple tablespoons of your favorite cocoa powder, for sifting over"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/small-batch-tiramisu.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Italian", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2017/02/small-batch-tiramisu/", 
        "title": "small batch tiramisu", 
        "directions": [
            "In a medium bowl, beat egg whites until stiff.", 
            "In a larger bowl, using same beaters, beat egg yolks and 1/3 cup sugar until thick and pale yellow, 3 to 4 minutes. Beat in mascarpone cheese until combined, and continue beating another minute for extra fluff. Beat in marsala until smooth. Gently fold in egg whites until combined, trying not to deflate the mixture. It will be a loose, soft, creamy custard.", 
            "In a small bowl wide enough to dip cookies into, combine the espresso and 1 tablespoon sugar. Set aside.\nTo assemble small cups: Dip first cookie in espresso mixture until almost fully saturated but not falling apart. Break in half and place the first half in the bottom of your cup. Spoon 1 generous (I use a measuring spoon, but heaped a little) tablespoon cream over it. Repeat with second half of first biscuit and another spoonful of cream. Dust with cocoa powder. Dip second cookie in coffee and break in half. Place side-by-side over cocoa then top with 2 generous tablespoons cream mixture, which should take you nearly to the top of the cup. Dust with more cocoa. Repeat with remaining cups.\nTo assemble large cups: Dip first cookie in espresso mixture until almost fully saturated but not falling apart. Break in half and place side-by-side in the bottom of your larger cup. Spoon 2 generous tablespoons (I use a measuring spoon, but heaped a little) cream over and dust with cocoa powder. Dip two biscuits in espresso mixture and break in half. Place 3 of the halves on top of the cocoa powder, cover with another 2 generous tablespoons of cream and cocoa powder. Dip a 4th biscuit in the espresso mixture, break it in half, and place these two halves plus the leftover half from the previous layer on top of the cocoa. Dollop more cream over and repeat with remaining cups.\nIf you can bear it, let cups chill in fridge overnight to set. Before eating, you can dust them with fresh cocoa powder for a prettier look.", 
            ""
        ], 
        "date": "2017-02-13T13:02:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup Arborio rice", 
            "4 cups milk (both whole and reduced-fat have worked for me)", 
            "1/4 cup sugar", 
            "1/2 vanilla bean, split (or 1 teaspoon pure extract, added with almond at the end)", 
            "1 bay leaf", 
            "3/4 teaspoon almond extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/vanilla-almond-rice-pudding.jpg?w=752", 
        "tags": [
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2009/01/vanilla-almond-rice-pudding/", 
        "title": "almond-vanilla rice pudding", 
        "directions": [
            "In a large saucepan, place all the ingredients, except the almond extract. Bring it to a gentle boil and then turn it down to a gentle simmer, stirring occasionally to keep it from sticking to the bottom, for about 30 to 40 minutes. Taste the rice to check for doneness. The rice should be very soft and plump.", 
            "Take the pudding off the heat and stir in the extract(s). Pour into dessert bowls. You can serve it immediately or let it chill in the fridge. Either way, keep it away from Deb."
        ], 
        "date": "2009-01-09T11:44:07+00:00"
    }, 
    {
        "ingredient_list": [
            "2 2/3 cups whole milk, divided", 
            "1/2 cup sugar", 
            "1/4 cup cornstarch", 
            "1/4 teaspoon salt", 
            "Seeds from 1/2 vanilla bean (or 2 teaspoons of vanilla extract)", 
            "1 large egg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/vanilla-bean-pudding11.jpg?w=640", 
        "tags": [
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2011/01/vanilla-bean-pudding/", 
        "title": "vanilla bean pudding", 
        "directions": [
            "Bring 2 cups of the milk to a boil in a medium saucepan. While it is heating, combine sugar, cornstarch, salt and vanilla bean (if you’re replacing it with extract, don’t add it yet; if you’d like to toss the leftover vanilla bean pods in the pot with the simmering milk for an extra vanilla boost, go for it) in the bottom of a medium, heatproof bowl. Gradually whisk in the remaining 2/3 cup whole milk, a little at a time so lumps do not form, then whisk in the egg. Once milk is boiling, very gradually add it to the cornstarch mixture in the bowl, whisking the whole time.", 
            "Return the mixture back to the saucepan, stirring constantly with a silicon spatula or wooden spoon. Once it comes to a simmer, cook it for one minute longer (which will cook the cornstarch and egg fully). Stir in vanilla extract, if you’re using it and divide pudding among 6 dishes. Chill in refrigerator until fully set, about 2 hours.", 
            "[If you don’t like pudding skin, we can’t be friends just press a piece of plastic wrap against the top of the pudding before you chill it.]"
        ], 
        "date": "2011-01-08T13:22:09+00:00"
    }, 
    {
        "ingredient_list": [
            "Custards", 
            "1 cup whole milk", 
            "Seeds from 1/4 to 1/2 vanilla bean (see Note) or 1 teaspoon pure vanilla extract", 
            "3 large egg yolks", 
            "1/4 cup granulated sugar", 
            "3 tablespoons all-purpose flour", 
            "1 to 2 tablespoons (see Note) unsalted butter", 
            "Berries", 
            "1 cup blueberries", 
            "1 1/2 teaspoons granulated sugar", 
            "Juice from a wedge lemon, or to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/08/vanilla-custards-with-roasted-blueberries.jpg?w=750", 
        "tags": [
            "Blueberries", 
            "Photo", 
            "Pudding", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/08/vanilla-custards-with-roasted-blueberries/", 
        "title": "vanilla custards with roasted blueberries", 
        "directions": [
            "In a small saucepan, combine your milk and vanilla bean flecks (if using extract instead, don’t add it yet). Heat the mixture until it is warm, then set aside. You can also do this in a microwave. If your saucepan or microwave dish has a small spout, even better.", 
            "In the bottom of a small saucepan, off the heat, beat or whisk your egg yolks and 1/4 cup sugar together vigorously, until it pales in color and a ribbon of batter falls off your whisk when you lift it from the bowl; this will take a few minutes by hand, and likely just one minute with an electric mixer. Whisk in the flour until fully incorporated.", 
            "Whisking the whole time, drizzle the warm vanilla-milk mixture into the egg yolk mixture, just a tiny bit at a time at first. Once you’ve added about 1/4 of the milk, you can add the rest in a thin stream, whisking constantly. ", 
            "Bring the saucepan to your stove and heat it over medium-high heat, whisking constantly, until it begins to bubble. Once bubbling, whisk it for 1 to 2 more minutes, then remove it from the heat. Immediately stir in vanilla extract (if using) and butter until combined. [Updated to add] As a final step for a perfectly smooth and silky custard, you can press the mixture through a fine-mesh strainer. You can also skip this step if you’re not terribly concerned about an imperfect custard.", 
            "To cool your custard quickly, place the saucepan in a larger bowl of ice water that will go halfway up the sides of the saucepan (i.e. water should not spill in) and stir the custard until lukewarm, then divide among serving dishes or ramekins. You can also pour it into serving dishes or ramekins still hot, but you should then press a film of plastic wrap against each custard in the fridge so it doesn’t form a pudding skin. Custards keep in fridge for up to 4 days.", 
            "To serve: Preheat oven to 450°F. Place blueberries in a heatproof, shallow roasting dish and sprinkle with 1 1/2 teaspoons sugar. Roast in oven for 12 to 15 minutes, rolling around once or twice during cooking time to ensure they roast evenly. The goal is not to let the blueberries fully slump or turn to sauce; you just want a little trickle of juices puddled across in the bottom. Squeeze a bit of lemon juice over berries the second they come out of the oven and roll them back and forth to evenly incorporate it. Spoon hot roasted blueberries and some of their juices over each custard. Eat immediately, passing any extra roasted blueberries alongside."
        ], 
        "date": "2012-08-30T22:06:46+00:00"
    }, 
    {
        "ingredient_list": [
            "Panna cotta", 
            "Neutral oil such as canola or safflower", 
            "4 tablespoons (60 ml) water", 
            "2 1/2 teaspoons (1 packet or 1/4 ounce or 7 grams) unflavored gelatin", 
            "2 cups (460 grams) plain whole-milk Greek yogurt", 
            "2 cups (475 ml) milk, heavy cream or a combination thereof (see note up top), divided", 
            "1/4 to 1/2 cup (50 to 100 grams) granulated sugar (see note up top)", 
            "2 tablespoons (30 ml) freshly squeezed lemon juice (from about 1/2 lemon)", 
            "To serve", 
            "1/3 to 1/2 cup (110 to 170 grams) honey", 
            "1/2 to 3/4 cup (55 to 85 grams) walnuts, toasted, cooled and coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/yogurt-panna-cotta-with-walnuts-and-honey.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Gluten-Free", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2013/04/yogurt-panna-cotta-with-walnuts-and-honey/", 
        "title": "yogurt panna cotta with walnuts and honey", 
        "directions": [
            "If you plan to unmold the panna cotta later, lightly coat the inside of a 9-inch round cake pan or smaller dessert cups with the oil. (No need to if you will scoop it from its cups.)", 
            "Place water in a small bowl. Stir in gelatin and set aside until the gelatin softens, about 15 minutes. ", 
            "In a large bowl, whisk all of yogurt and 1 cup of milk, cream or a mixture thereof. In a small saucepan, bring remaining milk or cream and sugar to a simmer. Stir in water-gelatin mixture (it will dissolve immediately) and remove from heat. Whisk this mixture into the yogurt mixture, then stir in lemon juice at the end. Pour mixture into cake pan or smaller cups and chill in fridge for at least 2 hours for small cups and up to 8 for a large pan. It’s best to do this the night before you need it, to be safe.", 
            "To unmold the cake pan, fill a larger baking dish with 1-inch boiling water. Dip panna cotta cake pan in it for 10 seconds, then flip it out onto a flat round platter. (A curved one will cause the panna cotta to appear sunken in the middle.)", 
            "To unmold smaller dishes, bring a small saucepan of water to a simmer and dip the bottom of a small panna cotta cup in one for five seconds, then invert it onto a plate. Repeat with remaining cups.", 
            "Right before you serve the panna cotta, sprinkle it with walnuts and drizzle it with honey. This needs to be done right before you serve it because the honey will (unfortunately) become liquidy and roll off it it sits on the panna cottas for too long. ", 
            "Do ahead: Panna cottas can be made two days ahead, though I suspect longer. Keep refrigerated. ", 
            "Non-gelatin panna cotta: Because gelatin is an animal by-product, many vegetarians will not eat it. I haven’t tested vegetarian options, but I’ve read a lot about using Natural Dessert’s Vegan Gel as well as agar-agar as a replacement. If you Google around a bit, you will find many directions for using either.", 
            "Dairy-free panna cotta: This isn’t really in the realm of this recipe, which was designed for yogurt, but there are many recipes on the web for panna cottas made with almond, coconut and/or soy milks, if you’re interested in looking into them.", 
            "* I put 1/3 cup each in these tiny (5.75 ounce) tumblers. You could also put about 2/3 cups each in this 7 1/2-ounce size."
        ], 
        "date": "2013-04-26T11:07:40+00:00"
    }
]