{
  "date": "2009-11-10T09:53:03+00:00",
  "directions": [
    "Preheat the oven to 350°F. Spread the bread cubes on a baking sheet and toast in the oven for 6 minutes, until crisp. Transfer to a bowl and add the apple and raisins.",
    "Generously butter either a 9×13-inch deep baking dish or six 8-ounce ramekins. If using ramekins, set them on the baking sheet.",
    "In a medium bowl, using a handheld electric mixer or whisk, beat the eggs with the sugar. Beat in the ground spices, vanilla and salt.",
    "In a medium saucepan, heat the milk with the molasses until just warm to the touch. Gradually beat the warm milk into the egg mixture, scraping the bottom and side of the bowl.",
    "Spread bread mixture out in your large baking dish, or distribute it among ramekins. Pour the custard over the bread mixture, nudging the bread around a bit to make sure it soaks all of the pieces. Let stand for 5 minutes. Sprinkle the almonds on top. Bake in the center of the oven for about 40 minutes, until puffed and set, with the tops lightly browned. Let the bread pudding(s) rest for at least 15 minutes before serving."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/raisin-studded-apple-bread-pudding1.jpg?w=500",
  "ingredient_list": [
    "1 pound bakery white or challah bread, crusts removed, cut into 1-inch cubes",
    "1 Granny Smith apple, peeled and cut into 1/2-inch pieces",
    "1 cup (6 ounces) golden raisins, plumped in hot water for 15 minutes",
    "3 large eggs",
    "3/4 cup sugar",
    "1/4 teaspoon cinnamon",
    "1/8 teaspoon freshly grated nutmeg",
    "1/8 teaspoon ground ginger",
    "1/4 teaspoon pure vanilla extract",
    "1/4 teaspoon salt",
    "3 cups whole milk",
    "2 tablespoons unsulfured molasses",
    "1/4 cup sliced almonds"
  ],
  "tags": [
    "Apple",
    "Fall",
    "Photo",
    "Pudding",
    "Thanksgiving"
  ],
  "title": "raisin-studded apple bread pudding",
  "url": "https://smittenkitchen.com/2009/11/raisin-studded-apple-bread-pudding/"
}