{
  "date": "2013-04-26T11:07:40+00:00",
  "directions": [
    "If you plan to unmold the panna cotta later, lightly coat the inside of a 9-inch round cake pan or smaller dessert cups with the oil. (No need to if you will scoop it from its cups.)",
    "Place water in a small bowl. Stir in gelatin and set aside until the gelatin softens, about 15 minutes. ",
    "In a large bowl, whisk all of yogurt and 1 cup of milk, cream or a mixture thereof. In a small saucepan, bring remaining milk or cream and sugar to a simmer. Stir in water-gelatin mixture (it will dissolve immediately) and remove from heat. Whisk this mixture into the yogurt mixture, then stir in lemon juice at the end. Pour mixture into cake pan or smaller cups and chill in fridge for at least 2 hours for small cups and up to 8 for a large pan. It’s best to do this the night before you need it, to be safe.",
    "To unmold the cake pan, fill a larger baking dish with 1-inch boiling water. Dip panna cotta cake pan in it for 10 seconds, then flip it out onto a flat round platter. (A curved one will cause the panna cotta to appear sunken in the middle.)",
    "To unmold smaller dishes, bring a small saucepan of water to a simmer and dip the bottom of a small panna cotta cup in one for five seconds, then invert it onto a plate. Repeat with remaining cups.",
    "Right before you serve the panna cotta, sprinkle it with walnuts and drizzle it with honey. This needs to be done right before you serve it because the honey will (unfortunately) become liquidy and roll off it it sits on the panna cottas for too long. ",
    "Do ahead: Panna cottas can be made two days ahead, though I suspect longer. Keep refrigerated. ",
    "Non-gelatin panna cotta: Because gelatin is an animal by-product, many vegetarians will not eat it. I haven’t tested vegetarian options, but I’ve read a lot about using Natural Dessert’s Vegan Gel as well as agar-agar as a replacement. If you Google around a bit, you will find many directions for using either.",
    "Dairy-free panna cotta: This isn’t really in the realm of this recipe, which was designed for yogurt, but there are many recipes on the web for panna cottas made with almond, coconut and/or soy milks, if you’re interested in looking into them.",
    "* I put 1/3 cup each in these tiny (5.75 ounce) tumblers. You could also put about 2/3 cups each in this 7 1/2-ounce size."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/yogurt-panna-cotta-with-walnuts-and-honey.jpg?w=750",
  "ingredient_list": [
    "Panna cotta",
    "Neutral oil such as canola or safflower",
    "4 tablespoons (60 ml) water",
    "2 1/2 teaspoons (1 packet or 1/4 ounce or 7 grams) unflavored gelatin",
    "2 cups (460 grams) plain whole-milk Greek yogurt",
    "2 cups (475 ml) milk, heavy cream or a combination thereof (see note up top), divided",
    "1/4 to 1/2 cup (50 to 100 grams) granulated sugar (see note up top)",
    "2 tablespoons (30 ml) freshly squeezed lemon juice (from about 1/2 lemon)",
    "To serve",
    "1/3 to 1/2 cup (110 to 170 grams) honey",
    "1/2 to 3/4 cup (55 to 85 grams) walnuts, toasted, cooled and coarsely chopped"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Gluten-Free",
    "Photo",
    "Pudding"
  ],
  "title": "yogurt panna cotta with walnuts and honey",
  "url": "https://smittenkitchen.com/2013/04/yogurt-panna-cotta-with-walnuts-and-honey/"
}