{
  "date": "2010-07-28T10:13:53+00:00",
  "directions": [
    "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns. Set aside and let cool (the fridge will hasten this along).",
    "Prepare you pan: Preheat oven to 350°F. Line the bottom of a 10-inch round cake pan, springform or cast iron skillet with parchment paper and butter the paper and rest of the pan generously; set aside.",
    "Make the cake: Whisk flour, baking powder, salt and allspice in medium bowl to blend. In a large bowl, whisk together 1/2 cup cooled browned butter (set aside remaining 1/4 cup for topping), sugar and then eggs, one at  a time. Stir in milk or buttermilk. Stir dry ingredients into this wet mixture; mix until just combined and spread batter in prepared pan. Toss nectarine wedges with lemon juice and arrange them in a single layer on top of the batter.",
    "Make the streusel and bake the cake: Stir remaining brown butter, sugar, flour, cinnamon and salt together until large crumbs form. Sprinkle the nectarine-topped batter with crumbs. Bake until top is golden brown and tester inserted into center comes out with moist crumbs, about 40 to 45 minutes. Let cool in pan for 5 minutes before flipping out onto a cooling rack."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/4833941545_0c7c5409a1_o-1.jpg?w=751",
  "ingredient_list": [
    "3/4 cup (6 ounces or 170 grams) unsalted butter, plus additional for greasing pan",
    "1 1/2 cups (6 3/4 ounces or 190 grams) all purpose flour",
    "2 teaspoons (9 grams) baking powder",
    "3/4 teaspoon (4 grams) salt",
    "Pinch of allspice",
    "1 cup (7 ounces or 200 grams) sugar",
    "2 large eggs",
    "2/3 cup whole milk or buttermilk",
    "1 1/2 pounds nectarines, halved, pitted and cut into 1/2-inch thick wedges (about 4 cups)",
    "1 tablespoon lemon juice",
    "Streusel",
    "Reserved butter from cake (above)",
    "1/2 cup (3 1/2 ounces or 100 grams) sugar",
    "1/2 cup (2 1/4 ounces or 64 grams) all purpose flour",
    "1/4 teaspoon cinnamon",
    "Pinch of salt"
  ],
  "tags": [
    "Brown Butter",
    "Cake",
    "Cookbooks",
    "Everyday Cakes",
    "Nectarine",
    "Photo",
    "Picnics",
    "Summer"
  ],
  "title": "nectarine brown butter buckle",
  "url": "https://smittenkitchen.com/2010/07/nectarine-brown-butter-buckle/"
}