[
    {
        "ingredient_list": [
            "For pasta", 
            "1 1/2 cups all-purpose flour", 
            "2 large eggs", 
            "1/2 teaspoon salt", 
            "2 tablespoons water", 
            "For filling", 
            "2 tablespoons unsalted butter, cut into pieces", 
            "1 small onion, chopped (1/2 cup)", 
            "1 (10-oz) box frozen artichoke hearts, thawed and patted dry", 
            "1 oz finely grated Parmigiano-Reggiano (1/2 cup)", 
            "1/3 cup chopped fresh flat-leaf parsley", 
            "1 large egg yolk", 
            "1/2 teaspoon fresh lemon juice", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "3/4 teaspoon freshly grated nutmeg", 
            "1 large egg white, lightly beaten with 2 teaspoons water (for egg wash)", 
            "For assembly", 
            "1 tablespoon unsalted butter, cut into pieces", 
            "3 medium plum tomatoes, trimmed and cut into 1/4-inch dice (3/4 cup)", 
            "1/4 cup water", 
            "1/3 cup heavy cream", 
            "1 oz finely grated Parmigiano-Reggiano (1/2 cup)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/artichoke-gaga1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Pasta", 
            "Photo", 
            "Spring", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/01/artichoke-gaga/", 
        "title": "artichoke ravioli with tomatoes", 
        "directions": [
            "Special equipment: a pasta machine; a 3-inch round metal cookie cutter; a shallow oval 2-qt ceramic or glass baking dish (12 by 8 1/2 inches) ", 
            "To make pasta dough in a food processor:  Blend flour, eggs, salt, and water in processor until mixture just begins to form a ball, adding more water, drop by drop, if dough is too dry (dough should be firm and not sticky). Process dough for 15 seconds more to knead it. Transfer to a floured surface and let stand, covered with an inverted bowl, 1 hour to let the gluten relax and make rolling easier.", 
            "To make dough by hand:  Mound flour on a work surface, preferably wooden, and make a well in center. Add eggs, salt, and water to well. With a fork, gently beat eggs and water until combined. Gradually stir in enough flour to form a paste, pulling in flour closest to egg mixture and being careful not to make an opening in outer wall of well. Knead remaining flour into mixture with your hands to form a dough, adding more water, drop by drop, if dough is too dry (dough should be firm and not sticky). Knead dough until smooth and elastic, 8 to 10 minutes. Cover with an inverted bowl and let stand 1 hour (to make rolling easier).", 
            "Make filling:  Heat butter in a 12-inch heavy skillet over moderately high heat until foam subsides, then saute onion, stirring occasionally, until golden, about 6 minutes. Add artichoke hearts and saute, stirring occasionally, until tender, 8 to 10 minutes. Remove from heat and cool slightly.", 
            "Transfer all but 3/4 cup artichoke mixture to cleaned bowl of processor (reserve remaining artichoke mixture in skillet), then add cheese, parsley, yolk, lemon juice, salt, pepper, and nutmeg and pulse until mixture is coarsely chopped. ", 
            "Roll pasta and make ravioli:  Cut pasta dough into 4 pieces, then flatten each piece into a rough rectangle and cover rectangles with an inverted large bowl. Set rollers of pasta machine on widest setting.", 
            "Lightly dust 1 rectangle with flour and feed through rollers. (Keep remaining rectangles under bowl.) Fold rectangle in half and feed it, folded end first, through rollers 7 or 8 more times, folding it in half each time and feeding folded end through. Dust with flour if necessary to prevent sticking. Turn dial to next (narrower) setting and feed dough through rollers without folding. Continue to feed dough through rollers once at each setting, without folding, until you reach narrowest setting. Dough will be a smooth sheet (about 24 inches long and 4 inches wide). ", 
            "Put sheet of dough on a floured work surface and drop 6 (1 1/2-teaspoon) mounds of filling 1 1/2 inches apart in a row down center of one half of sheet. Brush egg wash around each mound, then fold other half of sheet over filling. Press down firmly around each mound, forcing out air. (Air pockets increase the chance that ravioli will break during cooking.) Cut pasta (between mounds) with cutter into 3-inch rounds. Line a large shallow baking pan with a clean kitchen towel (not terry cloth) and dust towel with flour, then arrange ravioli in 1 layer in it. Make more ravioli with remaining pasta dough, 1 sheet at a time, and remaining filling, transferring ravioli to lined pan.", 
            "Put oven rack in middle position and preheat oven to 350°F. Lightly butter baking dish.", 
            "Bring a 6- to 8-quart pot of salted water to a boil. Add ravioli, carefully stirring to separate, and, adjusting heat to keep water at a gentle boil, cook until pasta is just tender, about 6 minutes. Transfer with a slotted spoon to a colander.", 
            "Assemble and bake dish:  While ravioli boils, reheat reserved artichoke mixture in skillet with butter over moderately high heat, then add tomatoes and water and cook, stirring, until tomatoes are softened, about 5 minutes.", 
            "Transfer half of ravioli to baking dish and top with half of artichoke mixture, half of cream, and half of cheese. Repeat with remaining ravioli, artichoke mixture, cream, and cheese. Sprinkle with salt and pepper.", 
            "Bake, uncovered, until ravioli is heated through and cream is bubbling, about 15 minutes. ", 
            "Do ahead: Dough can be made (but not rolled out) 4 hours ahead and chilled, tightly wrapped in plastic wrap. Ravioli can be made (but not cooked) 4 hours ahead and chilled in lined baking pan, covered. "
        ], 
        "date": "2007-01-09T17:52:07+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups cooked, drained and chopped artichoke hearts (will start as 3 cups from a 12-ounce frozen bag, prep directions below)", 
            "1 medium (about 6 ounces) Yukon gold potato, peeled and diced very small (1/4 to 1/2-inch pieces)", 
            "1/4 cup heavy cream, plus up to 2 tablespoons more to taste", 
            "1 small clove garlic, minced", 
            "Kosher salt and freshly ground black pepper", 
            "Few gratings of lemon zest", 
            "Juice of half a lemon", 
            "1 cup (2 1/2 ounces) finely grated aged Asiago cheese, though Parmesan or Pecorino should work well here too", 
            "6 slices hearty bread, your favorite kind (see Note up top for mine)", 
            "Parsley to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/16947742118_f951543925_k.jpg?w=751", 
        "tags": [
            "Artichokes", 
            "Photo", 
            "Potatoes", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/04/artichoke-gratin-toasts/", 
        "title": "artichoke gratin toasts", 
        "directions": [
            "Cook frozen artichokes on the stove artichokes in simmering water until firm-tender, which took 4 to 5 minutes for the brand I used. Drain well in a colander, then spread out on layers of paper towels and do you best to press all of the water out. You can keep them on towels while you prepare the other ingredients.", 
            "Cover diced potatoes with in inch of cold water and a few pinches of salt (using the same pot as the artichokes, because doing dishes is the worst) and set a timer for 8 minutes. Bring to a simmer and cook until potatoes are tender but not falling apart, usually about the allotted 8 minutes but go by texture, not timer. Drain potatoes, wipe out pot, and put cream, garlic, lemon zest, salt and pepper back in. Bring to a simmer and cook for one minute, stirring because this will be a tiny amount in a bigger pot. Add drained potatoes and cook together for 1 to 2 minutes more. ", 
            "Chop drained and patted dry artichokes into bite-sized (about 1/2-inch) chunks and place in a large bowl. Season with salt and lemon juice to taste. Add potato-cream mixture and 3/4 cup grated cheese and stir to combine. Taste for seasoning and adjust salt and pepper if needed (will probably be needed). Add up to 2 extra tablespoons heavy cream if the mixture seems a little dry. ", 
            "Heat the broiler on your oven, or simply your oven itself to 450°F. Arrange slices of bread on a foil-lined tray (for easy clean up) and heap artichoke-potato mixture evenly over slices. Sprinkle with reserved cheese, and bake or broil until browned and melty, anywhere from 5 minutes under a good broiler to 10 to 15 minutes in a less-intense oven. Eat hot and repeat again tomorrow."
        ], 
        "date": "2015-04-13T12:05:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 garlic clove, peeled and smashed", 
            "1 cup large green pitted olives", 
            "1 tablespoon capers, rinsed and drained", 
            "1 15-ounce can of artichoke hearts, drained", 
            "1/4 cup extra-virgin olive oil", 
            "8 large slices of crusty bread"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/artichoke-olive-crostini1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Artichokes", 
            "Italian", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/04/artichoke-olive-crostini/", 
        "title": "artichoke-olive crostini", 
        "directions": [
            "1. Preheat the oven to 400°F. In a food processor, process the garlic, olives, capers, artichoke hearts and olive oil to a coarse paste.", 
            "2. Toast the bread on the oven rack for 6 minutes, or until crisp and browned. Spread the olive paste thickly over the toasts and serve.", 
            "Do ahead: The olive paste can be refrigerated for 2 days. Let it return to room temperature before using."
        ], 
        "date": "2009-04-06T11:44:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1 lemon, halved", 
            "8 medium artichokes", 
            "3 small shallots, sliced into thin rings", 
            "1 carrot, finely chopped", 
            "3 garlic cloves, thinly sliced", 
            "1/4 teaspoon fennel seeds", 
            "1/4 teaspoon coriander seeds", 
            "1/2 cup extra-virgin olive oil, divided", 
            "1 1/2 cups water", 
            "3 strips lemon zest", 
            "1/4 cup fresh lemon juice, divided", 
            "2 tablespoons coarsely chopped flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/artichokes-braised-in-lemon-and-olive-oil1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Citrus", 
            "Photo", 
            "Spring", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/03/artichokes-braised-in-lemon-and-olive-oil/", 
        "title": "artichokes braised in lemon and olive oil", 
        "directions": [
            "Trim artichokes into hearts [See photo collage, above]: Add lemon halves to a large bowl of cold water, squeezing to release juice. Cut off top inch of 1 artichoke [1] and bend back outer leaves until they snap off close to base (keep stem attached). Discard several more layers in same manner until you reach pale yellow leaves.[2] Cut remaining leaves flush with top of artichoke bottom using a sharp knife. [3] Trim dark green fibrous parts from base and sides of artichoke.[4] Peel sides of stem down to pale inner core. [5] Put in lemon water while preparing remaining artichokes.", 
            "Prepare braise: Cook shallots, carrot, garlic, and seeds in 1/4 cup oil in a 4-to 5-quart heavy pot (pot should be wide enough to hold artichokes in 1 layer with stems pointing upward) over medium heat, stirring occasionally, 3 minutes. Add water, zest, and 3 tablespoons lemon juice and bring to a simmer. Stand artichokes in pot and season with 1 teaspoon salt and 1/4 teaspoon pepper. Cover artichokes with wax paper, then a lid, and simmer over medium-low heat until bases are just tender when pierced with a knife, 20 to 30 minutes.", 
            "Transfer artichokes to a dish and reserve cooking liquid. When artichokes are cool enough to handle, halve lengthwise. Scoop out and discard inner choke (fuzzy center and any sharp leaves).", 
            "Heat 2 tablespoons oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then brown cut sides of artichokes in 2 batches, about 2 minutes per batch, transferring to a serving dish. Add reserved cooking liquid to skillet along with remaining tablespoon lemon juice and remaining 2 tablespoons oil. Boil vigorously 3 minutes, then stir in parsley and pour over artichokes. Serve warm or at room temperature.", 
            "Do ahead: Artichokes can be braised 1 day ahead and chilled in cooking liquid. Reheat to warm before proceeding."
        ], 
        "date": "2009-03-31T16:09:35+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound spiral-shaped pasta", 
            "1 pound slender asparagus spears, trimmed, cut into 1- to 1 1/2-inch pieces", 
            "1/4 cup olive oil", 
            "1 tablespoon finely grated lemon peel", 
            "2 teaspoons chopped fresh tarragon plus more for garnish", 
            "1 5- to 5 1/2-ounce log soft fresh goat cheese (the pre-crumbled stuff will not melt as well)", 
            "Fresh lemon juice to taste (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/asparagus-goat-cheese-and-lemon-pasta1.jpg?w=500", 
        "tags": [
            "Asparagus", 
            "Budget", 
            "Lemon", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2009/05/asparagus-goat-cheese-and-lemon-pasta/", 
        "title": "asparagus, goat cheese and lemon pasta", 
        "directions": [
            "Cook your pasta in a large pot of well-salted water until it is almost tender, or about three minutes shy of what the package suggests. Add asparagus and cook until firm-tender, another two to three minutes. Drain both pasta and asparagus together, reserving one cup of pasta water.", 
            "Meanwhile, combine olive oil, lemon peel, tarragon and cheese in a large bowl, breaking up the goat cheese as you put it in. Add hot pasta and asparagus to bowl, along with a couple slashes of the pasta water. Toss until smoothly combined, adding more pasta water if needed. Season generously with salt and pepper, and lemon juice if you feel it needs a little extra kick. (We did.)"
        ], 
        "date": "2009-05-17T17:50:53+00:00"
    }, 
    {
        "ingredient_list": [
            "6 large eggs", 
            "4 medium asparagus spears", 
            "2 teaspoons very finely minced shallot, scallion or chives, plus a pinch extra for garnish", 
            "3 tablespoons mayonnaise, whipping cream, creme fraiche, sour cream and/or soft butter", 
            "1/2 teaspoon smooth Dijon (optional)", 
            "Few gratings fresh lemon zest (optional)", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/asparagus-stuffed-eggs1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Asparagus", 
            "Breakfast", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/04/asparagus-stuffed-eggs/", 
        "title": "asparagus-stuffed eggs", 
        "directions": [
            "Hard-boil eggs using whichever method you prefer. I cover mine with cold water, bring it to a boil, then set a timer for 9 1/2 minutes. When it rings, drain the eggs, and plunge them in ice water until they’re fully cool. Eggs can be cooked ahead of time and stored in the fridge for up to 4 days. ", 
            "Cook asparagus spears in salted simmering water until full tender, about 4 to 5 minutes. Drain and plunge in cold water. Drain and again and spread on towels to dry out as much as possible. Cut 1/2-inch off the tips of each spears and cut these tips lengthwise (they’ll be your garnish). Puree remaining asparagus — I found that my food processor didn’t do a great job due to the small volume, but yours might. A food mill with a fine disc works well here. ", 
            "You’ll want to remove the excess water from your puree; I did so by spreading it for a minute on a few paper towel layers. If you don’t, the filling will be soggy and damp, or in Julia’s words, “a disappointing texture and flavor.” ", 
            "Peel your eggs. Dip your knife in water before cutting each in half lengthwise for a cleaner cut. Shave a thin strip off the bottom of each so that it will not rock about in its dish. Remove the yolks and press them through a fine-mesh strainer to sieve them. Add asparagus puree, shallot or chives, mayonnaise or cream, Dijon or lemon zest (if using) and combine mixture until smooth. Season carefully with salt and freshly ground black pepper.", 
            "You can spoon the mixture into each egg half, or use a piping bag with a star tip for a fancier presentation. Decorate each stuffed egg with a reserved asparagus tip (you’ll be a little short of what you need), and the remaining with the extra shallot, scallion or chives. Wrap tray in plastic and keep in fridge until ready to serve. "
        ], 
        "date": "2014-04-08T12:25:30+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "1/3 cup whole blanched almonds, Marconas if you can get them", 
            "Yogurt dressing", 
            "1 cup plain yogurt (strained or Greek-style if you can find it)", 
            "2 tablespoons lemon juice", 
            "1 teaspoon smoked paprika", 
            "1 small clove garlic, minced", 
            "1/4 teaspoon table salt", 
            "Asparagus", 
            "1 tablespoon olive oil", 
            "1 pounds asparagus spears, tough ends trimmed or peeled", 
            "Salt and freshly ground black pepper", 
            "To serve", 
            "Squeeze of lemon juice", 
            "Drizzle of olive oil", 
            "Coarse sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/asparagus-with-almonds-and-yogurt-dressing1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Asparagus", 
            "Easter", 
            "Photo", 
            "Side Dish", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/06/asparagus-with-almonds-and-yogurt-dressing/", 
        "title": "asparagus with almonds and yogurt dressing", 
        "directions": [
            "Hard-boil your eggs according to your favorite method. I like to put my eggs cold in a pot of water and bring it to a boil over high heat. Once it comes to a boil, I set the timer for 10 minutes and reduce the heat to a moderate simmer. When the timer goes off, I drain them and plunge them in ice water for a quick cooling. While they cool, toast your almonds. [If you have time, cook the eggs 24 hours or more in advance. Older hard-boiled eggs peel more cleanly.] ", 
            "In a 12-inch heavy skillet, toast your almonds over medium heat, tossing them frequently until they’re lightly bronzed. [Marcona almonds often come already toasted and in a bit of olive oil. If you’re happy with their color, use them as is. If not, you can put the almonds and oil in the skillet to toast them more deeply, as I did.] Let cool.", 
            "Once eggs and almonds are cool, coarsely chop both and set aside. ", 
            "Make your yogurt dressing, whisking all of the ingredients in a small bowl. Adjust seasonings to taste. Spread 1/2 cup dressing in a thin layer over serving dish and set aside. ", 
            "Reheat heavy 12-inch skillet over medium high heat. Add oil, and once the oil is fully heated, add your trimmed asparagus spears — placing half in one direction and half in the other allows them to fit better. They won’t fit flat in a single layer, but you should try to spread them as evenly as possible. Cover the skillet with a lid (foil if you don’t have one that fits) and let skinny spears cook for 3 minutes and fatter ones for 5. Remove the lid, increase the heat to high, season the asparagus with salt and black pepper, and use tongs to cook the spears until they’re crisp-tender and well-browned along a side or two, about 5 minutes more for skinny spears or 7 minutes for thicker ones. ", 
            "Transfer asparagus to dressing-coated serving dish. Sprinkle spears with an additional squeeze of lemon juice, if desired, a tiny drizzle of olive oil, chopped almonds, eggs and a bit of coarse sea salt. Dollop with additional yogurt dressing. Then dig in."
        ], 
        "date": "2012-06-01T14:03:21+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound large, thick, firm asparagus, lower third of the stalks peeled with a vegetable peeler or snapped off", 
            "1/4 cup good olive oil", 
            "4 ounces Spanish chorizo (but Portuguese chouriço will work as well), cut into 3/4-inch pieces", 
            "1 1/2 cups 3/4-inch bread cubes (croutons), preferably from a baguette or country bread loaf", 
            "1/4 cup whole almonds", 
            "1 cup cooked beans (optional; I used 3/4 pound fresh cranberry beans, shelled then boiled for 20 minutes in lightly salted water)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/asparagus-with-chorizo-and-croutons.jpg?w=753", 
        "tags": [
            "Asparagus", 
            "Meat", 
            "Photo", 
            "Quick", 
            "Spanish", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2009/07/asparagus-with-chorizo-and-croutons/", 
        "title": "asparagus with chorizo and croutons", 
        "directions": [
            "Make this right as you are ready to eat. Cut each asparagus stalk into 3 or 4 pieces. Heat the oil in a large skillet until very hot. Add all the ingredients except the beans, if using, and salt and pepper. Cover and sauté over high heat for 5 to 6 minutes (thinner asparagus might be done sooner), tossing or stirring the mixture a few times, so it browns and cooks on all sides. Add the beans, if using, and salt and pepper, toss again, and serve."
        ], 
        "date": "2009-07-21T21:04:51+00:00"
    }, 
    {
        "ingredient_list": [
            "2 lemons, halved", 
            "5 large artichokes (about 12 ounces each)", 
            "11/2 cups shelled fresh or frozen fava beans, or shelled frozen edamame", 
            "1/4 cup extra-virgin olive oil, plus more as needed", 
            "1 large onion, thinly sliced", 
            "1 sprig oregano, optional", 
            "2 ounces guanciale or pancetta, slivered", 
            "Salt", 
            "2 cups shelled (fresh or frozen) peas", 
            "1/4 cup chopped parsley", 
            "2 tablespoons chopped mint", 
            "* teaspoon lemon juice, plus more to taste", 
            "Freshly ground black pepper. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/box-one-of-two1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Beans", 
            "Easter", 
            "Italian", 
            "Photo", 
            "Spring", 
            "Stew"
        ], 
        "url": "https://smittenkitchen.com/2007/06/box-one-of-two/", 
        "title": "spring vegetable stew", 
        "directions": [
            "1. To prepare the artichokes: Fill a large bowl halfway with cold water. Squeeze the lemons into the water and add the rinds to the bowl. Using a serrated knife, cut off the top third of an artichoke. Pull back and snap off the dark green, leafy blades, one by one, until only the pale yellow leaves remain. Using a paring knife, trim the artichoke bottom and stem to the pale green flesh, then cut it in half lengthwise. Drop into the water (to keep the artichoke from turning brown) and repeat with the remaining artichokes. Using a spoon, scoop out the prickly leaves and hairy choke. Cut each half into 4 wedges and return to the water until ready to use. ", 
            "2. If using fresh fava beans, bring a large pot of water to a boil. Fill a large bowl two-thirds full with ice water. When the water comes to a boil, add the beans and cook for 1 minute, then drain and immediately submerge the beans in the ice water. Peel the beans by gently tearing the pale skins and pinching at one end. Discard the skins, reserving the dark green interiors. ", 
            "3. To cook the ragout: Heat a 12-inch nonreactive pan over medium heat. Add 1/4 cup olive oil and when hot, add the onion, oregano (if using) and guanciale. Cook, stirring occasionally until the onion and guanciale are translucent, about 10 minutes. Drain artichokes and add to the pan, along with 2 cups water and 11/4 teaspoons salt. Bring the liquid to a boil, then reduce heat to a simmer and cook until artichokes are just tender, about 25 minutes. If using frozen favas, add them and cook for 2 minutes. If using fresh favas or frozen edamame, add them, along with the peas, and cook until warm and tender, about 5 minutes more. Remove the oregano sprig. Sprinkle in parsley and mint. Season with lemon juice, freshly ground black pepper and, if desired, additional salt. Drizzle with extra-virgin olive oil and serve."
        ], 
        "date": "2007-06-05T23:38:32+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/crispy-frizzled-artichokes1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Artichokes", 
            "Gluten-Free", 
            "Grilling", 
            "Italian", 
            "Photo", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/06/crispy-frizzled-artichokes/", 
        "title": "crispy frizzled artichokes", 
        "directions": [
            "Prepare artichokes: Snap back toughest and unevenly sized outer leaves, peeling and plucking until you get to the paler yellowish leaves that are all the full length of the artichoke. Be careful of thorns; almost every leaf ends in one. If they’re particularly bothersome, you can lop off the bottom third of the artichoke at this point. (We will otherwise do it next.) For baby artichokes, cut off bottom 1/3 of leaves. For full-sized artichokes, cut off bottom 2/3 of leaves (more than you see in my photos), leaving only the top parts attached to the stem and heart. Rub all cut sides with lemon. ", 
            "Use a knife to pare down rough spots where leaves met the heart. Use a vegetable peeler to remove the outermost layer of the stem and “neck” of the artichoke. With tiny artichokes, the stems are sometimes too small or in bad shape to be used, in which case, feel free to trim them off. Rub exposed sides with lemon.", 
            "Halve baby artichokes lengthwise through the stem; for full-sized artichokes, quarter them through the stem. Rub cut sides with lemon.", 
            "If you’re using baby artichokes, you’re done with prep. If you’re using full-sized artichokes, you’ll need to take the additional step of cutting out and discarding the fibrous fuzzy (and unpleasant to eat) choke and the wiry (often purple) inner leaves. [See photos above for a visual aid.]", 
            "Heat oven or grill: Heat oven to 400 degrees, a gas grill to its highest setting or a charcoal grill to a very high temperature.  ", 
            "Par-boil artichokes: Bring a pot of salted water to a boil. Add trimmed artichokes and the halved lemon you’ve been using to prevent browning. Boil them for 5 minutes (for baby artichokes) or 10 to 15 minutes (for full-sized artichokes), until a knife point inserted into the neck of the artichoke pierces easily to the center. Drain artichokes well; discard lemon half.", 
            "If roasting artichokes: Drizzle roasting pan with olive oil, spread drained artichokes in a single layer, drizzle with a little additional olive oil and shower with coarse salt. Roast baby artichokes for 15 minutes, then flip, and roast for another 10 to 15 minutes, until crisp and browned. Roast full-sized artichokes for 20 to 25 minutes, then flip, and roast for another 15 to 20, also until crisp and browned.  ", 
            "If grilling artichokes: In a large bowl, toss drained artichokes with a glug or so of olive oil, enough that they all glisten. Season with salt. If the grill grates are close enough together, I use tongs to arrange the artichokes in one layer. If not, you might need to use a vegetable tray to keep the artichokes from falling through. Grill until artichokes are crisp and brown.", 
            "To serve: Shower with additional lemon juice (from second half of lemon), any extra salt (if needed) and parsley. Eat soon, or someone else will."
        ], 
        "date": "2015-06-02T12:00:46+00:00"
    }, 
    {
        "ingredient_list": [
            "2 of the largest, most globe-like artichokes you can find", 
            "2 lemons", 
            "A few cloves of garlic, smashed but left in their skins", 
            "One can of cranberry beans, rinsed and drained", 
            "A bundle of fresh arugula, washed and dried", 
            "2 to 3 tablespoons mayonnaise", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/gulping-beanfuls1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Arugula", 
            "Beans", 
            "Photo", 
            "Salad", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/04/gulping-beanfuls/", 
        "title": "artichoke, cranberry bean and arugula salad", 
        "directions": [
            "Prepare your artichokes: Peel the toughest, smallest and greenest outer leaves off and discard them. Once you reach the first of the yellow leaves, of moderate thickness, you’re good. Leaving half to one full inch of the yellow leaves attached to the stem, cut the remainder off in one clean cut. Now, start scooping, with a small paring knife and a small spoon (a grapefruit one works great here). You want to remove all of the spindly inner leaves as well as all off the furry choke, while creating a bowl shape, using those truncated yellow leaves as sides. Rub half a lemon over every cut surface, so it doesn’t brown. Be generous. Now, as carefully as you can, peel all of the dark green skin from the stem, again rubbing each cut surface with the halved lemon. Trim the stem down to one inch or less, making sure that it is flat and that when turned upside-down, the artichoke can balance on the surface, again coating the surface with lemon. Repeat this process for the second artichoke.", 
            "Bring a large pot of water to boil, adding a few glugs of plain vinegar, those garlic cloves and the lemons you’d used to coat the artichokes, first squeezing any remaining juice into the pot. If you have any old white wine, this is also an excellent flavor to impart in the artichokes. Boil the bowl-shaped artichoke hearts for about 25 to 35 minutes, or until they can be pierced easily with a fork. Drain them and set them aside. (These can be cooked a day or even two in advance, and reheated when you’re ready to make the salad.)", 
            "Make your dressing: Whisk your mayonnaise with the juice of one lemon. You want a thin dressing. Season it with salt and pepper.", 
            "Assemble your salad: Turn each artichoke upside-down on a plate so it stands on it’s truncated stem. Toss about 1/2 to 2/3 of a cup of beans with a spoonful or two of the dressing, and fill the artichoke cavity with them. Toss the arugula with more dressing, and arrange it over and around the artichoke. Season with more salt and pepper. Leave the extra dressing near you as you’ll probably want more for your artichoke heart. Eat with vigor."
        ], 
        "date": "2007-04-05T14:44:47+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons olive oil", 
            "1 small onion, finely chopped", 
            "1 pound mushrooms, trimmed, cleaned and chopped into small bits (I used creminis)", 
            "1 teaspoon kosher salt, plus 1 tablespoon for pasta water", 
            "1 cup dry Marsala wine", 
            "1 pound pasta, Giada recommends thimble-shaped pasta, ditalini, but I think I used snail-shaped or chiocciole", 
            "1/2 pound frozen artichoke hearts, thawed", 
            "3/4 cup grated Parmesan", 
            "1/2 cup cream", 
            "1/2 cup chopped fresh flat-leaf parsley", 
            "1 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-marsala-pasta-with-artichokes1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Italian", 
            "Mushrooms", 
            "Pasta", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/12/mushroom-marsala-pasta-with-artichokes/", 
        "title": "mushroom marsala pasta with artichokes", 
        "directions": [
            "Place the olive oil in a large, heavy skillet over medium-high heat. Add the onions and cook for one minute. Add the mushrooms and one teaspoon of the salt. Sauté, stirring occasionally, until all the moisture has evaporated and the mushrooms have cooked down, about 10 minutes (though this took me much less time). Add the Marsala and continue cooking until almost all the wine has evaporated, about 5 minutes.", 
            "Meanwhile, bring a large pot of water to a boil over high heat. Stir in remaining salt. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, about 8 to 10 minutes. Drain pasta and add it into the mushrooms, Marsala and onions Add the artichoke hearts, Parmesan and cream and cook until the artichokes are heated through, about 5 minutes. Stir in the parsley and pepper, then adjust seasonings to taste. Transfer to a serving bowl and serve. ", 
            "Update 12/30/13: I hadn’t made this and years and dusted it off tonight. Conclusion: I think I’d actually like this better with twice as many mushroom and no artichokes. I mentioned above that I thought it needed some lemon or acidity — actually, artichokes do. Mushrooms and marsala sauce are perfect together, after all. I’d rather save the artichokes for a more lemony pasta sauce."
        ], 
        "date": "2009-12-19T10:16:51+00:00"
    }, 
    {
        "ingredient_list": [
            "8 ounces regular whole-wheat thin spaghetti, vermicelli or angel hair", 
            "1 tablespoon extra-virgin olive oil", 
            "2 cloves garlic, minced", 
            "1/3 cup chopped flat-leaf parsley", 
            "1/4 cup pitted chopped Spanish or Greek olives", 
            "2 tablespoons capers", 
            "1 teaspoon anchovy paste", 
            "1 tablespoon fresh oregano leaves or 1 teaspoon dried", 
            "1/8 teaspoon crushed red pepper flakes", 
            "1 (14-ounce) can diced tomatoes", 
            "3/4 cup chopped fresh arugula", 
            "1/4 cup grated Parmesan", 
            "Artichoke prep:", 
            "3 to 4 artichokes", 
            "Glug of white wine", 
            "2 garlic cloves, smashed", 
            "Salt", 
            "2 lemons", 
            "Vinaigrette:", 
            "1 tablespoon olive oil", 
            "1 1/2 teaspoons sherry or champagne vinegar", 
            "Few drops of honey", 
            "1/2 teaspoon Dijon mustard", 
            "Pinch of truffle salt, or whichever salt you prefer", 
            "1 tiny head of radicchio", 
            "2 endives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pasta-puttanesca-broken-artichoke-hearts-salad1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Pasta", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/02/pasta-puttanesca-broken-artichoke-hearts-salad/", 
        "title": "pasta puttanesca, broken artichoke hearts salad", 
        "directions": [
            "Freshly ground black pepper, to taste", 
            "Carve out the artichoke hearts (the drama!): Halve one lemon. Remove all leaves from the artichokes, including the dark outer ones, the lighter yellow interior leave and the thorny purple/pink ones near the heart. Rub all exposed areas with a lemon half. Trim the stalk, cutting down the length of it to about one inch and shaving off any dark green nubs or imperfections–rub lemon on this too. Trim the dark green stumps the leaves have left behind, again, coat this with lemon. Using a paring knife or grapefruit spoon, remove the fuzzy choke completely, then squeeze some lemon juice over the heart. Save the mostly used-up lemon halves. [Becks & Posh have an excellent step-by-step tutorial on this process, with pictures, for those who want further instruction.]", 
            "Bring a small/medium saucepan 2/3 to boil with enough water to cover the artichokes, the glug of white wine, smashed garlic gloves, a couple pinches of salt and the not-discarded lemon halves you’d used in the first step. Once it is boiling, add the prepared artichoke hearts. Boil them for about 20 to 25 minutes, until they are tender. (The tip of a sharp knife should easily go through them.)", 
            "Drain the artichoke hearts and toss them with juice of the second lemon while they cool. Set them aside, briefly. Meanwhile, make your dressing in the bottom of your salad bowl, whisking all vinaigrette ingredients. Thinly slice your radicchio and endives and toss them with the vinaigrette. Lightly smash the artichoke hearts that have been set aside, and toss these in as well. Season with freshly ground black pepper to taste. "
        ], 
        "date": "2008-02-16T12:15:49+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup pine nuts or sliced almonds, toasted* and cooled", 
            "1 pound asparagus, rinsed", 
            "1 lemon, halved", 
            "Olive oil", 
            "Coarse salt", 
            "Freshly ground black pepper", 
            "1 to 2 ounces Parmesan cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/ribboned-asparagus-salad-with-lemon1.jpg?w=500", 
        "tags": [
            "Asparagus", 
            "Budget", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2011/05/ribboned-asparagus-salad-with-lemon/", 
        "title": "ribboned asparagus salad with lemon", 
        "directions": [
            "No need to snap off the tough ends of your asparagus. Lay a single stalk on its side on a cutting board. Holding onto the tough end, use a vegetable peeler (a Y-shaped peeler is easiest, but I’ve used a standard one successfully) to shave off thin asparagus ribbons from stalk to tip, peeling away from the tough end in your hand. [Updated] Discard the tough ends once you’re done peeling. Gently pile your ribbons on a medium-sized serving platter. Squeeze some lemon juice over the asparagus, drizzle it with a bit of olive oil and sprinkle it with salt and pepper. Toss gently and then use your peeler to shave curls of Parmesan right off the block, over the asparagus. Sprinkle with some toasted nuts. Repeat with remaining asparagus, a third of the remaining bundle at a time. Eat immediately.", 
            "* I toast mine in a single layer on a baking sheet at 350 for 5 to 10 minutes. It’s really important, especially with pine nuts, that you stay close and toss them frequently because they love to burn, but if you move them around a bit, you can get a wonderful, even coffee coffee color on them and an intensely nutty flavor. It makes even unfancy nuts taste amazing."
        ], 
        "date": "2011-05-02T14:41:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound asparagus, cleaned, not trimmed", 
            "2 ounces thinly sliced proscuitto (optional, see Note up top)", 
            "8 large eggs", 
            "2 tablespoons milk or cream", 
            "1/2 teaspoon kosher salt, plus more to taste", 
            "Freshly ground black pepper", 
            "2 scallions, thinly sliced on the diagonal", 
            "2 tablespoons olive oil", 
            "2 to 4 ounces soft goat cheese, crumbled (to taste)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/shaved-asparagus-frittata1.jpg?w=640", 
        "tags": [
            "Asparagus", 
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Spring", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/04/shaved-asparagus-frittata/", 
        "title": "shaved asparagus frittata", 
        "directions": [
            "Prepare the asparagus: No need to snap off the tough ends of your asparagus. Lay a single stalk on its side on a cutting board. Holding onto the tough end, use a vegetable peeler to peel ribbons away from the tough end (and your hand) right through the soft tip. Discard the tough ends once you’re done peeling. ", 
            "[As you get to the bottom of your stalk, you might find that the raised edge of your peeler is keeping the blade from shaving the asparagus as thin as you’d like. For this, I move the asparagus to the edge of the cutting board with the peeler blade half-off so you can get closer. Just be careful not to shave your cutting board. :) ]", 
            "Crisp the proscuitto: If you’re using the proscuitto, heat the 12-inch ovenproof skillet you’ll use for the final frittata over medium heat. Lay slices in a single layer (will need to do this in two batches) and cook them until lightly brown underneath and curling. Flip them for another 20 to 30 seconds then transfer them to paper towels to blot off the extra oil and cool. Repeat with remaining proscuitto. You’ll use the pan again in a minute.", 
            "Heat your broiler.", 
            "Vigorously beat your eggs with the milk or cream, plus salt and pepper until well-combined. Stir in scallions and crumble in crisp proscuitto, if using. Gently add asparagus peels, just swishing the egg mixture over them. ", 
            "Heat your skillet over medium heat and add 2 tablespoons olive oil. Let it heat fully, then swish it around so it goes up the sides of the pan. Pour in asparagus and egg mixture, nudging the asparagus around so it mostly stays level with the eggs. Crumble goat cheese over, to taste. Cook gently (lowering the heat to medium-low if needed) for about 5 minutes, until the edges are set and brown but it’s still loose and eggy on top. Transfer skillet to the broiler and cook for another 1 to 3 minutes, keeping a close eye on it, until eggs are set on top. ", 
            "Let cool for 5 minutes before cutting into wedges, or longer if you’d like to eat it at room temperature."
        ], 
        "date": "2016-04-27T11:32:21+00:00"
    }, 
    {
        "ingredient_list": [
            "1 recipe Really Simple Pizza Dough or your favorite pizza dough", 
            "1/2 pound asparagus", 
            "1/4 cup grated Parmesan", 
            "1/2 pound mozzarella, shredded or cut into small cubes", 
            "2 teaspoons olive oil", 
            "1/2 teaspoon coarse salt", 
            "Several grinds black pepper", 
            "1 scallion, thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/shaved-asparagus-pizza.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Photo", 
            "Pizza", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/05/shaved-asparagus-pizza/", 
        "title": "shaved asparagus pizza", 
        "directions": [
            "Preheat your oven to the hottest temperature it goes, or about 500 in most cases. If you use a pizza stone, have it in there.", 
            "Prepare asparagus: No need to snap off ends; they can be your “handles” as you peel the asparagus. Holding a single asparagus spear by its tough end, lay it flat on a cutting board and using a vegetable peeler (a Y-shaped peeler works best here, but I only had a standard, old and pretty dull peeler and it still worked; a mandolin would also work, in theory, but I found it more difficult to do it that way), create long shavings of asparagus by drawing the peeler from the base to the top of the stalk. Repeat with remaining stalks and don’t fret some pieces are unevenly thick (such as the end of the stalk, which might be too thin to peel); the mixed textures give a great character to the pizza. Discard tough ends. Toss peelings with olive oil, salt and pepper in a bowl and be sure to try one — I bet you can hardly believe how good raw asparagus can taste.", 
            "Assemble and bake pizza: Roll or stretch out your pizza dough to a 12-inch round. Either transfer to a floured or cornmeal-dusted pizza peel (if using a pizza stone in the oven) or to a floured or cornmeal-dusted tray to bake it on. Sprinkle pizza dough with Parmesan, then mozzarella. Pile asparagus on top. Bake pizza for 10 to 15 minutes, or until edges are browned, the cheese is bubbly and the asparagus might be lightly charred. Remove from the oven and immediately sprinkle with scallions, then slice and eat.", 
            "More ways to tweak this: Pinch of red pepper flakes (toss with asparagus), squeeze of lemon juice (over the asparagus, after you remove it from the oven), sprinkle of truffle salt or few drops of truffle oil (if you’ve got it; also at end) or up to 3 eggs (bake pizza for 8 minutes, break eggs on top, then finish cooking pizza and eggs together) ", 
            "Finally, if you’ve got a grill going, this pizza seems almost destined for it. When I grill pizza, I throw the whole dough down on an oiled grill and let it cook for a few minutes on the underside. I pull it off with tongs, flip it out onto a plate and pile the toppings on the grilled side, before sliding the raw side back onto the grill. Grill the pizza with the lid down for a few minutes, or until everything is bubbly and brown. "
        ], 
        "date": "2010-05-29T10:56:16+00:00"
    }, 
    {
        "ingredient_list": [
            "5 cups chicken broth (40 fl ounces)", 
            "1 cup water", 
            "1 pound thin to medium asparagus, trimmed and cut into 1/4 inch thick slices, leaving tips 1 1/2 inches long", 
            "1 tablespoon olive oil", 
            "1/2 stick (1/4 cup) unsalted butter", 
            "3/4 pound fresh shiitake mushrooms, stems discarded and caps cut into 1/4 inch thick slices", 
            "2 large fresh artichoke hearts, cut into 1/4 inch thick slices, prepared*", 
            "2 shallots, finely chopped", 
            "1 1/2 cups Arborio rice (10 ounces)", 
            "1/2 cup dry white wine", 
            "2 ounces finely grated Parmigiano-Reggiano (1 cup, though I used half) "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/someday-my-spring-will-come1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Asparagus", 
            "Easter", 
            "Grain/Rice", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/01/someday-my-spring-will-come/", 
        "title": "asparagus, artichoke and shiitake risotto", 
        "directions": [
            "Bring broth and water to a boil in a 4-quart pot. Add asparagus and cook, uncovered, until crisp-tender, 3 to 4 minutes. Transfer asparagus with a slotted spoon to a large bowl of ice and cold water to stop cooking, then drain and pat dry. Keep broth at a bare simmer, covered. ", 
            "Heat oil with 1 tablespoon butter in a 4-quart heavy saucepan over moderately high heat until foam subsides, then saute mushrooms, stirring occasionally, until browned, about 4 minutes. Season with salt and pepper, then transfer to a bowl. ", 
            "Cook onion in 2 tablespoons butter in saucepan over moderate heat, stirring, until softened, about 3 minutes. Add shallots and cook until softened, about 2 to 3 minutes, then add rice and cook, stirring, 1 minute. Add wine and cook, stirring, until absorbed, about 1 minute. ", 
            "Ladle in 1 cup simmering broth and cook at a strong simmer, stirring, until absorbed, about 2 minutes. Continue simmering and adding broth, about 1/2 cup at a time, stirring frequently and letting each addition be absorbed before adding next, until rice is just tender and looks creamy, 18 to 20 minutes. (Save leftover broth for thinning.) ", 
            "Remove from heat and stir in 1/2 cup cheese, remaining tablespoon butter, and salt and pepper to taste. Gently stir in asparagus, artichokes and mushrooms, then cover pan and let stand 1 minute. If desired, thin risotto with some of remaining broth. Serve immediately with remaining cheese on the side.", 
            "* My absolutely favorite artichoke heart preparation is to remove all the outer leaves, choke and stem of a whole artichoke, leaving just the heart. Cut the heart into 1/4 inch slices and toss it immediately in a bowl filled with the juice of one lemon. Make sure each and every edge, angle and side of the hearts gets coated in lemon juice, or they will brown very quickly. In a small pot, boil water with a good glug or two of white wine, a splash of white vinegar and if you’re feeling fancy, a smashed garlic clove and/or a bay leaf. Drop in the artichoke hearts with all of their lemon juice, and simmer them for about 10 minutes, or longer if needed for them to become tender. Drain and set them aside. "
        ], 
        "date": "2007-01-29T22:36:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound pancetta (a cured pork that is less salty than proscuitto, and not smoked like bacon), cut into 1/4-inch dice", 
            "1 pound Yukon gold potatoes, peeled and cut into a 1/2-inch dice", 
            "1 small yellow onion, chopped small", 
            "1/2 pound asparagus, tough ends trimmed and cut into 1-inch segments", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/spring-asparagus-pancetta-hash.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Spring", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/05/spring-asparagus-pancetta-hash/", 
        "title": "spring asparagus pancetta hash", 
        "directions": [
            "Serving ideas: Fried eggs, dabs of goat cheese and slivers of green onions", 
            "Heat a 12-inch cast iron frying pan over medium heat. Fry the pancetta, turning it frequently so that it browns and crisps on all sides; this takes about 10 minutes. Remove it with a slotted spoon and drain it on paper towels. Leave the heat on and the renderings in the pan. (With a well-seasoned cast iron, this should be all the fat you need to cook the remainder of the hash. If you’re not using a cast iron, you might need to add a tablespoon or so of oil; if you’ve skipped the pork, you’ll want to start with 2 tablespoons oil.)", 
            "Add the potatoes don’t move them for a couple minutes. Use this time to season them well with salt and pepper. Once they’ve gotten a little brown underneath, begin flipping and turning them, then letting them cook again for a few minutes. The idea is not to fight them off the frying pan, once they’ve gotten a little color, it’s easier to flip them and you’ve gotten closer to your goal of getting them evenly browned. ", 
            "When the potatoes are about three-fourths as crisped and brown as you’d like them — this takes about 15 minutes — add the onion. (I add this now, not earlier, because I find it often burns before the potatoes are done.) Cook for an additional 5 minutes. Add the asparagus, cover the pan and cook for 5 to 8 minutes, or until crisply cooked. (Skinny asparagus will take just 5 minutes; thicker asparagus will take longer.) Remove the lid, return the pancetta to the pan for another minute, to reheat. Taste for seasoning and adjust if needed. Serve immediately. "
        ], 
        "date": "2010-05-05T11:42:37+00:00"
    }, 
    {
        "ingredient_list": [
            "For the croutons:", 
            "1/4 cup olive oil", 
            "2 cloves garlic, finely chopped", 
            "6 cups day-old bread, crust removed, cubed", 
            "6 tablespoons finely grated Parmesan, plus more for garnish", 
            "Salt and freshly ground black pepper", 
            "For the vinaigrette:", 
            "Half a red onion, finely diced", 
            "2 to 2 1/2 tablespoons champagne or white wine vinegar", 
            "Juice of half a lemon", 
            "1/4 cup olive oil", 
            "1/2 teaspoon Dijon mustard", 
            "For the salad:", 
            "4 large leeks", 
            "2 teaspoons salt", 
            "1 pound asparagus", 
            "1 19-ounce can of white beans, rinsed and drained or 1 1/2 cups cooked white beans"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/04/spring-panzanella.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Beans", 
            "Leeks", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spring", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/04/spring-panzanella/", 
        "title": "spring panzanella", 
        "directions": [
            "Preheat oven to 400°F.", 
            "Mix the bread cubes with the garlic, olive oil, parmesan, salt and pepper in a large bowl. Toss to coat well. Transfer bread to a baking sheet and sprinkle with salt and pepper. Bake stirring once or twice, until the croutons are crisp and lightly colored on the outside but still soft within, about 10 to 15 minutes. Set aside and let cool.", 
            "Mix the red onion with the vinegar and lemon juice in a small bowl and set aside for a few minutes before whisking in the remaining vinaigrette ingredients: olive oil and dijon. Set aside.", 
            "Cut off dark green tops of leeks and trim root ends. Halve each leek lengthwise to within 2 inches of root end. Rinse well under cold running water to wash away sand. Cover leeks with cold water in a 12-inch heavy skillet. Add salt and simmer leeks, uncovered, until tender, 15 to 20 minutes.", 
            "Without draining the cooking water (you will reuse it for the asparagus), transfer leeks to a bowl of ice and cold water to stop cooking, then pat the leeks dry with paper towels. Break off tough ends of asparagus and cook it in the boiling water until crisp-tender, no more than three minutes if they’re pencil-thin, more if your asparagus is thicker. Transfer it to another bowl of ice water, drain and pat it dry.", 
            "Cut the leeks and the asparagus each into one-inch segments–the leeks will be especially slippery and prone to separating; hold firm and use a sharp knife! Place pieces in a large bowl and mix in beans and cooled parmesan croutons. Pour vinaigrette over and toss well. Season with salt and pepper. "
        ], 
        "date": "2008-04-04T12:26:36+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds small new or fingerling potatoes (I used a mix of reds and yukon golds)", 
            "1 pound asparagus", 
            "1/4 pound sugar snap peas, green beans or other spring pea", 
            "4 small-to-medium radishes, thinly sliced", 
            "Pickled spring onions", 
            "3 spring onions (about 6 ounces)", 
            "1/4 cup white wine vinegar", 
            "1/4 cup water", 
            "1 tablespoon kosher salt (I use Diamond brand; use less if you’re using Morton or table salt)", 
            "1 1/2 teaspoons sugar", 
            "Sharp mustard vinaigrette", 
            "1/4 cup olive oil", 
            "2 tablespoons whole grain mustard (both Roland and Maille make a whole seed one I’m tremendously fond of)", 
            "2 teaspoons smooth Dijon mustard", 
            "2 tablespoons white wine vinegar", 
            "Salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/spring-salad-with-new-potatoes.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Peas", 
            "Photo", 
            "Potatoes", 
            "Radishes", 
            "Salad", 
            "Spring", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/05/spring-salad-with-new-potatoes/", 
        "title": "spring salad with new potatoes", 
        "directions": [
            "Place potatoes in a medium saucepan and cover with one inch of water. Bring to a boil and cook for about 15 minutes, or until the tip of a knife easily pierces through a potato. Drain the potatoes and let them cool until they’re almost room temperature. You can hasten this by covering them with cold water, and replacing the water a few times as it warms up.", 
            "Meanwhile, pickle your spring onions. Whisk vinegar, water, salt and sugar together in the bottom of a small container with a lid until the salt and sugar dissolve. Slice the bulbs and paler green parts into very thin coins and submerge them in the vinegar mixture. Cover and put in fridge until you’re ready to use them; if you can put them aside for an hour or even overnight, even better. Reserve the onion greens.", 
            "Refill the saucepan you used for the potatoes (here’s to fewer dishes!) with salted water and bring it to a boil. Prepare an ice bath, a large bowl with ice and water in it. Trim the tough ends off the asparagus. Once the water is boiling, add the asparagus. One minute later, add the sugar snap peas. Two minutes later, drain both together then dump them in the ice bath until chilled. Drain the vegetables and spread them out on towel to absorb excess water.", 
            "Slice the cooked asparagus spears and sugar snaps into 1/2-inch segments and place them in a large bowl. Chop potatoes into moderate-sized chunks and add them to the bowl. Cut the radishes as thinly as possible, with a mandoline if you have one. If they’re especially big (mine were), you can first quarter them lengthwise. Cut some of the reserved onion greens into thin slivers (no need to use all of them, as the onion flavor might take over) and add them to the bowl.", 
            "When you’re ready to serve the salad, or an hour or two in advance, whisk the dressing ingredients and toss it with the vegetables, to taste. (You may find you don’t want to use all of it.) Stir in as many pickled onion coins as you please, save the rest for anything and everything. Season with salt and freshly ground black pepper, to taste. Eat and enjoy!.", 
            "Do ahead: Pickles can be started in the day or days before. Potatoes can be boiled and chilled in fridge overnight, as can other vegetables. Vinaigrette can be made in advance as well, but I might wait until the last minute to toss it with the vegetables as the vinegar, over a long sitting time, can ever-so-slightly discolor the cut edges of the asparagus and beans."
        ], 
        "date": "2011-05-30T10:20:17+00:00"
    }, 
    {
        "ingredient_list": [
            "Potstickers", 
            "3 to 3 1/4 cups chopped spring vegetables (such as asparagus, favas, peas, lima beans or more) (I used 2 1/4 cups chopped asparagus from 12 ounces stalks plus 1 cup cooked favas from about 1 pound fresh in their pods)", 
            "1 tablespoon neutral cooking oil, such as safflower, canola or peanut", 
            "3/4 cup thinly sliced scallions (from about 3/4 of a bundle, about 3 ounces)", 
            "1 tablespoon minced ginger", 
            "1 clove garlic, peeled minced (if using garlic chives, omit)", 
            "1 cup (about 6 ounces) firm tofu, chopped small (see Note up top for alternative)", 
            "1/2 cup garlic or regular chives", 
            "1 teaspoon toasted sesame oil", 
            "1/4 teaspoon kosher salt, or more to taste", 
            "To assemble", 
            "1 tablespoon cornstarch", 
            "1/2 cup water", 
            "50 round dumpling wrappers (most packages contain 50)", 
            "Scallion dipping sauce", 
            "2 to 3 scallions (or, remainder of bundle used for potstickers), thinly sliced (use some in sauce, some for garnish)", 
            "1/4 cup rice vinegar", 
            "1/4 cup soy sauce", 
            "1 tablespoon regular or spicy toasted sesame oil ", 
            "To cook", 
            "1 to 2 tablespoons neutral cooking oil", 
            "1/4 to 1/2 cup water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/spring-vegetables-potstickers.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Dumplings", 
            "Peas", 
            "Photo", 
            "Spring", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/05/spring-vegetable-potstickers/", 
        "title": "spring vegetable potstickers", 
        "directions": [
            "Prepare vegetables: If using asparagus, cut off tough ends and sliced stalks into 1/2-inch segments. If using fava, remove them from their pods. Boil favas for 3 minutes, then drain, and press them out of their opaque skins (if difficult, first make a small slit on one end with a paring knife). To prepare peas, simply remove them from their pods. To prepare lima beans, remove them from their pods and simmer them for about 5 minutes to soften.  ", 
            "Make filling: Heat a wok or large saute pan over medium heat. Add a tablespoon of oil and heat, then add scallions, ginger and garlic, if using. Cook for one minute, then add vegetables in the order of the time they need to cook until crisp-tender. Asparagus will need about 4 minutes, peas about 2 to 3, and favas and limas will already be tender, so just a minute to warm them. Add tofu and chives and cook just until chives wilt, about 1 minute more. Season with salt and transfer to a fine-mesh colander, to drain off any excess liquid. Let cool in colander for 15 minutes. ", 
            "If mixture is still on the chunky side, either chop it finely on a cutting board or pulse it a few times in a food processor. You don’t want to puree it; bits of vegetable should still be recognizable, but it will be easier to mound in dumplings if chopped well. Adjust seasonings if needed and mix with sesame oil.", 
            "Assemble potstickers: Line two baking sheets with parchment paper or very lightly oil them. Mix cornstarch and water in a small bowl; this will act as your “glue.” Most dumpling wrappers come dusted with a little starch, so you’ll be okay if you want to skip the cornstarch, but I always feel safer having a little extra as an insurance plan.", 
            "Remove first wrapper from package and put it on a plate; place a damp towel or piece of plastic wrap over the unused ones to keep them from drying out. Brush wrapper with cornstarch-water mixture. Mound 1 to 2 teaspoons filling in the center. Fold the wrapper in half over the filling, sealing the center edge shut. Make a few small pleats down each sides to seal in the rest of the filling, while trying to press out as much air as possible (a process that looks difficult but is so easy, I think you’ll find it intuitive — use the photos in the post as guidance). Rest the dumpling, pleats up, on prepared tray and repeat with remaining wrappers and filling. When you’re all done, look over your potstickers; use the cornstarch mixture and pinching to seal any open sides or loosened pleats.", 
            "You can now freeze the dumplings on their trays, then transfer them to a freezer bag once they will no longer stick together, or cook them right away.", 
            "Make dipping sauce: Mix ingredients and adjust levels to taste. For a sweeter sauce, add a 1/2 teaspoon honey or brown sugar.", 
            "Cook potstickers: Heat a large skillet (I really like to use a nonstick here) over medium-high heat. Once hot, add the oil and heat this too. Once the oil is hot, arrange potstickers in a single layer and cook until browned at the bottom. This will take about 1 minute for fresh ones and up to 5 minutes for frozen ones. Add water; it will hiss and sputter, so move quickly. You’ll want the smaller amount of water for a smaller batch and the larger if you’re cooking more. Put a lid on the pot and cook dumplings for 2 to 3 minutes more (plus an additional minute if your dumplings were frozen to begin with). Remove lid and simmer until any remaining water has cooked off. ", 
            "Transfer to serving plate; garnish with scallion greens. Serve with dipping sauce."
        ], 
        "date": "2013-05-01T11:21:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound very large (16 to 20 per pound) shrimp, peeled, de-veined, and rinsed, shells reserved", 
            "1 teaspoon salt", 
            "1 cup dry white wine", 
            "4 peppercorns", 
            "5 coriander seeds", 
            "1/2 bay leaf", 
            "5 sprigs fresh parsley", 
            "1 sprig fresh tarragon", 
            "1teaspoon juice from 1 small lemon", 
            "1 cup ketchup", 
            "2 1/2 teaspoons prepared horseradish (I believed we used slightly more)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "1 teaspoon ancho or other mild chili powder", 
            "Pinch cayenne pepper", 
            "1 tablespoon juice from 1 small lemon", 
            "3 tablespoons good olive oil", 
            "1 small French bread or boule, cut into 1-inch cubes (6 cups)", 
            "1 teaspoon kosher salt", 
            "2 large ripe tomatoes, cut into 1-inch cubes", 
            "1 hothouse cucumber, unpeeled, seeded, and sliced 1/2 inch thick", 
            "1 red bell pepper, seeded and cut into 1-inch cubes", 
            "1 yellow bell pepper, seeded and cut into 1-inch cubes", 
            "1/2 red onion, cut in half and thinly sliced", 
            "20 large basil leaves, coarsely chopped", 
            "3 tablespoons capers, drained", 
            "1 lemon", 
            "4 small\tartichokes", 
            "2/3 cup\theavy cream", 
            "1 teaspoon garlic, finely chopped (about 1 medium clove)", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon ground white pepper", 
            "2 tablespoons olive oil", 
            "6 medium Yukon Gold potatoes", 
            "4 ounces Asiago cheese, grated (I used cave-aged Gruyere, because it’s my favorite)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/when-the-stars-make-you-drool1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Artichokes", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Seafood", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2006/11/when-the-stars-make-you-drool/", 
        "title": "shrimp cocktail + artichoke-potato gratin", 
        "directions": [
            "1.\tBring reserved shells, 3 cups water and salt to boil in medium saucepan over medium-high head; reduced heat to low; cover, and simmer until fragrant, about 20 minutes. Strain stock through sieve, pressing on shells to extract all liquid.", 
            "2.\tBring stock and remaining ingredients except shrimp to boil in 3- or 4-quart saucepan over high heat; boil 2 minutes. Turn off heat and stir in shrimp; cover and let stand until firm and pink, 8 to 10 minutes. Drain shrimp, reserving stock for another use. Plunge shrimp into ice water to stop coking, then draining again. Serve shrimp chilled with cocktail sauce.", 
            "1. Heat the oil in a large saute pan. Add the bread and salt; cook over low to medium heat, tossing frequently, for 10 minutes, or until nicely browned. Add more oil as needed.", 
            "2. For the vinaigrette, whisk together the ingredients.", 
            "3. In a large bowl, mix the tomatoes, cucumber, red pepper, yellow pepper, red onion, basil, and capers. Add the bread cubes and toss with the vinaigrette. Season liberally with salt and pepper.", 
            "4. Serve immediately, or allow the salad to sit for about half an hour for the flavors to blend."
        ], 
        "date": "2006-11-06T17:25:43+00:00"
    }
]