{
  "date": "2007-05-21T12:37:19+00:00",
  "directions": [
    "Prepare pork:  Cut pork along the grain into long 1 1/2- to 2-inch-wide strips. Remove and discard any sinew but do not trim fat. Transfer pork to a large sealable plastic bag. Stir together remaining pork ingredients in a small bowl until combined well. Add to pork and turn to coat, then squeeze bag to eliminate as much air as possible and seal. Marinate pork, chilled, at least 4 hours but no longer than 24.",
    "Roast pork: Put oven rack in lower third of oven and preheat oven to 375°F. Put 1/2 inch water in a 13- by 9-inch roasting pan and place a metal rack across top of pan (rack should not touch water). ",
    "Remove pork from marinade, reserving marinade, and arrange pork strips 1 inch apart on rack. Roast in oven 15 minutes.",
    "Meanwhile, bring marinade to a boil in a 1-quart saucepan, then boil 1 minute (marinade may look curdled). Remove from heat.",
    "Brush both sides of pork with some marinade and roast 10 minutes more. Generously brush both sides of pork with marinade again and roast, basting 2 or 3 times, 10 minutes more. I recommend brushing it as many times as it takes to use the marinade up; you won’t regret it.",
    "Increase oven temperature to 400°F and roast pork until strips are mahogany-colored and caramelized on edges, 10 to 15 minutes more (pork shoulder will need the most time, tenderloin the least; totally cooking time will be about 50 minutes). Transfer to a cutting board and let stand, loosely covered with foil, 10 minutes.",
    "Make dressing while pork roasts:  Blend together all dressing ingredients in a blender until smooth. (See Note below about an alternate dressing.)",
    "Cook noodles and beans while pork finishes roasting: Soak noodles in cold water to cover until pliable, about 15 minutes, then drain in a colander. Cut noodles in half with kitchen shears.",
    "Cook beans in a 5- to 6-quart pot of boiling salted water, uncovered, until crisp-tender, 4 to 5 minutes. Transfer with a skimmer or slotted spoon to a large bowl of ice and cold water to stop cooking, reserving cooking liquid in pot. Drain beans and pat dry.",
    "Return bean-cooking liquid to a boil, then cook noodles, uncovered, stirring occasionally, until just tender, about 2 minutes. Drain noodles in colander and rinse under cold water to stop cooking. Drain noodles again, then spread out on paper towels and pat dry.",
    "Assemble salad:  Cut as much pork as desired for salad across the grain into 1/4-inch-thick slices. Toss noodles with 1/4 cup dressing in a bowl. Toss long beans with 2 tablespoons dressing in another bowl. Arrange pork, noodles, beans, and remaining salad ingredients on a large platter. Drizzle with some of dressing and serve remaining dressing on the side.",
    "Many notes (Updated 1/10/14):"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/05/cellophane-noodle-salad-with-roast-pork.jpg?w=753",
  "ingredient_list": [
    "For pork",
    "1 pound solid piece boneless pork butt (shoulder) or pork tenderloin",
    "1/4 cup hoisin sauce",
    "1/4 cup soy sauce (low-sodium is best here)",
    "1/4 cup Chinese rice wine or sake",
    "1 tablespoon finely chopped peeled fresh ginger",
    "1 teaspoon finely chopped garlic",
    "1/2 teaspoon salt (see Note below)",
    "For dressing",
    "3/4 cup seasoned rice vinegar",
    "1/2 cup peanut or vegetable oil**",
    "3 tablespoons fresh lime juice",
    "3 tablespoons finely grated peeled fresh ginger",
    "1 large fresh jalapeno chile, seeded and minced",
    "For salad",
    "8 oz very thin bean-thread noodles (also known as cellophane, glass, or mung bean noodles)",
    "3/4 lb Chinese long beans (1 bunch) or green beans, trimmed and cut into 3-inch pieces",
    "1 seedless cucumber (usually plastic-wrapped; about 1 lb), halved lengthwise and sliced diagonally 1/8 inch thick",
    "1 bunch scallions, cut into matchsticks",
    "1 firm-ripe mango, peeled, pitted, and thinly sliced",
    "2 thin carrots, cut into 1/8-inch-thick matchsticks",
    "1/2 cup loosely packed fresh cilantro leaves",
    "1/2 cup loosely packed fresh mint leaves",
    "1/2 cup loosely packed fresh small basil leaves "
  ],
  "tags": [
    "Date Night",
    "Meat",
    "Photo",
    "Salad",
    "Vietnamese"
  ],
  "title": "cellophane noodle salad with roast pork",
  "url": "https://smittenkitchen.com/2007/05/deb-1-mandoline-0/"
}