{
  "date": "2012-03-29T09:20:53+00:00",
  "directions": [
    "Preheat oven to 325°F. Line two large baking sheets with parchment paper.",
    "In a food processor, blend the coconut for a minute. Add sugar, blend another minute. Add egg whites, salt and almond extract and blend for another minute. Add raspberries and pulse machine on and off in short bursts until they are largely, but not fully, broken down. (I counted 13 pulses. I might have been a little obsessive, what with the counting.) Some visible flecks of raspberry here and there are great. When you open the machine, you’ll see some parts of the batter that are still fully white while others are fully pink. Resist stirring them together.",
    "With a tablespoon measure or cookie scoop (I used a #70), scoop batter into 1-inch mounds. You can arrange the cookies fairly close together as they don’t spread, just puff a bit. Scooping a little of the pink batter and a little of the white batter together makes them look extra marble-y and pretty.",
    "Bake cookies for 25 to 30 minutes, until they look a little toasted on top. Let them rest on the tray for 10 minutes after baking (or you can let them fully cool in place, if you’re not in a rush to use the tray again), as they’ll be hard to move right out of the oven. They’ll firm up as they cool, but still remain softer and less dry inside than traditional macaroons. Thank goodness."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/03/raspberry-coconut-macaroons.jpg?w=750",
  "ingredient_list": [
    "14 ounces (400 grams) sweetened, flaked coconut",
    "2/3 cup (130 grams) granulated sugar",
    "3 large egg whites",
    "Heaped 1/4 teaspoon flaked sea salt or level 1/4 teaspoon table salt",
    "1/2 teaspoon almond extract",
    "1/2 pint (6 ounces, 170 grams or 1 1/4 cups) fresh raspberries (if washed, patted very dry)"
  ],
  "tags": [
    "Coconut",
    "Cookie",
    "Easter",
    "Gluten-Free",
    "Passover",
    "Photo",
    "Raspberries"
  ],
  "title": "raspberry coconut macaroons",
  "url": "https://smittenkitchen.com/2012/03/raspberry-coconut-macaroons/"
}