[
    {
        "ingredient_list": [
            "Almond macaroons", 
            "Nonstick vegetable oil spray", 
            "2 1/2 cups (10.5 ounces or 300 grams) slivered almonds (or an equivalent weight of blanched, sliced or already ground almonds)", 
            "1 cup (196 grams) plus 3 tablespoons (37 grams) sugar", 
            "2 large pinches kosher salt", 
            "2 teaspoons vanilla extract or 1 vanilla bean, split lengthwise", 
            "6 large egg whites", 
            "Frosting and assembly", 
            "1/2 cup water", 
            "1/2 cup sugar", 
            "Flavoring of your choice, such as 1/2 teaspoon orange oil or extract, 1/2 teaspoon vanilla, almond or other extract", 
            "20 ounces semi-sweet chocolate (61% or less is recommended, I think it would also be great with 72%, a nice bitter contrast to the sweet macaroons), chopped or chocolate chips", 
            "1 cup sliced almonds, toasted (at 350 degrees for 7 to 9 minutes on a tray, stirring once or twice)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/almond-macaroon-torte-with-chocolate-frosting1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Gluten-Free", 
            "Passover", 
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2010/03/almond-macaroon-torte-with-chocolate-frosting/", 
        "title": "almond macaroon torte with chocolate frosting", 
        "directions": [
            "Make macaroons: Position an oven rack in the top and lower third of oven and preheat oven to 325°F. Draw two 12 x 4-inch rectangles, spacing 2 inches apart [see Note below for my tiny kitchen adjustments] on a piece of parchment paper, then two more of the same size on a second sheet. In total, you’ll use 2 sheets of parchment paper and draw 4 rectangles. Turn each sheet of parchment over (so your ink or pencil lines don’t seep into the macaroon) and spray with nonstick spray [but first see Note below about the necessity of this] .", 
            "Place almonds, 1 cup sugar and coarse salt in a food processor (you can skip the food processor, however, if you use an equivalent weight of almond meal or ground almonds, just mixing the ingredients in a bowl) with vanilla bean seeds, if using (you’ll add liquid extract in a bit) and blend until finely ground.", 
            "Using electric mixer, beat egg whites in large, dry bowl with clean beaters (or a whisk attachment) until soft peaks form. Drizzle in vanilla extract (if using), then slowly add remaining 3 tablespoons sugar. Beat until stiff but not dry. Fold nut mixture into egg whites. Spread 1/4 of macaroon batter evenly within each rectangle, filling completely.", 
            "Bake macaroon layers until golden and almost firm to the touch in the center, reversing sheets halfway through — this took a total of 23 measly minutes in my oven; the original recipe says it can take up to 40. I would check in on yours at 23 minutes and then every 5 minutes thereafter if they’re not done yet.", 
            "Cool macaroons on their sheets on a cooling rack.", 
            "Make frosting: Simmer 1/2 cup of water and sugar in a medium saucepan until sugar dissolves. Measure 10 tablespoons from this and either discard the rest of save it for another use. Put the 10 tablespoons syrup back in the saucepan and add flavoring of your choice. Bring the syrup back to a boil and add chocolate to the saucepan. Remove from heat and let sit for one minute, then stir the chocolate until smooth. This should yield a medium-thick frosting, good for spreading. If yours is on the thin side, you can let it cool for 5 or 10 minutes until it is a good spreading consistency.", 
            "Assemble torte If needed due to spreading, carefully trim your macaroon layers back to their intended rectangular sizes — for me, a sharp knife lightly coated with oil worked best for this.", 
            "Place one macaroon layer on a long platter. (If you’re a follower of my layer cake tips, you’ll already know that slipping little pieces of parchment or waxed paper under the edges will help keep your platter clean; you pull them out when you’re done frosting the torte.) Spread 1/2 cup frosting evenly over. Top with another macaroon layer. Spread 1/2 cup frosting evenly over. Repeat 1 more time then top with last macaroon layer, flat side up (whoops, didn’t do this). Spread remaining frosting over top and sides of torte. Press sliced almonds onto sides of torte.", 
            "Do ahead: Can be made one to two days ahead. Cover with foil tent. Store at room temperature.", 
            "Tiny kitchen/tiny tray tweak:  If you’re curious as to why mine may look a little smaller or taller than yours, I had to make my rectangles a little smaller — 11 x 3.75-inch — to work within the tiny baking sheets that fit in my tiny oven.  I flipped them over so they didn’t bump into the walls of the tray, but this proved unfortunate when mine spread down the sides! I (of course) don’t recommend the tray flipping.", 
            "About that spray oil: As I mentioned in the post above, this step vexes me. I’ve always made macaroons and meringues on sheets of parchment paper that were not sprayed or grease, the nonstick properties of parchment were enough to release the cookies. But this recipe has you use nonstick spray on them, which encourages your neat rectangles of macaroon to slide and spread. This is not ideal. I hope to update this step soon with a note about whether you can get by without the spray oil, using plain parchment. Fortunately, any spreading can be trimmed but more ideal would, of course, be no spreading at all. Update: At least one commenter (thank you Kate!) made these without oiling the parchment, found that the macaroons spread less and had no trouble removing the macaroons from the parchment. "
        ], 
        "date": "2010-03-29T12:15:41+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/big-crumbs-and-small-pretzels-in-oklahoma1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2009/04/big-crumbs-and-small-pretzels-in-oklahoma/", 
        "title": "big crumbs + small pretzels in oklahoma", 
        "directions": [], 
        "date": "2009-04-26T19:38:52+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/06/bowties-with-sugar-snaps-lemon-and-ricotta.jpg?w=750", 
        "tags": [
            "Pasta", 
            "Peas", 
            "Photo", 
            "Spring", 
            "Travel", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/06/bowties-with-sugar-snaps-lemon-and-ricotta/", 
        "title": "bowties with sugar snaps, lemon and ricotta", 
        "directions": [
            "Bring a large pot of well-salted water to boil. While waiting, string sugar snaps and cut into 1/2-inch segments. Cook bowties for two minutes less than the suggested cooking time on the package, then add sugar snaps to pasta. Cook for one minute more. Reserve one cup pasta cooking water, then drain sugar snaps and bowties. Add them back to the empty pot with 1/2 cup pasta cooking water, grated cheese, a glug of olive oil, salt and freshly ground black pepper. Cook on high for one minute, tossing constantly. Add a splash more cooking water if pasta looks too dry. Turn heat off, dollop ricotta all over in large spoonfuls and, without stirring, tip pasta mixture into a wide serving bowl. (I do this because I love the idea of finding slightly unmixed pockets of ricotta.) Drizzle pasta with a small amount of olive oil, then squeeze lemon juice over the whole dish, sprinkle with mint, and finish with an extra sprinkling of parmesan. Serve quickly; eat happily. ", 
            "(Lemon juice, rather rudely, discolors green vegetables so be sure to add this only right before serving, and when it will be eaten before anyone will care.)"
        ], 
        "date": "2013-06-14T09:37:15+00:00"
    }, 
    {
        "ingredient_list": [
            "Dipping sauce", 
            "6 tablespoons Asian fish sauce", 
            "6 tablespoons brown sugar", 
            "12 tablespoons lime juice", 
            "2 garlic cloves, finely grated or minced", 
            "Small Thai or Serrano chiles, thinly sliced, to taste ", 
            "Peanut dressing", 
            "3 tablespoons Asian fish sauce", 
            "3 tablespoons rice vinegar", 
            "9 tablespoons lime juice", 
            "3 tablespoons soy sauce", 
            "1 one-and-a-half inch chunk ginger, peeled and sliced", 
            "6 tablespoons natural unsalted peanut butter", 
            "1 tablespoon toasted sesame oil", 
            "Pinch of cayenne ", 
            "Chicken and noodle salad", 
            "1 1/4 pounds boneless skinless chicken thighs (about 6)", 
            "8 ounces dried rice vermicelli or other rice noodles", 
            "2 small cucumbers, cut in 1/4-inch half moons", 
            "2 medium carrots, cut in thin julienne", 
            "Additional vegetables, as suggested above", 
            "Small handful basil or mint or cilantro sprigs, or your favorite of the three (torn or roughly chopped)", 
            "4 or more scallions, slivered", 
            "1/4 cup crushed or chopped roasted peanuts", 
            "Lime wedges (to serve)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/06/cold-rice-noodles-with-peanut-lime-chicken.jpg?w=751", 
        "tags": [
            "Carrots", 
            "Chicken", 
            "Citrus", 
            "Cucumber", 
            "Pasta", 
            "Photo", 
            "Summer", 
            "Thai", 
            "Vietnamese"
        ], 
        "url": "https://smittenkitchen.com/2012/06/cold-rice-noodles-with-peanut-lime-chicken/", 
        "title": "cold rice noodles with peanut-lime chicken", 
        "directions": [
            "Make the dipping sauce: Whisk ingredients in a small serving bowl, making sure to dissolve the sugar. Leave to ripen for 15 minutes. Refrigerate any extra and use within a few days. ", 
            "Make the peanut dressing: In a blender or small food processor, puree all ingredients to a smooth sauce, about the thickness of heavy cream. Pour into a serving bowl. ", 
            "Marinate the chicken: Stir together 1/2 the dipping sauce and 1/3 the peanut dressing (you can eyeball this) in the bottom of a low-sided bowl or dish. Add the chicken to the mixture and toss to coat. Let marinate at least 15 minutes.", 
            "Cook the noodles: Bring a large pot of water to the boil, then turn off the heat. Add the rice vermicelli and soak for 7 to 8 minutes. (Package directions may vary; check for doneness by tasting.) Drain when noodles are al dente, and cool under running water. Fluff and leave in strainer to drain well.", 
            "Cook the chicken: Grill the chicken on an outdoor grill, a stove-top grill pan, or run under the broiler until nicely browned, about 3 to 4 minutes a side. Let cool slightly, then chop roughly into 3/4-inch pieces. ", 
            "To serve: At this point, you can place everything on a large serving platter, with piles or small bowls for noodles, vegetables, chicken, the dressing and marinade and toppings (peanuts, herbs) and let your family and friends put it together in their own bowls as they wish. Or, you can assemble it for everyone as suggested:", 
            "Toss vegetables with 1 tablespoon dipping sauce in a small bowl. Divide the cooked noodles among 4 to 6 bowls. Top each bowl equally with vegetable mixture and chopped chicken. Toss each bowl with 2 teaspoons of each the dipping sauce and dressing, or more to taste (we wanted more). Add the herbs, peanuts and scallions to each bowl and serve with additional dressing and dipping sauce on the side. "
        ], 
        "date": "2012-06-22T11:02:12+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/columbus-isle-bahamas1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2009/03/columbus-isle-bahamas/", 
        "title": "san salvador island, bahamas", 
        "directions": [], 
        "date": "2009-03-08T23:24:21+00:00"
    }, 
    {
        "ingredient_list": [
            "2 ears corn, husked", 
            "1 15-ounce can black beans, drained and rinsed", 
            "1 large poblano", 
            "Nonstick spray or 2 teaspoons oil", 
            "2 generous cups (about 8 ounces) coarsely grated monterey jack cheese", 
            "2 generous cups (about 8 ounces) coarsely grated cheddar cheese", 
            "1 12-ounce bag tortilla chips, the thicker the better", 
            "Thinly sliced jalapeno (1 used 1/2 a big one)", 
            "Thinly sliced radishes (I used 2 medium)", 
            "1/2 a white onion, minced (you can toss it with a little lime juice and salt to lightly pickle it, if desired)", 
            "Handful fresh cilantro, roughly chopped", 
            "Diced tomatoes", 
            "Shredded lettuce", 
            "Sliced avocado", 
            "Lime wedges", 
            "Hot sauce"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/06/corn-and-black-bean-weeknight-nachos1.jpg?w=750", 
        "tags": [
            "Corn", 
            "Peppers", 
            "Photo", 
            "Summer", 
            "Tex-Mex", 
            "Travel", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/06/corn-and-black-bean-weeknight-nachos/", 
        "title": "corn and black bean weeknight nachos", 
        "directions": [
            "\nOver a gas flame or on a grill over high heat, char corn all over until at least half the kernels are blistered, and poblano until skin is blackened. Let both cool slightly then cut the corn kernels from the cob. Remove the skin and seeds from the poblano and cut it into very thin ribbons. (For a large one, you might only use half.)\nHeat oven to 400 degrees. Coat your largest baking sheet with foil (which I did not, and wish I had) and lightly coat it with oil. Arrange 1/3 of chips on tray and sprinkle 1/3 of corn, black beans, poblano strips and cheese over it. Repeat twice. Bake for 15 to 20 minutes, until the cheese has melted and blistered all over. Use this time to prep your toppings.\nWhen nachos are cooked, you can sprinkle a few toppings over (I used the jalapeños, radishes, tomatoes, onion, cilantro and avocado) or just bring everything to the table and let everyone fix their own.\n"
        ], 
        "date": "2016-06-17T10:29:35+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups freshly-brewed espresso (from about 14 single shots or 7 doubles)", 
            "6 tablespoons granulated sugar", 
            "1 cup heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/06/9116514931_7fadc4ddd3_k.jpg?w=750", 
        "tags": [
            "Ice Cream/Sorbet", 
            "Italian", 
            "Photo", 
            "Summer", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2013/06/espresso-granita-with-whipped-cream/", 
        "title": "espresso granita with whipped cream", 
        "directions": [
            "When espresso is still hot, stir in sugar. Chill espresso in fridge until completely cold. This will immensely speed up the time it takes to freeze. Once cold, pour into a large, wide baking dish; I’d recommend something ceramic, glass or enameled over a metal-surfaced baking pan. If you’re me, clear your horribly overstuffed freezer of things that can survive outside of it for a few hours. Place dish in now-cleared freezer and freeze for one hour, then remove the mixture and scrape with two forks to break up the ice. (Your freezing time will vary, depending on the temperature and muscle of your freezer.) Return to the freezer and freeze until solid, about 2 to 3 hours, scraping it again with forks every 30 minutes or so.", 
            "To serve, whip cream to soft peaks; estimate 2 tablespoons unwhipped cream per serving so you don’t have to make too much at at ime. Place one spoonful in the bottom of a small glass. Scoop granita on top. Top with a much larger tuft of cream. Eat with a spoon on a hot day.  "
        ], 
        "date": "2013-06-24T11:09:48+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/forgiving-eggplants-tresspasses1.jpg?w=500", 
        "tags": [
            "Eggplant", 
            "Photo", 
            "Thai", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2006/07/forgiving-eggplants-tresspasses/", 
        "title": "thai vegetable and smoky eggplant salad", 
        "directions": [], 
        "date": "2006-07-15T23:51:41+00:00"
    }, 
    {
        "ingredient_list": [
            "Eggs", 
            "2 large eggs, at room temperature", 
            "Enough vegetable oil to reach a depth of 1/4-inch", 
            "Salad", 
            "1 cup lightly-packed torn green leaf lettuce (approximately 2-inch pieces)", 
            "1/4 cup thinly sliced yellow onion", 
            "1/4 cup thin or julienned carrot strips", 
            "1/4 cup coarsely chopped celery, Chinese or other, include leaves", 
            "1/4 cup lightly packed coarsely chopped cilantro, thin stems and leaves", 
            "Dressing", 
            "1 1/2 tablespoons lime juice (Key limes are recommended, but don’t fuss if you can’t find them)", 
            "1 1/2 tablespoons palm sugar simple syrup [see Note up top] or 1 tablespoon water + 1 teaspoon dark brown sugar", 
            "1 tablespoon Thai fish sauce", 
            "1 1/2 teaspoons (1 large clove) very thinly sliced garlic", 
            "2 fresh Thai chiles, preferably green, thinly sliced (more or less to taste)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/fried-egg-salad1.jpg?w=750", 
        "tags": [
            "Budget", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2015/01/fried-egg-salad/", 
        "title": "fried egg salad", 
        "directions": [
            "Fry eggs: Heat a wok or small skillet over the highest heat. Once hot, add enough oil to reach a depth of a generous 1/4-inch. Once the oil is hot enough to smoke, carefully crack the eggs into the oil — cautiously, as they will splatter a lot — and decrease the heat to medium-high. The eggs will hiss, sputter and the whites should puff and develop translucent bubbles. Once they’re very crispy and a deep golden brown underneath, 45 seconds to 1 minute, use a thin spatula to flip the eggs, trying not to break the yolks but not fretting if it happens. Cook for another minute on the second side, until the yolks are set but still slightly molten (aim to have them a little less loose than mine, shown above). Transfer eggs to paper towels; you can cook them up to 15 minutes before serving. Discard oil and wipe out wok or skillet.", 
            "Assemble salad: Place all salad ingredients in a large bowl. Quarter the eggs through the yolks and add them to the salad.", 
            "Make the dressing: Place the lime juice, palm syrup or dark brown sugar and water, fish sauce, garlic and chiles in the same wok or skillet. Set it over medium heat and heat the mixture until it just begins to sizzle at the edges, less than 30 seconds. ", 
            "Finish and serve: Pour the hot dressing over the salad and eggs. Stir gently to combine. If you’re feeling fancy, transfer the salad, liquid at all, to a plate in a low heap. Eat at once."
        ], 
        "date": "2015-01-22T12:04:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup well-shaken buttermilk", 
            "1/2 cup mayonnaise", 
            "1 tablespoon fresh lemon juice", 
            "1/4 teaspoon Worcestershire sauce", 
            "1 small garlic clove, minced", 
            "1/4 teaspoon salt", 
            "1/8 teaspoon black pepper", 
            "2 ounces crumbled firm blue cheese (1/2 cup)", 
            "2 tablespoons finely chopped fresh chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/from-aruba-on-an-iceberg-wedge1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Salad", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/12/from-aruba-on-an-iceberg-wedge/", 
        "title": "aruba + a blue cheese iceberg wedge", 
        "directions": [
            "Blend buttermilk, mayonnaise, lemon juice, Worcestershire sauce, garlic, salt and pepper in a food processor until smooth. Add blue cheese and pulse until cheese is incorporated but dressing is still slightly chunky. Transfer to a bowl and stir in chives. ", 
            "Do ahead: Keeps, covered and chilled, for one week, though we’ve yet to test that theory."
        ], 
        "date": "2007-12-24T12:19:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup ketchup", 
            "1 tablespoon prepared horseradish", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "1 teaspoon ancho or other mild chili powder", 
            "Pinch cayenne pepper", 
            "1 tablespoon juice from 1 small lemon (we use more)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/3564906953_91d36a4607_o.jpg?w=753", 
        "tags": [
            "Grilling", 
            "Photo", 
            "Seafood", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2009/05/grilled-shrimp-cocktail/", 
        "title": "grilled shrimp cocktail", 
        "directions": [
            "Stir all ingredients together in a small bowl; adjust seasonings as necessary. Cocktail sauce keeps for up to two weeks in the fridge.", 
            "To Grill Your Shrimp Peel and devein shrimp, leaving the tails attached. Toss the shrimp in a large bowl with a generous amount of olive oil, salt and fresh pepper. Grill them for just a minute or two on each side — threading them first on skewers that you’ve soaked in water makes this even easier — being careful not to overcook them. You can squeeze some lemon juice on when you’re done, for an extra hit of flavor. Serve with cocktail sauce.", 
            "To Poach Your Shrimp: Peel and devein shrimp, leaving the tails attached. Bring shrimp stock (you can make this by boiling the shrimp shells for 20 minutes in three cups of water with a tablespoon of salt and straining the liquid) or water to a boil. Additionally, you might add some lemon peels, several glugs of white wine, peppercorns, a bay leaf or tarragon to the boiling liquid for extra flavor. Turn off heat and stir in shrimp; cover and let stand until firm and pink, 8 to 10 minutes. Drain shrimp. Plunge shrimp into ice water to stop cooking, then drain again. Serve shrimp chilled with cocktail sauce."
        ], 
        "date": "2009-05-26T15:07:38+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (85 grams) slivered almonds", 
            "1 large handful fresh basil leaves", 
            "1 to 2 large garlic cloves", 
            "Several sprinkles of sea salt", 
            "6 ripe plum tomatoes, quartered", 
            "1/2 cup (50 grams) grated Pecorino or Parmesan", 
            "1/4 to 1/3 cup (60 to 80 ml) olive oil", 
            "1 pound (455 grams) linguine"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/linguine-with-tomato-almond-pesto1.jpg?w=500", 
        "tags": [
            "Italian", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Tomatoes", 
            "Travel", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/09/linguine-with-tomato-almond-pesto/", 
        "title": "linguine with tomato-almond pesto", 
        "directions": [
            "In a large skillet, sauté the almonds in a little olive oil until toasted. Let cool, then blend them in a food processor or blender until they are in coarse pieces.  (“The size of orzo,” the original recipe suggests.) Scoop them out of the processor and set them aside.", 
            "Put the basil, garlic and a few pinches of sea salt into the food processor and chop. Add the almonds back to the food processor (keeping them separate will keep them from getting too finely chopped as you get the basil and garlic to the right texture) with the tomatoes, cheese and olive oil and whirl briefly. Season it with freshly ground black pepper.", 
            "Cook your linguine until it is al dente and could use another minute of cooking time. Reserve one cup of pasta cooking water and drain the rest. Immediately toss the hot linguine with the pesto and mix quickly so that it drinks the sauce up a bit. Add more pasta water if needed. Serve this lukewarm, or at room temperature, with a glass of wine, after you get the baby to bed."
        ], 
        "date": "2010-09-14T11:07:16+00:00"
    }, 
    {
        "ingredient_list": [
            "2 mangoes, peeled, pitted and julienned", 
            "1 to 1 1/4 pounds Napa cabbage, halved and sliced very thinly", 
            "1 red pepper, julienned", 
            "1/2 red onion, thinly sliced", 
            "6 tablespoons of fresh lime juice, from about two limes", 
            "1/4 cup rice vinegar", 
            "2 tablespoons oil of your choice", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon red pepper flakes, or to taste (or omit this and whisk in a chile paste to taste)", 
            "1/4 cup thinly sliced fresh mint leaves", 
            "1/4 cup toasted cashews, coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/mango-slaw-with-cashews-and-mint.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Mango", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2010/07/mango-slaw-with-cashews-and-mint/", 
        "title": "mango slaw with cashews and mint", 
        "directions": [
            "Toss mangoes, cabbage, pepper and onion in a large bowl. Whisk lime juice, vinegar, oil, salt and red pepper in a smaller bowl and pour over slaw. You can either serve this immediately or leave the flavors to muddle for an hour in the fridge. Before serving, toss with mint leaves and sprinkle with cashews.", 
            "About your mango: This salad will work with almost any variety or ripeness of mango, whether sour or sweet. Use the one you can get, or that you enjoy the most. In general, a firmish not overly ripe mango (unlike the very ripe, sweet one I used) holds up best but all will be delicious in this salad."
        ], 
        "date": "2010-07-08T12:58:00+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/napa-day-one1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/08/napa-day-one/", 
        "title": "napa, day one", 
        "directions": [], 
        "date": "2007-08-18T11:31:43+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/napa-days-two-three1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/08/napa-days-two-three/", 
        "title": "napa, days two & three", 
        "directions": [], 
        "date": "2007-08-20T01:14:36+00:00"
    }, 
    {
        "ingredient_list": [
            "2 medium red bell peppers", 
            "3 medium mixed bell peppers (orange, yellow, green)", 
            "3/4 teaspoon kosher salt", 
            "1/2 teaspoon ground black pepper", 
            "3 tablespoons butter", 
            "1 onion, finely chopped", 
            "2 cloves garlic, minced", 
            "1 medium zucchini, cut into 1/4-inch dice", 
            "1 medium yellow squash, cut into 1/4-inch dice", 
            "2 cups fresh or frozen corn kernels (from 3 to 4 ears of corn; for extra flavor, once you’ve cut the kernels off, use the dull side of your knife blade to scrape the remaining corn and juices, or “milk” from the cob)", 
            "1 medium tomato, seeded and cut into 1/4-inch dice", 
            "2 tablespoons chopped fresh herbs (such as parley, oregano, basil or a mix)", 
            "1/4 cup plain dried breadcrumbs", 
            "Oil for coating grill grate", 
            "2 tablespoons grates Parmesan cheese (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/08/smoke-roasted-stuffed-bell-peppers.jpg?w=753", 
        "tags": [
            "Grilling", 
            "Peppers", 
            "Photo", 
            "Tips", 
            "Travel", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/08/napa-wrapper/", 
        "title": "smoke-roasted stuffed bell peppers", 
        "directions": [
            "If using a gas grill: Use indirect heat on medium (325° to 350°F), a 2- to 4-burner grill-middle burner(s) off, or a 2-burner grill with 1 side off and a clean, oiled grate.", 
            "If using a charcoal grill: Indirect heat, medium ash, split charcoal bed (about 2 dozen coals per side) with a clean, oiled grate on medium setting", 
            "1.\tHeat the grill as directed. Soak 2 cups of apple or oak wood chips or chunks in water for one hour. ", 
            "2.\tSeed, core and cut one of the red bell peppers into 1/4-inch dice. Cut the remaining bell peppers in half lengthwise right through the stem, leaving a bit of stem attached to each half. Cut out the cores, seeds, and ribs from the interiors of the peppers, leaving the stem intact. Sprinkle the insides of the peppers with 1/4 teaspoon of the salt and 1/4 teaspoon of the pepper. ", 
            "3.\tMelt the butter in a large skillet over medium heat. Add the onion and saute until almost tender, about 4 minutes. Add the garlic, chopped bell pepper, zucchini and yellow squash. Saute the vegetables until crisp-tender, about 4 minutes. Stir in the corn and tomato and cook until heated through, 1 to 2 minutes. Stir in herbs, breadcrumbs, and the remaining 1/2 teaspoon salt and 1/4 teaspoon pepper. Cook and stir until the breadcrumbs soak up most of the liquid in the pan. Remove from the heat and spoon the filling equally into the pepper cavities. ", 
            "4.\tWhen the grill is hot, put the soaked wood chips or chunks over the coal on both sides of the grill. If using gas, put the wood chips in a smoker box or in a perforated foil packet directly over one of the heated burners. ", 
            "5.\tBrush the grill grate and coat it with oil. Put the stuffed peppers over the unheated part of the grill, cover, and cook until just tender 20 to 30 minutes. If your grill has a temperature gauge, it should stay around 350ÂºF. ", 
            "6.\tRemove the peppers to a large serving platter. Sprinkle with the Parmesan (if using) and serve. "
        ], 
        "date": "2007-08-23T00:09:03+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup sugar", 
            "3 ounces (6 tablespoons) salted butter, the better you can get, the better it will taste", 
            "1/2 cup plus two tablespoons heavy cream, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/paris-a-deep-dark-salted-butter-caramel-sauce1.jpg?w=500", 
        "tags": [
            "French", 
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/10/paris-a-deep-dark-salted-butter-caramel-sauce/", 
        "title": "paris + a deep, dark salted butter caramel sauce", 
        "directions": [
            "Melt the sugar over medium to moderately high heat in a larger pot than you think you’ll need–at least two or three quarts, whisking or stirring the sugar as it melts to ensure it heats evenly. Cook the liquefied sugar to a nice, dark copper color. Add the butter all at once and stir it in, before turning off the stove and pour in the heavy cream (The sauce will foam up quite a bit when you add it; this is why you want the larger pot.), whisking it until you get a smooth sauce. ", 
            "You use it right away or pour it into a jar and store it in the fridge for up to two weeks. When you take it out, it will likely have thickened a bit but 60 seconds in the microwave brings it right back to pouring consistency.", 
            "Serve over everything."
        ], 
        "date": "2008-10-21T16:39:54+00:00"
    }, 
    {
        "ingredient_list": [
            "4 pounds (1.8 kilograms) peaches", 
            "1 cup (237 ml) water", 
            "2 cups (400 grams) granulated sugar", 
            "Juice of one lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peach-butter1.jpg?w=500", 
        "tags": [
            "Peach", 
            "Photo", 
            "Summer", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2011/09/peach-butter/", 
        "title": "peach butter", 
        "directions": [
            "Without a food mill: Cut a small “x” in the bottom of each peach. Dip each into a pot of boiling water for 30 seconds, and then into a bowl of cold water for a minute. The peels should slide right off.  [If you have a food mill, skip the peeling step and I’ll tell you where to use it in a moment.] ", 
            "Halve your peaches and remove the pits, then cut each half into quarters (i.e. 8 chunks from each peach). Place peach chunks and water in a large pot and bring to a boil. Simmer until peaches are tender, about 15 to 20 minutes, stirring occasionally to ensure they cook evenly. If you have a food mill, run them through it to puree them and remove the skins. If you don’t have a food mill — i.e. you already peeled your peaches — you can puree in a food processor, blender or with an immersion blender. I like my peach butter very smooth, but feel free to leave any amount of texture you prefer.", 
            "Return the peaches to the large pot, add the sugar and lemon juice and bring the mixture to a good strong simmer/gentle boil, cooking them at this level for 30 to 40 minutes, stirring occasionally in the beginning and more often near the end, as it thickens up and the fruit masses risk scorching on the bottom of the pot. ", 
            "There are several methods to test for doneness: You can drizzle a ribbon of sauce across the surface; when that ribbon holds its shape before dissolve into the pot, it is done. Some people use cold or frozen plates; dollop a spoonful in the middle of one and if no water forms a ring around it in a couple minutes, it is done. Others use a spoon; if the butter remains rounded on a spoon for two minutes, it is done. You can also check the pot itself; the butter is usually done when a wooden spoon leaves a clear trail when scraped across the bottom.", 
            "Let peach butter cool (unless you’re canning it, in which, follow the directions below). If you’re not canning it, keep it in an airtight container in the fridge. It should be good for at least two weeks.", 
            "To can your peach butter: First, sterilize your jars, either by boiling them in a large, deep pot of water (which should cover the jars completely) for 10 minutes or washing them in lots of hot soapy water, rinsing and drying the parts well and then place the jars only in a 200 degree oven for 20 minutes. Then, divide your hot piping hot peach butter between your jars, leaving a little room at the top. Wipe the rims clean with a dry towel and cover the jars with their lids. Submerge the jars in a large, deep pot of boiling water for 10 minutes, either in a removable basket or using tongs to dip and remove them. Let cool completely on towels, a process that can take overnight. If canned properly, the peach butter should last indefinitely at room temperature. ", 
            "I did not have canning jars around when I made this, but am so so so in love with it that I will be buying some and making more before the last peaches are gone. I am a woman converted."
        ], 
        "date": "2011-09-02T13:48:38+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/prague-vienna-and-a-mixed-salad1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Salad", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/05/prague-vienna-and-a-mixed-salad/", 
        "title": "prague, vienna and a mixed salad", 
        "directions": [], 
        "date": "2008-05-13T12:44:30+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/raspberry-breakfast-bars.jpg?w=753", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Raspberries", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/09/raspberry-breakfast-bars/", 
        "title": "raspberry breakfast bars", 
        "directions": [
            "Make the crust and crumb: Preheat the oven to 350°F. Butter the bottom and sides of a 9-by-13-inch glass or light-colored metal baking pan. Put a long piece of parchment paper in the bottom of the pan, letting the parchment extend up the two short sides of the pan and overhang slightly on both ends. (This will make it easy to remove the bars from the pan after they have baked.) Butter the parchment.", 
            "Put the flour, brown sugar, oats, salt, baking powder, baking soda, and cinnamon in a food processor. Pulse in short bursts until combined. Add the butter and pulse until loose crumbs form.", 
            "Reserve 1 1/2 cup of the mixture and set aside. (Note: The book suggests you reserve one cup only. My gut told me that was too little, and I upped it. I wanted to make sure the top of the raspberries were mostly covered, at least for packing purposes, and was glad I had changed it.) Pour the rest of the mixture into the prepared pan and use your hans or the back of a large wooden spoon to push the crust into an even layer at the bottom of the pan. The crust should touch the sides of the pan. Bake until golden brown, 12 to 15 minutes. Transfer to a wire rack and let the crust cool. Keep the oven on while you make the raspberry filling.", 
            "Make the raspberry filling: In a medium bowl, whisk the sugar, lemon zest, cinnamon and flour together. Add the raspberries, lemon juice and butter and use your hands to toss gently until the raspberries are evenly coated.", 
            "Assemble and bake the bars: Spread the raspberry filling evenly on top of the cooled crust. Sprinkle the reserved crust mixture evenly on top of the filling.", 
            "Bake for 35 to 45 minutes, rotating the pan every 15 minutes, until the top is golden brown and the filling starts to bubble around the edges.", 
            "Transfer to a wire rack to cool completely, then cut into squares and serve. The bars can be stored in the refrigerator in an airtight container for up to two days."
        ], 
        "date": "2008-09-02T15:50:41+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/savh1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/03/savh/", 
        "title": "sav’h", 
        "directions": [
            "Alas, we’ve been home less than 24 hours and already gone out for a birthday dinner and missed many hours of sleep, all of which means no new recipes for you! For me! At least not today. I hope to be back in the swing of the things shortly, as I have a blissful Southern-inspired recipe I’m tweaking just for you. I mean, us. Until then, I will do my best to lure that great thaw a few states north.", 
            "[Remainder of the vacation pictures over here.]", 
            ""
        ], 
        "date": "2007-03-07T23:00:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound spaghetti or linguine", 
            "Salt", 
            "3 lemons", 
            "1/4 cup extra virgin olive oil , plus additional for serving", 
            "1/4 cup heavy cream", 
            "1 ounce finely grated Parmesan cheese (about 1/2 cup), plus additional for serving", 
            "Ground black pepper", 
            "Small handful fresh basil or arugula (what I used, deliciously, in a pinch) leaves, shredded"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaghetti-with-lemon-and-olive-oil-al-limone1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Date Night", 
            "Italian", 
            "Lemon", 
            "Pasta", 
            "Photo", 
            "Travel", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/02/spaghetti-with-lemon-and-olive-oil-al-limone/", 
        "title": "spaghetti with lemon and olive oil", 
        "directions": [
            "Cook linguine or spaghetti in well-salted water to your al dente tastes in a large, wide-bottomed pot. (You’ll have fewer dishes to wash if you use this pot to assemble the dish as well.) ", 
            "While pasta is cooking, zest lemons until you have a little shy of a tablespoon of zest. Juice lemons — you’ll have anywhere from 1/3 to 1/2 cup lemon juice.  ", 
            "Drain pasta, reserving 1 1/2 cups of pasta cooking water. Dry out your pot, then boil the olive oil, cream, zest and 1 cup of the reserved pasta water together for two minutes over high heat.  Return pasta to pot and stir until coated. Add the cheese and 1/4 cup lemon juice and toss, toss, toss everything together. Add more pasta water, 1/4 cup at a time, if you’d like your dish a little looser. Quickly taste a strand of pasta and see if you want to add the remaining lemon juice (we did). Stir in basil or arugula and season generously with salt and pepper. ", 
            "Serve immediately, drizzling individual portions with a bit of extra olive oil and sprinkling with extra Parmesan cheese."
        ], 
        "date": "2011-02-24T12:00:55+00:00"
    }, 
    {
        "ingredient_list": [
            "2 15-ounce cans black beans, drained and well-rinsed", 
            "4 bell peppers, a mix of colors, chopped into a small dice", 
            "1/2 super-large or 1 medium white onion, chopped into a small dice", 
            "Juice of one lime", 
            "3 tablespoons olive oil", 
            "1 teaspoon ground cumin", 
            "3/4 teaspoon salt", 
            "1 fresh chile, very thinly sliced or finely chopped or hot sauce, to taste", 
            "Optional: If you’re the kind of person who loves cilantro, it’s a great match for this salad. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/black-bean-confetti-salad1.jpg?w=640", 
        "tags": [
            "Beans", 
            "Gluten-Free", 
            "Peppers", 
            "Photo", 
            "Salad", 
            "Tex-Mex", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/04/tabula-beana/", 
        "title": "black bean confetti salad", 
        "directions": [
            "Mix beans, bell peppers and white onion in a large bowl. In a separate, smaller bowl, whisk remaining ingredients into a vinaigrette. Ideally, you’ll have a 1/2 cup of dressing. Pour it over the bean mixture, toss it well and adjust seasonings to taste.  "
        ], 
        "date": "2007-04-23T00:22:59+00:00"
    }, 
    {
        "ingredient_list": [
            "5 garlic cloves, coarsely chopped", 
            "1/4 cup chopped cilantro (or flat-leaf parsley if you are cilantro-averse)", 
            "1/4 cup Asian fish sauce*", 
            "1/4 cup vegetable oil", 
            "2 tablespoons hoisin sauce (I accidentally doubled this and can only advise you do the same)", 
            "1 1/2 teaspoons ground coriander", 
            "1 teaspoon kosher salt", 
            "1 teaspoon freshly ground black or white pepper", 
            "8 whole chicken legs, split, or 8 drumsticks and 8 thighs (about 5 pounds total)", 
            "Thai sweet chili sauce, for serving "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/thai-style-chicken-legs1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Grilling", 
            "Photo", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2010/07/thai-style-chicken-legs/", 
        "title": "thai-style chicken legs", 
        "directions": [
            "Combine the garlic, cilantro, fish sauce, vegetable oil, hoisin sauce, coriander, kosher salt and pepper in a blender until smooth. Arrange the pieces of chicken in a large, shallow glass or ceramic dish. Pour the marinade over the chicken and turn to coat the pieces thoroughly. Cover and refrigerate for several hours, or overnight.", 
            "To roast the chicken: Preheat oven to 450 degrees. Cover baking dish with a lid or foil and roast chicken for about 25 minutes. If the sauce begins to char, sprinkle a few tablespoons water into the dish. Remove the lid or foil and bake for an additional 5 to 10 minutes, until the skin is crisp and the meat is cooked through.**", 
            "To grill the chicken: [Lacking a grill, I did not test this method but I will be happy to if you invite me over tonight, okay?] Light a grill. If using a gas grill, turn off the center burners; if using a charcoal grill, once the coals are covered with a light ash, push them to opposite sides, forming a well in the middle. Set a disposable drip pan in the center. Cook chicken on the hot grate above, skin side down, with the cover down for about 40 minutes. The skin should be crisp and the meat should be cooked through.**", 
            "Both methods: Once cooked, transfer to plates and serve with Thai chili sauce.", 
            "Do ahead: The marinade can be refrigerated overnight. I like it so much, I am tempted to make a larger batch of it to keep in the freezer until needed.", 
            "* Don’t like fish sauce? Don’t want to eat it? Neither did I before about five minutes ago. Anyway, I often see low-sodium soy sauce suggested as an alternative but I’m not convinced it’s a fair swap. There’s something more caramelized and fermented in the fish sauce that you’d miss. If you feel like playing around, I might whisk some additional hoisin or even miso into that soy sauce for a more complex flavor.", 
            "** To ensure your chicken is “cooked through”: Lacking x-ray vision and decades of chicken-cooking practice, I’m a big fan of using a thermometer to ensure that my meat is properly cooked. A thermometer inserted into the thigh/leg joint should register 180 to 185 degrees if you’re following Proper Chicken Cooking Protocol, or 170 to 175 degrees, if you’re me, and have very specific chicken-cooking preferences despite what food safety experts advise. I like to live on the edge, obviously. Another classic, though less precise way, to see if chicken is cooked through is to pierce it with a knife. If the juices that run out are clear, your chicken should be just right."
        ], 
        "date": "2010-07-12T11:30:28+00:00"
    }, 
    {
        "ingredient_list": [
            "Soup", 
            "1/4 cup (1/2 stick) butter", 
            "1 large onion, finely chopped", 
            "4 large garlic cloves, chopped", 
            "3 14 1/2-ounce cans low-salt chicken broth", 
            "4 cups 1-inch pieces peeled butternut squash (about 1 1/2 pounds)*", 
            "4 cups 1-inch pieces peeled acorn squash (about 1 1/2 pounds)*", 
            "1 1/4 teaspoons minced fresh thyme", 
            "1 1/4 teaspoons minced fresh sage", 
            "1 1/2 teaspoons ground cumin", 
            "1/2 teaspoon ground ginger", 
            "1/8 cup whipping cream", 
            "Croutons", 
            "2 tablespoons (1/4 stick) butter", 
            "24 1/4-inch-thick baguette bread slices", 
            "1 cup grated Gruyere cheese", 
            "1 teaspoon minced fresh thyme", 
            "1 teaspoon minced fresh sage ", 
            "1 deep pie dish, or frankly, any old dish you feel like baking in", 
            "1/4 peck of your favorite apples to bake with, or whatever the lady is selling that day", 
            "1 tablespoon flour", 
            "1-2 tablespoons sugar, or to taste", 
            "1 teaspoon cinnamon", 
            "1/2 teaspoon nutmeg", 
            "A pinch of allspice", 
            "5-6 tablespoons unsalted or salted butter, your choice, melted", 
            "1/3 cup brown sugar", 
            "1 teaspoon cinnamon", 
            "1/3 cup dried oatmeal", 
            "Up to 1 cup all-purpose flour "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/10/winter-squash-soup-with-gruyere-croutons.jpg?w=750", 
        "tags": [
            "Fall", 
            "Photo", 
            "Soup", 
            "Thanksgiving", 
            "Travel", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2006/10/the-leaf-peeps/", 
        "title": "winter squash soup with gruyere croutons", 
        "directions": [
            "Mix the brown sugar, cinnamon and oatmeal into the melted butter. Now, here’s where all of your personal choice comes in. You could: ", 
            "Add flour a couple tablespoons at a time until the mixture forms a dry crumble. I find the more I add, as long as I don’t add so much that there is flour that can’t adhere at all, the better it comes out. Taste a clump, and adjust the sugar and spice to taste. ", 
            "Sprinkle this over your apples and bake at 400 degrees for about 45 minutes, or until the top is golden and the apples underneath are bubbling in their thickened juices. If the top browns before this happens, cover it with foil until the apples are done. ", 
            "Serve alone or with ice cream, whipped cream, creme fraiche, plain or vanilla yogurt or dusted with powdered sugar. "
        ], 
        "date": "2006-10-16T16:53:55+00:00"
    }, 
    {
        "ingredient_list": [
            "2 3/4 cup pastry flour (all-purpose is also fine)", 
            "1/4 cup sugar", 
            "1 tablespoon aluminum-free baking powder*", 
            "1 teaspoon baking soda", 
            "6 ounces of butter, in 1/2-inch cubes", 
            "1 cup golden raisins plus 1 tablespoon caraway seeds -or- 1 cup fresh fruit of your choice, chopped (I used raspberries)", 
            "3/4 to 1 cup buttermilk (use the smaller amount if using fresh fruit, the larger if using the raisin-caraway combo)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-north-fork-and-its-scones1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Photo", 
            "Scones/Biscuits", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/09/the-north-fork-and-its-scones/", 
        "title": "the north fork and its scones", 
        "directions": [
            "Turbinado or sanding sugar for sprinkling (optional, not in the original recipe)", 
            "Preheat oven to 375°.", 
            "Place cubed butter in freezer for 15 minutes. Meanwhile, measure other ingredients (except buttermilk and fruit) and mix in the bowl of a food processor.", 
            "Add butter to processor bowl and mix until the butter and flour mixture are the texture of coarse cornmeal. Transfer the mixture to the bowl of a mixer and add buttermilk and fruit, mixing on the lowest speed until the dough just comes together.", 
            "Turn out onto a lightly floured surface and knead gently a couple times. Roll dough out to approximately one-inch thickness (I skipped the rolling pin and just patted it out with floured hands) and cut into squares. Cut those squares again on the diagonal, creating triangles. Sprinkle with coarse sugar, if you’re using it.", 
            "Bake on an ungreased baking sheet (mine stuck ever-so-slightly, so I might line it with parchment next time, though no biggie if you don’t) for 25 to 30 minutes, until lightly browned.", 
            "* If you use fresh fruit in a scone, it’s very important that you use an aluminum-free baking powder, or your scones will turn out as blue as mine did — not a pretty sight! Frankly, aluminum-free baking powder is always best to use, especially if you’ve noticed a tinny taste in your biscuits, muffins scones; it is avoidable. "
        ], 
        "date": "2008-09-09T14:40:02+00:00"
    }, 
    {
        "ingredient_list": [
            "Crushed croutons", 
            "4 slices hearty white bread", 
            "1 small shallot, minced (about 2 tablespoons)", 
            "1 garlic clove, minced or pressed through garlic press", 
            "1/4 teaspoon table salt", 
            "Freshly ground black pepper", 
            "2 tablespoons olive oil", 
            "2 tablespoons grated Parmesan cheese", 
            "Tomato salad", 
            "1 pound cherry or grape tomatoes, mixed colors if you can find them", 
            "2 teaspoons olive oil", 
            "1 tablespoon mellow red wine vinegar (yours isn’t mellow? use less)", 
            "1/8 teaspoon table salt", 
            "Pinch of sugar", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/08/6046162939_322f528323_b.jpg?w=750", 
        "tags": [
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2011/08/tomato-salad-with-crushed-croutons/", 
        "title": "tomato salad with crushed croutons", 
        "directions": [
            "Handful basil leaves, slivered. ", 
            "Prepare the crushed croutons: Preheat oven to 350 degrees. Tear bread into chunks and pule them in a food processor until coarsely ground (largest chunks can be lima bean sized). No food processor? Keep tearing the bread up until it is in ragged, mixed sized crumbs. Spread crumbs on a rimmed baking sheet and toss with shallots, garlic, salt, pepper, olive oil and parmesan until croutons are evenly coated with oil. Bake until golden brown and dry, about 15 to 20 minutes, stirring occasionally. Remove from oven and set aside to cool slightly. (Warm is fine, hot might wilt your tomatoes, boo.)", 
            "Assemble salad: Halve each tomato lengthwise and arrange cut side up on a platter. Whisk together vinegar, olive oil, salt, sugar and a few grinds of pepper in a small dish. Drizzle over tomatoes. Sprinkle tomatoes with crushed croutons. Garnish with slivers of basil."
        ], 
        "date": "2011-08-15T14:43:34+00:00"
    }
]