{
  "date": "2013-11-19T12:04:08+00:00",
  "directions": [
    "Position rack in center of oven and preheat to 350°F. Spread bread cubes in single layer on large rimmed baking sheet. Bake until pale golden, stirring occasionally, 10 to 15 minutes. Let cool in pan while you prepare the other ingredients. ",
    "Generously butter a 2-quart baking dish (a 9×5-inch loaf, 8- or 9-inch square dish, etc.) with 1 tablespoon butter. Melt remaining 4 tablespoons butter in large skillet over medium heat. Add onion, thyme, salt and lots of freshly ground black pepper and cook for 2 minutes, until becoming translucent. Add celery and cook for 2 more minutes. Add apple and saute until a bit tender, 3 to 4 minutes more. ",
    "Place bread in large mixing bowl. Scrape contents of skillet on top. Whisk egg and 1/2 cup broth or stock together and pour over. Stir in parsley and sage. Spoon into prepared pan. If mixture looks a little dry, pour remaining 1/2 cup broth over it. [This is a good place to pause, if needed. Nothing bad comes of the stuffing absorbing the liquids for longer.] Bake for 30 to 40 minutes, until brown on top and no liquid appears if you insert a knife vertically into the center of the stuffing pan and turn it slightly. Serve immediately, or reheat as needed.",
    "* On a technical note, I insist upon calling stuffing what is actually dressing, even though I know it is wrong. Although they use the same recipes, stuffing goes inside the bird, dressing is baked outside, and I insist that it is better outside the bird. When making stuffing to, uh, stuff, uh, places, one must cook the bird to a higher-than-normal temperature to ensure that the stuffing inside is free from undercooked poultry drippings. Seeing as most turkey is dry enough, I see no point in helping it along. ",
    "Variations:"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/apple-herb-stuffing-for-all-seasons1.jpg?w=640",
  "ingredient_list": [
    "6 cups torn chunks French, sourdough or country loaf, torn into bits (I use 2 7-ounce demi-baguettes)",
    "5 tablespoons unsalted butter",
    "1 large Spanish or sweet onion, chopped small",
    "1 large or 2 small stalks celery, diced small",
    "1 teaspoon chopped fresh thyme leaves",
    "1/2 teaspoon table salt, plus more to taste",
    "Freshly ground black pepper",
    "1 large or 2 small firm, tart tart apples, such as Granny Smith, peeled, cored and diced small",
    "1/4 cup roughly chopped flat-leaf parsley",
    "3 sage leaves, minced",
    "1/2 to 1 cup cup turkey, chicken or vegetable stock or broth",
    "1 large egg"
  ],
  "tags": [
    "Apple",
    "Bread",
    "Celery",
    "Photo",
    "Put An Egg On It",
    "Side Dish",
    "Thanksgiving"
  ],
  "title": "apple-herb stuffing for all seasons",
  "url": "https://smittenkitchen.com/2013/11/apple-and-herb-stuffing-for-all-seasons/"
}