{
  "date": "2014-02-24T12:16:34+00:00",
  "directions": [
    "Place salt pork in a Dutch oven or a large heavy kettle over low heat, and cook until fat is rendered. Remove solid pieces with a slotted spoon, and save for another use, like your salad, vegetables or, uh, snacking. Raise heat to medium-low, and add onion and shallots. Cook until softened but not browned, about 10 to 15 minutes. Use a slotted spoon to transfer to a large bowl.",
    "If necessary, add 2 tablespoons butter to the pan to augment fat. Dust beef cubes with flour, and season lightly with salt and more generously with pepper. Shake off excess flour, and place half the cubes in the pan. Cook over medium-high heat until well browned, almost crusty, on all sides, then transfer to a bowl with onions. Repeat with remaining beef.",
    "Add Cognac to the empty pan, and cook, stirring, until the bottom is deglazed and any crusted-on bits come loose. Add stock, smooth Dijon mustard and 1 tablespoon coarse or Pommery mustard. Whisk to blend, then return meat and onion mixture to pan. Lower heat, cover pan partway, and simmer gently until meat is very tender, about 1 1/4 hours.",
    "Add carrots, and continue simmering for 40 minutes, or until slices are tender. As they cook, heat 2 tablespoons butter in medium skillet over medium-high heat, and sauté mushrooms until browned and tender. Stir mushrooms into stew along with remaining mustard and red wine. Simmer 5 minutes, then taste, and adjust seasoning. Serve hot."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/dijon-and-cognac-beef-stew.jpg?w=750",
  "ingredient_list": [
    "1/4 pound salt pork, pancetta or bacon, diced",
    "1 large onion, finely diced",
    "3 shallots, chopped",
    "4 tablespoons butter, as needed",
    "2 pounds beef chuck, in 1-inch cubes",
    "2 tablespoons flour",
    "Salt and freshly ground black pepper",
    "1/2 cup Cognac (see Note)",
    "2 cups unsalted beef stock",
    "1/2 cup smooth Dijon mustard",
    "4 tablespoons coarse Dijon or Pommery mustard (see Note)",
    "4 medium carrots, peeled and cut into half-moon slices",
    "1/2 pound mushrooms, stemmed, cleaned and quartered",
    "1/4 cup red wine (see Note)"
  ],
  "tags": [
    "Beef",
    "Date Night",
    "French",
    "Photo",
    "Stew",
    "Winter"
  ],
  "title": "dijon and cognac beef stew",
  "url": "https://smittenkitchen.com/2014/02/dijon-and-cognac-beef-stew/"
}