{
  "date": "2014-07-22T12:23:55+00:00",
  "directions": [
    "Heat your oven to 400°F. Cut the squash into thin (1/8-inch thick) coins. Toss with 1 teaspoon kosher salt and set aside for at least 10 minutes. Drain zucchini in a colander, and if you have time, spread them on a towel for a few minutes to further wick away moisture before placing it in a large mixing bowl.",
    "Meanwhile, place breadcrumbs in a small bowl. In a small skillet or saucepan, melt butter and keep cooking it over medium heat until it browns and smells nutty. Carefully pour (in a small drizzle at first) over breadcrumbs and be sure to scrape out any brown bits from the pot. Toss crumbs to evenly coat.",
    "Make the salsa verde by blending the herbs in a food processor or blender with garlic, anchovy and capers until it forms a paste, scraping down as needed. With the machine running, stream in the olive oil in a drizzle. Season with salt and black pepper. Add lemon juice to taste.",
    "Add shallots, gruyere, half the breadcrumbs, 1/4 cup salsa verde (about half; you can use the rest to dress eggs or any roasted meat) and some freshly ground black pepper to the bowl with the summer squash and toss. Transfer to a 9×9-inch (or equivalent; I used a 9-inch round cast-iron skillet) baking dish. Scatter remaining breadcrumbs over the top and bake 35 to 40 minutes, until the squash is tender and the crumbs are crisp."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/summer-squash-gratin-with-salsa-verde1.jpg?w=640",
  "ingredient_list": [
    "Gratin",
    "2 pounds summer squash",
    "Salt",
    "1 1/2 cup fresh breadcrumbs",
    "3 tablespoons unsalted butter",
    "3/4 cup thinly sliced shallots (from 4 to 5 medium)",
    "1 cup grated gruyere cheese",
    "1/4 cup salsa verde (below)",
    "Freshly ground black pepper",
    "Salsa verde",
    "1 tablespoon thyme leaves",
    "1 teaspoon marjoram or oregano leaves (or half, if dried)",
    "1/4 cup coarsely chopped mint leaves",
    "1 cup coarsely chopped flat-leaf parsley",
    "2 small cloves garlic",
    "1 salt-packed anchovy, rinsed and bones removed",
    "1 tablespoon capers, drained (and rinsed, too, if salt-packed)",
    "1/2 cup olive oil",
    "1/2 lemon, or more to taste"
  ],
  "tags": [
    "Casserole",
    "Photo",
    "Side Dish",
    "Summer",
    "Summer Squash",
    "Zucchini"
  ],
  "title": "summer squash gratin with salsa verde",
  "url": "https://smittenkitchen.com/2014/07/summer-squash-gratin-with-salsa-verde/"
}