{
  "date": "2007-06-20T09:41:43+00:00",
  "directions": [
    "The day before, make pickles: Pour vinegar and 4 teaspoon salt into gallon-size resealable plastic bag and swish around to combine. Add cucumbers and dill branches; turn several times to coat with mixture. Refrigerate overnight. If and when you pop into the fridge, turn the bag to keep things well mixed.",
    "Cook your potatoes: Although you don’t have to, I also like to boil my potatoes the day before, because I like them very cold, and it seems easier to get it out of the way. Boil them in a large pot salted water until tender, about 30 minutes. Drain, then cool completely. I leave them in the fridge overnight.\nThe next day: Drain cucumber mixture in a colander; if you’ve got an hour, you can drain it that long, but I never do. Discard brine and dill.\nAssemble your salad: The original directions called for peeling your cold potatoes but I never do. Cut potatoes crosswise into 1/2-inch-thick slices. Place potatoes in large bowl; sprinkle generously with coarse salt and pepper. Add drained cucumbers, onion, sliced radishes, and remaining 3 tablespoons dill; toss to blend.\n1 to 2 hours before serving: Stir mayonnaise into salad to taste. Season with additional salt and pepper. Serve cold or at room temperature.\nDo ahead: Salad keeps dressed for a day. Salad keeps without mayo for a few days; I add mayo before serving. In both cases, keep it covered in the fridge."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/06/dilled-potato-and-pickled-cucumber-salad.jpg?w=750",
  "ingredient_list": [
    "6 tablespoons distilled white vinegar",
    "4 teaspoons coarse kosher salt",
    "2 1-pound English (also sold as hothouse or seedless) cucumbers, very thinly sliced",
    "A few branches plus 3 tablespoons chopped fresh dill",
    "3 1/4 pounds Yukon Gold potatoes (about 10 medium), unpeeled",
    "Additional coarse kosher salt",
    "1 cup very thinly sliced white onion",
    "8 radishes, trimmed, thinly sliced",
    "3/4 cup mayonnaise"
  ],
  "tags": [
    "Cucumber",
    "Photo",
    "Pickled",
    "Potatoes",
    "Radishes",
    "Salad",
    "Vegetarian"
  ],
  "title": "dilled potato and pickled cucumber salad",
  "url": "https://smittenkitchen.com/2007/06/dilled-potato-and-pickled-cucumber-salad/"
}