{
  "date": "2016-05-03T11:48:55+00:00",
  "directions": [
    "In the bottom of a large bowl, melt your butter halfway, then stir until fully melted. (This keep it from getting so hot that it will prematurely cook the eggs.) Add milk, eggs, flour and salt and whisk to combine. It’s going to be a little lumpy. It’s going to be okay. Cover with plastic wrap and refrigerate for 1 hour and up to 4 days until needed.",
    "When ready to cook, cover a large plate or platter with a layer of paper towels. Remove plastic from batter bowl and whisk to remove any remaining lumps. ",
    "Quick directions for the confident: Heat skillet over medium-low. Butter skillet. Ladle in 1/4 cup batter, roll around. Cook until golden underneath, flip. Repeat, adjusting heat and re-buttering skillet as needed.",
    "Detailed directions for the nervous: Heat a skillet (a nonstick will give you the fewest headaches;  I use this discontinued one) over medium-low. When hot, lightly butter it. Ladle in 1/4 cup batter (this amount for a 9/10-inch) and tilt and roll the pan until the bottom is covered. If this is extremely difficult cover because the batter is too thick, whisk in another splash of milk. If a stubborn hole won’t easily fill with batter, add a drop on top of it to fill it in; it will all be the same in the end.",
    "Cook for 2 to 3 minutes on the first side, until faintly golden underneath. If this happens too quickly, reduce heat to low. Use a long thin spatula (I swear by a flexible fish spatula as well as a small offset, for this an all things in the kitchen) that can really get under the crêpe through the middle and lift and flip it over. Spatula not long enough? Put one in each hand, use the first one to lift as much as possible, and the second one to get under the crêpe further and finish the job. If it folds or crinkles, don’t fret, it’s surprisingly easy to stretch out wrinkles and shimmy the crêpe back flat. If it tears, it likely would have benefitted from another 20 seconds cooking time to better firm up underneath. Cook on the second side for 20 to 30 seconds, then slid out onto prepared platter.",
    "Repeat with remaining batter. I do not need to rebutter a good nonstick between crêpes, only every 3 or 4. Crêpes, even warm, can be stacked and they will not stick to each other. ",
    "To store: Wrap stack of crêpes in plastic, foil or place in an airtight container in the fridge overnight. ",
    "To rewarm: Arrange in a baking dish (overlapped is fine) covered with foil and warm in a 250 degree oven for 10 to 15 minutes. ",
    "Serve: With a couple sweet and savory toppings. For ideas, look no further: ",
    "Sweet topping ideas",
    "Savory topping ideas"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/failproof-crepes-a-crepe-party1.jpg?w=750",
  "ingredient_list": [
    "3 tablespoons (45 grams) unsalted butter, plus more for buttering pan",
    "1 1/4 cup (295 ml) milk (and sometimes a splash more)",
    "4 large eggs",
    "1 cup (125 grams) all-purpose flour",
    "Two pinches of salt"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Pancakes",
    "Photo",
    "Recipes"
  ],
  "title": "failproof crepes + a crepe party",
  "url": "https://smittenkitchen.com/2016/05/failproof-crepes-a-crepe-party/"
}