{
  "date": "2008-04-27T13:56:27+00:00",
  "directions": [
    "1. Combine flour, 1/2 teaspoon salt, sugar, and yeast in the bowl of an electric mixer, and slowly add 1 cup cold water. Mix on low speed until ingredients begin to combine, increase speed to medium-high, and continue to mix for about 10 minutes until the dough is smooth, elastic, and cleanly pulls away from the sides of the mixing bowl.",
    "2. Place dough in an oiled bowl, and allow to rest for 2 to 4 hours until it has doubled in size. Split the dough into halves, and form each into a log. Place each log on a generously floured surface, and allow it to rest until the formed dough doubles in size again, at least 1 hour.",
    "3. Put dough on a lightly floured baker’s peel. Dimple dough by pressing it down with your fingertips. Work the dough outward toward the edges of the peel until you reach your desired size and thickness, about 1/4 inch.  [Or in our case, realize that I forgot to do this, and instead rolled it out!] Drizzle with remaining olive oil, rosemary and sprinkle with remaining salt.",
    "4. Place a baking stone, sometimes known as a pizza stone, in the oven. Set oven to broil, about 520 degrees. Slide pizza onto baking stone with the baker’s peel. Bake until the bubbles range from golden to deep brown in color, 10 to 12 minutes. [Great trick if you don’t have a peel: Use the back of a baking sheet sprinkled with cornmeal.]",
    "Update: I’ve added so many clarifications in the comments, I want to point you to them from here, such as why you don’t have to have a pizza stone, why a KitchenAid is not a requirement and why the broil setting, when you’re not broiling. Happy baking!"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/jim-laheys-pizza-bianca1.jpg?w=500",
  "ingredient_list": [
    "3 cups all-purpose flour",
    "1 teaspoon salt",
    "3/4 teaspoon sugar",
    "1 teaspoon instant dry yeast",
    "3 tablespoons extra-virgin olive oil",
    "1 sprig fresh rosemary"
  ],
  "tags": [
    "Photo",
    "Pizza"
  ],
  "title": "jim lahey’s pizza bianca",
  "url": "https://smittenkitchen.com/2008/04/jim-laheys-pizza-bianca/"
}