{
  "date": "2006-11-02T14:19:43+00:00",
  "directions": [
    "Preheat oven to 200°F. Place two nonstick baking sheets in oven.",
    "In small saucepan, bring salted water to boil. Add peas and cook, uncovered, until heated through, about 2 to 3 minutes. Drain, then rinse in colander under cool, running water. Set aside in colander to drain completely.",
    "Using box grater or food processor² fitted with grating disc, coarsely grate onion, potatoes, carrot and zucchini and place in colander set in sink, setting aside to drain.",
    "In large mixing bowl, lightly beat eggs. Whisk in flour, coriander, turmeric, and cumin. Mix in ginger, cilantro, and peas.",
    "Press potatoes and onion to extract as much liquid as possible, then add to bowl. Season mixture with salt and freshly ground black pepper. Using wooden spoon or hands, mix well, but do not overwork.",
    "In heavy-bottomed, 12-inch non-stick³ skillet over moderately high heat, heat 1-2 tablespoons oil (I used an extra-virgin olive oil spray I’d found to lightly coat the pan); until hot but not smoking. Drop 4 scant 1/4-cup portions of potato mixture into pan and flatten with spatula to form four 3-inch pancakes.",
    "Fry until bottoms are golden-brown (the color really counts on this; the darker you let it go, the more the pancake holds together  – this goes for both sides.), 4 to 5 minutes, then turn over and fry until golden-brown and crisp, an additional 4 to 5 minutes. Transfer to paper towels to drain; season immediately with salt and pepper. Keep warm on baking sheets in oven while making remaining pancakes.",
    "Using paper towels, carefully wipe out pan. And 1 tablespoon oil to the pan and fry 4 more pancakes. Repeat with remaining batter, wiping out pan and adding 1 to 2 tablespoons oil before each batch.",
    "Serve pancakes hot with Curry-Lime Yogurt.",
    "¹Or, you could do this step in the microwave, and save yourself a good bit of effort.",
    "²Yet another recipe that yes, if you have a food processor, it takes no time at all to put this together. That said, it makes for more coarsely-grated vegetables than doing it by hand, so they are slightly harder to assemble into pancakes. ",
    "³I know there is a lot of head-shaking at nonstick these days, and I, too, try to avoid it when possible. Still, pancakes like this are much, much more difficult to make without non-stick, as you’ll end up using tablespoon after tablespoon of oil to keep the fritters from sticking. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/throwing-pancakes-to-the-wind1.jpg?w=500",
  "ingredient_list": [
    "1/2 cup frozen peas",
    "1 medium onion, peeled",
    "1 large russet or Idaho potato, peeled",
    "1 yam or sweet potato, peeled",
    "1 large or 2 thin carrots, peeled",
    "1 zucchini",
    "4 large eggs",
    "4 tablespoons all-purpose flour",
    "1/2 teaspoon ground coriander",
    "1/2 teaspoon ground turmeric",
    "1 teaspoon ground cumin",
    "A pinch of cayenne",
    "2 tablespoons minced peeled fresh ginger",
    "2 tablespoons minced fresh cilantro"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Indian",
    "Pancakes",
    "Photo"
  ],
  "title": "indian-spiced vegetable fritters",
  "url": "https://smittenkitchen.com/2006/11/throwing-pancakes-to-the-wind/"
}