{
  "date": "2007-04-30T15:29:40+00:00",
  "directions": [
    "Make Dough: Sift flour with salt into a large bowl and blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal with some (roughly pea-size) butter lumps. Beat together egg, water, and vinegar in a small bowl with a fork. Add to flour mixture, stirring with fork until just incorporated. (Mixture will look shaggy.) Turn out mixture onto a lightly floured surface and gather together, then knead gently with heel of your hand once or twice, just enough to bring dough together. (Deb note: If you use a large-ish bowl, you can do this step in-bowl.) Form dough into two flat rectangles and chill them, each wrapped in plastic wrap, at least 1 hour. Dough can be chilled up to 6 hours total. ",
    "Make Filling: Pat chicken dry and sprinkle with salt and pepper. Heat 2 tablespoons oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown chicken, turning over once, about 6 minutes total, and transfer to a plate. Sauté onions, garlic, and bay leaves in fat remaining in skillet, stirring frequently, until onions are softened, 4 to 5 minutes. ",
    "Add chorizo and paprika and cook, stirring, 1 minute. Add olives, wine, and broth and bring to a boil, stirring and scraping up any brown bits. Return chicken to skillet along with any juices accumulated on plate, then reduce heat to moderately low and simmer chicken, covered, turning over once, until tender, 25 to 30 minutes total.",
    "Transfer chicken to a clean plate. (Sauce in skillet should be the consistency of heavy cream; if it’s not, briskly simmer until slightly thickened, about 5 minutes.) When chicken is cool enough to handle, discard skin and bones and coarsely chop meat. Stir chicken into sauce and discard bay leaves. Season with salt and pepper, then cool filling, uncovered, about 30 minutes.",
    "Form Empanadas: Put oven racks in upper and lower thirds of oven and preheat oven to 400°F. Divide first dough and half of second dough into 18 equal pieces and form each into a disk. (The remaining dough can be stored in the freezer for future use.) Keeping remaining pieces covered, roll out 1 piece on a lightly floured surface with a lightly floured rolling pin into a 5-inch round (about 1/8 inch thick).",
    "Spoon about 2 tablespoons filling onto center and fold dough in half, enclosing filling. Press edges together to seal, then crimp decoratively with your fingers or tines of a fork. Transfer empanada to a baking sheet. Make 17 more empanadas in same manner, arranging on 2 parchment-lined baking sheets.",
    "Lightly brush empanadas with some of egg wash and bake in upper and lower thirds of oven, switching position of sheets halfway through baking, until golden, about 25 minutes. Transfer empanadas to a rack to cool at least 5 minutes. Serve warm or at room temperature. ",
    "* Not wanting to engage you all in egg-splitting, this empanada dough recipe technically makes enough for 24 pockets. The extra can be stored in the freezer for future use."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/04/chicken-empanada-with-chorizo.jpg?w=750",
  "ingredient_list": [],
  "tags": [
    "Chicken",
    "Freezer Friendly",
    "Photo"
  ],
  "title": "chicken empanada with chorizo and olives",
  "url": "https://smittenkitchen.com/2007/04/chicken-revisited-and-enlightened/"
}