{
  "date": "2011-01-27T08:40:35+00:00",
  "directions": [
    "Preheat oven to 450°F with a rack in middle. Pat chicken dry and season generously with salt and freshly ground black pepper. Heat oil in an ovenproof 12-inch heavy skillet (if you’ve got a cast iron skillet, it is great here) over medium-high heat until it shimmers. Working in 2 batches, brown chicken, skin side down first and turning once, about 5 minutes per batch. I like to take a lot of care in this step, not moving the chicken until the skin releases itself and has a nice bronze on it, which will provide the best flavor. ",
    "Return all chicken, skin side up, to skillet and roast in oven until just cooked through, 15 to 20 minutes. Transfer chicken to a platter, then add shallots, wine, and broth to pan juices in skillet and boil, scraping up any brown bits, until reduced by half, 2 to 3 minutes. Add cream and boil until slightly thickened, about 1 minute. To thicken the sauce further, turn the heat to high and boil it until it reduces to a consistency you prefer.",
    "Strain sauce through a sieve into a bowl, if you’re feeling fancy (I never am, but if you don’t, you might find some chicken bits scraped up from the pan in your sauce. We don’t mind.) Whisk in mustard, chives, and salt and pepper to taste. Serve chicken with sauce. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/01/roast-chicken-with-dijon-sauce.jpg?w=750",
  "ingredient_list": [
    "3 pounds chicken parts (thighs, drumsticks, and/or breasts), with skin and bones",
    "1 tablespoon vegetable oil",
    "2 small shallots, thinly sliced",
    "3/4 cup dry white wine",
    "3/4 cup reduced-sodium or sodium-free chicken broth",
    "1/4 cup heavy cream",
    "2 tablespoons smooth Dijon mustard",
    "1 tablespoon finely chopped chives or the green parts of scallions"
  ],
  "tags": [
    "Chicken",
    "Photo"
  ],
  "title": "roast chicken with dijon sauce",
  "url": "https://smittenkitchen.com/2011/01/roast-chicken-with-dijon-sauce/"
}