{
  "date": "2016-04-12T11:59:44+00:00",
  "directions": [
    "Combine ginger, garlic, fresh chili, yogurt, salt, spices and sugar in a freezer bag, bowl or container. Add chicken pieces and toss to coat evenly. Let marinate for 15 minutes or up to a day in the fridge.",
    "When you’re ready to cook the dish, heat your oven to 425°F. Line a half-sheet (13×18-inch) with foil and coat it with 1 tablespoon of the olive oil. Add potatoes, cauliflower, salt, cumin and remaining 2 tablespoons olive oil and toss together with you hands until evenly coated.",
    "Remove chicken from marinade and leave excess behind. Make spaces in the vegetables for chicken parts throughout the pan. Roast in oven for 20 minutes, then toss the potato and cauliflower to ensure they’re cooking evenly, and return the pan to the oven for 10 to 20 minutes more (i.e. 30 to 40 minutes total roasting time), until chicken and vegetables are cooked through. ",
    "While it roasts, if you’d like to use the lightly pickled onion rings that we did on top, which added a nice tangy fresh zip to the dish, separate the rings and toss them in a small bowl with a squeeze of lemon juice and a pinch of salt. Set aside until needed.",
    "When chicken and vegetables are cooked, top with garnishes of your choice — we used dollops of yogurt, herbs and scattered the above onion rings all over. Serve right in the pan."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/sheet-pan-chicken-tikka1.jpg?w=640",
  "ingredient_list": [
    "For the chicken",
    "1 3/4-inch piece of ginger, peeled and minced (see Note up top)",
    "4 cloves of garlic, minced or pressed",
    "1 fresh green chili (I used a jalapeno), seeded and minced",
    "1/2 cup whole-milk yogurt",
    "1 teaspoon kosher salt",
    "1/2 teaspoon chili powder or cayenne, or adjusted to taste (I used 1/4 teaspoon)",
    "1/2 teaspoon ground turmeric",
    "1/2 teaspoon ground cumin",
    "3/4 teaspoon granulated sugar",
    "1 teaspoon paprika",
    "1 teaspoon garam masala",
    "2 pounds chicken thighs, drumsticks or halved chicken breasts (all skin-on, bone-in)",
    "For the vegetables",
    "3 tablespoons olive oil",
    "1 1/4 pounds (about 4 medium) Yukon Gold potatoes, peeled if desired, cut into 3/4-inch chunks",
    "1 3/4 pounds (1 small or half a very large head) cauliflower, cut into 3/4-inch-wide florets",
    "1/2 teaspoon kosher salt",
    "1/2 teaspoon cumin seeds",
    "To finish, if desired",
    "A few thin slices of red onion",
    "Lemon wedges",
    "Salt",
    "Dollops of yogurt",
    "A few tablespoons roughly chopped cilantro, parsley or mint, or a mix therof"
  ],
  "tags": [
    "Cauliflower",
    "Chicken",
    "Gluten-Free",
    "Indian",
    "Photo",
    "Potatoes",
    "Weeknight Favorite"
  ],
  "title": "sheet pan chicken tikka",
  "url": "https://smittenkitchen.com/2016/04/sheet-pan-chicken-tikka/"
}