{
  "date": "2011-02-16T21:35:45+00:00",
  "directions": [
    "If you’ve got an adjustable blade slider, time to make it earn its keep! Very thinly slice half your fennel bulb, your celery and your half onion. If you don’t have a fancy slicer, just slice them thinly with a knife. Toss the fennel with lemon juice to prevent browning and also because it makes it extra delicious.",
    "In a small bowl, whisk together the vinegar, water, salt and sugar together. Add the onions and set them aside for about an hour. If you don’t have an hour, 30 minutes will still pickle them to deliciousness but they will only get better with age.",
    "Meanwhile, bring a large pot of salted water to boil. Trim and tail green beans, something I just discovered I could do with kitchen shears. For me, it was a time saver. Boil beans until crisp-tender, about 4 to 5 minutes for regular green beans and about 3 minutes for skinny ones (a.k.a. “haricot vert” — what I used). Plunge in an ice water bath. Drain and pat dry. (If you have no patience for the precision of ice water baths, take the green beans out a full minute early as they will continue cooking as they cool.)",
    "Heat a small heavy skillet to medium heat and add one teaspoon olive oil. Add almonds and toss until lightly browned, 2 to 3 minutes. Season lightly with salt and pepper to taste. Transfer almonds to a plate, let cool, and cut each almond into half or thirds.",
    "Assemble your salad: Toss green beans with most of fennel, all of celery and half of the pickled red onions. Sprinkle two tablespoons of the red onion pickling liquid and two tablespoons of olive oil over the mixture. Season generously with salt and pepper. Taste, adjust seasonings and ingredient levels to your preferences — we found we wanted more fennel, red onion and pickling liquid.",
    "Serve, then eat, eat, eat. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/green-bean-salad-with-fried-almonds.jpg?w=750",
  "ingredient_list": [
    "1 pound green beans or haricot vert (skinny ones)",
    "1/2 a fennel bulb (about 1/2 pound)",
    "1 stalk celery, trimmed",
    "1/2 medium red onion",
    "1 tablespoon lemon juice",
    "1/4 cup red wine vinegar",
    "1/4 cup water",
    "1 tablespoon kosher salt (I use Diamond brand; use less if you’re using Morton or table salt)",
    "1 1/2 teaspoons sugar",
    "1/3 cup (about 2 ounces) whole almonds",
    "2 tablespoons plus 2 teaspoons olive oil"
  ],
  "tags": [
    "Easter",
    "Fennel",
    "Green Beans",
    "Photo",
    "Salad",
    "Thanksgiving",
    "Vegan",
    "Vegetarian"
  ],
  "title": "green bean salad with fried almonds",
  "url": "https://smittenkitchen.com/2011/02/green-bean-salad-with-pickled-red-onions-and-fried-almonds/"
}