{
  "date": "2006-09-09T15:23:11+00:00",
  "directions": [
    "Strip romaine leaves from stems, reserving both separately, then tear leaves into roughly 2-inch pieces. Measure 4 loosely packed cups of leaves and reserve remainder. With motor running, add garlic to food processor to finely chop. Turn off and add the 4 cups romaine leaves along with the parsley, 1/4 teaspoon salt, 1/4 teaspoon pepper, and cheese, then pulse until finely chopped. With motor running, add remaining   cup oil in a slow stream, blending until incorporated.",
    "Put oven rack in upper third of oven and preheat oven to 400°F.",
    "Cut off about 1/8 inch from top of each tomato with a sharp knife.** Gently scrape out pulp and seeds with a spoon and discard them. Put tomatoes, cut sides up, in a 9-inch glass or ceramic dish and spoon 1 tablespoon romaine-parsley pesto into each tomato (you will have extra pesto). Crack 1 egg into each tomato and season with salt and pepper. Bake eggs in tomatoes until whites are set and yolks are still runny, 18 to 22 minutes.",
    "* I didn’t use nearly this much lettuce. For one, I was only making four eggs, and two, I had a hunch this would make an egregious amount. I may have used 4-6 leaves, tops, and half the oil and parsley.",
    "** I ended up beveling a little sliver off the bottoms, too, to stop them from rolling over in the dish and dumping out their eggs, and you may have guessed happened before I came up with my brilliant solution. Next time I’d put a droplet of oil underneath the beveled tomatoes, as they stuck a little to the bottom, something I should have also seen coming."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/like-the-lettuce1.jpg?w=500",
  "ingredient_list": [
    "1/2 cup plus 2 tablespoons extra-virgin olive oil",
    "1 large head romaine (about 1 1/2 lb) *",
    "1 large garlic clove",
    "1/4 cup loosely packed fresh flat-leaf parsley leaves",
    "1/2 teaspoon salt",
    "3/8 teaspoon black pepper",
    "1 oz finely grated parmesan (1/2 cup), plus additional for serving",
    "6 large tomatoes (about 3 inches in diameter)",
    "6 large eggs at room temperature"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Gluten-Free",
    "Photo",
    "Tomatoes"
  ],
  "title": "romaine pesto and egg-stuffed tomatoes",
  "url": "https://smittenkitchen.com/2006/09/like-the-lettuce/"
}