{
  "date": "2011-04-05T16:32:29+00:00",
  "directions": [
    "Peel apples, halve and core apples. Once cored, cut lengthwise into quarters (i.e. four pieces per apple) and cut a bevel along their inner edge, which will help their curved exteriors stay on top as they rest on this edge. (You can see this beveled edge here.) Toss apple chunks with the lemon juice and 1/3 cup of the sugar. Set aside for 15 minutes; this will help release the apple’s juices, too much of them and the caramel doesn’t thicken enough to cling merrily to the cooked apples.",
    "Melt butter in your skillet over medium heat. Sprinkle in remaining 1 cup sugar and whisk it over the heat until it becomes the palest of caramels. Off the heat, add the apples to the skillet, arranging them rounded sides down in one layer. Lay any additional apple wedges rounded sides down in a second layer, starting from the center.",
    "Return the pan to the stove and cook in the caramel for another 20 to 25 minutes over moderately high heat. With a spoon, regularly press down on the apples and baste them caramel juices from the pan. If it seems that your apples in the center are cooking faster, swap them with ones that are cooking more slowly, and rotate apples that are cooking unevenly 180 degrees. The apples will shrink a bit and by the end of the cooking time, your second layer of apples might end up slipping into the first — this is fine.",
    "Preheat oven to 400. Roll out your puffed pastry to a 9-inch circle and trim if needed. Cut four vents in pastry. Remove skillet from heat again, and arrange pastry round over apples. Tuck it in around the apples for nicer edges later.  Bake until the pastry is puffed and golden brown, about 20 minutes.",
    "Once baked, use potholders to place a plate or serving dish (larger in diameter than the pan, learn from my messes!) over the pasty and with a deep breath and a quick prayer, if you’re into that kind of thing, unmold the pastry and apples at once onto the plate. If any apples stubbornly remain behind in the pan, nudge them out with a spatula.",
    "Serve with a dollop of whipped crème fraîche, or lightly sweetened whipped cream and eat immediately.",
    "* My favorite, by miles, though not exactly budget-minded, is from Dufour. It tastes like something straight out of a Paris pastry shop. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-tarte-tatin-anew1.jpg?w=500",
  "ingredient_list": [
    "6 medium apples (I had the most success with Golden Delicious and Granny Smiths)",
    "Juice of half a lemon",
    "6 tablespoons (3 ounces or 85 grams) butter",
    "1 1/3 cup (266 grams) sugar, divided",
    "Puffed pastry, chilled",
    "A 9-inch ovenproof skillet, heavy enough that you fear dropping it on your toes"
  ],
  "tags": [
    "Apple",
    "French",
    "Photo",
    "Tarts/Pies"
  ],
  "title": "apple tarte tatin, anew",
  "url": "https://smittenkitchen.com/2011/04/apple-tarte-tatin-anew/"
}