[
    {
        "ingredient_list": [
            "Meringue Cake", 
            "4 large (120 grams) egg whites", 
            "Pinch of salt", 
            "1 cup (200 grams) superfine (castor) or regular sugar", 
            "1 teaspoon white vinegar", 
            "1/2 tablespoon cornstarch, potato starch or arrowroot powder", 
            "Raspberry Sauce", 
            "This is as good for desserts as it is over plain yogurt. Keep it refrigerated.", 
            "1 10-ounce bag frozen raspberries, thawed", 
            "3 tablespoons sugar", 
            "Whipped Cream", 
            "1 cup heavy whipping cream", 
            "1 tablespoon granulated white sugar", 
            "1 teaspoon pure vanilla extract", 
            "Mixed Berry Topping", 
            "1/2 pint fresh strawberries, hulled and sliced", 
            "1/2 pint fresh blueberries", 
            "1/2 pint fresh raspberries", 
            "Pavlova Assembly", 
            "When the meringue disk is cooled, put it on a plate. Spread the top completely with the sweetened whipped cream. Add the mixed berries and sauce mixture, spooning them carefully into the middle of the pavlova, leaving a border of cream and meringue. Serve immediately in large scoops with extra raspberry sauce."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/04/mixed-berry-pavlova.jpg?w=750", 
        "tags": [
            "Blueberries", 
            "Disasters", 
            "Fruit", 
            "Passover", 
            "Photo", 
            "Raspberries", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2007/04/a-ballet-of-sorts/", 
        "title": "mixed berry pavlova", 
        "directions": [], 
        "date": "2007-04-02T11:34:39+00:00"
    }, 
    {
        "ingredient_list": [
            "For the compote", 
            "1 pound strawberries, rinsed and hulled", 
            "1 pound rhubarb, trimmed", 
            "1 lemon", 
            "3/4 cup granulated sugar", 
            "For the almond cake", 
            "Butter and flour for the pan(s)", 
            "7 ounces almond paste", 
            "1/4 cup granulated sugar", 
            "4 ounces unsalted butter, cut into small pieces and chilled", 
            "2 tablespoons honey", 
            "3 large eggs", 
            "2 tablespoons amaretto, plus additional for brushing", 
            "1/3 cup all-purpose flour, sifted (we used matzo meal with success, though finely grinding it first would have been a better idea)", 
            "Kosher salt", 
            "1/3 to 1/2 cup sliced almonds, toasted", 
            "Confectioners’ sugar", 
            "3/4 cup crème fraîche, whipped to soft peaks     ", 
            "Make the compote", 
            "1. Select about 4 ounces of the smallest strawberries and cut lengthwise into quarters. These will be added raw to the cooked compote; set aside.", 
            "Make the cake", 
            "1. Preheat the oven to 350°F (175°C). Butter and flour four 4-by-1 3/4-inch-high miniature springform pans or butter and flour the bottom and sides of an 8-inch round cake pan. If using the 8-inch pan, line its bottom with a circle of parchment paper; this isn’t necessary with the small pans."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/almond-cake-with-strawberry-rhubarb-compote1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Easter", 
            "Everyday Cakes", 
            "Fruit", 
            "Passover", 
            "Photo", 
            "Rhubarb", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2008/04/almond-cake-with-strawberry-rhubarb-compote/", 
        "title": "almond cake with strawberry-rhubarb compote", 
        "directions": [
            "2. Place the almond paste and sugar in the bowl of a heavy-duty mixer fitted with the paddle attachment, or in another large bowl if using a handheld mixer. Begin to cream the mixture on low speed to break up the almond paste, then increase the speed to medium for about 2 minutes, or until the paste is broken into fine particles.", 
            "3. Add the butter and mix for 4 to 5 minutes, or until the mixture is light in color and airy; stop the machine and scrape down the sides as necessary. It is important to mix long enough or the cake will have a dense texture.", 
            "4. Mix in the honey, then add the eggs one at a time, beating until each one is fully incorporated before adding the next. Add the amaretto, flour, and a pinch of salt and mix just to combine.", 
            "5. Scrape the batter into the prepared pan(s) and smooth the top. Bake the small cakes for about 15 minutes, the large one for about 25 minutes, or until the cake is golden and springs back when pressed. Transfer to a rack to cool.", 
            "6. Unmold the small cakes or invert the large cake onto the rack, remove the parchment paper, and invert the cake again so that the top is once again facing upward. Brush the top of the cake(s) with amaretto and sprinkle with the toasted almonds. Dust with confectioners’ sugar. (The large and small cakes can be stored, well wrapped, at room temperature for up to 2 days.) To serve, cut the small cakes in half or the large cake into wedges. Serve with a dollop of whipped crème fraîche and the strawberry-rhubarb compote."
        ], 
        "date": "2008-04-21T16:27:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups (12 ounces or 340 grams) unsalted butter, at room temperature", 
            "1 package (8 ounces or 225 grams) Philadelphia brand cream cheese*, at room temperature", 
            "3 cups (595 grams) granulated sugar", 
            "6 large eggs", 
            "1 1/2 teaspoons pure vanilla extract plus 1/2 teaspoon almond extract (original recipe calls for 2 teaspoons vanilla but I liked this mix better)", 
            "3 cups (375 grams) all purpose flour", 
            "1 teaspoon salt", 
            "2 cups quartered hulled strawberries (about 12 ounces or 340 grams)", 
            "1/4 cup (60 ml) water", 
            "3 tablespoons (35 grams) sugar", 
            "1 tablespoon (15 ml) fresh lemon juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/03/cream-cheese-pound-cake-with-strawberry-coulis.jpg?w=753", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Everyday Cakes", 
            "Photo", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2009/03/cream-cheese-pound-cake-strawberry-coulis/", 
        "title": "cream cheese pound cake + strawberry coulis", 
        "directions": [
            "Combine strawberries, water, sugar and lemon juice in blender. Purée until very smooth, then press through a fine mesh strainer to remove the seeds. Cover and refrigerate until cold. Coulis can be prepared one day ahead."
        ], 
        "date": "2009-03-20T15:38:45+00:00"
    }, 
    {
        "ingredient_list": [
            "For the topping:", 
            "1 1/3 cup flour", 
            "1 teaspoon baking powder", 
            "3 tablespoons sugar", 
            "3 tablespoons Demerara sugar (or turbinado sugar aka Sugar in the Raw)", 
            "Zest of one lemon", 
            "1/4 pound (1 stick or 4 ounces) unsalted butter, melted ", 
            "For the filling:", 
            "1 1/2 cups rhubarb, chopped into 1-inch pieces", 
            "1 quart strawberries plus a few extras, hulled, quartered", 
            "Juice of one lemon", 
            "1/2 cup sugar", 
            "3 to 4 tablespoons cornstarch (some commenters found the flour option a little too, well, floury so this has been updated)", 
            "Pinch of salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/05/strawberry-rhubarb-crumble.jpg?w=750", 
        "tags": [
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2007/05/crumbling-crisp-convictions/", 
        "title": "strawberry-rhubarb crumble", 
        "directions": [
            "1. Heat oven to 375°F. Prepare topping: In a mixing bowl, combine flour, baking powder, sugars and lemon zest and add the melted butter. Mix until small and large clumps form. Refrigerate until needed. ", 
            "2. Prepare filling: Toss rhubarb, strawberries, lemon juice, sugar, cornstarch and a pinch of salt in a 9-inch deep-dish pie plate. (I used an oval dish this time, because they fit better in the bottom of a shopping bag.)", 
            "3. Remove topping from refrigerator and cover fruit thickly and evenly with topping. Place pie plate on a (foil-lined, if you really want to think ahead) baking sheet, and bake until crumble topping is golden brown in places and fruit is bubbling beneath, about 40 to 50 minutes. "
        ], 
        "date": "2007-05-29T15:09:19+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups (295 grams) all-purpose flour", 
            "2 1/4 teaspoons baking powder", 
            "3/4 teaspoon baking soda", 
            "3 tablespoons (40 grams) granulated sugar", 
            "1/4 teaspoon fine sea or table salt", 
            "6 tablespoons (85 grams or 3 ounces) unsalted butter, cold, cut into chunks", 
            "2 large egg yolks", 
            "3/4 cup plus 2 tablespoons (205 ml) heavy cream", 
            "3 tablespoons (35 grams) raw or turbinado sugar", 
            "1 pound (455 grams) strawberries or mixed berries, hulled and halved if large", 
            "2 tablespoons (25 grams) granulated sugar, or more to taste", 
            "1 tablespoon (15 ml) fresh lemon juice (optional)", 
            "1 cup (235 ml) heavy or whipping cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/easy-drop-berry-shortcakes-1.jpg?w=750", 
        "tags": [
            "Blackberries", 
            "Blueberries", 
            "Everyday Cakes", 
            "Photo", 
            "Quick", 
            "Raspberries", 
            "Scones/Biscuits", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2017/06/easy-drop-berry-shortcakes/", 
        "title": "easy drop berry shortcakes", 
        "directions": [
            "Make shortcakes: Heat oven to 400 degrees F. Line a large baking sheet with parchment paper.\nIn a large bowl, whisk together flour, baking powder, baking soda, granulated sugar, and salt until thoroughly combined. Add butter and using your fingertips or a pastry blender, break it into small bits, the largest should be no bigger than a small pea. In a small bowl, whisk yolks with a splash of cream, then pour rest of cream in and whisk to combine. Pour into butter-flour mixture and use a rubber spatula to mix and mash it together into one cohesive dough.", 
            "Divide dough into 6 (for large, 3 1/2 to 3 3/4-inch wide and up to 2-inch tall) shortcakes or 8 smaller ones. I do this by pressing the dough somewhat flat into the bottom of the bowl (to form a circle) and using a knife to divide it into pie-like wedges. Place raw or turbinado sugar in a small bowl. Roll each wedge of shortcake into a ball in your hands and roll it through the raw/turbinado sugar, coating it in all but a small area that you should leave bare. (I found that the sugar underneath the shortcakes would burn, so better to leave it off.)\nPlace it, bare spot down, on the prepared baking sheet. Repeat with remaining wedges of dough. Bake for 15 minutes, until lightly golden all over. Let cool completely on tray or on a cooling rack.\nWhile cooling, prepare fruit and cream:  Mix berries, 2 tablespoons sugar (more or less to taste), and lemon juice, if desired, in a bowl and let macerate so that the juices run out.\nIn a larger bowl, beat cream until soft peaks form. Add sugar to taste, or leave unsweetened, if that’s your preference.\nTo serve: Carefully split each cooled shortcake with a serrated knife. Spoon berries and their juices over bottom half. Heap generously with whipped cream. Place shortcake “lid” on top. Eat immediately and don’t forget to share.\nDo ahead: Shortcakes keep well for a day at room temperature. I prefer to keep them uncovered. I found on the second day, they were a little more firm but not half-bad, but they’re definitely “best” on day one.\n"
        ], 
        "date": "2017-06-13T11:56:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 fresh pizza dough", 
            "1 large onion, halved and thinly sliced", 
            "1 to 2 tablespoons heavy cream", 
            "Fresh sage leaves (I slivered up about 5 of them)", 
            "1 piece of thick-cut bacon, cut into lardons", 
            "1 to 2 tablespoons onion marmalade", 
            "Salt and pepper to taste", 
            "1 lemon, seeded and roughly chopped", 
            "2 cups sugar", 
            "2 pounds strawberries, hulled", 
            "Juice of 1 to 2 lemons"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/i-do-salad-pizza-sorbet-and-the-loot-it-rode-it-on1.jpg?w=500", 
        "tags": [
            "Ice Cream/Sorbet", 
            "Lemon", 
            "Photo", 
            "Pizza", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2006/07/i-do-salad-pizza-sorbet-and-the-loot-it-rode-it-on/", 
        "title": "onion pizza + strawberry sorbet", 
        "directions": [
            "Makes 1 1/2 quarts."
        ], 
        "date": "2006-07-23T18:01:46+00:00"
    }, 
    {
        "ingredient_list": [
            "For the cake", 
            "4 1/2 cups cake flour", 
            "3 cups sugar", 
            "5 1/4 teaspoons baking powder", 
            "3/4 teaspoon salt", 
            "3 sticks (12 ounces) unsalted butter, at room temperature", 
            "1 1/2 cups pureed frozen strawberries*", 
            "8 egg whites", 
            "2/3 cup milk", 
            "1 to 2 drops red food dye, if using (to make the pink color pop more)", 
            "For the cream cheese frosting", 
            "3 (8 ounce) packages cream cheese, softened", 
            "3/4 cup (1 1/2 sticks; 6 ounces) unsalted butter, softened", 
            "3 cups sifted confectioners’ sugar", 
            "2 teaspoons vanilla extract", 
            "Make the cake", 
            "1. Preheat the oven to 350»F. Butter three 9-inch round or 8-inch square cake pans. Line with parchment or waxed paper and butter the paper.", 
            "Make the cream cheese frosting", 
            "5. In a medium bowl, cream together the cream cheese and butter until creamy. Mix in the vanilla, then gradually stir in the confectioners’ sugar. Store in the refrigerator after use.", 
            "Frost and assemble the cake", 
            "6. Place one cake layer on a cake board or platter. Tucking scraps of waxed paper under the edges of the cake will protect the board or plate from any mess created while frosting the cake. (I forgot, as can be clearly seen above.) Spread about 2/3 cup frosting over the layer, spreading it to the edge. Repeat with the second layer. Add the top layer and frost the top and sides of cake with remaining frosting, reserving a small amount if you wish to tint it and pipe a decoration on the cake. If not, you can decorate the cake top with thinly-sliced strawberries. Remove the waxed strips to reveal and neat, clean cake board."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lady-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Fruit", 
            "Photo", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2008/10/pink-lady-cake/", 
        "title": "pink lady cake", 
        "directions": [
            "7. Serve with pink candles on pink plates to the sort of person who dreams in pink. I suspect you know at least one.", 
            "* Huntsman notes that it may seem surprising that frozen strawberries are used here, but they’re always available and their quality is consistent. I suspect you could swap fresh ones, but given that the ones in the store in October are so lackluster, and cruelly unlike the astounding ones we had in Paris last week, I went with her suggestion. This will be from about half a one-pound bag."
        ], 
        "date": "2008-10-23T16:02:05+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups cold water", 
            "1/4 cup plus 1 tablespoon granulated sugar, divided", 
            "1 cup (about 5 ounces) fresh raspberries, blackberries or sliced strawberries", 
            "1 cup lemon juice (from 4 to 6 lemons, depending on size and juicer efficiency)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade1.jpg?w=640", 
        "tags": [
            "Blackberries", 
            "Citrus", 
            "Drinks", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/05/pink-lemonade/", 
        "title": "picnic pink lemonade", 
        "directions": [
            "In a 1-liter carafe, combine water and 1/4 cup granulated sugar and shake it several times. Set this aside in the fridge to chill and dissolve while you prepare the other ingredients.", 
            "Combine your berry of choice with remaining tablespoon of sugar; it’s best to let the strawberries sit with the sugar for 10 minutes to get the color and juices flowing; blackberries and raspberries can be used right away. Blend the berries and sugar until fully pureed, and then a minute longer. Press through a fine-mesh strainer if you, like me, prefer your lemonade without seeds. You should have a generous 1/4 cup of each puree.", 
            "Remove sugar water carafe from the fridge; if sugar hasn’t fully dissolved, give it a few more shakes and it will. Add lemon juice and berry puree. For the pink hues you see above, use 1 tablespoon blackberry puree, 2 tablespoons raspberry puree or 4 tablespoons (or all) of the strawberry puree. If you don’t mind a dark red/purple color and want a stronger black- or raspberry flavor, you can use all of the puree. Extra puree makes an ideal yogurt or yogurt popsicle stir-in, or can be used for additional batches of pink lemonade, because this will go on repeat.", 
            "Give the carafe another shake, and drink right away or chill until your next picnic. ", 
            "A whole bunch of things about lemonade, from an obsessive: "
        ], 
        "date": "2015-05-29T12:03:04+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake layers: ", 
            "2 1/4 cups sifted cake flour", 
            "1 1/2 cups superfine or regular sugar, divided", 
            "1 tablespoon baking powder", 
            "1 teaspoon salt", 
            "3/4 cup cold water", 
            "1/2 cup vegetable oil", 
            "1 teaspoon lemon zest", 
            "1 teaspoon vanilla extract", 
            "5 large egg yolks at room temperature", 
            "8 large egg whites at room temperature", 
            "1/2 teaspoon cream of tartar", 
            "Filling: ", 
            "2 cups heavy cream", 
            "6 tablespoons confectioners sugar", 
            "1 tablespoon vanilla extract", 
            "2 quarts strawberries, hulled and sliced (I sliced mine very thinly, but would do so more thickly next time, or double-layer the strawberries so that you get a higher fruit-to-bite ratio.)*"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/skyscraper-cakes1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Fruit", 
            "Photo", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2007/06/skyscraper-cakes/", 
        "title": "strawberry chiffon shortcake", 
        "directions": [
            "1. Make cake layers: Preheat the oven to 325°F. Have two 9-inch round cake pans ready, lined with parchment paper that has been lightly sprayed with cooking spray, but otherwise ungreased. (Alternatively, this recipe yields on classic tube chiffon cake. Leave the cake pan ungreased, and use one with a removable bottom.)", 
            "2. Sift the flour, 1 1/4 cups sugar, baking powder and salt together twice into a large bowl. ", 
            "3. In a another bowl, beat the yolks, water, oil, zest and vanilla on high speed until smooth. Stir into the flour mixture until smooth. In another large bowl, or the bowl of your stand mixer, beat the egg whites with the cream of tartar until soft peaks are formed. Add the remaining 1/4 cup sugar, and beat on high speed until the peaks are stiff but not dry. ", 
            "4. Use a rubber spatula to fold one-quarter of the egg whites into the egg yolk mixture, then fold in the remaining whites. Do so gently, only until the egg whites are no longer visible. Overdoing it will deflate the egg whites, and yield a denser, shorter cake. ", 
            "5. Scrape the batter into the two prepared pans and spread evenly. (If you are needling and fussy, you can weigh them to make sure they are even, something I would never do, oh no.) Bake them until the top springs back when lightly pressed and a toothpick inserted into the center comes out clean 40 to 50 minutes (or 55 to 65 for the tube pan). (Please, do me a favor and check your cake every five minutes or so from the 30 minute mark on, as I confess I never wrote down the exact baking time for the 9″ circles, but am pretty sure it was 45 minutes in my oven. M’kay?)", 
            "6. Let cakes cool on a cooling rack for at least an hour (or, if in a tube pan, upside down over a bottleneck or resting the pan on four glasses for at least 1 1/2 hours).  When completely cool, run a knife around the sides to release, then flip out onto a plate (or your hand, if you’re daring) and then another plate. ", 
            "7. Make the whipped cream: Beat heavy cream, powdered sugar and vanilla extract in a clean mixing bowl until it holds stiff peaks.", 
            "8. Assemble the cake: Carefully split each cake layer in half, leaving you with four cake surfaces. One by one, scoop one-quarter of the whipped cream onto the surface of the cake and spread it evenly to the edges, without going over, with an offset spatula. Arrange one-quarter of the sliced strawberries over the whipped cream in one or two layers, depending on your preference. (If you use only one layer, you’ll likely have leftovers.) Repeat with the remaining three layers. If you have any leftover whipped cream, you can pipe it decoratively over the top, or, uh, scoop it up with those leftover strawberries. I won’t tell.", 
            "9. The cake can refrigerated for a few hours before eating it. In fact, as some of the moisture from the whipped cream and berries seeps into the cake, I think the texture is improved.  ", 
            "* In the comments, we’ve gotten into another approach to the strawberry filling part: macerating them for one hour with a couple tablespoons of sugar and 1 tablespoon of either creme de cassis or fresh lemon juice. This softens the strawberries and creates more of the saucy variety you’d get in a bakery cake. To create the cake layers this way, spread the strawberry mixture then the whipped cream over each layer, proceeding otherwise as directed above. "
        ], 
        "date": "2007-06-26T18:46:18+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup light brown sugar, packed", 
            "1/3 cup vegetable oil", 
            "1 egg", 
            "1/2 teaspoon vanilla", 
            "1 tablespoon rum", 
            "1 cup flour", 
            "1/4 cup whole wheat flour", 
            "1/2 teaspoon salt", 
            "1 teaspoon baking soda", 
            "1/4 cup sour cream", 
            "1/2 cup diced rhubarb", 
            "1/2 cup sliced strawberries", 
            "1/4 cup chopped pecans", 
            "Topping (Optional)", 
            "1 tablespoons granulated sugar", 
            "1/4 teaspoon cinnamon", 
            "3 to 3 1/2 tablespoons flour", 
            "2 tablespoons butter, melted", 
            "1/4 cup chopped pecans or walnuts"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/some-south-in-your-mouth1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Rhubarb", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2007/03/some-south-in-your-mouth/", 
        "title": "strawberry rhubarb pecan loaf", 
        "directions": [
            "Beat together the brown sugar, vegetable oil, egg, vanilla and rum. Combine the flours, salt and baking soda; stir. Add dry ingredients to first mixture with the sour cream. Stir in strawberries, rhubarb and pecans. ", 
            "Spread into a greased 9×5-inch loaf pan — the batter will be very thick. Combine topping ingredients except the pecans, they should be thick and clumpy; add the pecans last and sprinkle over the loaf.", 
            "Bake at 350° for about 55 to 65 minutes, or until a wooden pick or cake tester inserted in center comes out clean."
        ], 
        "date": "2007-03-10T13:44:53+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pints fresh strawberries rinsed, hulled, and sliced 1  pint  fresh raspberries", 
            "1/2 pint fresh blueberries", 
            "1/2 pint fresh blackberries", 
            "3/4 cup granulated sugar", 
            "2 tablespoons lemon juice from 1 lemon", 
            "8 slices potato bread (stale), challah, or other good-quality white bread "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/some-sweet-for-your-suffering1.jpg?w=500", 
        "tags": [
            "Blueberries", 
            "Fruit", 
            "Photo", 
            "Raspberries", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2007/08/some-sweet-for-your-suffering/", 
        "title": "summer berry pudding", 
        "directions": [
            "1. Heat strawberries, raspberries, blueberries, blackberries, and sugar in large nonreactive saucepan over medium heat, stirring occasionally, until berries begin to release their juice and sugar has dissolved, about 5 minutes. Off heat, stir in lemon juice; let cool to room temperature.", 
            "2. While berries are cooling, spray a 9 x 5-inch loaf pan with vegetable cooking spray. Following illustrations below, remove crusts from bread slices and trim them to fit in a single layer in the loaf pan (it will take approximately 2 1/2 slices to form one layer). Line the loaf pan with plastic wrap. Make sure the plastic wrap lies flat against the surface of the loaf pan, leaving no air space.", 
            "3. Place the loaf pan on a rimmed cookie sheet and use a slotted spoon to place about 2 cups of fruit into the bottom. Lightly soak enough bread slices for one layer in juice and place on top of fruit. Repeat with two more layers of fruit and bread. Top with remaining juices, cover loosely with plastic wrap, and weight with a second cookie sheet and several heavy cans. Refrigerate puddings for at least 8 and up to 24 hours.", 
            "4. Remove weights, cookie sheet, and plastic wrap. To unmold, invert onto serving platter. Lift off loaf pan; remove plastic wrap lining and serve."
        ], 
        "date": "2007-08-04T16:21:01+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups (280 grams) all-purpose flour", 
            "1 tablespoon (15 grams) aluminum-free baking powder", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 teaspoon table salt", 
            "6 tablespoons (85 grams) cold, unsalted butter", 
            "1 cup (about 130 grams) chopped very ripe strawberries (I quarter small or medium ones and further chop larger ones)", 
            "1 cup heavy cream "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/strawberries-and-cream-biscuits1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Scones/Biscuits", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/06/strawberries-and-cream-biscuits/", 
        "title": "strawberries and cream biscuits", 
        "directions": [
            "Preheat oven to 425 degrees. Line a large baking sheet with parchment paper.", 
            "In the bottom of a large, wide-ish bowl, whisk flours, baking powder, sugar and salt together. Add butter, either by cutting it in with two knives or a pastry blender (alternatively, you can freeze the butter and grate it in on the large holes of a box grater; a tip I learned from you guys) cut it into the flour mixture with a pastry blender, breaking it up until the mixture resembles a crumbly meal with tiny pea-sized bits of butter about. Gently stir in the strawberries, so that they are coated in dry ingredient, then stir in heavy cream. (I like to use a rubber spatula to gently lift and turn the ingredients over each other.) When you’ve mixed it in as best as you can with the spatula, go ahead and knead it once or twice in the bowl, to create one mass. Do not worry about getting the dough evenly mixed. It’s far more important that the dough is not overworked.", 
            "Generously flour your counter. With as few movements as possible, transfer your dough to the counter, generously flour the top of it and with your hands or a rolling pin, gently roll or press the dough out to a 3/4-inch thickness. Cut into 2 1/2-inch circles with a floured biscuit cutter or top edge of a drinking glass, pressing straight down and not twisting (this makes for nice layered edges) as you cut. Carefully transfer scones to prepared baking sheet, leaving a couple inches between each.", 
            "You can re-roll the scraps of dough, but don’t freak out over how wet the dough becomes as the strawberries have had more time to release their juice. They’ll still bake up wonderfully.", 
            "Bake the scones for 12 to 15 minutes, until bronzed at the edges and the strawberry juices are trickling out of the biscuits in places. Cool in pan for a minute, then transfer to a cooling rack. Serve warm or at room temperature.", 
            "Do ahead: Biscuits are generally best the day they are baked. However, if you wish to get a lead on them, you can make them, arrange them on your parchment-lined sheet and freeze them. If you’re prepping just one day in advance, cover the tray with plastic wrap and bake them the day you need them. If you’re preparing them more than one day in advance, once they are frozen, transfer them to a freezer bag or container. Bring them back to a parchment-lined sheet when you’re ready to bake them. No need to defrost the froze, unbaked scones, just add 2 to 3 minutes to your baking time."
        ], 
        "date": "2012-06-06T13:40:04+00:00"
    }, 
    {
        "ingredient_list": [
            "Crumbles", 
            "4 tablespoons (2 ounces or 55 grams) unsalted butter, melted", 
            "2 tablespoon (25 grams) dark brown sugar", 
            "1 tablespoon (20 grams) honey", 
            "1/2 teaspoon baking powder", 
            "1/8 teaspoon ground cinnamon", 
            "Pinch of ground cloves", 
            "1/4 teaspoon table salt or twice as much coarse kosher or coarse sea salt", 
            "1/4 cup (30 grams) whole wheat or graham flour", 
            "1/2 cup plus 2 to 3 tablespoons (80 to 85 grams) all-purpose flour", 
            "Cream", 
            "1/2 cup (120 ml) heavy or whipping cream", 
            "1 tablespoon dark brown sugar", 
            "2 tablespoons (30 grams) crème fraîche or sour cream", 
            "1/4 teaspoon vanilla extract (optional)", 
            "Strawberries", 
            "1 pound, 2 pints or about 4 cups, stems removed, halved or quartered if large"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/strawberries-and-cream-with-graham-crumbles1.jpg?w=640", 
        "tags": [
            "Crumbles/Crisps", 
            "Photo", 
            "Quick", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/08/strawberries-and-cream-with-graham-crumbles/", 
        "title": "strawberries and cream with graham crumbles", 
        "directions": [
            "Heat oven to 350°F. Line a baking sheet with parchment paper for easy clean-up (although the crumbs should not stick if baked without it). Place melted butter in a large bowl. Stir in brown sugar and honey. Add baking powder, cinnamon, cloves and salt and stir to combine. Add whole wheat or graham flour, stir again, then add 1/2 cup plus 2 tablespoons all-purpose flour. Stir until all flour is incorporated and mixture forms large and small crumbles. If needed, add the last tablespoon all-purpose flour to achieve this.", 
            "Spread crumbs on baking sheet. Bake for 5 minutes, then stir them around so that they evenly bake. Return crumbs to oven and bake for another 2 to 3 minutes, until golden brown. Let cool in pan on rack. Crumbs will keep at room temperature in an airtight container for at least a week.", 
            "Using a clean bowl and whisk (electric or a regular large one), whip cream and brown sugar until it holds soft peaks. Whisk in crème fraîche or sour cream, and vanilla. Keep chilled until needed. This whipped cream will last days in the fridge without needing to be re-whipped.", 
            "Fill a small dish a little over halfway with strawberries, generously dollop on whipped cream and top with a couple tablespoons of graham crumbs. Repeat as needed and dig in."
        ], 
        "date": "2014-08-22T11:31:29+00:00"
    }, 
    {
        "ingredient_list": [
            "1 quart (about 2 pints or 4 cups or 1.25 pounds or just shy of 600 grams) strawberries, trimmed and thickly sliced (about 4 cups)", 
            "1/4 cup sugar (though I might try this with brown sugar next time, just to up the cozy quotient)", 
            "Juice of half a lemon", 
            "1 cup unbleached all-purpose flour", 
            "1 1/2 teaspoons baking powder", 
            "Pinch of salt", 
            "1/2 cup whole milk", 
            "2 tablespoons unsalted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/strawberries-and-dumplings1.jpg?w=500", 
        "tags": [
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/06/strawberries-and-dumplings/", 
        "title": "strawberries and dumplings", 
        "directions": [
            "Accompaniment:  Heavy cream", 
            "Stir together strawberries, sugar and lemon in a 4-quart heavy saucepan and let stand, stirring occasionally, until juicy, about 15 minutes. Bring to a simmer over medium heat, stirring occasionally.", 
            "Stir the flour, baking powder, and salt together. Heat the milk and butter together just until the butter melts. Stir this warmed milk mixture into the flour mixture with a wooden spoon until incorporated and smooth. Gather a golf-ball-sized portion of the dumpling batter onto a small spoon, then push the dumpling onto the stew using a second spoon. (I used a small cookie scoop for this — a #70. It made 16 dumplings. Yes, I counted because someone always asks these things!) Cover the fruit with the dumplings, leaving about 1/4 inch between each. ", 
            "Tightly cover saucepan and reduce heat to low. Cook, undisturbed, until dumpling looks dry on top, 15 to 18 minutes; the dumplings will have doubled in size. Let stand off heat, uncovered, five minutes, then drizzle with heavy cream right before serving. ", 
            "This dish definitely tastes best freshly made, as the dumplings do dry out a bit by the second. But then it starts to taste like a cobbler, and really, who is going to complain about that?"
        ], 
        "date": "2009-06-18T11:42:45+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 stick salted or unsalted butter", 
            "1 teaspoon granulated sugar", 
            "6 slices white sandwich bread, crusts removed", 
            "1/4 cup packed dark brown sugar**", 
            "1/2 teaspoon lemon zest, finely grated", 
            "1/8 teaspoon salt (omit if using salted butter)", 
            "1/2 cup panko (Japanese bread crumbs, or make your own, below*)", 
            "1 1/2 to 2 cups strawberries, stemmed and sliced (I forgot to jot down the weight, but it was less than a half pound of whole berries)", 
            "Softly whipped cream, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/4642234776_22d0c3bbb2_o.jpg?w=750", 
        "tags": [
            "Brown Butter", 
            "Crumbles/Crisps", 
            "Photo", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2010/05/strawberry-brown-butter-bettys/", 
        "title": "strawberry brown butter bettys", 
        "directions": [
            "Preheat oven to 350°F with rack in middle.", 
            "In a small pot, melt butter over medium heat. Once melted, reduce heat to medium-low. The butter will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as while you may be impatient for it to start browning, the period between the time the butter begins to take on color and the point where it burns is less than a minute. Remove from heat.", 
            "Lightly butter muffin cups with some of brown butter, then sprinkle with granulated sugar. Roll bread slices with a rolling pin to flatten. Brush both sides with additional brown butter, then gently fit into muffin cups.", 
            "Stir together brown sugar, zest, salt and panko, then add strawberries and toss to coat. Stir in remaining brown butter. Heap strawberry mixture into cups, pressing gently.", 
            "Cover pan with foil and bake 15 minutes. Uncover and bake until strawberries are very tender, about 10 minutes more. Let stand 5 minutes before removing from pan. Serve warm or at room temperature.", 
            "* Make your own panko: Sure, it’s not exactly the same thing but I’m convinced that you can make very panko-like crumbs if you do the following — Preheat oven to 350 degrees. Tear one to two slices of soft, crustless white bread into 1-inch pieces and pulse them in the food processor until coarsely ground. This will make a generous half cup. Transfer crumbs to a rimmed baking sheet and bake until golden brown and dry, about 15 minutes, stirring occasionally. Cool. Use.", 
            "**Sweetness: [Updated 5/28/10] I “tested” this recipe with local, early-season not overly sweet strawberries. However, the ones you have may be sweeter. If you think your strawberries are on the sweeter side, you might want to dial the brown sugar back by one or even two tablespoons (the two tablespoon level, especially, if you like barely-sweet desserts). Hope that helps!"
        ], 
        "date": "2010-05-26T12:42:11+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 1/2 cups (155 grams) finely ground graham cracker crumbs (from about 10 crackers)", 
            "3 tablespoons (40 grams) granulated sugar", 
            "2 pinches sea salt", 
            "7 tablespoons (100 grams) unsalted butter, melted", 
            "Cheesecake filling", 
            "1 8-ounce package cream cheese, at room room temperature", 
            "1 (14-ounce) can sweetened condensed milk", 
            "1 teaspoon finely grated lemon zest", 
            "1 teaspoon vanilla extract", 
            "Whipped cream topping", 
            "1 cup heavy or whipping cream", 
            "1 teaspoon vanilla extract", 
            "1 tablespoon granulated sugar", 
            "Strawberry sauce", 
            "1 pound strawberries, hulled and halved", 
            "2 tablespoons sugar", 
            "Juice of half a lemon", 
            "1 tablespoon cornstarch", 
            "2 tablespoons water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/strawberry-cheesecake-ice-cream-pie1.jpg?w=640", 
        "tags": [
            "Ice Cream/Sorbet", 
            "Photo", 
            "Strawberries", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2015/06/strawberry-cheesecake-ice-cream-pie/", 
        "title": "strawberry cheesecake ice cream pie", 
        "directions": [
            "Make crust: Heat oven to 350°F. Combine graham crumbs, sugar and salt in a medium bowl and stir until mixed. Add butter and stir until crumbs are evenly coated. Press crumbs into the bottom and up the sides of a standard 9-inch pie dish. I like to use the outer edge of a heavy measuring cup to press in neat, firm sides but nobody will be the wiser if you just use your fingertips. Bake crust until lightly browned, about 9 to 10 minutes. Set on cooling rack to cool completely. Once cool, you can even transfer it to the freezer to get it started on the chilling process. ", 
            "Make cheesecake filling: Beat cream cheese until soft and fluffy, then slowly beat in condensed milk until smooth.  Beat in zest and vanilla. [This step updated to ensure everyone avoids lumps.] Pour into cooled crust and freeze for 6 to 8 hours, until firm. ", 
            "Make whipped cream topping: Whip cream with sugar and vanilla until soft peaks form. Spread the whipped cream over the frozen filling and return to the freezer until firm, usually less than an hour.", 
            "Make strawberry topping: Combine strawberries, sugar, lemon, cornstarch and water in a medium, heavy saucepan. Let macerate for 15 to 20 minutes, then cook over medium-low heat to a simmer, stirring. Cook for 2 to 3 minutes more, then remove from heat and chill sauce completely. You can hasten this along by stirring it in a bowl set over a bowl of ice water. Chill strawberry sauce in fridge until needed. (We won’t be freezing this part.)", 
            "To serve: Using a hot, wet knife, cut pie into wedges and drape each with strawberry sauce. Eat, repeat. "
        ], 
        "date": "2015-06-18T11:56:24+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (95 grams) all-purpose flour", 
            "3/4 cup (105 grams) yellow cornmeal", 
            "2 tablespoons (25 grams) granulated sugar", 
            "1/2 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon fine sea or table salt", 
            "3 tablespoons (45 grams) unsalted butter, plus more for buttering skillet", 
            "1 cup (235 ml) buttermilk, well-shaken, or 2/3 cup plain yogurt thinned with 1/3 cup milk", 
            "2 large eggs", 
            "1 cup (about 140 grams or 5 ounces) roughly chopped strawberries"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/strawberry-cornmeal-griddle-cakes1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Pancakes", 
            "Photo", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/06/strawberry-cornmeal-griddle-cakes/", 
        "title": "strawberry cornmeal griddle cakes", 
        "directions": [
            "In a large bowl, combine flour, cornmeal, sugar, baking powder, baking soda and salt with a whisk. Melt 3 tablespoons butter in the bottom of a medium bowl, then whisk in buttermilk, followed by the eggs, one at a time. Stir in strawberries. Pour strawberry-buttermilk mixture into dry ingredients and stir until just combined.", 
            "In a large skillet (cast-iron is my favorite for pancakes), melt butter over medium/medium-low heat. Pour a scant 1/4 cup batter into skillet for each pancake. Cook until bottoms are golden and bubbles appear all over top, about 1 to 2 minutes. Flip pancakes and cook until second side is golden, another minute. If batter slipped out the sides of the pancake when you first flipped it, return it to the first side for another 30 seconds to ensure the leaked batter cooks. Repeat with remaining batter, adding more butter as needed. If pan gets too hot — the butter turns brown as soon as it melts, the pancakes are done on the outside before the inside — reduce the heat to low.", 
            "If you’re not going to eat these right away, you can spread them on a baking sheet and keep them warm until needed in a 200 degree oven.", 
            "Serve with fixings of your choice, be it a pat of butter, powdered sugar, syrup and/or additional fresh strawberries."
        ], 
        "date": "2015-06-11T11:32:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups plus 2 tablespoons (230 grams) all-purpose flour", 
            "1/2 teaspoon fine sea or table salt", 
            "1/2 teaspoon baking powder", 
            "1/4 teaspoon ground cinnamon", 
            "Pinch of ground cloves", 
            "1/3 cup (65 grams) granulated sugar", 
            "2/3 cup (125 grams) dark brown sugar", 
            "1 tablespoon (15 ml) honey", 
            "1/2 cup (115 grams) unsalted butter, cold is fine if using a food processor, softened otherwise", 
            "1 large egg", 
            "6 tablespoons (75 grams) granulated sugar", 
            "Finely grated zest of half a lemon", 
            "8 ounces cream cheese, very soft", 
            "1 teaspoon (5 ml) vanilla", 
            "1/8 teaspoon fine salt", 
            "1 1/2 cups (355 ml) heavy or whipping cream", 
            "3 1/2 to 4 cups (to be safe) fresh strawberries, hulled"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/strawberry-graham-icebox-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Photo", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2017/05/strawberry-graham-icebox-cake/", 
        "title": "strawberry graham icebox cake", 
        "directions": [
            "Make grahams in a food processor: Combine flour, salt, baking powder, spices and sugars in the work bowl of a food processor, running until mixed. The brown sugar will want to clump; just break it up with a spoon or spatula and keep running the machine until it gives up. Add butter and run machine until it is powdery. Add egg and honey and run machine until the dough begins to clump/ball together.\nMake grahams without a food processor: Beat softened butter with sugars until combined. Add egg and honey, beat until smooth. Sprinkle mixture with spices, baking powder, and cinnamon and beat until very well combined. Add flour and mix only until it disappears. You’ll want to cool this dough slightly if it’s very soft before rolling it out; you absolutely don’t want it as cold and firm as a regular roll-out cooke dough but if it’s, say, as soft as frosting, it will be too mushy to roll easily.\nBoth methods: Heat oven to 350 degrees F. Get out 4 sheets of parchment paper and locate a bowl or plate with a 7-inch diameter. Divide dough into 6 balls. Roll out first ball between two sheets of parchment paper until it is slightly larger than the 7-inch rim. Do not trim. Remove the top sheet carefully (if it gives you any guff/sticking, just slide this dough sheet into the freezer for 2 to 3 minutes to firm up before trying again; I didn’t find this at all necessary).", 
            "Bake grahams: Slide graham round and the paper it is on onto a baking sheet and bake for 8 minutes, until it’s a shade darker on top and browned at the edges; don’t be afraid of a medium-brown color in places; it provides crisp.\nThe moment it comes out of the oven, place the 7-inch plate or bowl right on top of the hot cooking and use a sharp knife or pastry wheel to cut the cookie into a circle. Remove the bowl or plate, leave edges attached to cookie; they’ll remove easily once it has cooled for a minute or two. Slide parchment sheet with cookie on it onto cooling rack. In a couple minutes, it will be cool enough to remove the parchment sheet. Reuse it for other cookies.\nMeanwhile, use additional sheets of parchment to create an assembly line so that as soon as the first cookie round is baked, you can slide the next one in. (Or, if your oven is bigger, bake two at a time, lucky you.) Reuse all parchment rounds. Don’t forget to trim the cookies while they’re hot, it’s much easier this way. Once cookies are cool, you can stack them to save space.\nTo finish and assemble cake, ideally a few hours before you want to serve it: (No need to rest this overnight, as you would with other icebox cakes; it softens much faster.) Slice your strawberries paper thin with your sharpest knife. Set aside.\nPlace sugar in the bottom of a large bowl and sprinkle zest over it; rub zest into sugar with your fingertips so that it releases the most flavor. Add cream cheese and beat until combined, light, and fluffy. Add vanilla and salt and beat again. Add heavy or whipping cream just a spoonful at a time at first. You want to stretch the whipped cream cheese very slowly or it will take on a lumpy appearance. Once enough cream has been added that the mixture is liquid, add the rest. Beat cream and cream cheese together until it holds soft peaks.", 
            "Assemble cake: Place a small dab of whipped cream on the center of serving plate and place first cookie on top; in a few minutes, it will soften it enough that it doesn’t slide around so much. Scoop 1/6 of cream onto first cookie layer and spread it almost completely to edges. Arrange strawberry slices in a single layer, not so close that they touch, but so the top is as well-pebbled as you see in these pictures. Repeat 5 more times. Rest cake in fridge for 3 to 4 hours before serving.", 
            "Do ahead: Baked, cooled cookies keep for a week, if not longer, at room temperature in a tin or loosely wrapped. Cake with fresh berries, once assembled, is best in its first 24 to 36 hours. See suggestions up top for alternatives that might hold up longer."
        ], 
        "date": "2017-05-19T12:23:58+00:00"
    }, 
    {
        "ingredient_list": [
            "4 slightly heaped cups (about 20 ounces) fresh, ripe strawberries, hulled and quartered", 
            "2/3 to 3/4 cup granulated sugar (we used the latter but use less if you’re sensitive to sugar)", 
            "1/2 cup water", 
            "Juice of 2 limes", 
            "1/4 to 1/2 teaspoon freshly ground black pepper (use less for a barely detectable bite, more if you’d like it more present)", 
            "Pinch of sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/9460534513_208e0df831_k.jpg?w=750", 
        "tags": [
            "Lime", 
            "Photo", 
            "Popsicles", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/08/strawberry-lime-and-black-pepper-popsicles/", 
        "title": "strawberry, lime and black pepper popsicles", 
        "directions": [
            "Combine the strawberries and sugar in a bowl; let them sit for 15 minutes if they’re really fresh, longer if they’re firm or off-season berries. Transfer mixture to a saucepan and add the water. Bring to a boil then reduce to a simmer, and cook for 5 minutes. Let cool to room temperature. You can hasten this along by transferring them back to their macerating bowl and setting that in a bowl of ice water. ", 
            "Once cooled, transfer to a blender or food processor, add the lime juice, pepper and salt and blend until mostly smooth (I find some leftover bits lovely in here). Divide between popsicle molds. ", 
            "[You’ll have about 3 1/4 cups of the mixture, which divides evenly among 10 1/3-cup molds, with 1/4-inch space on top to make room for expansion in freezing.]", 
            "Freeze for about 5 hours, or until completely frozen. Dip in lukewarm water for 10 seconds to unmold each popsicle.", 
            "If After-Bedtime Dipping: Put a shot of white tequila in a glass wide enough to dip popsicle. Yes, you can double-dip."
        ], 
        "date": "2013-08-08T11:14:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound strawberries, trimmed and sliced", 
            "1/2 cup granulated sugar", 
            "3 cups milk", 
            "1 cup buttermilk"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/06/strawberry-milk1.jpg?w=750", 
        "tags": [
            "Drinks", 
            "Photo", 
            "Snack", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/06/strawberry-milk/", 
        "title": "strawberry milk", 
        "directions": [
            "Mix strawberries and sugar in the bottom of a bowl (or even your blender’s bowl) and let them macerate for at least an hour, or until very syrupy. The more juice they exude now, the better. Blend strawberries and juices until smooth, then pour into a pitcher along with milk and buttermilk. Stir and let steep overnight in the fridge. In the morning, mix again if needed, and pour into glasses. Repeat as long as it lasts."
        ], 
        "date": "2016-06-09T11:54:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (80 grams) rolled oats", 
            "3/4 cup (95 grams) plus up to 2 tablespoons (15 grams) extra all-purpose flour", 
            "1/2 cup (95 grams) light brown sugar", 
            "Heaped 1/4 teaspoon table salt", 
            "6 tablespoons (85 grams) unsalted butter, melted", 
            "1 teaspoon cornstarch (optional, but helps firm up the filling)", 
            "1 tablespoon (15 ml) lemon juice", 
            "1 tablespoon (15 grams) granulated sugar, divided", 
            "1 cup (125 grams) small-diced rhubarb (from about 1 1/2 medium stalks)", 
            "1 cup (155 grams) small-diced strawberries", 
            "Powdered sugar, for decoration, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/strawberry-rhubarb-crisp-bars1.jpg?w=640", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Crumbles/Crisps", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Rhubarb", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/05/strawberry-rhubarb-crisp-bars/", 
        "title": "strawberry rhubarb crisp bars", 
        "directions": [
            "Heat oven to 375 degrees F. For easy removal, line bottom and two sides of 8-by-8-inch square baking pan with parchment paper. No need to bother (and no greasing needed) if you plan to serve them right in the pan, as I did. ", 
            "Place oats, 3/4 cup flour, brown sugar and salt in bottom of baking pan and mix. Pour melted butter over, and stir until clumps form. If the clumps feel soft or look overly damp, add the remaining 2 tablespoons flour. Set aside 1/2 cup of the crumble mixture. Press the rest of the crumb mixture evenly in the bottom of the pan.", 
            "Spread half the fruit over the crust. Sprinkle it evenly with cornstarch, then lemon juice, and 1/2 tablespoon of granulated sugar. Spread remaining fruit over this, and top with second 1/2 tablespoon sugar. Scatter reserved crumbs over fruit and bake bars for 30 to 40 minutes (firmer fruits will take longer), until fruit is bubbly and crisp portion is golden and smells toasty and amazing. ", 
            "Let cool in pan; I do this in the fridge, where they become crisp once chilled (less so at room temperature). Cut into squares and sprinkle with powdered sugar before serving. Store leftovers in fridge."
        ], 
        "date": "2014-05-09T11:20:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 recipe All Butter, Really Flaky Pie Dough or double-crust pie dough of your choice", 
            "3 1/2 cups (about 1 1/2 pounds, untrimmed) rhubarb, in 1/2-inch thick slices", 
            "3 1/2 cups (about 1 pound) strawberries, hulled and sliced if big, halved if tiny", 
            "1/2 cup granulated sugar", 
            "1/4 cup light brown sugar", 
            "1 tablespoon lemon juice", 
            "1/4 teaspoon salt", 
            "1/4 cup quick-cooking tapioca", 
            "2 tablespoons unsalted butter, cut into small pieces", 
            "1 large egg yolk beaten to blend with 1 teaspoon water (for glaze)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/strawberry-rhubarb-pie.jpg?w=750", 
        "tags": [
            "Photo", 
            "Rhubarb", 
            "Spring", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2010/06/strawberry-rhubarb-pie-improved/", 
        "title": "strawberry-rhubarb pie, improved", 
        "directions": [
            "Preheat oven to 400 degrees. On a well-floured counter, roll half of pie dough into a 12-inch circle and carefully transfer to a 9-inch pie plate.  (I like to fold my gently into quarters, to transfer it more easily, then unfold it in the pie plate.)", 
            "Stir together rhubarb, strawberries, sugars, lemon, salt and tapioca in a large bowl. Mound filling inside bottom pie crust and dot with bits of unsalted butter. Roll second half of pie dough into an 11-inch circle and cut decorative slits in it. Transfer it to center over the pie filling. Trim top and bottom pie dough so that their overhang beyond the pie plate lip is only 1/2-inch.  Tuck rim of dough underneath itself and crimp it decoratively.", 
            "Transfer pie to a baking sheet and brush egg yolk mixture over dough. Bake for 20 minutes then reduce temperature to 350 degrees and bake for an additional 25 to 30 minutes, until the pie is golden and the juices bubble visibly.", 
            "Transfer pie to wire rack to cool. When full cool (several hours later) the juices gel.", 
            "Do ahead:  Pie should keep for up to three days at room temperature but I have never, ever seen one last that long."
        ], 
        "date": "2010-06-24T14:59:40+00:00"
    }, 
    {
        "ingredient_list": [
            "For crust", 
            "3 cups all purpose flour", 
            "2 1/2 teaspoons sugar", 
            "3/4 teaspoon salt", 
            "2/3 cup chilled solid vegetable shortening, cut into pieces", 
            "1/2 cup plus 2 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into pieces", 
            "10 tablespoons (about) ice water", 
            "For filling", 
            "3 1/2 cups 1/2-inch-thick slices trimmed rhubarb (1 1/2 pounds untrimmed)", 
            "1 16-ounce container strawberries, hulled, halved (about 3 1/2 cups)", 
            "1/2 cup (packed) golden brown sugar", 
            "1/2 cup sugar", 
            "1/4 cup cornstarch", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/strawberry-rhubarb-pie1.jpg?w=500", 
        "tags": [
            "Fruit", 
            "Photo", 
            "Rhubarb", 
            "Spring", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/05/strawberry-rhubarb-pie/", 
        "title": "strawberry rhubarb pie", 
        "directions": [
            "1 large egg yolk beaten to blend with 1 teaspoon water (for glaze)", 
            "Make crust: Combine flour, sugar and salt in processor. [Alternately, you can use a pastry cutter to make your dough, as I did.] Using on/off turns, cut in shortening and butter until coarse meal forms. Blend in enough ice water 2 tablespoons at a time to form moist clumps. Gather dough into ball; cut in half. Flatten each half into disk. Wrap separately in plastic; refrigerate until firm, about 1 hour. (Can be made 1 day ahead. Keep chilled. Let dough soften slightly at room temperature before rolling.)", 
            "[Still worried about your pie dough? Check out my Pie Dough 101. I used this dough recipe this time, however, and found it just wonderful. It closely follows one I posted a while back.]", 
            "Make filling: Preheat oven to 400°F. Combine first 7 ingredients in large bowl. Toss gently to blend.", 
            "Assemble Pie: Roll out 1 dough disk on floured work surface to 13-inch round. Transfer to 9-inch-diameter glass pie dish [er, I used a metal one and it was just fine]. Trim excess dough, leaving 3/4-inch overhang.", 
            "Roll out second dough disk on lightly floured surface to 13-inch round. Cut into fourteen 1/2-inch-wide strips. Spoon filling into crust. Arrange 7 dough strips atop filling, spacing evenly. Form lattice by placing remaining dough strips in opposite direction atop filling. Trim ends of dough strips even with overhang of bottom crust. Fold strip ends and overhang under, pressing to seal. Crimp edges decoratively.", 
            "Brush glaze over crust. transfer pie to baking sheet. Bake 20 minutes. Reduce oven temperature to 350Â°F. Bake pie until golden and filling thickens, about another 25 minutes. [The original recipe suggested a total baking time of 1 hour and 55 minutes. No joke. Mine was done in just shy of an hour.] Transfer pie to rack and cool completely."
        ], 
        "date": "2008-05-27T13:12:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound strawberries, stems removed and halved", 
            "1 pound rhubarb, chopped into 1/2-inch segments", 
            "1 cup granulated sugar", 
            "1 cup water", 
            "1 lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/strawberry-rhubarb-soda-syrup1.jpg?w=750", 
        "tags": [
            "Drinks", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2015/04/strawberry-rhubarb-soda-syrup/", 
        "title": "strawberry rhubarb soda syrup", 
        "directions": [
            "Combine strawberries, rhubarb, sugar and water in a large saucepan. Remove several strips of peel from lemon with a knife or peeler and add them to the pot. Bring mixture to a boil and then reduce it to a gentle simmer. Simmer for 20 minutes, or until fruit has completely collapsed, stirring occasionally. Remove from heat, add the juice of half the lemon (or more, to taste) and let fruit cool in syrup for maximum infusion. Once cool, pour mixture through a fine-mesh strainer (or, if you only have a coarse one, line it with cheesecloth or a lint-free towel); press solids with the back of a spoon or spatula to get the most syrup from them. You should have 2 cups right away, but I had to run an errand, left mine sitting in the strainer and was delighted to find 3 full cups of syrup when I got back. Pour into a glass bottle and chill until needed. ", 
            "Save fruit pulp in a separate container; it can be used to stir into plain yogurt, oatmeal or even dollop on pancakes. (Be sure to fish out or at least look out for lemon peels if you do.)", 
            "To make 1 glass of soda, pour 2 tablespoons of the syrup in the bottom of a glass, fill with ice and then seltzer or sparkling water. Give it a stir and add more syrup to taste; for a large glass, you might use up to 2 tablespoons more. Garnish with a lemon wedge, if you wish. Drink and pretend it’s spring.", 
            "Do ahead: Syrup should keep in the fridge for at least three weeks, if not longer. "
        ], 
        "date": "2015-04-10T11:53:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup plus 2 tablespoons all-purpose flour, plus more for dusting", 
            "1/4 cup whole wheat flour, or graham flour if you can get it", 
            "3/4 teaspoon cinnamon", 
            "1/2 teaspoon salt", 
            "Pinch of ground cloves", 
            "1 stick unsalted butter, softened", 
            "2 tablespoons light brown sugar", 
            "3 tablespoons plus 2 tablespoons granulated sugar", 
            "2 tablespoons honey", 
            "1 1/2 teaspoons molasses (you can swap this with additional honey, if desired)", 
            "3/4 pound strawberries, thinly sliced", 
            "1 1/2 tablespoons fresh lemon juice", 
            "1 1/4 cups ricotta (10 ounces), fresh if you can find it, a full-fat store bought if you cannot", 
            "2 tablespoons confectioners’ sugar", 
            "1 teaspoon finely grated lemon zest"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/strawberry-ricotta-graham-tartlets1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "Photo", 
            "Strawberries", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2010/06/strawberry-ricotta-graham-tartlets/", 
        "title": "strawberry-ricotta graham tartlets", 
        "directions": [
            "Make grahams: In a bowl, whisk both flours with the cinnamon, salt and cloves. Beat the butter, light brown sugar and 2 tablespoons of the granulated sugar at medium speed on an electric mixer until fluffy, about 1 minute. Beat in the honey and molasses, about 30 seconds. Scrape down the side of the bowl and beat in the flour mixture at low speed, just until incorporated. Pat the dough into a disk, cover with plastic and refrigerate until firm, about 1 hour.", 
            "Preheat the oven to 350°F. Line 2 large baking sheets with parchment paper. On a lightly floured work surface, roll out the dough 1/8 inch thick. Using a 3 1/2-inch oval cookie cutter (recommendation of original recipe), a 3 1/2-inch round cutter (what I had, and used) or a smaller cutter of your choice (I might go with 3 inches next time, as I like petite desserts), stamp out your bases. (About 16 with a 3 1/2-inch oval, 10 with a 3 1/2-inch round or more with a smaller cutter.) Reroll the dough scraps if necessary. Transfer the grahams to the baking sheets and bake for about 12 minutes, rotating the pans halfway through, until lightly golden around the edges. Let cool on the pans for 5 minutes, then transfer the grahams to racks to cool completely.", 
            "Make toppings: In a bowl, toss the strawberries with the remaining 3 tablespoons of sugar and the lemon juice. Let stand until syrupy, 20 minutes. In a medium bowl, mix the ricotta, confectioners’ sugar and lemon zest.", 
            "Assemble tartlets: Spread about 1 tablespoon of the ricotta mixture on each graham. Arrange the strawberries over the ricotta, drizzle with the syrup and serve.", 
            "Do ahead: Grahams will keep in an airtight container for up to two weeks. They will keep longer, unbaked, in the freezer. Ricotta mixture, if your ricotta is fresh, will keep for a day or two and up to a week if from packaged ricotta. Strawberry mixture should, in theory, keep for a few days but will not because it is delicious enough to spoon over every yogurt, oatmeal or ice cream scoop you can find. "
        ], 
        "date": "2010-06-07T13:44:09+00:00"
    }, 
    {
        "ingredient_list": [
            "1 2/3 cups (224 grams) all-purpose flour", 
            "3 1/2 tablespoons (50 grams) sugar", 
            "1 tablespoon plus 1/2 teaspoon (20 grams) baking powder", 
            "2 hard-boiled egg yolks", 
            "1/8 teaspoon salt", 
            "6 tablespoons (84 grams) cold unsalted butter, cut into 1/2-inch cubes", 
            "2 teaspoons lemon or orange zest (optional)", 
            "2/3 cup (168 grams) plus 1 tablespoon heavy cream", 
            "Shortcake assembly", 
            "1/2 pound strawberries, washed, hulled and quartered", 
            "2 tablespoons (25 grams) sugar", 
            "1 tablespoon lemon juice", 
            "1 cup whipping cream, beaten to soft peaks"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/3552480009_66d3866192_o.jpg?w=753", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Scones/Biscuits", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/05/strawberry-shortcakes/", 
        "title": "strawberry shortcakes", 
        "directions": [
            "In the bowl of a food processor, combine the flour, sugar, baking powder, egg yolks, and salt. Pulse to combine. Add the butter and zest, if using, and pulse until the flour resembles coarse meal. Add 2/3 cup of cream and pulse until the dough comes together.", 
            "Turn the dough out onto a lightly floured work surface and gather into a shaggy mass. Knead a couple times to make it into a cohesive mass and then pat it into a rough circle about 6 to 7 inches in diameter, and 3/4 to 1-inch thick.", 
            "Using a sharp knife, cut the circle into 6 wedges and arrange on a parchment-lined baking sheet. Alternately, you can use a cookie cutter to make shapes of your choice. Chill for 20 minutes (and up to 2 hours).", 
            "Preheat oven to 350°F. Brush the tops of the shortcakes very lightly with heavy cream and sprinkle lightly with the coarse sugar. Bake until risen and golden brown, 18 to 20 minutes. Turn the pan around halfway through to ensure even cooking.", 
            "While the shortcakes are baking, toss the strawberries, sugar and lemon juice together in a bowl. Let stand several minutes. (If the strawberries are extremely firm, do this 30 minutes in advance.)", 
            "Split the shortcakes in half horizontally and set the tops aside. Place the bottoms on dessert plates and heap strawberries over them. Spoon whipped cream generously over the strawberries and replace the shortcake tops. Serve immediately with any remaining whipped cream on the side."
        ], 
        "date": "2009-05-24T13:11:15+00:00"
    }, 
    {
        "ingredient_list": [
            "6 tablespoons (85 grams) unsalted butter, at room temperature, plus extra for pie plate", 
            "1 1/2 cups (188 grams) all-purpose flour (can swap 3/4 cup or 94 grams all-purpose flour with 3/4 cup or 75 grams of barley flour, see Note)", 
            "1 1/2 teaspoons baking powder", 
            "1/2 teaspoon table salt", 
            "1 cup (200 grams) plus 2 tablespoons (25 grams) granulated sugar", 
            "1 large egg", 
            "1/2 cup (118 ml) milk", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 pound (450 grams) strawberries, hulled and halved"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/5752837495_242b649dbf_o.jpg?w=750", 
        "tags": [
            "Everyday Cakes", 
            "Photo", 
            "Picnics", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2011/05/strawberry-summer-cake/", 
        "title": "strawberry summer cake", 
        "directions": [
            "Preheat oven to 350°F (180°C). Butter a 10-inch pie pan or 9-inch deep-dish pie pan (what I used). I did not test this with a standard 9-inch pie plate but looking at the margin of space leftover in my deep-dish pan after baking the cake, I suspect you’d be safe. Updated 6/13/11: This cake does not work in a standard 9-inch pie pan; it will overflow. Big apologies to anyone who learned the hard way! This cake would work, however, in a 9- or 10-inch springform or cake pan. The 10-inch would make a thinner cake than pictured.\nWhisk flour or flours, baking powder and salt together in a small bowl. In a larger bowl, beat butter and 1 cup sugar until pale and fluffy with an electric mixer, about 3 minutes. Mix in egg, milk and vanilla until just combined. Add dry mixture gradually, mixing until just smooth.\nPour into prepared pie plate. Arrange strawberries, cut side down, on top of batter, as closely as possible in a single layer (though I had to overlap a few to get them all in). Sprinkle remaining 2 tablespoons sugar over berries.\nBake cake for 10 minutes then reduce oven temperature to 325°F and bake cake until golden brown and a tester comes out free of wet batter, about 50 minutes to 60 minutes. (Gooey strawberries on the tester are a given.) Let cool in pan on a rack. Cut into wedges. Serve with lightly whipped cream.\nDo ahead: Cake can be stored at room temperature for up to 2 days, loosely covered, but good luck with that.\n"
        ], 
        "date": "2011-05-23T22:01:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (100 grams) granulated sugar", 
            "1/2 cup water", 
            "1 tablespoon (7 grams) coarsely ground black pepper (see Note up top)", 
            "4 ounces ripe strawberries, hulled and halved", 
            "5 tablespoons fresh lime juice", 
            "5 ounces (10 tablespoons) blanco tequila", 
            "1 lime wedge", 
            "1 tablespoon granulated sugar", 
            "3/4 teaspoon finely ground black pepper", 
            "1/4 teaspoon kosher salt", 
            "Ice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/the-red-and-black-cocktail.jpg?w=750", 
        "tags": [
            "Drinks", 
            "Recipes", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2017/05/the-red-and-black/", 
        "title": "the red and black", 
        "directions": [
            "Make simple syrup: Combine sugar, water, and 1 tablespoon coarsely ground black pepper in a small saucepan and bring to a simmer. Simmer until sugar fully dissolves, stirring; this takes about 1 minute. Cool completely. You can hasten this along by pouring it into a glass you’ve set inside a shallower bowl of ice water; with this method, it takes all of 10 to 15 minutes. Strain syrup and discard black pepper.\nMake drinks: Muddle strawberries a medium-sized jar. Add lime juice, 1/2 cup of cooled syrup (if you’re nervous about sweetness, you can hold a little more back), and tequila and stir to combine. You can chill this mixture in the fridge until needed, up until 2 days.", 
            "To finish: Swipe rims of 2 rocks or equivalent 11 or 12-ounce glasses with lime. Combine 1 tablespoon sugar, 3/4 teaspoon finely ground black pepper, and salt in a shallow plate and dip rims in it to coat them. Carefully fill glasses with ice. Divide strawberry-tequila mixture between glasses, including the muddled strawberries. Drink slowly and have no shame about using a spoon to get all of the strawberries from the glass to your mouth."
        ], 
        "date": "2017-05-26T12:01:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 fully baked 9-inch (24-cm) tart shell made from Sweet Tart Dough", 
            "Pastry cream (recipe below)", 
            "3 to 4 cups fresh strawberries, hulled", 
            "1 1/4 cups (300 grams) whole milk", 
            "1/2 moist, plump vanilla bean, split and scraped or 1 teaspoon vanilla extract", 
            "3 large egg yolks", 
            "1/2 cup (100 grams) sugar", 
            "3 tablespoons (30 grams) cornstarch", 
            "3 tablespoons unsalted butter, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/two-of-tarts1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Strawberries", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2007/06/two-of-tarts/", 
        "title": "strawberry tart", 
        "directions": [
            "1. Bring the milk and vanilla bean (pulp and pod) to a boil in a small saucepan over medium heat. Cover the pan, turn off the heat, and set aside for 10 minutes. Or, if you are using vanilla extract, just bring the mil to a boil and proceed with the recipe, adding the extract before you add the butter to the hot pastry cream.", 
            "2. Working in a heavy-bottomed medium saucepan, whisk the yolks, sugar, and cornstarch together until thick and pale.  Whisking all the while, very slowly drizzle a quarter of the hot milk onto the yolks.  Then, still whisking, pour the rest of the liquid in a steady stream over the tempered yolks.  Remove and discard the vanilla pod.", 
            "3. Put the pan over medium heat and, whisking vigorously and without stop, bring the mixture to the boil.  Keep the mixture at the boil, whisking energetically, for 1 to 2 minutes, then remove the pan from the heat and scrape the pastry cream into a clean bowl.  Allow the pastry cream to cool on the counter for about 3 minutes.", 
            "4. Cut the butter into chunks and stir the chunks into the hot pastry cream, continuing to stir until the butter is melted and incorporated.  At this point, the cream needs to be thoroughly chilled.  You can either set the bowl into a larger bowl filled with ice cubes and cold water and, to ensure even cooling, stir the cream from time to time, or refrigerate the cream, in which case you should press a piece of plastic wrap against the surface to create an airtight seal.", 
            "(The cream can be kept tightly covered in the refrigerator for up to 3 days or packed airtight and frozen for 1 month.  Defrost overnight in the refrigerator and whip before using to return it to its smooth consistency.) "
        ], 
        "date": "2007-06-18T20:17:22+00:00"
    }
]