{
  "date": "2014-08-22T11:31:29+00:00",
  "directions": [
    "Heat oven to 350°F. Line a baking sheet with parchment paper for easy clean-up (although the crumbs should not stick if baked without it). Place melted butter in a large bowl. Stir in brown sugar and honey. Add baking powder, cinnamon, cloves and salt and stir to combine. Add whole wheat or graham flour, stir again, then add 1/2 cup plus 2 tablespoons all-purpose flour. Stir until all flour is incorporated and mixture forms large and small crumbles. If needed, add the last tablespoon all-purpose flour to achieve this.",
    "Spread crumbs on baking sheet. Bake for 5 minutes, then stir them around so that they evenly bake. Return crumbs to oven and bake for another 2 to 3 minutes, until golden brown. Let cool in pan on rack. Crumbs will keep at room temperature in an airtight container for at least a week.",
    "Using a clean bowl and whisk (electric or a regular large one), whip cream and brown sugar until it holds soft peaks. Whisk in crème fraîche or sour cream, and vanilla. Keep chilled until needed. This whipped cream will last days in the fridge without needing to be re-whipped.",
    "Fill a small dish a little over halfway with strawberries, generously dollop on whipped cream and top with a couple tablespoons of graham crumbs. Repeat as needed and dig in."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/strawberries-and-cream-with-graham-crumbles1.jpg?w=640",
  "ingredient_list": [
    "Crumbles",
    "4 tablespoons (2 ounces or 55 grams) unsalted butter, melted",
    "2 tablespoon (25 grams) dark brown sugar",
    "1 tablespoon (20 grams) honey",
    "1/2 teaspoon baking powder",
    "1/8 teaspoon ground cinnamon",
    "Pinch of ground cloves",
    "1/4 teaspoon table salt or twice as much coarse kosher or coarse sea salt",
    "1/4 cup (30 grams) whole wheat or graham flour",
    "1/2 cup plus 2 to 3 tablespoons (80 to 85 grams) all-purpose flour",
    "Cream",
    "1/2 cup (120 ml) heavy or whipping cream",
    "1 tablespoon dark brown sugar",
    "2 tablespoons (30 grams) crème fraîche or sour cream",
    "1/4 teaspoon vanilla extract (optional)",
    "Strawberries",
    "1 pound, 2 pints or about 4 cups, stems removed, halved or quartered if large"
  ],
  "tags": [
    "Crumbles/Crisps",
    "Photo",
    "Quick",
    "Strawberries",
    "Summer"
  ],
  "title": "strawberries and cream with graham crumbles",
  "url": "https://smittenkitchen.com/2014/08/strawberries-and-cream-with-graham-crumbles/"
}