[
    {
        "ingredient_list": [
            "Banana crepes", 
            "4 tablespoons butter, melted and cooled slightly, plus extra for greasing pan", 
            "1 large (will weigh 6 ounces/170 grams be about 6 inches long when unpeeled) speckly ripe banana (should yield a scant 1/2 cup peeled, pureed)", 
            "1 cup (235 ml) milk", 
            "3/4 cup (95 grams) all-purpose flour", 
            "4 large eggs", 
            "2 tablespoons (25 grams) light brown sugar", 
            "1/2 teaspoon vanilla extract", 
            "1/4 teaspoon table salt", 
            "1/2 teaspoon ground cinnamon", 
            "1/4 teaspoon freshly grated nutmeg", 
            "Pinch of ground cloves", 
            "Cream cheese yogurt filling", 
            "8 ounces (225 grams) cream cheese, well-softened", 
            "1 1/2 cups (345 grams) plain Greek-style yogurt", 
            "1/3 cup (65 grams) granulated sugar", 
            "1/2 teaspoon vanilla extract", 
            "Walnut butterscotch topping", 
            "1/2 cup (120 ml) heavy whipping cream", 
            "1/4 cup (50 grams) packed dark brown sugar", 
            "1 tablespoon (15 grams) unsalted butter, at room temperature", 
            "1/2 cup (about 50 grams) chopped walnuts, toasted", 
            "1/2 teaspoon vanilla extract", 
            "1/4 teaspoon flaky sea salt, or to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/banana-bread-crepe-cake-with-butterscotch1.jpg?w=500", 
        "tags": [
            "Bananas", 
            "Breakfast", 
            "Brunch", 
            "Cake", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/04/banana-bread-crepe-cake-with-butterscotch/", 
        "title": "banana bread crepe cake with butterscotch", 
        "directions": [
            "Make the crepe batter: Blend banana in a food processor until totally smooth. Add melted butter, blend again. Add remaining ingredients and blend until they are combined. Transfer batter, which will look pretty thin, to a bowl (even easier later if it has a spout), cover with plastic wrap and chill for at least an hour, preferably overnight, and up to two days. When you remove the batter, it will seem surprisingly thick. Stir it to redistribute the ingredients before using it.", 
            "Cook the crepes: Heat a medium skillet or crepe pan over medium-high heat. Once heated, brush pan thinly with melted butter. Pour 1/4 cup batter into skillet, swirling it until it evenly coats the bottom and cook, undisturbed, until the bottom is golden and the top is set, about 2 to 3 minutes. Flip* the crepe and cook it for 30 seconds on the other side, before transferring it to a plate to cool. Repeat with remaining batter. You can stack your crepes and they should not stick together. Let crepes cool completely.", 
            "* Here’s my Weirdo Two-Spatula Crepe Flipping Method: I have two spatulas handy, one flexible fish-style spatula (these are my favorite, for everything, because they’re so thin) and one smaller, like an offset icing spatula. I slide the larger one just a little bit under the crepe and lift it enough that I can slide the smaller one under. I lift it enough that I can get the larger one far underneath the crepe, then use the larger one alone to flip it. It makes it very easy, I promise.", 
            "Make filling: Whip cream cheese until fluffy, then beat in yogurt, 1/2 cup at a time. When fully combined, add sugar and vanilla then beat until rich and fluffy, just another minute.", 
            "Assemble crepe cake: Lay first crepe on a cake plate or serving platter. Spread with 1/4 cup of the yogurt-cream cheese filling. Repeat with all but the last remaining crepe, which should be stacked but have no filling on top, as it is the lid.", 
            "Make walnut butterscotch sauce: Combine the cream, brown sugar and butter in the bottom of a medium, heavy saucepan over medium-high heat. Bring the mixture to a boil, then reduce the heat and let it simmer for 10 minutes, stirring occasionally in the beginning and more frequently as it reduces and thickens. You’ll know it’s done when it becomes thick and smells toasty. Stir in the vanilla and salt, then walnuts. Immediately pour over stack of filled crepes, nudging the butterscotch to the edges with your spoon — if it goes over the edge, so be it.", 
            "Serve immediately, or keep in fridge until ready to serve. Crepe cake keeps for up to 3 days, possibly longer, but good luck with that."
        ], 
        "date": "2012-04-16T16:10:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup shelled roasted salted pistachios", 
            "4  large bananas, ripe but not mushy", 
            "A scant 1/2 cup Nutella or another chocolate-hazelnut (gianduja) spread", 
            "Flavorings (see Note up top), if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/banana-nutella-and-salted-pistachio-popsicles1.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Photo", 
            "Popsicles", 
            "Quick", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/07/banana-nutella-and-salted-pistachio-popsicles/", 
        "title": "banana, nutella and salted pistachio popsicles", 
        "directions": [
            "Grind pistachios to a powder. Set aside.", 
            "Peel bananas and break them into chunks. Puree them with any flavorings you might want to add. You should have about 2 cups puree.", 
            "Scoop Nutella into a small plastic bag and snip off the corner. (Trust me, fake-piping it into the narry molds is easier than trying to spoon it in.) Pour a little banana into each mold, then squiggle in a little Nutella. Repeat a couple times, trying to make sure that every bite or two will have Nutella in it, using about 1 tablespoon of Nutella in each popsicle. Fill molds to about 1/4-inch before the top, to leave room for expansion when freeze.", 
            "If using molds that contain sticks or hold wooden ones in place, snap on lids and freeze until solid, about 5 hours. If using glasses or open cup molds, freeze until beginning to set (about 1 1/2 to 2 hours), then insert the sticks until freeze until fully solid. If using instant popsicle makers, I’m jealous, just follow the manufacturer’s instructions.", 
            "Once frozen, spread pistachios out on a cold plate. Unmold popsicles and roll them all or partially in the nuts. Go outside to eat them so you don’t sticky up the kitchen floor.", 
            "Popsicle molds: I use these guys. I have the metal version, which was all that was available when I bought them a couple years ago, but the metal parts are not dishwasher safe and don’t hold the popsicle sticks in place as well as I understand the plastic ones do, so if I were buying them again, I’d opt for plastic."
        ], 
        "date": "2013-07-26T11:38:56+00:00"
    }, 
    {
        "ingredient_list": [
            "Custard", 
            "3⁄4 cup (150 grams) granulated sugar", 
            "1⁄4 cup (35 grams) cornstarch", 
            "1/4 teaspoon fine salt", 
            "6 large egg yolks", 
            "3 1⁄2 cups (830 ml) milk, preferably whole", 
            "2 tablespoons (30 grams) butter, cut into a few bits", 
            "1 tablespoon (15 ml) vanilla", 
            "1 tablespoon (15 ml) dark rum (optional, but think it has an amazing impact here)", 
            "Wafers", 
            "1 cup (200 grams) granulated sugar", 
            "Seeds from 1/2 of a fresh vanilla bean", 
            "1/2 cup (115 grams) unsalted butter, softened", 
            "1 large egg", 
            "1 tablespoon (15 ml) vanilla extract", 
            "3/4 teaspoon baking powder", 
            "1/4 teaspoon fine sea salt", 
            "1 1/3 cups (176 grams) all-purpose flour", 
            "Assembly", 
            "1/2 cup heavy cream", 
            "2 teaspoons granulated sugar", 
            "4 large firm-ripe bananas, thinly slices"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/banana-puddings-with-vanilla-bean-wafers1.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Cookie", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2016/01/banana-pudding-with-vanilla-bean-wafers/", 
        "title": "banana puddings with vanilla bean wafers", 
        "directions": [
            "Make the custard: Whisk sugar, cornstarch, salt and yolks together in the bottom of a large saucepan, ideally 4-quarts to protect against splattering as it simmers. Drizzle in milk, whisking the whole time so that no lumps form. Place over medium heat on the stove and bring up to a simmer, stirring. Once simmering, stirring, until custard thickens, 4 to 7 minutes. Remove from heat; whisk in butter, vanilla, and rum. Let chill in fridge for several hours or overnight to finish thickening. You’ll have 4 cups custard.", 
            "Make the wafers: Heat oven to 350°F. In the bottom of a large bowl, combine sugar and vanilla been seeds, rubbing them together so that the abrasion from the sugar granules helps release the maximum vanilla flavor. Add the butter and beat with an electric mixer until light and fluffy. Add egg and vanilla, beat to combine. Sprinkle baking powder and salt over batter, beat to combine. Add flour and once again, beat just to combine.", 
            "Line two large baking sheets with parchment paper or nonstick baking mats. Using your tiniest scoop (yes, I actually have one that holds about 1 teaspoon), spoon or even a 1-teaspoon measuring spoon, scoop the dough (you can then roll it in your palms for a more perfect final round shape) and space at least 2 inches apart on prepared sheets. Bake 10 to 11 minutes, keeping a close eye on them. You’ll want them to be nicely golden at the edges before you take them out. Let cool on racks. Yield: About 80 1 3/4-inch cookies.", 
            "Assembly: Beat heavy cream with 2 teaspoons sugar until soft peaks form. Line the bottom of 8 1-cup dishes with a wafer cookie. Add custard (you’re looking to use about 1/3 of it total right now). Top with a layer of bananas. Repeat twice with more cookies (you can break them up to get them to fit better in small cups), custard and bananas. Dollop each pudding with whipped cream; chill (I prefer to do so with lids on so the whipped cream doesn’t dry out) for a few hours and up to a few days.", 
            "Jars Are Weck Tulip Jelly Jars (which I’d bought to keep baby food organized then, predictably, co-opted). I urge everyone to buy “keep fresh covers” for Weck jars. Clamps are adorable and photogenic but definitely annoying in the long run. I order them from Weck directly and save the gaskets and clamps for future canning projects."
        ], 
        "date": "2016-01-28T12:00:36+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/03/caramel-walnut-upside-down-banana-cake.jpg?w=749", 
        "tags": [
            "Bananas", 
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/03/caramel-walnut-upside-down-banana-cake/", 
        "title": "caramel walnut upside down banana cake", 
        "directions": [
            "For topping: Spray 9-inch round cake pan with 2-inch-high sides with nonstick spray. Bring butter, sugar, and corn syrup to boil in medium saucepan, stirring constantly until butter melts. Boil syrup 1 minute. Stir in nuts. Spread topping in prepared pan. Let topping cool completely.", 
            "For cake: Preheat oven to 350°F. Sift first 4 ingredients into medium bowl. Using electric mixer, beat butter and both sugars in large bowl until blended. Beat in eggs 1 at a time, then mashed bananas, sour cream, rum, and vanilla. Beat in dry ingredients in 2 additions just until combined. Spoon batter into pan.", 
            "Bake cake until tester inserted into center comes out clean, about 40 to 45 minutes. Cool 15 minutes. Cut around cake. Place platter over pan. Holding pan and platter together, turn over. Let stand 5 minutes, then gently lift off pan. Cool at least 15 minutes for topping to set. Serve warm or at room temperature with whipped cream or vanilla ice cream."
        ], 
        "date": "2008-03-20T08:10:57+00:00"
    }, 
    {
        "ingredient_list": [
            "3 large ripe-to-over-ripe bananas", 
            "1 large egg", 
            "1/3 cup (80 ml) virgin coconut oil, warmed until it liquefies, or olive oil", 
            "1/3 cup (65 grams) light brown sugar", 
            "1/4 to 1/3 cup (60 to 80 ml) maple syrup (less for less sweetness, of course)", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 teaspoon (5 grams) baking soda", 
            "1/4 teaspoon table salt", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon freshly grated nutmeg", 
            "Pinch of ground cloves", 
            "Salt", 
            "1 1/2 cups (180 grams) white whole-wheat flour (or flour mixture of your choice, see Note up top)", 
            "1/4 cup (50 grams) uncooked millet"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/09/crackly-banana-bread.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/09/crackly-banana-bread/", 
        "title": "crackly banana bread", 
        "directions": [
            "Preheat your oven to 350°F and butter a 9×5-inch loaf pan. In the bottom of a large bowl, mash bananas with a potato masher or the back of a wooden spoon until virtually smooth but a few tiny lumps remain. Whisk in egg, then oil, brown sugar, syrup and vanilla extract. Sprinkle baking soda, salt, cinnamon, nutmeg and cloves over mixture and stir until combined. Stir in flour until just combined, then millet. ", 
            "Pour mixture into prepared pan and bake until a tester comes out clean, about 40 to 50 minutes. Cool loaf in pan on rack. ", 
            "Do ahead: Loaves keep well in the freezer, wrapped tightly in plastic wrap, for a month or more. Ours kept at room temperature for a record week, becoming more moist each day."
        ], 
        "date": "2012-09-28T14:32:35+00:00"
    }, 
    {
        "ingredient_list": [
            "3 medium-to-large very ripe bananas", 
            "1/2 cup (115 grams) butter, melted", 
            "3/4 cup (145 grams) brown sugar (I use dark here; either light or dark work)", 
            "1 large egg", 
            "1 teaspoon pure vanilla extract", 
            "1 teaspoon baking soda", 
            "1/4 teaspoon table salt", 
            "1/2 teaspoon ground cinnamon (optional; I skip it)", 
            "1 cup (125 grams) all-purpose flour", 
            "1/2 cup Dutch-process cocoa powder", 
            "1 cup (about 6 ounces or 170 grams) semisweet or bittersweet chocolate chunks or chips"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/double-chocolate-banana-bread1.jpg?w=640", 
        "tags": [
            "Bananas", 
            "Chocolate", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/03/double-chocolate-banana-bread/", 
        "title": "double chocolate banana bread", 
        "directions": [
            "Heat your oven to 350°F. Butter a 9×5-inch loaf pan, or spray it with a nonstick baking spray.", 
            "Mash bananas in the bottom of a large bowl. (You’ll have a little over 1 cup mashed banana total.) Whisk in melted butter, then brown sugar, egg, and vanilla. Place baking soda, salt, cinnamon (if using), flour and cocoa powder in a sifter or fine-mesh strainer and sift over wet ingredients. (My cocoa is almost always lumpy, so this is essential for me.) Stir dry and wet ingredients with a spoon until just combined. Stir in chocolate chunks or chips.", 
            "Pour into prepared pan and bake 55 to 65 minutes, until a tester or toothpick inserted into the center of the cake comes out batter-free. (A melted chocolate chip smear is expected, however.) Cool in pan for 10 to 15 minutes, then run a knife around the edge and invert it out onto a cooling rack. Serve warm or at room temperature. ", 
            "The banana bread will keep for up to 4 days at room temperature. I keep mine wrapped in foil. It goes without saying that it has never actually lasted that long."
        ], 
        "date": "2014-03-17T12:33:32+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 ripe bananas, smashed", 
            "1/3 cup (75 grams) melted salted butter", 
            "3/4 to 1 cup (145 to 190 grams) light brown sugar (depending on the level of sweetness you prefer, I always use the smaller amount)", 
            "1 egg, beaten", 
            "1 teaspoon (5 ml) vanilla", 
            "1 tablespoon (15 ml) bourbon (optional)", 
            "1 teaspoon (5 grams) baking soda", 
            "Pinch of salt", 
            "1 teaspoon (3 grams) cinnamon", 
            "Up to 1/2 teaspoon (1) nutmeg", 
            "Pinch of ground cloves", 
            "1 1/2 cups (190 grams) flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/jacked-up-banana-bread.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Bourbon", 
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/jacked-up-banana-bread/", 
        "title": "jacked-up banana bread", 
        "directions": [
            "Preheat the oven to 350°F. With a wooden spoon, mix butter into the mashed bananas in a large mixing bowl. Mix in the sugar, egg, vanilla and bourbon, then the spices. Sprinkle the baking soda and salt over the mixture and mix in. Add the flour last, mix. Pour mixture into a buttered 4×8 inch loaf pan. Bake for 50 minutes to one hour, or until a tester comes out clean. Cool on a rack. Remove from pan and slice to serve.", 
            "Note: Due to my unhealthy obsession with tiny things, I split this into two mini-loaf pans. It took 45 minutes to bake two perfect halves, but of course, may run longer or shorter in your oven."
        ], 
        "date": "2006-11-16T18:00:50+00:00"
    }, 
    {
        "ingredient_list": [
            "5 1/4 cups (21 1/2 ounces or 609 grams) cake flour", 
            "1 tablespoon (1/2 ounce or 15 grams) baking powder", 
            "2 1/4 teaspoons (13 grams) baking soda", 
            "1 teaspoon (6 grams) salt", 
            "1 teaspoon (2 grams) cinnamon", 
            "1 1/2 cups (3 sticks, 12 ounces or 341 grams) unsalted butter, room temperature", 
            "1 1/2 cups (10 1/2 ounces or 300 grams) sugar [weights corrected 6/23/11]", 
            "1 1/2 cups (11 1/2 ounces or 327 grams) packed golden brown sugar", 
            "6 large eggs", 
            "3 cups mashed or pureed very ripe bananas (about 8 large)", 
            "1/2 cup plus 1 tablespoon (4 7/8 ounces or 136 grams) sour cream or (weight will vary) plain yogurt", 
            "1 tablespoon (15 ml) vanilla extract", 
            "3 1/2 cups (14 3/8 ounces or 406 grams) cake flour", 
            "2 teaspoons (10 grams) baking powder", 
            "1 1/2 teaspoons (8 grams) baking soda", 
            "3/4 teaspoon (5 grams) salt", 
            "3/4 teaspoon (2 grams) cinnamon", 
            "1 cup (2 sticks, 8 ounces or 227 grams) unsalted butter, room temperature", 
            "1 cup (7 ounces or 200 grams) sugar", 
            "1 cup (7 5/8 ounces or 218 grams) packed golden brown sugar", 
            "4 large eggs", 
            "2 cups mashed or pureed very ripe bananas (5 to 6 large)", 
            "6 tablespoons (3 1/4 ounces or 91 grams) sour cream or (weight will vary) plain yogurt", 
            "2 teaspoons (10 ml) vanilla extract", 
            "6 3/4 cups (28 1/2 ounces or 810 grams) confectioners’ sugar (no need to sift)", 
            "4 1/2 sticks (18 ounces or 510 grams) unsalted butter, at room temperature", 
            "9 tablespoons (135 ml) half-and-half or whole milk", 
            "1 1/2 tablespoons (23 ml) vanilla extract", 
            "8 ounces (226 grams) unsweetened chocolate, melted and cooled", 
            "4 1/2 cups (19 ounces or 540 grams) confectioners’ sugar (no need to sift)", 
            "1 1/2 cups (3 sticks, 12 ounces or 341 grams) unsalted butter, at room temperature", 
            "6 tablespoons (90 ml) half-and-half or whole milk", 
            "1 tablespoon (15 ml) vanilla extract", 
            "5 ounces (142 grams) unsweetened chocolate, melted and cooled"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/monkey-cake1.jpg?w=500", 
        "tags": [
            "Bananas", 
            "Cake", 
            "Celebration Cakes", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/09/monkey-cake/", 
        "title": "monkey cake", 
        "directions": [
            "Whirl all of the frosting ingredients except the melted chocolate in a food processor until smooth. Set aside about 3/4 cup of the white frosting for the lighter areas, eyes, nose and mouth, then add the chocolate to finish making the fudge frosting, and whirl it until light and smooth. You’ll use this frosting to fill and coat the majority of the monkey cake.", 
            "To the lighter frosting, you can add a small spoonful of the chocolate frosting and a drop or two of yellow food coloring for tinting, and set this aside in a small bowl. This will be the color you use for your monkey’s “face”.", 
            "Tip: If your kitchen is as hot and sticky as mine is in the summer, you’ll want to watch a frosting like this carefully to make sure it doesn’t get too melty and soft. If it does, periodically put the bowl of frosting and your partially frosting cake back in the fridge to let it firm up and cool down again, then resume where you left off.", 
            "Assembling Your Monkey Cake(s)", 
            "Option 1: A 2-layer 9-inch monkey cake with a 4 to 5-inch “smash” cake. This is what I did, but it had ended up yielding (and thus, wasting) more cake than necessary. My original plan had been to cut the third layer into ears for the large cake, and a two-layer, 4.5-inch diameter “smash” cake. And then I realized that a 2-layer, nearly 4-inch tall smash cake was going to be ridiculous, and made it only one layer instead. Have twins? This is totally the way to go, as you can make two 1-layer (or divide them into two layers, to mimic the big cake) smash cakes. One baby? You’ll waste less cake if you go with one of the options below.", 
            "How to: Firm up one of your cake layers in the freezer; this will make carving shapes from it much easier. Once firm, cut one or two 4 1/2-inch diameter round monkey “heads” from it, being sure to leave little bumps on either side for the ears. Cut two additional small circles from the cake scraps that remain, and cut them each in half, creating two half-moon shapes. These will become the ears of your larger cake. Place one of your large, untouched cake rounds on your serving platter. Slip little scraps of waxed paper underneath, all around. This will keep your platter clean as you decorate the cake. Pin a half-circle “ear” to each side of the cake with a toothpick. If your cake has domed a bit while baking, level it with a long serrated knife. Thickly top this layer with chocolate frosting. Put the second layer on top, and attach its ears with two additional toothpicks. Level it again, if needed (though a domed top layer is less of a decorating concern). With your lighter colored frosting, outline the shape of your monkey face on top. (A piping bag with a large, round tip or a zip-loc baggie with the corner snipped off makes this much easier.) Fill the shape in generously with the light frosting. With your dark chocolate frosting, coat the remainder of the cake and sides in a thin layer. This is your crumb coat, and it will keep those crumbs from getting into your final frosting. Once finished, pop your cake in the fridge so that the frosting firms up a bit. Once it has, generously frost the dark chocolate areas with a second coat of fudge frosting. Don’t worry about getting it perfectly smooth — everyone loves an imperfect homemade cake. Touch up the lighter area if needed with additional frosting. Put a small bit of fudge frosting in either a piping bag with a small round tip or a plastic bag with the corner cut off and use it to make the eyes, nose and mouth on the monkey. When you’re finished, remove the waxed paper scraps. Repeat this process on a smaller scale, minus the pinned-on ears, on your small monkey shape.", 
            "Option 2: A 2-layer 9-inch monkey cake with 1 cupcake “smash” cake. Make the amount of batter for a two-layer cake, and pour off 3 cupcake’s worth of batter into buttered and floured cupcake molds.", 
            "How to:  Cut two of your cupcakes half, to form four half-moon shapes. These will become the ears of your larger cake. Place one of your large cake rounds on your serving platter. Slip little scraps of waxed paper underneath, all around. This will keep your platter clean as you decorate the cake. Pin a half-circle “ear” to each side of the cake with a toothpick. If your cake has domed a bit while baking, level it with a long serrated knife. Thickly top this layer with chocolate frosting. Put the second layer on top, and attach its ears with two additional toothpicks. Level it again, if needed (though a domed top layer is less of a decorating concern). With your lighter colored frosting, outline the shape of your monkey face on top. (A piping bag with a large, round tip or a zip-loc baggie with the corner snipped off makes this much easier.) Fill the shape in generously with the light frosting. With your dark chocolate frosting, coat the remainder of the cake and sides in a thin layer. This is your crumb coat, and it will keep those crumbs from getting into your final frosting. Once finished, pop your cake in the fridge so that the frosting firms up a bit. Once it has, generously frost the dark chocolate areas with a second coat of fudge frosting. Don’t worry about getting it perfectly smooth — everyone loves an imperfect homemade cake. Touch up the lighter area if needed with additional frosting. Put a small bit of fudge frosting in either a piping bag with a small round tip or a plastic bag with the corner cut off and use it to make the eyes, nose and mouth on the monkey. When you’re finished, remove the waxed paper scraps. Pipe or ice your last cupcake with a similar monkey face — this will be your “smash” cake for the baby. ", 
            "Option 3: A 2-layer 9-inch monkey cake and no “smash” cake. Don’t need or want a smash cake? Don’t feel like pinning ears to a larger cake and worrying about forgetting to take the toothpicks out? Just make 2 9-inch layers, and modify the monkey shape ever so slightly to include ears in one piece.", 
            "How to:  Firm up your cake layers in the freezer; this will make carving shapes from it much easier. Carefully trim each layer into a round monkey head with two half-circle ears coming out at 9 and 3 o’clock. Place the first one on your serving platter. Slip little scraps of waxed paper underneath, all around. This will keep your platter clean as you decorate the cake. If your cake has domed a bit while baking, level it with a long serrated knife. Thickly top this layer with chocolate frosting. Put the second layer on top and level it again, if needed (though a domed top layer is less of a decorating concern). With your lighter colored frosting, outline the shape of your monkey face on top. (A piping bag with a large, round tip or a zip-loc baggie with the corner snipped off makes this much easier.) Fill the shape in generously with the light frosting. With your dark chocolate frosting, coat the remainder of the cake and sides in a thin layer. This is your crumb coat, and it will keep those crumbs from getting into your final frosting. Once finished, pop your cake in the fridge so that the frosting firms up a bit. Once it has, generously frost the dark chocolate areas with a second coat of fudge frosting. Don’t worry about getting it perfectly smooth — everyone loves an imperfect homemade cake. Touch up the lighter area if needed with additional frosting. Put a small bit of fudge frosting in either a piping bag with a small round tip or a plastic bag with the corner cut off and use it to make the eyes, nose and mouth on the monkey. When you’re finished, remove the waxed paper scraps.", 
            "What, no downloadable PDF stencils for the cake? Yeah, it was a bummer for me as well to realize that I’m not Martha Stewart this weekend, and don’t have the graphic designers on staff to make this kind of stuff for me. Nor, does it turn out, do I have a single drawing program on my computer. Thus, if you’re itching for a visual, we’re just going to have to kick it old school with my low-fi doodles, m’kay?", 
            ""
        ], 
        "date": "2010-09-20T18:29:25+00:00"
    }
]