{
  "date": "2010-09-20T18:29:25+00:00",
  "directions": [
    "Whirl all of the frosting ingredients except the melted chocolate in a food processor until smooth. Set aside about 3/4 cup of the white frosting for the lighter areas, eyes, nose and mouth, then add the chocolate to finish making the fudge frosting, and whirl it until light and smooth. You’ll use this frosting to fill and coat the majority of the monkey cake.",
    "To the lighter frosting, you can add a small spoonful of the chocolate frosting and a drop or two of yellow food coloring for tinting, and set this aside in a small bowl. This will be the color you use for your monkey’s “face”.",
    "Tip: If your kitchen is as hot and sticky as mine is in the summer, you’ll want to watch a frosting like this carefully to make sure it doesn’t get too melty and soft. If it does, periodically put the bowl of frosting and your partially frosting cake back in the fridge to let it firm up and cool down again, then resume where you left off.",
    "Assembling Your Monkey Cake(s)",
    "Option 1: A 2-layer 9-inch monkey cake with a 4 to 5-inch “smash” cake. This is what I did, but it had ended up yielding (and thus, wasting) more cake than necessary. My original plan had been to cut the third layer into ears for the large cake, and a two-layer, 4.5-inch diameter “smash” cake. And then I realized that a 2-layer, nearly 4-inch tall smash cake was going to be ridiculous, and made it only one layer instead. Have twins? This is totally the way to go, as you can make two 1-layer (or divide them into two layers, to mimic the big cake) smash cakes. One baby? You’ll waste less cake if you go with one of the options below.",
    "How to: Firm up one of your cake layers in the freezer; this will make carving shapes from it much easier. Once firm, cut one or two 4 1/2-inch diameter round monkey “heads” from it, being sure to leave little bumps on either side for the ears. Cut two additional small circles from the cake scraps that remain, and cut them each in half, creating two half-moon shapes. These will become the ears of your larger cake. Place one of your large, untouched cake rounds on your serving platter. Slip little scraps of waxed paper underneath, all around. This will keep your platter clean as you decorate the cake. Pin a half-circle “ear” to each side of the cake with a toothpick. If your cake has domed a bit while baking, level it with a long serrated knife. Thickly top this layer with chocolate frosting. Put the second layer on top, and attach its ears with two additional toothpicks. Level it again, if needed (though a domed top layer is less of a decorating concern). With your lighter colored frosting, outline the shape of your monkey face on top. (A piping bag with a large, round tip or a zip-loc baggie with the corner snipped off makes this much easier.) Fill the shape in generously with the light frosting. With your dark chocolate frosting, coat the remainder of the cake and sides in a thin layer. This is your crumb coat, and it will keep those crumbs from getting into your final frosting. Once finished, pop your cake in the fridge so that the frosting firms up a bit. Once it has, generously frost the dark chocolate areas with a second coat of fudge frosting. Don’t worry about getting it perfectly smooth — everyone loves an imperfect homemade cake. Touch up the lighter area if needed with additional frosting. Put a small bit of fudge frosting in either a piping bag with a small round tip or a plastic bag with the corner cut off and use it to make the eyes, nose and mouth on the monkey. When you’re finished, remove the waxed paper scraps. Repeat this process on a smaller scale, minus the pinned-on ears, on your small monkey shape.",
    "Option 2: A 2-layer 9-inch monkey cake with 1 cupcake “smash” cake. Make the amount of batter for a two-layer cake, and pour off 3 cupcake’s worth of batter into buttered and floured cupcake molds.",
    "How to:  Cut two of your cupcakes half, to form four half-moon shapes. These will become the ears of your larger cake. Place one of your large cake rounds on your serving platter. Slip little scraps of waxed paper underneath, all around. This will keep your platter clean as you decorate the cake. Pin a half-circle “ear” to each side of the cake with a toothpick. If your cake has domed a bit while baking, level it with a long serrated knife. Thickly top this layer with chocolate frosting. Put the second layer on top, and attach its ears with two additional toothpicks. Level it again, if needed (though a domed top layer is less of a decorating concern). With your lighter colored frosting, outline the shape of your monkey face on top. (A piping bag with a large, round tip or a zip-loc baggie with the corner snipped off makes this much easier.) Fill the shape in generously with the light frosting. With your dark chocolate frosting, coat the remainder of the cake and sides in a thin layer. This is your crumb coat, and it will keep those crumbs from getting into your final frosting. Once finished, pop your cake in the fridge so that the frosting firms up a bit. Once it has, generously frost the dark chocolate areas with a second coat of fudge frosting. Don’t worry about getting it perfectly smooth — everyone loves an imperfect homemade cake. Touch up the lighter area if needed with additional frosting. Put a small bit of fudge frosting in either a piping bag with a small round tip or a plastic bag with the corner cut off and use it to make the eyes, nose and mouth on the monkey. When you’re finished, remove the waxed paper scraps. Pipe or ice your last cupcake with a similar monkey face — this will be your “smash” cake for the baby. ",
    "Option 3: A 2-layer 9-inch monkey cake and no “smash” cake. Don’t need or want a smash cake? Don’t feel like pinning ears to a larger cake and worrying about forgetting to take the toothpicks out? Just make 2 9-inch layers, and modify the monkey shape ever so slightly to include ears in one piece.",
    "How to:  Firm up your cake layers in the freezer; this will make carving shapes from it much easier. Carefully trim each layer into a round monkey head with two half-circle ears coming out at 9 and 3 o’clock. Place the first one on your serving platter. Slip little scraps of waxed paper underneath, all around. This will keep your platter clean as you decorate the cake. If your cake has domed a bit while baking, level it with a long serrated knife. Thickly top this layer with chocolate frosting. Put the second layer on top and level it again, if needed (though a domed top layer is less of a decorating concern). With your lighter colored frosting, outline the shape of your monkey face on top. (A piping bag with a large, round tip or a zip-loc baggie with the corner snipped off makes this much easier.) Fill the shape in generously with the light frosting. With your dark chocolate frosting, coat the remainder of the cake and sides in a thin layer. This is your crumb coat, and it will keep those crumbs from getting into your final frosting. Once finished, pop your cake in the fridge so that the frosting firms up a bit. Once it has, generously frost the dark chocolate areas with a second coat of fudge frosting. Don’t worry about getting it perfectly smooth — everyone loves an imperfect homemade cake. Touch up the lighter area if needed with additional frosting. Put a small bit of fudge frosting in either a piping bag with a small round tip or a plastic bag with the corner cut off and use it to make the eyes, nose and mouth on the monkey. When you’re finished, remove the waxed paper scraps.",
    "What, no downloadable PDF stencils for the cake? Yeah, it was a bummer for me as well to realize that I’m not Martha Stewart this weekend, and don’t have the graphic designers on staff to make this kind of stuff for me. Nor, does it turn out, do I have a single drawing program on my computer. Thus, if you’re itching for a visual, we’re just going to have to kick it old school with my low-fi doodles, m’kay?",
    ""
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/monkey-cake1.jpg?w=500",
  "ingredient_list": [
    "5 1/4 cups (21 1/2 ounces or 609 grams) cake flour",
    "1 tablespoon (1/2 ounce or 15 grams) baking powder",
    "2 1/4 teaspoons (13 grams) baking soda",
    "1 teaspoon (6 grams) salt",
    "1 teaspoon (2 grams) cinnamon",
    "1 1/2 cups (3 sticks, 12 ounces or 341 grams) unsalted butter, room temperature",
    "1 1/2 cups (10 1/2 ounces or 300 grams) sugar [weights corrected 6/23/11]",
    "1 1/2 cups (11 1/2 ounces or 327 grams) packed golden brown sugar",
    "6 large eggs",
    "3 cups mashed or pureed very ripe bananas (about 8 large)",
    "1/2 cup plus 1 tablespoon (4 7/8 ounces or 136 grams) sour cream or (weight will vary) plain yogurt",
    "1 tablespoon (15 ml) vanilla extract",
    "3 1/2 cups (14 3/8 ounces or 406 grams) cake flour",
    "2 teaspoons (10 grams) baking powder",
    "1 1/2 teaspoons (8 grams) baking soda",
    "3/4 teaspoon (5 grams) salt",
    "3/4 teaspoon (2 grams) cinnamon",
    "1 cup (2 sticks, 8 ounces or 227 grams) unsalted butter, room temperature",
    "1 cup (7 ounces or 200 grams) sugar",
    "1 cup (7 5/8 ounces or 218 grams) packed golden brown sugar",
    "4 large eggs",
    "2 cups mashed or pureed very ripe bananas (5 to 6 large)",
    "6 tablespoons (3 1/4 ounces or 91 grams) sour cream or (weight will vary) plain yogurt",
    "2 teaspoons (10 ml) vanilla extract",
    "6 3/4 cups (28 1/2 ounces or 810 grams) confectioners’ sugar (no need to sift)",
    "4 1/2 sticks (18 ounces or 510 grams) unsalted butter, at room temperature",
    "9 tablespoons (135 ml) half-and-half or whole milk",
    "1 1/2 tablespoons (23 ml) vanilla extract",
    "8 ounces (226 grams) unsweetened chocolate, melted and cooled",
    "4 1/2 cups (19 ounces or 540 grams) confectioners’ sugar (no need to sift)",
    "1 1/2 cups (3 sticks, 12 ounces or 341 grams) unsalted butter, at room temperature",
    "6 tablespoons (90 ml) half-and-half or whole milk",
    "1 tablespoon (15 ml) vanilla extract",
    "5 ounces (142 grams) unsweetened chocolate, melted and cooled"
  ],
  "tags": [
    "Bananas",
    "Cake",
    "Celebration Cakes",
    "Chocolate",
    "Photo"
  ],
  "title": "monkey cake",
  "url": "https://smittenkitchen.com/2010/09/monkey-cake/"
}