[
    {
        "ingredient_list": [
            "1 1/2 cups dried lentils de puy or other small green lentils", 
            "1 tablespoon olive oil", 
            "2 medium zucchinis (about 6 ounces each), diced", 
            "1 small or 1/2 medium onion, diced", 
            "Leaves from 3 fresh sprigs thyme", 
            "2 small or 1 large garlic cloves, minced", 
            "Salt and freshly ground black pepper", 
            "1 1/4 cups fresh basil leaves", 
            "2 teaspoons smooth Dijon mustard, plus more to taste", 
            "1 tablespoon plus 2 teaspoons red or white wine vinegar", 
            "6 tablespoons olive oil", 
            "Salt and freshly ground black pepper", 
            "2 large balls of burrata (or 4 smaller ones), at room temperature (see Note up top)", 
            "Sea salt and more black pepper", 
            "A few small basil leaves for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_5165.jpg?w=750", 
        "tags": [
            "Beans", 
            "Italian", 
            "Photo", 
            "Summer", 
            "Summer Squash", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2016/08/burrata-with-lentils-and-basil-vinaigrette/", 
        "title": "burrata with lentils and basil vinaigrette", 
        "directions": [
            "Cook lentils: Pick over and rinse lentils. Place them in a medium saucepan and cover with 3 inches of cold water, seasoned well with salt. Simmer the lentils over medium heat for 25 to 30 minutes, until firm-tender. Drain and set aside.\nMeanwhile, make vinaigrette: Blend basil, mustard and vinegar together in a food processor. With machine running, drizzle in olive oil in a thin stream. Season well with salt and black pepper. You’ll need to scrape the machine down a few times to get all of the leaves minced. No food processor? Very finely mince leaves on a cutting board with a sharp knife. Place in medium bowl and whisk with mustard and vinegar. Drizzle in olive oil in a thin stream, whisking the whole time. Season well with salt and pepper.\nIn a large frying pan, heat 1 tablespoon olive oil over medium heat. Add zucchini, onion, thyme, salt and pepper and cooking, stirring frequently, until softened and just barely picking up color, about 9 minutes. Add garlic and cook 1 minute more. Add cooked lentils back to pan and stir to mix and re-warm; you can add a splash of water if they’re sticking. Adjust seasonings to taste.", 
            "Assemble: Transfer lentil-vegetable mixture to a large, wide serving bowl and stir in 2/3 of vinaigrette. Place intact* burratas on top and then cut into quarters with a sharp knife so you don’t miss any of the wonderful stuff that spills out. The warmth of the lentils will melt it further. Drizzle with a little extra vinaigrette, a few pinches of sea salt and a couple extra grinds of black pepper. Scatter basil leaves over and dig in.\n(* Unless you’re me and tripped walking home from errands yesterday because you were carrying too much and smashed blueberries, cherries, heirloom tomatoes and burratas and now I am grumpy despite having a Muppet bandaid on each knee.)"
        ], 
        "date": "2016-08-16T12:10:11+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups (160 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "8 tablespoons (4 ounces or 113 grams) cold unsalted butter, cut into pieces and chill again", 
            "1/4 cup (60 grams) plain yogurt or sour cream", 
            "2 teaspoons (10 ml) fresh lemon juice", 
            "1/4 cup (60 ml) ice water", 
            "For the filling:", 
            "1 tablespoon (15 ml) olive oil", 
            "1/4 teaspoon coarse Kosher or sea salt", 
            "3 cups (about 450 grams) cherry or grape tomatoes", 
            "1 ear corn, cut from the cob (about 1 cup)", 
            "1 small (8 ounces or 225 grams) zucchini or summer squash, diced", 
            "1 bundle (3 to 4 ounces or 85 to 115 grams) scallions, thinly sliced", 
            "1/2 cup (2 ounces or 55 grams) grated parmesan", 
            "Glaze:", 
            "1 egg yolk beaten with 1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/burst-tomato-zucchini-and-corn-galette.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Corn", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Quiche", 
            "Tomatoes", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2013/08/burst-tomato-galette-with-corn-and-zucchini/", 
        "title": "burst tomato galette with corn and zucchini", 
        "directions": [
            "Make dough: Whisk stir the flour and salt in a large bowl. Sprinkle bits of butter over dough and using a pastry blender or your fingertips, work it into the flour until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, stir together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball. Wrap with plastic and refrigerate for 1 hour, or up to 2 days.", 
            "Make filling: Get down the saute pan with the lid. If you don’t have one, any large lid will do. Add olive oil, tomatoes, salt and a pinch of red pepper flakes (if that’s your thing) to your saute pan then cover and heat over high heat. Roll the tomatoes around from time to time so that they’ll cook evenly. In a few minutes, you’ll hear some putts and pops as the tomatoes burst a little. When most have, remove lid, turn heat down to medium and add zucchini chunks. Saute for two minutes, until they soften. Add corn and cook one minute. Add scallions, just stirring them in, then turn off heat. Adjust seasonings if needed. Transfer mixture to a large plate and spread it out, so that it will cool faster. You want it cooled to at least lukewarm before assembling the galette.", 
            "Assemble galette: Heat oven to 400 degrees. On a floured counter, roll the dough out into a 12-inch round and it really doesn’t need to be perfectly shaped. Transfer to a parchment-lined baking sheet; I like to fold my dough gently, without creasing, in quarters then unfold it onto the baking pan. Sprinkle tomato-zucchini-corn mixture with half of parmesan and spoon the mixture into the center of the dough, leaving a 2-inch border. If any liquid has puddle in plate, try to leave it there as you spoon. Sprinkle with almost all of remaining parmesan, leaving a pinch or two behind for the crust. Fold the border over the filling, pleating the edge to make it fit. The center will be open. Brush crust with egg yolk glaze. Sprinkle glaze with last pinches of parmesan.", 
            "Bake the galette: For 30 to 40 minutes, or until puffed and golden brown. Remove from the oven and let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature."
        ], 
        "date": "2013-08-05T12:19:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound red radishes (from about 2/3 of a bundle with stems and leaves), trimmed", 
            "1 small (4 to 5 ounces) zucchini, long and narrow if you can find it", 
            "2 limes", 
            "Salt", 
            "4 ears corn, husks removed", 
            "2 tablespoons unsalted butter", 
            "1 tablespoon olive oil, plus additional if blistering tacos in skillet", 
            "1 medium white onion, finely chopped", 
            "2 cloves garlic, minced", 
            "3 tablespoons chopped epazote (if you can find it), cilantro or pasley (for the cilantro-averse) leaves (optional)", 
            "1/2 cup (2 1/2 ounces or 70 grams) crumbled cotija cheese (or another salty, crumbly cheese such as ricotta salata or feta)", 
            "1/4 teaspoon chili powder", 
            "10 to 12 small (6-inch) soft corn tortillas"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/07/charred-corn-tacos-with-zucchini-radish-slaw.jpg?w=750", 
        "tags": [
            "Corn", 
            "Photo", 
            "Radishes", 
            "Summer", 
            "Tex-Mex", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2011/07/charred-corn-tacos-with-zucchini-radish-slaw/", 
        "title": "charred corn tacos with zucchini-radish slaw", 
        "directions": [
            "Cut radishes and zucchini into tiny matchsticks with a mandoline. If you don’t have a mandoline, you can use a peeler to peel thick ribbons down the long side of the zucchini. Stack the ribbons and cut them crosswise into thin matchsticks. Cut the radishes into a similar shape by hand. Toss radishes and zucchini together. Squeeze the juice of half a lime over the radish and season with salt to taste. Add more lime juice if desired. Set aside.", 
            "Remove toddlers from the kitchen. Over a hot grill or an open gas-stove flame char two of the ears of corn until well-blackened but not completely burnt. If you’re using the burner method, you’ll probably, quickly, notice that corn likes to pop and snap, occasionally spraying you with splats of corn. It’s a little scary, which is I why I suggest you remove anyone small and easily harmed before you begin. However, I found the charred corn flavor to be completely worth the scare and hope you do too. ", 
            "Remove cobs from heat, and when cool enough to handle, shave off kernels using a large knife and reserve. Remove kernels from remaining two ears of corn.", 
            "Heat a large sauté pan over medium heat. Melt the butter and oil together and once hot, add the onion. Cook the onion for about 5 minutes, until softened. Add the garlic and cook another minute. Add the raw corn kernels and sauté until corn is just cooked through, about three to five minutes. Turn heat to high, add the charred kernels of corn to the mixture, and toss to combine until heated through. Squeeze the juice of one lime over the corn mixture, and use the juice to scrape up any stuck bits. Season the corn mixture with salt and chili powder. Stir in chopped herbs, if using.", 
            "You can heat your tortillas one of two ways. You can wrap the whole stack in foil and place it in a warm (250 degrees) oven for 15 minutes while you prepare the other ingredients. However, I prefer to get a nice blister on them before filling them. Coat the bottom of a cast-iron skillet with olive oil and wipe it out so on the thinnest slick remains. Heat the skillet on high. Once hot, cook a tortilla for about 30 seconds to 1 minute on each side, until lightly blistered. Repeat with remaining tortillas but if your skillet is well-seasoned, no need to repeat the oiling process.", 
            "Fill each taco with a few small spoonfuls of the corn mixture. Top with a spoonful of crumbled cheese and a bit of the radish-zucchini slaw. Serve with an extra lime wedge on the side (you’ll have half a lime left to slice up), and whatever fixings you like (sour cream, avocado wedges, etc. See above)."
        ], 
        "date": "2011-07-21T13:58:00+00:00"
    }, 
    {
        "ingredient_list": [
            "8 ounces pasta, any shape you like", 
            "1 tablespoon olive oil", 
            "1 pound summer squash, halved lengthwise and sliced thin", 
            "1 teaspoon finely grated lemon zest (you won’t need this yet, but better to zest before juicing, to avoid grumpiness)", 
            "Juice of half a lemon", 
            "3 tablespoons (45 grams) unsalted butter", 
            "2 cloves garlic, minced", 
            "3 large or 5 skinny scallions, sliced thin and white/pale green parts and dark green tops in separate piles", 
            "Pinches of red pepper flakes, to taste", 
            "3 tablespoons (25 grams) all-purpose flour", 
            "1 1/2 cups milk, ideally whole but low-fat will also work", 
            "1/4 cup chopped flat-leaf parsley, divided", 
            "1 tablespoon finely chopped mixed herbs of your choice (I used a mix of thyme, oregano and mint, but if you only have, say, thyme or oregano, a full tablespoon will likely overwhelm, so use less)", 
            "Salt and more pepper to taste", 
            "3/4 cup finely grated parmesan or aged pecorino romano cheese, divided", 
            "4 ounces (115 grams) mozzarella, cut into small cubes"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/herbed-summer-squash-pasta-bake1.jpg?w=640", 
        "tags": [
            "Freezer Friendly", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Summer", 
            "Summer Squash", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2015/06/herbed-summer-squash-pasta-bake/", 
        "title": "herbed summer squash pasta bake", 
        "directions": [
            "Cook the pasta: If you’ve got an oven-save 3-quart deep skillet or braising pan, use it here and you’ll only need one pot for the whole recipe. Otherwise, bring an medium/large pot of well-salted water to a boil. Add pasta and cook until al dente, about 1 to 2 minutes before perfect doneness. Drain and set aside.", 
            "Heat oven: To 400 degrees.", 
            "Prepare the squash: Heat a large skillet or the pot you just used to cook your pasta to high heat. Once hot, add olive oil, and let it heat until almost smoking. Add sliced squash, season it with salt and pepper flakes and let it sear underneath, unmoved, until golden brown. Continue to saute until browned and somewhat wilted, about 10 minutes, trying to get some color on each layer before moving squash around. Transfer to a bowl and squeeze lemon juice over bowl. Add more salt or pepper if needed.", 
            "Make the sauce: Reheat your the same pot over medium heat. Melt butter in bottom of pan. Add scallion white and pale green parts and garlic and let sizzle for 1 to 2 minutes. Add flour and stir until all has been dampened and absorbed. Add milk, a very small splash at a time, stirring the whole time with a spoon. Make sure each splash has been fully mixed into the butter/flour/onion/garlic mixture, scraping from the bottom of the pan and all around, before adding the next splash. Repeat until all milk has been added, then add lemon zest, salt and pepper to taste. Let mixture simmer together for 2 minutes, stirring frequently; the sauce will thicken. Remove pan from heat and stir in half of chopped parsley, all of mixed herbs and reserved scallion greens. Adjust seasoning to taste.", 
            "Assemble dish: Off the heat, add drained pasta, summer squash, 1/2 cup grated parmesan and all of the mozzarella to the pot, stirring to combine. If pan is ovenproof, you can bake your final dish in it. If not, transfer mixture to a 2 to 3 quart ovenproof casserole or baking dish. Sprinkle with remaining 1/4 cup parmesan.", 
            "Bake: For 25 to 30 minutes, until edges of pasta are golden brown and irresistible. Sprinkle with reserved parsley and serve hot. Reheat as needed.", 
            "To freeze: Let dish fully cool to room temperature, then transfer, wrapped well, to the freezer. Let defrost in fridge for a day before rewarming in oven. If I have time, I like to rewarm at a lowish head (300 to 325 degrees) with the foil on, then finish it for the last 10 minutes or so at a higher heat without the foil to restore some crisp."
        ], 
        "date": "2015-06-22T12:03:00+00:00"
    }, 
    {
        "ingredient_list": [
            "For sauce", 
            "1 cup plain yogurt (preferably whole-milk)", 
            "2 tablespoons chopped fresh mint", 
            "1 teaspoon minced garlic", 
            "1/8 teaspoon salt", 
            "For zucchini", 
            "3 tablespoons fresh lemon juice", 
            "1 teaspoon sugar", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "1/3 cup olive oil (we used about half of this)", 
            "2 medium zucchini (1 1/4 lb total), cut crosswise into 1/2-inch-thick slices (don’t skim on their thickness, or you will have difficulty threading them, as we did)", 
            "For kefta (meatballs)", 
            "2 slices firm white sandwich bread, torn into small pieces", 
            "1 small onion, finely chopped (about 1 cup)", 
            "1/4 cup loosely packed fresh parsley leaves", 
            "1/4 cup loosely packed fresh cilantro leaves", 
            "1 lb ground lamb (from shoulder) (or if, like Deb, you do not like lamb, dark turkey meat is an excellent substitution)", 
            "1 teaspoon salt", 
            "1/2 teaspoon ground allspice", 
            "1/2 teaspoon cayenne", 
            "1/4 teaspoon cinnamon", 
            "1/4 teaspoon black pepper", 
            "1/3 cup pine nuts, toasted and finely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/kefta-and-zucchini-kebabs1.jpg?w=500", 
        "tags": [
            "Grilling", 
            "Meat", 
            "Photo", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2008/08/kefta-and-zucchini-kebabs/", 
        "title": "kefta and zucchini kebabs", 
        "directions": [
            "Special equipment: 12 (10-inch) wooden skewers, soaked in cold water for 30 minutes", 
            "Make sauce: Stir together yogurt, mint, garlic, and salt in a small bowl and chill.", 
            "Prepare zucchini: Whisk together lemon juice, sugar, salt, pepper, and oil in a large bowl and stir in zucchini slices. Marinate at room temperature while making meatballs.", 
            "Make meatballs: Cover bread with water in a bowl and soak 10 minutes. Squeeze handfuls of bread to remove as much excess water as possible, then transfer to a bowl.", 
            "Pulse onion and herbs in a food processor until finely chopped, then add to bread along with lamb, salt, spices, and pine nuts. Mix with your hands until well blended. Form lamb mixture into 36 balls (1 scant tablespoon each).", 
            "Assemble and grill kebabs: Prepare grill for cooking over medium-hot charcoal (moderate heat for gas; see cooks’ note below). Thread 6 meatballs 1/4 inch apart onto each of 6 skewers. Thread zucchini lengthwise onto remaining 6 skewers (5 slices per skewer), so cut sides are on the grill, leaving 1/4 inch between slices. Grill zucchini and lamb on oiled grill rack, turning over once, until golden and just cooked through, 4 to 6 minutes. Serve warm, with yogurt sauce.", 
            "Grilling procedure: On a charcoal grill: Open vents on bottom of grill, then light charcoal. When charcoal turns grayish white (about 15 minutes from lighting), hold your hand 5 inches above grill rack to determine heat for charcoal as follows. Hot: when you can hold your hand there for 1 to 2 seconds; medium-hot: 3 to 4 seconds; low: 5 to 6 seconds.", 
            "On a gas grill: preheat burners on high, covered, 10 minutes, then, if necessary, reduce to heat specified in recipe.", 
            "If you don’t have a grill: Kebabs can be broiled on 2 large shallow baking pans 5 inches from heat, turning over once, until golden and just cooked through, 4 to 6 minutes."
        ], 
        "date": "2008-08-19T08:36:21+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound medium zucchini", 
            "1 large baking potato (3/4 pound), peeled", 
            "1 small onion (4 ounces), peeled", 
            "1/2 cup matzo meal", 
            "1 large egg, lightly beaten", 
            "1 teaspoon fresh lemon juice", 
            "1 1/2 teaspoons salt", 
            "1/2 teaspoon freshly ground pepper", 
            "Vegetable oil, for frying "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/latke-minus-vodka1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Photo", 
            "Summer", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2006/12/latke-minus-vodka/", 
        "title": "zucchini latkes", 
        "directions": [
            "Halve the zucchini crosswise. Cut the zucchini flesh off the seedy center and coarsely grate it in a food processor. Or grate it on a box grater until you reach the seedy center. Discard the center. In a food processor or on a box grater, coarsely grate the potato and onion. Transfer the grated zucchini, potato and onion to a colander and squeeze dry. Let stand for 2 minutes, then squeeze again. Transfer the vegetable mixture to a large bowl. Add the matzo meal, egg, lemon juice, salt and pepper and stir to combine.", 
            "In a medium skillet, heat 2 tablespoons of vegetable oil until shimmering. Drop packed teaspoons of the zucchini mixture into the skillet and flatten them with the back of a spoon. Cook the latkes over moderately high heat until the edges are golden, about 1 1/2 minutes; flip and cook until golden on the bottom, about 1 minute. Drain on paper towels. Repeat with the remaining zucchini mixture, adding more oil to the skillet as needed.", 
            "Do ahead: The fried latkes can be kept at room temperature for up to 4 hours. Reheat them on a dark baking sheet in a 375°F oven for about 5 minutes, or until warmed through and crisp."
        ], 
        "date": "2006-12-16T11:45:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 batch Simplest Pizza Dough or a store-bought pizza dough that will yield one small (approx. 11 to 12 inches across), thin pizza", 
            "1 lemon", 
            "4 ounces goat cheese, at room temperature", 
            "Few leaves of fresh basil, cut into thin slivers", 
            "1/2 medium yellow zucchini, sliced as thinly as you can pull off with a knife or your mandoline (I went for 1/8-inch thick with mine)", 
            "1/2 medium green zucchini, sliced as the same as above", 
            "Drizzle of olive oil", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/lemony-zucchini-goat-cheese-pizza.jpg?w=753", 
        "tags": [
            "Citrus", 
            "Photo", 
            "Pizza", 
            "Summer", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2009/07/lemony-zucchini-goat-cheese-pizza/", 
        "title": "lemony zucchini goat cheese pizza", 
        "directions": [
            "Preheat your oven to 450 degrees. Roll your pizza dough into a thin 12-inch circle and lay it on a tray or stone that has been dusted lightly with cornmeal.", 
            "In a small bowl, stir together the goat cheese with the juice of half your lemon. Season it with salt and freshly ground pepper, and spread it over your pizza dough. Scatter fresh basil slivers over the cheese.", 
            "Arrange your zucchini coins in concentric circles over the goat cheese spread, overlapping them slightly. You can alternate their colors, if you’re feeling fancy. Squeeze the juice of the second half of your lemon on top of you zucchini, then drizzle with olive oil and finish with more salt and freshly ground black pepper.", 
            "Bake in preheated oven for 10 to 15 minutes (your baking time will vary, so please watch carefully), or until the edges of your pizza are golden brown and the zucchini looks roasted and a little curled up at the edges. Serve with a green or even simple tomato salad and please, have a glass of crisp white wine for me.  Okay, two. It has been a while."
        ], 
        "date": "2009-07-09T20:02:19+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/pasta-and-fried-zucchini-salad1.jpg?w=640", 
        "tags": [
            "Pasta", 
            "Peas", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Summer Squash", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2014/06/pasta-and-fried-zucchini-salad/", 
        "title": "pasta and fried zucchini salad", 
        "directions": [
            "Bring a large pot of salted water to a boil. ", 
            "While you’re waiting, in a medium saucepan or skillet, heat sunflower oil over medium-high heat. Fry zucchini slices in batches for about 3 to 4 minutes, flipping once, until golden on both sides. [Update to add: If your zucchini isn’t browning right away, bump up the heat until it does in just a few minutes.] Drain in colander, shaking with a couple pinches of salt, then transfer to a large bowl and pour vinegar on top. Set aside.", 
            "In the hot water, cook edamame for 3 minutes, frozen peas for 3 to 4 minutes, or fresh peas for 1 to 2 minutes (to taste). Drain and run cool water over until lukewarm. Set aside to dry. Leave pot boiling, then cook pasta until al dente in it. Drain and rinse under cold water. ", 
            "Combine half of basil and all of the parsley and olive oil in a food processor or blender. Blend until smooth, then season with salt and pepper.", 
            "Transfer pasta back to empty pot. Add fried zucchini and any juices, basil-parsley oil, edamame or peas, lemon zest, capers and mozzarella. Stir gently together, then season generously with salt and pepper. Right before you serve it, stir in remaining basil leaves. ", 
            "Do ahead: Assembled dish keeps in the fridge for at least a day, or so I hear."
        ], 
        "date": "2014-06-09T11:53:03+00:00"
    }, 
    {
        "ingredient_list": [
            "1 to 2 tablespoons olive oil", 
            "2 tablespoons thinly sliced almonds", 
            "1 medium or 2 small zucchinis, cut into 1/8-inch matchsticks", 
            "Salt and freshly ground pepper", 
            "Peelings of pecorino romano or parmesan cheese, to taste (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/08/quick-zucchini-saute.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Budget", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2007/08/quick-zucchini-saute/", 
        "title": "quick zucchini sauté", 
        "directions": [
            "Heat a large skillet over medium-high and add enough oil to coat the pan well. Heat the oil until hot but not smoking, then add the almonds to the pan. Cook them, stirring, until the almonds are golden-brown, approximately a minute or two. Don’t skimp on this step; they provide a depth of flavor that carries the whole dish. Add the zucchini to the pan, tossing it with the oil and almonds until it just begins to glisten, about one minute. The idea is not to cook the zucchini so much as warm it so it begins to soften. Season well with salt and pepper, slide onto a plate, top with cheese (if using) and immediately dig in."
        ], 
        "date": "2007-08-02T16:50:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 onion, finely chopped", 
            "2 garlic cloves, very thinly sliced", 
            "1 cup tomato puree (such as Pomi)", 
            "2 tablespoons olive oil, divided", 
            "1 small eggplant (my store sells these “Italian Eggplant” that are less than half the size of regular ones; it worked perfectly)", 
            "1 smallish zucchini", 
            "1 smallish yellow squash", 
            "1 longish red bell pepper", 
            "Few sprigs fresh thyme", 
            "Salt and pepper", 
            "Few tablespoons soft goat cheese, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/758095178_8643a61f2b_o.jpg?w=749", 
        "tags": [
            "Eggplant", 
            "Peppers", 
            "Photo", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2007/07/rat-a-too-ee-for-you-ee/", 
        "title": "ratatouille’s ratatouille", 
        "directions": [
            "Preheat oven to 375 degrees F.", 
            "Pour tomato puree into bottom of an oval baking dish, approximately 10 inches across the long way. Drop the sliced garlic cloves and chopped onion into the sauce, stir in one tablespoon of the olive oil and season the sauce generously with salt and pepper. ", 
            "Trim the ends off the eggplant, zucchini and yellow squash. As carefully as you can, trim the ends off the red pepper and remove the core, leaving the edges intact, like a tube. ", 
            "On a mandoline, adjustable-blade slicer or with a very sharp knife, cut the eggplant, zucchini, yellow squash and red pepper into very thin slices, approximately 1/16-inch thick.", 
            "Atop the tomato sauce, arrange slices of prepared vegetables concentrically from the outer edge to the inside of the baking dish, overlapping so just a smidgen of each flat surface is visible, alternating vegetables. You may have a handful leftover that do not fit. ", 
            "Drizzle the remaining tablespoon olive oil over the vegetables and season them generously with salt and pepper. Remove the leaves from the thyme sprigs with your fingertips, running them down the stem. Sprinkle the fresh thyme over the dish.", 
            "Cover dish with a piece of parchment paper cut to fit inside. (Tricky, I know, but the hardest thing about this.) ", 
            "Bake for approximately 45 to 55 minutes, until vegetables have released their liquid and are clearly cooked, but with some structure left so they are not totally limp. They should not be brown at the edges, and you should see that the tomato sauce is bubbling up around them.", 
            "Serve with a dab of soft goat cheese on top, alone, or with some crusty French bread, atop polenta, couscous, or your choice of grain. "
        ], 
        "date": "2007-07-09T17:37:07+00:00"
    }, 
    {
        "ingredient_list": [
            "14 ounces frozen puff pastry, defrosted in the fridge overnight*", 
            "1 Asian eggplant", 
            "1 smallish zucchini", 
            "1 smallish yellow squash", 
            "1 longish red bell pepper", 
            "1/3 cup tomato puree (such as Pomi) or canned plain tomato sauce", 
            "2 tablespoons olive oil", 
            "Salt and pepper", 
            "Few sprigs fresh thyme", 
            "1 cup crumbled feta "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/ratatouille-tart1.jpg?w=500", 
        "tags": [
            "Eggplant", 
            "Peppers", 
            "Photo", 
            "Summer", 
            "Summer Squash", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2007/12/ratatouille-tart/", 
        "title": "ratatouille tart", 
        "directions": [
            "Heat the oven to 375°F. Lightly flour a work surface, lay the sheet of pastry out, and gently roll until it measures about 11 x 15 inches. Slide the pastry onto a baking sheet lined with parchment paper. Prick the pastry all over with a fork, at about 1-inch intervals. ", 
            "Spread the tomato puree or sauce evenly over the pastry, leaving a one-inch border around the edges. ", 
            "Trim the ends off the eggplant, zucchini and yellow squash. As carefully as you can, trim the ends off the red pepper and remove the core, leaving the edges intact, like a tube. ", 
            "On a mandoline, adjustable-blade slicer or with a very sharp knife, cut the eggplant, zucchini, yellow squash and red pepper into very thin slices, approximately 1/16-inch thick.", 
            "Arrange slightly overlapped slices of vegetables concentrically or in rows over the tomato puree or sauce, alternative vegetables. You’ll probably have a few leftover.", 
            "Drizzle vegetables with olive oil, season with salt and pepper and sprinkle de-stemmed thyme leaves over the vegetables.  ", 
            "Bake in the heated oven until the pastry is puffed and browned (including on the bottom), 25 to 30 min and the vegetables look softened. Slide onto a cutting board, sprinkle with the feta, and cut into squares or strips. (A pizza wheel worked surprisingly well for this.) Serve warm or at room temperature.", 
            "* I don’t know how widely distributed it is, but those of you in NYC should look for a locally made (like, it’s practically closer for me to walk over to the factory) puff pastry from brand called DuFour that –once you get past the steep price tag–will blow your mind. Prior to trying it, I thought puff pastry was flaky, messy, dry and unsubstantial, pretty for sure but not fun to eat. Once I tried Dufour, I was immediately besmitten. "
        ], 
        "date": "2007-12-02T23:04:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup self-raising (self-rising) flour, sifted", 
            "2 eggs", 
            "20 grams (3/4 ounces) butter, melted [I translated this as 1 1/2 tablespoons]", 
            "1/3 cup (2 1/2 fluid ounces) milk", 
            "Sea salt and cracked black pepper", 
            "1/2 cup fresh ricotta cheese", 
            "1/4 cup torn basil leaves", 
            "75 grams (2 2/3 ounces) leg ham, torn", 
            "1 zucchini (courgette), cut into long, thin strips", 
            "Vegetable oil for shallow frying"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/shes-finally-lost-it1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Pancakes", 
            "Photo", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2006/11/shes-finally-lost-it/", 
        "title": "zucchini, ham and ricotta fritters", 
        "directions": [
            "Place the flour eggs, butter, milk, salt and pepper in a large bowl and whisk to combine. Fold through the ricotta, basil, ham and zucchini. Place two tablespoon of the oil in a small frying pan [I used a light coating of olive oil spray] and heat over medium heat. Add half of the mixture to the pan and cook for 2-3 minutes each side or until bubbles appear on the surface. Set aside.", 
            "Add another two tablespoons of the oil and repeat with the remaining batter. Cut into wedges to serve. Serves [at least] 2. "
        ], 
        "date": "2006-11-29T23:25:59+00:00"
    }, 
    {
        "ingredient_list": [
            "Gratin", 
            "2 pounds summer squash", 
            "Salt", 
            "1 1/2 cup fresh breadcrumbs", 
            "3 tablespoons unsalted butter", 
            "3/4 cup thinly sliced shallots (from 4 to 5 medium)", 
            "1 cup grated gruyere cheese", 
            "1/4 cup salsa verde (below)", 
            "Freshly ground black pepper", 
            "Salsa verde", 
            "1 tablespoon thyme leaves", 
            "1 teaspoon marjoram or oregano leaves (or half, if dried)", 
            "1/4 cup coarsely chopped mint leaves", 
            "1 cup coarsely chopped flat-leaf parsley", 
            "2 small cloves garlic", 
            "1 salt-packed anchovy, rinsed and bones removed", 
            "1 tablespoon capers, drained (and rinsed, too, if salt-packed)", 
            "1/2 cup olive oil", 
            "1/2 lemon, or more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/summer-squash-gratin-with-salsa-verde1.jpg?w=640", 
        "tags": [
            "Casserole", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Summer Squash", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2014/07/summer-squash-gratin-with-salsa-verde/", 
        "title": "summer squash gratin with salsa verde", 
        "directions": [
            "Heat your oven to 400°F. Cut the squash into thin (1/8-inch thick) coins. Toss with 1 teaspoon kosher salt and set aside for at least 10 minutes. Drain zucchini in a colander, and if you have time, spread them on a towel for a few minutes to further wick away moisture before placing it in a large mixing bowl.", 
            "Meanwhile, place breadcrumbs in a small bowl. In a small skillet or saucepan, melt butter and keep cooking it over medium heat until it browns and smells nutty. Carefully pour (in a small drizzle at first) over breadcrumbs and be sure to scrape out any brown bits from the pot. Toss crumbs to evenly coat.", 
            "Make the salsa verde by blending the herbs in a food processor or blender with garlic, anchovy and capers until it forms a paste, scraping down as needed. With the machine running, stream in the olive oil in a drizzle. Season with salt and black pepper. Add lemon juice to taste.", 
            "Add shallots, gruyere, half the breadcrumbs, 1/4 cup salsa verde (about half; you can use the rest to dress eggs or any roasted meat) and some freshly ground black pepper to the bowl with the summer squash and toss. Transfer to a 9×9-inch (or equivalent; I used a 9-inch round cast-iron skillet) baking dish. Scatter remaining breadcrumbs over the top and bake 35 to 40 minutes, until the squash is tender and the crumbs are crisp."
        ], 
        "date": "2014-07-22T12:23:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil, plus more for fingertips", 
            null, 
            "2 1/2 pounds (about 5 small-medium or 3 large) zucchini or other summer squash, trimmed", 
            "1 1/2 teaspoons fine sea salt", 
            "2 cups (8 ounces) coarsely grated gruyere cheese", 
            "2 to 3 tablespoons plain breadcrumbs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_4477.jpg?w=750", 
        "tags": [
            "Photo", 
            "Pizza", 
            "Summer", 
            "Summer Squash", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2016/08/summer-squash-pizza/", 
        "title": "summer squash pizza", 
        "directions": [
            "Heat your oven to 500°F with a rack in the center. Brush either 1 13×18-inch rimmed half-sheet pan or 2 9×13-inch quarter-sheet pans (as I do) with olive oil. Divide your dough in half and use oiled fingertips to pull, stretch, nudge and press the dough across the bottom of the pan. The dough will be thin and imperfect; just try to get it even. If holes form, just pinch them together.", 
            "Use a food processor with a grater attachment or the large holes of a box grater to grate the zucchini. In a large bowl, toss together the zucchini and salt. Let stand for 20 to 30 minutes (more, if you have the time), until the zucchini has wilted and released its water. Drain the zucchini in a colander and then use your hands to squeeze out as much water as possible, a fistful at a time. Back in the large bowl (wiped out if still wet), toss the zucchini with the gruyere shreds, being sure to break up any clumps of zucchini. Taste the mixture; it should be seasoned enough from the salt, but you can add more, plus ground pepper or pepper flakes if desired.\nSpread the zucchini mixture over the dough(s), going all the way to the edges of the pan and piling it a bit thicker at the edges, where it will brown first. Sprinkle messily with the bread crumbs.\nBake for 20 to 25 minutes, until the topping is golden. Remove from oven, cut into squares and dig in."
        ], 
        "date": "2016-08-02T12:03:04+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pound zucchini (about 3 large)*", 
            "1 1/4 teaspoons salt", 
            "1/2 pound arugula, stems discarded and leaves cut into 1/2-inch-wide strips (6 cups)", 
            "1 ounce Parmigiano-Reggiano, coarsely grated (on large holes of a box grater; 1/2 cup)", 
            "3 tablespoons extra-virgin olive oil", 
            "Juice of one lemon", 
            "1/4 teaspoon black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/this-side-of-a-meltdown1.jpg?w=500", 
        "tags": [
            "Budget", 
            "Italian", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2007/05/this-side-of-a-meltdown/", 
        "title": "zucchini carpaccio salad", 
        "directions": [
            "Special equipment: an adjustable-blade slicer", 
            "Cut zucchini crosswise into paper-thin slices with slicer.  Toss zucchini slices with one teaspoon salt in a large colander set over a bowl and let drain 20 minutes. ", 
            "Rinse zucchini slices well, then drain, pressing gently on slices to extract any excess liquid. Pat zucchini slices dry with a kitchen towel.", 
            "Put arugula greens in a large bowl. Sprinkle with 1/4 cup Parmigiano-Reggiano and remaining 1/4 teaspoon salt. Drizzle 1 1/2 tablespoons of oil over greens and toss. Arrange zucchini slices over arugula greens, then drizzle with remaining oil, lemon juice and sprinkle with remaining 1/4 cup Parmigiano-Reggiano and pepper.", 
            "* A delicious and colorful variation could include yellow summer squash, as well."
        ], 
        "date": "2007-05-31T12:48:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds zucchini (2 to 3, depending on size), halved lenthwise and very thinly sliced", 
            "1 teaspoon salt", 
            "1 1/2 ounces parmesan or pecorino romano cheese, thinly sliced on a mandoline or with a peeler", 
            "1/2 cup slivered almonds, well-toasted and cooled (300 degree oven for 7 to 10 minutes, tossing occasionally, usually works)", 
            "1/2 pound pasta of your choice (I like the extra bite of whole wheat pasta in pasta salads), cooked, drained and cooled", 
            "5 tablespoons olive oil", 
            "Juice of one lemon", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/zucchini-and-almond-pasta-salad1.jpg?w=500", 
        "tags": [
            "Pasta", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2010/08/zucchini-and-almond-pasta-salad/", 
        "title": "zucchini and almond pasta salad", 
        "directions": [
            "Further additions, if you wish: 1/2 cup crumbled feta or blue cheese (replacing parmesan), 1/4 red onion, thinly sliced (you can let this marinate in the dressing for a few minutes, to reduce its bite), 1/4 pound fresh arugula or 1/4 cup thinly slivered basil or 1 cup white beans, rinsed and drained", 
            "Toss zucchini slices with one teaspoon salt in a large colander set over a bowl or in sink. Let drain 20 minutes. If they taste too salty to you, rinse and drain them again.", 
            "Stir zucchini, parmesan, almonds and pasta together. Whisk together olive oil and lemon juice, seasoning generously with black pepper and salt to taste. Toss with salad and adjust seasonings to taste. Pack up salad and take it with you to the beach."
        ], 
        "date": "2010-08-09T09:39:52+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups all-purpose flour, chilled in the freezer for 30 minutes", 
            "1/4 teaspoon salt", 
            "8 tablespoons (1 stick) cold unsalted butter, cut into pieces and chill again", 
            "1/4 cup sour cream", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup ice water", 
            "Filling:", 
            "1 large or 2 small zucchinis, sliced into 1/4 inch thick rounds", 
            "1 tablespoon plus 1 teaspoon olive oil", 
            "1 medium garlic clove, minced (about 1 teaspoon)", 
            "1/2 cup ricotta cheese", 
            "1/2 cup (about 1 ounce) grated Parmesan cheese", 
            "1/4 cup (1 ounce) shredded mozzarella", 
            "1 tablespoon slivered basil leaves", 
            "Glaze:", 
            "1 egg yolk beaten with 1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/4744441126_6c461103dd_o.jpg?w=750", 
        "tags": [
            "Herbs", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2010/06/zucchini-and-ricotta-galette/", 
        "title": "zucchini and ricotta galette", 
        "directions": [
            "Make dough: Whisk together the flour and salt in a large bowl. Sprinkle bits of butter over dough and using a pastry blender, cut it in until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, whisk together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour.", 
            "Make filling: Spread the zucchini out over several layers of paper towels. Sprinkle with 1/2 teaspoon salt and let drain for 30 minutes; gently blot the tops of the zucchini dry with paper towels before using. In a small bowl, whisk the olive oil and the garlic together; set aside. In a separate bowl, mix the ricotta, Parmesan, mozzarella, and 1 teaspoon of the garlicky olive oil together and season with salt and pepper to taste.", 
            "Prepare galette: Preheat oven to 400 degrees. On a floured work surface, roll the dough out into a 12-inch round. Transfer to an ungreased baking sheet (though if you line it with parchment paper, it will be easier to transfer it to a plate later).  Spread the ricotta mixture evenly over the bottom of the galette dough, leaving a 2-inch border. Shingle the zucchini attractively on top of the ricotta in concentric circles, starting at the outside edge. Drizzle the remaining tablespoon of the garlic and olive oil mixture evenly over the zucchini. Fold the border over the filling, pleating the edge to make it fit. The center will be open. Brush crust with egg yolk glaze.", 
            "Bake the galette until the cheese is puffed, the zucchini is slightly wilted and the galette is golden brown, 30 to 40 minutes. Remove from the oven, sprinkle with basil, let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature. "
        ], 
        "date": "2010-06-29T09:51:02+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "3 tablespoons olive oil", 
            "2 tablespoons light brown, dark brown or granulated sugar", 
            "1/4 cup buttermilk or 2 tablespoons each of milk and plain yogurt, whisked until smooth", 
            "1/2 teaspoon vanilla extract", 
            "2 cups shredded zucchini (from about 9 ounces whole, or 1 1/2 medium zucchini), heaping cups are fine", 
            "1 cup all-purpose flour (half can seamlessly be swapped with a whole wheat flour)", 
            "1/4 teaspoon table salt", 
            "1 teaspoon baking soda", 
            "1 teaspoon ground cinnamon", 
            "1/8 teaspoon ground or freshly grated nutmeg", 
            "Butter or oil, for coating skillet"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/zucchini-bread-pancakes.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Pancakes", 
            "Photo", 
            "Summer", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2012/07/zucchini-bread-pancakes/", 
        "title": "zucchini bread pancakes", 
        "directions": [
            "In a large bowl, combine eggs, olive oil, sugar, buttermilk and vanilla until smooth. Stir in zucchini shreds. In a smaller bowl, whisk together flour, salt, baking soda, cinnamon and nutmeg. Stir dry ingredients into zucchini batter, mixing until just combined.", 
            "Preheat oven to 200°F and place a tray — foil-lined if you’re into doing fewer dishes later — on a middle rack.", 
            "Heat a large, heavy skillet (my favorite for pancakes is a cast-iron) over medium heat. Once hot, melt a pat of butter in pan and swirl it around until it sizzles. Scoop scant 1/4-cup dollops of batter (mine were about 3 tablespoons each) in pan so the puddles do not touch. Cook until bubbles appear on the surface, about 2 to 3 minutes. Flip pancakes and cook another minute or two, until golden underneath. Transfer pancakes to prepared pan to keep warm as well as ensure that they’re all cooked through when they’re served. Repeat with remaining batter. Serve warm. Repeat next weekend."
        ], 
        "date": "2012-07-27T11:34:37+00:00"
    }, 
    {
        "ingredient_list": [
            "3 large eggs", 
            "1 cup (235 ml) olive, vegetable oil or melted butter (I use a mix)", 
            "1 1/3 to 1 3/4 cups granulated or turbinado sugar (the latter is the original amount)", 
            "2 teaspoons (10 ml) vanilla extract", 
            "2 teaspoons ground cinnamon", 
            "1/8 teaspoon ground or freshly grated nutmeg", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon baking powder", 
            "1 teaspoon fine sea or table salt", 
            null, 
            "3 cups (390 grams) all-purpose flour", 
            "1/2 cup (55 grams) chopped walnuts or pecans (optional)", 
            "1 to 2 cups dried cranberries, raisins or chocolate chips or a combination thereof (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/zucchini-bread.jpg?w=750", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Summer", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2007/07/zucchini-bread/", 
        "title": "zucchini bread", 
        "directions": [
            "Heat your oven to 350°F. Generously grease and flour or (coat with a nonstick spray) two loaf pans (8×4 or 9×5; this doesn’t fill the pans so smaller is fine). Alternatively, you can grease 24 standard muffin cups or line them with paper liners.", 
            "Whisk eggs, oil or butter, sugar and vanilla in the bottom of a large bowl. Sprinkle cinnamon, nutmeg, baking soda, baking powder and salt over wet ingredients and whisk them in well. Stir in zucchini. Gently stir in flour, mixing only until flour disappears. Stir in any add-ins, from nuts to chocolate.\nDivide between prepared pans and bake for 55 to 65 minutes, until a toothpick inserted into the center comes out clean. [Muffins will bake far more quickly, approximately 20 to 25 minutes.] You can let them cool for 10 minutes on a rack before inverting and removing cakes from pans, or just let them cool completely in pans. Store it wrapped in foil at room temperature for up to 5 days."
        ], 
        "date": "2007-07-26T12:54:30+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (about 2 medium) zucchini", 
            "1 teaspoon coarse or Kosher salt, plus extra to taste", 
            "2 scallions, split lengthwise and sliced thin", 
            "1 large egg, lightly beaten", 
            "Freshly ground black pepper", 
            "1/2 cup all-purpose flour", 
            "1/2 teaspoon baking powder", 
            "Olive or another oil of your choice, for frying", 
            "To serve (optional)", 
            "1 cup sour cream or plain, full-fat yogurt", 
            "1 to 2 tablespoon lemon juice", 
            "1/4 teaspoon lemon zest", 
            "Pinches of salt", 
            "1 small minced or crushed clove of garlic"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/08/zucchini-fritters.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Pancakes", 
            "Photo", 
            "Put An Egg On It", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2011/08/zucchini-fritters/", 
        "title": "zucchini fritters", 
        "directions": [
            "Preheat oven to 200 degrees. Have a baking sheet ready.", 
            "Trim ends off zucchini and grate them either on the large holes of a box grater or, if you have one, using the shredding blade of a food processor. The latter is my favorite as I’m convinced it creates the coarsest and most rope-like strands and frankly, I like my fritters to look like mops.", 
            "In a large bowl, toss zucchini with 1 teaspoon coarse salt and set aside for 10 minutes. Wring out the zucchini in one of the following ways: pressing it against the holes of a colander with a wooden spoon to extract the water, squeezing out small handfuls at a time, or wrapping it up in a clean dishtowel or piece of cheese cloth and wringing away. You’ll be shocked (I was!) by the amount of liquid you’ll lose, but this is a good thing as it will save the fritters from sogginess.", 
            "Return deflated mass of zucchini shreds to bowl. Taste and if you think it could benefit from more salt (most rinses down the drain), add a little bit more; we found 1/4 teaspoon more just right. Stir in scallions, egg and some freshly ground black pepper. In a tiny dish, stir together flour and baking powder, then stir the mixture into the zucchini batter.", 
            "In a large heavy skillet — cast iron is dreamy here — heat 2 tablespoons of oil over medium-high heat until shimmering. Drop small bunches of the zucchini mixture onto the skillet only a few at a time so they don’t become crowded and lightly nudge them flatter with the back of your spatula. Cook the fritters over moderately high heat until the edges underneath are golden, about 3 to 4 minutes. If you find this happening too quickly,  reduce the heat to medium. Flip the fritters and fry them on the other side until browned underneath again, about 2 to 3 minutes more. Drain briefly on paper towels then transfer to baking sheet and then into the warm oven until needed. Repeat process, keeping the pan well-oiled, with remaining batter. I like to make sure that the fritters have at least 10 minutes in the oven to finish setting and getting extra crisp.", 
            "For the topping, if using, stir together the sour cream, lemon juice, zest, salt and garlic and adjust the flavors to your taste. Dollop on each fritter before serving. These fritters are also delicious with a poached or fried egg on top, trust me.", 
            "Do ahead: These fritters keep well, either chilled in the fridge for the better part of a week and or frozen in a well-sealed package for months. When you’re ready to use them, simply spread them out on a tray in a 325 degree oven until they’re hot and crisp again."
        ], 
        "date": "2011-08-25T15:47:52+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (about 2 large) zucchini or other summer squash, trimmed", 
            "1 1/4 teaspoons fine sea or table salt, plus more if needed", 
            "1 cup (3 ounces or 85 grams) coarsely grated gruyere cheese", 
            "3/4 cup (2 1/2 ounces or 70 grams) coarsely grated fontina or provolone cheese", 
            "1/4 cup (20 grams) finely grated parmesan or pecorino cheese", 
            "Freshly ground black pepper", 
            "8 thin slices bread of your choice, I used a country-style white bread", 
            "A couple tablespoons softened butter or olive oil for brushing bread"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/zucchini-grilled-cheese.jpg?w=750", 
        "tags": [
            "Picnics", 
            "Recipes", 
            "Sandwich", 
            "Summer Squash", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2017/06/zucchini-grilled-cheese/", 
        "title": "zucchini grilled cheese", 
        "directions": [
            "Prepare zucchini: Use a food processor with a grater attachment or the large holes of a box grater to grate the zucchini. In a large colander, toss together the zucchini and salt. Let stand for 20 to 30 minutes, until the zucchini has wilted and begun to release liquid. Drain the zucchini in a colander and then use your hands to squeeze out as much water as possible, a fistful at a time. Place wrung-out zucchini on paper towels to drain further.\nMake filling and assemble sandwiches: Mix zucchini with grated cheese, a lot of freshly ground black pepper, and more salt if needed.", 
            "Brush or spread the bread sides that will form the outsides of the sandwiches with olive oil or softened butter. Spread zucchini-cheese on insides and close the sandwiches.", 
            "Cook the sandwiches: Place sandwiches on a large griddle or frying pan over low-medium heat. I like to cook grilled cheese slowly to give the centers a chance to really melt before the outsides get too brown. When the undersides are a deep golden brown, flip the sandwiches and cook until the color underneath matches the lid. Cut sandwiches in half and dig in. Perhaps some pickled vegetable sandwich slaw on the side?"
        ], 
        "date": "2017-06-22T12:04:08+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/09/zucchini-parmesan-crisps.jpg?w=750", 
        "tags": [
            "Photo", 
            "Side Dish", 
            "Snack", 
            "Summer", 
            "Summer Squash", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2013/09/zucchini-parmesan-crisps/", 
        "title": "zucchini parmesan crisps", 
        "directions": [
            "Heat oven to 450 degrees. Coat two baking sheets lightly with cooking spray or thinly with olive oil. Slice zucchini into slightly-less-than 1/4-inch thick rounds; if they feel especially wet, spread them on a towel while you prepare the other ingredients. In a small bowl, lightly beat first egg white with 1 teaspoon water to loosen it. Combine cheese, crumbs, salt and pepper in a separate bowl. Dip each zucchini coin in egg white, letting excess run off before gently dipping them in parmesan mixture. Arrange in single layer on baking sheets. If additional egg white is needed, prepare it the same way, with 1 teaspoon of water. If additional crumb mixture is needed, make a few spoonfuls at a time, matching the volume of crumbs and cheese. ", 
            "Bake zucchini rounds until browned and crisp, about 25 to 30 minutes, flipping each over halfway through. Please keep an eye on them; they may need to be moved around on the tray so the ones at the edges don’t bake more quickly than the ones in the center. Take them out only when they’re golden all over and let them cool on the tray on a cooling rack or a plate. ", 
            "Keep at room temperature until needed. Crisps are best on the first day. "
        ], 
        "date": "2013-09-03T11:45:21+00:00"
    }, 
    {
        "ingredient_list": [
            "Butter for dish", 
            "2 1/2 pounds (about 1 1/8 kg) zucchini", 
            "2 1/2 teaspoons kosher salt (I use Diamond brand, use 1 1/2 of other brands)", 
            "1/2 cup (90 grams) plain, uncooked white rice", 
            "1 medium onion, minced (about 1 cup)", 
            "5 tablespoons (75 ml) olive oil, divided", 
            "2 large cloves garlic, mashed or finely minced", 
            "2 tablespoons (15 grams) all-purpose flour (optional)", 
            "1/2 cup milk, as needed, although water or broth of your choice would work just fine [1/2 cup needed for streamlined directions, less for original]", 
            "2/3 cup (55 grams) grated Parmesan cheese, divided", 
            "Salt and pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/zucchini-rice-and-cheese-gratin1.jpg?w=750", 
        "tags": [
            "Budget", 
            "Casserole", 
            "Freezer Friendly", 
            "Grain/Rice", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Summer", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2015/09/zucchini-rice-cheese-gratin/", 
        "title": "zucchini rice and cheese gratin", 
        "directions": [
            "\nNew, simplified directions:", 
            "Heat oven to 325 degrees F. Oil or butter a 2-quart baking dish, or 2 smaller 1-quart dishes (as I did, with the intention of freezing one).", 
            "Prepare zucchini: Wash zucchini and trim ends. Halve lengthwise, and if seeds are particularly large, core them out. Coarsely grate and place in a large bowl.", 
            "Prepare remaining ingredients: In a large frying pan, cook the onions slowly in 3 tablespoons oil for 8 to 10 minutes until tender and translucent. Raise heat slightly and stir several minutes until very lightly browned. Stir in garlic and cook another minute. Add uncooked rice and sauté for another two minutes. Season generously with salt and pepper.\nAssemble gratin: Transfer to bowl with zucchini and stir together with 1/2 cup liquid of your choice and all but 2 tablespoons cheese. Taste and adjust seasoning if needed. Transfer to prepared baking dish.", 
            "Bake gratin: Cover tightly with foil and bake for 50 to 60 minutes, until rice within is cooked but not mush. Increase oven temperature to 450 degrees. Remove foil, drizzle top with remaining olive oil (or dot with butter), sprinkle on remaining cheese and bake uncovered until browned and crisp on top, about another 10 to 15 minutes. For extra color, you can run it under the broiler for one minute at the end.\nDirections as originally published here:", 
            "Prepare zucchini: Wash zucchini and trim ends. Halve lengthwise, and if seeds are particularly large, core them out. Coarsely grate and place in a colander set over a bowl. Toss with kosher salt. Let drain for 5 minutes, says Julia Child, but more like 20 or, if you’ve got the time, up to 30 minutes.", 
            "Save drained liquid and squeeze a handful of the zucchini and taste. If it’s very salty, rinse and drain it again (not saving liquid this time). Squeeze all of the zucchini in handfuls, gently, collecting any juices in the bowl of drained liquid. Blot dry on paper towels.", 
            "Prepare rice: Boil for exactly 5 minutes in salted water. Drain and set aside. [In comments I’ve read about this recipe online, many people say that they skip this step and it all works out in the oven. But I didn’t this time.]\nPrepare remaining ingredients: In a large frying pan, cook the onions slowly in 3 tablespoons oil for 8 to 10 minutes until tender and translucent. Raise heat slightly and stir several minutes until very lightly browned. Stir in the grated and dried zucchini and garlic; season with salt and pepper. Toss and turn for 5 to 6 minutes until the zucchini is almost tender.  Sprinkle in the flour, stir over moderate heat for 2 minutes, and remove from heat.\nAssemble dish: Measure the drained liquid from the zucchini. If you have less than 2 1/2 cups, add milk to bring the level up to it. (I became sidetracked and mine drained for an hour; I ended up with the full 2 1/2 cups and needed no milk.)\nStir into zucchini-onion mixture, return pan to stove over medium-high heat and bring to a simmer, stirring. Remove from heat again, stir in par-cooked rice and all but 2 tablespoons cheese. Taste and adjust seasoning if needed.", 
            "Turn into a 2-quart baking dish, or 2 smaller 1-quart dishes (as I did, with the intention of freezing one). Sprinkle with reserved cheese and remaining olive oil, although I apparently used butter instead, because: butter\nYou can cook it right away, or let it sit until 30 minutes before you want to serve it.", 
            "30 minutes before serving: Heat oven to 425 degrees. Bake in upper third of oven until bubbling and browned on top, about 25 to 30 minutes. (If yours begins to brown too quickly, you can cover it with foil until the last 5 minutes.) The rice should absorb all the liquid. Serve immediately.", 
            ""
        ], 
        "date": "2015-09-16T12:05:37+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/zucchini-strand-spaghetti1.jpg?w=500", 
        "tags": [
            "Pasta", 
            "Photo", 
            "Summer", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2008/06/zucchini-strand-spaghetti/", 
        "title": "zucchini strand spaghetti", 
        "directions": [
            "Bring a large pot of water to a boil and add salt. Add the pasta and cook until al dente, about 10 minutes.", 
            "While the water comes to a boil and the pasta cooks, cut the zucchini with the fine French-fry cutter on a mandoline. If you do not have one, cut by hand into the longest, finest julienne you can manage. Season with salt and pepper. If your zucchini is very finely cut, it does not need to be cooked. Otherwise, place in a colander, suspend over the pasta pot, cover the pot, and steam the zucchini until still slightly crunchy, about 2 minutes.", 
            "Heat 1/4 cup of the olive oil in a small skillet over medium-high heat until hot. Add the garlic and saute briefly until light brown. Turn on the exhaust fan and add the red pepper flakes. Quickly mix in the basil and remove from the heat. When the pasta is al dente, drain through a colander, reserving about 1/2 cup of the pasta cooking water.", 
            "Pour the pasta into a warm serving bowl; add the zucchini, basil oil (optional, recipe below), the garlic mixture, and 1/2 cup of the cheese. Toss well, adding cooking water as needed to make a smooth sauce. Taste for seasoning and add salt and pepper, as needed. Grate about 2 tablespoons Parmesan over the top and serve at once.", 
            "Basil Oil (or any other herb-flavored olive oil)", 
            "Makes 1 1/3 cups", 
            "For soft herbs, such as basil, parsley, cilantro or tarragon: Use 4 cups packed leaves to 2 cups pure olive oil. ", 
            "For woody herbs, such as rosemary, sage, thyme, oregano or lemon verbena: Use 1 cup packed leaves to 2 cups pure olive oil.", 
            "In a blender, puree the herbs and oil until completely smooth. Put the mixture in a saucepan and bring it to a simmer over moderate heat. Simmer for 45 seconds, then pour through a fine-mesh strainer into a bowl. Don’t press on the mixture, but you can tap the strainer against your hand to get the oil to drip through faster. ", 
            "[Chirello has steps here to strain again through a coffee filter and let it settle for a few hours but I skipped all this and still had a gorgeous, delicious, unbelievably potent basil oil.]", 
            "Note: Fresh herb oils are better to toss into pasta at the end rather than cook with, so the oil keeps its fresh, uncooked taste. "
        ], 
        "date": "2008-06-27T14:43:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup uncooked white rice, long-grain is suggested but use whatever you prefer", 
            "5 tablespoons olive oil", 
            "1 1/2 pounds zucchini (about 3 medium), sliced 1/4-inch thick", 
            "1/2 pound plum tomatoes, sliced 1/4-inch thick", 
            "Table salt and freshly ground black pepper", 
            "1 medium onion, halved lengthwise and thinly sliced", 
            "3 garlic cloves, minced", 
            "2 large eggs, lightly beaten", 
            "1 teaspoon chopped fresh thyme leaves", 
            "1/2 cup grated Parmesan, divided"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/zucchini-tomato-and-rice-gratin.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Gluten-Free", 
            "Grain/Rice", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2012/07/zucchini-tomato-and-rice-gratin/", 
        "title": "zucchini, tomato and rice gratin", 
        "directions": [
            "Preheat oven to 450°F. Cook the rice according to your favorite method. The package directions work in some cases, but check my notes above about adjustments I find I have to make. If you cook the rice in a large, wide-ish covered skillet, it might cook even faster but you’ll have the chance to use it again (and save on dirty dishes) when you need to cook the onions in a bit.", 
            "While rice cooks, coat two large (or, if you have the same pitifully small oven as I do, three smaller) baking sheets each with a tablespoon of a of olive oil (a bit less for smaller pans). Spread zucchini and tomato slices on the baking sheets in as close to a single layer as you can. Sprinkle with 1/2 teaspoon salt and a few grinds of black pepper. Roast tomatoes for 10 minutes and zucchini for 20. Flip zucchini halfway through; it’s not worth the messy effort for the tomatoes. Leave oven on.", 
            "Heat large, heavy skillet (such as the one you used to cook your rice) over medium heat. Once hot, add 2 tablespoons olive oil, heat oil, then add onions, garlic and 1/4 teaspoon salt to pan. Cover and reduce heat to low, cooking onion until limp and tender, about 15 to 20 minutes. Stir occasionally.", 
            "Combine onion mixture, rice, eggs, thyme, half of your grated cheese and a half-tablespoon of olive oil in a bowl. Add a good amount of freshly ground black pepper. Use the remaining half-tablespoon of olive oil to coat a shallow 2-quart baking dish. Spread half of rice mixture in bottom of dish. Arrange half of roasted zucchini on top. Spread remaining rice mixture over it and please don’t worry about being neat about this; dinner will be “rustic” tonight! Arrange remaining zucchini on top, then tomato slices. Sprinkle with remaining grated cheese and bake until set and golden brown, about 20 minutes. Each oven varies, but I find mine does the very best browning when the dish is on a rack near the top of the oven."
        ], 
        "date": "2012-07-31T17:55:18+00:00"
    }
]