{
  "date": "2016-10-04T12:04:20+00:00",
  "directions": [
    "Bring a pot of well-salted water to a boil. Add the pasta and cook until very al dente, a full 2 minutes shy of whatever your package says. Try a piece of pasta — it should have a toothsome bite to it because it will continue softening in the oven after this. If it’s still crunchy, however, continue to boil the rest of the pasta for another minute.\nHeat your oven to 500 degrees F.\nMeanwhile, in the bottom of a large bowl, combine the five cheeses. Scoop out half and set aside. Whisk milk and tomatoes in the half of cheese left in the large bowl. When pasta is drained, add it to the bowl and stir to combine. Season well with salt and pepper and stir in any herbs you plan to use.\nCoat the sides and bottom of a 12-inch cast-iron or other oven-proof skillet with olive oil. Pour the pasta and sauce in. Sprinkle with remaining cheese. Bake until the top is bubbling and golden brown, 16 to 18 minutes. If it’s not brown enough for your tastes, run it under the broiler for 1 minute.",
    "Top with scallions and dig in."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/skillet-baked-pasta-with-five-cheeses.jpg?w=750",
  "ingredient_list": [
    "1 tablespoon olive oil",
    null,
    "1/2 cup (about 3 ounces) ricotta",
    "1 cup coarsely grated fontina (about 3 ounces)",
    "1 cup coarsely grated mozzarella (about 3 ounces",
    "1 cup grated pecorino romano (about 3 ounces)",
    "3/4 cup mild blue cheese, crumbled (about 3 ounces)",
    "1 cup crushed tomatoes from a can",
    "1 cup whole milk (see notes up top for adjustments)",
    "Kosher salt and freshly ground black pepper to taste",
    "1 tablespoon finely chopped rosemary or 6 fresh basil leaves, coarsely chopped",
    "2 scallions, sliced thinly at an angle"
  ],
  "tags": [
    "Casserole",
    "Pasta",
    "Photo",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "skillet-baked pasta with five cheeses",
  "url": "https://smittenkitchen.com/2016/10/skillet-baked-pasta-with-five-cheeses/"
}