{
  "date": "2007-01-04T14:38:10+00:00",
  "directions": [
    "1.\tSoak the dry mushrooms in 1 cup of warm water for 20 to 30 minutes, until plump.",
    "2.\tStrain the soaking liquid through a coffee filter to remove grit and reserve, along with the reconstituted mushrooms, until needed.",
    "3.\tHeat the olive oil in a large pot over a medium flame. Bundle the rosemary and sage together and tie with kitchen twine.  When the oil is hot, add the herb bundle and sizzle for a few minutes on both sides to infuse the oil.",
    "4.\tAdd the onion, garlic, salt and pepper and cook for 5 minutes, until the onion is soft and translucent but not brown.",
    "5.\tTurn the flame to high and add the white mushrooms and shitakes.",
    "6.\tCook for 10 minutes, during which the mushrooms will give off their liquid (which should evaporate quickly due to the high heat) and deflate significantly. Stir occasionally.",
    "7.\tAdd the chicken stock and the dried mushrooms along with the soaking water.",
    "8.\tSimmer for 30 minutes. Remove the herbs, then add the cream and butter. Working in batches, puree the soup in a blender until smooth. Return to the pot and keep at a very low simmer until ready to serve.",
    "Deb adjustments: I used far less olive oil, replaced some of the chicken stock with beef, as I had it on hand and love mixing that flavor with mushrooms; half as much cream, preferring a more potent soup and thyme instead of rosemary, also due to personal preference."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/01/balthazars-cream-of-mushroom-soup.jpg?w=750",
  "ingredient_list": [
    "1 ounce dried mushrooms (porcini, morels, or shitakes)",
    "1/2 cup olive oil",
    "2 sprigs of rosemary",
    "4 sprigs of sage",
    "1 large yellow onion, peeled and thinly sliced",
    "3 garlic cloves, peeled and thinly sliced",
    "1 1/2 teaspoons salt",
    "1/4 tsp freshly ground white pepper",
    "1 pound white button mushrooms, cleaned and thinly sliced",
    "1 pound shitake mushrooms stemmed, cleaned and thinly sliced",
    "6 cups chicken stock or water",
    "1 cup heavy cream",
    "2 tablespoons unsalted butter"
  ],
  "tags": [
    "Date Night",
    "Gluten-Free",
    "Mushrooms",
    "Photo",
    "Soup"
  ],
  "title": "balthazar’s cream of mushroom soup",
  "url": "https://smittenkitchen.com/2007/01/superlatively-souper/"
}