{
  "date": "2015-01-12T12:03:33+00:00",
  "directions": [
    "A tip: If we play our cards right here, this can be made entirely in one dish. I used a 4-quart Staub braiser (Happy Hanukah to me!) but any 3-to-4 quart stovetop-to-oven type dish will work.",
    "Cook the pasta: Bring a pot of well-salted water to a boil. Add pasta and cook until al dente, about 1 to 2 minutes before perfect doneness. Drain and set aside.",
    "Heat oven: To 400 degrees.",
    "Make the sauce: Reheat your empty pasta pot over high heat. Add oil and once it is hot, add mushrooms and cook until they’ve begun to brown and glisten, but have not yet released their liquid. Reduce heat to medium-high, add onions, salt and pepper and saute together until the liquid the mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until it has almost or fully evaporated (depending on your preference). Add butter, stir until melted. Add flour, and stir until all has been dampened and absorbed. Add stock, a very small splash at a time, stirring the whole time with a spoon. Make sure each splash has been fully mixed into the butter/flour/mushroom mixture, scraping from the bottom of the pan and all around, before adding the next splash. Repeat until all stock has been added. Let mixture simmer together for 2 minutes, stirring frequently; the sauce will thicken. Remove pan from heat.",
    "Assemble and bake dish: If you’re cooking in an ovensafe dish, add cooked pasta and stir until combined. (If you’re not cooking in an ovensafe dish, transfer this mixture to a 2-quart baking dish.) Stir in half the parmesan, all of the mozzarella and two tablespoons of the parsley until evenly mixed. Sprinkle the top with remaining parmesan. Bake for 25 to 30 minutes, until edges of pasta are golden brown and irresistible. Sprinkle with reserved parsley and serve hot. Reheat as needed.",
    "A bunch of notes: "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/mushroom-marsala-pasta-bake1.jpg?w=750",
  "ingredient_list": [
    "1/2 pound (8 ounces or 225 grams) pasta of you choice, such as a ziti or twisty shape",
    "1 tablespoon (15 ml) olive oil",
    "3/4 pounds (340 grams) fresh mushroom, sliced (I used pre-sliced cremini, my new favorite thing)",
    "1 small-to-medium yellow onion, halved and sliced thin",
    "Salt and freshly ground black pepper to taste",
    "1/4 cup (60 ml) dry marsala wine (see notes at end for more information)",
    "3 tablespoons (45 grams) unsalted butter",
    "3 tablespoons (25 grams) all-purpose flour",
    "1 1/2 cups (355 ml) stock or broth (chicken, vegetable or mushroom)",
    "1/2 cup (50 grams) finely grated parmesan cheese",
    "4 ounces (115 grams) mozzarella, cut into small cubes",
    "3 tablespoons chopped fresh flat-leaf parsley"
  ],
  "tags": [
    "Casserole",
    "Date Night",
    "Freezer Friendly",
    "Mushrooms",
    "Pasta",
    "Photo",
    "Quick",
    "Vegetarian",
    "Weeknight Favorite",
    "Winter"
  ],
  "title": "mushroom marsala pasta bake",
  "url": "https://smittenkitchen.com/2015/01/mushroom-marsala-pasta-bake/"
}