{
  "date": "2007-05-03T14:37:05+00:00",
  "directions": [
    "Center a rack in the oven and preheat the oven to 400 degrees F. Butter or spray the 12 molds in a regular-size muffin pan or fit the molds with paper muffin cups. Alternatively, use a silicone muffin pan, which needs neither greasing nor paper cups. Place the muffin pan on a baking sheet.",
    "In a large bowl, whisk together the flour, cornmeal, sugar, baking powder, baking soda, salt and nutmeg, if you’re using it. In a large glass measuring cup or another bowl, whisk the buttermilk, melted butter, oil, egg and yolk together until well blended. Pour the liquid ingredients over the dry ingredients and, with the whisk or a rubber spatula, gently but quickly stir to blend. Don’t worry about being thorough – the batter will be lumpy, and that’s just the way it should be. Stir in the corn kernels. Divide the batter evenly among the muffin cups.",
    "Bake for 15 to 18 minutes (12 minutes for minis), or until the tops are golden and a thin knife inserted into the center of the muffins comes out clean. Transfer the pan to a rack and cool for 5 minutes before carefully removing each muffin from its mold."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/always-the-corniest1.jpg?w=500",
  "ingredient_list": [
    "1 cup all-purpose flour",
    "1 cup yellow cornmeal, preferably stone-ground",
    "6 tablespoons granulated sugar",
    "2 1/2 teaspoons baking powder",
    "1/4 teaspoon baking soda",
    "1/2 teaspoon salt",
    "Pinch of freshly grated nutmeg (optional)",
    "1 cup buttermilk",
    "3 tablespoons unsalted butter, melted and cooled",
    "3 tablespoons corn oil (I used olive oil since it was handy)",
    "1 large egg",
    "1 large egg yolk",
    "1 cup corn kernels (add up to 1/3 cup more if you’d like) – fresh, frozen or canned (in which case they should be drained and patted dry)"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Muffin/Quick Bread",
    "Photo",
    "Round-Up"
  ],
  "title": "corniest corn muffins",
  "url": "https://smittenkitchen.com/2007/05/always-the-corniest/"
}