{
  "date": "2012-05-07T13:36:02+00:00",
  "directions": [
    "Place stock or broth in a small-medium saucepan over very low heat on a back burner. You want to have it heated until steamy when you add it in a bit, but not so much that it simmers and loses volume.",
    "Heat a second medium saucepan (3 quarts) or skillet over medium heat. Add bacon or pancetta and cook until it renders its fat, and is tender and just barely crisp. Remove with a slotted spoon to a bowl and set aside, leaving whatever dripping you can in the pan. Add a tablespoon of oil to the bacon fat if needed, then add the leeks. Cook leeks on medium-low for 10 to 12 minutes, until softened and mostly tender. Transfer to bowl with bacon and set aside, leaving stove on.",
    "Add butter to pan and, once melted, cook onion in butter until translucent and tender, about 5 minutes. Add rice and cook sauté until faintly toasted, about 4 minutes. Add wine or vermouth and cook until it almost disappears, about 2 minutes. Ladle 1 cup of hot broth into the rice mixture and simmer until it absorbs, stirring frequently. Add remaining broth 1/2 cup at a time, allowing broth to be absorbed before adding more and stirring frequently until rice is al dente, about 25 to 30 minutes. What you’re looking for in well-cooked risotto is a creamy but loose dish. When ladled onto a plate, it should spill into a creamy puddle, not heap in a mound. You might need an extra splash of broth to loosen it. When you achieve your desired texture and tenderness, stir in the cheese, bacon and leeks. Season with salt and pepper to taste. Ladle into serving bowls.",
    "Then, quickly, in a small skillet, heat a pat of butter over medium-high and swirl it to coat the pan. Crack one egg into the skillet, season with salt and pepper and reduce heat to medium. I like to cover the skillet with a small lid at this point, as it seems to help the egg cook faster and more evenly. In one minute, you should have a perfect sunny-side-up egg. Transfer to your first bowl of risotto and repeat with remaining eggs. Garnish each with an extra bit of grated parmesan and eat immediately."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/bacon-egg-and-leek-risotto.jpg?w=750",
  "ingredient_list": [
    "6 cups low-sodium chicken stock or vegetable broth, but best to have an extra splash or two around if needed",
    "1 cup (4 ounces) finely chopped bacon (from about 4 slices) or pancetta",
    "1 tablespoon olive oil",
    "2 large or 3 smaller leeks, quartered lengthwise, cleaned of grit, and chopped small",
    "3 tablespoons unsalted butter, plus more to fry eggs",
    "1/2 small onion, finely chopped",
    "2 cups arborio, carnaroli, or another short-grained Italian rice",
    "1/3 cup dry white wine or vermouth (read why here)",
    "1 cup finely grated fresh Parmesan cheese, plus extra for garnish if desired",
    "Salt and freshly ground black pepper",
    "4 to 6 large eggs, you’ll want one per serving"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Eggs",
    "Grain/Rice",
    "Photo",
    "Put An Egg On It"
  ],
  "title": "bacon, egg and leek risotto",
  "url": "https://smittenkitchen.com/2012/05/bacon-egg-and-leek-risotto/"
}