{
  "date": "2008-07-26T13:54:45+00:00",
  "directions": [
    "1. Preheat an electric griddle to 375°F, or place a griddle pan or cast-iron skillet over medium heat. Whisk together the flour, baking powder, baking soda, salt, and sugar in a medium bowl. Add the eggs, buttermilk, and 4 tablespoons melted butter, and whisk to combine. The batter should have small to medium lumps.",
    "2. Test the griddle by sprinkling a few drops of water on it. If the water bounces and spatters, the griddle is hot enough. Using a pastry brush, brush the remaining 1/2 teaspoon butter onto the griddle. Wipe off the excess with a folded paper towel.",
    "3. Using a 4-oz. ladle, about 1/2 cup (for a 6-inch pancake), pour the batter in pools 2 inches apart. If you wish to make blueberry pancakes, arrange a handful over the cooking pancake, pressing them in slightly. When the pancakes have bubbles on top and are slightly dry around the edges, about 2 1/2 minutes, flip over. If any batter oozes or blueberries roll out, push them back under with your spatula. Cook until golden on bottom, about 1 minute.",
    "4. Repeat with the remaining batter.  You can keep the finished pancakes on a heat-proof plate in the oven at 175°F. Serve warm."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/blueberry-pancakes-pancake-1011.jpg?w=500",
  "ingredient_list": [
    "2 cups all-purpose flour",
    "2 teaspoons baking powder",
    "1 teaspoon baking soda",
    "1/2 teaspoon kosher salt, or slightly less table salt",
    "3 tablespoons sugar",
    "2 large eggs, lightly beaten",
    "3 cups buttermilk",
    "4 tablespoons unsalted butter, melted, plus 1 tablespoon extra for brushing griddle (I’ve made these pancakes with and without the butter mixed in, and can say with confidence they work either way. They’re just richer with it, of course.)",
    "1 cup blueberries, fresh or frozen and thawed (optional)"
  ],
  "tags": [
    "Blueberries",
    "Breakfast",
    "Brunch",
    "Fruit",
    "Pancakes",
    "Photo",
    "Tips"
  ],
  "title": "blueberry pancakes + pancake 101",
  "url": "https://smittenkitchen.com/2008/07/blueberry-pancakes-pancake-101/"
}