{
  "date": "2012-06-15T11:57:21+00:00",
  "directions": [
    "Prepare dough: Warm milk and a pinch of sugar to between 110 to 116°F. If you don’t have a thermometer, you’re looking for it to be warm but not hot to the touch; best to err on the cool side. Sprinkle yeast over milk and let stand until foamy, about 5 minutes. In a small bowl, whisk together egg and remaining 1/4 cup sugar, then slowly whisk in yeast mixture. ",
    "In a stand mixer fitted with the paddle attachment, combine flour and salt. Run mixer on low and add egg mixture, mixing until combined. Add butter and mix until incorporated. Switch mixer to dough hook and let it knead the dough for 10 minutes on low speed. At 10 minutes, it should be sticky and stringy and probably worrisome, but will firm up a bit after it rises. Butter a large bowl and place dough in it. Cover loosely with a lint-free towel or plastic wrap and let rise for 1 hour, or until doubled. ",
    "Meanwhile, prepare filling: If your chocolate is in large bars, roughly chop it. Then, you can let a food processor do the rest of the work, pulsing the chopped chocolate with the salt, sugar, and cinnamon (if using) until the chocolate is very finely chopped with some parts almost powdery. Add butter and pulse machine until it’s distributed throughout the chocolate. (If you don’t have a food processor, just chop the chocolate until it’s very finely chopped, then stir in the sugar, salt, cinnamon and butter until it makes a pasty/chunky/delicious mess.) Set mixture aside.",
    "Generously butter a standard 12-muffin tin; set aside.",
    "Form buns: Once dough is doubled, turn it out onto a well-floured surface and gently deflate it with floured hands. Let it rest for another 5 minutes. Once rested, roll dough into a large, large rectangle. The short sides should be a scant 11 to 12 inches. The other side can be as loooong as you can roll it. The longer you can make it — I got mine to 20 inches before I ran out of counter space — the more dramatic and swirled your buns will be. ",
    "Sprinkle the filling evenly over the dough’s surface. It’ll be clumpy and uneven and probably look like there’s too much chocolate for the volume of dough; just do your best. Tightly roll the dough back over the filling from one short end to the other, forming a 12 to 13-inch log. (Yes, it always magically grows because the dough is soft.) With a sharp serrated knife, gently saw 1-inch segments off the log and place each in a prepared muffin cup. Loosely cover buns with plastic wrap or a lint-free towel and let them rise for another 30 minutes.",
    "Meanwhile, preheat your oven to 350°F (180°C).",
    "Bake: If you’d like, you can egg wash your buns before baking them (whisking together an egg and the cream until smooth, brush over each bun top). I found the buns I brushed with the wash shinier but otherwise virtually indistinguishable from the un-brushed buns in color. Bake buns for 15 to 20 minutes, until puffed and brown. If you have an instant read thermometer, you can take the buns out when it reads 185 to 190 degrees in the middle of each bun.",
    "Set buns on cooling rack. Theoretically, you should cool them completely before unmolding them (with the aid of a knife or thin spatula to make sure nothing has stuck). This, of course, won’t happen, so have at them; just don’t burn your tongue. Serve with iced coffee and a bowl of berries. For nutritional balance.",
    "Do ahead: These buns can be formed, placed in the muffin cups and refrigerated (loosely covered with plastic, which you might want to oil to keep it from sticking) the night before, to bake in the morning. You can bake them directly from the fridge. They can be baked and frozen until needed, up to 1 month. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chocolate-swirl-buns1.jpg?w=500",
  "ingredient_list": [
    "Dough",
    "1/2 cup (120 ml) milk, preferably whole",
    "1/4 cup (50 grams) plus a pinch of granulated sugar",
    "1 1/2 teaspoons (5 grams) active dry yeast",
    "1 large egg, brought to room temperature",
    "2 cups (250 grams) all-purpose flour, plus more for work surface",
    "1/2 teaspoon table salt",
    "3 tablespoons (45 grams) unsalted butter, at room temperature, plus additional for bowl and muffin tins",
    "Filling",
    "3 tablespoons  (45 grams) unsalted butter, at room temperature",
    "1/4 cup (50 grams) granulated sugar",
    "1/2 pound (225 grams) semisweet chocolate",
    "Pinch of salt",
    "3/4 teaspoon ground cinnamon (optional)",
    "Egg wash (optional)",
    "1 egg",
    "2 teaspoons (10 ml) heavy cream or milk"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Chocolate",
    "Photo"
  ],
  "title": "chocolate swirl buns",
  "url": "https://smittenkitchen.com/2012/06/chocolate-swirl-buns/"
}