{
  "date": "2008-11-02T13:18:49+00:00",
  "directions": [
    "2 large egg whites",
    "Pure maple syrup or honey, or plain yogurt (optional, for serving)",
    "Lightly butter, oil, or spray your griddle–nonstick works best with these, if you have them–if needed, and preheat it over medium heat. If you are using an electric griddle, preheat it to 350 degrees F. Preheat the oven to 200 degrees F if you do not plan to serve the pancakes hot off the griddle.",
    "Whisk flour, sugar, baking powder, baking soda, cinnamon or nutmeg and salt together in a large bowl. In a separate bowl, whisk together the milk, cottage cheese, butter, egg yolks and vanilla.",
    "Pour the wet ingredients over the dry ingredients and gently whisk them together, mixing just until combined. Stir in the walnuts and/or currants, if using them.",
    "Beat the two egg whites until they are stiff but not dry and fold them into the batter.",
    "The batter will be thick and bubbly – similar to cake batter. Spoon 1/3 cup batter onto the griddle for each pancake, nudging the batter into rounds. These are thick and might take a little longer to cook than most other pancakes. Cook until the top of each pancake is starting to dry around the edges – you will get a few bubbles here and there – then turn and cook until the underside is lightly browned. These will keep in a 200 degrees F oven while you finish making the rest, but they are best served immediately, when they are at their lightest and puffiest."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cottage-cheese-pancakes1.jpg?w=500",
  "ingredient_list": [
    "1 1/3 cups all-purpose flour",
    "1/3 cup sugar",
    "2 teaspoons baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon ground cinnamon or pinch of ground nutmeg (optional)",
    "1/4 teaspoon salt",
    "1 cup milk",
    "1 cup full-fat or low-fat cottage cheese",
    "3 tablespoons butter, melted",
    "2 large egg yolks",
    "1 teaspoon vanilla",
    "1/3 cups finely chopped walnuts (optional)",
    "1/3 cup dried currants, plumped (optional)"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Pancakes",
    "Photo"
  ],
  "title": "cottage cheese pancakes",
  "url": "https://smittenkitchen.com/2008/11/cottage-cheese-pancakes/"
}