{
  "date": "2010-03-15T09:58:16+00:00",
  "directions": [
    "Heat oven to 400 degrees with a rack in the upper-middle position. Whisk dry ingredients (flours, sugar, baking soda, cream of tartar and salt) in a large bowl. Work the softened butter into the dry ingredients with a fork, pastry blender or your fingertips until the flour mixture resembles coarse crumbs.",
    "Add the wet ingredients (buttermilk and egg), currants or raisins and caraway seeds, if you’re using them, and stir with a fork until the dough just begins to come together. Turn out onto a work surface (CI says you need a floured one but I didn’t agree) and knead until the dough just becomes cohesive and bumpy. You’re not going for a smooth dough — CI warns that this will make it tough.",
    "Pat dough into a round and use a knife or dough divider to cut it into 8 wedges. Form each wedge into a round and place on a parchment-lined or greased baking sheet. Cut a cross shape into the top of each. Bake for 15 to 20 minutes, or until the internal temperature reaches 170 degrees (this is especially helpful in this recipe, where doneness is hard to judge from the outside). Scones should be golden brown a skewer should come out clean. Remove from the oven and brush with butter before cooling to room temperature. Eat on day one."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/03/irish-soda-bread-scones.jpg?w=750",
  "ingredient_list": [
    "3 cups all-purpose flour, plus additional for work surface",
    "1 cup cake flour (or, make your own)",
    "1/4 cup granulated sugar",
    "1 1/2 teaspoons baking soda",
    "1 1/2 teaspoons cream of tartar",
    "1 teaspoon table salt (this is 2/3 the original amount, which I found too salty)",
    "5 tablespoons unsalted butter (4 tablespoons softened, 1 tablespoon melted)",
    "1 1/4 cups buttermilk (or, make your own)",
    "1 egg, lightly beaten",
    "1 cup currants or raisins",
    "1 tablespoons caraway seeds (optional)"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Muffin/Quick Bread",
    "Photo",
    "Scones/Biscuits"
  ],
  "title": "irish soda bread scones",
  "url": "https://smittenkitchen.com/2010/03/irish-soda-bread-scones/"
}