{
  "date": "2014-12-11T11:59:16+00:00",
  "directions": [
    "Make the dough: In the bottom of a large mixing bowl, combine the yeast, sugar and milk. Let stand for 5 minutes; it should become a little foamy. Whisk in yolks, any zest or extracts you’d like to use, then butter. Don’t worry if the butter doesn’t fully combine. ",
    "— By hand: Add half of flour and stir with a spoon until combined. Add second half of flour and salt and stir as best as you can with a spoon, then use your hands to knead the dough until it forms a smooth, elastic round, about 5 minutes. Try, if you can, to resist adding extra flour, even if it’s sticky. Extra flour always makes for tougher/dryer doughnuts and breads. Sticky hands and counters are always washable!",
    "— With a stand mixer: Add half the flour and let the dough hook mix it in slowly, on a low speed. Add second half of flour and salt and let the dough hook bring it together into a rough dough. Run machine for 3 to 4 minutes, letting it knead the dough into a smooth, cohesive mass.",
    "Both methods: If the dough is already in the bowl, remove it just long enough to lightly oil the bowl. Return dough to bowl, cover with plastic wrap and let rest at room temperature for 1 hour, or in the fridge overnight.",
    "There are two ways to fill doughnuts: In the easiest method, you fill them after they’re cooked with a piping bag. The filling is usually a little imperfect, off-center or slightly messy, but it takes the least effort by far. With the peskier method, you pre-fill the doughnuts, sealing the edges; the centers will be picture-perfect and neat, but it does take longer to assemble. Both will make you a hero to anyone you make these for, promise.",
    "— Easiest method: On a lightly floured counter, roll dough to a 1/2-inch thickness. Cut into 2-inch rounds; no need to re-roll scraps unless you wish; I like to keep the odd shapes for getting the hang of frying before cooking the final doughnuts. Or, if you’re vehemently against scraps and re-rolling, you can make small square doughnuts, which are surprisingly cute. Let cut dough rise for another 30 minutes at room temperature, loosely covered with a towel at room temperature, or in the fridge overnight, on an oiled tray, covered loosely with oiled plastic wrap (use this longer rise only if did the 1-hour rise the first time; two overnights is too much for this dough). ",
    "— Peskier method:  On a lightly floured counter, roll dough to a 1/4-inch thickness. Cut into 2-inch rounds; no need to re-roll scraps unless you wish; I like to keep the odd shapes for getting the hang of frying before cooking the final doughnuts. Or, if you’re vehemently against scraps and re-rolling, you can make small square doughnuts, which are surprisingly cute. Brush the edges of half the cut-outs with egg white, and in the center of each, add a tiny dollop (much less than you think you’ll need) of jam. Use the remaining cut-outs to form lids. Pinch every speck of the edges together tightly, almost as if you were making ravioli; you’ll want to seal these spectacularly well. Let filled doughnuts rise for another 30 minutes at room temperature, loosely covered with a towel at room temperature, or in the fridge overnight, on an oiled tray, covered loosely with oiled plastic wrap (use this longer rise only if did the 1-hour rise the first time; two overnights is too much for this dough). ",
    "Both methods, fry the doughnuts: Heat 2 inches of oil to 350°F (175°C) in a cast-iron frying pan (I like using one because it so delightfully re-seasons them) or heavy pot. Use your dough scraps to practice and get an idea of how quickly the doughnuts will cook. Then add about 4 doughnuts at a time to the oil, cooking on the first side until golden brown underneath, about 1 to 2 minutes, but often less so keep a close eye on them. Flip doughnuts and cook on the other side, until it, too, is golden brown underneath, about another minute. Drain doughnuts, then spread them on a paper towel-lined plate to absorb extra oil. Repeat with remaining doughnuts.",
    "– If you haven’t filled your doughnuts yet, i.e. you’re using the easier method: When doughnuts are cool enough to handle, place jelly or jam in a piping bag with a round tip with a 1/4- to 1/2-inch opening. You can fill doughnuts from the tops or sides; I did half with each. Press the tip of the jam bag halfway into the doughnut, and squeeze in the jam until it dollops out a little from the hole. Repeat with remaining doughnuts. ",
    "Finish doughnuts: Either generously shower doughnuts with powdered sugar on either side, shaken from a fine-mesh strainer, or roll the doughnuts gently in a bowl of powdered sugar.",
    "Eat at once. Don’t forget to share. If eating these on the first day, leave any remaining doughnuts uncovered on a plate. These are best on the first day, but my son did not (shockingly) say no to one that had been in an airtight container at room temperature overnight for breakfast this morning, so I guess they’re not inedible on the second day. They will need to be re-powdered, however, as it absorbs into the doughnuts when they’re in a covered container. ",
    "To make these dairy-free: You can use warm water, soy, almond or coconut milk instead of the dairy milk, and coconut oil, shortening or margarine for the butter. I made a version with both coconut milk and coconut oil, orange zest and a bit of almond extract that were a big hit."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/jelly-doughnuts1.jpg?w=750",
  "ingredient_list": [
    "2 1/2 teaspoons (1 7-gram or 1/4-ounce packet) active dry yeast",
    "1/4 cup (50 grams) granulated sugar",
    "3/4 cup (180 ml) lukewarm (not hot) milk",
    "2 large egg yolks",
    "Few gratings of orange or lemon zest, 1 teaspoon vanilla or 1/2 teaspoon almond extract",
    "2 tablespoons (1 ounce or 30 grams) butter softened",
    "2 1/3 cups (290 grams) all-purpose flour",
    "1/4 teaspoon coarse or kosher salt",
    "1 egg white, whisked until frothy (for peskier filling method)",
    "Vegetable oil for deep-frying, and coating bowl",
    "1/2 to 2/3 cup jam or preserves of your choice",
    "Powdered sugar"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Doughnut",
    "Hanukah",
    "Photo"
  ],
  "title": "jelly doughnuts",
  "url": "https://smittenkitchen.com/2014/12/jelly-doughnuts/"
}