{
  "date": "2014-02-28T08:40:57+00:00",
  "directions": [
    "First, choose your baking vessel. I opted for a 2-quart oval gratin/roasting dish, but also tested this in a 9-inch round cake pan (it was a squeeze; 10-inch would have been better). Other things I suspect would work: 9- to 10-inch cast iron skillet, 2-quart casserole dish or 1 deep-dish pie pan (what Hesser suggests).",
    "If your vessel is safe for the stovetop, use this to make the caramel. If not, use a small, heavy saucepan. In either, place 3/4 cup sugar, butter and sea salt and heat over medium heat. The butter will melt and, after 7 to 10 minutes, the sugar will dissolve and begin to brown. Reduce heat to medium-low and stir with a spoon or spatula so that it browns evenly. You will find that the butter separates from the melting sugar and this is just fine. Do your best to keep them stirred together but know that it will all work out in the end even if it’s split.  ",
    "If you’re using a saucepan, your caramel is done when it reaches a copper color. Pour it over the base of your baking vessel and try (I failed each time) to tip it 1-inch up the sides of the dish. ",
    "If you’re making the caramel in your final baking vessel, your caramel should be taken off the stove a step sooner, a shade more pale than copper, something of a medium brown; this is because it will continue cooking and darkening for a minute off the stove.",
    "Regardless of baking vessel, place dish in refrigerator and chill until caramel is cold and solid, about 30 minutes. Once chilled, arrange the bread slices. Place the heel of the bread in the center and do what you can to fan the slices around it, overlapping each slightly and knowing with complete confidence that even if your dish doesn’t resemble a blooming rose, nobody will care at all. ",
    "In a large bowl whisk together eggs, remaining 2 tablespoons sugar (if using; I skipped this) and 1/4 mascarpone cheese (save rest for serving), until very smooth. Add milk and almond extract. Pour this over the bread, making sure to saturate all of it. Cover tightly with plastic wrap and chill overnight. If you bread seems too high in the vessel to get a good soak, you can weight it with a plate in the fridge.",
    "In the morning, [updated to suggest] take your dish from the fridge an hour before you want to bake it. Heat oven to 375°F. Remove plastic from dish and bake 30 to 35 minutes, until moist but not wet in center. Remove from oven and run a knife around edge of dish, loosening bread from sides. Place a serving plate over top of dish (bottom side up), and, using potholders, hold pudding over sink and flip pudding onto it. Lift baking dish off plate; scrape any extra caramel from pie dish over pudding. Serve, cutting it into wedges at the table and spooning a healthy dollop of mascarpone onto each plate."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/morning-bread-pudding-with-salted-caramel1.jpg?w=640",
  "ingredient_list": [
    "3/4 cup plus (optional) 2 tablespoons granulated sugar",
    "6 tablespoons unsalted butter",
    "1/4 teaspoon flaky sea salt or just 2 or 3 pinches of a coarse one",
    "10 to 12-ounce loaf brioche or challah bread (cut into slices about 1/2-inch thick and about 3 inches square or round, which sounds really persnickety, but they really do fit better in the pan this way)",
    "8 large eggs",
    "1 cup mascarpone cheese, divided (1/4 cup for custard; 3/4 cup for serving)",
    "1 cup milk",
    "1/4 teaspoon almond extract"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Photo"
  ],
  "title": "morning bread pudding with salted caramel",
  "url": "https://smittenkitchen.com/2014/02/morning-bread-pudding-with-salted-caramel/"
}