{
  "date": "2015-02-17T11:30:26+00:00",
  "directions": [
    "Heat oven to 425°F (220°C). Either grease or line a 12-cup standard muffin tin with disposable liners.",
    "Whisk 1 1/2 cups cornmeal, flour, baking powder, baking soda and salt together in a medium bowl. In a large bowl (if you have a microwave) or a medium saucepan (if you do not), combine milk and remaining 1/2 cup cornmeal. In a microwave, cook cornmeal–milk mixture for 1 1/2 minutes, then whisk thoroughly, and continue to microwave in 30-second increments, mixing between them, until it’s thickened to a batter-like consistency, i.e. the whisk will leave a clear line across the bottom of the bowl that slowly fills in. This will take 1 to 3 minutes longer. On the stove, cook cornmeal mixture over medium heat, whisking constantly, until it thickens as described above, then transfer to a large bowl.",
    "Whisk butter, then sugar, then sour cream into cooked cornmeal until combined. At this point, the wet mixture should be cool enough that adding the eggs will not scramble them, but if it still seems too hot, let it cool for 5 minutes longer. Whisk in eggs until combined. Fold in flour mixture until thoroughly combined and the batter is very thick. Divide batter evenly among prepared muffin cups; it will mound slightly above the rim.",
    "Bake until tops are golden brown and toothpick inserted in center comes out clean, 13 to 17 minutes, rotating muffin tin halfway through baking to ensure even cooking. Let muffins cool in muffin tin on wire rack for 5 minutes, then remove muffins from tin and let cool 5 minutes longer. Serve warm.",
    "P.S. You can make your own makeshift muffin liners from 5 to 6-inch squares of parchment but please, maybe test it first to see if it can reach the heat the package promises, as these, despite advertising a heat limit of 450°F, set off my smoke detector multiple times and were definitely not worth the trouble."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/perfect-corn-muffins1.jpg?w=750",
  "ingredient_list": [
    "2 cups (280 grams) yellow cornmeal, to be divided",
    "1 cup (130 grams) all-purpose flour",
    "1 1/2 teaspoons baking powder",
    "1 teaspoon baking soda",
    "1 1/4 teaspoons fine sea or table salt",
    "1 1/4 cups (300 ml) milk, whole is best here",
    "1 cup (240 grams) sour cream (full-fat plain yogurt should work here too)",
    "8 tablespoons (115 grams) unsalted butter, melted and cooled slightly",
    "3 to 5 tablespoons (35 to 60 grams) sugar (see Note up top about sweetness)",
    "2 large eggs"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Muffin/Quick Bread",
    "Photo"
  ],
  "title": "perfect corn muffins",
  "url": "https://smittenkitchen.com/2015/02/perfect-corn-muffins/"
}