{
  "date": "2010-01-20T12:57:15+00:00",
  "directions": [
    "Adjust the oven rack to the center position and preheat oven to 325°F. Lightly butter a 1/2-cup capacity muffin tin.",
    "Spread the nuts on a baking sheet and toast in the oven until lightly browned (though I like my pecans a darker brown, for better flavor), about 8 to 10 minutes. Shake the pan halfway through to ensure that the nuts toast evenly. Cool, chop finely and set aside.",
    "Turn the oven up to 350°F.",
    "In a small sauté pan over medium heat, toast the fennel seeds, stirring occasionally until they become aromatic and turn slightly brown, about 2 to 3 minutes. Allow to cool and finely chop, crush or grind in a spice grinder, clean coffee grinder or mortar and pestle.",
    "In a large bowl, sift the flour, sugar, baking powder and baking soda together to combine. Sprinkle in the fennel seeds. Make a large well in the center and pour in the yogurt and oil. Whisk together the liquids and gradually draw in the the dry ingredients, mixing until incorperated.",
    "To prepare the filling: Place the ricotta in a mixing bowl and, if stiff, break it up wtih a rubber spatula to loosen. Stire in the crème fraîche and a pinch of salt.",
    "Using a pastry bag fitted with a wide tip, a plastic bag with the corner snipped off or a spoon, fill each muffin tin one-third of the way with batter. Place one tablespoon of the filling into the center of each muffin.",
    "(I suspect at this point that Silverton believes that your filling will be thick, and perhaps with a stiff ricotta and crème fraîche, it might have been, but my mixture, with store brand ricotta and sour cream, was more of a puddle that spilled out into a flat layer. While it didn’t matter in the end, it did make it harder to put the remaining muffin batter — which was stiffer than the filling — over the ricotta mixture with just a spoon and I ended up having to go the plastic bag/piping bag route to easily cover it. Grumble-gripe.)",
    "Pipe or spoon the remaining batter into the cups, filling them to just below the rim. (Unlike you see in my pictures, as I overfilled the tins.) Sprinkle about 1 teaspoon of the nuts over the top of each. (I had extra.)",
    "Bake for 25 to 30 minutes, until lightly brown and firm to the touch.",
    "Do ahead: I’m going to put a big question mark in this space until smarter people than me weigh in on whether a ricotta-filled muffin can be stored at room temperature. (We left them out and lived to tell you about them, but perhaps this was still a no-no?) Muffins always freeze well, however if you’re looking to a get a head start."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/ricotta-muffins.jpg?w=753",
  "ingredient_list": [
    "1/2 cup (2 ounces) walnuts or pecans",
    "2 teaspoons fennel seeds",
    "3 cups (380 grams) unbleached pastry flour or unbleached all-purpose flour",
    "3/4 cup (150 grams) granulated sugar",
    "1 tablespoon plus 1 teaspoon baking powder",
    "3/4 teaspoon baking soda",
    "1 1/2 cups (345 grams) plain yogurt",
    "3/4 cup (150 grams) vegetable oil (though I imagine that olive oil would be a delicious swap whoops, many commenters who tried it said that the olive oil was way too heavy; listen to them, not me!)",
    "1/2 cup (125 grams) ricotta cheese",
    "6 tablespoons (90 grams) crème fraîche or sour cream",
    "Kosher salt, to taste"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Muffin/Quick Bread",
    "Photo"
  ],
  "title": "ricotta muffins",
  "url": "https://smittenkitchen.com/2010/01/ricotta-muffins/"
}