{
  "date": "2013-11-04T12:05:18+00:00",
  "directions": [
    "Heat oven to 500 degrees. Place parchment paper* on tray and sprinkle with cornmeal. Stretch pieces of dough into 6 to 7-inch thin, round-ish shapes.",
    "If using grown-up spinach, remove coarse stems. No need to remove stems from baby spinach. Wash and drain spinach leaves but no need to fully dry. In a large skillet, cook spinach with water droplets still clinging to the leaves (if it seems too dry, add another tablespoon or two of water to the pan) until spinach just wilts. Plunge spinach in cold water, then transfer it to a colander. Press out as much liquid as you can, then squeeze the rest in small fisfuls.",
    "Transfer to cutting board and chop spinach into small bits. In a bowl, combine it with creme fraiche, garlic, parmesan, salt and pepper. ",
    "Divide spinach mixture over each dough round, spreading almost to the edges, thinning it slightly in the center with a spoon to make an indentation to help hold the egg in place. If using small eggs, crack one into the center of each pizzette. If using larger eggs, separate the egg. Add yolk to center of spinach, then pour in egg white carefully, so not to add so much that it floods the pizza. However, if it does spill over, don’t sweat it, that’s what the parchment is for. ",
    "Either bake pizza directly on parchment covered trays or slide parchment onto pizza stones for anywhere from 6 to 8 minutes (in a very robust oven), to 10 to 13 minutes (in a regular one)**, until egg white is set and the yolk is still loose. As soon as you remove the pizzette from the oven, add a grind of black pepper, very thin drizzle of olive oil and scatter some extra parmesan over it. Eat immediately.",
    "* Technically speaking, parchment paper should not go in an oven hotter than 450 degrees, but I’ve found that nothing bad happens, it only gets a little brown at the edges. Without the parchment, any egg run-off tends to cement the pizzette to the pan, no fun at all.",
    "** The baking times are especially finicky here. These will work for most people, however, if your egg becomes too cooked before the pizza is remotely golden at the edges, you might want to add it later in the cooking time. Be especially cautious of this if using small eggs."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/spinach-and-egg-pizzettes1.jpg?w=640",
  "ingredient_list": [],
  "tags": [
    "Brunch",
    "Eggs",
    "Italian",
    "Photo",
    "Pizza",
    "Put An Egg On It",
    "Spinach",
    "Vegetarian"
  ],
  "title": "spinach and egg pizzette",
  "url": "https://smittenkitchen.com/2013/11/spinach-and-egg-pizzettes/"
}