{
  "date": "2012-06-06T13:40:04+00:00",
  "directions": [
    "Preheat oven to 425 degrees. Line a large baking sheet with parchment paper.",
    "In the bottom of a large, wide-ish bowl, whisk flours, baking powder, sugar and salt together. Add butter, either by cutting it in with two knives or a pastry blender (alternatively, you can freeze the butter and grate it in on the large holes of a box grater; a tip I learned from you guys) cut it into the flour mixture with a pastry blender, breaking it up until the mixture resembles a crumbly meal with tiny pea-sized bits of butter about. Gently stir in the strawberries, so that they are coated in dry ingredient, then stir in heavy cream. (I like to use a rubber spatula to gently lift and turn the ingredients over each other.) When you’ve mixed it in as best as you can with the spatula, go ahead and knead it once or twice in the bowl, to create one mass. Do not worry about getting the dough evenly mixed. It’s far more important that the dough is not overworked.",
    "Generously flour your counter. With as few movements as possible, transfer your dough to the counter, generously flour the top of it and with your hands or a rolling pin, gently roll or press the dough out to a 3/4-inch thickness. Cut into 2 1/2-inch circles with a floured biscuit cutter or top edge of a drinking glass, pressing straight down and not twisting (this makes for nice layered edges) as you cut. Carefully transfer scones to prepared baking sheet, leaving a couple inches between each.",
    "You can re-roll the scraps of dough, but don’t freak out over how wet the dough becomes as the strawberries have had more time to release their juice. They’ll still bake up wonderfully.",
    "Bake the scones for 12 to 15 minutes, until bronzed at the edges and the strawberry juices are trickling out of the biscuits in places. Cool in pan for a minute, then transfer to a cooling rack. Serve warm or at room temperature.",
    "Do ahead: Biscuits are generally best the day they are baked. However, if you wish to get a lead on them, you can make them, arrange them on your parchment-lined sheet and freeze them. If you’re prepping just one day in advance, cover the tray with plastic wrap and bake them the day you need them. If you’re preparing them more than one day in advance, once they are frozen, transfer them to a freezer bag or container. Bring them back to a parchment-lined sheet when you’re ready to bake them. No need to defrost the froze, unbaked scones, just add 2 to 3 minutes to your baking time."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/strawberries-and-cream-biscuits1.jpg?w=500",
  "ingredient_list": [
    "2 1/4 cups (280 grams) all-purpose flour",
    "1 tablespoon (15 grams) aluminum-free baking powder",
    "1/4 cup (50 grams) granulated sugar",
    "1/2 teaspoon table salt",
    "6 tablespoons (85 grams) cold, unsalted butter",
    "1 cup (about 130 grams) chopped very ripe strawberries (I quarter small or medium ones and further chop larger ones)",
    "1 cup heavy cream "
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Photo",
    "Scones/Biscuits",
    "Strawberries",
    "Summer"
  ],
  "title": "strawberries and cream biscuits",
  "url": "https://smittenkitchen.com/2012/06/strawberries-and-cream-biscuits/"
}