[
    {
        "ingredient_list": [
            "1 head Savoy cabbage", 
            "1 pound ground beef", 
            "1 small to medium onion, chopped small", 
            "2 tablespoons olive oil", 
            "1 carrot, shredded", 
            "1 celery stalk, thinly sliced", 
            "1 parsnip, shredded", 
            "1/2 cup uncooked white rice", 
            "1 to 2 tablespoons tomato paste", 
            "3 to 4 cups of your favorite simple tomato sauce, tomato juice or V8"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/alexs-moms-stuffed-cabbage1.jpg?w=500", 
        "tags": [
            "Budget", 
            "Cabbage", 
            "Freezer Friendly", 
            "Meat", 
            "Photo", 
            "Russian"
        ], 
        "url": "https://smittenkitchen.com/2009/02/alexs-moms-stuffed-cabbage/", 
        "title": "alex’s mom’s stuffed cabbage", 
        "directions": [
            "Cut the core out of the cabbage but leave it whole. Place it, with the empty core area facing up, in a large bowl. Boil a small pot of water and pour the water over the cabbage and let it sit for ten minutes.", 
            "Heat the oil in a saute pan. (I like to use the large one I will cook the final dish in — a deep 12-inch saute pan — to save dishes.) Cook the onions until they are soft, add the carrot, celery and parsnip and saute them for a couple extra minutes — until they are also soft. Season the mixture with salt and pepper, transfer it to a bowl and let it cool a bit. Mix in the meat, rice and tomato paste and season again with salt and pepper.", 
            "Drain the head of cabbage. Pull off large leaves, cut out the large vein — if the leaf is very large, you can make two rolls from each, if it is smaller, you can cut the vein out partially and pull the sides to overlap before you roll it into one roll. Pat the leaves dry with towels. Roll about 1/4 to 1/3 cup of filling in each leaf (depending on the size of your leaf) and arrange in a large, wide pot. Pour in enough juice or sauce to cover the rolls. Bring to a boil and reduce the heat, letting them simmer covered on the stove on low for about 45 minutes. Serve immediately. If sauce has thinned a bit, you can heat up any additional sauce you didn’t use and pour it over as you serve the rolls.", 
            "[These also freeze very well.]"
        ], 
        "date": "2009-02-08T08:00:22+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/01/apple-sharlotka.jpg?w=750", 
        "tags": [
            "Apple", 
            "Everyday Cakes", 
            "Photo", 
            "Russian"
        ], 
        "url": "https://smittenkitchen.com/2012/01/apple-sharlotka/", 
        "title": "apple sharlotka", 
        "directions": [
            "Preheat oven to 350 degrees. Line the bottom of a 9-inch springform pan with parchment paper. Butter the paper and the sides of the pan. Peel, halve and core your apples, then chop them into medium-sized chunks. (I cut each half into four “strips” then sliced them fairly thinly — about 1/4-inch — in the other direction.) Pile the cut apples directly in the prepared pan. Meanwhile, in a large bowl, using an electric mixer or whisk, beat eggs with sugar until thick and ribbons form on the surface of the beaten eggs. Beat in vanilla, then stir in flour with a spoon until just combined. The batter will be very thick.", 
            "Pour over apples in pan, using a spoon or spatula to spread the batter so that it covers all exposed apples. (Updated to clarify: Spread the batter and press it down into the apple pile. The top of the batter should end up level with the top of the apples.) Bake in preheated oven for 55 to 60 minutes, or until a tester comes out free of batter. Cool in pan for 10 minutes on rack, then flip out onto another rack, peel off the parchment paper, and flip it back onto a serving platter. Dust lightly with ground cinnamon.", 
            "Serve warm or cooled, dusted with powdered sugar. Alex’s family eats it plain, but imagine it would be delicious with a dollop of barely sweetened whipped or sour cream."
        ], 
        "date": "2012-01-06T15:05:00+00:00"
    }, 
    {
        "ingredient_list": [
            "6 large eggs", 
            "4 medium asparagus spears", 
            "2 teaspoons very finely minced shallot, scallion or chives, plus a pinch extra for garnish", 
            "3 tablespoons mayonnaise, whipping cream, creme fraiche, sour cream and/or soft butter", 
            "1/2 teaspoon smooth Dijon (optional)", 
            "Few gratings fresh lemon zest (optional)", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/asparagus-stuffed-eggs1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Asparagus", 
            "Breakfast", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/04/asparagus-stuffed-eggs/", 
        "title": "asparagus-stuffed eggs", 
        "directions": [
            "Hard-boil eggs using whichever method you prefer. I cover mine with cold water, bring it to a boil, then set a timer for 9 1/2 minutes. When it rings, drain the eggs, and plunge them in ice water until they’re fully cool. Eggs can be cooked ahead of time and stored in the fridge for up to 4 days. ", 
            "Cook asparagus spears in salted simmering water until full tender, about 4 to 5 minutes. Drain and plunge in cold water. Drain and again and spread on towels to dry out as much as possible. Cut 1/2-inch off the tips of each spears and cut these tips lengthwise (they’ll be your garnish). Puree remaining asparagus — I found that my food processor didn’t do a great job due to the small volume, but yours might. A food mill with a fine disc works well here. ", 
            "You’ll want to remove the excess water from your puree; I did so by spreading it for a minute on a few paper towel layers. If you don’t, the filling will be soggy and damp, or in Julia’s words, “a disappointing texture and flavor.” ", 
            "Peel your eggs. Dip your knife in water before cutting each in half lengthwise for a cleaner cut. Shave a thin strip off the bottom of each so that it will not rock about in its dish. Remove the yolks and press them through a fine-mesh strainer to sieve them. Add asparagus puree, shallot or chives, mayonnaise or cream, Dijon or lemon zest (if using) and combine mixture until smooth. Season carefully with salt and freshly ground black pepper.", 
            "You can spoon the mixture into each egg half, or use a piping bag with a star tip for a fancier presentation. Decorate each stuffed egg with a reserved asparagus tip (you’ll be a little short of what you need), and the remaining with the extra shallot, scallion or chives. Wrap tray in plastic and keep in fridge until ready to serve. "
        ], 
        "date": "2014-04-08T12:25:30+00:00"
    }, 
    {
        "ingredient_list": [
            "6 cups low-sodium chicken stock or vegetable broth, but best to have an extra splash or two around if needed", 
            "1 cup (4 ounces) finely chopped bacon (from about 4 slices) or pancetta", 
            "1 tablespoon olive oil", 
            "2 large or 3 smaller leeks, quartered lengthwise, cleaned of grit, and chopped small", 
            "3 tablespoons unsalted butter, plus more to fry eggs", 
            "1/2 small onion, finely chopped", 
            "2 cups arborio, carnaroli, or another short-grained Italian rice", 
            "1/3 cup dry white wine or vermouth (read why here)", 
            "1 cup finely grated fresh Parmesan cheese, plus extra for garnish if desired", 
            "Salt and freshly ground black pepper", 
            "4 to 6 large eggs, you’ll want one per serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/bacon-egg-and-leek-risotto.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Grain/Rice", 
            "Photo", 
            "Put An Egg On It"
        ], 
        "url": "https://smittenkitchen.com/2012/05/bacon-egg-and-leek-risotto/", 
        "title": "bacon, egg and leek risotto", 
        "directions": [
            "Place stock or broth in a small-medium saucepan over very low heat on a back burner. You want to have it heated until steamy when you add it in a bit, but not so much that it simmers and loses volume.", 
            "Heat a second medium saucepan (3 quarts) or skillet over medium heat. Add bacon or pancetta and cook until it renders its fat, and is tender and just barely crisp. Remove with a slotted spoon to a bowl and set aside, leaving whatever dripping you can in the pan. Add a tablespoon of oil to the bacon fat if needed, then add the leeks. Cook leeks on medium-low for 10 to 12 minutes, until softened and mostly tender. Transfer to bowl with bacon and set aside, leaving stove on.", 
            "Add butter to pan and, once melted, cook onion in butter until translucent and tender, about 5 minutes. Add rice and cook sauté until faintly toasted, about 4 minutes. Add wine or vermouth and cook until it almost disappears, about 2 minutes. Ladle 1 cup of hot broth into the rice mixture and simmer until it absorbs, stirring frequently. Add remaining broth 1/2 cup at a time, allowing broth to be absorbed before adding more and stirring frequently until rice is al dente, about 25 to 30 minutes. What you’re looking for in well-cooked risotto is a creamy but loose dish. When ladled onto a plate, it should spill into a creamy puddle, not heap in a mound. You might need an extra splash of broth to loosen it. When you achieve your desired texture and tenderness, stir in the cheese, bacon and leeks. Season with salt and pepper to taste. Ladle into serving bowls.", 
            "Then, quickly, in a small skillet, heat a pat of butter over medium-high and swirl it to coat the pan. Crack one egg into the skillet, season with salt and pepper and reduce heat to medium. I like to cover the skillet with a small lid at this point, as it seems to help the egg cook faster and more evenly. In one minute, you should have a perfect sunny-side-up egg. Transfer to your first bowl of risotto and repeat with remaining eggs. Garnish each with an extra bit of grated parmesan and eat immediately."
        ], 
        "date": "2012-05-07T13:36:02+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds (32 ounces) ounces fresh baby spinach or regular spinach leaves", 
            "1 small yellow onion, finely chopped", 
            "3 small garlic cloves, minced", 
            "4 tablespoons unsalted butter", 
            "1 pound mushrooms, thinly sliced (I use creminis)", 
            "1 cup heavy cream", 
            "3/4 teaspoon table salt", 
            "Freshly ground black pepper", 
            "1/4 teaspoon freshly grated nutmeg (optional; I skip this)", 
            "12 large eggs", 
            "6 tablespoons finely grated Parmesan cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/baked-eggs-with-spinach-and-mushrooms.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Mushrooms", 
            "Spinach", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/04/baked-eggs-with-spinach-and-mushrooms/", 
        "title": "baked eggs with spinach and mushrooms", 
        "directions": [
            "If you’ve just washed your spinach, no need to dry it before wilting it in the pan. If it’s already dry, bring 1/2 inch water to a boil in a very large ovenproof heavy skillet, then add half of spinach and cook, turning with tongs, until wilted, about 30 seconds. Add remaining spinach and wilt in same manner, then cook, covered, over moderately high heat until spinach is tender, about 1 to 2 minutes. Drain in a colander and cool under cold running water. Gently squeeze handfuls of spinach to remove as much liquid as possible, then coarsely chop. You will have about 2 cups fairly tightly packed cooked spinach.", 
            "Wipe skillet dry, then melt butter over medium-low heat. Cook onion and garlic until softened, 2 to 3 minutes. Add mushrooms and increase heat to medium-high, then cook, stirring, until mushrooms have softened, exuded liquid and that liquid has cooked off, about 5 minutes. Stir in cream, salt, pepper, nutmeg (if using), and chopped spinach and bring back a simmer. Remove skillet from heat.", 
            "If baking eggs in this skillet, make 12 large indentations in mixture, each large enough to fit an egg. Otherwise, you can transfer this mixture to a 9×13-inch baking dish and do the same there. I like to use 2 teaspoons to make the wells; I press the backs of them together to “pinch” up the spinach mixture to form taller walls so that the eggs will not merge together. ", 
            "Do ahead: You can then set this aside for a few hours or up to one day in the fridge, covered.", 
            "When you’re ready to bake the dish, or about 30 minutes before serving, put oven rack in upper third of oven and heat oven to 450°F. Crack an egg into each well. Bake until whites are firm and yolks are still runny. You can check this by inserting a toothpick into various parts of the eggs and seeing whether they’re runny or set, which takes anywhere from 15 to 30 minutes. The range is long due to different ovens and baking vessels. It’s better to have to check more often than to let them overcook.", 
            "[Cooking note: It is nearly impossible to get all 12 eggs to cook evenly. The ones in the center will be more runny; at the edges, they’ll be more firm. But don’t fret. I’ve found that almost all people have an egg preference (more runny vs. more firm) and each egg manages to find the right home. Just ask people their preference as you serve them.]", 
            "Remove dish from oven, sprinkle with additional salt and pepper, plus grated Parmesan. Serve immediately."
        ], 
        "date": "2014-04-16T12:31:29+00:00"
    }, 
    {
        "ingredient_list": [
            "2 packages (1 1/2 tablespoons) active dry yeast", 
            "Pinch of sugar", 
            "1/2 cup warm water (105 to 115 degrees)", 
            "2 cups water", 
            "1/4 cup molasses", 
            "1/4 cup apple cider vinegar", 
            "4 tablespoons unsalted butter", 
            "1 ounce unsweetened chocolate", 
            "1/2 cup whole-wheat flour", 
            "3 cups medium rye flour", 
            "3 cups unbleached, all-purpose or bread flour", 
            "1 cup bran", 
            "2 tablespoons caraway seeds", 
            "1/2 teaspoon fennel seeds", 
            "1 tablespoon salt", 
            "1 tablespoon instant espresso powder", 
            "1 tablespoon minced shallots", 
            "1/4 cup cornmeal (optional)", 
            "1 tablespoon unbleached all-purpose flour  (optional)", 
            "1 teaspoon caraway seeds  (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/black-bread1.jpg?w=500", 
        "tags": [
            "Bread", 
            "Photo", 
            "Russian"
        ], 
        "url": "https://smittenkitchen.com/2009/04/black-bread/", 
        "title": "black bread", 
        "directions": [
            "Special equipment: Spice grinder (optional), instant-read thermometer", 
            "1.    In a small bowl, combine yeast and sugar with warm water. Stir to dissolve and let stand until foamy, about 10 minutes.", 
            "2.    Heat two cups water, molasses, vinegar, butter and chocolate until the butter and chocolate are melted. Set aside and let cool to lukewarm warm.", 
            "3.    Combine whole-wheat, rye and white flours in a large bowl. Set aside.", 
            "4.    In bowl of a heavy mixer fitted with a paddle attachment, combine two cups mixed flours, bran, 2 tablespoons caraway seeds, fennel seeds, salt, espresso and shallots. At low speed, add yeast and chocolate mixtures. Mix until smooth and beat at medium speed for three minutes. (If you don’t like whole seeds in your bread, grinding them in a spice grinder, coffee grinder or mortar and pestle allows their flavor to come through without the texture. I always make my black bread this way.)", 
            "[Note: This, or any bread, can also be made by hand, simply mixing the ingredients in a large bowl with a wooden spoon and kneading the dough on a counter until springy and smooth.] ", 
            "5.    At low speed, add half cup of remaining mixed flours at a time, until dough clears sides of bowl and begins to work its way up paddle. It will be very sticky but firm.", 
            "6.    Scrape dough off paddle, flour counter well, and knead to make a springy yet dense dough. You might not use all of the flour mixture.", 
            "7.    Form into a ball and place in a greased bowl. Turn once to grease top. Cover with plastic wrap and let rise in a warm area until doubled, about 1 1/2 to 2 hours. Combine cornmeal, flour and remaining caraway seeds, if using, and set aside.", 
            "8.    Gently deflate dough. Turn out onto a lightly floured surface. Divide into two portions and form into two rounds or loaves.  Loaves should be placed in a loaf pan sprayed with nonstick spray, while rounds should be placed seam down on a greased or parchment-lined baking sheet. Sprinkle loaves with cornmeal mixture, if using. Cover loosely with plastic wrap. Let rise until doubled and puffy, about 45 minutes to one hour. Slash an X into the top of a round before baking it; no such slashing is needed for bread in a loaf pan.", 
            "9.    Bake in a preheated 350°F oven for 45 to 50 minutes or until loaves are well-browned, or register an internal temperature of 200 to 210°F on an instant-read thermometer. Baking time in your oven may vary — check in on the bread when it is 2/3 to 3/4 of the way through the baking time to make sure it has not super-speedily baked. Remove from baking sheet to cool completely on a rack."
        ], 
        "date": "2009-04-29T09:54:13+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 teaspoon dry active yeast", 
            "2 cups plus 2 tablespoons bread flour, plus more for dusting", 
            "Kosher salt", 
            "6 strips bacon", 
            "1/2 cup grated Parmesan", 
            "2 cups grated mozzarella", 
            "6 large eggs", 
            "Freshly ground black pepper", 
            "2 tablespoons minced flat-leaf parsley", 
            "2 tablespoons minced chives", 
            "2 scallions, thinly sliced", 
            "1 shallot, minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/03/breakfast-pizza.jpg?w=752", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Pizza", 
            "Put An Egg On It"
        ], 
        "url": "https://smittenkitchen.com/2010/03/breakfast-pizza/", 
        "title": "breakfast pizza", 
        "directions": [
            "The night before, prepare the dough: Place 3/4 cup lukewarm water in the bowl of an electric mixer fitted with a dough hook. Sprinkle in the yeast, stir and let sit for 5 minutes. Add the flour and 1 teaspoon of salt and mix on low for 1 minute. Increase the speed to medium and mix for 2 minutes, then increase the speed to high and mix until a smooth dough forms, about 2 minutes more. Turn the dough onto a lightly floured surface, divide into two equal pieces and form each half into a tight ball. Place on a large floured sheet pan, place the pan in a plastic garbage bag, tie the bag loosely and refrigerate overnight.", 
            "One to two hours* before baking, place the dough in a warm spot. Adjust the oven rack to the lowest position and set a pizza stone on it. Preheat the oven to 500 degrees 30 minutes before you are ready to bake the pizza.", 
            "Prepare the dough and toppings: Fry the bacon in a large sauté pan over medium-high heat until crisp. Cool on a paper-towel-lined plate; roughly chop.", 
            "Dip your hands and a ball of dough into the flour. On a lightly floured countertop, pat the dough into a disc with your fingertips, then drape the dough over your fists and carefully stretch it from beneath to form a 12-inch circle.", 
            "Generously dust the surface of a pizza peel or large inverted sheet pan with flour and place the stretched dough on it. Sprinkle the dough with half of the Parmesan, mozzarella and bacon. Crack 3 eggs over the top and season with salt and pepper.", 
            "Bake the pizza: Shake the pizza peel slightly to make sure the dough is not sticking. Carefully lift any sections that are sticking and sprinkle a bit more flour underneath, then slide the pizza directly onto the baking stone in one quick forward-and-back motion. Bake for 8 to 10 minutes, rotating after 5 minutes. When the crust is golden, the cheese is melted and the egg yolks are cooked, use the peel to transfer the pizza to a cutting board. Sprinkle half of the parsley, chives, scallions and shallot on top. Let cool for 2 minutes, slice and serve immediately. Prepare the second pizza in the same way.", 
            "* The original recipe suggests that you take the dough out one hour before baking but I took mine out two hours earlier, because I always find it takes a looong time to get dough back to proofing at room temperature. In this time, you can lazily prepare the toppings and get your oven nice and hot."
        ], 
        "date": "2010-03-11T11:15:18+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "3 3/4 (470 grams) cups all-purpose flour (feel free to replace up to half with whole-wheat)", 
            "1 1/2 teaspoons table salt", 
            "3 sticks (340 grams) unsalted butter, very cold", 
            "3/4 cup very cold water", 
            "Filling", 
            "1 pound yukon gold potatoes, peeled if desired, cut into 1/2-inch slices", 
            "10 ounces spinach (baby, “grown-up,” or frozen)", 
            "1 cup coarsely grated sharp cheddar cheese", 
            "4 scallions, thinly sliced", 
            "11 large eggs + 1 large egg white (you’ll use the yolk in a minute)", 
            "1 teaspoon kosher or coarse sea salt, plus more to taste", 
            "Freshly ground black pepper", 
            "To finish", 
            "1 large egg yolk (leftover from filling)", 
            "1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/breakfast-slab-pie1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Potatoes", 
            "Spinach", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/12/breakfast-slab-pie/", 
        "title": "breakfast slab pie", 
        "directions": [
            "Make pie crust: Whisk together flour, and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in the water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough roughly in half (it’s okay if one is slightly larger). Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day. [Still freaked out about making your own pie dough? Read this for a ton of additional tips and details.]", 
            "Heat oven  oven to 375 degrees F. Line bottom of 10x15x1-inch baking sheet or jellyroll pan with parchment paper.", 
            "Prepare filling: Place potatoes in a medium saucepan and cover with cold water. Bring to a boil, then reduce to a simmer, cooking for 7 to 10 minutes, until potatoes are tender but not falling apart. Drain. ", 
            "Wash spinach but no need to dry it. Place wet spinach in hot skillet and cook until it just wilts. Drain in a colander, pressing or squeezing out as much liquid as possible. You should have about 1 cup of spinach one wilted and squeezed. If spinach leaves were large, you might want to roughly chop the squeezed-out piles of spinach before adding it to the filling. ", 
            "Assemble pie: On a lightly floured surface, roll one of your dough halves (the larger one, if you have two different sizes) into an 18-by-13-inch rectangle. This can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible and using enough flour that it doesn’t stick to the counter. Transfer to your prepared baking sheet and gently drape some of the overhang in so that the dough fills out the inner edges and corners. Some pastry will still hang over the sides of the pan; trim this to 3/4-inch overhang.", 
            "Layer vegetables evenly over bottom pie crust. [You don’t want your pie to look like this, after all. NSFW language there, btw.] If using the fillings that I did, beat 11 whole eggs and 1 egg white lightly and pour over vegetables. If you’ve used other fillings, you might find that you need more or fewer eggs to mostly fill (I did not want to fill the crust to the top with eggs, as it would have been more difficult to bake without filling) the bottom crust; if you’re nervous, just beat a few eggs at a time and pour them in until your filling reaches the desired level. Sprinkle with salt and many grinds of black pepper.", 
            "Roll the second of your dough halves (the smaller one, if they were different sizes) into a 16-by-11-inch rectangle. Drape over filling and fold the bottom crust’s overhang over the edges sealing them together. Cut only a couple tiny slits in the lid to act as vents — too many or too big, and the filling will want to leak out before the eggs set. Beat remaining egg yolk with 1 teaspoon water and brush over lid. ", 
            "Bake pie: Until crust is golden and filling is set, about 40 to 45 minutes. Transfer to a wire rack and cool a bit before cutting into squares.", 
            "Do ahead: I haven’t frozen this pie, but suspect that it will freeze well already baked. Or, you could make the pie doughs up to one month in advance (storing them in the freezer), four days in advance (to store in the fridge) and roll them out when you’re ready to bake the pie. Baked slab pie will keep in the fridge for 3 to 4 days. Squares can be reheated as needed. Vegetables can be prepped (spinach wilted, potato par-boiled) and stored in the fridge for 2 days before using."
        ], 
        "date": "2013-12-20T12:29:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium cauliflower (1 1/2 pounds, 23 to 24 ounces or 650 to 700grams)", 
            "1 large red onion, peeled", 
            "7 1/2 tablespoons (100 grams or 3.5 ounces) olive oil (I used 5 tablespoons, see Note up top)", 
            "1/2 teaspoon finely chopped rosemary", 
            "10 medium or 8 large eggs", 
            "Handful (3/4 ounce or 20 grams) basil, chopped", 
            "Scant 1 1/2 cups (180 grams or 6.3 ounces) all-purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "1/2 teaspoon ground turmeric", 
            "2 cups finely grated parmesan cheese (200 grams or 7 3/4 ounces, see Note up top) or about 1 generous cup of grated Romano cheese", 
            "Salt and black pepper", 
            "Butter, for greasing pan", 
            "2 tablespoons black sesame seeds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cauliflower-and-parmesan-cake1.jpg?w=500", 
        "tags": [
            "Cauliflower", 
            "Eggs", 
            "Fall", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/10/cauliflower-and-parmesan-cake/", 
        "title": "cauliflower and parmesan cake", 
        "directions": [
            "Preheat oven to 350°F (180°C) degrees. Break cauliflower into medium florets (this will cause less mess than chopping it). Place floret in a pot with a teaspoon of salt, cover them with water and simmer for 15 to 20 minutes, until quite soft. Strain and let drip in the colander for a few minutes so they dry and cool.", 
            "Meanwhile, prepare the batter. Halve your red onion and cut a few thin rings off the end of one side; set them aside. Coarsely chop the remainder of your onion. Heat all of your olive oil in a saucepan (I won’t tell if you use the one where you cooked your cauliflower) and saute the chopped red onion and rosemary together until soft, about 8 minutes. Remove from heat and allow to cool.", 
            "Whisk eggs and olive oil and onion mixture together. Stir in basil. Whisk flour, baking powder, turmeric, cheese, 1 1/2 teaspoons salt (use 1 teaspoon if you are nervous about this amount) and many, many grinds of black pepper together in a separate bowl and add to egg mixture, whisking to remove lumps. Stir in cauliflower gently, so most pieces remain intact.", 
            "Line the bottom of a 9-inch (24cm) round springform pan with parchment paper. Butter the sides generously. Put the sesame seeds in the pan and toss them around so that they stick to the sides. Pour in the cauliflower batter, arrange the reserved onion rings on top and bake cake in the center of the oven for 45 minutes, until golden brown and set.", 
            "Serve warm or at room temperature. Before you serve the cake, be sure to run a knife around the pan. This was probably the first time in my life I forgot, and several parts of the seed-crusted sides tore off!"
        ], 
        "date": "2010-10-20T12:57:42+00:00"
    }, 
    {
        "ingredient_list": [
            "Wrappers", 
            "4 tablespoons unsalted butter, melted and cooled slightly", 
            "1 cup milk (fat level shouldn’t matter, but I use whole)", 
            "4 large eggs", 
            "1 cup all-purpose flour (I swap 1/3 to 1/2 regularly with whole wheat, and did so here)", 
            "Few pinches of salt", 
            "Filling", 
            "2 cups farmer’s cheese, quark, a thicker cottage cheese or ricotta", 
            "6 tablespoons sour cream, mascarpone, creme fraiche or softened cream cheese", 
            "2 tablespoons granulated sugar (or more to taste, see Note up top)", 
            "1/4 teaspoon vanilla extract (if desired)", 
            "Few gratings fresh lemon zest (if desired)", 
            "2 large egg yolks or 1 large egg (optional, see Note up top)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/01/cheese-blintz.jpg?w=750", 
        "tags": [
            "Jewish", 
            "Pancakes", 
            "Photo", 
            "Russian", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/01/cheese-blintz/", 
        "title": "cheese blintz", 
        "directions": [
            "Make wrapper/crêpe batter: Combine wrapper ingredients in a blender, or in a bowl with an immersion blender, or whisk by hand until smooth. Cover with plastic wrap and refrigerate for an hour or up to two days. ", 
            "Cook wrappers/crêpes: Heat a medium skillet or crêpe pan over medium-high heat. Once heated, brush pan lightly with melted butter or oil. If batter has gotten too thick to pour thinly in the fridge, you can add an additional tablespoon or two of milk or water to thin it. Pour 3 to 4 tablespoons batter into skillet, just enough that it coats the bottom in an even layer when you swirl it around. Let cook, undisturbed, until the crêpe becomes a little golden underneath or at the edges. (We can cook these more pale than dessert crêpe, because we’re going to cook them again before serving.) ", 
            "Here’s my crêpe-flipping technique: I use a small offset spatula (my first kind of favorite spatula) to loosen the edges and get underneath the crêpe enough to lift it. Then, in the lifted space between the crêpe and the skillet, I put a flexible fish spatula (my second favorite kind of spatula) further underneath, remove the “lifting” offset spatula, and then use the bigger one to flip it in one movement. If it lands off-center, just shimmy the skillet until it goes back into place. ", 
            "Cook the crêpe on the reverse side for another 20 seconds, then slide onto a plate to cool. Repeat with remaining batter, brushing the skillet with additional oil or butter as needed. You can stack the crêpe on top of each other even when they’re hot; they will not stick.", 
            "Either use the crêpe right away, or cover the plate with plastic wrap and use them in the next 2 days.", 
            "Make filling and fill wrappers: Mix all filling ingredients together until smooth. Place 3 tablespoons or so filling across the center of the top wrapper/crêpe in your stack. Fold the bottom part of the wrapper up and over it; fold the sides in over the bottom and filling, then fold the pancake up to form an egg roll-like shape filled pancake.", 
            "You can use these blintz right away, or refrigerate them for up to 2 days or freeze them between layers of waxed paper for up to 2 months. ", 
            "Serve the blintz: Heat a pat of butter over medium heat in a skillet. Fry blintz until browned on both sides. Transfer to a place and serve with sour cream or a fruit sauce or jam or your choice."
        ], 
        "date": "2014-01-27T12:28:52+00:00"
    }, 
    {
        "ingredient_list": [
            "Dressing (Heads up: I found I only needed half of this)", 
            "3/4 cup canola oil", 
            "1/4 cup extra-virgin olive oil", 
            "1/4 cup red wine vinegar", 
            "1 tablespoon fresh lemon juice", 
            "3/4 teaspoon dry mustard", 
            "1/2 teaspoon Worcestershire", 
            "1/4 teaspoon sugar", 
            "1 clove garlic, minced", 
            "Kosher salt and freshly ground black pepper, to taste", 
            "Salad", 
            "1/2 head iceberg lettuce, cored and shredded", 
            "1/2 head romaine lettuce, chopped", 
            "1/2 bunch watercress, some of the stems trimmed, chopped", 
            "2 ounces blue cheese, crumbled (we used a Stilton)", 
            "6 strips cooked bacon, roughly chopped", 
            "3 hard-boiled eggs, peeled and cut into 1/2-inch cubes", 
            "2 medium tomatoes, peeled*, seeded, and cut into 1/2-inch cubes", 
            "1 boneless skinless chicken breast, cooked and cut into 1/2-inch cubes", 
            "1 avocado, peeled, pitted, and cut into 1/2-inch cubes", 
            "Kosher salt and freshly ground black pepper, to taste", 
            "2 tablespoons chives, minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/classic-cobb-salad.jpg?w=752", 
        "tags": [
            "Avocado", 
            "Eggs", 
            "Photo", 
            "Salad", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2010/04/classic-cobb-salad/", 
        "title": "classic cobb salad", 
        "directions": [
            "Make the dressing: Combine the canola oil, olive oil, vinegar, lemon juice, mustard, Worcestershire, sugar, and garlic in a blender. Purée the ingredients to make a smooth dressing and season with salt and pepper. Set the dressing aside.", 
            "Make the salad: On a (very) large platter, combine the iceberg and romaine lettuces along with the watercress. Arrange the blue cheese, bacon, eggs, tomatoes, chicken, and avocado on top of the greens in neat rows. To serve, drizzle salad with dressing, season with salt and pepper, and top with chives. Alternatively, toss everything together in a bowl.", 
            "Do ahead: Salad dressing keeps, covered and refrigerated, for up to one week. Individual ingredients (except the avocado, which is too prone to browning) can be prepped and chopped, and kept in separate containers in the fridge until you’re ready to assemble the salad. However, no doubt due to sturdiness of 2/3 of the lettuces, I found that the entire assembled salad kept surprisingly well wrapped in plastic in the fridge for a few hours.", 
            "* To peel a tomato: Cut an X in bottom of each tomato and blanch in a large pot of boiling water for 10 seconds. Immediately transfer with a slotted spoon to an ice bath to cool. Slide the skins right off, starting at the X. Completely befuddled by the need for this step? Skip it."
        ], 
        "date": "2010-04-14T22:13:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon butter", 
            "3 cups fresh corn (cut from 3 small-to-average cobs)", 
            "1 1/2 cup thinly sliced scallions (both white and green parts from a 4-ounce bundle)", 
            "8 cups whole wheat, country or French bread in 1-inch cubes (weight will vary from 10 to 14 ounces, depending on bread type)", 
            "2 cups (6 ounces) coarsely grated sharp cheddar", 
            "1 cup (2 ounces) finely grated parmesan", 
            "9 large eggs", 
            "2 tablespoons mayonnaise (optional, see Note up top)", 
            "2 3/4 cups milk", 
            "1 teaspoon table salt or 2 teaspoons of a coarse sea salt", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/corn-cheddar-and-scallion-strata1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Corn", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/corn-cheddar-and-scallion-strata/", 
        "title": "corn, cheddar and scallion strata", 
        "directions": [
            "Generously butter a 3-quart baking dish (a lasagna or 9×13-inch pan works well here too). Toss corn and scallions together in a medium bowl. Combine cheeses in another bowl. In a large bowl, gently beat eggs and mayo together, then whisk in milk, salt and lots (or, if measuring, 1/2 teaspoon) of freshly ground black pepper. Spread one-third of bread cubes in prepared baking dish — it will not fully cover bottom of dish; this is fine. Add one-third of corn, then cheese mixture. Repeat layering twice with remaining bread, corn and cheese. Pour egg mixture evenly over strata. Cover with plastic wrap and refrigerate for at least 8 hours or up to 1 day.", 
            "When ready to bake, heat oven to 350 degrees F. Bake strata, uncovered, until puffed, golden brown and cooked through, about 45 to 55 minutes. Let stand 5 minutes before serving. ", 
            "Do ahead: Strata keeps baked in the fridge for 4 days or longer in the freezer, wrapped well. It reheats wonderfully, either from the fridge or freezer and holds up well in lunch boxes."
        ], 
        "date": "2014-09-03T11:00:41+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (100 grams) coarse yellow cornmeal", 
            "3/4 cup (100 grams) all-purpose flour", 
            "1 teaspoon baking powder", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon kosher salt", 
            "1 tablespoon (15 ml) molasses", 
            "1 cup (235 ml) buttermilk, well-shaken", 
            "4 tablespoons (55 grams) melted unsalted butter", 
            "1 large egg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/cornbread-waffles1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Put An Egg On It", 
            "Waffles"
        ], 
        "url": "https://smittenkitchen.com/2017/03/cornbread-waffles/", 
        "title": "cornbread waffles", 
        "directions": [
            "Combine cornmeal, flour, baking powder, baking soda and salt in the bottom of a medium bowl. In a smaller bowl, whisk molasses, butter, buttermilk and egg until combined. Pour into dry ingredients and stir to combine. Let batter rest for 10 minutes. Use this time to place a oven-safe cooling rack over a tray and heat oven to 200 degrees. Heat waffle iron according to manufacturer’s instructions; I found a medium heat just fine here.", 
            "Brush waffle iron with melted butter or coat with nonstick spray. Ladle in waffle batter, 1/4 cup at a time. (It makes 4 or so -inch finished waffles, cute ones made for an egg on top.) Cook until lightly browned and carefully transfer to rack in oven. They’ll crisp as they set. Repeat with remaining batter. You should get 8 waffles out of this, ideal for 2 per person.\nWaffles keep well for 4 days in fridge and longer in freezer. Waffles re-crisp and come back to life in a warm oven."
        ], 
        "date": "2017-03-25T08:57:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup white wine vinegar", 
            "1/4 cup water", 
            "2 teaspoons Kosher salt (you can go up to 1 tablespoon if using the lighter weight Diamond brand; here’s why)", 
            "1 1/2 teaspoons granulated sugar", 
            "2 stalks celery, trimmed, diced tiny", 
            "4 large eggs", 
            "1 heaped teaspoon whole-grain Dijon", 
            "2 teaspoons minced shallot or red onion (or more to taste)", 
            "2 tablespoons mayonnaise or full-fat plain yogurt", 
            "Salt and freshly ground pepper to taste", 
            "Chopped flat-leaf parsley or fresh dill (to garnish, optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/02/egg-salad-with-pickled-celery-and-coarse-dijon.jpg?w=750", 
        "tags": [
            "Celery", 
            "Eggs", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/02/egg-salad-with-pickled-celery-and-coarse-dijon/", 
        "title": "egg salad with pickled celery and coarse dijon", 
        "directions": [
            "Pickle your celery: Combine vinegar, water, Kosher salt and sugar in a jar and shake it until the salt and sugar dissolve. Add diced celery to jar, cover it and place in the fridge for at least 30 minutes, ideally one hour and up to one week.", 
            "Cook your eggs: Place eggs in a saucepan and cover with an inch of cold water. Bring to a boil over high heat, and once boiling, reduce the heat to medium and set your timer for 10 minutes (for perfectly cooked through eggs), or 9 minutes (if you like them just-barely-set in the center, like mine above). Once the timer rings, drain eggs and rinse under cold water to stop cooking. To quickly chill them so you can use them right away, cover them in ice water for 10 to 15 minutes.", 
            "Make your salad: Peel your eggs and chop them, placing them in a medium bowl. Add 1 heaped tablespoon of pickled celery (more to taste), Dijon, shallot, mayo, salt and pepper and mix. Season to taste with salt and pepper. Serve on toasted whole grain bread, garnished with fresh herbs. "
        ], 
        "date": "2013-02-05T11:35:43+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons olive oil, divided", 
            "1 1/4 to 1 1/2 pounds eggplant; I prefer the long, thin variety here but any will do", 
            "Salt and freshly ground black pepper", 
            "1/2 cup (75 grams) dried couscous (optional)", 
            "1 garlic clove", 
            "1/4 cup packed flat-leaf parsley leaves", 
            "1 cup cherry or grape tomatoes", 
            "2 teaspoons red wine vinegar, plus more to taste", 
            "Red pepper flakes", 
            "1/2 cup plain yogurt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/07/img_3954.jpg?w=750", 
        "tags": [
            "Eggplant", 
            "Grilling", 
            "Photo", 
            "Recipes", 
            "Russian", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/07/eggplant-with-yogurt-and-tomato-relish/", 
        "title": "eggplant with yogurt and tomato relish", 
        "directions": [
            "\nHeat oven to 425 degrees. Trim eggplants and cut in half lengthwise; season cut sides with salt and pepper. Coat a large roasting pan with olive oil (1 to 2 tablespoons). Arrange eggplants cut side down; sprinkle with more salt and pepper. Roast for 25 minutes on the first side, or until brown underneath then flip and roast 5 to 10 minutes more. Remove from oven and let cool slightly.\nMeanwhile, make couscous, if using it. Bring 3/4 cup water and a few pinches of salt to a simmer then pour it over dried couscous in a bowl. Cover with a lid or foil and let side for 5 minutes to absorb, then fluff with a fork.\nMake tomato relish by pulsing garlic and parsley in a blender or food processor until finely chopped, then add tomatoes and pulse until they’re well chopped. Add 1 tablespoon olive oil, vinegar, salt, freshly ground black pepper or a pinch or two of red pepper flakes and pulse to combine. No food process or blender? Not a problem at all; just mince the garlic and parsley well and finely chop the tomatoes; stir this together with the remaining ingredients. Both methods: taste for seasoning. We like this extra sharp and almost always add 1 more teaspoon vinegar and more salt. The longer it sits, the more potent it gets.\nTo assemble, schmear each eggplant half with a little yogurt. If you’re using couscous, sprinkle a little on top. Spoon tomato relish over and serve the rest of all the above on the side."
        ], 
        "date": "2016-07-26T09:40:06+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/eggs-in-purgatory-puttanesca-style1.jpg?w=640", 
        "tags": [
            "Brunch", 
            "Budget", 
            "Eggs", 
            "Italian", 
            "Photo", 
            "Quick", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/03/eggs-in-purgatory-puttanesca-style/", 
        "title": "eggs in purgatory, puttanesca-style", 
        "directions": [
            "On a cutting board, pile garlic, 1/4 cup parsley, olives, capers, anchovies (if using), oregano and pepper and run a knife through them again and again until they’re chopped into a tiny rubble. Heat a small-medium skillet over medium heat. Once hot, swirl in a glug of olive oil and let it warm. Add garlic-parsley heap to pan and cook, stirring, 2 minutes. Add tomatoes carefully because they’re going to splatter like crazy, nd stir to combine. Lower heat to medium-low and simmer sauce for 5 minutes. Taste and add salt or more pepper flakes if needed.", 
            "Make a small indentation in the sauce for each egg you’re using, and crack them in. Sprinkle the eggs and sauce with parmesan and cover pan pan partially with a lid. [This is when you should toast your bread; I like to brush mine with olive oil and run it under the broiler.] Let the eggs cook for 5 minutes, after which the whites are usually set and the yolks still loose, but when I use more than 1 to 2 eggs in the pan, this can take longer. Cook another minute or two if needed, but keep a close watch so you don’t accidentally hard cook them.", 
            "Drizzle pan with a little extra olive oil, then finish with more pepper, cheese and parsley. Eat with toasted bread."
        ], 
        "date": "2016-03-22T11:50:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 can (14 ounces) tomato puree", 
            "1 tablespoon olive oil", 
            "1 clove garlic, minced", 
            "Big pinch of sugar", 
            "Pinch of crushed red pepper flakes", 
            "Coarse salt and freshly ground pepper", 
            "Glug of red wine (optional)", 
            "4 large eggs", 
            "4 slices toasted country bread, for serving", 
            "Freshly grated Parmesan cheese, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/eggs-in-tomato-sauce-contest-winners1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Budget", 
            "Eggs", 
            "Photo", 
            "Quick", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/09/eggs-in-tomato-sauce-contest-winners/", 
        "title": "eggs in tomato sauce", 
        "directions": [
            "In a small skillet, heat olive oil over medium-high heat. Add garlic and crushed red pepper; cook, stirring, until lightly browned, about 1 minute. Add tomato sauce and bring to a boil; season with sugar, salt and pepper. Reduce heat to a simmer and cook for 10 to 20 minutes minutes. A few minutes before it’s done, I like to add a glug of red wine and let it simmer for a moment.", 
            "Gently crack eggs into tomato mixture, cover, and let cook 5 minutes. Remove skillet from heat, uncover, and let stand 2 to 3 minutes.", 
            "Transfer each egg to a piece of toast. Spoon over sauce, garnish with cheese, and season with salt and pepper; serve immediately."
        ], 
        "date": "2008-09-12T17:12:19+00:00"
    }, 
    {
        "ingredient_list": [
            "2 to 3 tablespoons olive oil", 
            "1/2 small yellow onion, chopped", 
            "2 cloves garlic, crushed then minced", 
            "1 red bell pepper, cored and sliced into thin strips", 
            "1 yellow bell pepper, cored and sliced into thin strips", 
            "1 Anaheim or 1 jalapeño chile, cored and sliced into thin strips", 
            "1/2 teaspoon ground cumin", 
            "1 teaspoon paprika", 
            "1/4 teaspoon table salt", 
            "1 14-ounce can crushed tomatoes, fire-roasted if you can get them", 
            "6 eggs", 
            "1/2 cup feta cheese, crumbled", 
            "2 teaspoons (or more to taste) za’atar", 
            "1 to 2 tablespoons chopped flat-leaf parsley (optional), to garnish", 
            "6 small or 4 large pitas", 
            "Pickled shallots", 
            "1/4 cup red or white wine vinegar", 
            "2 teaspoons kosher salt", 
            "1 1/2 teaspoons sugar", 
            "1/4 cup water", 
            "3 small shallots, peeled and thinly sliced", 
            "Asparagus pesto", 
            "1/2 pound asparagus spears, trimmed of tough ends", 
            "1 garlic clove, peeled and chopped", 
            "1/4 cup grated Parmesan cheese", 
            "3 tablespoons pine nuts or almonds, toasted and cooled, divided", 
            "1/4 teaspoon table salt, or a little more of a coarse sea salt", 
            "2 tablespoons olive oil", 
            "To assemble", 
            "6 large slices whole-wheat sourdough bread, miche, or another sliced country bread of your choice, toasted", 
            "2 tablespoons whole grain Dijon mustard", 
            "6 large hard-boiled eggs", 
            "2 to 3 slices of bacon, halved to approximate sandwich lengths", 
            "2 thin slices white, sourdough or a country bread, toasted", 
            "4 thin slices of tomato", 
            "A few leaves of iceberg lettuce", 
            "1 tablespoon mayonnaise", 
            "1 large egg", 
            "1 teaspoon butter", 
            "Salt and freshly ground black pepper to taste", 
            "1 pound Yukon Gold potatoes, cut into small (about 1/2-inch) cubes", 
            "1 tablespoon olive or vegetable oil", 
            "1/2 small onion, finely chopped", 
            "1/2 pound Mexican chorizo, casings removed", 
            "Salt", 
            "Freshly ground black pepper", 
            "6 large eggs", 
            "8 small corn tortillas, warmed or blistered in a hot pan", 
            "To finish", 
            "Crumbled queso freso (cotija, ricotta salata and feta are decent substitutes, if you can’t find it)", 
            "Chopped cilantro, diced tomatoes, diced white onions (you can also sink these in the same pickle brine as the shallots in the earlier recipe), pickled jalapenos, a dollop of crèma or sour cream, a squeeze of lime juice, a dash or hot sauce or all of the above", 
            "Waffles", 
            "3/4 cups all-purpose flour", 
            "3/4 cups cornmeal", 
            "1 1/2 teaspoons baking powder", 
            "1 teaspoon granulated sugar", 
            "1/2 teaspoon table salt", 
            "1 cup buttermilk", 
            "1 tablespoon unsalted butter, melted and cooled slightly", 
            "1 large egg", 
            "1/2 cup finely grated cheddar cheese", 
            "Spray cooking oil to coat waffle iron", 
            "Creamed greens", 
            "5 ounces baby spinach or another fairly quick-cooking green of your choice, stemmed if stems are heavy", 
            "Butter", 
            "1/4 small onion, finely chopped", 
            "3 tablespoons heavy cream", 
            "To assemble", 
            "4 large eggs", 
            "Hot sauce and diced fresh tomatoes (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/five-new-ways-to-make-egg-sandwiches1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2014/05/five-egg-sandwiches/", 
        "title": "five egg sandwiches", 
        "directions": [
            "Preheat your oven to warm and place a tray on a middle rack.", 
            "Make waffles: Whisk flour, cornmeal, baking powder, sugar and salt in a medium bowl. In a smaller bowl, whisk together buttermilk, butter and egg. Stir wet ingredients and grated cheese into the dry mixture until combined. ", 
            "Make waffles according to your manufacturer’s directions. In the waffle iron I used – a thin one that made 6 rectangular waffles per batch – I cooked the waffles on the middle heat setting and needed 1 1/4 to 1 1/2 cups batter per batch. I made about 1 1/2 batches, yielding 9 small waffles. ", 
            "Transfer waffles to tray in warmed oven and leave them there while you cook your greens.", 
            "Prepare creamed greens: Wash greens but no need to dry them. In a large skillet over medium-high heat, cook the greens until wilted. For baby spinach, we prefer it just barely wilted, which takes just a minute. For heartier greens, you’ll want to cook them a few minutes longer. Transfer greens to a colander and press out as much extra liquid as you can. If desired, coarsely chop greens. ", 
            "Wipe out pan and return it to medium heat. Melt butter and then cook onion until soft and tender, about 5 minutes. Return greens to pan and drizzle heavy cream over them. Cook, stirring, until cream simmers for a minute and mixture is evenly combined. Season with salt and freshly ground black pepper and set aside.", 
            "Poach eggs: Poach eggs according to your favorite method. If you don’t have one, here’s mine: Heat a saucepan with a few couple inches of water to the point right before it simmers. Using a cooking spoon, create a whirlpool and crack your egg right into the center of it and stop swirling. The egg should mostly wrap around itself. Continue to let the egg cook, keeping the water from fully simmering, until the white is firmed up but it the egg still jiggles from the middle when nudged with a spoon, about 3 to 4 minutes. Scoop out with a slotted spoon and repeat with remaining eggs.", 
            "Assemble sandwiches: Place one square or wedge of waffle on a plate. Top with 1/4 of the creamed greens and a single poached egg. Dash with hot sauce, if desired, or a scattering of chopped tomatoes. Top with a second square or wedge of waffle and eat, precariously. "
        ], 
        "date": "2014-05-16T10:36:40+00:00"
    }, 
    {
        "ingredient_list": [
            "Eggs", 
            "2 large eggs, at room temperature", 
            "Enough vegetable oil to reach a depth of 1/4-inch", 
            "Salad", 
            "1 cup lightly-packed torn green leaf lettuce (approximately 2-inch pieces)", 
            "1/4 cup thinly sliced yellow onion", 
            "1/4 cup thin or julienned carrot strips", 
            "1/4 cup coarsely chopped celery, Chinese or other, include leaves", 
            "1/4 cup lightly packed coarsely chopped cilantro, thin stems and leaves", 
            "Dressing", 
            "1 1/2 tablespoons lime juice (Key limes are recommended, but don’t fuss if you can’t find them)", 
            "1 1/2 tablespoons palm sugar simple syrup [see Note up top] or 1 tablespoon water + 1 teaspoon dark brown sugar", 
            "1 tablespoon Thai fish sauce", 
            "1 1/2 teaspoons (1 large clove) very thinly sliced garlic", 
            "2 fresh Thai chiles, preferably green, thinly sliced (more or less to taste)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/fried-egg-salad1.jpg?w=750", 
        "tags": [
            "Budget", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2015/01/fried-egg-salad/", 
        "title": "fried egg salad", 
        "directions": [
            "Fry eggs: Heat a wok or small skillet over the highest heat. Once hot, add enough oil to reach a depth of a generous 1/4-inch. Once the oil is hot enough to smoke, carefully crack the eggs into the oil — cautiously, as they will splatter a lot — and decrease the heat to medium-high. The eggs will hiss, sputter and the whites should puff and develop translucent bubbles. Once they’re very crispy and a deep golden brown underneath, 45 seconds to 1 minute, use a thin spatula to flip the eggs, trying not to break the yolks but not fretting if it happens. Cook for another minute on the second side, until the yolks are set but still slightly molten (aim to have them a little less loose than mine, shown above). Transfer eggs to paper towels; you can cook them up to 15 minutes before serving. Discard oil and wipe out wok or skillet.", 
            "Assemble salad: Place all salad ingredients in a large bowl. Quarter the eggs through the yolks and add them to the salad.", 
            "Make the dressing: Place the lime juice, palm syrup or dark brown sugar and water, fish sauce, garlic and chiles in the same wok or skillet. Set it over medium heat and heat the mixture until it just begins to sizzle at the edges, less than 30 seconds. ", 
            "Finish and serve: Pour the hot dressing over the salad and eggs. Stir gently to combine. If you’re feeling fancy, transfer the salad, liquid at all, to a plate in a low heap. Eat at once."
        ], 
        "date": "2015-01-22T12:04:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups frisée (French curly endive), torn into-bite size pieces (about 2 ounces)", 
            "1 bacon slice, preferably thick-cut", 
            "1 tablespoon minced shallot (from 1 small)", 
            "1 teaspoon smooth Dijon mustard", 
            "4 teaspoons red wine vinegar", 
            "Salt and freshly ground black pepper", 
            "1/4 cup crumbled blue cheese ", 
            "1 to 2 teaspoons unsalted butter, divided", 
            "2 large eggs", 
            "Salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/02/fried-egg-sandwich-with-bacon-and-blue-cheese.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Eggs", 
            "Photo", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2012/02/fried-egg-sandwich-with-bacon-and-blue-cheese/", 
        "title": "fried egg sandwich with bacon and blue cheese", 
        "directions": [
            "Split your rolls and put them in to toast.", 
            "Place frisée in a medium bowl. Cut bacon crosswise into 1/4-inch wide lardons. In a small heavy skillet, cook bacon over moderate heat, until pieces are crisp. With a slotted spoon, transfer bacon to paper towels, reserving bacon fat in pan. Add shallot to bacon fat and cook for one minute, stirring. Add red wine vinegar and let hiss and bubble for 20 to 30 seconds, then remove from heat and whisk in Dijon. Immediately pour hot dressing over frisée and toss with drained lardons, salt and pepper. Don’t try the salad just yet or you will be tempted to eat it just the way it is when, I promise, it’s even better with an egg on top.", 
            "Remove rolls from toaster and divide bacon-frisee salad between each bottom bun. You’ll want to heap on more than seems feasible or needed, especially once you realize how tasty it is. Top each salad pile with half (2 tablespoons) of the blue cheese.", 
            "Reheat skillet over medium-high heat. Add the butter and swirl it to coat the pan. Crack one egg into the skillet, season with salt and pepper and reduce heat to medium. I like to cover the skillet with a small lid at this point, as it seems to help the egg cook faster and more evenly. In one minute, you should have a perfect sunny-side-up egg. However, I find that for this sandwich, to somewhat rein in the mess, it helps to then flip the egg for 20 to 30 seconds, until the yolk is still runny, but less likely to run right off your sandwich.", 
            "Remove the egg from the pan and place it on top of the bacon-frisée salad on the bun. Repeat with remaining egg and come on, what are you waiting for? Dig in."
        ], 
        "date": "2012-02-27T17:54:54+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup peanut oil", 
            "2 tablespoons minced garlic", 
            "2 tablespoons minced ginger", 
            "Salt", 
            "2 cups thinly sliced leeks, white and light green parts only, rinsed and dried", 
            "4 cups day-old cooked rice; Vongerichten recommends jasmine (I used brown jasmine) but this is the perfect way to use up any leftover rice you have, especially from Chinese delivery", 
            "4 large eggs", 
            "2 teaspoons sesame oil (for some heat but the same awesome flavor, use hot sesame oil)", 
            "4 teaspoons soy sauce"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/02/ginger-fried-rice.jpg?w=752", 
        "tags": [
            "Budget", 
            "Chinese", 
            "Eggs", 
            "Grain/Rice", 
            "Leeks", 
            "Photo", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/02/ginger-fried-rice/", 
        "title": "ginger fried rice", 
        "directions": [
            "In a large skillet, heat 1/4 cup oil over medium heat. Add garlic and ginger and cook, stirring occasionally, until crisp and brown. With a slotted spoon, transfer to paper towels and salt lightly.", 
            "[It hadn’t been clear to me whether I was supposed to remove the old oil and bits of garlic I didn’t get out and wipe out the pan before proceeding. I didn’t. Everything worked out fine.] Reduce heat under skillet to medium-low and add 2 tablespoons oil and leeks. Cook about 10 minutes, stirring occasionally, until very tender but not browned. Season lightly with salt.", 
            "Raise heat to medium and add rice. Cook, stirring well, until heated through. [I cooked this slightly longer because I wanted my rice to pick up a little more color and crunch.] Season to taste with salt.", 
            "In a nonstick skillet (it just makes it easier) fry eggs in remaining oil, sunny-side-up, until edges are set but yolk is still runny.", 
            "Divide rice among four dishes. Top each with an egg and drizzle with 1/2 teaspoon sesame oil and 1 teaspoon soy sauce. Sprinkle crisped garlic and ginger over everything and serve. "
        ], 
        "date": "2010-02-05T16:38:39+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/08/2743288262_5d512b21c9_o.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Tips"
        ], 
        "url": "https://smittenkitchen.com/2008/08/how-to-poach-an-egg-smitten-kitchen-style/", 
        "title": "how to poach an egg, smitten kitchen-style", 
        "directions": [], 
        "date": "2008-08-08T17:04:18+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/huevos-rancheros1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Budget", 
            "Eggs", 
            "Photo", 
            "Quick", 
            "Tex-Mex", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/07/huevos-rancheros/", 
        "title": "huevos rancheros", 
        "directions": [], 
        "date": "2008-07-27T21:55:42+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup leeks in 1/2-inch thick slices, white and light green parts only, cleaned and rinsed", 
            "Kosher or coarse salt", 
            "2 tablespoons (1 ounce) unsalted butter", 
            "Freshly ground black pepper", 
            "6 cups 1-inch-cubed crustless brioche or Pullman loaf (I used a little less than one loaf)", 
            "2 teaspoons finely chopped chives (I forgot to buy these; it made me sad)", 
            "1/2 teaspoons fresh thyme leaves", 
            "1 large egg", 
            "1 large egg yolk", 
            "3 cups whole milk, heavy cream or half-and-half or a combination thereof", 
            "Freshly grated nutmeg", 
            "1/2 cup shredded Comté, Emmanthaler or Swiss cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/leek-bread-pudding1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Easter", 
            "Eggs", 
            "Leeks", 
            "Photo", 
            "Side Dish", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/04/leek-bread-pudding/", 
        "title": "leek bread pudding", 
        "directions": [
            "Place a medium sauté pan over medium-high heat, drain excess water from leeks, and add to pan. Season with salt, and sauté until leeks begin to soften, about 5 minutes, then reduce heat to medium-low. Stir in butter. Cover and cook, stirring occasionally, until leeks are very soft, about 20 minutes. Adjust salt and pepper to taste.", 
            "Preheat oven to 350 degrees. While leeks are cooking, spread bread cubes on a baking sheet and bake until dry and pale gold, about 15 to 20 minutes (my already-stale brioche took less time to brown), turning pan about halfway through. Transfer to a large bowl, leaving the oven on.", 
            "Add leeks, chives and thyme to the bowl of bread; toss well. In another large bowl, lightly whisk the egg and egg yolks, then whisk in milk or cream, a generous pinch of salt, pepper to taste and a pinch of nutmeg.", 
            "Sprinkle 2 tablespoons shredded cheese in bottom of a buttered 9-by-5-inch loaf pan. Spread 1/2 of bread mixture in pan, and sprinkle with another 2 tablespoons cheese. Spread remaining bread mixture in pan, and sprinkle with another 1/4 cup cheese. Pour in enough milk mixture to cover bread, and gently press on bread so milk soaks in. Let rest 15 minutes.", 
            "Add remaining milk mixture, letting some bread cubes protrude. Sprinkle with salt. Bake until pudding is set and top is brown and bubbling, about 55 to 65 minutes. Serve hot or cold (because I’m weird and enjoy bread pudding cold)."
        ], 
        "date": "2010-04-30T12:00:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon butter, plus more for greasing baking dish", 
            "6 medium-large leeks or 3 leeks and 2 small yellow onions, diced (just white and pale green parts from leeks; leeks washed well)", 
            "1 to 2 tablespoons olive oil", 
            "12 large eggs", 
            "3 1/3 cups milk, preferably whole", 
            "Salt and freshly ground black pepper", 
            "3/4 pound grated cheese (I use a mix of gruyere and comte)", 
            "10 ounces cooked ham, diced very small"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/leek-ham-and-cheese-egg-bake1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Gluten-Free", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/01/leek-ham-and-cheese-egg-bake/", 
        "title": "leek, ham and cheese egg bake", 
        "directions": [
            "Heat oven to 350 degrees F and butter a large (9×13-inch, 3-quart or more) baking dish.", 
            "Heat a large skillet over medium heat. Add 1 to 2 tablespoons olive oil and a tablespoon of butter. Once hot, add leeks (and onions, if using) and season generously with salt (I use a full teaspoon kosher salt) and pepper. Cook, stirring, until they’re tender, sweet and just starting to brown, about 10 to 15 minutes. Lower heat to medium-low if they’re picking up color too quickly. ", 
            "Beat eggs with salt (I used another teaspoon kosher salt, adjust to taste) and a lot of freshly ground black pepper. Whisk in milk. ", 
            "Assemble by layering in prepared dish: 1/3 of grated cheese, 1/2 of each leeks and ham, next 1/3 cheese, remaining leeks and ham. Pour eggs over then sprinkle remaining cheese over the top.", 
            "Bake until gently set in center, being careful about overbaking (see note up top). It’s done when no liquid egg seeps into the gap formed where a knife inserted into the center and turned or pulled back slightly or a temperature of 165 to 170 degrees. Start checking at 55 minutes and then every 5 minutes after that until it’s done. Mine took a total of 65 minutes. Should the top brown too much before the center is set, put foil over the baking dish for remaining baking time.", 
            "Let rest on a cooling rack for 5 to 10 minutes before serving, or risk a room full of burned tongues. (It packs serious heat!) Serve in squares or scoops."
        ], 
        "date": "2016-01-22T11:52:00+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large, round tomatoes or best available", 
            "2 garlic cloves, minced", 
            "1/2 white or Spanish onion, minced (Torres says the white onion is more commonly used in Mexico)", 
            "1 chipotle en adobo, from a can (I used half of one and thought it had a plenty-big kick, you can always start with a quarter and add more if desired)", 
            "Kosher or sea salt to taste", 
            "Migas", 
            "2 links Mexican or Spanish chorizo, removed from casing, diced or coarsely chopped", 
            "4 tablespoons oil (a mixture of corn and olive oil works best)", 
            "8 eggs, lightly beaten", 
            "20 corn tortilla chips, preferably fresh", 
            "Fresh cilantro for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/migas-with-tomato-chipotle-coulis1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Budget", 
            "Eggs", 
            "Photo", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2009/03/migas-with-tomato-chipotle-coulis/", 
        "title": "migas with tomato-chipotle coulis", 
        "directions": [
            "First, cook the chorizo. Heat a medium-sized stainless steel saucepan over medium-high heat and add two tablespoons of oil. Add the chorizo and cook, stirring frequently, until the chorizo is golden and cooked through, about ten minutes. Add the eggs and after a minute, the chips. Use a wooden spoon to crush the chips as you stir to cook the eggs. Cook for about five minutes (mine took less) or until almost cooked through.Remove from heat.", 
            "[Deb note: I’m a stickler about not overcooking/drying out scrambled eggs — blech — and always remove them from the heat while they still look a little damp; they continue cooking in their residual heat even once plated.]", 
            "Set up four plates for serving. Ladle some coulis in the bottom of each dish, top with some of the egg mixture and sprinkle with the cilantro. Serve immediately."
        ], 
        "date": "2009-03-11T14:26:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup yellow onion, diced", 
            "3 tablespoons butter", 
            "1 pound cremini mushrooms, thinly sliced", 
            "1/2 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground pepper", 
            "1 teaspoon flour", 
            "1/2 cup (4 ounces) milk", 
            "1/2 cup mild white cheese, mozzarella or provolone, shredded", 
            "Savory crêpes, recipe follows", 
            "2 tablespoons chives, thinly sliced (I skipped this, didn’t have them on hand)", 
            "1/4 cup Parmesan, shredded", 
            "2 large eggs", 
            "3/4 cup milk", 
            "1/2 cup water", 
            "1 cup flour", 
            "3 tablespoons butter, melted", 
            "1/2 teaspoon salt", 
            "Butter, for coating the pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-crepe-cake1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/05/mushroom-crepe-cake/", 
        "title": "mushroom crêpe cake", 
        "directions": [
            "In a blender combine all of the ingredients (excepting the butter for coating the pan) and pulse for 10 seconds. (Too lazy to bust out a blender, I mixed the flour and salt and slowly whisked in a mixture of the eggs, milk, water and butter.) Place the crepe batter in the refrigerator for one hour, or up to 48 hours.", 
            "Heat a small non-stick pan. Add butter to coat. Pour a couple tablespoons of batter into the center of the pan and swirl to spread evenly. Cook for 30 seconds and flip. Cook for another 10 seconds and throw the crepe in the garbage; seriously, the first one is always cursed. Sometimes the second too. By the time you get to the third one, go ahead and keep what you made, even if it’s not perfect. Lay the crêpe flat on a large cutting board to the cutting board to cool; continue cooking until all of the batter is gone.", 
            "Do ahead: Crêpe batter can be made up to two days in advance, stored in the fridge. Cooked, cooled and well-wrapped, crêpes can be stored for several days in the fridge or up to two months in the freezer. Frozen crêpes can be thawed on a rack; gently peel them as you need. Filling can be made a day in advance; reheat slowly, over a low flame. I made my crêpes in advance, and the filling in the morning; it doesn’t take much time (and even less if you clean and slice your mushrooms the night before)."
        ], 
        "date": "2010-05-11T11:04:07+00:00"
    }, 
    {
        "ingredient_list": [
            "5 ounces tomato juice", 
            "1 1/2 ounces vodka", 
            "Juice of 2 lime wedges", 
            "1/2 teaspoon finely grated", 
            "fresh horseradish", 
            "2 or 3 dashes of Worcestershire sauce", 
            "3 or 4 drops of Tabasco sauce", 
            "Pinch of salt", 
            "Pinch of celery salt", 
            "Small pinch of cayenne pepper", 
            "Ice ", 
            "10 oz baby spinach leaves", 
            "1/4 cup finely chopped onion", 
            "1 garlic clove, finely chopped", 
            "2 tablespoons unsalted butter", 
            "5 oz mushrooms, thinly sliced (2 cups)", 
            "1/3 cup heavy cream", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "1/8 teaspoon freshly grated nutmeg", 
            "4 large eggs", 
            "2 tablespoons finely grated parmesan", 
            "3 cups all purpose flour", 
            "1 teaspoon sugar (originally recipe calls for 2 tablespoons)", 
            "4 teaspoons baking powder", 
            "1 teaspoon salt", 
            "1 teaspoon baking soda", 
            "3/4 cup (1 1/2sticks) chilled unsalted butter, cut into 1/4-inch pieces", 
            "1/4 cup minced fresh chives", 
            "1 cup buttermilk "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/my-bacon-is-always-crisp1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Drinks", 
            "Eggs", 
            "Mushrooms", 
            "Photo", 
            "Scones/Biscuits", 
            "Spinach"
        ], 
        "url": "https://smittenkitchen.com/2007/05/my-bacon-is-always-crisp/", 
        "title": "baked eggs + chive biscuits + bloody marys", 
        "directions": [
            "Preheat oven to 425°F. Whisk flour, sugar, baking powder, salt and baking soda in large bowl to blend. Using fingertips, rub 3/4 cup chilled butter into dry ingredients until mixture resembles coarse meal. Stir in chives. Add buttermilk and stir until evenly moistened. Using 1/4 cup dough for each biscuit, drop biscuits onto baking sheet, spacing 2 inches apart.* Bake until biscuits are golden brown on top, about 15 minutes. Cool slightly. Serve warm. ", 
            "* I’m a sucker for the round, bumpy-edged biscuit shape so I rolled it out on well-floured counter and cut them with a 3″ biscuit-cutter. Take care to handle the dough as little as humanly possible, so not to warm or soften it too much. "
        ], 
        "date": "2007-05-13T20:49:56+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/potato-and-artichoke-tortilla1.jpg?w=500", 
        "tags": [
            "Budget", 
            "Eggs", 
            "Photo", 
            "Potatoes", 
            "Spanish"
        ], 
        "url": "https://smittenkitchen.com/2009/01/potato-and-artichoke-tortilla/", 
        "title": "potato and artichoke tortilla", 
        "directions": [
            "1. Heat 2 tablespoons of the olive oil in a medium-sized skillet over medium heat. Add the onion and cook until limp but not brown, 3 to 5 minutes. Add the potato and cook, stirring gently, for 5 minutes. Stir in the artichokes and peppers and cook, stirring, for another 2 to 3 minutes. Using a slotted spoon, transfer the vegetable mixture to a bowl and let cool completely.", 
            "2. Place the eggs, chicken stock, and a few small pinches of salt in a medium-sized bowl and beat until just scrambled. Add the potato mixture and mix until well combined. Let stand for about 10 minutes.", 
            "3. Heat 5 teaspoons of the reserved olive oil in a heavy 8-inch skillet, preferably nonstick, over medium-high heat until it is just beginning to smoke. Pour the egg mixture into the skillet and flatten the potatoes with a spatula until the top is fairly even. Reduce the heat to medium-low. Cook, moving and shaking the skillet, running a thin spatula around the edge and sliding it into the middle so that some of the egg runs under for about one minute, then let it cook undisturbed until the top is a little wet but not liquid, 6 to 8 minutes. ", 
            "4. Run the thin spatula under the tortilla to make sure that no part of the bottom is stuck to the skillet. Top the skillet with a rimless plate slightly larger than the skillet and, using oven mitts, quickly invert the tortilla onto the plate. If the skillet looks dry, add a little more olive oil. Carefully slide the tortilla back into the skillet, uncooked side down. Shake the skillet to straighten the tortilla and push the edges in with the spatula. Reduce the heat to very low and cook the tortilla until a toothpick inserted in the center comes out dry, 3 to 4 minutes. Invert the tortilla again, as before, to cook on the first side for another minute.", 
            "5. Invert the tortilla onto a serving plate and pat the top with a paper towel to get rid of excess oil. Let it cool a little, then cut the tortilla into wedges and serve warm or at room temperature. To serve as a tapa, cut the tortilla into squares and serve with toothpicks."
        ], 
        "date": "2009-01-03T13:24:14+00:00"
    }, 
    {
        "ingredient_list": [
            "8 to 10 small waxy potatoes (about 1 ounce each), scrubbed and quartered", 
            "1 cup vegetable or another broth; just use salted water if you don’t have it around", 
            "1/4 cup olive oil", 
            "8 ounces (usually 1 bundle) broccolini, trimmed and halved lengthwise or chopped into 1-inch pieces", 
            "1 small red or white onion, thinly sliced", 
            "8 large eggs", 
            "1 cup (about 3 to 3 1/2 ouncesgrated Parmesan cheese", 
            "Salt and freshly ground black pepper, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/potato-and-broccolini-frittata1.jpg?w=640", 
        "tags": [
            "Broccoli", 
            "Brunch", 
            "Eggs", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Potatoes", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/10/potato-and-broccolini-frittata/", 
        "title": "potato and broccolini frittata", 
        "directions": [
            "Place the potatoes and broth in a large, ovenproof frying pan, ideally one that is 12 inches. Bring to a boil and simmer for 10 minutes, turning the potatoes often, until almost all of the stock has been absorbed and the potatoes are tender. ", 
            "Add olive oil, broccolini and onion to the potatoes in the frying pan and cook over medium heat for 1 minute, turning frequently, just to get everything coated with oil, Then, reduce the heat to medium-low and cover the pan, cooking for 3 to 4 more minutes, or until the broccolini has become mostly tender.", 
            "Heat your broiler.", 
            "Beat eggs with half the parmesan, salt and pepper, and pour it over the vegetables in the frying pan. Cover and cook over medium (or medium-low, if yours seems to be browning too quickly) until the eggs are mostly, set. Sprinkle remaining parmesan over frittata and run the whole pan under the broiler, until the top is bronzed and the eggs are just set throughout, approximately 5 minutes, but this could vary due to how robust your broiler is (mine is terrible; it took longer).", 
            "Let cool slightly before slicing into wedges or squares."
        ], 
        "date": "2013-10-28T12:08:52+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds fingerlings, or small red or yukon gold potatoes", 
            "4 large eggs", 
            "1/4 pound frisee (French curly endive) or another sturdy lettuce", 
            "6 ounces slab bacon or thick-cut bacon slices", 
            "2 tablespoons finely chopped shallot", 
            "3 tablespoons red wine vinegar", 
            "1/2 teaspoon smooth Dijon mustard", 
            "2 ounces crumbled blue cheese, or more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/potatoes-with-soft-eggs-and-warm-bacon-vinaigrette1.jpg?w=750", 
        "tags": [
            "Brunch", 
            "Budget", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2015/03/potatoes-with-soft-eggs-and-bacon-vinaigrette/", 
        "title": "potatoes with soft eggs and bacon vinaigrette", 
        "directions": [
            "Cook potatoes: In a large saucepan, cover potatoes with cold water, set a timer for 25 minutes (for small red or gold potatoes), and bring to a boil. Once boiling, reduce to a simmer. Cook until tender but not falling apart, which for small red potatoes usually takes me 25 minutes (fingerlings, because they’re thinner, might be worth checking at 20). Drain and when cool enough to touch, but still hot, halve lengthwise and arrange cut side up on a platter.", 
            "Meanwhile, cook eggs: Bring medium saucepan of water to a boil. Lower eggs into it and boil for five (for a runnier egg) to six (for a less-runny but still loose egg) minutes. Drain and rinse egg briefly under cool water until cool enough to handle and carefully peel — because the egg inside is so soft, I recommend chipping off smaller pieces at a time and running it under water as needed so you don’t accidentally rip it open. Set aside. ", 
            "Prep salad: Tear frisee into bite-size pieces and put in a large bowl. ", 
            "Right before you’re ready to serve everything, make vinaigrette: If using slab bacon, cut lengthwise into 1/4-inch thick slices, then 1/4-inch thick sticks (lardons); if using bacon slices, just cut them crosswise into 1/4-inch lardons. Cook bacon in a heavy skillet over moderate heat, until bacon is 3/4 as crisp as you’d like it to get. Add shallots, and cook for 1 minute more. Whisk in red wine vinegar and Dijon and let simmer for 10 seconds. Immediately pour 3/4 hot dressing over potatoes and last 1/4 over frisee in bowl, tossing the lettuce to combine evenly. Season both with salt and pepper. ", 
            "To finish: Top dressed potatoes with peeled eggs and use a knife to cut them into quarters, so they break open over the potatoes. Season cut eggs with salt and pepper again, sprinkle potato dish with blue cheese. Serve with frisee on the side or on top.", 
            "Note: I’ve made this a few times (can you blame me?) and sometimes I got a lot of “renderings” from the bacon and had more than enough dressing for the potatoes and side bowl of lettuce and a couple times it felt a little scant. If you don’t feel like you have enough dressing to stretch over the potatoes and lettuce, just cover the potatoes well. The lettuce can be always be lightly dressed with a splash of olive oil, teaspoon of red wine vinegar plus the salt and pepper."
        ], 
        "date": "2015-03-16T12:00:58+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pint (2 cups) fresh raspberries (or your choice of berry)", 
            "1 pint (2 cups) sour cream (or crème fraîche)", 
            "1 cup dark brown sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/raspberry-brown-sugar-gratin1.jpg?w=500", 
        "tags": [
            "Fruit", 
            "Gluten-Free", 
            "Photo", 
            "Raspberries", 
            "Russian", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/07/raspberry-brown-sugar-gratin/", 
        "title": "raspberry brown sugar gratin", 
        "directions": [
            "Preheat broiler. Gently fold raspberries and sour cream together in a shallow 1-quart dish. Press the brown sugar through a sieve or mesh colander so that it sprinkles evenly over the dish. (I tried using a sifter; don’t bother, it doesn’t work.) Run the dish under the broiler until the sugar just starts to caramelize. Eat at once.", 
            "Keeping: The leftovers might look like something died in your fridge but I can assure you, are equally delicious. "
        ], 
        "date": "2010-07-21T10:26:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (170 grams) honey", 
            "1/2 cup (100 grams) sugar", 
            "1/2 cup (115 grams) unsalted butter", 
            "1 teaspoon baking soda", 
            "3 large eggs", 
            "1/4 teaspoon fine sea or table salt", 
            "1 teaspoon (5 ml) vanilla extract", 
            "3 1/2 cups (455 grams) all-purpose flour, divided", 
            "32 ounces (just shy of 4 cups or 900 grams) sour cream", 
            "1 14-ounce can (400 grams) sweetened condensed milk"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/russian-honey-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Photo", 
            "Russian"
        ], 
        "url": "https://smittenkitchen.com/2016/10/russian-honey-cake/", 
        "title": "russian honey cake", 
        "directions": [
            "The day before, get ready: Heat oven to 350 degrees F. Get 2 baking sheets (or even better, round pizza pans) down, more if you have them. Tear off 6 sheets of parchment paper large enough to have a 9-inch circle on it.\nMake cookie/cake dough: In a medium-sized saucepan, combine the sugar, honey and butter over medium heat. Once simmering, cook for 3 to 4 minutes (no specific temperature needed), it should get a faint shade darker and smell wonderful. Whisk in baking soda.\nRemove from heat and set aside for 2 to 3 minutes. It’s not going to significantly cool off, just settle a little. Lightly beat your eggs in a spouted measuring cup (for easiest pouring) or small bowl. Take a deep breath. Whisking the honey mixture vigorously in the pot the whole time, drizzle the thinnest stream (think: 1/2 teaspoon at a time, that slowly) of the eggs into the honey mixture. Do not stop mixing. Continue until all of the eggs are thoroughly whisked in.\nStir in the salt and vanilla and 3 cups (390 grams) of the flour with a spoon. The dough is going to be thick like a bread but you’ve got this. Stir in the last 1/2 cup of flour 1/4 cup at a time; you’ll get a bonus arm workout.\nShape and bake the cookies/cakes: [Plus, a bunch more layer tips at the end.] Lightly flour your counter and divide the still-warm dough into 8 even pieces. Roll the first one between two sheets of parchment paper (no flouring needed) to a slightly-bigger-than-9-inch round. Remove top sheet of parchment paper. Very lightly dust the top with flour if you’re going to put something on it (such as the bottom of a 9-inch cake pan or the rim of a 9-inch bowl) to trim the shape to an even 9-inch circle. Save the trimmings — put them aside on one of the sheets of parchment paper, it’s fine if they overlap a little. Dock the circle all over with a fork. Slide your 9-inch round onto a baking sheet and bake for 6 to 7 minutes; it should feel firmish and get slightly darker at the edges. Slide the cookie onto a cooling rack. Go ahead and reuse the parchment for another layer.\nMeanwhile, while the first layer is baking, roll out your second piece so it’s ready to go into the oven as soon as the first comes out. If you’re making good time, get the third ready too and continue to bake them two at a time. Keep adding the unbaked cookie trimmings onto one piece of parchment paper. Repeat this process as you bake each round and you’ll have all 8 baked before you know it.\nFinally, take that last sheet of parchment with all of the cookie scraps on it and slide it onto a baking sheet and bake it, checking in at 4 minutes, because the thinnest scraps will want to burn quickly. By 5 minutes, all should be baked until pale golden. Let cool completely and save until you’re ready to decorate the cake tomorrow.\nFill and frost the cake: Whisk sour cream and sweetened condensed milk together in a large bowl. Once cookies are cool, place a dab of the sour cream mixture on your cake plate and place the first cookie on top of it to help adhere it.\nCut or tear one of your used pieces of parchment paper into strips and tuck them all around the underside of the cake to protect your cake plate. Trust me, if you do not do this, you will regret it.\nScoop 3/4 cup sour cream mixture onto the center of your first cookie layer. Spread it only a little from the center, leaving a good 1- to 2-inch margin of unfrosted cookie. Stack the second cookie on top and repeat until you have 8 layers.\nThis will quickly become a huge mess. The sour cream is going to spill out and down the sides anyway (hear hear for those paper strips) and you’re going to start yelling at me/drafting an angry comment in your head. It’s also going to want to slide around and not stay neatly stacked. It’s totally okay because the filling will thicken as it absorbs into the cookies. Put the cake in the fridge for a couple hours (1 to 3) and when you come back to it, nudge the stack gently back into place and use a spoon and icing spatula to scoop the spilled-out filling back up the sides and onto the top of the cake. Don’t worry about it looking neat. Let it chill overnight.\nThe next day, finish the cake: Grind your baked, reserved cookie scraps in a blender or food processor, or bash them into crumbs in a bag with a rolling pin.\nTake your cake out and do one final frosting clean-up. Spread any newly puddled sour cream back up the sides and across the top. If you’d like to make a decoration on top of your cake, take one of those used pieces of parchment paper (see how much Deb hates wasting parchment) and cut a stencil with it. Place it gently on top of the cake.\nUse a small spoon to sprinkle the top and sides of the cake with the crumbs. In the coolest trick I saw on a cooking video, use a pastry brush (or extremely clean paintbrush, I won’t tell) to gently brush the crumbs off the stencil and across the cake in a thin layer. It sounds crazy but it works — on the sides too. Remove the stencil and parchment paper strips and look at that clean serving plate! (Bravo, you.)\nYou can serve the cake right away, or keep it in the fridge for up to 5 days. When slicing, I found that a knife dipped in hot water made picture-perfect cuts.\nA bunch of extra dough and cake layer tips:The dough is a bit stiff, but it will stretch to the size you need with pressure. If you’re finding it to be a huge pain, that the dough clearly wants to go to 8 inches but not 9, just go ahead and make the cake 8 inches round. It will be just as good of a cake; the layers might need a single extra minute to bake.Ovens will vary, especially for such thin cookies, so keep an eye on the first round as of the 6-minute mark, checking in each minute after as it can brown very quickly, and then you’ll know how much time you need for the remaining ones.This dough is easiest to roll/softest when it’s still a little warm; if yours has cooled quickly, I found that you could put each piece in the microwave for 5 to 7 seconds (only!) to get it a touch warmer again, without prematurely baking the cookie.Go ahead and save all of those used pieces of parchment paper for the next step and beyond. We’re going to use them again."
        ], 
        "date": "2016-10-07T11:53:24+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "2 tablespoons milk, half-and-half or cream", 
            "1/8 teaspoon salt", 
            "Few grinds black pepper", 
            "2 teaspoons butter or olive oil", 
            "A 1-inch thick piece of bread", 
            "1 tablespoon goat cheese, softened a bit (though cream cheese is a great swap here)", 
            "1 teaspoon chives or scallion greens, thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/scrambled-egg-toast.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Eggs", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2010/05/scrambled-egg-toast/", 
        "title": "scrambled egg toast", 
        "directions": [
            "Set your table and pour your coffee. I am an absolutely nut about eating my eggs the second they come out of the pan, and to do this, your table needs to be ready for you; your troops should be gathered. Toast your bread, then smear it with the goat cheese and sprinkle it with half the chives. Set it aside. (P.S. If you decide to butter it before adding the goat cheese, I will not tell anyone.)", 
            "Beat eggs with milk, salt and pepper in a small bowl, with a fork, until combined, with a few big bubbles. Heat a large sauté pan over medium-low heat; once hot, add butter. Once butter is melted and foamy, add eggs and pause; count to 20 if you must, but let those eggs begin to set up before you start nudging away at them. Using a wooden spoon or spatula, begin push your eggs once from the outside to the center of the pan and pause again; count to 5 if you must, before continuing with another push. Continue in this manner around the pan as if you were trying draw spokes of a wheel through your eggs with your spatula, pausing for 5 seconds after each push. Go around the pan as many times as needed, until your eggs in the center are ribbony damp pile — it should look only 75 percent cooked. Use your spoon or spatula to break up this pile into smaller chunks — to taste. Your eggs should now look almost 90 percent cooked.", 
            "Immediately remove the pan from the heat and pile the scrambled eggs bits high on your goat cheese toast. Sprinkle with an additional grind of black pepper and remaining chives. Eat immediately."
        ], 
        "date": "2010-05-24T11:18:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup olive oil", 
            "5 Anaheim chiles or 3 jalape&#241os, stemmed, seeded, and finely chopped (I was nervous and only used 2 Anaheims; I would go for 3 or 4 next time for a more moderate but still gentle kick)", 
            "1 small yellow onion, chopped", 
            "5 cloves garlic, crushed then sliced", 
            "1 teaspoon ground cumin", 
            "1 tablespoon paprika", 
            "1 28-ounce can whole peeled tomatoes, undrained", 
            "Kosher salt, to taste", 
            "6 eggs", 
            "1/2 cup feta cheese, crumbled", 
            "1 tablespoon chopped flat-leaf parsley", 
            "Warm pitas, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/shakshuka.jpg?w=752", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Budget", 
            "Eggs", 
            "Israeli", 
            "North African", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/04/shakshuka/", 
        "title": "shakshuka", 
        "directions": [
            "Heat oil in a 12-inch skillet over medium-high heat. Add chiles and onions and cook, stirring occasionally, until soft and golden brown, about 6 minutes. Add garlic, cumin, and paprika, and cook, stirring frequently, until garlic is soft, about 2 more minutes.", 
            "Put tomatoes and their liquid into a medium bowl and crush with your hands. Add crushed tomatoes and their liquid to skillet along with 1/2 cup water, reduce heat to medium, and simmer, stirring occasionally, until thickened slightly, about 15 minutes. Season sauce with salt.", 
            "Crack eggs over sauce so that eggs are evenly distributed across sauce’s surface. Cover skillet and cook until yolks are just set, about 5 minutes. Using a spoon, baste the whites of the eggs with tomato mixture, being careful not to disturb the yolk. Sprinkle shakshuka with feta and parsley and serve with pitas, for dipping."
        ], 
        "date": "2010-04-08T22:24:26+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound asparagus, cleaned, not trimmed", 
            "2 ounces thinly sliced proscuitto (optional, see Note up top)", 
            "8 large eggs", 
            "2 tablespoons milk or cream", 
            "1/2 teaspoon kosher salt, plus more to taste", 
            "Freshly ground black pepper", 
            "2 scallions, thinly sliced on the diagonal", 
            "2 tablespoons olive oil", 
            "2 to 4 ounces soft goat cheese, crumbled (to taste)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/shaved-asparagus-frittata1.jpg?w=640", 
        "tags": [
            "Asparagus", 
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Spring", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/04/shaved-asparagus-frittata/", 
        "title": "shaved asparagus frittata", 
        "directions": [
            "Prepare the asparagus: No need to snap off the tough ends of your asparagus. Lay a single stalk on its side on a cutting board. Holding onto the tough end, use a vegetable peeler to peel ribbons away from the tough end (and your hand) right through the soft tip. Discard the tough ends once you’re done peeling. ", 
            "[As you get to the bottom of your stalk, you might find that the raised edge of your peeler is keeping the blade from shaving the asparagus as thin as you’d like. For this, I move the asparagus to the edge of the cutting board with the peeler blade half-off so you can get closer. Just be careful not to shave your cutting board. :) ]", 
            "Crisp the proscuitto: If you’re using the proscuitto, heat the 12-inch ovenproof skillet you’ll use for the final frittata over medium heat. Lay slices in a single layer (will need to do this in two batches) and cook them until lightly brown underneath and curling. Flip them for another 20 to 30 seconds then transfer them to paper towels to blot off the extra oil and cool. Repeat with remaining proscuitto. You’ll use the pan again in a minute.", 
            "Heat your broiler.", 
            "Vigorously beat your eggs with the milk or cream, plus salt and pepper until well-combined. Stir in scallions and crumble in crisp proscuitto, if using. Gently add asparagus peels, just swishing the egg mixture over them. ", 
            "Heat your skillet over medium heat and add 2 tablespoons olive oil. Let it heat fully, then swish it around so it goes up the sides of the pan. Pour in asparagus and egg mixture, nudging the asparagus around so it mostly stays level with the eggs. Crumble goat cheese over, to taste. Cook gently (lowering the heat to medium-low if needed) for about 5 minutes, until the edges are set and brown but it’s still loose and eggy on top. Transfer skillet to the broiler and cook for another 1 to 3 minutes, keeping a close eye on it, until eggs are set on top. ", 
            "Let cool for 5 minutes before cutting into wedges, or longer if you’d like to eat it at room temperature."
        ], 
        "date": "2016-04-27T11:32:21+00:00"
    }, 
    {
        "ingredient_list": [
            "16 sourdough toast fingers (mine were from 1/2-inch thick slices, cut into 1/2-inch batons)", 
            "4 tablespoons (2 ounces) unsalted butter, melted", 
            "1 teaspoon smooth Dijon mustard", 
            "Salt", 
            "Freshly ground black pepper", 
            "1/3 cup finely grated gruyère cheese (about 1 1/2 ounces)", 
            "2 tablespoons finely grated Romano cheese", 
            "1 tablespoon finely chopped flat-leaf parsley", 
            "1 teaspoon finely chopped fresh thyme leaves (optional)", 
            "4 large eggs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/soft-eggs-with-buttery-herb-gruyere-toasts1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Eggs", 
            "Photo", 
            "Put An Egg On It"
        ], 
        "url": "https://smittenkitchen.com/2012/03/soft-eggs-with-buttery-herb-gruyere-toasts/", 
        "title": "soft eggs with buttery herb-gruyere toasts", 
        "directions": [
            "Make croutons: Preheat oven to 400°F. Place bread cubes in shallow, wide bowl. Whisk together butter and Dijon, then pour over bread fingers. Sprinkle with salt, pepper, both types of cheese, parsley and thyme, if using. Toss to coat. Spray rimmed baking sheet with nonstick spray. Scatter bread on sheet. Bake croutons until crisp and golden, turning, about 20 minutes. Set aside. ", 
            "Meanwhile, cook eggs: Bring a medium pot of water to a steady boil. Add eggs and cook them for exactly six minutes, maintaining the heat at a simmer, then drain and rinse them briefly in cold water. ", 
            "Holding the egg vertically, pointier side down, with a towel or paper towel to protect you from its heat, tap a knife around the “neck,” about half an inch below the top so that you can remove a little “lid” area. Place the egg in a small dish, opened side up, and serve with a small spoon and toast soldiers.", 
            "Don’t have adorable chicken or other tiny egg cups and spoons? With a little patience, you can peel the soft-boiled eggs as you would a hard-boiled one. It’s tricky, because they are liquid in the center, but doable. For this method, arrange four of your croutons on a small plate. Place the peeled egg over the croutons and smash it lightly, delightfully (if you don’t find this to be really fun, I am not sure we can be friends) with a fork. Season with salt and pepper and eat with a fork and knife."
        ], 
        "date": "2012-03-24T12:59:57+00:00"
    }, 
    {
        "ingredient_list": [
            "", 
            "\t\t", 
            "\t", 
            "\t\tSeveral years ago, because we didn’t have a kid yet, didn’t know about things like school break schedules and figured midway through February was as good of a time to escape the snow as any, we decided to get away to someplace warm and winter-free during Presidents’ Day week. We found ourselves smack dab in the middle of a beach resort that had to have easily been 75% children, and the kind that were at that time my worst nightmare of what kids could be [insert yours here, then multiply it as far as you can see] and we decided to both never have kids and never ever go away on Presidents’ Week again.", 
            "", 
            "", 
            "", 
            "Flash forward seven or so years and last week we went to probably one of the most kid-centric, kid-mobbed resorts* one can go to on the most kid-centric and kid-mobbed week of the year and it was the best thing, ever. Previous to last week, I wouldn’t say we’ve exactly mastered the art of family vacations. Sure, we always have fun together but it often either feels like we’re either someplace exciting for adults but less so for little kid, or someplace awesome for a little kid but it feels more like this for the adults. This may not be for everyone, but at least for now, the resolution turned out to be a place where us grownups could lay on the beach, reading books, napping, and being total slackers for most of the day while the kid attended a day camp with everything from pony rides to water slides, trapeze school and circus training and also a pirate-themed treasure hunt for … underwear which if you’ve ever been around 4 and 5 year-olds, know was the greatest. We’d retrieve our kid, sticky with ice cream, chocolate pastries and sugar cereals from his mid-afternoon goûter and then play on the beach or in the pool for a couple hours before dinner, stories, bed and everybody won. Everyone had an awesome vacation. Thank goodness we’re not doing anything in the coming months that would upset the chances of repeating this bliss next year!", 
            "", 
            "", 
            "Alas, the fridge didn’t fill itself while we were away (technology, can you get on that?) and we pretty much had a family lazy-off yesterday, in which we tried to see how long we could go on pre-vacation remains before one of us caved and went to the store. It turned out — you know, along with some Sunday night soup dumplings — all day, if you can scrounge a few staples together. Before vacation, when I was deep in my 2nd Trimester Carb Immersion Plan, I fell in love on sight alone with a dish called Rhonda’s Spaghetti with Fried Eggs with Pangritata for One on Food52. I mean, how could I not, as it basically contained all of my trigger foods: pasta, bread and my ongoing obsession that I find as many excuses as I can to work into dishes, the crispy egg.  ", 
            "", 
            "Pangrattato translates from Italian as grated bread, referring to breadcrumbs themselves, but in dishes, it’s often known to as the poor man’s Parmesan because when you take that stale bread and lightly toast in in olive oil, herbs and seasonings — anything from just salt and pepper to garlic and anchovies, lemon zest and capers or olives — it adds remarkable texture and complex flavor to pasta without the expense of Parmesan. These crumbs it would be equally welcome to as a topping for canned fish, steamed mussels, warm vegetable salads, sautéed greens, or even on eggs without the pasta. We loved the crunch throughout our tangles of al dente lunchtime spaghetti, and the fried egg broken up on top, a nod to Rhonda’s version, adds a gorgeous richness that, well… I’ll be repeating in about one hour. ", 
            "", 
            "* as always on this site, this is not a sponsored or paid post, vacation, opinion, etc. all costs of vacation absorbed by author, with a grimace ", 
            "One year ago: Dijon and Cognac Beef Stew", 
            "Two years ago: French Onion Tart", 
            "Three years ago: Fried Egg Sandwich with Bacon and Blue Cheese", 
            "Four years ago: Spaghetti with Lemon and Olive Oil", 
            "Five years ago: Monkey Bread with Cream Cheese Glaze and Cauliflower and Caramelized Onion Tart", 
            "Six years ago: Red Kidney Bean Curry and Thick Chewy Oatmeal Raisin Cookies", 
            "Seven years ago: Pear and Almond Tart", 
            "Eight years ago: Vegetable Dumplings", 
            "And for the other side of the world:", 
            "Six Months Ago: Strawberries and Cream with Graham Crumbles", 
            "1.5 Years Ago: Almond-Crisped Peaches", 
            "2.5 Years Ago: Mediterranean Baked Feta with Tomatoes", 
            "3.5 Years Ago: Zucchini Fritters", 
            "\t", 
            "", 
            "\t", 
            " ", 
            "Spaghetti Pangrattato with Crispy Eggs", 
            "Adapted from and inspired by Rhonda’s Spaghetti with Fried Eggs with Pangritata for One on Food52", 
            "This is a big green salad and maybe a few slices of proscuitto (if you’re into such things) away from being a perfect mid-winter weeknight meal, budget-friendly, quick to make, vegetarian and, with luck, from ingredients you already have around. And if you don’t, nobody is going to know if you skip the parsley or try sage or thyme instead of rosemary. There is no one correct way to make pangrattato, only the way you like it. I couldn’t resist adding a little Pecorino here anyway, but you’d be fine without it if you’d like to keep the dish dairy-free. ", 
            "Serves 2, in generous heaps, or 3, petitely", 
            "Crumbs", 
            "2 tablespoon olive oil", 
            "1 large or 2 small garlic cloves, minced", 
            "1/2 cup fresh or stale coarse plain breadcrumbs (panko worked great here)", 
            "Salt and red pepper flakes, to taste", 
            "1 teaspoon fresh rosemary, minced", 
            "Few fine gratings fresh lemon zest ", 
            "Crispy Egg", 
            "1 glug of olive oil per egg", 
            "3 eggs", 
            "Salt and pepper", 
            "Pasta and Assembly", 
            "8 ounces dried spaghetti", 
            "1 tablespoon olive oil", 
            "2 teaspoons small capers, drained (rinsed if salted), chopped", 
            "Handful flat-leaf parsley, chopped", 
            "1/3 cup grated Pecorino Romano cheese (optional)", 
            "Make crispy crumbs (pangrattato): Heat olive oil in a medium skillet over medium heat. Once hot, add garlic and let sizzle for barely a minute, just until it begins to turn a pale golden color. Add breadcrumbs, salt, pepper, rosemary and lemon zest and reduce heat to low, cooking mixture slowly until all of the crumbs are an even golden color, about 5 minutes. Set aside. ", 
            "Cook pasta: Bring a large pot of well salted water to a generous boil and cook pasta until al dente about 1 to 2 minutes shy of package directions. Reserve 1/2 cup pasta cooking water before draining pasta. ", 
            "Meanwhile, make crispy eggs: Wipe out breadcrumbs skillet. Return to stove over high heat and add a generous glug of olive oil per egg. Once hot enough that the oil begins to smoke, add egg(s). They’re going to hiss and splatter so step back as soon as you do. Spoon some of the cooking oil over the eggs, carefully. Season with salt and pepper. In 1 to 2 minutes, the egg(s) will be brown and very crisp underneath and around the edges. Shimmy a thin spatula underneath the egg(s) (a flexible fish spatula works great here), being careful not to break the yolk. If you’re cooking for someone who shouldn’t be eating runny yolks (ahem), you can flip the egg over and cook it for another 30 seconds or so before removing it. Transfer cooked egg(s) to paper towels to drain. ", 
            "Assemble dish: Once pasta is drained, return it to the empty pot or a large skillet with 1 tablespoon olive oil and a splash or two (or all, if needed to loosen pasta) of reserved cooking water. Over high heat, toss with capers and parsley for 1 minute. Divide among bowls or plates. Sprinkle with Pecorino, if using, then 1/3 of breadcrumb (pangrattato) mixture. Place an egg over each dish, and break up with a fork. Eat immediately.", 
            "Rate this:Do More:TwitterFacebookPinterestPrintEmail\t\t\t", 
            "Crumbs", 
            "2 tablespoon olive oil", 
            "1 large or 2 small garlic cloves, minced", 
            "1/2 cup fresh or stale coarse plain breadcrumbs (panko worked great here)", 
            "Salt and red pepper flakes, to taste", 
            "1 teaspoon fresh rosemary, minced", 
            "Few fine gratings fresh lemon zest ", 
            "Crispy Egg", 
            "1 glug of olive oil per egg", 
            "3 eggs", 
            "Salt and pepper", 
            "Pasta and Assembly", 
            "8 ounces dried spaghetti", 
            "1 tablespoon olive oil", 
            "2 teaspoons small capers, drained (rinsed if salted), chopped", 
            "Handful flat-leaf parsley, chopped", 
            "1/3 cup grated Pecorino Romano cheese (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/spaghetti-pangrattato-with-fried-eggs1.jpg?w=750", 
        "tags": [
            "Budget", 
            "Eggs", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Put An Egg On It", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/02/spaghetti-pangrattato-with-fried-eggs/", 
        "title": "spaghetti pangrattato with crispy eggs", 
        "directions": [
            "Make crispy crumbs (pangrattato): Heat olive oil in a medium skillet over medium heat. Once hot, add garlic and let sizzle for barely a minute, just until it begins to turn a pale golden color. Add breadcrumbs, salt, pepper, rosemary and lemon zest and reduce heat to low, cooking mixture slowly until all of the crumbs are an even golden color, about 5 minutes. Set aside. ", 
            "Cook pasta: Bring a large pot of well salted water to a generous boil and cook pasta until al dente about 1 to 2 minutes shy of package directions. Reserve 1/2 cup pasta cooking water before draining pasta. ", 
            "Meanwhile, make crispy eggs: Wipe out breadcrumbs skillet. Return to stove over high heat and add a generous glug of olive oil per egg. Once hot enough that the oil begins to smoke, add egg(s). They’re going to hiss and splatter so step back as soon as you do. Spoon some of the cooking oil over the eggs, carefully. Season with salt and pepper. In 1 to 2 minutes, the egg(s) will be brown and very crisp underneath and around the edges. Shimmy a thin spatula underneath the egg(s) (a flexible fish spatula works great here), being careful not to break the yolk. If you’re cooking for someone who shouldn’t be eating runny yolks (ahem), you can flip the egg over and cook it for another 30 seconds or so before removing it. Transfer cooked egg(s) to paper towels to drain. ", 
            "Assemble dish: Once pasta is drained, return it to the empty pot or a large skillet with 1 tablespoon olive oil and a splash or two (or all, if needed to loosen pasta) of reserved cooking water. Over high heat, toss with capers and parsley for 1 minute. Divide among bowls or plates. Sprinkle with Pecorino, if using, then 1/3 of breadcrumb (pangrattato) mixture. Place an egg over each dish, and break up with a fork. Eat immediately."
        ], 
        "date": "2015-02-23T12:00:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (10 ounce) package frozen spinach, thawed, squeeze of all excess liquid, and chopped", 
            "1 1/2 cups finely chopped onion (1 large)", 
            "3 tablespoons unsalted butter", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper", 
            "1/4 teaspoon freshly grated nutmeg", 
            "8 cups cubed French or Italian bread in 1-inch cubes (1/2 lb)", 
            "6 ounces coarsely grated Gruyère (2 cups)", 
            "2 ounces finely grated parmesan (1 cup)", 
            "2 3/4 cups milk", 
            "9 large eggs", 
            "2 tablespoons Dijon mustard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spinach-and-cheese-strata1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/12/spinach-and-cheese-strata/", 
        "title": "spinach and cheese strata", 
        "directions": [
            "Sauté onion in butter in a large, heavy skillet over medium heat until soft, about 5 minutes. Add 1/2 teaspoon salt, 1/4 teaspoon pepper and nutmeg and continue cooking for one minute. Stir in spinach, remove from heat and set aside.", 
            "Spread one third of the bread cubes in a well-buttered 3-quart gratin dish or other ceramic baking dish. Top with one-third of spinach mixture and one-third of each cheese. Repeat layering twice with remaining bread, spinach and cheese.", 
            "Whisk eggs, milk, mustard and remaining 1/2 teaspoon salt and 1/4 teaspoon pepper together in a large bowl and pour evenly over strata. Cover with plastic wrap and chill strata for eat least 8 hours or up to a day.", 
            "The next day, let it stand at room temperature for 30 minutes while preheating the oven to 350°F. Bake strata, uncovered, in middle of oven until puffed, golden brown, and cooked through, 45 to 55 minutes. Let stand 5 minutes before serving."
        ], 
        "date": "2009-12-22T12:27:40+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/spinach-and-egg-pizzettes1.jpg?w=640", 
        "tags": [
            "Brunch", 
            "Eggs", 
            "Italian", 
            "Photo", 
            "Pizza", 
            "Put An Egg On It", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/spinach-and-egg-pizzettes/", 
        "title": "spinach and egg pizzette", 
        "directions": [
            "Heat oven to 500 degrees. Place parchment paper* on tray and sprinkle with cornmeal. Stretch pieces of dough into 6 to 7-inch thin, round-ish shapes.", 
            "If using grown-up spinach, remove coarse stems. No need to remove stems from baby spinach. Wash and drain spinach leaves but no need to fully dry. In a large skillet, cook spinach with water droplets still clinging to the leaves (if it seems too dry, add another tablespoon or two of water to the pan) until spinach just wilts. Plunge spinach in cold water, then transfer it to a colander. Press out as much liquid as you can, then squeeze the rest in small fisfuls.", 
            "Transfer to cutting board and chop spinach into small bits. In a bowl, combine it with creme fraiche, garlic, parmesan, salt and pepper. ", 
            "Divide spinach mixture over each dough round, spreading almost to the edges, thinning it slightly in the center with a spoon to make an indentation to help hold the egg in place. If using small eggs, crack one into the center of each pizzette. If using larger eggs, separate the egg. Add yolk to center of spinach, then pour in egg white carefully, so not to add so much that it floods the pizza. However, if it does spill over, don’t sweat it, that’s what the parchment is for. ", 
            "Either bake pizza directly on parchment covered trays or slide parchment onto pizza stones for anywhere from 6 to 8 minutes (in a very robust oven), to 10 to 13 minutes (in a regular one)**, until egg white is set and the yolk is still loose. As soon as you remove the pizzette from the oven, add a grind of black pepper, very thin drizzle of olive oil and scatter some extra parmesan over it. Eat immediately.", 
            "* Technically speaking, parchment paper should not go in an oven hotter than 450 degrees, but I’ve found that nothing bad happens, it only gets a little brown at the edges. Without the parchment, any egg run-off tends to cement the pizzette to the pan, no fun at all.", 
            "** The baking times are especially finicky here. These will work for most people, however, if your egg becomes too cooked before the pizza is remotely golden at the edges, you might want to add it later in the cooking time. Be especially cautious of this if using small eggs."
        ], 
        "date": "2013-11-04T12:05:18+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large egg", 
            "1 slice of your favorite hearty bread", 
            "2 ounces baby spinach", 
            "1 pat butter", 
            "1 tablespoon minced shallot or white onion", 
            "1 tablespoon heavy cream", 
            "Sea salt and freshly ground black pepper", 
            "1 teaspoon smooth Dijon mustard", 
            "1 tablespoon crumbled cheese, such as goat cheese or feta"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/spinach-and-smashed-egg-toast.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Eggs", 
            "Photo", 
            "Put An Egg On It", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/04/spinach-and-smashed-egg-toast/", 
        "title": "spinach and smashed egg toast", 
        "directions": [
            "Bring small pot of water to boil. Lower egg into it and boil for five (for a runnier egg, as seen in top photo) to six (for a less-runny but still loose egg, as seen in bottom two photos) minutes.* Rinse egg briefly under cool water and set aside.", 
            "Wash your spinach but no need to dry it. Put a small puddle of water in the bottom of a skillet and heat it over medium-high. Once the water is simmering, add the spinach and cook it until it is just wilted, and not a moment longer. Transfer it to a colander and press as much of the excess water out with the back of a fork as possible. No need to wring it out here; we’re hoping to those lovely wilted leaves intact. Keep that fork; you’ll use it again in a moment.", 
            "Put your bread in to toast.", 
            "Dry your skillet if it is still wet. Heat a pat of butter in it over medium-low heat. Add shallots and cook them for a few minutes, until translucent and a little sweet. Return spinach to skillet and add cream. Simmer them together for one minute, then season with salt and freshly ground black pepper.", 
            "Put your toast on your plate and spread it thinly with Dijon mustard. Heap the spinach-and-shallot mixture on top, then add the crumbled cheese. Peel your egg; doing so under running water can make this easier. Once peeled, place it on your spinach toast, smash it open with the back of that fork you used a minute ago, and sprinkle it with salt and freshly ground black pepper. Eat immediately.", 
            "* When you’re eating a soft-boiled egg right away, six minutes is the way to go. But here, since we boil the egg and then prepare the rest of the toast, it continues to cook and firm up a bit in its shell, so I’ve found that a 5 to 5 1/2 minute egg will give you the equivalent in the end."
        ], 
        "date": "2013-04-09T11:41:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound pancetta (a cured pork that is less salty than proscuitto, and not smoked like bacon), cut into 1/4-inch dice", 
            "1 pound Yukon gold potatoes, peeled and cut into a 1/2-inch dice", 
            "1 small yellow onion, chopped small", 
            "1/2 pound asparagus, tough ends trimmed and cut into 1-inch segments", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/spring-asparagus-pancetta-hash.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Spring", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/05/spring-asparagus-pancetta-hash/", 
        "title": "spring asparagus pancetta hash", 
        "directions": [
            "Serving ideas: Fried eggs, dabs of goat cheese and slivers of green onions", 
            "Heat a 12-inch cast iron frying pan over medium heat. Fry the pancetta, turning it frequently so that it browns and crisps on all sides; this takes about 10 minutes. Remove it with a slotted spoon and drain it on paper towels. Leave the heat on and the renderings in the pan. (With a well-seasoned cast iron, this should be all the fat you need to cook the remainder of the hash. If you’re not using a cast iron, you might need to add a tablespoon or so of oil; if you’ve skipped the pork, you’ll want to start with 2 tablespoons oil.)", 
            "Add the potatoes don’t move them for a couple minutes. Use this time to season them well with salt and pepper. Once they’ve gotten a little brown underneath, begin flipping and turning them, then letting them cook again for a few minutes. The idea is not to fight them off the frying pan, once they’ve gotten a little color, it’s easier to flip them and you’ve gotten closer to your goal of getting them evenly browned. ", 
            "When the potatoes are about three-fourths as crisped and brown as you’d like them — this takes about 15 minutes — add the onion. (I add this now, not earlier, because I find it often burns before the potatoes are done.) Cook for an additional 5 minutes. Add the asparagus, cover the pan and cook for 5 to 8 minutes, or until crisply cooked. (Skinny asparagus will take just 5 minutes; thicker asparagus will take longer.) Remove the lid, return the pancetta to the pan for another minute, to reheat. Taste for seasoning and adjust if needed. Serve immediately. "
        ], 
        "date": "2010-05-05T11:42:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1 glug olive oil or cooking fat of your choice", 
            "1 egg, any size", 
            "Salt, pepper, herbs, spices or hot sauce, or all of the above"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/the-crispy-egg1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Budget", 
            "Eggs", 
            "Photo", 
            "Put An Egg On It", 
            "Quick", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/10/the-crispy-egg/", 
        "title": "the crispy egg", 
        "directions": [
            "Over a high flame, heat a skillet for a full minute. Add a glug of oil and let it heat until it just begins to smoke, another 30 seconds. Add your egg, reduce the heat to medium-high, and step back; it’s going to hiss and sputter and basically be the most wildly dramatic thing to happen at breakfast in a long time. Within a minute, it should get brown at the edges but don’t touch or move it. Let it cook until the white looks fully opaque, another 30 seconds to 1 minute. Remove from the heat. Shimmy a thin metal spatula under the egg, gently loosening any stuck parts. Transfer to whatever you’re serving it on (toast, latke waffles, fried rice, home fries, a plate), shower it with seasonings, herbs and spices of your choice and waste no time digging in. Repeat as needed.", 
            "Great tip from the comments: Many have mentioned that you can spoon some of the oil in the skillet over the cooking egg to help it cook more quickly on top, plus, it makes it even more bubbly. I’d definitely recommend this, especially as an extra layer of security that the white will be fully cooked. [Updated to note that I did this a couple mornings later, and whee! The whites were even more bubbly on top.]", 
            "Egg white variation: Let’s say you have a human, small or large, in your household that doesn’t like egg yolks. It turns out, crispy egg whites are pretty cool too, cooked with the same method described above. I think I’d especially love one on a sandwich.", 
            "Crispy sandwich egg: Flip your egg over for an additional 30 seconds or so, until the yolk is almost but not fully set. Be the envy of every other breakfast sandwich.", 
            "Multiple crispy eggs: I’ve done up to two at once and it works just fine. You’ll get a higher amount of crispy edge, however, if you fry them one at a time."
        ], 
        "date": "2014-10-02T12:18:58+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 (1 1/4 to 1 1/2 pounds) Yukon Gold potatoes", 
            "1 small onion", 
            "1 cup olive oil", 
            "6 extra-large or 7 large eggs", 
            "Salt and freshly ground black pepper (don’t skimp)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/09/tortilla-de-patatas-potato-tortilla.jpg?w=750", 
        "tags": [
            "Brunch", 
            "Budget", 
            "Eggs", 
            "Passover", 
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Spanish", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2007/09/tortilla-de-patatas/", 
        "title": "tortilla de patatas", 
        "directions": [
            "Prepare potatoes and onions: Peel potatoes and onion and slice them very thin with a mandoline, the slicing blade of a food processor, or by hand. If either are on the large side, first cut them in a half lengthwise so the slices will be in half-moons.", 
            "Cook potatoes and onions: Heat oil in an 8- to 10-inch skillet, ideally nonstick, over medium-high until very hot, about 3 minutes. Add potatoes and onions in even layers and reduce heat to medium-low. Cook for 15 minutes, flipping and nudging potatoes around to ensure they cook evenly. Potatoes are done when they are tender when pierced with the tip of a knife. They should not get brown or fall apart in flipping (unless you like your tortillas with softer, more broken-up potatoes, as some do).\nDrain potatoes and onions: Transfer potatoes and onion to a colander set over a bowl and drain them. Season potatoes and onion with salt and pepper and let cool slightly, about 5 minutes. [Go make your salad now! Or start cracking those eggs…]\nMake the tortilla batter: In the bottom of a large bowl, lightly beat eggs with a couple good pinches of salt and freshly ground black pepper. Stir in drained potatoes and onions. If you have 10 minutes, definitely let them soak together for that long; it makes a difference in how well the finally tortilla stays together. If you’re in a rush, it’s not going to ruin the dish if you skip it.\nCook the tortilla: Add 2 tablespoons of the drained cooking oil* (back to the skillet over medium-high heat. Pour potato mixture into skillet and flatten the potatoes with a spatula until they’re mostly even. Reduce heat to medium-low. Cook, moving and shimmying the skillet and nudging the egg around (so it runs underneath) for a minute before letting the tortilla cook undisturbed until the top is wet but not very runny, and it is golden underneath.", 
            "Loosen the tortilla with a spatula then slide it onto a large dinner plate.  With your hands in potholders, invert the skillet over the plate, take a deep breath, and flip it back into the skillet. You can do it! Shake the skillet to straighten the tortilla and use a spatula to gently tuck the edges back under, if needed.", 
            "Return the skillet to the stove and cook tortilla to your desired doneness, another 2 to 3 minutes if you like an ever-so-slightly loose center (try it and see if you can go back), 3 to 4 minutes, or until a toothpick inserted into the center comes out dry, for full doneness.\nServe: Slice onto a plate and serve in wedges, hot, cold or at room temperature, plain, or with a dusting of smoked paprika and/or squiggle of aioli or mayo.", 
            "*Save the rest of the cooking in the fridge for future tortillas, or eggs, or potatoes, or anything you want with a faint onion infusion.\n"
        ], 
        "date": "2007-09-10T22:31:50+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds Russet potatoes, boiled, peeled and finely diced (1/4- to 1/2-inch for this and all chopped ingredients)", 
            "2 eggs, hard-boiled, finely diced (optional)", 
            "1 small red or white onion, finely diced", 
            "3/4 cup mayonnaise (low-fat, or a mixture of mayo and sour cream work great here)", 
            "3 small dill pickles, finely diced", 
            "1 cup canned peas and carrots, drained or 1/2 cup cooked peas and 1 carrot, chopped and cooked", 
            "Salt and pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/why-were-afraid-to-cook-salad-olivier1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Russian", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/07/why-were-afraid-to-cook-salad-olivier/", 
        "title": "why we’re afraid to cook + salad olivier", 
        "directions": [
            "Mix all ingredients and season to taste. "
        ], 
        "date": "2008-07-18T15:48:10+00:00"
    }
]