{
  "date": "2016-11-04T12:07:27+00:00",
  "directions": [
    "Prepare the raisins: The day before, combine the raisins and the rum in a small bowl and cover; set aside for 24 hours. However, should you be reading this and want to make it right now, I found microwaving the two together for 10 to 15 seconds and setting them aside until you’re ready to mix the filling allowed them to absorb almost as well.\nMake the dough: The day of, combine the flour and salt in a medium bowl. Add the oil and water and mix with a spoon or your index finger until a rough dough forms. Turn it out onto a very lightly floured counter and knead for 10 minutes. It sounds like it will be forever, but set a timer and chat with a friend, it goes quickly. After 10 minutes, the dough should be soft and silky to the tough. Form it into a ball, place it on the counter and upend the mixing bowl over it. Set aside for 30 minutes.\nMeanwhile, prepare the apples: Peel, halve, core and slice thin in one direction, then halve the slices crosswise, creating thin squarish rectangles of apples. Place them in a large bowl and toss with lemon juice, sugar and cinnamon, if using. Add the raisins and any rum left in the bowl.\nPrepare the breadcrumbs: In a small skillet over medium-low heat, melt 3 tablespoons butter and add the breadcrumbs, sugar and salt. Stir to coat and cook, stirring frequently as they can burn quickly, until crumbs are an even golden brown and very fragrant. Don’t let them burn. Scrape into a dish (or they’ll keep cooking in the pan) and set aside.\nHeat your oven to 400 degrees F (200 degrees C). Line 1 large or 2 smaller baking sheets with parchment paper.\nMelt the remaining 5 tablespoons butter in a small dish.\nRoll out your dough (these directions are for a full-sized strudel): Cover your work surface with a cleaning linen towel or sheet that’s at least 24-by-32 inches. The long side should be horizontal. Sprinkle the cloth lightly with flour. Place the dough in the middle, sprinkle it very lightly with flour and roll in both directions until it’s about 10-by-13 inches, or about as far as the rolling pin can take it. Make sure the dough hasn’t stuck to the cloth; reflour if it has. Now the stretching begins! Ball your hands to loose fists, put them under the rolled-out dough and gently start stretching the dough using the back of your hands. Alternate with pulling the dough gently with your fingers to continue stretching it, stretching the edges thin too. This is all much easier than it sounds, but be patient. If holes form, pinch the dough back together. Continue stretching until the dough is about 16-by-24 inches.",
    "Assemble strudel: Brush evenly with about half the melted butter. On the right side of the rectangle, a few inches from the end, spread the breadcrumbs top to bottom in a thick line, leaving a little more than an inch margin at the top and bottom of the strip. Scoop the apples with a slotted spoon, leaving any accumulated juices in the bowl, and pile them over the crumbs. Gently pull the top and bottom edges of the dough over the apple mixture. Pull the right edge of the dough up and over the filling as far as it will go without tearing. Working carefully, use the towel to roll up the strudel all the way. Place the parchment paper from your baking sheet at the edge of the roll and roll the strudel onto it. Ideally, it should be breadcrumb side-down on the parchment, you can roll it again if it’s not. Use the parchment like a sling to gently place the strudel on the baking sheet.\nBrush the strudel generously all over with some of the remaining butter. Bake for 15 minutes, then brush again and return to the oven in a rotated position. Repeat this once, baking a total of 45 minutes. (Half-size strudels seem to bake 5 or so minutes faster.) The finished strudel should be crisp to the touch and a deep golden brown.",
    "Remove the baking sheet from the oven and let cool on a rack for at least 20 minutes before serving. Dust with confectioners’ sugar and slice into pieces to serve.",
    "Strudel is best the day it is made, but it keeps for 1 to 2 days at room temperature. I’ve also read that you can freeze it (am trying this as we speak, will give more notes once it defrosts). Before serving, you can crisp up leftover strudel in a 350 degree F (180 degree C) oven."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/apple-strudel-apfelstrudel.jpg?w=750",
  "ingredient_list": [
    "1/2 cup (80 grams) raisins",
    "2 tablespoons (30 ml) dark rum",
    "1 cup plus 3 tablespoons (150 grams) all-purpose flour, plus more for dusting",
    "Pinch of salt",
    "3 tablespoons (45 ml) sunflower, safflower or another neutral oil",
    "1/3 cup (80 ml) water",
    "2 pounds (905 grams) firm apples (about 5 to 6)",
    "Juice of 1 lemon",
    "1/3 cup (65 grams) granulated sugar or vanilla sugar (see note above)",
    "1/2 teaspoon ground cinnamon (optional)",
    "8 tablespoons (115 grams) unsalted butter, divided",
    "3/4 cup (40 grams) plain, unseasoned dried breadcrumbs (I used, and recommend, panko, see note above)",
    "1 tablespoon granulated sugar or vanilla sugar",
    "1/8 teaspoon salt",
    "Confectioners’ sugar, for dusting",
    "Lightly sweetened whipped cream or vanilla ice cream, for serving"
  ],
  "tags": [
    "Apple",
    "Austrian",
    "Cake",
    "Fall",
    "German",
    "Photo"
  ],
  "title": "apple strudel",
  "url": "https://smittenkitchen.com/2016/11/apple-strudel/"
}