[
  {
    "ingredient_list": [
      "2 firm tart apples (1 pound or 2 454 grams)",
      "1 1/2 cups (6.75 ounces or 195 grams) all-purpose flour",
      "1/4 cup sugar plus 1 1/2 tablespoons for sprinkling (total of 2.2 ounces or 63 grams)",
      "1/2 tablespoon (7 grams) baking powder",
      "1/2 teaspoon salt (3 grams) plus additional for egg wash",
      "6 tablespoons (3 ounces or 85 grams)unsalted butter, chilled and cut into 1/2-inch cubes plus additional for baking sheet if not lining it with parchment",
      "1/2 cup (2.25 ounces or 65 grams) sharp cheddar, shredded (white is recommended, I assume for aesthetics)",
      "1/4 cup (2 ounces) heavy cream",
      "2 large eggs"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2010/10/5079390141_db09235efb_o.jpg?w=749",
    "tags": [
      "Apple",
      "Cheese",
      "Fall",
      "Muffin/Quick Bread",
      "Photo",
      "Scones/Biscuits"
    ],
    "url": "https://smittenkitchen.com/2010/10/apple-and-cheddar-scones/",
    "title": "apple and cheddar scones",
    "directions": [
      "Position a rack at the center of oven and preheat oven to 375 °F. Line baking sheet with parchment paper.",
      "Peel and core apples, then cut them into one-sixteenths. (I assumed this meant chunks, not slivers.) Placed them in a single layer on a baking sheet lined with parchment paper and bake them until they take on a little color and feel dry to the touch, about 20 minutes. They will be about half-baked. Let them cool completely. (You can speed this up in the fridge, as I did.) Leave oven on.",
      "Sift or whisk flour, sugar, baking powder and salt together. Set aside. Place butter in the bowl of an electric mixer with a paddle attachment, along with cooled apple chunks, cheese, cream and one egg. Sprinkle flour mixture over the top and mix on low speed until the dough just comes together. Do not overmix.",
      "[Don’t have a stand or hand mixer? I’d rub the cold butter into the flour mixture with my fingertips or with a pastry blender, hand-chop the apples coarsely and mix the rest together with a wooden spoon until combined. It might feel awkward, but it should all come together. Again, don’t overmix it though it will be harder to do this by hand.]",
      "Generously flour your counter top and place the scone dough on top of it. Sprinkle with flour. Use a rolling pin to gently roll (or use your hands to pat) the dough into a 1 1/4-inch thick, 6-inch circle. Cut circle into 6 wedges. Transfer them to a baking sheet that has either been buttered or lined with a fresh sheet of parchment paper. Leave at least 2 inches between each scone.",
      "Beat remaining egg in a small bowl with a pinch of salt. Brush the scones with egg wash and sprinkle them with remaining tablespoon of sugar. Bake until firm and golden, about 30 minutes. With a spatula, lift them to a wire rack to cool for 10 minutes. Before you eat one, make sure you realize how addictive they might be. Once you’ve got that down, go for it anyway.",
      "Do ahead: Scones are best the day they are baked. However, they can be made ahead of time and stored unbaked in the freezer until you need them. Simply brush them with the egg wash and sprinkle them with sugar, and bake them still frozen for just a couple extra minutes. This way they are always freshly baked when you want them. These scones were passable on day two and terrible on day three. "
    ],
    "date": "2010-10-15T14:09:55+00:00"
  },
  {
    "ingredient_list": [
      "6 cups torn chunks French, sourdough or country loaf, torn into bits (I use 2 7-ounce demi-baguettes)",
      "5 tablespoons unsalted butter",
      "1 large Spanish or sweet onion, chopped small",
      "1 large or 2 small stalks celery, diced small",
      "1 teaspoon chopped fresh thyme leaves",
      "1/2 teaspoon table salt, plus more to taste",
      "Freshly ground black pepper",
      "1 large or 2 small firm, tart tart apples, such as Granny Smith, peeled, cored and diced small",
      "1/4 cup roughly chopped flat-leaf parsley",
      "3 sage leaves, minced",
      "1/2 to 1 cup cup turkey, chicken or vegetable stock or broth",
      "1 large egg"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2014/11/apple-herb-stuffing-for-all-seasons1.jpg?w=640",
    "tags": [
      "Apple",
      "Bread",
      "Celery",
      "Photo",
      "Put An Egg On It",
      "Side Dish",
      "Thanksgiving"
    ],
    "url":
      "https://smittenkitchen.com/2013/11/apple-and-herb-stuffing-for-all-seasons/",
    "title": "apple-herb stuffing for all seasons",
    "directions": [
      "Position rack in center of oven and preheat to 350°F. Spread bread cubes in single layer on large rimmed baking sheet. Bake until pale golden, stirring occasionally, 10 to 15 minutes. Let cool in pan while you prepare the other ingredients. ",
      "Generously butter a 2-quart baking dish (a 9×5-inch loaf, 8- or 9-inch square dish, etc.) with 1 tablespoon butter. Melt remaining 4 tablespoons butter in large skillet over medium heat. Add onion, thyme, salt and lots of freshly ground black pepper and cook for 2 minutes, until becoming translucent. Add celery and cook for 2 more minutes. Add apple and saute until a bit tender, 3 to 4 minutes more. ",
      "Place bread in large mixing bowl. Scrape contents of skillet on top. Whisk egg and 1/2 cup broth or stock together and pour over. Stir in parsley and sage. Spoon into prepared pan. If mixture looks a little dry, pour remaining 1/2 cup broth over it. [This is a good place to pause, if needed. Nothing bad comes of the stuffing absorbing the liquids for longer.] Bake for 30 to 40 minutes, until brown on top and no liquid appears if you insert a knife vertically into the center of the stuffing pan and turn it slightly. Serve immediately, or reheat as needed.",
      "* On a technical note, I insist upon calling stuffing what is actually dressing, even though I know it is wrong. Although they use the same recipes, stuffing goes inside the bird, dressing is baked outside, and I insist that it is better outside the bird. When making stuffing to, uh, stuff, uh, places, one must cook the bird to a higher-than-normal temperature to ensure that the stuffing inside is free from undercooked poultry drippings. Seeing as most turkey is dry enough, I see no point in helping it along. ",
      "Variations:"
    ],
    "date": "2013-11-19T12:04:08+00:00"
  },
  {
    "ingredient_list": [],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-and-honey-challah1.jpg?w=500",
    "tags": ["Apple", "Bread", "Jewish", "Photo"],
    "url": "https://smittenkitchen.com/2011/09/apple-and-honey-challah/",
    "title": "apple and honey challah",
    "directions": [
      "Make your dough: Whisk yeast and 1 teaspoon honey into 2/3 cup warm water and let stand until foamy, a few minutes.",
      "With a stand mixer: In the bowl of a stand mixture, whisk together yeast mixture, oil, remaining honey (1/3 cup), eggs and yolk. Switch to dough hook and add 4 1/4 cups flour and salt. Use dough hook on a moderate speed until it pulls all of the flour and wet ingredients together into a craggy mass. Lower the speed and let the dough hook knead the dough for 5 minutes, until smooth, elastic and a little sticky.",
      "By hand:: In a large bowl, whisk together yeast mixture, oil, remaining honey (1/3 cup), eggs and yolk. Add flour all at once and stir with a wooden spoon until you get a craggy mass of uneven dough. Turn dough out onto a floured counter and knead it into a smooth, elastic dough, about 5 to 8 minutes. Try to use as little flour as necessary when kneading the dough; you don’t want to toughen the bread. A bench scraper can make it really easy to remove it from the counter if it gets stuck in a spot. [More bread tips here.]",
      "Both methods: Transfer dough to large oil-coated bowl, cover with plastic wrap and set aside for 1 hour, or until almost doubled in size.",
      "Add apples to dough: [See photos in post.] Turn dough out onto a floured counter and gently press it down into a flat, oblong shape. The shape does not matter so however it goes, it goes. Spread 2/3 of apple chunks over 1/2 of the flattened dough. Fold the other half over the apple chunks and press the dough down around them, flattening the now lumpy dough. Spread the remaining 1/3 apple chunks over half the folded dough. Fold the other half over the apples, pressing the dough down again. Your dough packet will likely be square-ish. Fold the corners under with the sides of your hands and form the dough into a round.  Upend your empty bowl over and set it aside for another 30 minutes.",
      "Weave your bread: [See photos in post.] Divide dough into 4 pieces. Roll and stretch each one as carefully as you can into a rope — don’t worry about getting it too long or thin, just 12 inches or so should do. If any apple chunks fall out as you form the ropes or at any other time in the forming of the loaf or risings, just poke them back in with your finger.",
      "Arrange two strands in each direction, perpendicular to each other, like a plus sign. Weave them so that one side is over, and the other is under, where they meet. So, now you’ve got an 8-legged woven-headed octopus. Take the four legs that come from underneath the center and move them over the leg to their right, i.e. jumping it. Take those legs that were on the right and again, jump each over the leg before, this time to the left. If you had extra length to your ropes, you can repeat these left-right jumps until you run out of rope. For me, this was enough. Just as you had with the folded packet of apple dough above, tuck the corners/odd bumps under the dough with the sides of your hands to form a round.",
      "Transfer the dough to a parchment-covered heavy baking sheet or baker’s peel (if you’ll be using a bread stone). Beat egg until smooth and brush over challah. Let challah rise for another hour but 45 minutes into this rise, preheat your oven to 375 degrees.",
      "Bake your loaf: Before baking, brush loaf one more time with egg wash and sprinkle with coarse sugar if you’re using it. Bake in middle of oven for 40 to 45 minutes. It should be beautifully bronzed; if yours (like mine, except I didn’t catch it in time) starts getting too dark too quickly, cover it with foil for the remainder of the baking time. The very best way to check for doneness in any bread but especially on like this where the wetness of the apples can slow down the baking time a bit, is with an instant read thermometer — the center of the loaf should be 195 degrees.",
      "Cool loaf on a rack before serving. Or, well, good luck with that. "
    ],
    "date": "2011-09-28T22:14:27+00:00"
  },
  {
    "ingredient_list": [
      "1 cup apple cider (the fresh kind, not the fizzy alcoholic kind)",
      "1 bottle dry white wine",
      "1/4 cup calvados or another apple brandy",
      "1/4 cup Triple sec or another orange liqueur",
      "Mixed colors of apples, diced and tossed with lemon juice to prevent browning",
      "Seltzer, sparkling water or sparkling apple cider to finish"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/11/apple-cider-sangria1.jpg?w=750",
    "tags": ["Apple", "Drinks", "Photo", "Thanksgiving"],
    "url": "https://smittenkitchen.com/2015/11/apple-cider-sangria/",
    "title": "apple cider sangria",
    "directions": [
      "Place the apple cider in a small saucepan and bring to a boil over high heat. Reduce about 3/4 of the way, until you have approximately 1/4 cup apple cider left; this will take 10 to 15 minutes. Pour into small bowl set over a bowl of ice water and stir; it will cool very quickly this way.",
      "Pour reduced, cooled cider into pitcher. Add wine, apple brandy and triple sec. Add fruit and let sit in the fridge until needed. Add some fizz right before serving; a slotted spoon will help guests hold back the fruit while pouring their glasses, and spoon some on top, if desired."
    ],
    "date": "2015-11-06T11:58:45+00:00"
  },
  {
    "ingredient_list": [
      "Topping:",
      "1 teaspoon aniseed",
      "1 1/2 cups pastry flour",
      "3/4 cup polenta (coarse cornmeal)",
      "1/2 cup sugar",
      "1 1/2 teaspoons baking powder",
      "1/4 teaspoon salt",
      "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
      "1 large egg, beaten to blend",
      "Filling:",
      "2 cups fresh cranberries",
      "White sugar–original recipe calls for 2/3 cup, I’d suggest 1/3 cup or omitting it entirely",
      "2/3 cup (packed) golden brown sugar",
      "2 teaspoons finely grated lemon peel",
      "1 1/2 teaspoons finely grated orange peel",
      "1 teaspoon ground cinnamon",
      "1/2 teaspoon salt",
      "1/4 teaspoon freshly ground black pepper",
      "2 pounds Granny Smith apples, peeled, cored, cut into 1-inch cubes",
      "2 tablespoons fresh lemon juice",
      "Vanilla gelato or ice cream"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-cranberry-crisp1.jpg?w=500",
    "tags": [
      "Apple",
      "Cranberries",
      "Crumbles/Crisps",
      "Disasters",
      "Fruit",
      "Photo"
    ],
    "url": "https://smittenkitchen.com/2007/12/apple-cranberry-crisp/",
    "title": "apple cranberry crisp",
    "directions": [
      "For topping: Toast aniseed in small skillet over medium heat until slightly darker in color, about 3 minutes. Place seeds in processor. Add next 5 ingredients; blend 5 seconds. Add butter; blend, using on/off turns, until mixture resembles coarse crumbs. Transfer mixture to large bowl. Drizzle egg over and stir until ingredients are evenly moistened.",
      "For filling: Preheat oven to 375°F. Combine first 8 ingredients in large bowl; stir to blend. Add apples and lemon juice; toss to blend. Transfer filling to 11x7x2- inch glass baking dish (or other shallow 2-quart baking dish).",
      "Crumble topping finely over filling. Bake dessert until apples are tender, juices bubble thickly, and topping is crisp and golden, about 1 hour. Cool 15 minutes. Serve crisp warm with gelato."
    ],
    "date": "2007-12-13T15:15:50+00:00"
  },
  {
    "ingredient_list": [
      "1 pound tart, firm apples such as Granny Smiths (2 large or 3 medium)",
      "1 tablespoon lemon juice",
      "6 tablespoons all-purpose flour",
      "1 tablespoon granulated sugar",
      "1/4 teaspoon cinnamon",
      "1 teaspoon baking powder",
      "2 large eggs",
      "Butter (I used about 2 tablespoons)",
      "Rich plain yogurt, sour cream or crème fraîche for serving"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2010/11/apple-latkes.jpg?w=750",
    "tags": ["Apple", "Hanukah", "Jewish", "Pancakes", "Photo"],
    "url": "https://smittenkitchen.com/2010/11/apple-latkes/",
    "title": "apple latkes",
    "directions": [
      "In a small saucepan, simmer the apple juice until it is reduced by half. Add the sugar and continue to cook it until it becomes a golden brown/amber color. Add the butter and once it melts, the heavy cream and salt. Simmer for one minute and serve, with or without apple latkes."
    ],
    "date": "2010-11-30T17:17:28+00:00"
  },
  {
    "ingredient_list": [
      "Tart base",
      "14-ounce package puff pastry, defrosted in fridge overnight",
      "3 large or 4 medium apples (about 1 1/4 pounds)",
      "2 tablespoons granulated sugar",
      "2 tablespoons unsalted butter, cold, cut into small bits",
      "Salted caramel glaze",
      "1/4 cup granulated sugar",
      "2 tablespoons unsalted butter (or salted, but then ease up on the sea salt)",
      "1/4 teaspoon flaky sea salt (or half as much table salt)",
      "2 tablespoons heavy cream"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2012/10/apple-mosaic-tart-with-salted-caramel.jpg?w=750",
    "tags": ["Apple", "Fall", "Photo", "Tarts/Pies"],
    "url":
      "https://smittenkitchen.com/2012/10/apple-mosaic-tart-with-salted-caramel/",
    "title": "apple mosaic tart with salted caramel",
    "directions": [
      "Heat your oven to 400°F. Line a rimmed baking sheet or jelly roll pan with parchment paper. Ideally you would use a 10×15-inch jelly roll pan, as I do here. A smaller pan will make a thicker tart (and you might need fewer apples). In a larger pan, you can still fit a 10×15-inch tart, which I think is the ideal size here. ",
      "Lightly flour your counter and lay out your pastry. Flour the top and gently roll it until it fits inside your baking sheet, and transfer it there. Try not to roll it any bigger than you’ll need it, or you’ll have to trim, which means you’ll have to sprinkle the trimmings with cinnamon-sugar and bake them into cookie-sized segments for snacks. And that would be terrible.",
      "Peel the apples and cut them in half top-to-bottom. Remove the cores and stems (I like to use a melon baller and/or a pairing knife). Slice the apples halves crosswise as thinly as you can with a knife, or to about 1/16-inch thickness with a mandoline. Leaving a 1/2-inch border, fan the apples around the tart in slightly overlapping concentric rectangles — each apple should overlap the one before so that only about 3/4-inch of the previous apple will be visible — until you reach the middle. Sprinkle the apples evenly with the first two tablespoons of sugar then dot with the first two tablespoons butter. ",
      "Bake for 30 minutes, or until the edges of the tart are brown and the edges of the apples begin to take on some color. If you sliced your apples by hand and they were on the thicker side, you might need a little more baking time to cook them through. The apples should feel soft, but dry to the touch. If you puffed pastry bubbles dramatically in any place during the baking time, simply poke it with a knife or skewer so that it deflates. This is fun, I promise.",
      "Meanwhile, about 20 minutes into the baking time, make your glaze. In a small saucepan over medium-high heat, melt your last 1/4 cup sugar; this will take about 3 minutes. Cook the liquefied sugar to a nice copper color, another minute or two. Off the heat, add the sea salt and butter and stir until the butter melts and is incorporated. Add the heavy cream and return to the stove over medium heat. Cook, stirring constantly, until you have a lovely, bronzed caramel syrup, just another minute, two, tops. Set aside until needed. You may need to briefly rewarm it to thin the caramel before brushing it over the tart.",
      "After the tart has baked, transfer it to a cooling rack, but leave the oven on. Using very short, gentle strokes, and brushing in the direction that the apples fan to mess up their design as little as possible, brush the entire tart, including the exposed pastry, with the salted caramel glaze. You might have a little leftover. Whatever you do, do not spread it on a sliced apple for a snack. Trust me. ",
      "Return the apple tart to the oven for 5 to 10 more minutes, until the caramel glaze bubbles. Let tart cool complete before cutting into 12 squares. Serve plain, with coffee or tea, if you’re feeling grown-up or with a scoop of vanilla ice cream, if you’re feeling particularly indulgent."
    ],
    "date": "2012-10-19T11:38:05+00:00"
  },
  {
    "ingredient_list": [
      "2 eggs, well beaten",
      "1 1/2 cups of milk or yogurt (I used milk and am only assuming that the yogurt will work as well)",
      "2 cups all-purpose flour",
      "1 teaspoon baking powder",
      "1/2 teaspoon salt",
      "1/4 cup sugar",
      "3 medium apples, peeled and coarsely grated (I used yellow delicious, but will use a more tart variety next time)",
      "Extra flavorings (see recipe notes)",
      "Vegetable oil, for frying",
      "Confectioner’s sugar, for dusting"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-pancakes1.jpg?w=500",
    "tags": ["Apple", "Breakfast", "Fall", "Fruit", "Pancakes", "Photo"],
    "url": "https://smittenkitchen.com/2008/11/apple-pancakes/",
    "title": "apple pancakes",
    "directions": [
      "1. Mix the eggs with the milk or yogurt in a large bowl.",
      "2. In a smaller bowl, whisk the flour, baking powder, salt and sugar together.",
      "3. Combine the wet and the dry ingredients and stir in the apples and whatever other flavorings you see fit.",
      "4. Heat a thin layer of oil in a skillet over low to medium heat. Drop large spoonful of batter into the pan and flatten it out a little (otherwise, you might have trouble getting them to cook in the center) and cook until golden brown underneath. Flip the pancakes and cook them for an additional two or three minutes.",
      "5. Either dust with powdered sugar and serve immediately, or keep on a tray in a warmed oven until you are ready to serve them."
    ],
    "date": "2008-11-09T22:27:47+00:00"
  },
  {
    "ingredient_list": [
      "Crust",
      "2 1/2 cups (313 grams) all-purpose flour, plus more for dusting surfaces, dipping fork",
      "2 tablespoons (25 grams) granulated sugar (doubled from my standard pie dough to make this more cookie-like)",
      "1 teaspoon (4 grams) table salt",
      "2 sticks (225 grams, 8 ounces, 16 tablespoons or 1 cup) unsalted butter, very cold",
      "1/2 cup (118 ml) water, very cold (I pour 1 cup and add ice while I work, then measure 1/2 cup from it when I need it)",
      "Filling",
      "3 medium apples, whatever you like to bake with",
      "Squeeze of lemon juice (optional)",
      "1/3 cup (67 grams) granulated sugar",
      "1 teaspoon (2 grams) ground cinnamon",
      "Few gratings fresh nutmeg",
      "A pinch of any other spices you like in your apple pie",
      "To finish",
      "1 large egg",
      "Coarse or granulated sugar for garnish",
      "Additional stuff",
      "A couple baking sheets covered with parchment paper",
      "Rolling pin, pastry brush (for egg wash), fork (for crimping and dipping) and sharp knife (to make slits)",
      "Two round cookie cutters of different sizes. I used 2 1/2-inch and 1 1/2 to 1 3/4-inch rounds. You’ll want to make sure there’s at least a 3/4-inch different in the sizes, as you’ll need the extra margin to crimp your dough. "
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2011/10/apple-pie-cookies2.jpg?w=751",
    "tags": ["Apple", "Cookie", "Fall", "Photo", "Picnics", "Tarts/Pies"],
    "url": "https://smittenkitchen.com/2011/10/apple-pie-cookies/",
    "title": "apple pie cookies",
    "directions": [
      "Make your pie dough: Whisk together flour, sugar and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of small peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I did.) Gently stir in the ice water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough in half. Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days. [Even more detailed pie dough instructions in this post, check it out!]",
      "Meanwhile, get everything else together: Line up six small dishes. In the first one, pour some water. Leave the second one empty; you’ll use it for your apples in a bit. In the third one, mix the sugar, cinnamon, nutmeg and any other spices you like in your pie, such as a pinch of cloves. In the fourth one, place a little bit of flour to dust your surface and dip your fork for crimping. In the fifth one, whisk an egg with one teaspoon of water until smooth. In the last one, or in whatever container you keep it in, add some coarse or regular sugar for decorating the tops of the pies. You are very likely thinking I’ve lost my mind by now and you may not be terribly far off.  ",
      "On a well-floured counter, roll out your pie dough pretty thin, a little shy of 1/8-inch thick. Lift and rotate your dough as you roll it, to ensure that it rolls out evenly and so you can be sure it’s not sticking in any place. [More rolling tips here!] Use the larger of your two cookie cutters [mine was 2 1/2-inch) to cut as many rounds as you can from the dough. Transfer them to parchment-lined baking sheets and keep them in the fridge until you need them. Once you’ve finished the first packet, repeat the process with the second packet of dough",
      "Prepare your apples: Peel your apples. Cut thin (1/8-inch thick) slices from one side of whole apple, stopping when you hit the core. Repeat on opposite side. I got about 10 usable slices from each side of my small-medium-ish apples. Use the smaller of your two cookie cutters (mine was about 1 2/3 inches) to cut the apples into cute little discs that will fit inside your pie cookies. Place them in your second bowl, covering them with a few drops of lemon juice if you find that they’re browning quickly.",
      "Preheat oven to 350 degrees.",
      "And now, assemble away! Grab your first disc of chilled dough and lightly dampen it on one side with the water. This is to help it seal. Take your first disc of apple and toss it in the cinnamon spice sugar. Place it on the damp side of the bottom disk. Place a second disc of dough on top; I found it easiest to seal it by picking the whole thing up (this is when you’ll be glad that your dough is cold and semi-firm; if it’s soft and getting sticky, chill it until it’s easy to pick up) and press the tops and bottoms around the apple with your fingers. Back on the floured counter, cut decorative slits in your “pies”. Dip your fork in the flour and use it to create a decorative crimp on the sealed edges. Brush your cookie with egg wash and sprinkle with coarse sugar. Replace on baking sheet and chill while you prepare the others. About now, you’ll curse your friendly food blogger for getting you into such an exacting cookie making process but I promise, the first couple are slow and the rest come together very quickly.",
      "Bake your apple pie cookies for 25 minutes, or until puffed and bronzed and very pie-like. (If this is your first batch, peer in at them at 20 minutes, to make sure your oven doesn’t run hot.) Transfer to a cooling rack to cool before eating them… oh haha. I forgot who I was talking to.",
      "Do ahead: These will keep for a few days at room temperature, though not in my apartment. You could also make a larger batch of these, doing everything but brushing them with egg and sprinkling them with sugar, and keep them frozen until needed. Bake them directly from the freezer, just adding a couple minutes to the baking time."
    ],
    "date": "2011-10-13T09:37:45+00:00"
  },
  {
    "ingredient_list": [],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2012/01/apple-sharlotka.jpg?w=750",
    "tags": ["Apple", "Everyday Cakes", "Photo", "Russian"],
    "url": "https://smittenkitchen.com/2012/01/apple-sharlotka/",
    "title": "apple sharlotka",
    "directions": [
      "Preheat oven to 350 degrees. Line the bottom of a 9-inch springform pan with parchment paper. Butter the paper and the sides of the pan. Peel, halve and core your apples, then chop them into medium-sized chunks. (I cut each half into four “strips” then sliced them fairly thinly — about 1/4-inch — in the other direction.) Pile the cut apples directly in the prepared pan. Meanwhile, in a large bowl, using an electric mixer or whisk, beat eggs with sugar until thick and ribbons form on the surface of the beaten eggs. Beat in vanilla, then stir in flour with a spoon until just combined. The batter will be very thick.",
      "Pour over apples in pan, using a spoon or spatula to spread the batter so that it covers all exposed apples. (Updated to clarify: Spread the batter and press it down into the apple pile. The top of the batter should end up level with the top of the apples.) Bake in preheated oven for 55 to 60 minutes, or until a tester comes out free of batter. Cool in pan for 10 minutes on rack, then flip out onto another rack, peel off the parchment paper, and flip it back onto a serving platter. Dust lightly with ground cinnamon.",
      "Serve warm or cooled, dusted with powdered sugar. Alex’s family eats it plain, but imagine it would be delicious with a dollop of barely sweetened whipped or sour cream."
    ],
    "date": "2012-01-06T15:05:00+00:00"
  },
  {
    "ingredient_list": [
      "Crust",
      "3 3/4 (470 grams) cups all-purpose flour",
      "1 1/2 tablespoons sugar",
      "1 1/2 teaspoons table salt",
      "3 sticks (340 grams) unsalted butter, very cold",
      "3/4 cup very cold water",
      "Filling",
      "3 1/2 to 4 pounds apples, peeled, cored and chopped into approximately 1/2-inch chunks (about 8 cups)",
      "Squeeze of lemon juice",
      "2/3 to 3/4 cup sugar (depending on how sweet you like your pies)",
      "3 tablespoons cornstarch",
      "1 teaspoon ground cinnamon",
      "1/4 teaspoon ground nutmeg",
      "1/4 teaspoon ground allspice",
      "1/8 teaspoon table salt",
      "To finish",
      "2 tablespoons heavy cream or one egg, beaten with 1 tablespoon of water",
      "Glaze (optional)  (only need half, barely, for what’s in photos)",
      "1/2 cup confectioners’ sugar",
      "1 tablespoon milk, water, lemon juice or fresh apple cider, plus a drop or two more if needed"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2014/10/apple-slab-pie1.jpg?w=640",
    "tags": ["Apple", "Fall", "Photo", "Tarts/Pies", "Thanksgiving"],
    "url": "https://smittenkitchen.com/2013/10/apple-slab-pie/",
    "title": "apple slab pie",
    "directions": [
      "Make pie crust: Whisk together flour, sugar and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in the water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough roughly in half (it’s okay if one is slightly larger). Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day. [Still freaked out about making your own pie dough? Read this for a ton of additional tips and details.]",
      "Heat oven  oven to 375 degrees F. Line bottom of 10x15x1-inch baking sheet or jellyroll pan with parchment paper.",
      "Prepare filling: In a large bowl, toss apples with lemon juice until coated. Top with remaining filling ingredients and stir to evenly coat. ",
      "Assemble pie: On a lightly floured surface, roll one of your dough halves (the larger one, if you have two different sizes) into an 18-by-13-inch rectangle. This can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible and using enough flour that it doesn’t stick to the counter. Transfer to your prepared baking sheet and gently drape some of the overhang in so that the dough fills out the inner edges and corners. Some pastry will still hang over the sides of the pan; trim this to 3/4-inch. ",
      "Pour apple mixture over and spread evenly. ",
      "Roll the second of your dough halves (the smaller one, if they were different sizes) into a 16-by-11-inch rectangle. Drape over filling and fold the bottom crust’s overhang over the edges sealing them together. Cut small slits to act as vents all over lid. Brush lid heavy cream or egg wash. Bake until crust is golden and filling is bubbling, 40 to 45 minutes. Transfer to a wire rack until just warm to the touch, about 45 minutes.",
      "In a medium bowl, stir together confectioners’ sugar and liquid of your choice until a pourable glaze consistency is reached. Use a spoon to drizzle over top. Serve slab pie in squares or rectangles, warm or at room temperature. ",
      "It keeps at room temperature for at least three days."
    ],
    "date": "2013-10-25T11:20:46+00:00"
  },
  {
    "ingredient_list": [
      "1/2 cup (80 grams) raisins",
      "2 tablespoons (30 ml) dark rum",
      "1 cup plus 3 tablespoons (150 grams) all-purpose flour, plus more for dusting",
      "Pinch of salt",
      "3 tablespoons (45 ml) sunflower, safflower or another neutral oil",
      "1/3 cup (80 ml) water",
      "2 pounds (905 grams) firm apples (about 5 to 6)",
      "Juice of 1 lemon",
      "1/3 cup (65 grams) granulated sugar or vanilla sugar (see note above)",
      "1/2 teaspoon ground cinnamon (optional)",
      "8 tablespoons (115 grams) unsalted butter, divided",
      "3/4 cup (40 grams) plain, unseasoned dried breadcrumbs (I used, and recommend, panko, see note above)",
      "1 tablespoon granulated sugar or vanilla sugar",
      "1/8 teaspoon salt",
      "Confectioners’ sugar, for dusting",
      "Lightly sweetened whipped cream or vanilla ice cream, for serving"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2016/11/apple-strudel-apfelstrudel.jpg?w=750",
    "tags": ["Apple", "Austrian", "Cake", "Fall", "German", "Photo"],
    "url": "https://smittenkitchen.com/2016/11/apple-strudel/",
    "title": "apple strudel",
    "directions": [
      "Prepare the raisins: The day before, combine the raisins and the rum in a small bowl and cover; set aside for 24 hours. However, should you be reading this and want to make it right now, I found microwaving the two together for 10 to 15 seconds and setting them aside until you’re ready to mix the filling allowed them to absorb almost as well.\nMake the dough: The day of, combine the flour and salt in a medium bowl. Add the oil and water and mix with a spoon or your index finger until a rough dough forms. Turn it out onto a very lightly floured counter and knead for 10 minutes. It sounds like it will be forever, but set a timer and chat with a friend, it goes quickly. After 10 minutes, the dough should be soft and silky to the tough. Form it into a ball, place it on the counter and upend the mixing bowl over it. Set aside for 30 minutes.\nMeanwhile, prepare the apples: Peel, halve, core and slice thin in one direction, then halve the slices crosswise, creating thin squarish rectangles of apples. Place them in a large bowl and toss with lemon juice, sugar and cinnamon, if using. Add the raisins and any rum left in the bowl.\nPrepare the breadcrumbs: In a small skillet over medium-low heat, melt 3 tablespoons butter and add the breadcrumbs, sugar and salt. Stir to coat and cook, stirring frequently as they can burn quickly, until crumbs are an even golden brown and very fragrant. Don’t let them burn. Scrape into a dish (or they’ll keep cooking in the pan) and set aside.\nHeat your oven to 400 degrees F (200 degrees C). Line 1 large or 2 smaller baking sheets with parchment paper.\nMelt the remaining 5 tablespoons butter in a small dish.\nRoll out your dough (these directions are for a full-sized strudel): Cover your work surface with a cleaning linen towel or sheet that’s at least 24-by-32 inches. The long side should be horizontal. Sprinkle the cloth lightly with flour. Place the dough in the middle, sprinkle it very lightly with flour and roll in both directions until it’s about 10-by-13 inches, or about as far as the rolling pin can take it. Make sure the dough hasn’t stuck to the cloth; reflour if it has. Now the stretching begins! Ball your hands to loose fists, put them under the rolled-out dough and gently start stretching the dough using the back of your hands. Alternate with pulling the dough gently with your fingers to continue stretching it, stretching the edges thin too. This is all much easier than it sounds, but be patient. If holes form, pinch the dough back together. Continue stretching until the dough is about 16-by-24 inches.",
      "Assemble strudel: Brush evenly with about half the melted butter. On the right side of the rectangle, a few inches from the end, spread the breadcrumbs top to bottom in a thick line, leaving a little more than an inch margin at the top and bottom of the strip. Scoop the apples with a slotted spoon, leaving any accumulated juices in the bowl, and pile them over the crumbs. Gently pull the top and bottom edges of the dough over the apple mixture. Pull the right edge of the dough up and over the filling as far as it will go without tearing. Working carefully, use the towel to roll up the strudel all the way. Place the parchment paper from your baking sheet at the edge of the roll and roll the strudel onto it. Ideally, it should be breadcrumb side-down on the parchment, you can roll it again if it’s not. Use the parchment like a sling to gently place the strudel on the baking sheet.\nBrush the strudel generously all over with some of the remaining butter. Bake for 15 minutes, then brush again and return to the oven in a rotated position. Repeat this once, baking a total of 45 minutes. (Half-size strudels seem to bake 5 or so minutes faster.) The finished strudel should be crisp to the touch and a deep golden brown.",
      "Remove the baking sheet from the oven and let cool on a rack for at least 20 minutes before serving. Dust with confectioners’ sugar and slice into pieces to serve.",
      "Strudel is best the day it is made, but it keeps for 1 to 2 days at room temperature. I’ve also read that you can freeze it (am trying this as we speak, will give more notes once it defrosts). Before serving, you can crisp up leftover strudel in a 350 degree F (180 degree C) oven."
    ],
    "date": "2016-11-04T12:07:27+00:00"
  },
  {
    "ingredient_list": [
      "6 medium apples (I had the most success with Golden Delicious and Granny Smiths)",
      "Juice of half a lemon",
      "6 tablespoons (3 ounces or 85 grams) butter",
      "1 1/3 cup (266 grams) sugar, divided",
      "Puffed pastry, chilled",
      "A 9-inch ovenproof skillet, heavy enough that you fear dropping it on your toes"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-tarte-tatin-anew1.jpg?w=500",
    "tags": ["Apple", "French", "Photo", "Tarts/Pies"],
    "url": "https://smittenkitchen.com/2011/04/apple-tarte-tatin-anew/",
    "title": "apple tarte tatin, anew",
    "directions": [
      "Peel apples, halve and core apples. Once cored, cut lengthwise into quarters (i.e. four pieces per apple) and cut a bevel along their inner edge, which will help their curved exteriors stay on top as they rest on this edge. (You can see this beveled edge here.) Toss apple chunks with the lemon juice and 1/3 cup of the sugar. Set aside for 15 minutes; this will help release the apple’s juices, too much of them and the caramel doesn’t thicken enough to cling merrily to the cooked apples.",
      "Melt butter in your skillet over medium heat. Sprinkle in remaining 1 cup sugar and whisk it over the heat until it becomes the palest of caramels. Off the heat, add the apples to the skillet, arranging them rounded sides down in one layer. Lay any additional apple wedges rounded sides down in a second layer, starting from the center.",
      "Return the pan to the stove and cook in the caramel for another 20 to 25 minutes over moderately high heat. With a spoon, regularly press down on the apples and baste them caramel juices from the pan. If it seems that your apples in the center are cooking faster, swap them with ones that are cooking more slowly, and rotate apples that are cooking unevenly 180 degrees. The apples will shrink a bit and by the end of the cooking time, your second layer of apples might end up slipping into the first — this is fine.",
      "Preheat oven to 400. Roll out your puffed pastry to a 9-inch circle and trim if needed. Cut four vents in pastry. Remove skillet from heat again, and arrange pastry round over apples. Tuck it in around the apples for nicer edges later.  Bake until the pastry is puffed and golden brown, about 20 minutes.",
      "Once baked, use potholders to place a plate or serving dish (larger in diameter than the pan, learn from my messes!) over the pasty and with a deep breath and a quick prayer, if you’re into that kind of thing, unmold the pastry and apples at once onto the plate. If any apples stubbornly remain behind in the pan, nudge them out with a spatula.",
      "Serve with a dollop of whipped crème fraîche, or lightly sweetened whipped cream and eat immediately.",
      "* My favorite, by miles, though not exactly budget-minded, is from Dufour. It tastes like something straight out of a Paris pastry shop. "
    ],
    "date": "2011-04-05T16:32:29+00:00"
  },
  {
    "ingredient_list": [
      "3 pounds* of whatever apples, or mix of apples, you like to bake with, peeled, cored and cut into medium chunks",
      "2 tablespoons lemon juice",
      "3 tablespoons sugar",
      "2 tablespoons cornstarch",
      "1 teaspoon cinnamon",
      "Salt",
      "1 stick (8 tablespoons or 4 ounces) unsalted butter",
      "1/4 cup honey",
      "1/2 cup flour",
      "2 cups oats",
      "1/2 cup sliced almonds",
      "1/2 shredded coconut (sweetened or unsweetened, as you wish; I used unsweetened)"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2009/10/breakfast-apple-granola-crisp.jpg?w=753",
    "tags": [
      "Apple",
      "Breakfast",
      "Brunch",
      "Coconut",
      "Crumbles/Crisps",
      "Fall",
      "Fruit",
      "Photo"
    ],
    "url": "https://smittenkitchen.com/2009/10/breakfast-apple-granola-crisp/",
    "title": "breakfast apple granola crisp",
    "directions": [
      "Preheat oven to 400°F. Mix apple chunks with lemon juice, sugar, cornstarch, cinnamon and pinch of salt in a 9×13-inch baking dish until apples are evenly coated. In a medium saucepan, melt the butter with the honey. Stir in the flour, oats, almonds, coconut and another pinch of salt until clumps form. Sprinkle evenly over the apple mixture and bake in the oven for about 45 to 55 minutes, or until the apples are softened and bubbly. Should the granola brown before you wish it to, cover the baking dish carefully with foil for all but the last few minutes of baking time, when removing the foil will help the granola recrisp. Cool to room temperature and then stash in the fridge to eat with your morning yogurt.",
      "* To note: I originally made mine with four pounds of apples, which will explain why yours may not look as voluminous as mine. However, I felt that the apple to granola proportion was off, and the apples nearly overflowed in the baking dish, hence why I suggest you use less."
    ],
    "date": "2009-10-12T09:57:12+00:00"
  },
  {
    "ingredient_list": [
      "1/2 large red onion, diced small",
      "2 tablespoons red wine vinegar",
      "2 teaspoons ground sumac",
      "1/4 teaspoon kosher salt, plus more to season salad",
      "2 cups shredded brussels sprouts",
      "1/2 cup fresh pomegranate seeds (from about 1/2 a large one)",
      "1/2 a large unpeeled apple, cored and diced (I used Granny Smith, the book recommends Pink Lady or Honeycrisp)",
      "Juice of half a lemon, plus more to taste",
      "1 1/2 to 2 tablespoons honey, plus more to taste",
      "1/4 cup olive oil",
      "3/4 cup toasted, cooled walnuts, lightly crushed or coarsely chopped",
      "Ground chipotle chile pepper, urfa biber peppers, hot smoked paprika or another chile flake, to taste"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad.jpg?w=750",
    "tags": [
      "Apple",
      "Brussels Sprouts",
      "Fall",
      "Gluten-Free",
      "Onions",
      "Photo",
      "Pomegranate",
      "Salad",
      "Side Dish",
      "Thanksgiving",
      "Tips",
      "Vegetarian",
      "Winter"
    ],
    "url":
      "https://smittenkitchen.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad/",
    "title": "brussels sprouts, apple and pomegranate salad",
    "directions": [
      "Make the sumac-pickled onions: Combine red onion, wine vinegar, sumac and 1/4 teaspoon kosher salt in a small dish and set aside while you prepare the other ingredients, or ideally at least 15 minutes.\nCombine all salad ingredients, including red onions and their pickling liquid, in a medium bowl and season to taste with salt and red pepper. Taste and adjust ingredients as desired — I’ve seen versions of the recipe with more honey, olive oil and lemon; I didn’t need them but you might find you do.\nThis salad can be prepped ahead, but I’d keep the dressing off of it until at most an hour before serving so it doesn’t discolor the sprouts."
    ],
    "date": "2016-11-21T13:06:43+00:00"
  },
  {
    "ingredient_list": [
      "1 small savoy cabbage",
      "1/3 cup walnuts",
      "2 tablespoons cider vinegar",
      "1 tablespoon lemon juice",
      "Salt and pepper",
      "1/2 cup olive oil",
      "2 tablespoons creme fraiche or heavy cream (we used sour cream)",
      "2 apples (any crisp, tasty eating variety, such as Sierra Beauty, Granny Smith, or Fuji)",
      "1/3 cup crumbled blue cheese (optional)"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-apple-and-walnut-salad1.jpg?w=500",
    "tags": ["Apple", "Cabbage", "Photo", "Salad"],
    "url": "https://smittenkitchen.com/2008/11/cabbage-apple-and-walnut-salad/",
    "title": "cabbage, apple and walnut salad",
    "directions": [
      "Preheat the oven to 375°F.",
      "Tear off and discard the tough outer leaves of the cabbage. Cut it in half and cut out its core. Slice the halves crosswise into a fine chiffonade.",
      "Toast the walnuts in the oven for 8 minutes. While they are still warm, first rub them in a clean dishtowel to remove some of the skins, then chop or coarsely crumble them.",
      "To prepare the dressing, mix the vinegar with the lemon juice, some salt, and a generous amount of pepper.",
      "Whisk in the olive oil and then the creme fraiche or cream. Taste and adjust the acid and salt as desired.",
      "Quarter, peel, and core the apples. Slice the quarters lengthwise fairly thin and cut these slices lengthwise into a julienne. Toss the cabbage, apples, and walnuts (and blue cheese, if you’re using it) with the dressing and an extra pinch of salt. Let the salad sit for 5 minutes, taste again, adjust the seasoning as needed, and serve."
    ],
    "date": "2008-11-28T23:58:37+00:00"
  },
  {
    "ingredient_list": [
      "3 cups unbleached all-purpose flour (2 1/2 cups, non-lattice)",
      "1 teaspoon salt",
      "2 tablespoons sugar",
      "7 tablespoons all-vegetable shortening, chilled (8 tablespoons, non-lattice)",
      "10 tablespoons unsalted butter, chilled, cut into 1/4-inch pieces (12 tablespoons, non-lattice)",
      "10 tablespoons ice water (6 to 8 tablespoons, non-lattice)",
      "1 1/2 pounds Granny Smith apples (about 3 medium)",
      "2 pounds McIntosh apples (about 4 large)",
      "1 tablespoon juice and 1 teaspoon zest from 1 lemon",
      "3/4 cups (5.25 ounces) plus 1 tablespoon sugar",
      "2 tablespoons all-purpose flour",
      "1/4 teaspoon salt",
      "1 teaspoon cinnamon",
      "1/4 teaspoon ground nutmeg",
      "1/4 teaspoon ground allspice",
      "1 egg white, beaten lightly"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/05/cinnamon-sigh1.jpg?w=500",
    "tags": ["Apple", "Fruit", "Photo", "Tarts/Pies", "Thanksgiving"],
    "url": "https://smittenkitchen.com/2006/11/cinnamon-sigh/",
    "title": "apple pie",
    "directions": [
      "1. Adjust oven rack to lowest position and heat rimmed baking sheet and oven to 500°F. Remove one piece of dough from refrigerator (if refrigerated longer than 1 hour, let stand at room temperature until malleable).",
      "2. Roll dough on lightly floured work surface or between two large sheets of plastic wrap to 12-inch disk. Transfer dough to pie plate by rolling dough around rolling pin and unrolling over 9 1/2-inch pie plate or by folding dough in quarters, then placing dough point in center of pie plate  and unfolding. Working around circumference of pie plate, ease dough into pan corners by gently lifting dough edges with one hand while pressing around pan bottom with other hand. Leave dough that overhangs lip of plate in place; refrigerate dough-lined pie plate.",
      "3. Peel, core and cut apples in half, and in half again width-wise; cut quarters into 1/4-inch slices and toss with lemon juice and zest. In a medium bowl, mix 3/4 cup sugar, flour, salt and spices. Toss dry ingredients with apples. Turn fruit mixture, including juices, into chilled pie shell and mound slightly in center.",
      "4. Roll out second piece of dough to 12-inch disk and place over filling. Trim top and bottom edges to 1/2-inch beyond pan lip. Tuck this rim of dough underneath itself so that folded edge is flush with pan lip. Flute edging or press with fork tines to seal. Cut four slits on dough top. If pie dough is very soft, place in freezer for 10 minutes. Brush egg white onto top of crust and sprinkle evenly with remaining 1 tablespoon sugar.",
      "5. Place pie on baking sheet and lower oven temperature to 425°F. Bake until top crust is golden, about 25 minutes. Rotate pie and reduce oven temperature to 375°F; continue baking until juices bubble and crust is deep golden brown, 30-35 minutes longer. ",
      "6. Transfer pie to wire rack; cool to room temperature, at least 4 hours. ",
      "Review: We all loved this pie. However, I might for the first time be taking a no-lattice top approach for apple pies in the future. Shortly after these pictures were taken, the apples fell and it ended up looking a little bird cagey on top. This has happened before, leading me to think that perhaps in the open-top variety, apples have a chance to lose too much of their moisture. It wasn’t particularly gooey inside, though tasty just the same. I’m thinking that peach or cherry pies, with their excessive juiciness, might be better-suited for lattice-tops and Cook’s Illustrated seems to agree.",
      "Finally, I’d jack up the spices a bit next time, certainly doubling them [updated to note: not everyone agrees that it needs more spice so please, just spice to taste] and cut back on the lemon, which had a very pronounced flavor. In every other way though, crust included, this recipe is a keeper."
    ],
    "date": "2006-11-23T12:28:36+00:00"
  },
  {
    "ingredient_list": [],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/05/corfu-sils-and-timelines1.jpg?w=500",
    "tags": ["Apple", "Cake", "Everyday Cakes", "Fruit", "Photo", "Spanish"],
    "url": "https://smittenkitchen.com/2007/09/corfu-sils-and-timelines/",
    "title": "grandmothers of sils’ apple-yogurt cake",
    "directions": [
      "1. Position rack in the center of the oven and preheat the oven to 350°F. Butter and flour and 9-inch springform pan.",
      "2. Sift the flour and baking powder together in a bowl. Place the eggs and granulated sugar in a large mixing bowl and, using an electric mixer, beat until fluffy and pale yellow, about 1 minute. Beat in the yogurt and liqueur until completely smooth. Working in batches, beat in the sifted flour, alternating it with the olive oil. Gently but thoroughly fold in the apples.",
      "3. Scrape the batter into the prepared springform pan, tap it on a counter to level the batter, then smooth the top with an offset spatula. Bake the cake on the center rack until the top is golden, a cake tester or toothpick inserted into the center comes out clean**, and the cake springs back when you touch it, 55 to 65 minutes. Let the cake cool on a rack.",
      "4. Run a thin knife around the side of the cake to loosen it. Remove the side and the bottom of the pan, then place the cake on a cake platter. (The cake can be baked up to 3 days ahead.) Wrap it loosely in plastic until ready to use. Serve the cake sprinkled with confectioners’ sugar, accompanied by creme fraiche, if desired. ",
      "* For serious! I can’t tell you how many lemon yogurts I picked up at my totally yuppie gourmet grocery store before finding a single one with real, actual lemon in it and not artificial flavoring. I’m not naming names, but there were brands that I really expected better from. I finally landed on Stoneybrook Farms low-fat with lemon puree on the bottom. Why I went through this trouble when I could have just, uh, squeeze lemon juice into a plain yogurt, I don’t know. But just to warn that if you’re going through the effort of making a cake from scratch, you might want to make sure your lemon yogurt is the real deal. ",
      "** For some reason, this never happened for me. Well beyond the baking time (though my oven runs a little cool) the toothpick was still coming out with some damp crumbs attached while the top was golden and springy, so I took it out. It was cooked just fine in the center, so if this happens to you, don’t worry. "
    ],
    "date": "2007-09-12T17:12:30+00:00"
  },
  {
    "ingredient_list": [
      "Topping",
      "4 tablespoons butter, plus extra for greasing pan",
      "1/2 cup dark brown sugar",
      "Pinch of salt",
      "4 apples (about 1 3/4 pounds), peeled, cored and cut into 1/4-inch wedges",
      "Batter",
      "1/2 cup (1 stick or 4 ounces) butter, at room temperature",
      "1/2 cup sugar",
      "1 large egg",
      "1/3 cup dark molasses",
      "1/3 cup honey",
      "1 cup buttermilk",
      "2 1/4 cups flour",
      "1 teaspoon baking soda",
      "1/2 teaspoon salt",
      "1 teaspoon ground ginger",
      "1 teaspoon cinnamon"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2009/11/gingerbread-upside-down-apple-cake.jpg?w=750",
    "tags": ["Apple", "Cake", "Fall", "Photo", "Thanksgiving", "Winter"],
    "url":
      "https://smittenkitchen.com/2009/11/gingerbread-apple-upside-down-cake/",
    "title": "gingerbread apple upside-down cake",
    "directions": [
      "Very softly whipped cream",
      "Make the topping: Preheat the oven to 325°F. Grease a 10-inch cake pan. Melt butter in a small saucepan. Add brown sugar and simmer over moderate heat, stirring, four minutes, then swirl in salt. Remove from heat and pour into the bottom of your cake pan. Make circles of overlapping apple slices on top of the caramel. Chop any remaining slices and place them in the gaps.",
      "Make the batter: Using a mixer, blend 1/2 cup butter and the sugar on medium-low speed. Increase the speed to high and cream until light and fluffy.",
      "In a medium bowl, whisk together the egg, molasses, honey and buttermilk. In a separate bowl, sift together the flour, baking soda, salt, ginger and cinnamon. Alternate mixing the flour and molasses mixtures into the butter mixture, adding the next once the last has been incorporated.",
      "Pour the batter into the pan. Bake at least 45 to 50 minutes (thanks to commenter klp for reminding me this took a bit longer)  or until a wooden tester inserted into the center of the cake comes out clean. Let cool on a rack for 10 to 15 minutes, then turn out onto a platter (one that will catch spills, unlike what you see in the pictures above).",
      "Serve warm or cool with very softly whipped cream."
    ],
    "date": "2009-11-23T21:32:39+00:00"
  },
  {
    "ingredient_list": [],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/05/lemon-ricotta-pancakes-with-sauteed-apples11.jpg?w=640",
    "tags": [
      "Apple",
      "Breakfast",
      "Brunch",
      "Citrus",
      "Fruit",
      "Lemon",
      "Pancakes",
      "Photo"
    ],
    "url":
      "https://smittenkitchen.com/2007/11/lemon-ricotta-pancakes-with-sauteed-apples/",
    "title": "lemon ricotta pancakes with sauteed apples",
    "directions": [
      "Serve the pancakes with the sauteed apples and the maple syrup. "
    ],
    "date": "2007-11-03T21:57:43+00:00"
  },
  {
    "ingredient_list": [
      "1/2 cup (115 grams or 4 ounces) unsalted butter",
      "1 cup (130 grams)  all-purpose flour",
      "1 cup (200 grams) sugar, divided",
      "1 1/2 teaspoons baking powder",
      "1/2 teaspoon fine sea or table salt",
      "3/4 cup (175 ml) whole milk",
      "2 medium apples, peeled",
      "3 small (I used Italian prune plums) or 2 medium plums, no need to peel",
      "3/4 teaspoon ground cinnamon"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2016/09/magic-apple-plum-cobbler1.jpg?w=750",
    "tags": ["Apple", "Crumbles/Crisps", "Fall", "Photo", "Plum", "Summer"],
    "url": "https://smittenkitchen.com/2016/09/magic-apple-plum-cobbler/",
    "title": "magic apple plum cobbler",
    "directions": [
      "Heat your oven to 350°F. Place butter in a 2 to 3-quart (3 was recommended, but I had a lot of extra space) baking dish or a 7×11-inch cake pan. Place pan in oven for 5 to 7 minutes, until butter has melted. Tilt the dish to ensure it is evenly coated with butter.\nWhisk together the flour, 3/4 cup sugar, baking powder and salt in a small bowl and stir in milk. Mix until smooth. Pour batter over the butter but do not stir, even if it looks like a puddle-y buttery mess.",
      "Cut apples into 8 wedges, small plums into 4 wedges and medium ones into 4 to 6. Space fruit over batter. Sprinkle with cinnamon and then remaining sugar.",
      "Bake the cobbler until it is set and golden on top, 35 to 40 minutes. Cool slightly on a rack. Serve the cobbler warm or at room temperature.\n"
    ],
    "date": "2016-09-16T12:07:20+00:00"
  },
  [
    {
      "ingredient_list": [
        "2 firm tart apples (1 pound or 2 454 grams)",
        "1 1/2 cups (6.75 ounces or 195 grams) all-purpose flour",
        "1/4 cup sugar plus 1 1/2 tablespoons for sprinkling (total of 2.2 ounces or 63 grams)",
        "1/2 tablespoon (7 grams) baking powder",
        "1/2 teaspoon salt (3 grams) plus additional for egg wash",
        "6 tablespoons (3 ounces or 85 grams)unsalted butter, chilled and cut into 1/2-inch cubes plus additional for baking sheet if not lining it with parchment",
        "1/2 cup (2.25 ounces or 65 grams) sharp cheddar, shredded (white is recommended, I assume for aesthetics)",
        "1/4 cup (2 ounces) heavy cream",
        "2 large eggs"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2010/10/5079390141_db09235efb_o.jpg?w=749",
      "title": "apple and cheddar scones",
      "url": "https://smittenkitchen.com/2010/10/apple-and-cheddar-scones/",
      "tags": [
        "Apple",
        "Cheese",
        "Fall",
        "Muffin/Quick Bread",
        "Photo",
        "Scones/Biscuits"
      ],
      "date": "2010-10-15T14:09:55+00:00",
      "directions": [
        "Position a rack at the center of oven and preheat oven to 375 °F. Line baking sheet with parchment paper.",
        "Peel and core apples, then cut them into one-sixteenths. (I assumed this meant chunks, not slivers.) Placed them in a single layer on a baking sheet lined with parchment paper and bake them until they take on a little color and feel dry to the touch, about 20 minutes. They will be about half-baked. Let them cool completely. (You can speed this up in the fridge, as I did.) Leave oven on.",
        "Sift or whisk flour, sugar, baking powder and salt together. Set aside. Place butter in the bowl of an electric mixer with a paddle attachment, along with cooled apple chunks, cheese, cream and one egg. Sprinkle flour mixture over the top and mix on low speed until the dough just comes together. Do not overmix.",
        "[Don’t have a stand or hand mixer? I’d rub the cold butter into the flour mixture with my fingertips or with a pastry blender, hand-chop the apples coarsely and mix the rest together with a wooden spoon until combined. It might feel awkward, but it should all come together. Again, don’t overmix it though it will be harder to do this by hand.]",
        "Generously flour your counter top and place the scone dough on top of it. Sprinkle with flour. Use a rolling pin to gently roll (or use your hands to pat) the dough into a 1 1/4-inch thick, 6-inch circle. Cut circle into 6 wedges. Transfer them to a baking sheet that has either been buttered or lined with a fresh sheet of parchment paper. Leave at least 2 inches between each scone.",
        "Beat remaining egg in a small bowl with a pinch of salt. Brush the scones with egg wash and sprinkle them with remaining tablespoon of sugar. Bake until firm and golden, about 30 minutes. With a spatula, lift them to a wire rack to cool for 10 minutes. Before you eat one, make sure you realize how addictive they might be. Once you’ve got that down, go for it anyway.",
        "Do ahead: Scones are best the day they are baked. However, they can be made ahead of time and stored unbaked in the freezer until you need them. Simply brush them with the egg wash and sprinkle them with sugar, and bake them still frozen for just a couple extra minutes. This way they are always freshly baked when you want them. These scones were passable on day two and terrible on day three. "
      ]
    },
    {
      "ingredient_list": [
        "6 cups torn chunks French, sourdough or country loaf, torn into bits (I use 2 7-ounce demi-baguettes)",
        "5 tablespoons unsalted butter",
        "1 large Spanish or sweet onion, chopped small",
        "1 large or 2 small stalks celery, diced small",
        "1 teaspoon chopped fresh thyme leaves",
        "1/2 teaspoon table salt, plus more to taste",
        "Freshly ground black pepper",
        "1 large or 2 small firm, tart tart apples, such as Granny Smith, peeled, cored and diced small",
        "1/4 cup roughly chopped flat-leaf parsley",
        "3 sage leaves, minced",
        "1/2 to 1 cup cup turkey, chicken or vegetable stock or broth",
        "1 large egg"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2014/11/apple-herb-stuffing-for-all-seasons1.jpg?w=640",
      "title": "apple-herb stuffing for all seasons",
      "url":
        "https://smittenkitchen.com/2013/11/apple-and-herb-stuffing-for-all-seasons/",
      "tags": [
        "Apple",
        "Bread",
        "Celery",
        "Photo",
        "Put An Egg On It",
        "Side Dish",
        "Thanksgiving"
      ],
      "date": "2013-11-19T12:04:08+00:00",
      "directions": [
        "Position rack in center of oven and preheat to 350°F. Spread bread cubes in single layer on large rimmed baking sheet. Bake until pale golden, stirring occasionally, 10 to 15 minutes. Let cool in pan while you prepare the other ingredients. ",
        "Generously butter a 2-quart baking dish (a 9×5-inch loaf, 8- or 9-inch square dish, etc.) with 1 tablespoon butter. Melt remaining 4 tablespoons butter in large skillet over medium heat. Add onion, thyme, salt and lots of freshly ground black pepper and cook for 2 minutes, until becoming translucent. Add celery and cook for 2 more minutes. Add apple and saute until a bit tender, 3 to 4 minutes more. ",
        "Place bread in large mixing bowl. Scrape contents of skillet on top. Whisk egg and 1/2 cup broth or stock together and pour over. Stir in parsley and sage. Spoon into prepared pan. If mixture looks a little dry, pour remaining 1/2 cup broth over it. [This is a good place to pause, if needed. Nothing bad comes of the stuffing absorbing the liquids for longer.] Bake for 30 to 40 minutes, until brown on top and no liquid appears if you insert a knife vertically into the center of the stuffing pan and turn it slightly. Serve immediately, or reheat as needed.",
        "* On a technical note, I insist upon calling stuffing what is actually dressing, even though I know it is wrong. Although they use the same recipes, stuffing goes inside the bird, dressing is baked outside, and I insist that it is better outside the bird. When making stuffing to, uh, stuff, uh, places, one must cook the bird to a higher-than-normal temperature to ensure that the stuffing inside is free from undercooked poultry drippings. Seeing as most turkey is dry enough, I see no point in helping it along. ",
        "Variations:"
      ]
    },
    {
      "ingredient_list": [],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-and-honey-challah1.jpg?w=500",
      "title": "apple and honey challah",
      "url": "https://smittenkitchen.com/2011/09/apple-and-honey-challah/",
      "tags": ["Apple", "Bread", "Jewish", "Photo"],
      "date": "2011-09-28T22:14:27+00:00",
      "directions": [
        "Make your dough: Whisk yeast and 1 teaspoon honey into 2/3 cup warm water and let stand until foamy, a few minutes.",
        "With a stand mixer: In the bowl of a stand mixture, whisk together yeast mixture, oil, remaining honey (1/3 cup), eggs and yolk. Switch to dough hook and add 4 1/4 cups flour and salt. Use dough hook on a moderate speed until it pulls all of the flour and wet ingredients together into a craggy mass. Lower the speed and let the dough hook knead the dough for 5 minutes, until smooth, elastic and a little sticky.",
        "By hand:: In a large bowl, whisk together yeast mixture, oil, remaining honey (1/3 cup), eggs and yolk. Add flour all at once and stir with a wooden spoon until you get a craggy mass of uneven dough. Turn dough out onto a floured counter and knead it into a smooth, elastic dough, about 5 to 8 minutes. Try to use as little flour as necessary when kneading the dough; you don’t want to toughen the bread. A bench scraper can make it really easy to remove it from the counter if it gets stuck in a spot. [More bread tips here.]",
        "Both methods: Transfer dough to large oil-coated bowl, cover with plastic wrap and set aside for 1 hour, or until almost doubled in size.",
        "Add apples to dough: [See photos in post.] Turn dough out onto a floured counter and gently press it down into a flat, oblong shape. The shape does not matter so however it goes, it goes. Spread 2/3 of apple chunks over 1/2 of the flattened dough. Fold the other half over the apple chunks and press the dough down around them, flattening the now lumpy dough. Spread the remaining 1/3 apple chunks over half the folded dough. Fold the other half over the apples, pressing the dough down again. Your dough packet will likely be square-ish. Fold the corners under with the sides of your hands and form the dough into a round.  Upend your empty bowl over and set it aside for another 30 minutes.",
        "Weave your bread: [See photos in post.] Divide dough into 4 pieces. Roll and stretch each one as carefully as you can into a rope — don’t worry about getting it too long or thin, just 12 inches or so should do. If any apple chunks fall out as you form the ropes or at any other time in the forming of the loaf or risings, just poke them back in with your finger.",
        "Arrange two strands in each direction, perpendicular to each other, like a plus sign. Weave them so that one side is over, and the other is under, where they meet. So, now you’ve got an 8-legged woven-headed octopus. Take the four legs that come from underneath the center and move them over the leg to their right, i.e. jumping it. Take those legs that were on the right and again, jump each over the leg before, this time to the left. If you had extra length to your ropes, you can repeat these left-right jumps until you run out of rope. For me, this was enough. Just as you had with the folded packet of apple dough above, tuck the corners/odd bumps under the dough with the sides of your hands to form a round.",
        "Transfer the dough to a parchment-covered heavy baking sheet or baker’s peel (if you’ll be using a bread stone). Beat egg until smooth and brush over challah. Let challah rise for another hour but 45 minutes into this rise, preheat your oven to 375 degrees.",
        "Bake your loaf: Before baking, brush loaf one more time with egg wash and sprinkle with coarse sugar if you’re using it. Bake in middle of oven for 40 to 45 minutes. It should be beautifully bronzed; if yours (like mine, except I didn’t catch it in time) starts getting too dark too quickly, cover it with foil for the remainder of the baking time. The very best way to check for doneness in any bread but especially on like this where the wetness of the apples can slow down the baking time a bit, is with an instant read thermometer — the center of the loaf should be 195 degrees.",
        "Cool loaf on a rack before serving. Or, well, good luck with that. "
      ]
    },
    {
      "ingredient_list": [
        "1 cup apple cider (the fresh kind, not the fizzy alcoholic kind)",
        "1 bottle dry white wine",
        "1/4 cup calvados or another apple brandy",
        "1/4 cup Triple sec or another orange liqueur",
        "Mixed colors of apples, diced and tossed with lemon juice to prevent browning",
        "Seltzer, sparkling water or sparkling apple cider to finish"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/11/apple-cider-sangria1.jpg?w=750",
      "title": "apple cider sangria",
      "url": "https://smittenkitchen.com/2015/11/apple-cider-sangria/",
      "tags": ["Apple", "Drinks", "Photo", "Thanksgiving"],
      "date": "2015-11-06T11:58:45+00:00",
      "directions": [
        "Place the apple cider in a small saucepan and bring to a boil over high heat. Reduce about 3/4 of the way, until you have approximately 1/4 cup apple cider left; this will take 10 to 15 minutes. Pour into small bowl set over a bowl of ice water and stir; it will cool very quickly this way.",
        "Pour reduced, cooled cider into pitcher. Add wine, apple brandy and triple sec. Add fruit and let sit in the fridge until needed. Add some fizz right before serving; a slotted spoon will help guests hold back the fruit while pouring their glasses, and spoon some on top, if desired."
      ]
    },
    {
      "ingredient_list": [
        "Topping:",
        "1 teaspoon aniseed",
        "1 1/2 cups pastry flour",
        "3/4 cup polenta (coarse cornmeal)",
        "1/2 cup sugar",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 large egg, beaten to blend",
        "Filling:",
        "2 cups fresh cranberries",
        "White sugar–original recipe calls for 2/3 cup, I’d suggest 1/3 cup or omitting it entirely",
        "2/3 cup (packed) golden brown sugar",
        "2 teaspoons finely grated lemon peel",
        "1 1/2 teaspoons finely grated orange peel",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "2 pounds Granny Smith apples, peeled, cored, cut into 1-inch cubes",
        "2 tablespoons fresh lemon juice",
        "Vanilla gelato or ice cream"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-cranberry-crisp1.jpg?w=500",
      "title": "apple cranberry crisp",
      "url": "https://smittenkitchen.com/2007/12/apple-cranberry-crisp/",
      "tags": [
        "Apple",
        "Cranberries",
        "Crumbles/Crisps",
        "Disasters",
        "Fruit",
        "Photo"
      ],
      "date": "2007-12-13T15:15:50+00:00",
      "directions": [
        "For topping: Toast aniseed in small skillet over medium heat until slightly darker in color, about 3 minutes. Place seeds in processor. Add next 5 ingredients; blend 5 seconds. Add butter; blend, using on/off turns, until mixture resembles coarse crumbs. Transfer mixture to large bowl. Drizzle egg over and stir until ingredients are evenly moistened.",
        "For filling: Preheat oven to 375°F. Combine first 8 ingredients in large bowl; stir to blend. Add apples and lemon juice; toss to blend. Transfer filling to 11x7x2- inch glass baking dish (or other shallow 2-quart baking dish).",
        "Crumble topping finely over filling. Bake dessert until apples are tender, juices bubble thickly, and topping is crisp and golden, about 1 hour. Cool 15 minutes. Serve crisp warm with gelato."
      ]
    },
    {
      "ingredient_list": [
        "1 pound tart, firm apples such as Granny Smiths (2 large or 3 medium)",
        "1 tablespoon lemon juice",
        "6 tablespoons all-purpose flour",
        "1 tablespoon granulated sugar",
        "1/4 teaspoon cinnamon",
        "1 teaspoon baking powder",
        "2 large eggs",
        "Butter (I used about 2 tablespoons)",
        "Rich plain yogurt, sour cream or crème fraîche for serving"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2010/11/apple-latkes.jpg?w=750",
      "title": "apple latkes",
      "url": "https://smittenkitchen.com/2010/11/apple-latkes/",
      "tags": ["Apple", "Hanukah", "Jewish", "Pancakes", "Photo"],
      "date": "2010-11-30T17:17:28+00:00",
      "directions": [
        "In a small saucepan, simmer the apple juice until it is reduced by half. Add the sugar and continue to cook it until it becomes a golden brown/amber color. Add the butter and once it melts, the heavy cream and salt. Simmer for one minute and serve, with or without apple latkes."
      ]
    },
    {
      "ingredient_list": [
        "Tart base",
        "14-ounce package puff pastry, defrosted in fridge overnight",
        "3 large or 4 medium apples (about 1 1/4 pounds)",
        "2 tablespoons granulated sugar",
        "2 tablespoons unsalted butter, cold, cut into small bits",
        "Salted caramel glaze",
        "1/4 cup granulated sugar",
        "2 tablespoons unsalted butter (or salted, but then ease up on the sea salt)",
        "1/4 teaspoon flaky sea salt (or half as much table salt)",
        "2 tablespoons heavy cream"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2012/10/apple-mosaic-tart-with-salted-caramel.jpg?w=750",
      "title": "apple mosaic tart with salted caramel",
      "url":
        "https://smittenkitchen.com/2012/10/apple-mosaic-tart-with-salted-caramel/",
      "tags": ["Apple", "Fall", "Photo", "Tarts/Pies"],
      "date": "2012-10-19T11:38:05+00:00",
      "directions": [
        "Heat your oven to 400°F. Line a rimmed baking sheet or jelly roll pan with parchment paper. Ideally you would use a 10×15-inch jelly roll pan, as I do here. A smaller pan will make a thicker tart (and you might need fewer apples). In a larger pan, you can still fit a 10×15-inch tart, which I think is the ideal size here. ",
        "Lightly flour your counter and lay out your pastry. Flour the top and gently roll it until it fits inside your baking sheet, and transfer it there. Try not to roll it any bigger than you’ll need it, or you’ll have to trim, which means you’ll have to sprinkle the trimmings with cinnamon-sugar and bake them into cookie-sized segments for snacks. And that would be terrible.",
        "Peel the apples and cut them in half top-to-bottom. Remove the cores and stems (I like to use a melon baller and/or a pairing knife). Slice the apples halves crosswise as thinly as you can with a knife, or to about 1/16-inch thickness with a mandoline. Leaving a 1/2-inch border, fan the apples around the tart in slightly overlapping concentric rectangles — each apple should overlap the one before so that only about 3/4-inch of the previous apple will be visible — until you reach the middle. Sprinkle the apples evenly with the first two tablespoons of sugar then dot with the first two tablespoons butter. ",
        "Bake for 30 minutes, or until the edges of the tart are brown and the edges of the apples begin to take on some color. If you sliced your apples by hand and they were on the thicker side, you might need a little more baking time to cook them through. The apples should feel soft, but dry to the touch. If you puffed pastry bubbles dramatically in any place during the baking time, simply poke it with a knife or skewer so that it deflates. This is fun, I promise.",
        "Meanwhile, about 20 minutes into the baking time, make your glaze. In a small saucepan over medium-high heat, melt your last 1/4 cup sugar; this will take about 3 minutes. Cook the liquefied sugar to a nice copper color, another minute or two. Off the heat, add the sea salt and butter and stir until the butter melts and is incorporated. Add the heavy cream and return to the stove over medium heat. Cook, stirring constantly, until you have a lovely, bronzed caramel syrup, just another minute, two, tops. Set aside until needed. You may need to briefly rewarm it to thin the caramel before brushing it over the tart.",
        "After the tart has baked, transfer it to a cooling rack, but leave the oven on. Using very short, gentle strokes, and brushing in the direction that the apples fan to mess up their design as little as possible, brush the entire tart, including the exposed pastry, with the salted caramel glaze. You might have a little leftover. Whatever you do, do not spread it on a sliced apple for a snack. Trust me. ",
        "Return the apple tart to the oven for 5 to 10 more minutes, until the caramel glaze bubbles. Let tart cool complete before cutting into 12 squares. Serve plain, with coffee or tea, if you’re feeling grown-up or with a scoop of vanilla ice cream, if you’re feeling particularly indulgent."
      ]
    },
    {
      "ingredient_list": [
        "2 eggs, well beaten",
        "1 1/2 cups of milk or yogurt (I used milk and am only assuming that the yogurt will work as well)",
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/4 cup sugar",
        "3 medium apples, peeled and coarsely grated (I used yellow delicious, but will use a more tart variety next time)",
        "Extra flavorings (see recipe notes)",
        "Vegetable oil, for frying",
        "Confectioner’s sugar, for dusting"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-pancakes1.jpg?w=500",
      "title": "apple pancakes",
      "url": "https://smittenkitchen.com/2008/11/apple-pancakes/",
      "tags": ["Apple", "Breakfast", "Fall", "Fruit", "Pancakes", "Photo"],
      "date": "2008-11-09T22:27:47+00:00",
      "directions": [
        "1. Mix the eggs with the milk or yogurt in a large bowl.",
        "2. In a smaller bowl, whisk the flour, baking powder, salt and sugar together.",
        "3. Combine the wet and the dry ingredients and stir in the apples and whatever other flavorings you see fit.",
        "4. Heat a thin layer of oil in a skillet over low to medium heat. Drop large spoonful of batter into the pan and flatten it out a little (otherwise, you might have trouble getting them to cook in the center) and cook until golden brown underneath. Flip the pancakes and cook them for an additional two or three minutes.",
        "5. Either dust with powdered sugar and serve immediately, or keep on a tray in a warmed oven until you are ready to serve them."
      ]
    },
    {
      "ingredient_list": [
        "Crust",
        "2 1/2 cups (313 grams) all-purpose flour, plus more for dusting surfaces, dipping fork",
        "2 tablespoons (25 grams) granulated sugar (doubled from my standard pie dough to make this more cookie-like)",
        "1 teaspoon (4 grams) table salt",
        "2 sticks (225 grams, 8 ounces, 16 tablespoons or 1 cup) unsalted butter, very cold",
        "1/2 cup (118 ml) water, very cold (I pour 1 cup and add ice while I work, then measure 1/2 cup from it when I need it)",
        "Filling",
        "3 medium apples, whatever you like to bake with",
        "Squeeze of lemon juice (optional)",
        "1/3 cup (67 grams) granulated sugar",
        "1 teaspoon (2 grams) ground cinnamon",
        "Few gratings fresh nutmeg",
        "A pinch of any other spices you like in your apple pie",
        "To finish",
        "1 large egg",
        "Coarse or granulated sugar for garnish",
        "Additional stuff",
        "A couple baking sheets covered with parchment paper",
        "Rolling pin, pastry brush (for egg wash), fork (for crimping and dipping) and sharp knife (to make slits)",
        "Two round cookie cutters of different sizes. I used 2 1/2-inch and 1 1/2 to 1 3/4-inch rounds. You’ll want to make sure there’s at least a 3/4-inch different in the sizes, as you’ll need the extra margin to crimp your dough. "
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2011/10/apple-pie-cookies2.jpg?w=751",
      "title": "apple pie cookies",
      "url": "https://smittenkitchen.com/2011/10/apple-pie-cookies/",
      "tags": ["Apple", "Cookie", "Fall", "Photo", "Picnics", "Tarts/Pies"],
      "date": "2011-10-13T09:37:45+00:00",
      "directions": [
        "Make your pie dough: Whisk together flour, sugar and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of small peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I did.) Gently stir in the ice water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough in half. Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days. [Even more detailed pie dough instructions in this post, check it out!]",
        "Meanwhile, get everything else together: Line up six small dishes. In the first one, pour some water. Leave the second one empty; you’ll use it for your apples in a bit. In the third one, mix the sugar, cinnamon, nutmeg and any other spices you like in your pie, such as a pinch of cloves. In the fourth one, place a little bit of flour to dust your surface and dip your fork for crimping. In the fifth one, whisk an egg with one teaspoon of water until smooth. In the last one, or in whatever container you keep it in, add some coarse or regular sugar for decorating the tops of the pies. You are very likely thinking I’ve lost my mind by now and you may not be terribly far off.  ",
        "On a well-floured counter, roll out your pie dough pretty thin, a little shy of 1/8-inch thick. Lift and rotate your dough as you roll it, to ensure that it rolls out evenly and so you can be sure it’s not sticking in any place. [More rolling tips here!] Use the larger of your two cookie cutters [mine was 2 1/2-inch) to cut as many rounds as you can from the dough. Transfer them to parchment-lined baking sheets and keep them in the fridge until you need them. Once you’ve finished the first packet, repeat the process with the second packet of dough",
        "Prepare your apples: Peel your apples. Cut thin (1/8-inch thick) slices from one side of whole apple, stopping when you hit the core. Repeat on opposite side. I got about 10 usable slices from each side of my small-medium-ish apples. Use the smaller of your two cookie cutters (mine was about 1 2/3 inches) to cut the apples into cute little discs that will fit inside your pie cookies. Place them in your second bowl, covering them with a few drops of lemon juice if you find that they’re browning quickly.",
        "Preheat oven to 350 degrees.",
        "And now, assemble away! Grab your first disc of chilled dough and lightly dampen it on one side with the water. This is to help it seal. Take your first disc of apple and toss it in the cinnamon spice sugar. Place it on the damp side of the bottom disk. Place a second disc of dough on top; I found it easiest to seal it by picking the whole thing up (this is when you’ll be glad that your dough is cold and semi-firm; if it’s soft and getting sticky, chill it until it’s easy to pick up) and press the tops and bottoms around the apple with your fingers. Back on the floured counter, cut decorative slits in your “pies”. Dip your fork in the flour and use it to create a decorative crimp on the sealed edges. Brush your cookie with egg wash and sprinkle with coarse sugar. Replace on baking sheet and chill while you prepare the others. About now, you’ll curse your friendly food blogger for getting you into such an exacting cookie making process but I promise, the first couple are slow and the rest come together very quickly.",
        "Bake your apple pie cookies for 25 minutes, or until puffed and bronzed and very pie-like. (If this is your first batch, peer in at them at 20 minutes, to make sure your oven doesn’t run hot.) Transfer to a cooling rack to cool before eating them… oh haha. I forgot who I was talking to.",
        "Do ahead: These will keep for a few days at room temperature, though not in my apartment. You could also make a larger batch of these, doing everything but brushing them with egg and sprinkling them with sugar, and keep them frozen until needed. Bake them directly from the freezer, just adding a couple minutes to the baking time."
      ]
    },
    {
      "ingredient_list": [],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2012/01/apple-sharlotka.jpg?w=750",
      "title": "apple sharlotka",
      "url": "https://smittenkitchen.com/2012/01/apple-sharlotka/",
      "tags": ["Apple", "Everyday Cakes", "Photo", "Russian"],
      "date": "2012-01-06T15:05:00+00:00",
      "directions": [
        "Preheat oven to 350 degrees. Line the bottom of a 9-inch springform pan with parchment paper. Butter the paper and the sides of the pan. Peel, halve and core your apples, then chop them into medium-sized chunks. (I cut each half into four “strips” then sliced them fairly thinly — about 1/4-inch — in the other direction.) Pile the cut apples directly in the prepared pan. Meanwhile, in a large bowl, using an electric mixer or whisk, beat eggs with sugar until thick and ribbons form on the surface of the beaten eggs. Beat in vanilla, then stir in flour with a spoon until just combined. The batter will be very thick.",
        "Pour over apples in pan, using a spoon or spatula to spread the batter so that it covers all exposed apples. (Updated to clarify: Spread the batter and press it down into the apple pile. The top of the batter should end up level with the top of the apples.) Bake in preheated oven for 55 to 60 minutes, or until a tester comes out free of batter. Cool in pan for 10 minutes on rack, then flip out onto another rack, peel off the parchment paper, and flip it back onto a serving platter. Dust lightly with ground cinnamon.",
        "Serve warm or cooled, dusted with powdered sugar. Alex’s family eats it plain, but imagine it would be delicious with a dollop of barely sweetened whipped or sour cream."
      ]
    },
    {
      "ingredient_list": [
        "Crust",
        "3 3/4 (470 grams) cups all-purpose flour",
        "1 1/2 tablespoons sugar",
        "1 1/2 teaspoons table salt",
        "3 sticks (340 grams) unsalted butter, very cold",
        "3/4 cup very cold water",
        "Filling",
        "3 1/2 to 4 pounds apples, peeled, cored and chopped into approximately 1/2-inch chunks (about 8 cups)",
        "Squeeze of lemon juice",
        "2/3 to 3/4 cup sugar (depending on how sweet you like your pies)",
        "3 tablespoons cornstarch",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground allspice",
        "1/8 teaspoon table salt",
        "To finish",
        "2 tablespoons heavy cream or one egg, beaten with 1 tablespoon of water",
        "Glaze (optional)  (only need half, barely, for what’s in photos)",
        "1/2 cup confectioners’ sugar",
        "1 tablespoon milk, water, lemon juice or fresh apple cider, plus a drop or two more if needed"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2014/10/apple-slab-pie1.jpg?w=640",
      "title": "apple slab pie",
      "url": "https://smittenkitchen.com/2013/10/apple-slab-pie/",
      "tags": ["Apple", "Fall", "Photo", "Tarts/Pies", "Thanksgiving"],
      "date": "2013-10-25T11:20:46+00:00",
      "directions": [
        "Make pie crust: Whisk together flour, sugar and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in the water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough roughly in half (it’s okay if one is slightly larger). Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day. [Still freaked out about making your own pie dough? Read this for a ton of additional tips and details.]",
        "Heat oven  oven to 375 degrees F. Line bottom of 10x15x1-inch baking sheet or jellyroll pan with parchment paper.",
        "Prepare filling: In a large bowl, toss apples with lemon juice until coated. Top with remaining filling ingredients and stir to evenly coat. ",
        "Assemble pie: On a lightly floured surface, roll one of your dough halves (the larger one, if you have two different sizes) into an 18-by-13-inch rectangle. This can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible and using enough flour that it doesn’t stick to the counter. Transfer to your prepared baking sheet and gently drape some of the overhang in so that the dough fills out the inner edges and corners. Some pastry will still hang over the sides of the pan; trim this to 3/4-inch. ",
        "Pour apple mixture over and spread evenly. ",
        "Roll the second of your dough halves (the smaller one, if they were different sizes) into a 16-by-11-inch rectangle. Drape over filling and fold the bottom crust’s overhang over the edges sealing them together. Cut small slits to act as vents all over lid. Brush lid heavy cream or egg wash. Bake until crust is golden and filling is bubbling, 40 to 45 minutes. Transfer to a wire rack until just warm to the touch, about 45 minutes.",
        "In a medium bowl, stir together confectioners’ sugar and liquid of your choice until a pourable glaze consistency is reached. Use a spoon to drizzle over top. Serve slab pie in squares or rectangles, warm or at room temperature. ",
        "It keeps at room temperature for at least three days."
      ]
    },
    {
      "ingredient_list": [
        "1/2 cup (80 grams) raisins",
        "2 tablespoons (30 ml) dark rum",
        "1 cup plus 3 tablespoons (150 grams) all-purpose flour, plus more for dusting",
        "Pinch of salt",
        "3 tablespoons (45 ml) sunflower, safflower or another neutral oil",
        "1/3 cup (80 ml) water",
        "2 pounds (905 grams) firm apples (about 5 to 6)",
        "Juice of 1 lemon",
        "1/3 cup (65 grams) granulated sugar or vanilla sugar (see note above)",
        "1/2 teaspoon ground cinnamon (optional)",
        "8 tablespoons (115 grams) unsalted butter, divided",
        "3/4 cup (40 grams) plain, unseasoned dried breadcrumbs (I used, and recommend, panko, see note above)",
        "1 tablespoon granulated sugar or vanilla sugar",
        "1/8 teaspoon salt",
        "Confectioners’ sugar, for dusting",
        "Lightly sweetened whipped cream or vanilla ice cream, for serving"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2016/11/apple-strudel-apfelstrudel.jpg?w=750",
      "title": "apple strudel",
      "url": "https://smittenkitchen.com/2016/11/apple-strudel/",
      "tags": ["Apple", "Austrian", "Cake", "Fall", "German", "Photo"],
      "date": "2016-11-04T12:07:27+00:00",
      "directions": [
        "Prepare the raisins: The day before, combine the raisins and the rum in a small bowl and cover; set aside for 24 hours. However, should you be reading this and want to make it right now, I found microwaving the two together for 10 to 15 seconds and setting them aside until you’re ready to mix the filling allowed them to absorb almost as well.\nMake the dough: The day of, combine the flour and salt in a medium bowl. Add the oil and water and mix with a spoon or your index finger until a rough dough forms. Turn it out onto a very lightly floured counter and knead for 10 minutes. It sounds like it will be forever, but set a timer and chat with a friend, it goes quickly. After 10 minutes, the dough should be soft and silky to the tough. Form it into a ball, place it on the counter and upend the mixing bowl over it. Set aside for 30 minutes.\nMeanwhile, prepare the apples: Peel, halve, core and slice thin in one direction, then halve the slices crosswise, creating thin squarish rectangles of apples. Place them in a large bowl and toss with lemon juice, sugar and cinnamon, if using. Add the raisins and any rum left in the bowl.\nPrepare the breadcrumbs: In a small skillet over medium-low heat, melt 3 tablespoons butter and add the breadcrumbs, sugar and salt. Stir to coat and cook, stirring frequently as they can burn quickly, until crumbs are an even golden brown and very fragrant. Don’t let them burn. Scrape into a dish (or they’ll keep cooking in the pan) and set aside.\nHeat your oven to 400 degrees F (200 degrees C). Line 1 large or 2 smaller baking sheets with parchment paper.\nMelt the remaining 5 tablespoons butter in a small dish.\nRoll out your dough (these directions are for a full-sized strudel): Cover your work surface with a cleaning linen towel or sheet that’s at least 24-by-32 inches. The long side should be horizontal. Sprinkle the cloth lightly with flour. Place the dough in the middle, sprinkle it very lightly with flour and roll in both directions until it’s about 10-by-13 inches, or about as far as the rolling pin can take it. Make sure the dough hasn’t stuck to the cloth; reflour if it has. Now the stretching begins! Ball your hands to loose fists, put them under the rolled-out dough and gently start stretching the dough using the back of your hands. Alternate with pulling the dough gently with your fingers to continue stretching it, stretching the edges thin too. This is all much easier than it sounds, but be patient. If holes form, pinch the dough back together. Continue stretching until the dough is about 16-by-24 inches.",
        "Assemble strudel: Brush evenly with about half the melted butter. On the right side of the rectangle, a few inches from the end, spread the breadcrumbs top to bottom in a thick line, leaving a little more than an inch margin at the top and bottom of the strip. Scoop the apples with a slotted spoon, leaving any accumulated juices in the bowl, and pile them over the crumbs. Gently pull the top and bottom edges of the dough over the apple mixture. Pull the right edge of the dough up and over the filling as far as it will go without tearing. Working carefully, use the towel to roll up the strudel all the way. Place the parchment paper from your baking sheet at the edge of the roll and roll the strudel onto it. Ideally, it should be breadcrumb side-down on the parchment, you can roll it again if it’s not. Use the parchment like a sling to gently place the strudel on the baking sheet.\nBrush the strudel generously all over with some of the remaining butter. Bake for 15 minutes, then brush again and return to the oven in a rotated position. Repeat this once, baking a total of 45 minutes. (Half-size strudels seem to bake 5 or so minutes faster.) The finished strudel should be crisp to the touch and a deep golden brown.",
        "Remove the baking sheet from the oven and let cool on a rack for at least 20 minutes before serving. Dust with confectioners’ sugar and slice into pieces to serve.",
        "Strudel is best the day it is made, but it keeps for 1 to 2 days at room temperature. I’ve also read that you can freeze it (am trying this as we speak, will give more notes once it defrosts). Before serving, you can crisp up leftover strudel in a 350 degree F (180 degree C) oven."
      ]
    },
    {
      "ingredient_list": [
        "6 medium apples (I had the most success with Golden Delicious and Granny Smiths)",
        "Juice of half a lemon",
        "6 tablespoons (3 ounces or 85 grams) butter",
        "1 1/3 cup (266 grams) sugar, divided",
        "Puffed pastry, chilled",
        "A 9-inch ovenproof skillet, heavy enough that you fear dropping it on your toes"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-tarte-tatin-anew1.jpg?w=500",
      "title": "apple tarte tatin, anew",
      "url": "https://smittenkitchen.com/2011/04/apple-tarte-tatin-anew/",
      "tags": ["Apple", "French", "Photo", "Tarts/Pies"],
      "date": "2011-04-05T16:32:29+00:00",
      "directions": [
        "Peel apples, halve and core apples. Once cored, cut lengthwise into quarters (i.e. four pieces per apple) and cut a bevel along their inner edge, which will help their curved exteriors stay on top as they rest on this edge. (You can see this beveled edge here.) Toss apple chunks with the lemon juice and 1/3 cup of the sugar. Set aside for 15 minutes; this will help release the apple’s juices, too much of them and the caramel doesn’t thicken enough to cling merrily to the cooked apples.",
        "Melt butter in your skillet over medium heat. Sprinkle in remaining 1 cup sugar and whisk it over the heat until it becomes the palest of caramels. Off the heat, add the apples to the skillet, arranging them rounded sides down in one layer. Lay any additional apple wedges rounded sides down in a second layer, starting from the center.",
        "Return the pan to the stove and cook in the caramel for another 20 to 25 minutes over moderately high heat. With a spoon, regularly press down on the apples and baste them caramel juices from the pan. If it seems that your apples in the center are cooking faster, swap them with ones that are cooking more slowly, and rotate apples that are cooking unevenly 180 degrees. The apples will shrink a bit and by the end of the cooking time, your second layer of apples might end up slipping into the first — this is fine.",
        "Preheat oven to 400. Roll out your puffed pastry to a 9-inch circle and trim if needed. Cut four vents in pastry. Remove skillet from heat again, and arrange pastry round over apples. Tuck it in around the apples for nicer edges later.  Bake until the pastry is puffed and golden brown, about 20 minutes.",
        "Once baked, use potholders to place a plate or serving dish (larger in diameter than the pan, learn from my messes!) over the pasty and with a deep breath and a quick prayer, if you’re into that kind of thing, unmold the pastry and apples at once onto the plate. If any apples stubbornly remain behind in the pan, nudge them out with a spatula.",
        "Serve with a dollop of whipped crème fraîche, or lightly sweetened whipped cream and eat immediately.",
        "* My favorite, by miles, though not exactly budget-minded, is from Dufour. It tastes like something straight out of a Paris pastry shop. "
      ]
    },
    {
      "ingredient_list": [
        "3 pounds* of whatever apples, or mix of apples, you like to bake with, peeled, cored and cut into medium chunks",
        "2 tablespoons lemon juice",
        "3 tablespoons sugar",
        "2 tablespoons cornstarch",
        "1 teaspoon cinnamon",
        "Salt",
        "1 stick (8 tablespoons or 4 ounces) unsalted butter",
        "1/4 cup honey",
        "1/2 cup flour",
        "2 cups oats",
        "1/2 cup sliced almonds",
        "1/2 shredded coconut (sweetened or unsweetened, as you wish; I used unsweetened)"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2009/10/breakfast-apple-granola-crisp.jpg?w=753",
      "title": "breakfast apple granola crisp",
      "url":
        "https://smittenkitchen.com/2009/10/breakfast-apple-granola-crisp/",
      "tags": [
        "Apple",
        "Breakfast",
        "Brunch",
        "Coconut",
        "Crumbles/Crisps",
        "Fall",
        "Fruit",
        "Photo"
      ],
      "date": "2009-10-12T09:57:12+00:00",
      "directions": [
        "Preheat oven to 400°F. Mix apple chunks with lemon juice, sugar, cornstarch, cinnamon and pinch of salt in a 9×13-inch baking dish until apples are evenly coated. In a medium saucepan, melt the butter with the honey. Stir in the flour, oats, almonds, coconut and another pinch of salt until clumps form. Sprinkle evenly over the apple mixture and bake in the oven for about 45 to 55 minutes, or until the apples are softened and bubbly. Should the granola brown before you wish it to, cover the baking dish carefully with foil for all but the last few minutes of baking time, when removing the foil will help the granola recrisp. Cool to room temperature and then stash in the fridge to eat with your morning yogurt.",
        "* To note: I originally made mine with four pounds of apples, which will explain why yours may not look as voluminous as mine. However, I felt that the apple to granola proportion was off, and the apples nearly overflowed in the baking dish, hence why I suggest you use less."
      ]
    },
    {
      "ingredient_list": [
        "1/2 large red onion, diced small",
        "2 tablespoons red wine vinegar",
        "2 teaspoons ground sumac",
        "1/4 teaspoon kosher salt, plus more to season salad",
        "2 cups shredded brussels sprouts",
        "1/2 cup fresh pomegranate seeds (from about 1/2 a large one)",
        "1/2 a large unpeeled apple, cored and diced (I used Granny Smith, the book recommends Pink Lady or Honeycrisp)",
        "Juice of half a lemon, plus more to taste",
        "1 1/2 to 2 tablespoons honey, plus more to taste",
        "1/4 cup olive oil",
        "3/4 cup toasted, cooled walnuts, lightly crushed or coarsely chopped",
        "Ground chipotle chile pepper, urfa biber peppers, hot smoked paprika or another chile flake, to taste"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad.jpg?w=750",
      "title": "brussels sprouts, apple and pomegranate salad",
      "url":
        "https://smittenkitchen.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad/",
      "tags": [
        "Apple",
        "Brussels Sprouts",
        "Fall",
        "Gluten-Free",
        "Onions",
        "Photo",
        "Pomegranate",
        "Salad",
        "Side Dish",
        "Thanksgiving",
        "Tips",
        "Vegetarian",
        "Winter"
      ],
      "date": "2016-11-21T13:06:43+00:00",
      "directions": [
        "Make the sumac-pickled onions: Combine red onion, wine vinegar, sumac and 1/4 teaspoon kosher salt in a small dish and set aside while you prepare the other ingredients, or ideally at least 15 minutes.\nCombine all salad ingredients, including red onions and their pickling liquid, in a medium bowl and season to taste with salt and red pepper. Taste and adjust ingredients as desired — I’ve seen versions of the recipe with more honey, olive oil and lemon; I didn’t need them but you might find you do.\nThis salad can be prepped ahead, but I’d keep the dressing off of it until at most an hour before serving so it doesn’t discolor the sprouts."
      ]
    },
    {
      "ingredient_list": [
        "1 small savoy cabbage",
        "1/3 cup walnuts",
        "2 tablespoons cider vinegar",
        "1 tablespoon lemon juice",
        "Salt and pepper",
        "1/2 cup olive oil",
        "2 tablespoons creme fraiche or heavy cream (we used sour cream)",
        "2 apples (any crisp, tasty eating variety, such as Sierra Beauty, Granny Smith, or Fuji)",
        "1/3 cup crumbled blue cheese (optional)"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-apple-and-walnut-salad1.jpg?w=500",
      "title": "cabbage, apple and walnut salad",
      "url":
        "https://smittenkitchen.com/2008/11/cabbage-apple-and-walnut-salad/",
      "tags": ["Apple", "Cabbage", "Photo", "Salad"],
      "date": "2008-11-28T23:58:37+00:00",
      "directions": [
        "Preheat the oven to 375°F.",
        "Tear off and discard the tough outer leaves of the cabbage. Cut it in half and cut out its core. Slice the halves crosswise into a fine chiffonade.",
        "Toast the walnuts in the oven for 8 minutes. While they are still warm, first rub them in a clean dishtowel to remove some of the skins, then chop or coarsely crumble them.",
        "To prepare the dressing, mix the vinegar with the lemon juice, some salt, and a generous amount of pepper.",
        "Whisk in the olive oil and then the creme fraiche or cream. Taste and adjust the acid and salt as desired.",
        "Quarter, peel, and core the apples. Slice the quarters lengthwise fairly thin and cut these slices lengthwise into a julienne. Toss the cabbage, apples, and walnuts (and blue cheese, if you’re using it) with the dressing and an extra pinch of salt. Let the salad sit for 5 minutes, taste again, adjust the seasoning as needed, and serve."
      ]
    },
    {
      "ingredient_list": [
        "3 cups unbleached all-purpose flour (2 1/2 cups, non-lattice)",
        "1 teaspoon salt",
        "2 tablespoons sugar",
        "7 tablespoons all-vegetable shortening, chilled (8 tablespoons, non-lattice)",
        "10 tablespoons unsalted butter, chilled, cut into 1/4-inch pieces (12 tablespoons, non-lattice)",
        "10 tablespoons ice water (6 to 8 tablespoons, non-lattice)",
        "1 1/2 pounds Granny Smith apples (about 3 medium)",
        "2 pounds McIntosh apples (about 4 large)",
        "1 tablespoon juice and 1 teaspoon zest from 1 lemon",
        "3/4 cups (5.25 ounces) plus 1 tablespoon sugar",
        "2 tablespoons all-purpose flour",
        "1/4 teaspoon salt",
        "1 teaspoon cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground allspice",
        "1 egg white, beaten lightly"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/05/cinnamon-sigh1.jpg?w=500",
      "title": "apple pie",
      "url": "https://smittenkitchen.com/2006/11/cinnamon-sigh/",
      "tags": ["Apple", "Fruit", "Photo", "Tarts/Pies", "Thanksgiving"],
      "date": "2006-11-23T12:28:36+00:00",
      "directions": [
        "1. Adjust oven rack to lowest position and heat rimmed baking sheet and oven to 500°F. Remove one piece of dough from refrigerator (if refrigerated longer than 1 hour, let stand at room temperature until malleable).",
        "2. Roll dough on lightly floured work surface or between two large sheets of plastic wrap to 12-inch disk. Transfer dough to pie plate by rolling dough around rolling pin and unrolling over 9 1/2-inch pie plate or by folding dough in quarters, then placing dough point in center of pie plate  and unfolding. Working around circumference of pie plate, ease dough into pan corners by gently lifting dough edges with one hand while pressing around pan bottom with other hand. Leave dough that overhangs lip of plate in place; refrigerate dough-lined pie plate.",
        "3. Peel, core and cut apples in half, and in half again width-wise; cut quarters into 1/4-inch slices and toss with lemon juice and zest. In a medium bowl, mix 3/4 cup sugar, flour, salt and spices. Toss dry ingredients with apples. Turn fruit mixture, including juices, into chilled pie shell and mound slightly in center.",
        "4. Roll out second piece of dough to 12-inch disk and place over filling. Trim top and bottom edges to 1/2-inch beyond pan lip. Tuck this rim of dough underneath itself so that folded edge is flush with pan lip. Flute edging or press with fork tines to seal. Cut four slits on dough top. If pie dough is very soft, place in freezer for 10 minutes. Brush egg white onto top of crust and sprinkle evenly with remaining 1 tablespoon sugar.",
        "5. Place pie on baking sheet and lower oven temperature to 425°F. Bake until top crust is golden, about 25 minutes. Rotate pie and reduce oven temperature to 375°F; continue baking until juices bubble and crust is deep golden brown, 30-35 minutes longer. ",
        "6. Transfer pie to wire rack; cool to room temperature, at least 4 hours. ",
        "Review: We all loved this pie. However, I might for the first time be taking a no-lattice top approach for apple pies in the future. Shortly after these pictures were taken, the apples fell and it ended up looking a little bird cagey on top. This has happened before, leading me to think that perhaps in the open-top variety, apples have a chance to lose too much of their moisture. It wasn’t particularly gooey inside, though tasty just the same. I’m thinking that peach or cherry pies, with their excessive juiciness, might be better-suited for lattice-tops and Cook’s Illustrated seems to agree.",
        "Finally, I’d jack up the spices a bit next time, certainly doubling them [updated to note: not everyone agrees that it needs more spice so please, just spice to taste] and cut back on the lemon, which had a very pronounced flavor. In every other way though, crust included, this recipe is a keeper."
      ]
    },
    {
      "ingredient_list": [],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/05/corfu-sils-and-timelines1.jpg?w=500",
      "title": "grandmothers of sils’ apple-yogurt cake",
      "url": "https://smittenkitchen.com/2007/09/corfu-sils-and-timelines/",
      "tags": ["Apple", "Cake", "Everyday Cakes", "Fruit", "Photo", "Spanish"],
      "date": "2007-09-12T17:12:30+00:00",
      "directions": [
        "1. Position rack in the center of the oven and preheat the oven to 350°F. Butter and flour and 9-inch springform pan.",
        "2. Sift the flour and baking powder together in a bowl. Place the eggs and granulated sugar in a large mixing bowl and, using an electric mixer, beat until fluffy and pale yellow, about 1 minute. Beat in the yogurt and liqueur until completely smooth. Working in batches, beat in the sifted flour, alternating it with the olive oil. Gently but thoroughly fold in the apples.",
        "3. Scrape the batter into the prepared springform pan, tap it on a counter to level the batter, then smooth the top with an offset spatula. Bake the cake on the center rack until the top is golden, a cake tester or toothpick inserted into the center comes out clean**, and the cake springs back when you touch it, 55 to 65 minutes. Let the cake cool on a rack.",
        "4. Run a thin knife around the side of the cake to loosen it. Remove the side and the bottom of the pan, then place the cake on a cake platter. (The cake can be baked up to 3 days ahead.) Wrap it loosely in plastic until ready to use. Serve the cake sprinkled with confectioners’ sugar, accompanied by creme fraiche, if desired. ",
        "* For serious! I can’t tell you how many lemon yogurts I picked up at my totally yuppie gourmet grocery store before finding a single one with real, actual lemon in it and not artificial flavoring. I’m not naming names, but there were brands that I really expected better from. I finally landed on Stoneybrook Farms low-fat with lemon puree on the bottom. Why I went through this trouble when I could have just, uh, squeeze lemon juice into a plain yogurt, I don’t know. But just to warn that if you’re going through the effort of making a cake from scratch, you might want to make sure your lemon yogurt is the real deal. ",
        "** For some reason, this never happened for me. Well beyond the baking time (though my oven runs a little cool) the toothpick was still coming out with some damp crumbs attached while the top was golden and springy, so I took it out. It was cooked just fine in the center, so if this happens to you, don’t worry. "
      ]
    },
    {
      "ingredient_list": [
        "Topping",
        "4 tablespoons butter, plus extra for greasing pan",
        "1/2 cup dark brown sugar",
        "Pinch of salt",
        "4 apples (about 1 3/4 pounds), peeled, cored and cut into 1/4-inch wedges",
        "Batter",
        "1/2 cup (1 stick or 4 ounces) butter, at room temperature",
        "1/2 cup sugar",
        "1 large egg",
        "1/3 cup dark molasses",
        "1/3 cup honey",
        "1 cup buttermilk",
        "2 1/4 cups flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 teaspoon ground ginger",
        "1 teaspoon cinnamon"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2009/11/gingerbread-upside-down-apple-cake.jpg?w=750",
      "title": "gingerbread apple upside-down cake",
      "url":
        "https://smittenkitchen.com/2009/11/gingerbread-apple-upside-down-cake/",
      "tags": ["Apple", "Cake", "Fall", "Photo", "Thanksgiving", "Winter"],
      "date": "2009-11-23T21:32:39+00:00",
      "directions": [
        "Very softly whipped cream",
        "Make the topping: Preheat the oven to 325°F. Grease a 10-inch cake pan. Melt butter in a small saucepan. Add brown sugar and simmer over moderate heat, stirring, four minutes, then swirl in salt. Remove from heat and pour into the bottom of your cake pan. Make circles of overlapping apple slices on top of the caramel. Chop any remaining slices and place them in the gaps.",
        "Make the batter: Using a mixer, blend 1/2 cup butter and the sugar on medium-low speed. Increase the speed to high and cream until light and fluffy.",
        "In a medium bowl, whisk together the egg, molasses, honey and buttermilk. In a separate bowl, sift together the flour, baking soda, salt, ginger and cinnamon. Alternate mixing the flour and molasses mixtures into the butter mixture, adding the next once the last has been incorporated.",
        "Pour the batter into the pan. Bake at least 45 to 50 minutes (thanks to commenter klp for reminding me this took a bit longer)  or until a wooden tester inserted into the center of the cake comes out clean. Let cool on a rack for 10 to 15 minutes, then turn out onto a platter (one that will catch spills, unlike what you see in the pictures above).",
        "Serve warm or cool with very softly whipped cream."
      ]
    },
    {
      "ingredient_list": [],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/05/lemon-ricotta-pancakes-with-sauteed-apples11.jpg?w=640",
      "title": "lemon ricotta pancakes with sauteed apples",
      "url":
        "https://smittenkitchen.com/2007/11/lemon-ricotta-pancakes-with-sauteed-apples/",
      "tags": [
        "Apple",
        "Breakfast",
        "Brunch",
        "Citrus",
        "Fruit",
        "Lemon",
        "Pancakes",
        "Photo"
      ],
      "date": "2007-11-03T21:57:43+00:00",
      "directions": [
        "Serve the pancakes with the sauteed apples and the maple syrup. "
      ]
    },
    {
      "ingredient_list": [
        "1/2 cup (115 grams or 4 ounces) unsalted butter",
        "1 cup (130 grams)  all-purpose flour",
        "1 cup (200 grams) sugar, divided",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon fine sea or table salt",
        "3/4 cup (175 ml) whole milk",
        "2 medium apples, peeled",
        "3 small (I used Italian prune plums) or 2 medium plums, no need to peel",
        "3/4 teaspoon ground cinnamon"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2016/09/magic-apple-plum-cobbler1.jpg?w=750",
      "title": "magic apple plum cobbler",
      "url": "https://smittenkitchen.com/2016/09/magic-apple-plum-cobbler/",
      "tags": ["Apple", "Crumbles/Crisps", "Fall", "Photo", "Plum", "Summer"],
      "date": "2016-09-16T12:07:20+00:00",
      "directions": [
        "Heat your oven to 350°F. Place butter in a 2 to 3-quart (3 was recommended, but I had a lot of extra space) baking dish or a 7×11-inch cake pan. Place pan in oven for 5 to 7 minutes, until butter has melted. Tilt the dish to ensure it is evenly coated with butter.\nWhisk together the flour, 3/4 cup sugar, baking powder and salt in a small bowl and stir in milk. Mix until smooth. Pour batter over the butter but do not stir, even if it looks like a puddle-y buttery mess.",
        "Cut apples into 8 wedges, small plums into 4 wedges and medium ones into 4 to 6. Space fruit over batter. Sprinkle with cinnamon and then remaining sugar.",
        "Bake the cobbler until it is set and golden on top, 35 to 40 minutes. Cool slightly on a rack. Serve the cobbler warm or at room temperature.\n"
      ]
    },
    {
      "ingredient_list": [
        "Crust",
        "1 stick plus two tablespoons cold salted butter (5 ounces), cut into cubes and chilled in freezer",
        "1 tablespoon sugar (optional)",
        "1 1/2 cup flour",
        "3 to 6 tablespoons ice water",
        "Filling",
        "7 medium apples (I’ve had good results with Granny Smith, Gala, McIntosh…use your favorite, but make sure they are very firm, fresh and flavorful.)",
        "1 stick (4 ounces) salted butter",
        "1 cup sugar"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/05/mollys-apple-tarte-tatin1.jpg?w=500",
      "title": "molly’s apple tarte tatin",
      "url": "https://smittenkitchen.com/2008/10/mollys-apple-tarte-tatin/",
      "tags": [
        "Apple",
        "Fall",
        "French",
        "Fruit",
        "Guest Post",
        "Photo",
        "Tarts/Pies"
      ],
      "date": "2008-10-13T12:00:00+00:00",
      "directions": [
        "Prepare Crust: I always use the food processor for this. Pre-mix the flour and sugar in the food processor container, and cube the butter on a plate. Then put the dry ingredients and the butter in the freezer for a while. This will get everything, including the blade and container, nice and chilled. The colder everything is, the flakier and more tender your crust will be. Prepare about 1/3 cup ice water and refrigerate.",
        "After you’ve chilled everything for at least 20 minutes, add the cubes of butter to dry ingredients and pulse until the largest pieces of butter are no bigger than tiny peas.",
        "Add the ice water a little at a time, processing just until the dough starts to come together into a mass. (it won’t quite be a “ball,” and it won‘t look smooth–you don’t want to overprocess it!) Turn out onto well-floured surface and pat together into a ball. Don’t handle the dough too much, or the warmth of your hands will start to melt the butter. Flour the top of the dough and use rolling pin to quickly press and roll the dough out into a 10 to 11-inch circle. Keep turning the dough as you do this to make sure it doesn’t stick to the rolling surface. Throw more flour underneath the dough if necessary. Check the crust to make sure it’s just big enough to cover the top of your tarte tatin pan. Move the crust onto a piece of parchment paper or onto a floured rimless baking sheet, cover with plastic wrap and refrigerate.",
        "Prepare filling: Preheat oven to 375° F.",
        "Peel, core and quarter the apples. Don’t cut them into smaller pieces than quarters–the quarters shrink considerably during cooking. You can squeeze a bit of lemon on them, but it’s not necessary.",
        "Over low heat in a heavy, ovenproof skillet measuring 7 to 8 inches across the bottom and 10 to 11 inches across the top, melt the stick of butter. Remove from heat, add the sugar and stir until blended.",
        "Shake/tap the pan so the butter-sugar mixture distributes evenly across the bottom. Arrange apple quarters in pan, first making a circle inside the edge of the pan. Place them on their sides and overlap them so you can fit as many as possible. Then fill the center of the pan; you may have some apple left over. Keep at least one extra apple quarter on hand–when you turn the apples over, they may have shrunk to the extent that you’ll need to cheat and fill in the space with an extra piece. This one piece won’t get quite as caramelized as the other pieces, but don’t worry–it will still cook through and no one will notice.",
        "Return your pan to the stovetop on high heat. Let boil for 10 to 12 minutes or until the juices in the pan turn from golden in color to dark amber. Remove from heat. With the tip of a sharp knife, turn apple slices over, keeping them in their original places. If necessary, add an extra slice of apple to keep your arrangement intact. Return to the stovetop on high heat once more. Let cook another 5 minutes and then remove from heat.",
        "Place the crust on top of the apples and brush off excess flour. Tuck edges under slightly, along the inside of the pan, being careful not to burn fingers. You can use your knife.",
        "Bake in oven until the top of the crust is golden-brown in color, about 25-35 minutes. Remove from oven and allow to cool on a rack about 30 minutes.",
        "Run a sharp knife along the inside edge of the pan. Place a plate or other serving dish on top of the pan and quickly flip over the whole shebang so the Tarte Tatin drops down onto the plate. The pan will still be hot, so use potholders and be careful! Don’t burn yourself or drop stuff! If you are feeble and clumsy, get someone stronger and more coordinated than you to do this. Peek under the edge of the pan to see if the Tarte came out. You may need to bop the bottom of the pan with your potholder-encased fist for this to happen. If there are any pieces of apple left behind in the pan or otherwise out of place, carefully put them back where they are supposed to be. Voila! A beautiful TREAT!",
        "This keeps well for about a day at room temperature; if you have to refrigerate it, warm it up slightly before serving for optimum enjoyment."
      ]
    },
    {
      "ingredient_list": [
        "For the apples",
        "6 apples, Mom uses McIntosh apples, I use a mix of whatever looks good",
        "1 tablespoon ground cinnamon",
        "5 tablespoons (65 grams) granulated sugar",
        "For the cake",
        "2 3/4 cups (360 grams) flour",
        "1 tablespoon baking powder",
        "1 teaspoon fine sea or table salt",
        "1 cup (235 ml) vegetable oil (safflower, sunflower, olive and coconut oil also work, as does melted butter)",
        "2 cups (400 grams) granulated sugar",
        "1/4 cup (60 ml) orange juice",
        "2 1/2 (13 ml) teaspoons vanilla extract",
        "4 large eggs",
        "1 cup (130 grams) walnuts, chopped (optional and to be honest, we never use them)"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/09/moms-apple-cake11.jpg?w=640",
      "title": "mom’s apple cake",
      "url": "https://smittenkitchen.com/2008/09/moms-apple-cake/",
      "tags": ["Apple", "Cake", "Everyday Cakes", "Fruit", "Photo"],
      "date": "2008-09-30T15:04:48+00:00",
      "directions": [
        "Heat oven to 350°F (175°C). Grease a tube pan. (I use this one or an equivalent one-piece tube.) Peel, core and chop apples into 1-inch chunks.Toss with cinnamon and 5 tablespoons sugar and set aside.",
        "Stir together flour, baking powder and salt in a large mixing bowl. In a separate bowl, whisk together oil, orange juice, sugar, vanilla and eggs. Mix wet ingredients into dry ones; scrape down the bowl to ensure all ingredients are incorporated.",
        "Pour half of batter into prepared pan. Spread half of apples (and their juices) over it. Pour the remaining batter over the apples and arrange the remaining apples on top. Bake for about 1 1/2 hours, or until a tester comes out clean.*",
        "Cool completely before running knife between cake and pan, and unmolding onto a platter.",
        "Do ahead: This cake is awesome on the first day but absolutely glorious and pudding-like on the days that follow, so feel free to get an early start on it. I keep it at room temperature covered with foil. ",
        "* Tip: The apples love to hide uncooked pockets of batter, especially near the top. Make sure your testing skewer or toothpick goes not just all the way down to the bottom, but does a shallow dip below the top layer of apples to make sure it comes out batter-free. Should your cake be browning too fast, before the center is baked through, cover it with foil for all but the last few minutes in the oven."
      ]
    },
    {
      "ingredient_list": [
        "4 large or 5 small-medium apples (about 2 pounds)",
        "1 tablespoon cornstarch",
        "3 tablespoons plus 1/4 cup raw or Turbinado (often sold as Sugar in the Raw) sugar",
        "1/4 cup plus 3/4 cup rolled oats",
        "1/4 cup sliced or slivered almonds",
        "1/2 cup whole wheat flour (or a mix; see Note up top)",
        "1/4 cup light or dark brown sugar",
        "1/4 teaspoon ground cinnamon",
        "Two pinches sea salt",
        "1/2 teaspoon baking powder",
        "2 tablespoons unsalted butter",
        "1/4 cup olive oil"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/05/multigrain-apple-crisps1.jpg?w=500",
      "title": "multigrain apple crisps",
      "url": "https://smittenkitchen.com/2012/03/multigrain-apple-crisps/",
      "tags": ["Apple", "Coconut", "Crumbles/Crisps", "Fruit", "Photo"],
      "date": "2012-03-07T12:28:19+00:00",
      "directions": [
        "Preheat oven to 350 degrees. Arrange eight 6-ounce ramekins (these are my favorite) on a baking tray. Peel, halve and core apples, then chop them into a small (about 1/2-inch) dice. The smaller the pieces, the faster the crisps will bake and the less they’ll “deflate” as they cool. Toss apples with 1 tablespoon cornstarch and 3 tablespoons raw sugar until evenly coated, then divide apples between ramekins.",
        "Grind 1/4 cup oats with almonds in a food processor until powdery. (If you have both almond meal and oat flour, you can replace this with 1/4 cup of each.) In a medium bowl, mix oat/almond mixture with remaining rolled oats, wheat flour, remaining 1/4 cup raw sugar, brown sugar, cinnamon, sea salt and baking powder. Melt butter in a small saucepan (or in microwave), then stir in olive oil. Pour mixture over dry ingredients and stir until crumbly. Divide crumbs over each dish of apples, packing them on with your palms if needed to get them all on (don’t worry, the apples will deflate a bit when they bake). ",
        "Bake apple crisps for about 30 to 40 minutes, or until you can see the juices from the apples bubbling around the crumbs. If tops brown too quickly, put a sheet of foil over the whole tray for remaining baking time. Let cool on rack and serve when lukewarm. Store remaining crisps in fridge. They are quite excellent with a dollop of plain yogurt."
      ]
    },
    {
      "ingredient_list": [
        "1 extra-large egg yolk (I used one large and a smidgen of another)",
        "1/2 cup plus 2 tablespoons grapeseed oil (suggested for its neutrality; I used half olive oil but suggest you do so sparingly as the olive flavor becomes very pronounced)",
        "2 tablespoons finely diced shallot",
        "1 to 2 lemons, for juicing",
        "1/4 cup crème fraîche (did you know you can make your own?)",
        "1/4 cup buttermilk (did you know you can make your own?)",
        "2 apples, firm, crisp and juicy",
        "2 pears, Asian or your favorite variety",
        "2 heads radicchio",
        "2 tablespoons sliced mint",
        "1 tablespoon chopped flat-leaf parsley",
        "Kosher salt and freshly ground black pepper"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/05/radicchio-apple-and-pear-salad1.jpg?w=500",
      "title": "radicchio, apple and pear salad",
      "url":
        "https://smittenkitchen.com/2010/04/radicchio-apple-and-pear-salad/",
      "tags": ["Apple", "Pear", "Photo", "Radicchio", "Salad"],
      "date": "2010-04-04T12:16:36+00:00",
      "directions": [
        "Place the egg yolk in a stainless steel bowl. Begin whisking in the grapeseed oli drop by drop, as slowly as you can bear. (I find having a second person dripping it in makes it easier.) Continue in this manner until the mixture begins to thicken.Once the mayo has emulsified, you can add the rest of the oil in a slow, steady stream (however, as a beginner, I still take it very slowly), whisking all the time. Arm getting tired? Try to murmur “jiggle-free upper arms… sleeveless sundresses…” to yourself. I find it helps.",
        "Combine the shallot, 1 tablespoon lemon juice and 1/2 teaspoon salt in a small bowl and let it sit for 5 minutes. Whisk in the crème fraîche and buttermilk. Gently whisk this mixture into the mayonnaise, and taste for balance and seasoning.",
        "Slice the apples and pears away from the core. Cut into 1/8-inch thick slices (I went even thinner, using a mandoline) and place them in a large salad bowl. Tear the radicchio into bite-sized pieces and add to the salad bowl. Toss salad with half of dressing (Goin suggests three-fourths but I found this to make an overly-creamy salad; you can always add more) and season with salt and pepper. Add a squeeze of lemon juice and a little more dressing if necessary.",
        "Transfer to a platter (chilled, if you’re being fancy) and scatter the mint and parsley on top."
      ]
    },
    {
      "ingredient_list": [
        "1 pound bakery white or challah bread, crusts removed, cut into 1-inch cubes",
        "1 Granny Smith apple, peeled and cut into 1/2-inch pieces",
        "1 cup (6 ounces) golden raisins, plumped in hot water for 15 minutes",
        "3 large eggs",
        "3/4 cup sugar",
        "1/4 teaspoon cinnamon",
        "1/8 teaspoon freshly grated nutmeg",
        "1/8 teaspoon ground ginger",
        "1/4 teaspoon pure vanilla extract",
        "1/4 teaspoon salt",
        "3 cups whole milk",
        "2 tablespoons unsulfured molasses",
        "1/4 cup sliced almonds"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2015/05/raisin-studded-apple-bread-pudding1.jpg?w=500",
      "title": "raisin-studded apple bread pudding",
      "url":
        "https://smittenkitchen.com/2009/11/raisin-studded-apple-bread-pudding/",
      "tags": ["Apple", "Fall", "Photo", "Pudding", "Thanksgiving"],
      "date": "2009-11-10T09:53:03+00:00",
      "directions": [
        "Preheat the oven to 350°F. Spread the bread cubes on a baking sheet and toast in the oven for 6 minutes, until crisp. Transfer to a bowl and add the apple and raisins.",
        "Generously butter either a 9×13-inch deep baking dish or six 8-ounce ramekins. If using ramekins, set them on the baking sheet.",
        "In a medium bowl, using a handheld electric mixer or whisk, beat the eggs with the sugar. Beat in the ground spices, vanilla and salt.",
        "In a medium saucepan, heat the milk with the molasses until just warm to the touch. Gradually beat the warm milk into the egg mixture, scraping the bottom and side of the bowl.",
        "Spread bread mixture out in your large baking dish, or distribute it among ramekins. Pour the custard over the bread mixture, nudging the bread around a bit to make sure it soaks all of the pieces. Let stand for 5 minutes. Sprinkle the almonds on top. Bake in the center of the oven for about 40 minutes, until puffed and set, with the tops lightly browned. Let the bread pudding(s) rest for at least 15 minutes before serving."
      ]
    },
    {
      "ingredient_list": [
        "Cake",
        "6 medium apples, any variety you like to bake with, peeled, halved and cored",
        "7 1/2 cups (940 grams) all-purpose flour",
        "1 1/2 teaspoons (10 grams) table salt",
        "1 1/2 teaspoons (8 grams) baking soda",
        "2 tablespoons (30 grams) baking powder",
        "1 tablespoon ground cinnamon",
        "1 1/2 teaspoons (3 grams) ground ginger",
        "1/2 teaspoon (1 gram) ground cloves",
        "1/2 teaspoon (1 gram) freshly grated nutmeg",
        "1 1/2 cups (505 grams) honey",
        "4 1/2 cups (585 grams updated: 1170 grams) applesauce",
        "1 1/2 cups (3 sticks) unsalted butter, at room temperature",
        "1 1/2 cups packed (285 grams) dark-brown sugar",
        "6 large eggs",
        "Frosting",
        "3 8-ounce (675 grams total) blocks cream cheese, at room temperature",
        "1 1/2 cups (3 sticks, 3/4 pound or 340 grams) butter, at room temperature",
        "1 tablespoon (15 ml) vanilla extract",
        "6 cups (720 grams) powdered sugar, sifted"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2012/09/roasted-apple-spice-sheet-cake.jpg?w=750",
      "title": "roasted apple spice sheet cake",
      "url":
        "https://smittenkitchen.com/2012/09/roasted-apple-spice-sheet-cake/",
      "tags": ["Apple", "Celebration Cakes", "Fall", "Photo"],
      "date": "2012-09-18T11:39:51+00:00",
      "directions": [
        "Roast apples: Heat oven to 375°F. Line a baking sheet or roasting pan with parchment paper. Arrange apple halves face down on paper and roast in a single layer until they feel dry to the touch and look a little browned underneath, about 20 minutes. Slide parchment paper with apples onto a cooling rack and set aside. Reduce oven temperature to 350°F.",
        "Make cake layers: Butter two 9×13-inch cake pans and line the bottoms with a fitted rectangle of parchment paper. Butter the paper as well. Feel free to use a nonstick baking spray instead of butter, too. [If you, like most people, only have one cake pan, don’t fret. Just bake half the batter and as soon as you can flip the cake out of the pan, wash it and start again with a fresh piece of parchment, baking the remaining batter.]",
        "In a large bowl, whisk together flour, salt, baking soda, baking powder, cinnamon, ginger, cloves and nutmeg. In a medium bowl, whisk together applesauce and honey. ",
        "In a large bowl with an electric mixer, beat the butter and dark brown sugar until very fluffy. Add the eggs, one at a time, scraping down the bowl between every other addition. Add one third of the flour-spice mixture and mix it until just combined. Add half the applesauce-honey mixture, again mixing it until combined. [At this point, if you, like me, have a 5-quart KitchenAid, things are going to get a little full in the bowl. I suggest stirring in the remaining additions carefully by hand.] Add the second third of the flour-spice mixture, the remaining applesauce-honey mixture, and the remaining flour-spice mixture, stirring between each addition. ",
        "Chop roasted apples into smallish chunks (1/2 to 2/3-inches) and fold into batter. Divide batter between baking pans and bake cake layers, rotating the cake pans top to bottom and back-to-front halfway through the baking time, about 35 to 40 minutes, until a tester inserted into the center comes out clean. Transfer baking pans to cooling racks and let rest for 10 minutes, before flipping out of the pans onto racks, removing the parchment paper lining, and cooling the cakes right-side-up.",
        "[Do ahead: I pause my cake-making all of the time here. I freeze the cake layers overnight, or until needed (up to two weeks, longer if your freezer doesn’t make things smell freezer-y for a while), wrapped in a double-layer of plastic wrap. When you’re ready to decorate them, you can do so while the cake is still frozen — it will be easier to handle/move/trim. Simply leave it at room temperature for a few hours once it is decorated or in the fridge for a day to fully defrost. More layer cake tips live here.]",
        "Make the frosting: Whip butter and cream cheese together with an electric mixture until light and fluffy. Beat in vanilla extract. Add powdered sugar and beat again until smooth and light. ",
        "Decorate your cake: Arrange first cake layer on cake board or serving platter, tucking pieces of waxed paper underneath the outer edges to keep your platter clean while you decorate (which I forgot to do, typically). Use a serrated knife to level the top, removing any dome so that the next layer will rest neatly on top. Thickly spread about 1/3 of frosting on the bottom layer, then transfer the cake to the freezer for just 5 or 10 minutes, to firm up the filling. Place the second cake layer on top of the filling. Trim the top again until level (if desired; seeing as you’re not adding another layer, it would be for a neat appearance, not for cake stability). If the sides don’t align perfectly with the bottom layer, you can trim them until straight as well. Thinly apply a coat of frosting over entire exterior of cake. Once again, you can get this to “set” quickly by sliding the cake into the freezer for 5 minutes. One set, add your final coat of frosting, a thicker more decorative one. (This is of course where you can add any decorations desired. You should have plenty of leftover frosting to go to town with.)",
        "Remove bits of waxed paper and serve with a big “ta-da!” Should any survive the party, this cake keeps exceptionally well in the fridge. Five days out, our leftover pieces are, if possible, more moist than one day one."
      ]
    },
    {
      "ingredient_list": [],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2007/11/simplest-apple-tart.jpg?w=750",
      "title": "simplest apple tart",
      "url": "https://smittenkitchen.com/2007/11/simplest-apple-tart/",
      "tags": ["Apple", "Fall", "Photo", "Tarts/Pies"],
      "date": "2007-11-05T23:42:40+00:00",
      "directions": [
        "MIX flour, sugar, and salt in a large bowl; add 2 tablespoons of the butter. Blend in a mixer until dough resembles coarse cornmeal. Add remaining butter; mix until biggest pieces look like large peas. ",
        "DRIBBLE in water, stir, then dribble in more, until dough just holds together. Toss with hands, letting it fall through fingers, until it’s ropy with some dry patches. If dry patches predominate, add another tablespoon water. Keep tossing until you can roll dough into a ball. Flatten into a 4-inch-thick disk; refrigerate. After at least 30 minutes, remove; let soften so it’s malleable but still cold. Smooth cracks at edges. On a lightly floured surface, roll into a 14-inch circle about 1/8 inch thick. Dust excess flour from both sides with a dry pastry brush. ",
        "PLACE dough in a lightly greased 9-inch round tart pan, or simply on a parchment-lined baking sheet if you wish to go free-form, or galette-style with it. Heat oven to 400°F. (If you have a pizza stone, place it in the center of the rack.) ",
        "OVERLAP apples on dough in a ring 2 inches from edge if going galette-style, or up to the sides if using the tart pan. Continue inward until you reach the center. Fold any dough hanging over pan back onto itself; crimp edges at 1-inch intervals. ",
        "BRUSH melted butter over apples and onto dough edge. Sprinkle 2 tablespoons sugar over dough edge and the other 3 tablespoons over apples. (Deb note: I found it nearly impossible to coat it with this much sugar, so I used a little less–more like 3 tablespoons. It made a lightly sweet tart, which we found perfect.)",
        "BAKE in center of oven until apples are soft, with browned edges, and crust has caramelized to a dark golden brown (about 45 minutes), making sure to rotate tart every 15 minutes. ",
        "MAKE glaze: Put reserved peels and cores in a large saucepan, along with sugar. Pour in just enough water to cover; simmer for 25 minutes. Strain syrup through cheesecloth. ",
        "REMOVE tart from oven, and slide off parchment onto cooling rack. Let cool at least 15 minutes. ",
        "BRUSH glaze over tart, slice, and serve. "
      ]
    },
    {
      "ingredient_list": [
        "Lid",
        "7 tablespoons (100 grams) unsalted butter, at room temperature",
        "1/2 cup (100 grams) granulated sugar",
        "1/2 teaspoon finely grated orange zest",
        "1 large egg, lightly beaten",
        "1 cup plus 6 1/2 tablespoons (175 grams) all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon coarse or flaky salt (or less of table salt)",
        "Milk or cream, for brushing crust",
        "Coarse or fine sugar, for sprinkling crust",
        "Softly whipped, lightly sweetened cream, for serving",
        "Filling",
        "1 pound ripe prune plums or greengages, halved, pitted, and halved again (i.e. quartered)",
        "1 pound apples, peeled, cored and cut into smaller chunks (than you see in my photos)",
        "2 tablespoons sugar",
        "1/8 teaspoon ground cinnamon",
        "Squeeze or two of orange or lemon juice"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2010/10/single-crust-apple-plum-pie.jpg?w=749",
      "title": "single-crust plum and apple pie",
      "url":
        "https://smittenkitchen.com/2010/10/single-crust-plum-and-apple-pie/",
      "tags": ["Apple", "Fall", "Photo", "Plum", "Tarts/Pies"],
      "date": "2010-10-01T11:33:17+00:00",
      "directions": [
        "Make the lid: In a stand mixer, cream the butter, sugar and orange zest until light and fluffy. Mix in the lightly beaten egg and scrape down sides. Slowly add the flour, baking powder and salt and beat until combined. Scrape dough into a piece of waxed paper or plastic wrap, and stick in the freezer for 10 to 20 minutes, or until firmed up.",
        "Assemble the pie: Preheat oven to 350°F (180°C or gas mark 4) Butter a pie or baking dish. Add the fruit and spinkle it with the sugar, cinnamon and orange or lemon juice. Gently toss the ingredients together once or twice; don’t worry, they’ll “muddle” well once cooking in the oven.",
        "Roll out the firmed-up lid dough on a very well floured counter and gently lift it onto the pie and trim the overhang. It will tear. This is fine, and all the better to let juice erupt through. If it flusters you, you can use some of the trimmings to patch it up but still, the pie will bubble through in other places. Brush the crust with milk or cream, sprinkle with sugar and bake for 40 minutes, until lightly golden on top. Scoop onto dishes and serve with whipped cream."
      ]
    },
    {
      "ingredient_list": [
        "For cake",
        "2 cups (8 3/4 ounces or 250 grams) all-purpose flour",
        "2 teaspoons (10 grams) baking powder",
        "1/2 teaspoon (3 grams) baking soda",
        "1/2 teaspoon (3 grams) salt",
        "3/4 teaspoon (2 grams) cinnamon",
        "1/2 teaspoon (1 gram) ground ginger",
        "1/8 teaspoon ground cloves",
        "1 stick (4 ounces or 113 grams) unsalted butter, softened",
        "1 cup (6 7/8 ounces or 195 grams) packed light brown sugar (updated weight)",
        "1 teaspoon (5 ml) pure vanilla extract",
        "2 large eggs",
        "1 1/2 cups (about 13 ounces or 365 grams) unsweetened applesauce",
        "1/2 cup (about 1 3/4 ounces or 50 grams) walnuts (optional), toasted, cooled, and chopped",
        "For frosting",
        "5 ounces (142 grams) cream cheese, softened",
        "3 tablespoons (1 1/2 ounces or 42 grams) unsalted butter, softened",
        "1/4 teaspoon pure vanilla extract",
        "1 cup (4 ounces or 120 grams) confectioners sugar",
        "1/2 (1 teaspoon) teaspoon cinnamon"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2010/10/spiced-applesauce-cake.jpg?w=749",
      "title": "spiced applesauce cake",
      "url": "https://smittenkitchen.com/2010/10/spiced-applesauce-cake/",
      "tags": ["Apple", "Cake", "Everyday Cakes", "Fall", "Photo"],
      "date": "2010-10-25T11:48:25+00:00",
      "directions": [
        "Preheat oven to 350°F with rack in middle. Butter an 8- or 9-inch square cake pan. I had no trouble getting my cake out of a nonstick pan by just buttering it, but if you don’t have a nonstick cake pan or are a little nervous, line the bottom with parchment paper and butter that too.",
        "Make cake: Whisk together flour, baking powder, baking soda, salt, and spices. Beat butter, brown sugar, and vanilla with an electric mixer at high speed until pale and fluffy, 2 to 3 minutes. Add eggs one at a time, beating well after each addition, then beat in applesauce. At low speed, mix in flour mixture until just combined, then stir in walnuts (if using). The batter will look a little curdly and uneven but don’t worry, it will all bake up perfectly in the end.",
        "Spread batter evenly in pan and bake until golden-brown and a wooden pick inserted into center comes out clean, about 35 to 40 minutes. Cool in pan 15 minutes. Run a knife around edge of cake to loosen, then invert onto a plate. Reinvert cake onto a rack to cool completely. You can speed this up, as I always do, in the fridge.",
        "Make frosting: Beat cream cheese, butter, and vanilla with an electric mixer at high speed until fluffy. Sift confectioners sugar and cinnamon over cream cheese mixture, then beat at medium speed until incorporated. Spread frosting over top of cooled cake.",
        "Do ahead: We were impressed with how well this cake kept for three days but were unable to “research” if it lasted longer. Keep frosted cake in the fridge. If you’d like to bake the cake further in advance, I’d wrap it well and freeze it until the day you need it. Leave it out on the counter to defrost and frost it up to a day in advance."
      ]
    },
    {
      "ingredient_list": [
        "Topping",
        "4 tiny-to-small apples, halved, peeled and cored",
        "2 tablespoons fresh lemon juice",
        "2 tablespoons granulated sugar",
        "Batter",
        "1/2 cup plus 1 tablespoon (125 grams) unsalted butter, at room temperature",
        "1/4 cup plus 2 tablespoons (6 tablespoons) granulated sugar",
        "1/4 cup honey (any variety you like to eat)",
        "1 teaspoon vanilla extract",
        "3 large eggs, separated",
        "2 good pinches of salt",
        "2 teaspoons baking powder",
        "1 1/4 cups all-purpose flour",
        "Glaze",
        "1/4 cup honey",
        "A good pinch of sea salt"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2014/10/sunken-apple-cake-with-salted-honey-glaze1.jpg?w=640",
      "title": "sunken apple and honey cake",
      "url": "https://smittenkitchen.com/2014/09/sunken-apple-and-honey-cake/",
      "tags": [
        "Apple",
        "Cake",
        "Everyday Cakes",
        "Fall",
        "German",
        "Jewish",
        "Photo"
      ],
      "date": "2014-09-22T12:17:45+00:00",
      "directions": [
        "Heat oven: To 350°F. Coat a 9-inch springform with butter or a nonstick spray. Line the bottom of the pan with a round of parchment paper. ",
        "Prepare apples: Place peeled, halved and cored apples cut-side-down on a cutting board. Use a knife to create parallel thin slices, but only cut halfway through each apple so that the apples stay intact. Don’t fret if you cut through, however; you can just reassemble the halves on the cake in a few minutes.",
        "In a bowl, toss apples with lemon juice and 2 tablespoon granulated sugar.",
        "Prepare cake base: Beat butter and 1/4 cup plus 2 tablespoons granulated sugar together in a bowl with electric beaters until fluffy. Add honey and beat until combined. Add vanilla and egg yolks, beating until just combined. Sprinkle salt and baking powder over cake batter, and mix for just 5 seconds, until they disappear. Add flour, half at a time, mixing only until just combined.",
        "In a separate bowl with cleaned beaters, beat egg whites until stiff. Stir 1/4 of them into the cake batter, to lighten it a little. Fold in the rest in three additions. It will seem impossible to fold in at first because the batter is so stiff, but it will loosen with careful folding. Only fold the last addition of egg whites until it has mostly disappeared (a couple faint streaks of egg white are fine). ",
        "Spread cake batter in prepared cake pan, smoothing the top. Arrange apple halves facedown over the cake batter. To warn, 4 tiny/small apples will definitely fit over the cake batter. When I made it with 4 small-almost-medium apples, I could only fit 3 1/2 of them. No need to press the apples into the batter. You can pour any extra lemon juice and sugar in the bowl over the apples.",
        "Bake cake: 35 to 40 minutes, until a toothpick or skewer inserted into the center of the cake comes out clean. Let rest on a cooling rack for 5 minutes, then cut around the cake to make sure it’s not sticking to the pan at all, and unhinge the sides. Let cake cool completely. You can store it at room temperature at this point, or after you add the honey, for up to 5 days 3 days at room temperature. After that, a fridge is best for longevity. The cake is lovelier on day 2 than day 1.",
        "Before serving, if you’d like the glaze to look glossy, or whenever the cake is cool, if you don’t mind if the honey sinks into the cake: Warm 1/4 cup honey and a good pinch of sea salt until it liquefies to the point where it makes a thin glaze — this will take less than 30 seconds. Brush honey-salt mixture over cooled cake. "
      ]
    },
    {
      "ingredient_list": [
        "1 cup (120 grams) whole wheat flour",
        "1 cup (130 grams) all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 tablespoon cinnamon",
        "1/2 cup (115 grams) unsalted butter, at room temperature",
        "1/2 cup (100 grams) granulated sugar",
        "1/2 cup (95 grams) dark brown sugar, packed, divided",
        "1 large egg, lightly beaten",
        "1 cup buttermilk (235 ml) or yogurt (230 grams)",
        "2 large apples, peeled, cored, and coarsely chopped"
      ],
      "img":
        "https://smittenkitchendotcom.files.wordpress.com/2008/04/whole-wheat-apple-muffins.jpg?w=750",
      "title": "whole wheat apple muffins",
      "url": "https://smittenkitchen.com/2008/04/whole-wheat-apple-muffins/",
      "tags": [
        "Apple",
        "Breakfast",
        "Brunch",
        "Fruit",
        "Muffin/Quick Bread",
        "Photo"
      ],
      "date": "2008-04-11T16:46:04+00:00",
      "directions": [
        "Preheat the oven to 450°F. Grease and flour 18 muffin cups and set aside.",
        "Mix together the flours, baking powder, baking soda, salt, and cinnamon, and set aside. In a separate bowl, cream the butter and add the granulated sugar and 1/4 cup of the brown sugar. Beat until fluffy. Add the egg and mix well; stop once to scrape the sides and bottom of the bowl.Mix in the buttermilk gently. (If you over-mix, the buttermilk will cause the mixture to curdle.) Stir in the dry ingredients and fold in the apple chunks.",
        "Divide the batter evenly among the prepared muffin cups, sprinkling the remaining 1/4 cup brown sugar on top. Bake for 10 minutes, turn the heat down to 400°F, and bake for an additional 5 to 10 minutes, or until a toothpick inserted into the center of a muffin comes out clean. Cool the muffins for 5 minutes in the tin, then turn them out onto a wire rack to cool completely."
      ]
    }
  ],
  {
    "ingredient_list": [
      "Crust",
      "1 stick plus two tablespoons cold salted butter (5 ounces), cut into cubes and chilled in freezer",
      "1 tablespoon sugar (optional)",
      "1 1/2 cup flour",
      "3 to 6 tablespoons ice water",
      "Filling",
      "7 medium apples (I’ve had good results with Granny Smith, Gala, McIntosh…use your favorite, but make sure they are very firm, fresh and flavorful.)",
      "1 stick (4 ounces) salted butter",
      "1 cup sugar"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/05/mollys-apple-tarte-tatin1.jpg?w=500",
    "tags": [
      "Apple",
      "Fall",
      "French",
      "Fruit",
      "Guest Post",
      "Photo",
      "Tarts/Pies"
    ],
    "url": "https://smittenkitchen.com/2008/10/mollys-apple-tarte-tatin/",
    "title": "molly’s apple tarte tatin",
    "directions": [
      "Prepare Crust: I always use the food processor for this. Pre-mix the flour and sugar in the food processor container, and cube the butter on a plate. Then put the dry ingredients and the butter in the freezer for a while. This will get everything, including the blade and container, nice and chilled. The colder everything is, the flakier and more tender your crust will be. Prepare about 1/3 cup ice water and refrigerate.",
      "After you’ve chilled everything for at least 20 minutes, add the cubes of butter to dry ingredients and pulse until the largest pieces of butter are no bigger than tiny peas.",
      "Add the ice water a little at a time, processing just until the dough starts to come together into a mass. (it won’t quite be a “ball,” and it won‘t look smooth–you don’t want to overprocess it!) Turn out onto well-floured surface and pat together into a ball. Don’t handle the dough too much, or the warmth of your hands will start to melt the butter. Flour the top of the dough and use rolling pin to quickly press and roll the dough out into a 10 to 11-inch circle. Keep turning the dough as you do this to make sure it doesn’t stick to the rolling surface. Throw more flour underneath the dough if necessary. Check the crust to make sure it’s just big enough to cover the top of your tarte tatin pan. Move the crust onto a piece of parchment paper or onto a floured rimless baking sheet, cover with plastic wrap and refrigerate.",
      "Prepare filling: Preheat oven to 375° F.",
      "Peel, core and quarter the apples. Don’t cut them into smaller pieces than quarters–the quarters shrink considerably during cooking. You can squeeze a bit of lemon on them, but it’s not necessary.",
      "Over low heat in a heavy, ovenproof skillet measuring 7 to 8 inches across the bottom and 10 to 11 inches across the top, melt the stick of butter. Remove from heat, add the sugar and stir until blended.",
      "Shake/tap the pan so the butter-sugar mixture distributes evenly across the bottom. Arrange apple quarters in pan, first making a circle inside the edge of the pan. Place them on their sides and overlap them so you can fit as many as possible. Then fill the center of the pan; you may have some apple left over. Keep at least one extra apple quarter on hand–when you turn the apples over, they may have shrunk to the extent that you’ll need to cheat and fill in the space with an extra piece. This one piece won’t get quite as caramelized as the other pieces, but don’t worry–it will still cook through and no one will notice.",
      "Return your pan to the stovetop on high heat. Let boil for 10 to 12 minutes or until the juices in the pan turn from golden in color to dark amber. Remove from heat. With the tip of a sharp knife, turn apple slices over, keeping them in their original places. If necessary, add an extra slice of apple to keep your arrangement intact. Return to the stovetop on high heat once more. Let cook another 5 minutes and then remove from heat.",
      "Place the crust on top of the apples and brush off excess flour. Tuck edges under slightly, along the inside of the pan, being careful not to burn fingers. You can use your knife.",
      "Bake in oven until the top of the crust is golden-brown in color, about 25-35 minutes. Remove from oven and allow to cool on a rack about 30 minutes.",
      "Run a sharp knife along the inside edge of the pan. Place a plate or other serving dish on top of the pan and quickly flip over the whole shebang so the Tarte Tatin drops down onto the plate. The pan will still be hot, so use potholders and be careful! Don’t burn yourself or drop stuff! If you are feeble and clumsy, get someone stronger and more coordinated than you to do this. Peek under the edge of the pan to see if the Tarte came out. You may need to bop the bottom of the pan with your potholder-encased fist for this to happen. If there are any pieces of apple left behind in the pan or otherwise out of place, carefully put them back where they are supposed to be. Voila! A beautiful TREAT!",
      "This keeps well for about a day at room temperature; if you have to refrigerate it, warm it up slightly before serving for optimum enjoyment."
    ],
    "date": "2008-10-13T12:00:00+00:00"
  },
  {
    "ingredient_list": [
      "For the apples",
      "6 apples, Mom uses McIntosh apples, I use a mix of whatever looks good",
      "1 tablespoon ground cinnamon",
      "5 tablespoons (65 grams) granulated sugar",
      "For the cake",
      "2 3/4 cups (360 grams) flour",
      "1 tablespoon baking powder",
      "1 teaspoon fine sea or table salt",
      "1 cup (235 ml) vegetable oil (safflower, sunflower, olive and coconut oil also work, as does melted butter)",
      "2 cups (400 grams) granulated sugar",
      "1/4 cup (60 ml) orange juice",
      "2 1/2 (13 ml) teaspoons vanilla extract",
      "4 large eggs",
      "1 cup (130 grams) walnuts, chopped (optional and to be honest, we never use them)"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/09/moms-apple-cake11.jpg?w=640",
    "tags": ["Apple", "Cake", "Everyday Cakes", "Fruit", "Photo"],
    "url": "https://smittenkitchen.com/2008/09/moms-apple-cake/",
    "title": "mom’s apple cake",
    "directions": [
      "Heat oven to 350°F (175°C). Grease a tube pan. (I use this one or an equivalent one-piece tube.) Peel, core and chop apples into 1-inch chunks.Toss with cinnamon and 5 tablespoons sugar and set aside.",
      "Stir together flour, baking powder and salt in a large mixing bowl. In a separate bowl, whisk together oil, orange juice, sugar, vanilla and eggs. Mix wet ingredients into dry ones; scrape down the bowl to ensure all ingredients are incorporated.",
      "Pour half of batter into prepared pan. Spread half of apples (and their juices) over it. Pour the remaining batter over the apples and arrange the remaining apples on top. Bake for about 1 1/2 hours, or until a tester comes out clean.*",
      "Cool completely before running knife between cake and pan, and unmolding onto a platter.",
      "Do ahead: This cake is awesome on the first day but absolutely glorious and pudding-like on the days that follow, so feel free to get an early start on it. I keep it at room temperature covered with foil. ",
      "* Tip: The apples love to hide uncooked pockets of batter, especially near the top. Make sure your testing skewer or toothpick goes not just all the way down to the bottom, but does a shallow dip below the top layer of apples to make sure it comes out batter-free. Should your cake be browning too fast, before the center is baked through, cover it with foil for all but the last few minutes in the oven."
    ],
    "date": "2008-09-30T15:04:48+00:00"
  },
  {
    "ingredient_list": [
      "4 large or 5 small-medium apples (about 2 pounds)",
      "1 tablespoon cornstarch",
      "3 tablespoons plus 1/4 cup raw or Turbinado (often sold as Sugar in the Raw) sugar",
      "1/4 cup plus 3/4 cup rolled oats",
      "1/4 cup sliced or slivered almonds",
      "1/2 cup whole wheat flour (or a mix; see Note up top)",
      "1/4 cup light or dark brown sugar",
      "1/4 teaspoon ground cinnamon",
      "Two pinches sea salt",
      "1/2 teaspoon baking powder",
      "2 tablespoons unsalted butter",
      "1/4 cup olive oil"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/05/multigrain-apple-crisps1.jpg?w=500",
    "tags": ["Apple", "Coconut", "Crumbles/Crisps", "Fruit", "Photo"],
    "url": "https://smittenkitchen.com/2012/03/multigrain-apple-crisps/",
    "title": "multigrain apple crisps",
    "directions": [
      "Preheat oven to 350 degrees. Arrange eight 6-ounce ramekins (these are my favorite) on a baking tray. Peel, halve and core apples, then chop them into a small (about 1/2-inch) dice. The smaller the pieces, the faster the crisps will bake and the less they’ll “deflate” as they cool. Toss apples with 1 tablespoon cornstarch and 3 tablespoons raw sugar until evenly coated, then divide apples between ramekins.",
      "Grind 1/4 cup oats with almonds in a food processor until powdery. (If you have both almond meal and oat flour, you can replace this with 1/4 cup of each.) In a medium bowl, mix oat/almond mixture with remaining rolled oats, wheat flour, remaining 1/4 cup raw sugar, brown sugar, cinnamon, sea salt and baking powder. Melt butter in a small saucepan (or in microwave), then stir in olive oil. Pour mixture over dry ingredients and stir until crumbly. Divide crumbs over each dish of apples, packing them on with your palms if needed to get them all on (don’t worry, the apples will deflate a bit when they bake). ",
      "Bake apple crisps for about 30 to 40 minutes, or until you can see the juices from the apples bubbling around the crumbs. If tops brown too quickly, put a sheet of foil over the whole tray for remaining baking time. Let cool on rack and serve when lukewarm. Store remaining crisps in fridge. They are quite excellent with a dollop of plain yogurt."
    ],
    "date": "2012-03-07T12:28:19+00:00"
  },
  {
    "ingredient_list": [
      "1 extra-large egg yolk (I used one large and a smidgen of another)",
      "1/2 cup plus 2 tablespoons grapeseed oil (suggested for its neutrality; I used half olive oil but suggest you do so sparingly as the olive flavor becomes very pronounced)",
      "2 tablespoons finely diced shallot",
      "1 to 2 lemons, for juicing",
      "1/4 cup crème fraîche (did you know you can make your own?)",
      "1/4 cup buttermilk (did you know you can make your own?)",
      "2 apples, firm, crisp and juicy",
      "2 pears, Asian or your favorite variety",
      "2 heads radicchio",
      "2 tablespoons sliced mint",
      "1 tablespoon chopped flat-leaf parsley",
      "Kosher salt and freshly ground black pepper"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/05/radicchio-apple-and-pear-salad1.jpg?w=500",
    "tags": ["Apple", "Pear", "Photo", "Radicchio", "Salad"],
    "url": "https://smittenkitchen.com/2010/04/radicchio-apple-and-pear-salad/",
    "title": "radicchio, apple and pear salad",
    "directions": [
      "Place the egg yolk in a stainless steel bowl. Begin whisking in the grapeseed oli drop by drop, as slowly as you can bear. (I find having a second person dripping it in makes it easier.) Continue in this manner until the mixture begins to thicken.Once the mayo has emulsified, you can add the rest of the oil in a slow, steady stream (however, as a beginner, I still take it very slowly), whisking all the time. Arm getting tired? Try to murmur “jiggle-free upper arms… sleeveless sundresses…” to yourself. I find it helps.",
      "Combine the shallot, 1 tablespoon lemon juice and 1/2 teaspoon salt in a small bowl and let it sit for 5 minutes. Whisk in the crème fraîche and buttermilk. Gently whisk this mixture into the mayonnaise, and taste for balance and seasoning.",
      "Slice the apples and pears away from the core. Cut into 1/8-inch thick slices (I went even thinner, using a mandoline) and place them in a large salad bowl. Tear the radicchio into bite-sized pieces and add to the salad bowl. Toss salad with half of dressing (Goin suggests three-fourths but I found this to make an overly-creamy salad; you can always add more) and season with salt and pepper. Add a squeeze of lemon juice and a little more dressing if necessary.",
      "Transfer to a platter (chilled, if you’re being fancy) and scatter the mint and parsley on top."
    ],
    "date": "2010-04-04T12:16:36+00:00"
  },
  {
    "ingredient_list": [
      "1 pound bakery white or challah bread, crusts removed, cut into 1-inch cubes",
      "1 Granny Smith apple, peeled and cut into 1/2-inch pieces",
      "1 cup (6 ounces) golden raisins, plumped in hot water for 15 minutes",
      "3 large eggs",
      "3/4 cup sugar",
      "1/4 teaspoon cinnamon",
      "1/8 teaspoon freshly grated nutmeg",
      "1/8 teaspoon ground ginger",
      "1/4 teaspoon pure vanilla extract",
      "1/4 teaspoon salt",
      "3 cups whole milk",
      "2 tablespoons unsulfured molasses",
      "1/4 cup sliced almonds"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2015/05/raisin-studded-apple-bread-pudding1.jpg?w=500",
    "tags": ["Apple", "Fall", "Photo", "Pudding", "Thanksgiving"],
    "url":
      "https://smittenkitchen.com/2009/11/raisin-studded-apple-bread-pudding/",
    "title": "raisin-studded apple bread pudding",
    "directions": [
      "Preheat the oven to 350°F. Spread the bread cubes on a baking sheet and toast in the oven for 6 minutes, until crisp. Transfer to a bowl and add the apple and raisins.",
      "Generously butter either a 9×13-inch deep baking dish or six 8-ounce ramekins. If using ramekins, set them on the baking sheet.",
      "In a medium bowl, using a handheld electric mixer or whisk, beat the eggs with the sugar. Beat in the ground spices, vanilla and salt.",
      "In a medium saucepan, heat the milk with the molasses until just warm to the touch. Gradually beat the warm milk into the egg mixture, scraping the bottom and side of the bowl.",
      "Spread bread mixture out in your large baking dish, or distribute it among ramekins. Pour the custard over the bread mixture, nudging the bread around a bit to make sure it soaks all of the pieces. Let stand for 5 minutes. Sprinkle the almonds on top. Bake in the center of the oven for about 40 minutes, until puffed and set, with the tops lightly browned. Let the bread pudding(s) rest for at least 15 minutes before serving."
    ],
    "date": "2009-11-10T09:53:03+00:00"
  },
  {
    "ingredient_list": [
      "Cake",
      "6 medium apples, any variety you like to bake with, peeled, halved and cored",
      "7 1/2 cups (940 grams) all-purpose flour",
      "1 1/2 teaspoons (10 grams) table salt",
      "1 1/2 teaspoons (8 grams) baking soda",
      "2 tablespoons (30 grams) baking powder",
      "1 tablespoon ground cinnamon",
      "1 1/2 teaspoons (3 grams) ground ginger",
      "1/2 teaspoon (1 gram) ground cloves",
      "1/2 teaspoon (1 gram) freshly grated nutmeg",
      "1 1/2 cups (505 grams) honey",
      "4 1/2 cups (585 grams updated: 1170 grams) applesauce",
      "1 1/2 cups (3 sticks) unsalted butter, at room temperature",
      "1 1/2 cups packed (285 grams) dark-brown sugar",
      "6 large eggs",
      "Frosting",
      "3 8-ounce (675 grams total) blocks cream cheese, at room temperature",
      "1 1/2 cups (3 sticks, 3/4 pound or 340 grams) butter, at room temperature",
      "1 tablespoon (15 ml) vanilla extract",
      "6 cups (720 grams) powdered sugar, sifted"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2012/09/roasted-apple-spice-sheet-cake.jpg?w=750",
    "tags": ["Apple", "Celebration Cakes", "Fall", "Photo"],
    "url": "https://smittenkitchen.com/2012/09/roasted-apple-spice-sheet-cake/",
    "title": "roasted apple spice sheet cake",
    "directions": [
      "Roast apples: Heat oven to 375°F. Line a baking sheet or roasting pan with parchment paper. Arrange apple halves face down on paper and roast in a single layer until they feel dry to the touch and look a little browned underneath, about 20 minutes. Slide parchment paper with apples onto a cooling rack and set aside. Reduce oven temperature to 350°F.",
      "Make cake layers: Butter two 9×13-inch cake pans and line the bottoms with a fitted rectangle of parchment paper. Butter the paper as well. Feel free to use a nonstick baking spray instead of butter, too. [If you, like most people, only have one cake pan, don’t fret. Just bake half the batter and as soon as you can flip the cake out of the pan, wash it and start again with a fresh piece of parchment, baking the remaining batter.]",
      "In a large bowl, whisk together flour, salt, baking soda, baking powder, cinnamon, ginger, cloves and nutmeg. In a medium bowl, whisk together applesauce and honey. ",
      "In a large bowl with an electric mixer, beat the butter and dark brown sugar until very fluffy. Add the eggs, one at a time, scraping down the bowl between every other addition. Add one third of the flour-spice mixture and mix it until just combined. Add half the applesauce-honey mixture, again mixing it until combined. [At this point, if you, like me, have a 5-quart KitchenAid, things are going to get a little full in the bowl. I suggest stirring in the remaining additions carefully by hand.] Add the second third of the flour-spice mixture, the remaining applesauce-honey mixture, and the remaining flour-spice mixture, stirring between each addition. ",
      "Chop roasted apples into smallish chunks (1/2 to 2/3-inches) and fold into batter. Divide batter between baking pans and bake cake layers, rotating the cake pans top to bottom and back-to-front halfway through the baking time, about 35 to 40 minutes, until a tester inserted into the center comes out clean. Transfer baking pans to cooling racks and let rest for 10 minutes, before flipping out of the pans onto racks, removing the parchment paper lining, and cooling the cakes right-side-up.",
      "[Do ahead: I pause my cake-making all of the time here. I freeze the cake layers overnight, or until needed (up to two weeks, longer if your freezer doesn’t make things smell freezer-y for a while), wrapped in a double-layer of plastic wrap. When you’re ready to decorate them, you can do so while the cake is still frozen — it will be easier to handle/move/trim. Simply leave it at room temperature for a few hours once it is decorated or in the fridge for a day to fully defrost. More layer cake tips live here.]",
      "Make the frosting: Whip butter and cream cheese together with an electric mixture until light and fluffy. Beat in vanilla extract. Add powdered sugar and beat again until smooth and light. ",
      "Decorate your cake: Arrange first cake layer on cake board or serving platter, tucking pieces of waxed paper underneath the outer edges to keep your platter clean while you decorate (which I forgot to do, typically). Use a serrated knife to level the top, removing any dome so that the next layer will rest neatly on top. Thickly spread about 1/3 of frosting on the bottom layer, then transfer the cake to the freezer for just 5 or 10 minutes, to firm up the filling. Place the second cake layer on top of the filling. Trim the top again until level (if desired; seeing as you’re not adding another layer, it would be for a neat appearance, not for cake stability). If the sides don’t align perfectly with the bottom layer, you can trim them until straight as well. Thinly apply a coat of frosting over entire exterior of cake. Once again, you can get this to “set” quickly by sliding the cake into the freezer for 5 minutes. One set, add your final coat of frosting, a thicker more decorative one. (This is of course where you can add any decorations desired. You should have plenty of leftover frosting to go to town with.)",
      "Remove bits of waxed paper and serve with a big “ta-da!” Should any survive the party, this cake keeps exceptionally well in the fridge. Five days out, our leftover pieces are, if possible, more moist than one day one."
    ],
    "date": "2012-09-18T11:39:51+00:00"
  },
  {
    "ingredient_list": [],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2007/11/simplest-apple-tart.jpg?w=750",
    "tags": ["Apple", "Fall", "Photo", "Tarts/Pies"],
    "url": "https://smittenkitchen.com/2007/11/simplest-apple-tart/",
    "title": "simplest apple tart",
    "directions": [
      "MIX flour, sugar, and salt in a large bowl; add 2 tablespoons of the butter. Blend in a mixer until dough resembles coarse cornmeal. Add remaining butter; mix until biggest pieces look like large peas. ",
      "DRIBBLE in water, stir, then dribble in more, until dough just holds together. Toss with hands, letting it fall through fingers, until it’s ropy with some dry patches. If dry patches predominate, add another tablespoon water. Keep tossing until you can roll dough into a ball. Flatten into a 4-inch-thick disk; refrigerate. After at least 30 minutes, remove; let soften so it’s malleable but still cold. Smooth cracks at edges. On a lightly floured surface, roll into a 14-inch circle about 1/8 inch thick. Dust excess flour from both sides with a dry pastry brush. ",
      "PLACE dough in a lightly greased 9-inch round tart pan, or simply on a parchment-lined baking sheet if you wish to go free-form, or galette-style with it. Heat oven to 400°F. (If you have a pizza stone, place it in the center of the rack.) ",
      "OVERLAP apples on dough in a ring 2 inches from edge if going galette-style, or up to the sides if using the tart pan. Continue inward until you reach the center. Fold any dough hanging over pan back onto itself; crimp edges at 1-inch intervals. ",
      "BRUSH melted butter over apples and onto dough edge. Sprinkle 2 tablespoons sugar over dough edge and the other 3 tablespoons over apples. (Deb note: I found it nearly impossible to coat it with this much sugar, so I used a little less–more like 3 tablespoons. It made a lightly sweet tart, which we found perfect.)",
      "BAKE in center of oven until apples are soft, with browned edges, and crust has caramelized to a dark golden brown (about 45 minutes), making sure to rotate tart every 15 minutes. ",
      "MAKE glaze: Put reserved peels and cores in a large saucepan, along with sugar. Pour in just enough water to cover; simmer for 25 minutes. Strain syrup through cheesecloth. ",
      "REMOVE tart from oven, and slide off parchment onto cooling rack. Let cool at least 15 minutes. ",
      "BRUSH glaze over tart, slice, and serve. "
    ],
    "date": "2007-11-05T23:42:40+00:00"
  },
  {
    "ingredient_list": [
      "Lid",
      "7 tablespoons (100 grams) unsalted butter, at room temperature",
      "1/2 cup (100 grams) granulated sugar",
      "1/2 teaspoon finely grated orange zest",
      "1 large egg, lightly beaten",
      "1 cup plus 6 1/2 tablespoons (175 grams) all-purpose flour",
      "1/2 teaspoon baking powder",
      "1/4 teaspoon coarse or flaky salt (or less of table salt)",
      "Milk or cream, for brushing crust",
      "Coarse or fine sugar, for sprinkling crust",
      "Softly whipped, lightly sweetened cream, for serving",
      "Filling",
      "1 pound ripe prune plums or greengages, halved, pitted, and halved again (i.e. quartered)",
      "1 pound apples, peeled, cored and cut into smaller chunks (than you see in my photos)",
      "2 tablespoons sugar",
      "1/8 teaspoon ground cinnamon",
      "Squeeze or two of orange or lemon juice"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2010/10/single-crust-apple-plum-pie.jpg?w=749",
    "tags": ["Apple", "Fall", "Photo", "Plum", "Tarts/Pies"],
    "url":
      "https://smittenkitchen.com/2010/10/single-crust-plum-and-apple-pie/",
    "title": "single-crust plum and apple pie",
    "directions": [
      "Make the lid: In a stand mixer, cream the butter, sugar and orange zest until light and fluffy. Mix in the lightly beaten egg and scrape down sides. Slowly add the flour, baking powder and salt and beat until combined. Scrape dough into a piece of waxed paper or plastic wrap, and stick in the freezer for 10 to 20 minutes, or until firmed up.",
      "Assemble the pie: Preheat oven to 350°F (180°C or gas mark 4) Butter a pie or baking dish. Add the fruit and spinkle it with the sugar, cinnamon and orange or lemon juice. Gently toss the ingredients together once or twice; don’t worry, they’ll “muddle” well once cooking in the oven.",
      "Roll out the firmed-up lid dough on a very well floured counter and gently lift it onto the pie and trim the overhang. It will tear. This is fine, and all the better to let juice erupt through. If it flusters you, you can use some of the trimmings to patch it up but still, the pie will bubble through in other places. Brush the crust with milk or cream, sprinkle with sugar and bake for 40 minutes, until lightly golden on top. Scoop onto dishes and serve with whipped cream."
    ],
    "date": "2010-10-01T11:33:17+00:00"
  },
  {
    "ingredient_list": [
      "For cake",
      "2 cups (8 3/4 ounces or 250 grams) all-purpose flour",
      "2 teaspoons (10 grams) baking powder",
      "1/2 teaspoon (3 grams) baking soda",
      "1/2 teaspoon (3 grams) salt",
      "3/4 teaspoon (2 grams) cinnamon",
      "1/2 teaspoon (1 gram) ground ginger",
      "1/8 teaspoon ground cloves",
      "1 stick (4 ounces or 113 grams) unsalted butter, softened",
      "1 cup (6 7/8 ounces or 195 grams) packed light brown sugar (updated weight)",
      "1 teaspoon (5 ml) pure vanilla extract",
      "2 large eggs",
      "1 1/2 cups (about 13 ounces or 365 grams) unsweetened applesauce",
      "1/2 cup (about 1 3/4 ounces or 50 grams) walnuts (optional), toasted, cooled, and chopped",
      "For frosting",
      "5 ounces (142 grams) cream cheese, softened",
      "3 tablespoons (1 1/2 ounces or 42 grams) unsalted butter, softened",
      "1/4 teaspoon pure vanilla extract",
      "1 cup (4 ounces or 120 grams) confectioners sugar",
      "1/2 (1 teaspoon) teaspoon cinnamon"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2010/10/spiced-applesauce-cake.jpg?w=749",
    "tags": ["Apple", "Cake", "Everyday Cakes", "Fall", "Photo"],
    "url": "https://smittenkitchen.com/2010/10/spiced-applesauce-cake/",
    "title": "spiced applesauce cake",
    "directions": [
      "Preheat oven to 350°F with rack in middle. Butter an 8- or 9-inch square cake pan. I had no trouble getting my cake out of a nonstick pan by just buttering it, but if you don’t have a nonstick cake pan or are a little nervous, line the bottom with parchment paper and butter that too.",
      "Make cake: Whisk together flour, baking powder, baking soda, salt, and spices. Beat butter, brown sugar, and vanilla with an electric mixer at high speed until pale and fluffy, 2 to 3 minutes. Add eggs one at a time, beating well after each addition, then beat in applesauce. At low speed, mix in flour mixture until just combined, then stir in walnuts (if using). The batter will look a little curdly and uneven but don’t worry, it will all bake up perfectly in the end.",
      "Spread batter evenly in pan and bake until golden-brown and a wooden pick inserted into center comes out clean, about 35 to 40 minutes. Cool in pan 15 minutes. Run a knife around edge of cake to loosen, then invert onto a plate. Reinvert cake onto a rack to cool completely. You can speed this up, as I always do, in the fridge.",
      "Make frosting: Beat cream cheese, butter, and vanilla with an electric mixer at high speed until fluffy. Sift confectioners sugar and cinnamon over cream cheese mixture, then beat at medium speed until incorporated. Spread frosting over top of cooled cake.",
      "Do ahead: We were impressed with how well this cake kept for three days but were unable to “research” if it lasted longer. Keep frosted cake in the fridge. If you’d like to bake the cake further in advance, I’d wrap it well and freeze it until the day you need it. Leave it out on the counter to defrost and frost it up to a day in advance."
    ],
    "date": "2010-10-25T11:48:25+00:00"
  },
  {
    "ingredient_list": [
      "Topping",
      "4 tiny-to-small apples, halved, peeled and cored",
      "2 tablespoons fresh lemon juice",
      "2 tablespoons granulated sugar",
      "Batter",
      "1/2 cup plus 1 tablespoon (125 grams) unsalted butter, at room temperature",
      "1/4 cup plus 2 tablespoons (6 tablespoons) granulated sugar",
      "1/4 cup honey (any variety you like to eat)",
      "1 teaspoon vanilla extract",
      "3 large eggs, separated",
      "2 good pinches of salt",
      "2 teaspoons baking powder",
      "1 1/4 cups all-purpose flour",
      "Glaze",
      "1/4 cup honey",
      "A good pinch of sea salt"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2014/10/sunken-apple-cake-with-salted-honey-glaze1.jpg?w=640",
    "tags": [
      "Apple",
      "Cake",
      "Everyday Cakes",
      "Fall",
      "German",
      "Jewish",
      "Photo"
    ],
    "url": "https://smittenkitchen.com/2014/09/sunken-apple-and-honey-cake/",
    "title": "sunken apple and honey cake",
    "directions": [
      "Heat oven: To 350°F. Coat a 9-inch springform with butter or a nonstick spray. Line the bottom of the pan with a round of parchment paper. ",
      "Prepare apples: Place peeled, halved and cored apples cut-side-down on a cutting board. Use a knife to create parallel thin slices, but only cut halfway through each apple so that the apples stay intact. Don’t fret if you cut through, however; you can just reassemble the halves on the cake in a few minutes.",
      "In a bowl, toss apples with lemon juice and 2 tablespoon granulated sugar.",
      "Prepare cake base: Beat butter and 1/4 cup plus 2 tablespoons granulated sugar together in a bowl with electric beaters until fluffy. Add honey and beat until combined. Add vanilla and egg yolks, beating until just combined. Sprinkle salt and baking powder over cake batter, and mix for just 5 seconds, until they disappear. Add flour, half at a time, mixing only until just combined.",
      "In a separate bowl with cleaned beaters, beat egg whites until stiff. Stir 1/4 of them into the cake batter, to lighten it a little. Fold in the rest in three additions. It will seem impossible to fold in at first because the batter is so stiff, but it will loosen with careful folding. Only fold the last addition of egg whites until it has mostly disappeared (a couple faint streaks of egg white are fine). ",
      "Spread cake batter in prepared cake pan, smoothing the top. Arrange apple halves facedown over the cake batter. To warn, 4 tiny/small apples will definitely fit over the cake batter. When I made it with 4 small-almost-medium apples, I could only fit 3 1/2 of them. No need to press the apples into the batter. You can pour any extra lemon juice and sugar in the bowl over the apples.",
      "Bake cake: 35 to 40 minutes, until a toothpick or skewer inserted into the center of the cake comes out clean. Let rest on a cooling rack for 5 minutes, then cut around the cake to make sure it’s not sticking to the pan at all, and unhinge the sides. Let cake cool completely. You can store it at room temperature at this point, or after you add the honey, for up to 5 days 3 days at room temperature. After that, a fridge is best for longevity. The cake is lovelier on day 2 than day 1.",
      "Before serving, if you’d like the glaze to look glossy, or whenever the cake is cool, if you don’t mind if the honey sinks into the cake: Warm 1/4 cup honey and a good pinch of sea salt until it liquefies to the point where it makes a thin glaze — this will take less than 30 seconds. Brush honey-salt mixture over cooled cake. "
    ],
    "date": "2014-09-22T12:17:45+00:00"
  },
  {
    "ingredient_list": [
      "1 cup (120 grams) whole wheat flour",
      "1 cup (130 grams) all-purpose flour",
      "1 teaspoon baking powder",
      "1 teaspoon baking soda",
      "1/4 teaspoon salt",
      "1 tablespoon cinnamon",
      "1/2 cup (115 grams) unsalted butter, at room temperature",
      "1/2 cup (100 grams) granulated sugar",
      "1/2 cup (95 grams) dark brown sugar, packed, divided",
      "1 large egg, lightly beaten",
      "1 cup buttermilk (235 ml) or yogurt (230 grams)",
      "2 large apples, peeled, cored, and coarsely chopped"
    ],
    "img":
      "https://smittenkitchendotcom.files.wordpress.com/2008/04/whole-wheat-apple-muffins.jpg?w=750",
    "tags": [
      "Apple",
      "Breakfast",
      "Brunch",
      "Fruit",
      "Muffin/Quick Bread",
      "Photo"
    ],
    "url": "https://smittenkitchen.com/2008/04/whole-wheat-apple-muffins/",
    "title": "whole wheat apple muffins",
    "directions": [
      "Preheat the oven to 450°F. Grease and flour 18 muffin cups and set aside.",
      "Mix together the flours, baking powder, baking soda, salt, and cinnamon, and set aside. In a separate bowl, cream the butter and add the granulated sugar and 1/4 cup of the brown sugar. Beat until fluffy. Add the egg and mix well; stop once to scrape the sides and bottom of the bowl.Mix in the buttermilk gently. (If you over-mix, the buttermilk will cause the mixture to curdle.) Stir in the dry ingredients and fold in the apple chunks.",
      "Divide the batter evenly among the prepared muffin cups, sprinkling the remaining 1/4 cup brown sugar on top. Bake for 10 minutes, turn the heat down to 400°F, and bake for an additional 5 to 10 minutes, or until a toothpick inserted into the center of a muffin comes out clean. Cool the muffins for 5 minutes in the tin, then turn them out onto a wire rack to cool completely."
    ],
    "date": "2008-04-11T16:46:04+00:00"
  }
]
