{
  "date": "2007-11-05T23:42:40+00:00",
  "directions": [
    "MIX flour, sugar, and salt in a large bowl; add 2 tablespoons of the butter. Blend in a mixer until dough resembles coarse cornmeal. Add remaining butter; mix until biggest pieces look like large peas. ",
    "DRIBBLE in water, stir, then dribble in more, until dough just holds together. Toss with hands, letting it fall through fingers, until it’s ropy with some dry patches. If dry patches predominate, add another tablespoon water. Keep tossing until you can roll dough into a ball. Flatten into a 4-inch-thick disk; refrigerate. After at least 30 minutes, remove; let soften so it’s malleable but still cold. Smooth cracks at edges. On a lightly floured surface, roll into a 14-inch circle about 1/8 inch thick. Dust excess flour from both sides with a dry pastry brush. ",
    "PLACE dough in a lightly greased 9-inch round tart pan, or simply on a parchment-lined baking sheet if you wish to go free-form, or galette-style with it. Heat oven to 400°F. (If you have a pizza stone, place it in the center of the rack.) ",
    "OVERLAP apples on dough in a ring 2 inches from edge if going galette-style, or up to the sides if using the tart pan. Continue inward until you reach the center. Fold any dough hanging over pan back onto itself; crimp edges at 1-inch intervals. ",
    "BRUSH melted butter over apples and onto dough edge. Sprinkle 2 tablespoons sugar over dough edge and the other 3 tablespoons over apples. (Deb note: I found it nearly impossible to coat it with this much sugar, so I used a little less–more like 3 tablespoons. It made a lightly sweet tart, which we found perfect.)",
    "BAKE in center of oven until apples are soft, with browned edges, and crust has caramelized to a dark golden brown (about 45 minutes), making sure to rotate tart every 15 minutes. ",
    "MAKE glaze: Put reserved peels and cores in a large saucepan, along with sugar. Pour in just enough water to cover; simmer for 25 minutes. Strain syrup through cheesecloth. ",
    "REMOVE tart from oven, and slide off parchment onto cooling rack. Let cool at least 15 minutes. ",
    "BRUSH glaze over tart, slice, and serve. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/11/simplest-apple-tart.jpg?w=750",
  "ingredient_list": [],
  "tags": [
    "Apple",
    "Fall",
    "Photo",
    "Tarts/Pies"
  ],
  "title": "simplest apple tart",
  "url": "https://smittenkitchen.com/2007/11/simplest-apple-tart/"
}