{
  "date": "2010-10-01T11:33:17+00:00",
  "directions": [
    "Make the lid: In a stand mixer, cream the butter, sugar and orange zest until light and fluffy. Mix in the lightly beaten egg and scrape down sides. Slowly add the flour, baking powder and salt and beat until combined. Scrape dough into a piece of waxed paper or plastic wrap, and stick in the freezer for 10 to 20 minutes, or until firmed up.",
    "Assemble the pie: Preheat oven to 350°F (180°C or gas mark 4) Butter a pie or baking dish. Add the fruit and spinkle it with the sugar, cinnamon and orange or lemon juice. Gently toss the ingredients together once or twice; don’t worry, they’ll “muddle” well once cooking in the oven.",
    "Roll out the firmed-up lid dough on a very well floured counter and gently lift it onto the pie and trim the overhang. It will tear. This is fine, and all the better to let juice erupt through. If it flusters you, you can use some of the trimmings to patch it up but still, the pie will bubble through in other places. Brush the crust with milk or cream, sprinkle with sugar and bake for 40 minutes, until lightly golden on top. Scoop onto dishes and serve with whipped cream."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/single-crust-apple-plum-pie.jpg?w=749",
  "ingredient_list": [
    "Lid",
    "7 tablespoons (100 grams) unsalted butter, at room temperature",
    "1/2 cup (100 grams) granulated sugar",
    "1/2 teaspoon finely grated orange zest",
    "1 large egg, lightly beaten",
    "1 cup plus 6 1/2 tablespoons (175 grams) all-purpose flour",
    "1/2 teaspoon baking powder",
    "1/4 teaspoon coarse or flaky salt (or less of table salt)",
    "Milk or cream, for brushing crust",
    "Coarse or fine sugar, for sprinkling crust",
    "Softly whipped, lightly sweetened cream, for serving",
    "Filling",
    "1 pound ripe prune plums or greengages, halved, pitted, and halved again (i.e. quartered)",
    "1 pound apples, peeled, cored and cut into smaller chunks (than you see in my photos)",
    "2 tablespoons sugar",
    "1/8 teaspoon ground cinnamon",
    "Squeeze or two of orange or lemon juice"
  ],
  "tags": [
    "Apple",
    "Fall",
    "Photo",
    "Plum",
    "Tarts/Pies"
  ],
  "title": "single-crust plum and apple pie",
  "url": "https://smittenkitchen.com/2010/10/single-crust-plum-and-apple-pie/"
}