{
  "date": "2008-05-30T12:31:04+00:00",
  "directions": [
    "Make your spice rub and cover those ribs in it ASAP.  The longer they sit in the spices, the better, but let them sit at least an hour.  Let them sit up to 24 hours if you want.  Wrap them in plastic and refrigerate them until it’s almost time to put them on the grill.  You can let them sit at room temperature for 10-15 minutes or so before starting the BBQ process.",
    "These ribs take about 3 hours total cooking time, sometimes more and sometimes less, depending on how hot your fire is and how thick the slabs of ribs are. [More detailed instructions below.]",
    "Everything You Need to Know to Buy, Prep and Cook the Ribs",
    "Buying Ribs: I use St. Louis-style ribs, because you get more meat for your money.  When you smoke these babies for as long as three hours, you end up with a completely tender result, though the meat on baby-back ribs is technically “more tender.”   I am feeding a crowd of hungry, eager people when I do this, and I would have to spend twice as much money (read: over $100) on meat if I used baby-back instead of St. Louis-style ribs.  Plus there wouldn’t be enough room on the grill to make dinner for everyone.  You have to eat at least six baby-back ribs to be happy, as opposed to three St. Louis-style’s.  For my first experiments with BBQ, I used the pre-packaged racks of ribs that are available in most supermarkets’ meat departments for about $12 apiece, but the fresher they are, the better.  In fact,  I would advise you to ask your butcher when (s)he gets deliveries of fresh ribs, and plan your BBQ-ing accordingly.",
    "Prepping the Ribs:  I don’t cut out the connective tissue/membrane before cooking.  I realize there is a massive, contentious debate about this in BBQ-ing circles, but I don’t really have an opinion on the matter, other than (1) it seems tricky and time-consuming; (2) I don’t know how; (3) I can’t imagine that the ribs could be any more tender.  The membrane basically breaks down during the cooking process.  Maybe it leaves a bit of a ultra-thin, crispy remnant on the bone side of the ribs.  I don’t know.  I don’t feel the need to perform this surgery.  It seems like an unnecessary fuss if you ask me.  Well, it looks like maybe I did have an opinion on the matter, doesn’t it?  I like the membrane, OK?  I like the crispy little membrane wafer you get when you’re done.",
    "Cooking the Ribs:"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mollys-dry-rubbed-ribs1.jpg?w=500",
  "ingredient_list": [
    "1/4 cup packed dark brown sugar",
    "1/2 cup paprika (sweet or hot)",
    "1/4 cup chili powder",
    "2 tablespoons ground red pepper",
    "2 tablespoons ground cumin",
    "1 teaspoon ground mace",
    "1/4 cup salt",
    "1/4 cup cracked black peppercorns"
  ],
  "tags": [
    "Grilling",
    "Guest Post",
    "Meat",
    "Photo"
  ],
  "title": "molly’s dry-rubbed ribs",
  "url": "https://smittenkitchen.com/2008/05/mollys-dry-rubbed-ribs/"
}