{
  "date": "2008-10-08T13:47:56+00:00",
  "directions": [
    "Optional: 2 cups canned cherry pie filling (Comstock is specified)",
    "Preheat oven to 350 degrees. Parboil the noodles (five to seven minutes).",
    "In a very large bowl beat eggs until fluffy. Add the sugar gradually, then the cottage cheese, margarine or butter and vanilla. Stir in the drained noodles.",
    "Pour into a 9×13-inch pan. Bake for 1 1/2 hours, or until kugel is set. If using the cherry pie filling as a topping, pour it over at the one-hour mark, then bake it for an additional 30 minutes.",
    "Deb note: Your baking time may, of course, vary. Check for doneness at one hour and go from there. Our oven, always running cool, took almost two hours to bake this. At home, my mothers inferno of an oven does it in an hour.",
    "About the topping: Okay, so apparently, the original version of this recipe has the cherry pie filling (from! a! can!) as a topping and apparently, my father says that some segments of my family still bake it this way. I have yet to see it, and my mother has never used it. Should you want to try some version of this but avoid the mystery-in-a-can stuff, a quick cherry pie filling can be made with a bag of frozen sour cherries cooked with half a cup of water in a saucepan for about 10 minutes. Mix 1/2 cup of sugar with 1 tablespoon of cornstarch and stir these into the pot. The mixture will thicken within a couple minutes. Cool before using."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2008/10/my-familys-noodle-kugel.jpg?w=753",
  "ingredient_list": [
    "1 pound wide egg noodles",
    "8 eggs",
    "2 cups sugar (Mom uses 1 1/2 cups)",
    "2 pounds full-fat cottage cheese, creamed or large curd",
    "2 sticks (1 cup or 8 ounces) melted unsalted butter or margarine (Mom uses 1 1/2 sticks butter)",
    "2 teaspoons vanilla",
    "Dash of salt"
  ],
  "tags": [
    "Guest Post",
    "Jewish",
    "Photo"
  ],
  "title": "my family’s noodle kugel",
  "url": "https://smittenkitchen.com/2008/10/my-familys-noodle-kugel/"
}