{
  "date": "2014-11-24T12:16:16+00:00",
  "directions": [
    "Make the pie dough: ",
    "Form the crust: On a floured counter, roll the dough out into a 12 to 13-inch circle-ish shape. Fold dough gently in quarters without creasing and transfer to a 9-inch standard (not deep-dish) pie plate. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. Return to fridge until ready to fill. ",
    "[Optional: If you’d like to par-bake the crust, once you’ve rolled it out, freeze it for 10 minutes inside your pie tin, until solid. Prick unbaked crust with a fork several times. Line it with lightly buttered foil. Fill with pie weights, dried beans or pennies. Bake at 400°F (205°C) on rimmed baking sheet 15 minutes. Remove paper or foil and weights, and bake 5 to 10 more minutes until crust is golden brown and lightly crisp.]",
    "Heat oven: (Or reduce oven heat, if you just par-baked your crust) to 375°F (190°C).",
    "Make the filling: Combine all filling ingredients — no need to defrost frozen cranberries, they’ll just need a couple extra minutes to warm up — in a medium saucepan over medium heat. After about 5 minutes, berries will begin to leak juices. Cook, stirring for 5 minutes more until filling is loose. If desired, you can lightly crush the mixture once or twice with a potato masher, but try to leave most berries intact. Transfer filling to a bowl to let it cool slightly for 5 to 10 minutes while you make the crumble topping.",
    "Make the topping: If using whole oats, grind them to a powder in a food processor. Add pecans and coarsely grind them too. Add remaining ingredients except the butter, pulsing a few times to combine. Add butter, pulsing until crumbles form. Sprinkle topping over cranberry filling.",
    "Bake pie: For 45 to 50 minutes, until juices are bubbling enough that they splash a bit onto the crumb topping. If pie browns too quickly, cover top with a piece of foil for remaining baking time. Transfer to a wire rack to cool a bit before serving showered with powdered sugar and alongside whipped cream or vanilla ice cream."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cranberry-pie-with-thick-pecan-crumble1.jpg?w=640",
  "ingredient_list": [
    "Crust",
    "1 1/4 cups (155 grams) all-purpose flour",
    "1 1/2 teaspoons (6 grams) granulated sugar",
    "1/2 teaspoon (3 grams) fine sea or table salt",
    "1 stick (4 ounces or 115 grams) cold unsalted butter, cut into chunks",
    "1/4 cup (60 ml) very cold water, plus an additional tablespoon if needed",
    "Filling",
    "4 1/2 cups fresh or frozen cranberries (from 1 1/2 12-ounce bags)",
    "1 cup granulated sugar, plus 1 to 2 more tablespoons, if desired, to taste",
    "A few gratings of orange zest (yes, clementine zest works great here too)",
    "A pinch of salt",
    "1 tablespoon cornstarch",
    "Streusel",
    "2/3 cup rolled oats or 1/2 cup oat flour",
    "1/2 cup all-purpose flour",
    "1/3 cup granulated sugar",
    "1/3 cup light or dark brown sugar",
    "1/2 teaspoon ground cinnamon",
    "1/4 teaspoon coarse or sea salt",
    "3/4 cup pecans, toasted if you have the time",
    "6 tablespoons unsalted butter, melted and cooled",
    "To serve",
    "Powdered sugar, sweetened whipped cream with a splash of vanilla extract or vanilla ice cream"
  ],
  "tags": [
    "Cranberries",
    "Fall",
    "Photo",
    "Tarts/Pies",
    "Thanksgiving"
  ],
  "title": "cranberry pie with thick pecan crumble",
  "url": "https://smittenkitchen.com/2014/11/cranberry-pie-with-thick-pecan-crumble/"
}