{
  "date": "2007-10-31T18:15:19+00:00",
  "directions": [
    "1. Keep (or preheat) the oven to 350 degrees. Measure the cream and butter into a saucepan and heat it over low heat. When the butter has melted completely, remove from heat.",
    "2. To make the caramel, spread the sugar evenly in a perfectly dry, deep 10-inch skillet and place it over medium-low heat.",
    "3. The sugar should turn straw-colored, then gold and then a nutty-brown caramel after about 10 minutes. If the sugar cooks unevenly, gently tilt or swirl the pan to evenly distribute the sugar. Remove from heat and slowly whisk the cream and butter into the sugar, which can splatter as the cream is added (long sleeves are a good precaution). If the caramel seizes, return it to the heat and continue to stir until it is smooth and creamy. Strain the caramel into a bowl and cool it for 30 minutes.",
    "4. Stir the frozen cranberries and the almonds into the caramel and mix until all the fruit and nuts are coated. Spoon the filling into the partially baked tart dough mounding toward the center.",
    "5. Bake for 25 to 30 minutes, until the juices and the caramel are bubbling slowly around the edges. Remove from the oven and let stand for 1 hour, then gently lift the tart ring off the pastry.",
    "6. Carefully transfer the tart to a serving platter. Serve warm or at room temperature."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cranberry-caramel-and-almond-tart1.jpg?w=640",
  "ingredient_list": [
    "13 tablespoons (1 stick plus 5 tablespoons) unsalted butter, cut into 1-inch pieces",
    "1/3 cup powdered sugar",
    "1 egg yolk",
    "1 1/2 cups unbleached flour",
    "1 tablespoon heavy cream",
    "1 1/4 cups heavy cream",
    "1/2 cup (1 stick) unsalted butter, cut into eight pieces",
    "1 cup granulated sugar",
    "1 3/4 cup frozen cranberries",
    "2 cups unblanched sliced almonds"
  ],
  "tags": [
    "Cranberries",
    "Fall",
    "Fruit",
    "Photo",
    "Tarts/Pies",
    "Thanksgiving"
  ],
  "title": "cranberry, caramel and almond tart",
  "url": "https://smittenkitchen.com/2007/10/cranberry-caramel-and-almond-tart/"
}