{
  "date": "2015-03-10T12:07:27+00:00",
  "directions": [
    "Make green grains: In a blender or food processor, combine poblanos, cilantro, onion and garlic with a splash of cooking broth or water and puree until smooth. In a medium saucepan, combine wheat berries, remaining cooking water or broth, 3/4 of green puree and salt to taste over high heat and bring to a boil. Reduce to a very low simmer and cover, cooking for 1 hour, or until grains are chewy-tender. Add remaining green puree and cook for 5 minutes more. ",
    "Meanwhile, make red beans: In a smaller saucepan, heat olive oil over medium. Add garlic and cook for 30 seconds, just until sizzling. Add chipotle, cumin, oregano and tomato paste and cook together for 1 minute. Add water or broth, beans and salt to taste and bring to a gentle simmer. Cook for 10 minutes on low.",
    "Assemble and eat: For each bowl, I like about 2/3 grains and 1/3 beans, but you can go half-half as well. Top with desired fixings, don’t hold back. (The sour cream was particularly awesome here, in our opinion, although decidedly un-vegan.) Repeat as needed.",
    "* Cilantro: If you’ve been following along for a while here (although I cannot imagine why my persnickety ingredient preferences would hold your attention), you might have heard me refer over the years to cilantro as “the devil’s herb” as I am one of the unfortunate ones for whom it tastes mostly like dirt. Yes, unfortunate, as it comes on or in almost every cuisine I adore. I don’t know what came over me this week, but I went to the store with a plan to replace the cilantro with parsley, as I often do, and bought the evil greens instead. And cooked with them. And ate them. Maybe it’s the blending with peppers, onions and broth that mellowed it. Maybe, for once, these food cravings could be for good, and not just butter. Either way: hooray! "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/green-grain-and-red-bean-taco-bowl1.jpg?w=750",
  "ingredient_list": [
    "Grains",
    "2 fresh poblano chile peppers, seeded and roughly chopped",
    "1 cup cilantro leaves (picked from 1 bunch)",
    "3/4 medium white onion, roughly chopped (I save the last 1/4 to finely mince as a topping)",
    "2 cloves garlic, chopped",
    "3 cups water or broth (amount needed for wheat berries, adjust if needed)",
    "1 cup uncooked wheatberries",
    "Salt to taste",
    "Beans",
    "1 tablespoon olive oil",
    "1 clove garlic, minced",
    "1/2 to 1 finely chopped chipotle from a can, a rehydrated and finely chopped dried chipotle or in a pinch, chipotle powder to taste",
    "1 teaspoon ground cumin",
    "1/2 teaspoon dried oregano",
    "1 1/2 tablespoons tomato paste",
    "1/2 cup water or broth",
    "1 3/4 cups cooked small red beans (from a 15-ounce can, or cooked from about 1/4 pound dried)",
    "Kosher or coarse salt to taste",
    "Fixings",
    "Minced white onion or picked red onions, lime wedges, hot sauce, pickled jalapenos, sour cream or Mexican crema, sliced avocado, pico de galo, crumbled or shredded cheese or some crumbled tortilla chips if you’re having trouble convincing your child to try it "
  ],
  "tags": [
    "Beans",
    "Budget",
    "Grain/Rice",
    "Tex-Mex",
    "Vegan",
    "Vegetarian"
  ],
  "title": "red bean and green grain taco bowl",
  "url": "https://smittenkitchen.com/2015/03/red-bean-and-green-grain-taco-bowl/"
}