{
  "date": "2009-11-17T11:37:41+00:00",
  "directions": [
    "Preheat the oven to 375°F.",
    "Pour 1 1/2 inches of water into a 3-quart stock part with a strainer basket suspended over it and bring to a boil over medium-high heat. Add the sweet potatoes, cover and steam until fork-tender, about 20 minutes. Place the steamed sweet potatoes in a large bowl and let cool to room temperature. Mash them into a smooth puree with a fork or potato masher (though I suspect that a potato ricer would also do a great job). You should have 1 1/4 cups puree; discard any excess (by topping with a pat of butter, sprinkling with salt and making yourself a most-excellent snack). Add the butter, lemon juice if using, nutmeg, cinnamon and salt and mix thoroughly with a wooden spoon or rubber spatula after each addition.",
    "In a small bowl, beat the egg yolks lightly with a whisk, about 30 seconds. Add the sugar and beat until they’re a creamy lemon-yellow color, about 1 1/2 minutes. Add the egg mixture to the sweet potato mixture and stir until the eggs are thoroughly incorporated and the filling is a consistent bright orange color. Add the flour a little at a time, stirring after each addition until thoroughly incorporated. Add the buttermilk and again stir until smooth and even.",
    "With a cleaned whisk (or electric hand mixer), whisk the egg whites to soft peaks in a clean, dry bowl. With a wooden spoon or rubber spatula, gently fold the egg whites into the sweet potato-buttermilk mixture until thoroughly combined. Pour the mixture into the prebaked crust and bake on the middle rack of the oven until the center is firm and set, 35 to 40 minutes.",
    "Remove the pie from the oven and cool completely on a rack. Serve at room temperature (or cold from the fridge; you can cover it with plastic wrap before chilling) with a dollop of whipped cream.",
    "To pre-bake your pie crust, choose a method: “Proper” method — Lay a sheet of aluminum foil over the dough and carefully scatter pie weights, dried beans or pennies over it. Bake on the middle rick of your oven at 325°F for 12 to 15 minutes. Remove the pie weights and the foil, prick the bottom of the crust with a fork, and bake for 10 minutes more.",
    "Deb’s “Cheater” method — Freeze your rolled-out pie shell for 20 to 30 minutes until solid. Press a piece of buttered foil, buttered side down, very frozen shell and blind bake it at 325°F for 20 minutes, then carefully pull back the foil, press any part of the crust that has bubbled up gently back with the back of a spoon, prick the bottom of the crust with a fork, and bake for 10 minutes more."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/sweet-potato-pie.jpg?w=753",
  "ingredient_list": [
    "1 1/2 pounds sweet potatoes (about 2 medium potatoes), peeled and chopped into a 1/2-inch dice",
    "4 tablespoons unsalted butter, melted",
    "2 tablespoons fresh lemon juice (optional)",
    "1/2 teaspoon freshly grated nutmeg",
    "1/2 teaspoon ground cinnamon",
    "1/2 teaspoon kosher salt",
    "3 large eggs, separated",
    "1/2 cup sugar",
    "2 tablespoons all-purpose flour",
    "3/4 cup full- or lowfat buttermilk (or, you can make your own)",
    "1 All-Butter, Really Flaky Pie Crust (a half recipe will yield a single crust), prebaked (instructions below)",
    "Whipped cream, for serving"
  ],
  "tags": [
    "Fall",
    "Photo",
    "Potatoes",
    "Tarts/Pies",
    "Thanksgiving"
  ],
  "title": "sweet potato buttermilk pie",
  "url": "https://smittenkitchen.com/2009/11/sweet-potato-buttermilk-pie/"
}