{
  "date": "2016-08-12T12:14:48+00:00",
  "directions": [
    "Make wafers in a food processor: Combine flour, cocoa powders, sugar, salt and baking powder in the work bowl of a food processor, pulsing until mixed. Add butter and run machine until it is powdery. Add egg and vanilla and run machine until the dough begins to clump/ball together.",
    "Make wafers with an electric mixer: Beat butter and sugar together until combined. Add egg and vanilla and beat until smooth. Add baking powder, salt and cocoa and beat until combined. Add flour and mix just until it disapepars.\nBoth methods: Heat oven to 350 degrees F. Divide dough into 6 equal pieces. Roll first between 2 pieces of parchment paper until very, very thin and just over 7 inches across. Slide onto board (parchment paper and all) and place in freezer for 10 minutes, until firm. Once firm, peel back top piece of parchment paper (it should now come off cleanly, with a gently pulling back) and use a stencil or bowl with a 7-inch rim to trim it into a neater circle. Slide cookie round and lower piece of parchment paper onto a baking sheet. Bake for 10 minutes and let cool completely on paper, which you can slice onto a cooling rack so that you can use the tray again. Repeat with remaining 5 pieces of dough.",
    "It sounds like a lot of work but the best thing is to get into a pattern where one piece is being rolled while another is freezing while the third one bakes and fourth one is cooling so you’re never working with more than one piece at a time. By the time one piece bakes, the next is ready to leave the freezer.\nWhile cookies cool, make peanut butter whipped cream: In a large bowl, beat peanut butter, vanilla, salt and sugar until smooth. Beating the whole time, slowly add heavy cream, a small splash at a time, until peanut butter-cream mixture is loose enough that you can add the rest of the cream without breaking it into clumps. Whip cream, watching it carefully as it’s very easy to overbeat with an electric mixer, until soft peaks form.\nPlace first cookie on a cake stand. If it’s sliding around, as cookies do, put a dab of whipped cream down first. Once it softens the cookie, it will make it stick. Thickly frost first cookie all the way to the edges with about 1/2 cup peanut butter cream. Repeat with remaining cookies, decoratively swirling the top cookie. Garnish with sprinkles or candy.",
    "Place cake in the fridge overnight or ideally closer to 24 hours so that the cookies soften into cake layers. A knife dipped in warm water will make clean cuts."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_50251.jpg?w=750",
  "ingredient_list": [
    "1 1/2 cups (195 grams) all-purpose flour",
    "1/4 cup (20 grams) Dutch-process cocoa powder",
    "1/4 cup (20 grams) black cocoa powder (see Note; just use more Dutched cocoa powder if you don’t have it)",
    "1 cup (200 grams) granulated sugar",
    "1/2 teaspoon fine sea or table salt",
    "1/2 teaspoon baking powder",
    "1/2 cup (115 grams) unsalted butter, cold is fine if using a food processor",
    "1 large egg",
    "1 teaspoon (5 ml) vanilla extract",
    "3 tablespoons (50 grams) smooth peanut butter",
    "3/4 teaspoon vanilla extract",
    "A couple pinches salt",
    "1 1/2 tablespoons (20 grams) granulated sugar",
    "1 1/2 cups heavy (355 ml) or whipping cream, cold",
    null
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Peanut Butter",
    "Photo"
  ],
  "title": "chocolate peanut butter icebox cake",
  "url": "https://smittenkitchen.com/2016/08/chocolate-peanut-butter-icebox-cake/"
}