{
  "date": "2014-08-04T12:14:40+00:00",
  "directions": [
    "Cook the noodles in well-salted water until tender but firm for the time recommended on your package of noodles. What, your package is only in Japanese, like mine? Most are cooked between 5 and 8 minutes, so test at 5 and add more minutes if needed.",
    "Meanwhile, grate, julienne or thinly slice vegetables of your choice.",
    "Drain noodles and run cold water over them to cool. Drain again, shaking out excess water.",
    "Make the dressing by whisking the smaller amount of miso plus the remaining sauce ingredients in a bowl. Taste and adjust to make sweeter (with more sugar) or more intense and salty (with the last tablespoon of miso) if desired. ",
    "Divide noodles among four bowls; toss each with a tablespoon of the sauce, plus more to taste. Top with vegetables and extra droplets of sauce. Serve with lime wedges.",
    "The leftovers won’t keep well with the sauce on. It’s best to keep it in one container and the noodles and vegetables in another, combining when needed, if you have extras. ",
    "Notes:"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/cold-noodles-with-miso-lime-and-ginger1.jpg?w=640",
  "ingredient_list": [
    "Noodles and vegetables",
    "8 ounces buckwheat noodles",
    "A mixture of raw vegetables of your choice (such as carrots, cucumbers, radishes or daikon; see Note for more suggestions)",
    "Sauce",
    "2 to 3 tablespoons miso (red is recommend; white would be just fine)",
    "1 2-inch piece ginger, finely grated",
    "2 teaspoons granulated sugar",
    "1/8 teaspoon ground cayenne, or to taste",
    "2 tablespoons mirin",
    "1 tablespoon soy sauce",
    "2 tablespoons lime juice (from about 1 lime), plus lime wedges for serving"
  ],
  "tags": [
    "Citrus",
    "Cucumber",
    "Japanese",
    "Lunch",
    "Pasta",
    "Photo",
    "Radishes",
    "Summer",
    "Vegan",
    "Vegetarian"
  ],
  "title": "cold noodles with miso, lime and ginger",
  "url": "https://smittenkitchen.com/2014/08/cold-noodles-with-miso-lime-and-ginger/"
}