{
  "date": "2013-01-15T11:29:05+00:00",
  "directions": [
    "Bake potatoes: Heat your oven to 400 degrees. Bake potatoes for 45 minutes to 1 hour, depending on size, until a thin knife can easily pierce through them. Meanwhile, prepare the tomato broth.",
    "Make tomato broth: Heat the oil in a heavy pot over medium-high heat. One it’s hot, add the carrot, celery, and onion, and cook together for 5 minutes, reducing the heat to medium if they begin to brown. Add the garlic, and cook for one minute more. Pour in the wine, and use it to scrape up any browned bits stuck to the bottom of the pan, then cook the wine unti it is reduced by half, for several minutes. Stir in the tomatoes, mashing them a bit with a spoon if they’re whole, and the basil and stock, and simmer until the tomato broth thickens slightly, for about 45 minutes. Strain out the vegetables in a fine-mesh colander, and season the broth with salt and pepper to taste. Set aside until needed.",
    "Make gnocchi: Let the potatoes cool for 10 minutes after baking, then peel them with a knife or a peeler. Run the potatoes through a potato ricer or grate them on the large holes of a box grater (grated baked potatoes will fall apart, which is the goal). Cool them to lukewarm, about another 10 minutes. Add the egg and salt, mixing to combine. Add 1/2 cup flour, and mix to combine. Add the next 1/2 cup flour, mixing again. Add 1/4 cup flour, and see if this is enough to form a dough that does not easily stick to your hands. If not, add the last 1/4 cup of flour, 1 tablespoon at a time, until the dough is soft but only a little sticky, and able to hold its shape enough to be rolled into a rope. Knead the dough together briefly, gently, on a counter, just for a minute.",
    "Divide the dough into quarters. Roll each piece into a long rope, about 3/4-inch thick. Cut each rope into 3/4-inch lengths. At this point, you can use a floured fork or a gnocchi board to give each piece the traditional ridges, but I never bother. (The ridges are supposed to help sauce adhere, but here, we’re just floating them in a broth so it’s not a top concern.) Place the gnocchi on a a parchment-lined tray. ",
    "[Do ahead: If you’d like to freeze gnocchi for later user, do so on this tray. Once they are frozen, drop them into a freezer bag until needed. No need to defrost before cooking them; it will just take a minute or two longer.]",
    "Cook gnocchi: Place the gnocchi, a quarter-batch at a time, into a pot of boiling well-salted water. Cook the gnocchi until they float — about 2 minutes — then drain. ",
    "Assemble dish: Meanwhile, reheat broth to a simmer. Add drained gnocchi then reheat through. Serve gnocchi and broth together, garnished with a few slivers of basil leaves and/or a dollop of fresh ricotto or some Parmesan shavings, if desired."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/gnocchi-in-tomato-broth-more-book-tour1.jpg?w=500",
  "ingredient_list": [
    "Tomato broth",
    "2 tablespoons (30 ml) olive oil",
    "1 medium carrot, chopped",
    "1 medium stalk celery, chopped",
    "1 small yellow onion, chopped",
    "3 garlic cloves, peeled and smashed",
    "1/2 cup (120 ml) white wine",
    "One 28-ounce (795 grams) can whole or chopped tomatoes with juices",
    "Small handful fresh basil leaves, plus more for garnish",
    "2 cups (475 ml) chicken or vegetable stock",
    "Salt and freshly ground black pepper, to taste",
    "Gnocchi",
    "2 pounds (905 grams) Russet potatoes (3 to 4)",
    "1 large egg, lightly beaten",
    "1 teaspoon table salt",
    "1 1/4 to 1 1/2 cups (156 to 190 grams) all-purpose flour, plus more for dusting surface",
    "To finish",
    "Fresh ricotta or shaved Parmesan, to taste, plus addition slivers of basil leaves (optional)"
  ],
  "tags": [
    "Italian",
    "Pasta",
    "Photo",
    "Soup",
    "Vegetarian"
  ],
  "title": "gnocchi in tomato broth + more book tour",
  "url": "https://smittenkitchen.com/2013/01/gnocchi-in-tomato-broth-more-book-tour/"
}