{
  "date": "2015-06-22T12:03:00+00:00",
  "directions": [
    "Cook the pasta: If you’ve got an oven-save 3-quart deep skillet or braising pan, use it here and you’ll only need one pot for the whole recipe. Otherwise, bring an medium/large pot of well-salted water to a boil. Add pasta and cook until al dente, about 1 to 2 minutes before perfect doneness. Drain and set aside.",
    "Heat oven: To 400 degrees.",
    "Prepare the squash: Heat a large skillet or the pot you just used to cook your pasta to high heat. Once hot, add olive oil, and let it heat until almost smoking. Add sliced squash, season it with salt and pepper flakes and let it sear underneath, unmoved, until golden brown. Continue to saute until browned and somewhat wilted, about 10 minutes, trying to get some color on each layer before moving squash around. Transfer to a bowl and squeeze lemon juice over bowl. Add more salt or pepper if needed.",
    "Make the sauce: Reheat your the same pot over medium heat. Melt butter in bottom of pan. Add scallion white and pale green parts and garlic and let sizzle for 1 to 2 minutes. Add flour and stir until all has been dampened and absorbed. Add milk, a very small splash at a time, stirring the whole time with a spoon. Make sure each splash has been fully mixed into the butter/flour/onion/garlic mixture, scraping from the bottom of the pan and all around, before adding the next splash. Repeat until all milk has been added, then add lemon zest, salt and pepper to taste. Let mixture simmer together for 2 minutes, stirring frequently; the sauce will thicken. Remove pan from heat and stir in half of chopped parsley, all of mixed herbs and reserved scallion greens. Adjust seasoning to taste.",
    "Assemble dish: Off the heat, add drained pasta, summer squash, 1/2 cup grated parmesan and all of the mozzarella to the pot, stirring to combine. If pan is ovenproof, you can bake your final dish in it. If not, transfer mixture to a 2 to 3 quart ovenproof casserole or baking dish. Sprinkle with remaining 1/4 cup parmesan.",
    "Bake: For 25 to 30 minutes, until edges of pasta are golden brown and irresistible. Sprinkle with reserved parsley and serve hot. Reheat as needed.",
    "To freeze: Let dish fully cool to room temperature, then transfer, wrapped well, to the freezer. Let defrost in fridge for a day before rewarming in oven. If I have time, I like to rewarm at a lowish head (300 to 325 degrees) with the foil on, then finish it for the last 10 minutes or so at a higher heat without the foil to restore some crisp."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/herbed-summer-squash-pasta-bake1.jpg?w=640",
  "ingredient_list": [
    "8 ounces pasta, any shape you like",
    "1 tablespoon olive oil",
    "1 pound summer squash, halved lengthwise and sliced thin",
    "1 teaspoon finely grated lemon zest (you won’t need this yet, but better to zest before juicing, to avoid grumpiness)",
    "Juice of half a lemon",
    "3 tablespoons (45 grams) unsalted butter",
    "2 cloves garlic, minced",
    "3 large or 5 skinny scallions, sliced thin and white/pale green parts and dark green tops in separate piles",
    "Pinches of red pepper flakes, to taste",
    "3 tablespoons (25 grams) all-purpose flour",
    "1 1/2 cups milk, ideally whole but low-fat will also work",
    "1/4 cup chopped flat-leaf parsley, divided",
    "1 tablespoon finely chopped mixed herbs of your choice (I used a mix of thyme, oregano and mint, but if you only have, say, thyme or oregano, a full tablespoon will likely overwhelm, so use less)",
    "Salt and more pepper to taste",
    "3/4 cup finely grated parmesan or aged pecorino romano cheese, divided",
    "4 ounces (115 grams) mozzarella, cut into small cubes"
  ],
  "tags": [
    "Freezer Friendly",
    "Italian",
    "Pasta",
    "Photo",
    "Summer",
    "Summer Squash",
    "Vegetarian",
    "Zucchini"
  ],
  "title": "herbed summer squash pasta bake",
  "url": "https://smittenkitchen.com/2015/06/herbed-summer-squash-pasta-bake/"
}