{
  "date": "2007-03-29T12:01:41+00:00",
  "directions": [
    "Make Filling: Heat olive oil in a large pan at medium heat. Saute shallots and garlic for 7 to 10 minutes, until they are soft and translucent, but not brown. Add arugula, turning and stirring it frequently, until it has cooked down, its water has largely evaporated but it hasn’t lost it’s color — about 3 to 5 minutes. Let mixture cool, then add bread crumbs and Romano cheese. Taste filling and season it as needed with salt and pepper. Add the egg yolk, stirring mixture until combined. Set aside.",
    "To Make Ravioli Without a Ravioli Mold: Cut your pasta dough into 4 pieces, then flatten each piece into a rough rectangle and cover rectangles with an inverted large bowl. Set rollers of pasta machine on widest setting.",
    "Lightly dust 1 rectangle with flour and feed through rollers. (Keep remaining rectangles under bowl.) Fold rectangle in half and feed it, folded end first, through rollers 7 or 8 more times, folding it in half each time and feeding folded end through. Dust with flour if necessary to prevent sticking. Turn dial to next (narrower) setting and feed dough through rollers without folding. Continue to feed dough through rollers once at each setting, without folding, until you reach narrowest setting. Dough will be a smooth sheet (about 24 inches long and 4 inches wide). ",
    "Put sheet of dough on a floured work surface and drop 6 (1 1/2 teaspoon) mounds of filling 1 1/2  inches apart in a row down center of one half of sheet. Brush egg wash around each mound, then fold other half of sheet over filling. Press down firmly around each mound, forcing out air. (Air pockets increase the chance that ravioli will break during cooking.) Cut pasta (between mounds) with cutter into 3-inch rounds. Line a large shallow baking pan with a clean kitchen towel (not terry cloth) and dust towel with flour, then arrange ravioli in 1 layer in it. Make more ravioli with remaining pasta dough, 1 sheet at a time, and remaining filling, transferring ravioli to lined pan.",
    "To Make Ravioli From Wonton Wrappers: Line 2 baking sheets with heavy-duty foil; spray foil with nonstick spray. Place 4 wonton wrappers on work surface; cover remaining wrappers with plastic to prevent drying. Lightly brush entire surface of each wrapper with egg white. Spoon 1 generous teaspoon filling into center of each wrapper. Fold wrappers diagonally in half, forming triangles. Press edges firmly to seal. Arrange ravioli on prepared sheets. Repeat with remaining wrappers and filling.",
    "Cooking time will vary, depending on the thickness of your dough. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/little-wraps1.jpg?w=500",
  "ingredient_list": [
    "2 tablespoons olive oil",
    "2 large shallots, finely chopped",
    "2 garlic cloves, minced",
    "8 ounces arugula, washed, dried, coarse stems removed and coarsely chopped",
    "3 tablespoons breadcrumbs measured from 2 slices or one half of a roll, pulsed in the food processor until reduced to soft crumbs",
    "1/3 cup finely grated Romano cheese",
    "Salt and pepper to taste",
    "1 egg yolk (reserve egg white for sealing)",
    "1 half-batch of fresh pasta–or–1 package of wonton wrappers",
    "1 egg white beaten with two tablespoons of water to seal ravioli"
  ],
  "tags": [
    "Arugula",
    "Italian",
    "Pasta",
    "Photo"
  ],
  "title": "arugula ravioli",
  "url": "https://smittenkitchen.com/2007/03/little-wraps/"
}