{
  "date": "2010-05-02T16:08:38+00:00",
  "directions": [
    "Whisk the dry ingredients (oat flour, flour, sugar, baking powder and salt) together in a large bowl. In a smaller bowl, whisk the butter, milk, cooked oatmeal, honey and eggs together until thoroughly combined. Gently fold the wet ingredients into the dry ingredients. Using a light hand is important for tender pancakes; the batter should be slightly thick with a holey surface.",
    "Heat a 10-inch cast-iron pan or griddle over medium heat until water sizzles when splashed onto the pan. Lower to medium-low. (This is my tip; I find pancakes impossible to cook well over higher heats. I’ve got more pancake tips over here.) Rub the pan generously with butter; Boyce says this is the key to crisp, buttery edges. Working quickly, dollop 1/4-cup mounds of batter onto the pan, 2 or 3 at a time. Once bubbles have begun to form on the top side of the pancake, flip the pancake and cook until the bottom is dark golden-brown, about 5 minutes total. Wipe the pan with a cloth before griddling the next pancake. Continue with the rest of the batter.",
    "Serve the pancakes hot, straight from the skillet or keep them warm in a low oven. We also found these to reheat surprisingly well the next morning, again in a low oven.",
    "Do ahead: Although the batter is best if using immediately, it can sit for up to 1 hour on the counter or overnight in the refrigerator. When you return to the batter, it will be very thick and should be thinned, one tablespoon at a time, with milk. Take care not to overmix.",
    "* Make oatmeal, if you don’t have any leftover: Bring 1 cup water and a slightly heaped 1/2 cup of rolled oats (old-fashioned or quick-cooking) and a pinch of salt to a boil and simmer on low for 1 (quick-cooking) to 5 minutes (old-fashioned), until thick. Let cool. This can also be cooked in a microwave."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/oatmeal-pancakes1.jpg?w=640",
  "ingredient_list": [
    "3/4 cup (90 grams) oat flour (you can make this by pulsing rolled oats into a food processor or spice grinder until finely ground; 1 cup of oats yielded 3/4 cup oat flour for me)",
    "1 cup (130 grams) all-purpose flour",
    "2 tablespoons (25 grams) sugar",
    "2 teaspoon baking powder",
    "3/4 teaspoon Kosher or coarse salt",
    "3 tablespoons (45 grams) unsalted butter, melted and cooled slightly (plus extra for the pan)",
    "1 1/4 cups (295 ml) whole milk",
    "1 cup cooked oatmeal*",
    "1 tablespoon (20 grams) unsulphured (not blackstrap) molasses or 1 tablespoon honey",
    "2 large eggs"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Pancakes",
    "Photo"
  ],
  "title": "oatmeal pancakes",
  "url": "https://smittenkitchen.com/2010/05/oatmeal-pancakes/"
}