{
  "date": "2007-01-02T17:45:57+00:00",
  "directions": [
    "Stir dry ingredients, including yeast, in a large bowl. Add water and olive oil, stirring mixture into as close to a ball as you can. Dump all clumps and floury bits onto a lightly floured surface and knead everything into a homogeneous ball. ",
    "If you are finding this step difficult, one of the best tricks I picked up from my bread-making class is to simply pause. Leave the dough in a lightly-floured spot, put the empty bowl upside-down on top of it and come back in 2 to 5 minutes, at which point you will find the dough a lot more lovable.",
    "Knead it for just a minute or two. Lightly oil the bowl (a spritz of cooking spray perfectly does the trick) where you had mixed it — one-bowl recipe! — dump the dough in, turn it over so all sides are coated, cover it in plastic wrap and leave it undisturbed for an hour or two, until it has doubled in size. ",
    "Dump it back on the floured counter (yup, I leave mine messy), and gently press the air out of the dough with the palm of your hands. Fold the piece into an approximate ball shape, and let it sit under that plastic wrap for 20 more minutes. ",
    "Sprinkle a pizza stone or baking sheet with cornmeal and preheat your oven to its top temperature. Roll out the pizza, toss on whatever topping and seasonings you like. (I always err on the side of skimpy with toppings so to not weight down the dough too much, or if I have multiple toppings, to keep them very thinly sliced.) ",
    "Bake it for about 10 minutes until it’s lightly blistered and impossible to resist."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pizza-and-the-limits-of-diy1.jpg?w=500",
  "ingredient_list": [
    "1 1/2 cups (190 grams) flour (can replace up to half of this with whole wheat flour)",
    "1 teaspoon (6 grams) table salt",
    "3/4 teaspoon (about 2 grams) active dry yeast",
    "1/2 cup (120 ml) lukewarm water (may need up to 1 or 2 tablespoons more)",
    "1 tablespoon (15 ml) olive oil"
  ],
  "tags": [
    "Photo",
    "Pizza"
  ],
  "title": "really simple homemade pizza",
  "url": "https://smittenkitchen.com/2007/01/pizza-and-the-limits-of-diy/"
}