{
  "date": "2015-10-15T11:56:41+00:00",
  "directions": [
    "Preheat the oven to 350°F. Line a rimmed baking sheet with parchment paper.",
    "In a medium bowl, whisk together the light brown sugar and eggs until smooth. Whisk in the vanilla extract, then the peanut butter until smooth and completely incorporated; you shouldn’t be able to see any ribbons of peanut butter. Ovenly says you know the dough is ready when it has the consistency of Play-Doh, but I can tell you as the mom of a Play-Doh fanatic that mine was thinner, softer.",
    "If you’d like to get those pretty striations across the top of the cookies, chill the dough by freezing it in its bowl for 15 minutes, stirring it once (so the edges don’t freeze first), before scooping it. If you’re not obsessed with these markings, you can scoop it right away. Scoop or spoon the dough into balls — Ovenly uses about a 1/4-cup scoop (probably #16); I use a 1 2/3 tablespoons or #40 scoop. Place on prepared pan. For the tallest final shape, place the tray in the freezer for 15 minutes before baking.",
    "Sprinkle the dough balls lightly with coarse-grained sea salt just before baking. Bake smaller cookies for 14 to 15 minutes and larger for 18 to 20. When finished, cookies should be golden at edges. They’ll need to set on the sheet for a minute or two before they can be lifted intact to a cooling sheet. Trust me, you should let these cool completely before eating so the different textures (crisp outside, soft inside) can set up.",
    "Do ahead: You can definitely make the dough in advance and either refrigerate it for a couple days or freeze it longer. However, if I were going to freeze it, I’d probably go ahead and scoop it first. You can bake them right from the freezer.",
    "About chilling the dough: The Ovenly recipe says you can scoop and bake the cookies right away, but they keep their shape better if you chill them in the freezer for 15 minutes first. I tried it with and without and did find a better dome and final shape with the 15 minutes after. However, I was incredibly charmed by the striated marks from the cookie scoop on top of the cookie I bought last weekend, as well as in the photo in their book, and I realized that I couldn’t get it at home with just-mixed dough; you’ll get more of a blob shape from your scoop. So, I also chilled the dough for 15 minutes before scooping it and was then satisfied with the shape. It’s not necessary unless you’re as taken with top pattern as I am.",
    "Two questions I suspect someone will ask very soon: Can you make this with all-natural peanut butter and can you make this with almond or a nut butter? The answer to both is yes, however, the authors themselves warn that you’ll get the best final shape and texture from a smooth, thick processed peanut butter like Skippy (their recommendation; updated to note, thanks to a commenter suggestion, that the 16.3-ounce jar of Skippy is estimated to contain 1 3/4 cups, saving you some measuring). I suspect an almond or cashew butter will have a similar effect as natural peanut butter. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/salted-peanut-butter-cookies1.jpg?w=750",
  "ingredient_list": [
    "1 3/4 cups (335 grams) packed light brown sugar",
    "2 large eggs, at room temperature",
    "1/2 teaspoon vanilla extract",
    "1 3/4 cups (450 grams) smooth peanut butter (see note at end)",
    "Coarse-grained sea salt, to finish"
  ],
  "tags": [
    "Cookie",
    "Dairy-Free",
    "Gluten-Free",
    "Peanut Butter",
    "Photo",
    "Quick"
  ],
  "title": "salted peanut butter cookies",
  "url": "https://smittenkitchen.com/2015/10/salted-peanut-butter-cookies/"
}