{
  "date": "2011-08-06T18:39:31+00:00",
  "directions": [
    "Make crepes: In a blender, combine crepe ingredients. (Alternately, in a bowl with an immersion blender, or whisked vigorously by hand.) Cover with plastic wrap and refrigerate for an hour or up to two days.",
    "Preheat a medium skillet or crepe pan over medium-high heat. Once heated, brush pan lightly with melted butter or oil. Pour 1/4 cup batter into skillet, swirling it until it evenly coats the bottom and cook, undisturbed, until the bottom is golden and the top is set, about 2 minutes. Carefully flip and cook on other side for 5 to 10 seconds. Transfer wrapper to paper towel covered plate. Continue with remaining batter.",
    "Prepare filling: (Optional, see Note up top.) Melt the butter in heavy, large skillet (or, the one you just used for crepes, because I’m on day 9 of a broken dishwasher and will not create additional work for myself) over moderately high heat. Add the plums and cook them for 2 minutes, tossing them about until they’re warmed through. Add the honey and cinnamon and cook them for 1 minute more. Squeeze the juice of half a lemon over them and transfer to a bowl. Cover the bowl with foil if you’re looking to keep them warm for a while.",
    "Assemble: Lay a crepe on a plate. Dollop a couple spoonfuls of ricotta down middle of crepe. Add a spoonful or two of warm plums. Sprinkle with pistachios and mint, if using. Drizzle with extra honey, if desired (it otherwise won’t be very sweet). Fold crepe sides over each other, so that they slightly overlap. Garnish with extra mint. Close your eyes pretend you’re eating them on a boat in the Mediterranean, watching the sun slip behind the sea. Try not to impale your foot with a wooden racecar while you do, as it’s bad for morale.",
    "Do ahead: Fully cooked, crepes can be kept stacked and wrapped in the fridge for two days, if needed. The sauteed fruit can be cooked ahead of time, gently rewarmed when needed."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sugar-plum-crepes-with-ricotta-and-honey1.jpg?w=500",
  "ingredient_list": [
    "Crepes",
    "2 tablespoons butter, melted and cooled slightly (I browned this first, which probably won’t surprise you)",
    "1/2 cup milk (fat level shouldn’t matter, but I use whole)",
    "2 large eggs",
    "1/2 cup all-purpose flour",
    "Two pinches of salt",
    "Few gratings fresh nutmeg",
    "2 tablespoons honey",
    "Plums",
    "1 pound sugar or other plums, pitted and cut into quarters if tiny, eighths if larger",
    "1 tablespoon unsalted butter",
    "1 tablespoon honey",
    "Pinch of ground cinnamon",
    "Juice of half a lemon",
    "Assembly",
    "1 cup ricotta (ever wanted to make your own?)",
    "3 tablespoons slivered fresh mint leaves",
    "Toasted and chopped pistachios or almonds",
    "Additional honey, if desired"
  ],
  "tags": [
    "Pancakes",
    "Photo",
    "Plum",
    "Summer"
  ],
  "title": "sugar plum crepes with ricotta and honey",
  "url": "https://smittenkitchen.com/2011/08/sugar-plum-crepes-with-ricotta-and-honey/"
}