{
  "date": "2010-04-01T10:32:18+00:00",
  "directions": [
    "Prepare the sauce: Heat a large skillet over medium high heat and sauté onions in vegetable oil, stirring occasionally, until caramelized and most of liquid has evaporated, about 15 minutes. Add halved garlic cloves and saute for 3 minutes more. Stir in spices and seasoning (paprika, salt, garlic and onion powders, black pepper, cayenne, oregano and thyme) and cook for 2 minutes. Set aside.",
    "In a large bowl, stir together the beef stock, ketchup, chili sauce and brown sugar. Don’t worry if your brown sugar is lumpy (mine always is), the acidity of the ingredients will quickly break it down.",
    "If baking in oven: Preheat oven to 350 degrees. Place brisket in a baking dish or casserole, spread onion mixture over the top, then pour sauce mixture over the entire dish. Cover tightly with foil bake until very tender but not falling apart, about 3 to 4 hours. ",
    "If making in a slow cooker (which I highly, highly recommend): Place brisket in a slow cooker, spread onion mixture over the top, then pour sauce mixture over the entire dish. Cover with the lid and cook it on LOW for 10 hours. (I like to start it before I go to bed, and process it in the morning to rest over the course of the day in the fridge.) ",
    "For both methods, rest the dish: When the brisket is cooked but still hot, use a spoon to scrape off any large fat deposits adhered to the top and bottom of the brisket. (This part is easiest to do when hot. The sauce will be de-fatted after it has chilled.)  ",
    "If you’re using a slow cooker, transfer the brisket and all of its sauce to a baking dish. If you’ve baked it in the oven, you can continue in that same dish. ",
    "Chill entire dish in the fridge for several hours and up to one day; this resting time will  significantly enhance the flavor and texture of the meat. ",
    "An hour before you’re ready to serve it: Preheat your oven to 300°F, and remove the dish from the fridge. Remove all of the fat that has solidified with a slotted spoon for a less oily finish.",
    "Carefully remove the meat from its sauce and place on a large cutting board. Cut the brisket into 1/2-inch slices. ",
    "If you like a smoother sauce (I do) this is a good time to run it through a blender or literally just smash up the onion and garlic strands with a wooden spoon. They’ll be so soft, that’s all it takes. ",
    "Carefully place the sliced meat (moving it in large sections with a spatula helps keep it together) back into the sauce and spoon the sauce over the meat.  Replace the lid or cover the dish tightly with foil and reheat in the oven until it is bubbling at the edges — this usually takes up to to 30 minutes. ",
    "* If you are very strictly kosher for Passover — generally, at an Orthodox level — you’ll want to find versions without corn syrup in them."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/tangy-spiced-brisket.jpg?w=752",
  "ingredient_list": [
    "3 large onions, sliced",
    "3 tablespoons vegetable oil",
    "6 garlic cloves, peeled and halved",
    "1 teaspoon paprika",
    "2 teaspoons salt",
    "1 1/2 teaspoons garlic powder",
    "1 1/4 teaspoons black pepper",
    "1 1/2 teaspoons onion powder",
    "1/8 to 1/4 teaspoon cayenne (adjust to your heat preference)",
    "1/2 teaspoon dried oregano",
    "1/2 teaspoon dried thyme",
    "2 cups beef stock (unsalted or low salt)",
    "1 cup ketchup*",
    "1 cup chili sauce* (I’m realizing from comments that there are many many types; I used Heinz, which is not exactly spicy)",
    "1 cup brown sugar (light or dark)",
    "8 to 10 pound brisket"
  ],
  "tags": [
    "Jewish",
    "Meat",
    "Passover",
    "Photo",
    "Slow Cooker"
  ],
  "title": "tangy spiced brisket",
  "url": "https://smittenkitchen.com/2010/04/tangy-spiced-brisket/"
}