{
  "date": "2016-07-22T11:51:40+00:00",
  "directions": [
    "Make the pastry: Stir the flour, sugar and salt together in a large bowl. Sprinkle butter over dough and using a pastry blender or your fingertips, work it into the flour until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. Sprinkle sour cream and 3 tablespoons water over mixture and stir it to combine; it should form large clumps. Transfer clumps of dough onto a piece of plastic or waxed paper and pat into a ball. Wrap into a packet and refrigerate for 1 hour, or up to 2 days, or you can hasten the firming process along in the freezer, for about 20 minutes.\nMeanwhile, make the filling: In a small bowl, combine blackberries, 1 tablespoon of the sugar, a squeeze of lime juice and cornstarch. Stir and set aside..\nIn a medium bowl, beat cream cheese with whole egg and egg white until light and fluffy. Beat in 7 tablespoons remaining sugar, zest, vanilla and a pinch of salt.\nAssemble the galette: Heat oven to 350 degrees F. Coat a 9-inch cake pan (springform or standard), standard pie dish or 9-inch removable-bottom tart pan or plain pastry ring (on a larger baking sheet) with nonstick spray and place on a baking sheet. Line the bottom with a circle of parchment paper for extra security.",
    "On a floured counter, roll chilled dough into a large (12- to 14-inch) circle. If your kitchen is very warm and it’s softening too quickly, stick it in the freezer for a couple minutes at any point to make it easier to work with. Carefully drape the dough in the prepared pan, let the edges hang down the sides. Pour in cream cheese batter then spoon blackberry mixture and any juices that have puddled in the bowl over the cream cheese in dollops. You can use a toothpick to lightly swirl them together, being careful not to poke through the bottom of the dough. Gently lift the dough’s overhang and pinch it into loose creases —  you’re going to want to do this in the air hovering over the filling and not by pressing down on it, of course, because the filling is liquid. Gently, loosely lay the creases down over the filling; repeat all around. Do not fuss over getting the creases or any other part of this pretty; it will be, no matter what. ",
    "Combine egg yolk and water in a small dish and gently dab over outside of crust with a brush. Because the filling under it is liquid, here too, don’t strive for perfection. Sprinkle crust with coarse sugar. Sprinkle whole tart (filling and crust) with chopped pistachios, if desired.\nBake galette: For 35 minutes, or until a tester inserted into the cheesecake portion comes out batter-free. Let cool in pan on a rack; I move it right to the fridge because cheesecake is best cold. Once fully cold, if it can be unmolded (from a springform, tart pan, pastry ring or loosened easily from a pie pan), you can transfer it to a serving plate. Cut into wedges. Don’t forget to share."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/07/img_3886.jpg?w=750",
  "ingredient_list": [
    "1 1/4 cups (160 grams) all-purpose flour",
    "1/4 teaspoon fine sea or table salt",
    "1 1/2 teaspoons granulated sugar",
    "8 tablespoons (4 ounces or 113 grams) cold unsalted butter, cut into pieces",
    "1/4 cup yogurt or sour cream",
    "3 to 4 tablespoons cold water",
    "1 cup (4 1/4 ounces) blackberries, halved",
    "1/2 cup sugar, divided",
    "A squeeze of lime juice",
    "1 teaspoon cornstarch",
    "1 (8-ounce) package cream cheese, softened",
    "1 large egg plus 1 large egg white (you’ll use the yolk in a minute)",
    "A few scrapings (from about 1/4 lime) lime zest",
    "1/2 teaspoon vanilla extract",
    "Pinch of salt",
    "1 egg yolk beaten",
    "1/2 teaspoon water",
    "1 heaped teaspoon turbinado or coarse sugar for sprinkling",
    "1 tablespoon chopped pistachios (optional)"
  ],
  "tags": [
    "Blackberries",
    "Fruit",
    "Photo",
    "Recipes",
    "Sweets",
    "Tarts/Pies"
  ],
  "title": "blackberry cheesecake galette",
  "url": "https://smittenkitchen.com/2016/07/blackberry-cheesecake-galette/"
}