{
  "date": "2017-06-13T11:56:56+00:00",
  "directions": [
    "Make shortcakes: Heat oven to 400 degrees F. Line a large baking sheet with parchment paper.\nIn a large bowl, whisk together flour, baking powder, baking soda, granulated sugar, and salt until thoroughly combined. Add butter and using your fingertips or a pastry blender, break it into small bits, the largest should be no bigger than a small pea. In a small bowl, whisk yolks with a splash of cream, then pour rest of cream in and whisk to combine. Pour into butter-flour mixture and use a rubber spatula to mix and mash it together into one cohesive dough.",
    "Divide dough into 6 (for large, 3 1/2 to 3 3/4-inch wide and up to 2-inch tall) shortcakes or 8 smaller ones. I do this by pressing the dough somewhat flat into the bottom of the bowl (to form a circle) and using a knife to divide it into pie-like wedges. Place raw or turbinado sugar in a small bowl. Roll each wedge of shortcake into a ball in your hands and roll it through the raw/turbinado sugar, coating it in all but a small area that you should leave bare. (I found that the sugar underneath the shortcakes would burn, so better to leave it off.)\nPlace it, bare spot down, on the prepared baking sheet. Repeat with remaining wedges of dough. Bake for 15 minutes, until lightly golden all over. Let cool completely on tray or on a cooling rack.\nWhile cooling, prepare fruit and cream:  Mix berries, 2 tablespoons sugar (more or less to taste), and lemon juice, if desired, in a bowl and let macerate so that the juices run out.\nIn a larger bowl, beat cream until soft peaks form. Add sugar to taste, or leave unsweetened, if that’s your preference.\nTo serve: Carefully split each cooled shortcake with a serrated knife. Spoon berries and their juices over bottom half. Heap generously with whipped cream. Place shortcake “lid” on top. Eat immediately and don’t forget to share.\nDo ahead: Shortcakes keep well for a day at room temperature. I prefer to keep them uncovered. I found on the second day, they were a little more firm but not half-bad, but they’re definitely “best” on day one.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/easy-drop-berry-shortcakes-1.jpg?w=750",
  "ingredient_list": [
    "2 1/4 cups (295 grams) all-purpose flour",
    "2 1/4 teaspoons baking powder",
    "3/4 teaspoon baking soda",
    "3 tablespoons (40 grams) granulated sugar",
    "1/4 teaspoon fine sea or table salt",
    "6 tablespoons (85 grams or 3 ounces) unsalted butter, cold, cut into chunks",
    "2 large egg yolks",
    "3/4 cup plus 2 tablespoons (205 ml) heavy cream",
    "3 tablespoons (35 grams) raw or turbinado sugar",
    "1 pound (455 grams) strawberries or mixed berries, hulled and halved if large",
    "2 tablespoons (25 grams) granulated sugar, or more to taste",
    "1 tablespoon (15 ml) fresh lemon juice (optional)",
    "1 cup (235 ml) heavy or whipping cream"
  ],
  "tags": [
    "Blackberries",
    "Blueberries",
    "Everyday Cakes",
    "Photo",
    "Quick",
    "Raspberries",
    "Scones/Biscuits",
    "Strawberries",
    "Summer"
  ],
  "title": "easy drop berry shortcakes",
  "url": "https://smittenkitchen.com/2017/06/easy-drop-berry-shortcakes/"
}