{
  "date": "2006-11-23T12:28:36+00:00",
  "directions": [
    "1. Adjust oven rack to lowest position and heat rimmed baking sheet and oven to 500°F. Remove one piece of dough from refrigerator (if refrigerated longer than 1 hour, let stand at room temperature until malleable).",
    "2. Roll dough on lightly floured work surface or between two large sheets of plastic wrap to 12-inch disk. Transfer dough to pie plate by rolling dough around rolling pin and unrolling over 9 1/2-inch pie plate or by folding dough in quarters, then placing dough point in center of pie plate  and unfolding. Working around circumference of pie plate, ease dough into pan corners by gently lifting dough edges with one hand while pressing around pan bottom with other hand. Leave dough that overhangs lip of plate in place; refrigerate dough-lined pie plate.",
    "3. Peel, core and cut apples in half, and in half again width-wise; cut quarters into 1/4-inch slices and toss with lemon juice and zest. In a medium bowl, mix 3/4 cup sugar, flour, salt and spices. Toss dry ingredients with apples. Turn fruit mixture, including juices, into chilled pie shell and mound slightly in center.",
    "4. Roll out second piece of dough to 12-inch disk and place over filling. Trim top and bottom edges to 1/2-inch beyond pan lip. Tuck this rim of dough underneath itself so that folded edge is flush with pan lip. Flute edging or press with fork tines to seal. Cut four slits on dough top. If pie dough is very soft, place in freezer for 10 minutes. Brush egg white onto top of crust and sprinkle evenly with remaining 1 tablespoon sugar.",
    "5. Place pie on baking sheet and lower oven temperature to 425°F. Bake until top crust is golden, about 25 minutes. Rotate pie and reduce oven temperature to 375°F; continue baking until juices bubble and crust is deep golden brown, 30-35 minutes longer. ",
    "6. Transfer pie to wire rack; cool to room temperature, at least 4 hours. ",
    "Review: We all loved this pie. However, I might for the first time be taking a no-lattice top approach for apple pies in the future. Shortly after these pictures were taken, the apples fell and it ended up looking a little bird cagey on top. This has happened before, leading me to think that perhaps in the open-top variety, apples have a chance to lose too much of their moisture. It wasn’t particularly gooey inside, though tasty just the same. I’m thinking that peach or cherry pies, with their excessive juiciness, might be better-suited for lattice-tops and Cook’s Illustrated seems to agree.",
    "Finally, I’d jack up the spices a bit next time, certainly doubling them [updated to note: not everyone agrees that it needs more spice so please, just spice to taste] and cut back on the lemon, which had a very pronounced flavor. In every other way though, crust included, this recipe is a keeper."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cinnamon-sigh1.jpg?w=500",
  "ingredient_list": [
    "3 cups unbleached all-purpose flour (2 1/2 cups, non-lattice)",
    "1 teaspoon salt",
    "2 tablespoons sugar",
    "7 tablespoons all-vegetable shortening, chilled (8 tablespoons, non-lattice)",
    "10 tablespoons unsalted butter, chilled, cut into 1/4-inch pieces (12 tablespoons, non-lattice)",
    "10 tablespoons ice water (6 to 8 tablespoons, non-lattice)",
    "1 1/2 pounds Granny Smith apples (about 3 medium)",
    "2 pounds McIntosh apples (about 4 large)",
    "1 tablespoon juice and 1 teaspoon zest from 1 lemon",
    "3/4 cups (5.25 ounces) plus 1 tablespoon sugar",
    "2 tablespoons all-purpose flour",
    "1/4 teaspoon salt",
    "1 teaspoon cinnamon",
    "1/4 teaspoon ground nutmeg",
    "1/4 teaspoon ground allspice",
    "1 egg white, beaten lightly"
  ],
  "tags": [
    "Apple",
    "Fruit",
    "Photo",
    "Tarts/Pies",
    "Thanksgiving"
  ],
  "title": "apple pie",
  "url": "https://smittenkitchen.com/2006/11/cinnamon-sigh/"
}