{
  "date": "2008-11-19T23:52:25+00:00",
  "directions": [
    "For pecan filling: Finely grind pecans and flour in processor. Mix in sugar, then butter, orange zest and brandy (if using). Blend until smooth. Mix in egg and egg white. Transfer filling to medium bowl. Cover and chill at least 3 hours. (Can be made 2 days ahead. Keep chilled.)",
    "Position rack in center of oven and preheat to 350°F. Spread pecan filling evenly in baked tart crust. Arrange cranberries on top. Use the smaller amount for a sparsely cranberried tart like you see in these pictures. Use the larger amount if you, like us, really like things extra tart.",
    "Bake tart until golden and tester inserted into center of filling comes out clean, about 44 to 55 minutes. Cool tart in pan on rack. Push pan bottom up, releasing tart from pan. (Can be made 8 hours ahead. Let stand at room temperature.) Cut tart into wedges; sprinkle with powdered sugar, if desired, and serve.",
    "Do ahead: Tart dough can be made, wrapped twice and kept in the fridge for a few days, or in the freezer for a week or two. Baked pastry shell, once cool, can be covered in foil and kept at room temperature for up to two days. Frangipane can be made up to three days in advance, and kept in the fridge until ready to fill the shell. Cranberries keep well in the fridge, but even longer in the freezer. Tart can be made up to a day in advance and wrapped in the fridge (probably longer in the fridge, but you may risk losing some crispness) or at room temperature."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cranberry-pecan-frangipane-tart1.jpg?w=500",
  "ingredient_list": [
    "1 cup coarsely chopped pecans",
    "1 1/2 tablespoons all purpose flour",
    "2/3 cup granulated sugar",
    "9 tablespoons (1 stick plus 1 tablespoon) unsalted butter, at room temperature",
    "1 large egg",
    "1 large egg white",
    "1 tablespoon brandy (optional)",
    "1 1/2 teaspoons finely grated orange zest",
    "1/2 to 1 cup whole, fresh cranberries",
    "1 Great Unshrinkable Sweet Tart Shell, baked and cooled",
    "Powdered sugar, for dusting"
  ],
  "tags": [
    "Cranberries",
    "Fall",
    "Fruit",
    "Photo",
    "Tarts/Pies",
    "Thanksgiving"
  ],
  "title": "cranberry pecan frangipane tart",
  "url": "https://smittenkitchen.com/2008/11/cranberry-pecan-frangipane-tart/"
}