{
  "date": "2010-11-17T14:05:35+00:00",
  "directions": [
    "Blanch the pearl onions for 3 minutes in a pot of boiling salted water. Drain, shock in a bath of ice water, and drain again. Peel the onions (making a slit with a paring knife down the side made this easiest for me), leaving a little of the root end intact.",
    "[Want to use frozen, already peeled onions instead? I list some potential sources in the post.]",
    "in a medium saucepan, cook the bacon until crisp, then remove it with a slotted spoon and drain it on paper towels. Leave only two tablespoons of the cooking fat in the pan, and add the pearl onions, heavy cream and nutmeg. Add salt to taste.",
    "Cover the pot with a lid, leaving it a little ajar. Cook onions until they are nearly cooked through, about 90 percent of the way then remove the lid and finish cooking the onions while reducing the cream by half. Stir in the sherry.",
    "If your onions are done cooking before the cream has sufficiently reduced or if you’re unsure about the alcohol in the sherry, remove the onions with a slotted spoon and transfer them to your serving dish. Continue cooking the remaining sauce to the desired consistency and taste and pour it back over the onions.",
    "Garnish with bacon and chives and don’t forget to share."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creamed-onions-with-bacon-and-chives1.jpg?w=500",
  "ingredient_list": [
    "100 or so pearl onions, unpeeled (from 3 10-ounce bags)",
    "2 1/2 ounces bacon (applewood-smoked is suggested), cut into a small dice",
    "1 1/4 cups heavy cream",
    "1/4 teaspoon freshly grated nutmeg",
    "2 tablespoons sherry",
    "1/2 bunch chives, cut into 1/2-inch segments",
    "Kosher salt, to taste (I used 1 teaspoon of Diamond Kosher salt)"
  ],
  "tags": [
    "Onions",
    "Photo",
    "Side Dish",
    "Thanksgiving"
  ],
  "title": "creamed onions with bacon and chives",
  "url": "https://smittenkitchen.com/2010/11/creamed-onions-with-bacon-and-chives/"
}