[
    {
        "ingredient_list": [
            "2 to 2 1/4 pounds lean ground beef or turkey", 
            "1 large onion, chopped (about 1 1/2 cups)", 
            "5 cloves garlic, minced", 
            "1 cup canned beef broth", 
            "1/3 cup chili powder", 
            "1 tablespoon ground cumin", 
            "1 tablespoon unsweetened cocoa (optional, but I never make chili without it)", 
            "1 14 1/2-ounce can diced tomatoes", 
            "2 15 1/2-ounce cans kidney beans, drained", 
            "1 teaspoon kosher salt", 
            "1 tablespoon cider vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/a-mea-culpa-meal1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Meat", 
            "Photo", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2007/07/a-mea-culpa-meal/", 
        "title": "red bean chili", 
        "directions": [
            "To taste: Tabasco, 1/2 to 1 teaspoon cayenne or 1 to 2 tablespoons chipotle en adobo puree", 
            "Optional toppings and sides: grated Cheddar, sour cream, minced jalapeno, corn bread ", 
            "Place a large Dutch oven or saucepan over medium-high heat. Add the beef or turkey and cook until browned, about 5 minutes. Add the onion, stirring well, and cook until translucent, 3 to 5 minutes. Add the garlic and cook 1 minute more. Gradually add the broth, scraping up any browned bits from the bottom of the Dutch oven. Stir in the chili powder, cumin, cocoa and tomatoes. Reduce heat to medium-low, cover, and let simmer for 10 minutes. Add the beans, salt, and vinegar, stirring well. Simmer uncovered for 10 minutes more. Adjust flavor with your spices of choice. Garnish with the Cheddar, sour cream, and jalapeno, if desired. Serve hot, with corn bread, if desired."
        ], 
        "date": "2007-07-11T15:23:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small/medium acorn squash", 
            "4 tablespoons vegetable oil", 
            "3 tablespoons diced white onion", 
            "1 tablespoon minced jalapeno", 
            "1 clove garlic, minced", 
            "2 poblano chiles, roasted, peeled and cut into strips", 
            "Salt and pepper to taste", 
            "10-inch flour tortillas", 
            "1 cup shredded Mexican cheese blend of your choice (I used Muenster, not Mexican but worked great!)", 
            "Butter for frying quesadillas", 
            "Garnishes: Julienned radishes, crema or sour cream and/or salsa verde cruda (recipe below)", 
            "10 tomatillos, husked and well washed, quartered", 
            "1/2 bunch of scallions, roots and green ends trimmed, cut into big segements", 
            "5 garlic cloves, smashed", 
            "2 jalapenos, roughly chopped", 
            "Pinch of allspice", 
            "Salt to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/acorn-squash-quesadillas-tomatillo-salsa1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Tex-Mex", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2008/10/acorn-squash-quesadillas-tomatillo-salsa/", 
        "title": "acorn squash quesadillas + tomatillo salsa", 
        "directions": [
            "Puree all ingredients together until very smooth either in a blender or food processor. Season with salt."
        ], 
        "date": "2008-10-07T15:16:52+00:00"
    }, 
    {
        "ingredient_list": [
            "Almond macaroons", 
            "Nonstick vegetable oil spray", 
            "2 1/2 cups (10.5 ounces or 300 grams) slivered almonds (or an equivalent weight of blanched, sliced or already ground almonds)", 
            "1 cup (196 grams) plus 3 tablespoons (37 grams) sugar", 
            "2 large pinches kosher salt", 
            "2 teaspoons vanilla extract or 1 vanilla bean, split lengthwise", 
            "6 large egg whites", 
            "Frosting and assembly", 
            "1/2 cup water", 
            "1/2 cup sugar", 
            "Flavoring of your choice, such as 1/2 teaspoon orange oil or extract, 1/2 teaspoon vanilla, almond or other extract", 
            "20 ounces semi-sweet chocolate (61% or less is recommended, I think it would also be great with 72%, a nice bitter contrast to the sweet macaroons), chopped or chocolate chips", 
            "1 cup sliced almonds, toasted (at 350 degrees for 7 to 9 minutes on a tray, stirring once or twice)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/almond-macaroon-torte-with-chocolate-frosting1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Gluten-Free", 
            "Passover", 
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2010/03/almond-macaroon-torte-with-chocolate-frosting/", 
        "title": "almond macaroon torte with chocolate frosting", 
        "directions": [
            "Make macaroons: Position an oven rack in the top and lower third of oven and preheat oven to 325°F. Draw two 12 x 4-inch rectangles, spacing 2 inches apart [see Note below for my tiny kitchen adjustments] on a piece of parchment paper, then two more of the same size on a second sheet. In total, you’ll use 2 sheets of parchment paper and draw 4 rectangles. Turn each sheet of parchment over (so your ink or pencil lines don’t seep into the macaroon) and spray with nonstick spray [but first see Note below about the necessity of this] .", 
            "Place almonds, 1 cup sugar and coarse salt in a food processor (you can skip the food processor, however, if you use an equivalent weight of almond meal or ground almonds, just mixing the ingredients in a bowl) with vanilla bean seeds, if using (you’ll add liquid extract in a bit) and blend until finely ground.", 
            "Using electric mixer, beat egg whites in large, dry bowl with clean beaters (or a whisk attachment) until soft peaks form. Drizzle in vanilla extract (if using), then slowly add remaining 3 tablespoons sugar. Beat until stiff but not dry. Fold nut mixture into egg whites. Spread 1/4 of macaroon batter evenly within each rectangle, filling completely.", 
            "Bake macaroon layers until golden and almost firm to the touch in the center, reversing sheets halfway through — this took a total of 23 measly minutes in my oven; the original recipe says it can take up to 40. I would check in on yours at 23 minutes and then every 5 minutes thereafter if they’re not done yet.", 
            "Cool macaroons on their sheets on a cooling rack.", 
            "Make frosting: Simmer 1/2 cup of water and sugar in a medium saucepan until sugar dissolves. Measure 10 tablespoons from this and either discard the rest of save it for another use. Put the 10 tablespoons syrup back in the saucepan and add flavoring of your choice. Bring the syrup back to a boil and add chocolate to the saucepan. Remove from heat and let sit for one minute, then stir the chocolate until smooth. This should yield a medium-thick frosting, good for spreading. If yours is on the thin side, you can let it cool for 5 or 10 minutes until it is a good spreading consistency.", 
            "Assemble torte If needed due to spreading, carefully trim your macaroon layers back to their intended rectangular sizes — for me, a sharp knife lightly coated with oil worked best for this.", 
            "Place one macaroon layer on a long platter. (If you’re a follower of my layer cake tips, you’ll already know that slipping little pieces of parchment or waxed paper under the edges will help keep your platter clean; you pull them out when you’re done frosting the torte.) Spread 1/2 cup frosting evenly over. Top with another macaroon layer. Spread 1/2 cup frosting evenly over. Repeat 1 more time then top with last macaroon layer, flat side up (whoops, didn’t do this). Spread remaining frosting over top and sides of torte. Press sliced almonds onto sides of torte.", 
            "Do ahead: Can be made one to two days ahead. Cover with foil tent. Store at room temperature.", 
            "Tiny kitchen/tiny tray tweak:  If you’re curious as to why mine may look a little smaller or taller than yours, I had to make my rectangles a little smaller — 11 x 3.75-inch — to work within the tiny baking sheets that fit in my tiny oven.  I flipped them over so they didn’t bump into the walls of the tray, but this proved unfortunate when mine spread down the sides! I (of course) don’t recommend the tray flipping.", 
            "About that spray oil: As I mentioned in the post above, this step vexes me. I’ve always made macaroons and meringues on sheets of parchment paper that were not sprayed or grease, the nonstick properties of parchment were enough to release the cookies. But this recipe has you use nonstick spray on them, which encourages your neat rectangles of macaroon to slide and spread. This is not ideal. I hope to update this step soon with a note about whether you can get by without the spray oil, using plain parchment. Fortunately, any spreading can be trimmed but more ideal would, of course, be no spreading at all. Update: At least one commenter (thank you Kate!) made these without oiling the parchment, found that the macaroons spread less and had no trouble removing the macaroons from the parchment. "
        ], 
        "date": "2010-03-29T12:15:41+00:00"
    }, 
    {
        "ingredient_list": [
            "6 cups torn chunks French, sourdough or country loaf, torn into bits (I use 2 7-ounce demi-baguettes)", 
            "5 tablespoons unsalted butter", 
            "1 large Spanish or sweet onion, chopped small", 
            "1 large or 2 small stalks celery, diced small", 
            "1 teaspoon chopped fresh thyme leaves", 
            "1/2 teaspoon table salt, plus more to taste", 
            "Freshly ground black pepper", 
            "1 large or 2 small firm, tart tart apples, such as Granny Smith, peeled, cored and diced small", 
            "1/4 cup roughly chopped flat-leaf parsley", 
            "3 sage leaves, minced", 
            "1/2 to 1 cup cup turkey, chicken or vegetable stock or broth", 
            "1 large egg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/apple-herb-stuffing-for-all-seasons1.jpg?w=640", 
        "tags": [
            "Apple", 
            "Bread", 
            "Celery", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2013/11/apple-and-herb-stuffing-for-all-seasons/", 
        "title": "apple-herb stuffing for all seasons", 
        "directions": [
            "Position rack in center of oven and preheat to 350°F. Spread bread cubes in single layer on large rimmed baking sheet. Bake until pale golden, stirring occasionally, 10 to 15 minutes. Let cool in pan while you prepare the other ingredients. ", 
            "Generously butter a 2-quart baking dish (a 9×5-inch loaf, 8- or 9-inch square dish, etc.) with 1 tablespoon butter. Melt remaining 4 tablespoons butter in large skillet over medium heat. Add onion, thyme, salt and lots of freshly ground black pepper and cook for 2 minutes, until becoming translucent. Add celery and cook for 2 more minutes. Add apple and saute until a bit tender, 3 to 4 minutes more. ", 
            "Place bread in large mixing bowl. Scrape contents of skillet on top. Whisk egg and 1/2 cup broth or stock together and pour over. Stir in parsley and sage. Spoon into prepared pan. If mixture looks a little dry, pour remaining 1/2 cup broth over it. [This is a good place to pause, if needed. Nothing bad comes of the stuffing absorbing the liquids for longer.] Bake for 30 to 40 minutes, until brown on top and no liquid appears if you insert a knife vertically into the center of the stuffing pan and turn it slightly. Serve immediately, or reheat as needed.", 
            "* On a technical note, I insist upon calling stuffing what is actually dressing, even though I know it is wrong. Although they use the same recipes, stuffing goes inside the bird, dressing is baked outside, and I insist that it is better outside the bird. When making stuffing to, uh, stuff, uh, places, one must cook the bird to a higher-than-normal temperature to ensure that the stuffing inside is free from undercooked poultry drippings. Seeing as most turkey is dry enough, I see no point in helping it along. ", 
            "Variations:"
        ], 
        "date": "2013-11-19T12:04:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup apple cider (the fresh kind, not the fizzy alcoholic kind)", 
            "1 bottle dry white wine", 
            "1/4 cup calvados or another apple brandy", 
            "1/4 cup Triple sec or another orange liqueur", 
            "Mixed colors of apples, diced and tossed with lemon juice to prevent browning", 
            "Seltzer, sparkling water or sparkling apple cider to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/apple-cider-sangria1.jpg?w=750", 
        "tags": [
            "Apple", 
            "Drinks", 
            "Photo", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2015/11/apple-cider-sangria/", 
        "title": "apple cider sangria", 
        "directions": [
            "Place the apple cider in a small saucepan and bring to a boil over high heat. Reduce about 3/4 of the way, until you have approximately 1/4 cup apple cider left; this will take 10 to 15 minutes. Pour into small bowl set over a bowl of ice water and stir; it will cool very quickly this way.", 
            "Pour reduced, cooled cider into pitcher. Add wine, apple brandy and triple sec. Add fruit and let sit in the fridge until needed. Add some fizz right before serving; a slotted spoon will help guests hold back the fruit while pouring their glasses, and spoon some on top, if desired."
        ], 
        "date": "2015-11-06T11:58:45+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "3 3/4 (470 grams) cups all-purpose flour", 
            "1 1/2 tablespoons sugar", 
            "1 1/2 teaspoons table salt", 
            "3 sticks (340 grams) unsalted butter, very cold", 
            "3/4 cup very cold water", 
            "Filling", 
            "3 1/2 to 4 pounds apples, peeled, cored and chopped into approximately 1/2-inch chunks (about 8 cups)", 
            "Squeeze of lemon juice", 
            "2/3 to 3/4 cup sugar (depending on how sweet you like your pies)", 
            "3 tablespoons cornstarch", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon ground nutmeg", 
            "1/4 teaspoon ground allspice", 
            "1/8 teaspoon table salt", 
            "To finish", 
            "2 tablespoons heavy cream or one egg, beaten with 1 tablespoon of water", 
            "Glaze (optional)  (only need half, barely, for what’s in photos)", 
            "1/2 cup confectioners’ sugar", 
            "1 tablespoon milk, water, lemon juice or fresh apple cider, plus a drop or two more if needed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/apple-slab-pie1.jpg?w=640", 
        "tags": [
            "Apple", 
            "Fall", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2013/10/apple-slab-pie/", 
        "title": "apple slab pie", 
        "directions": [
            "Make pie crust: Whisk together flour, sugar and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in the water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough roughly in half (it’s okay if one is slightly larger). Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day. [Still freaked out about making your own pie dough? Read this for a ton of additional tips and details.]", 
            "Heat oven  oven to 375 degrees F. Line bottom of 10x15x1-inch baking sheet or jellyroll pan with parchment paper.", 
            "Prepare filling: In a large bowl, toss apples with lemon juice until coated. Top with remaining filling ingredients and stir to evenly coat. ", 
            "Assemble pie: On a lightly floured surface, roll one of your dough halves (the larger one, if you have two different sizes) into an 18-by-13-inch rectangle. This can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible and using enough flour that it doesn’t stick to the counter. Transfer to your prepared baking sheet and gently drape some of the overhang in so that the dough fills out the inner edges and corners. Some pastry will still hang over the sides of the pan; trim this to 3/4-inch. ", 
            "Pour apple mixture over and spread evenly. ", 
            "Roll the second of your dough halves (the smaller one, if they were different sizes) into a 16-by-11-inch rectangle. Drape over filling and fold the bottom crust’s overhang over the edges sealing them together. Cut small slits to act as vents all over lid. Brush lid heavy cream or egg wash. Bake until crust is golden and filling is bubbling, 40 to 45 minutes. Transfer to a wire rack until just warm to the touch, about 45 minutes.", 
            "In a medium bowl, stir together confectioners’ sugar and liquid of your choice until a pourable glaze consistency is reached. Use a spoon to drizzle over top. Serve slab pie in squares or rectangles, warm or at room temperature. ", 
            "It keeps at room temperature for at least three days."
        ], 
        "date": "2013-10-25T11:20:46+00:00"
    }, 
    {
        "ingredient_list": [
            "Pudding", 
            "1 3/4 cups (from a 15-ounce can, 415 grams) pumpkin puree (unsweetened; not pumpkin pie filling)", 
            "1/2 cup (100 grams) granulated sugar", 
            "1 teaspoon (2 grams) ground cinnamon", 
            "1/2 teaspoon (3 grams) table salt", 
            "1/2 teaspoon ground ginger", 
            "1/4 teaspoon ground cloves", 
            "1 cup (237 ml) whole milk", 
            "1/2 cup (118 ml) heavy cream", 
            "2 large eggs, lightly beaten", 
            "Topping", 
            "1 cup (227 grams) sour cream", 
            "1 tablespoon (13 grams) granulated sugar", 
            "1/4 teaspoon (1 ml) vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/11/baked-pumpkin-puddings-with-sour-cream.jpg?w=750", 
        "tags": [
            "Fall", 
            "Gluten-Free", 
            "Photo", 
            "Pudding", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2011/11/baked-pumpkin-and-sour-cream-puddings/", 
        "title": "baked pumpkin and sour cream puddings", 
        "directions": [
            "Preheat oven to 350°F.", 
            "The quickest method: In a medium bowl, whisk together all of the pudding ingredients.", 
            "For creamier, silkier pudding: Combine pumpkin, sugar, salt and spices in a food processor and blend for 30 seconds. Transfer to a saucepan and heat over medium-high. Once glurping and simmering in the pot, cook for another 5 minutes, stirring frequently. The mixture will thicken and get a bit darker. Reduce heat slightly and whisk in milk and cream. Off the heat, slowly whisk in eggs.", 
            "Both methods: Divide between 7 to 8 (I had just shy of enough to make eight 1/2-cup puddings) ovenproof 6-ounce pudding cups or ramekins on a baking sheet. Bake for 35 to 40 minutes, until puddings barely jiggle when shimmied and/or a knife tip inserted into the center of puddings comes out clean. Try not to overbake.", 
            "While they bake, combine topping ingredients in a small bowl. When the puddings are cooked through, transfer to a cooling rack on the counter and leave oven on. Spoon 2 tablespoons of sour cream mixture onto first pudding and use a small offset spatula, butter knife or spoon to quickly (it will get melty fast) spread it over the top of the first pudding. Repeat with remaining puddings.", 
            "Return puddings to oven for 5 more minutes, then cool completely at room temperature, about 1 to 2 hours. Chill until ready to serve. Eat with a gingersnap."
        ], 
        "date": "2011-11-16T11:27:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups fresh bread crumbs (though I found I needed far less)", 
            "2 teaspoons thyme leaves", 
            "2 tablespoons extra virgin olive oil plus an extra glug or two for drizzling", 
            "4 tablespoons unsalted butter", 
            "2 pounds medium-sized brussels sprouts, washed and trimmed", 
            "Salt and pepper", 
            "6 ounces pancetta in small dice (1 1/2 cups)", 
            "3 tablespoons minced shallots", 
            "1 tablespoon minced garlic", 
            "1/2 cup balsamic vinegar", 
            "1 1/2 cups veal stock, rich chicken or vegetable broth, more if needed", 
            "2 tablespoons chopped parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/balsamic-braised-brussels-sprouts-with-pancetta1.jpg?w=640", 
        "tags": [
            "Brussels Sprouts", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2009/12/balsamic-braised-brussels-with-pancetta/", 
        "title": "balsamic braised brussels with pancetta", 
        "directions": [
            "Heat oven to 350 degrees. In a bowl, mix bread crumbs and thyme with a couple glugs of olive oil, and spread on a cookie sheet. Toast, tossing frequently, until golden brown, 10 to 12 minutes.", 
            "Heat butter and remaining olive oil in a large skillet over medium-high heat until foamy. Add brussels sprouts, sprinkle with salt and pepper, and sauté, tossing frequently, until lightly browned, about 7 to 10 minutes. Add diced pancetta, and sauté, tossing frequently, until sprouts are well browned and softened slightly, and pancetta is crisp, about 10 to 15 minutes more. Reduce heat, add shallots and garlic, and sauté until fragrant, 2 minutes.", 
            "Increase heat to high, add balsamic vinegar and stock, and cook, tossing frequently, until sprouts are glazed and tender, about 20 minutes; add more stock if needed. Taste, adjusting seasoning if necessary, and sprinkle with chopped parsley. Transfer to a warm serving bowl and scatter bread crumbs on top."
        ], 
        "date": "2009-12-01T10:05:05+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large onions, chopped (about 3 cups)", 
            "1/4 cup vegetable oil", 
            "1 tablespoon minced garlic", 
            "2 carrots, sliced thin (suggested by Gourmet) or in a small dice, as I’d chop them next time", 
            "3 pounds boneless beef chuck, ground coarse or 3 pounds ground beef", 
            "1/4 cup chili powder", 
            "1 tablespoon ground cumin", 
            "2 tablespoons paprika", 
            "1 tablespoon crumbled dry oregano", 
            "Dried red pepper flakes, to taste (Gourmet suggests 1 tablespoon; I used 1 teaspoon knowing that my flakes are very hot)", 
            "2 8-ounce cans tomato sauce or 2 cups fresh tomato sauce or tomato puree", 
            "1 1/4 cups beef broth", 
            "3 tablespoons cider vinegar", 
            "1 3/4 cups or 1 19-ounce can kidney beans, rinsed and drained", 
            "2 green bell peppers, chopped", 
            "Sour Cream and Cheddar Biscuits, below", 
            "Sour cream and pickled jalapeños (optional, to finish)", 
            "1 1/2 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "2 tablespoons cold unsalted butter, cut into bits", 
            "1/4 pound sharp Cheddar cheese, coarsely grated (about 1 1/2 cups)", 
            "Drained and chopped pickled jalapeños, to taste (I used about 2 tablespoons)", 
            "1 cup sour cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/beef-chili-sour-cream-and-cheddar-biscuits1.jpg?w=500", 
        "tags": [
            "Beef", 
            "Freezer Friendly", 
            "Photo", 
            "Scones/Biscuits", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2010/09/beef-chili-sour-cream-and-cheddar-biscuits/", 
        "title": "beef chili + sour cream and cheddar biscuits", 
        "directions": [
            "Preheat oven to 425°F. Whisk together the flour, baking powder, baking soda and salt in a large bowl. Either cut the butter pieces into the flour mixture with a pastry blender or rub them in with your fingertips until well-combined. Stir in the cheddar, jalapeños and sour cream until the mixture forms a sticky dough. Pat it out to a 1/2-inch thickness on a very well-floured counter and use a 3 1/2-inch biscuit cutter to cut six rounds. Bake on an ungreased (or parchment-lined, if your baking sheets are as “weathered” as mine are) for 15 to 17 minutes, until golden on top.", 
            "Do ahead: If you’d like to serve them over a couple days, I recommend freezing already formed but unbaked biscuits until you are ready to bake them — you can bake them directly from the freezer, adding just a minute or two to the baking time."
        ], 
        "date": "2010-09-27T14:35:19+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/big-crumbs-and-small-pretzels-in-oklahoma1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2009/04/big-crumbs-and-small-pretzels-in-oklahoma/", 
        "title": "big crumbs + small pretzels in oklahoma", 
        "directions": [], 
        "date": "2009-04-26T19:38:52+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            "2 medium-size red onions, chopped", 
            "1 medium-size red bell pepper, chopped", 
            "1 medium-size green bell pepper, chopped", 
            "4 garlic cloves, minced", 
            "4 teaspoons ground cumin", 
            "1 16-ounce package dried black beans", 
            "1 tablespoon chopped chipotle chiles from a can (this gives it a solid kick, dial back if you are wary)", 
            "7 cups water", 
            "2 tablespoons fresh lime juice", 
            "2 teaspoons coarse kosher salt", 
            "1/4 teaspoon ground black pepper", 
            "1 tablespoon whole cumin seeds", 
            null, 
            "Salt and freshly ground pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/black-bean-soup1.jpg?w=750", 
        "tags": [
            "Beans", 
            "Budget", 
            "Gluten-Free", 
            "Peppers", 
            "Photo", 
            "Slow Cooker", 
            "Soup", 
            "Tex-Mex", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/01/black-bean-soup-toasted-cumin-seed-crema/", 
        "title": "black bean soup + toasted cumin seed crema", 
        "directions": [
            "Make the soup on the stove: Heat olive oil in the bottom of a 5-quart or larger Dutch oven or stock pot over medium-high heat. Add onions and both bell peppers and sauté until beginning to brown, about eight minutes. Add garlic and cumin; stir one minute. Add beans and chipotles, then 7 cups water. Bring to a full boil, boil for 1 minute, then reduce heat to a gentle simmer, partially cover pot, and cook until beans have softened, about 2 to 3 hours. (These times can vary a lot depending on the age of the beans and kind of water.)\nMake the soup in a slow-cooker: Heat olive oil in large skillet over medium-high heat. Add onions and both bell peppers and sauté until beginning to brown, about eight minutes. Add garlic and cumin; stir one minute. Transfer mixture to 6-quart slow cooker. Add beans and chipotles, then 7 cups hot water. Cover and cook on high until beans are very tender, about 6 hours. [But see note up top because mine finish sooner, although most others have not.]\nMake the soup in an InstantPot or electric pressure cooker: Heat olive oil in the bottom of your pressure cooker on the sauté function. Add onions and both bell peppers and sauté until beginning to brown, about eight minutes. Add garlic and cumin; stir one minute. Add beans and chipotles, then 7 cups hot water. Cover, locking lid and closing steam valve. Cook at high pressure on the manual setting for 30 minutes. If you have time, let the pressure release naturally. I didn’t have a lot of time, and let it release naturally for 10 to 15 minutes, then manually the rest of the way.\nWhile it cooks, make the topping: Place the cumin in a small sauté pan over medium heat. Toast until lightly golden brown. Place in spice grinder or mortar and pestle and grind until coarse. Stir it into the cream and season with salt and pepper, to taste.\nAll cooking methods: Transfer two cups bean mixture to blender; puree until smooth, then return the puree to remaining soup in slow cooker. Or, you can use an immersion blender to partially blend the soup right where you’ve cooked it. Stir in lime juice, salt, and pepper. Adjust seasonings to taste; we found we needed more salt. Ladle soup into bowls. Spoon dollop of toasted cumin seed cream (below) over each bowl and serve.", 
            "Do ahead: This soup keeps great in the fridge, and even thickens a bit. In a good way!\n"
        ], 
        "date": "2010-01-12T14:00:01+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust:", 
            "1 1/4 cups (155 grams) all-purpose flour", 
            "1 1/2 teaspoons (6 grams) granulated sugar", 
            "1/2 teaspoon (3 grams) fine sea or table salt", 
            "1 stick (4 ounces or 115 grams) cold unsalted butter, cut into chunks", 
            "1/4 cup (60 ml) very cold water, plus an additional tablespoon if needed", 
            "Filling", 
            "1 1/2 cups (120 grams) rolled oats", 
            "1/4 cup (60 ml) heavy cream", 
            "4 ounces (115 grams) bittersweet chocolate, coarsely chopped", 
            "3/4 cup (145 grams) packed light brown sugar", 
            "1/4 teaspoon ground ginger", 
            "1/2 teaspoon kosher salt", 
            "5 tablespoons (70 grams) unsalted butter, melted", 
            "1 cup dark corn syrup (see Note below for replacements)", 
            "1 teaspoon vanilla extract", 
            "2 teaspoons apple cider vinegar", 
            "4 large eggs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/black-bottom-oatmeal-pie1.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/03/black-bottom-oatmeal-pie/", 
        "title": "black bottom oatmeal pie", 
        "directions": [
            "Make the pie dough: ", 
            "Form the crust: On a floured counter, roll the dough out into a 12 to 13-inch circle-ish shape. Fold dough gently in quarters without creasing and transfer to a 9-inch standard (not deep-dish) pie plate. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. If not parbaking, place in fridge until ready to fill. If parbaking, place in freezer for 20 minutes, until solid.", 
            "Par-bake the crust: [Optional, but will lead to a crispier base.] Heat oven 400°F (205°C). Line frozen crust with lightly buttered or oiled foil. Fill with pie weights, dried beans or pennies. Bake on a rimmed baking sheet for 20 minutes. Carefully remove foil and weights and let cool completely before filling. ", 
            "Heat oven: (Or reduce oven heat, if you just par-baked your crust) to 350°F (175°C).", 
            "Prepare filling: Spread oats on a rimmed baking sheet and toast in the oven for 10 to 12 minutes, stirring occasionally. Set aside to cool. Reduce the oven temperature to 325°F (165°C).", 
            "To make the black bottom, bring the cream just to a boil over medium heat in a small saucepan. Pour in chocolate pieces and whisk until melted and smooth. Scrape the chocolate into the bottom of the cooled pie shell and spread evenly. Place in freezer while making the filling. ", 
            "To make the oatmeal layer, in a large bowl, whisk together the brown sugar, ginger, salt, and melted butter. Add the corn syrup, vanilla, and cider vinegar and whisk to combine. Add the eggs one at a time, whisking well after each addition. Stir in the cooled oats. Place chocolate-coated pie shell on a rimmed baking sheet and pour filling over. ", 
            "Bake: For 55 to 70 minutes [updated: it sounds from the comments that more time than the original 55 minutes has been needed for several people], rotating 180 degrees for even color if needed halfway through. The pie is done with the edges are set and puffed slightly and the center is slightly firm to the touch but still has a little give — like gelatin. Allow to cool completely on a wire rack, 2 to 3 hours. Serve slightly warm or at room temperature.", 
            "Do ahead: The pie will keep refrigerated for 3 days or at room temperature for 2 days.", 
            "A few notes: "
        ], 
        "date": "2015-03-12T12:08:19+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/06/bowties-with-sugar-snaps-lemon-and-ricotta.jpg?w=750", 
        "tags": [
            "Pasta", 
            "Peas", 
            "Photo", 
            "Spring", 
            "Travel", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/06/bowties-with-sugar-snaps-lemon-and-ricotta/", 
        "title": "bowties with sugar snaps, lemon and ricotta", 
        "directions": [
            "Bring a large pot of well-salted water to boil. While waiting, string sugar snaps and cut into 1/2-inch segments. Cook bowties for two minutes less than the suggested cooking time on the package, then add sugar snaps to pasta. Cook for one minute more. Reserve one cup pasta cooking water, then drain sugar snaps and bowties. Add them back to the empty pot with 1/2 cup pasta cooking water, grated cheese, a glug of olive oil, salt and freshly ground black pepper. Cook on high for one minute, tossing constantly. Add a splash more cooking water if pasta looks too dry. Turn heat off, dollop ricotta all over in large spoonfuls and, without stirring, tip pasta mixture into a wide serving bowl. (I do this because I love the idea of finding slightly unmixed pockets of ricotta.) Drizzle pasta with a small amount of olive oil, then squeeze lemon juice over the whole dish, sprinkle with mint, and finish with an extra sprinkling of parmesan. Serve quickly; eat happily. ", 
            "(Lemon juice, rather rudely, discolors green vegetables so be sure to add this only right before serving, and when it will be eaten before anyone will care.)"
        ], 
        "date": "2013-06-14T09:37:15+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/brussel-sprouts-and-chestnuts-in-brown-butter1.jpg?w=500", 
        "tags": [
            "Brown Butter", 
            "Brussels Sprouts", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/11/brussel-sprouts-and-chestnuts-in-brown-butter/", 
        "title": "brussels sprouts and chestnuts in brown butter", 
        "directions": [
            "1. Bring 4 cups salted water to a boil, add brussels sprouts and cook 10 minutes. Drain and refresh under cold water. Drain again. ", 
            "2. Meanwhile, melt butter in a 3-quart saucepan. Add shallots and cook over medium heat, stirring, until light brown. Pour contents of pan through a fine strainer into a dish, pressing to remove as much butter as possible from shallots. Place shallots on paper towel to drain. Return butter to saucepan. ", 
            "3. If serving immediately, preheat oven to 400 degrees. Place saucepan over medium heat and cook until butter has a nutty aroma and is turning brown. Whisk in flour and cook until mixture is light brown. Whisk in stock and cook until sauce has thickened. Add lemon juice, salt and pepper to taste, and nutmeg. Add chestnuts and brussels sprouts, folding ingredients together. ", 
            "4. Transfer to an 8-cup baking dish. Scatter shallots on top. Bake about 15 minutes. Serve."
        ], 
        "date": "2007-11-14T23:57:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 large red onion, diced small", 
            "2 tablespoons red wine vinegar", 
            "2 teaspoons ground sumac", 
            "1/4 teaspoon kosher salt, plus more to season salad", 
            "2 cups shredded brussels sprouts", 
            "1/2 cup fresh pomegranate seeds (from about 1/2 a large one)", 
            "1/2 a large unpeeled apple, cored and diced (I used Granny Smith, the book recommends Pink Lady or Honeycrisp)", 
            "Juice of half a lemon, plus more to taste", 
            "1 1/2 to 2 tablespoons honey, plus more to taste", 
            "1/4 cup olive oil", 
            "3/4 cup toasted, cooled walnuts, lightly crushed or coarsely chopped", 
            "Ground chipotle chile pepper, urfa biber peppers, hot smoked paprika or another chile flake, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad.jpg?w=750", 
        "tags": [
            "Apple", 
            "Brussels Sprouts", 
            "Fall", 
            "Gluten-Free", 
            "Onions", 
            "Photo", 
            "Pomegranate", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Tips", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad/", 
        "title": "brussels sprouts, apple and pomegranate salad", 
        "directions": [
            "Make the sumac-pickled onions: Combine red onion, wine vinegar, sumac and 1/4 teaspoon kosher salt in a small dish and set aside while you prepare the other ingredients, or ideally at least 15 minutes.\nCombine all salad ingredients, including red onions and their pickling liquid, in a medium bowl and season to taste with salt and red pepper. Taste and adjust ingredients as desired — I’ve seen versions of the recipe with more honey, olive oil and lemon; I didn’t need them but you might find you do.\nThis salad can be prepped ahead, but I’d keep the dressing off of it until at most an hour before serving so it doesn’t discolor the sprouts."
        ], 
        "date": "2016-11-21T13:06:43+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/bourbon-pumpkin-cheesecake.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Cake", 
            "Celebration Cakes", 
            "Photo", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2006/11/candy-corn-for-really-lucky-grown-ups/", 
        "title": "bourbon pumpkin cheesecake", 
        "directions": [
            "Garnish: pecan halves ", 
            "Make crust: Invert bottom of a 9-inch springform pan (to create flat bottom, which will make it easier to remove cake from pan), then lock on side and butter pan.", 
            "Stir together crumbs, pecans, sugars, and butter in a bowl until combined well. Press crumb mixture evenly onto bottom and 1/2 inch up side of pan, then chill crust, 1 hour.", 
            "Make filling and bake cheesecake: Put oven rack in middle position and Preheat oven to 350°F.", 
            "Whisk together pumpkin, eggs, brown sugar, cream, vanilla, and liqueur (if using) in a bowl until combined.", 
            "Stir together granulated sugar, cornstarch, cinnamon, nutmeg, ginger, and salt in large bowl. ", 
            "Add cream cheese and beat with an electric mixer at high speed until creamy and smooth, about 3 minutes. Reduce speed to medium, then add pumpkin mixture and beat until smooth.", 
            "Pour filling into crust, smoothing top, then put springform pan in a shallow baking pan (in case springform leaks). Bake until center is just set, 50 to 60 minutes. Transfer to rack and cool 5 minutes. (Leave oven on.)", 
            "Make topping: Whisk together sour cream, sugar, and liqueur (if using) in a bowl, then spread on top of cheesecake and bake 5 additional minutes.", 
            "Cool cheesecake completely in pan on rack, about 3 hours.", 
            "Chill, covered, until cold, at least 4 hours. Remove side of pan and bring to room temperature before serving.", 
            "Do ahead: Baked cheesecake can be chilled, covered, up to 2 days."
        ], 
        "date": "2006-11-22T14:12:19+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups diced (1/4 inch) cantaloupe (from a 2 1/4-lb piece)", 
            "1/4 cup diced (1/4 inch) sweet onion (such as Vidalia) or red onion", 
            "2 tablespoons chopped fresh basil or cilantro", 
            "1 (2-inch-long) fresh hot red or green chile (skip the seeds if you want to dim the heat), minced", 
            "2 tablespoons fresh lime juice", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/cantaloupe-salsa.jpg?w=752", 
        "tags": [
            "Cantaloupe", 
            "Fruit", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2009/07/cantaloupe-salsa/", 
        "title": "cantaloupe salsa", 
        "directions": [
            "Mix everything and eat immediately. "
        ], 
        "date": "2009-07-28T21:42:29+00:00"
    }, 
    {
        "ingredient_list": [
            "6 tablespoons (3/4 stick) unsalted butter", 
            "2 pounds fresh shallots, peeled, with roots intact", 
            "3 tablespoons sugar", 
            "3 tablespoons good red wine vinegar", 
            "1/2 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "2 tablespoons chopped fresh flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/caramelized-shallots1.jpg?w=640", 
        "tags": [
            "Easter", 
            "Onions", 
            "Photo", 
            "Spring", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/04/caramelized-shallots/", 
        "title": "caramelized shallots", 
        "directions": [
            "Preheat the oven to 400 degrees F.", 
            "Melt the butter in a 12-inch ovenproof* saute pan, add the shallots and sugar, and toss to coat. Cook over medium heat for 10 minutes, tossing occasionally, until the shallots start to brown. Add the vinegar, salt, and pepper and toss well.", 
            "Place the saute pan in the oven and roast for 15 to 30 minutes, depending on the size of the shallots, until they are tender. Season, to taste, sprinkle with parsley, and serve hot.", 
            "* If yours, like mine, is not ovenproof, it works to start this dish in your frying pan then scrape the shallots and sauce into a baking dish when it’s ready to go in the oven."
        ], 
        "date": "2008-04-14T10:05:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium head (about 2 to 2 1/4 pounds) cauliflower", 
            "4 tablespoons (55 grams or 2 ounces) unsalted butter", 
            "4 tablespoons (30 grams or 1 ounce) all-purpose flour", 
            "2 teaspoons mustard powder", 
            "Salt, to taste", 
            "Freshly ground black pepper or ground cayenne", 
            "2 cups (475 ml) milk, whole is best but low-fat will probably work just fine", 
            "1 1/4 cups plus 2 tablespoons (about 155 grams or 5 1/2 ounces total) grated cheddar, the strongest you can get, preferably English or Irish", 
            "Chopped chives or flat-leaf parsley, for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-cheese1.jpg?w=640", 
        "tags": [
            "British", 
            "Cauliflower", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/10/cauliflower-cheese/", 
        "title": "cauliflower cheese", 
        "directions": [
            "Heat oven to 400 degrees.", 
            "Trim cauliflower and remove tough core. Cut into 1 to 2-inch florets. Steam (for about 10 minutes) or par-boil (6 to 7 minutes) florets until firm but tender. Drain, if needed, and spread florets on a towel so that it can wick out as much moisture as possible", 
            "Meanwhile, in a medium saucepan, melt butter over medium-high heat. Add flour and whisk to combine; cook for 1 minute to ensure you get rid of the floury taste. Add mustard powder and a pinch of cayenne or few grinds of black pepper, and stir to combine. Drizzle in milk in a thin, steady stream, whisking the whole time so that no lumps form. Season with salt and bring mixture to a simmer, stirring with a spoon; mixture should thicken. Stir in 1 1/4 cups cheddar, a handful at a time, letting each handful melt before adding the next. Taste sauce and adjust seasonings if needed.", 
            "Spread cauliflower florets in a 2-quart baking ovenproof baking dish. Spoon sauce over florets and sprinkle with remaining 2 tablespoons cheese. Bake until until bronzed and bubbly, about 30 minutes. For reference, f I wasn’t in such a rush to get dinner out on the table, I’d have baked mine a minute or two longer, up to 35 minutes.", 
            "Sprinkle with herbs, if desired. Eat with abandon.", 
            "P.S. A hat tip to Kate, who reminded me earlier this week that this site is way overdue for cauliflower cheese, and immediately solving my what-to-make-for-dinner crisis du jour."
        ], 
        "date": "2014-10-23T12:03:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (3-pound) head cauliflower, cut into large florets", 
            "Kosher salt", 
            "4 tablespoons (1/2 stick) unsalted butter, divided", 
            "3 tablespoons all-purpose flour", 
            "2 cups hot milk", 
            "1/2 teaspoon freshly ground black pepper", 
            "1/4 teaspoon grated nutmeg", 
            "3/4 cup freshly grated Gruyere, divided", 
            "1/2 cup freshly grated Parmesan", 
            "1/2 cup fresh bread crumbs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/11/cauliflower-gratin.jpg?w=753", 
        "tags": [
            "Cauliflower", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2008/11/cauliflower-gratin/", 
        "title": "cauliflower gratin", 
        "directions": [
            "Preheat the oven to 375 degrees F.", 
            "Cook the cauliflower florets in a large pot of boiling salted water for 5 to 6 minutes, until tender but still firm. Drain.", 
            "Meanwhile, melt 2 tablespoons of the butter in a medium saucepan over low heat. Add the flour, stirring constantly with a wooden spoon for 2 minutes. Pour the hot milk into the butter-flour mixture and stir until it comes to a boil. Boil, whisking constantly, for 1 minute, or until thickened. Off the heat, add 1 teaspoon of salt, the pepper, nutmeg, 1/2 cup of the Gruyere, and the Parmesan.", 
            "Pour 1/3 of the sauce on the bottom of an 8 by 11 by 2-inch baking dish. Place the drained cauliflower on top and then spread the rest of the sauce evenly on top. Combine the bread crumbs with the remaining 1/4 cup of Gruyere and sprinkle on top. Melt the remaining 2 tablespoons of butter and drizzle over the gratin. Sprinkle with salt and pepper. Bake for 25 to 30 minutes, until the top is browned. Serve hot or at room temperature."
        ], 
        "date": "2008-11-23T20:03:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup thinly sliced almonds", 
            "Juice of half a lemon (about 1 tablespoon), plus more to taste", 
            "1 tablespoon white wine vinegar", 
            "1/4 teaspoon fine sea salt or table salt, then more to taste", 
            "3 tablespoons (30 grams) dried currants", 
            "5 tablespoons olive oil, plus more for frying", 
            "2 tablespoons (about 25 grams) brined or salt-packed capers", 
            "oil for frying", 
            "1 small, compact-looking head of cauliflower (about 1 1/4 pounds)", 
            "Freshly ground black pepper", 
            "3 scallions, thinly sliced (use green and white parts)", 
            "2 tablespoons chopped flat-leaf parsley (optional, mostly for color)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-slaw1.jpg?w=640", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/cauliflower-slaw/", 
        "title": "cauliflower slaw", 
        "directions": [
            "Heat oven to 350 degrees F. Spread almonds on a tray and toast them until they’re a deep golden color, tossing them once or twice to ensure even cooking. This will take 10 to 14 minutes. Set aside to cool.** ", 
            "Meanwhile, place lemon juice, vinegar and 1/4 teaspoon salt in a small bowl. Add currants; set aside and let them soak while you prepare the other ingredients. ", 
            "If using brined capers, drain and spread them on paper towels until most of their moisture has wicked out, about 5 minutes. If using salt-packed capers, soak them in water for 10 minutes to remove the saltiness, then drain, rinse and pat dry on paper towels. Pour a 1/2-inch of olive oil or another oil that you prefer to fry in in a small skillet or saucepan. Heat it over medium-high. When hot enough that a droplet of water added to the oil hisses, carefully add the capers and step back — they’re going to sputter a bit for the first 10 seconds. Once it’s safe to get closer, give them a stir. Depending on how dry they were, it can take 1 to 2 minutes for them to get lightly golden at the edges and then crisp. Remove with a slotted spoon. Drain on paper towels.", 
            "Trim cauliflower leaves and cut head into quarters. Using an adjustable-blade slicer (this is mine; it takes up very little room) to cut cauliflower, stem and florets, into 1/4-inch slices. Add to a large bowl. ", 
            "Scoop currants from vinegar mixture with a slotted spoon and add to bowl with cauliflower, along with almonds, capers, scallions and parsley. Slowly whisk 5 tablespoons olive oil into remaining vinegar mixture in a thin stream. Add several turns of freshly ground black pepper. Pour over cauliflower and other ingredients and turn gently to coat all pieces. Taste and adjust seasonings, adding more lemon juice, salt or pepper to taste. Dig in!", 
            "** P.S. I really tried to avoid this pesky oven step by toasting mine in a skillet, the one I’d use to fry the capers in a few minutes. Twice, I failed because the little bits got black and smoky before the larger ones toasted, no matter how much I kept them moving. I’m pretty sure I could do better in the future, but I was running out of almonds. If you trust your pan-toasting skills, feel free to cook the almonds there instead."
        ], 
        "date": "2014-09-16T11:56:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium head cauliflower (1 1/2 to 2 pounds)", 
            "Oil for pan, if roasting", 
            "4 tablespoons salted or unsalted butter", 
            "1 medium or 2 tiny shallots, finely minced", 
            "1 small clove garlic, minced", 
            "Approximately 3/4 cup panko (Japanese-style) breadcrumbs", 
            "Salt and freshly ground black pepper", 
            "Few gratings of lemon zest", 
            "1 to 2 tablespoons fresh lemon juice", 
            "1 tablespoon chopped flat-leaf parsley or chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cauliflower-with-brown-butter-breadcrumbs1.jpg?w=640", 
        "tags": [
            "Brown Butter", 
            "Cauliflower", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/cauliflower-with-brown-butter-crumbs/", 
        "title": "cauliflower with brown butter crumbs", 
        "directions": [
            "To steam cauliflower: Set a steamer basket (see Notes) inside a large pot. Bring about one inch of water to a boil in the pot, lower cauliflower, whole or in large florets, into basket, and cover pot with lid. Reduce heat to medium. Let cauliflower steam for 10 to 20 minutes (less time if using a proper steamer basket, longer if using the modified basket below), or until it is easily pierced with a knife.   ", 
            "To roast cauliflower: Heat oven to 400 degrees. Lightly coat a large baking sheet with oil. Scatter cauliflower florets evenly over pan and roast until cauliflower is brown at edges and easily pierced with a knife, about 20 to 30 minutes. Toss and flip pieces once, halfway through roasting time, to ensure that they brown easily.", 
            "Make brown butter crumbs: When cauliflower is almost done, melt butter in a heavy frying pan over medium heat, and continue to cook it after it is melted until it is a little brown, and smells toasty. Working quickly, stir in the shallots, and let them hiss in the butter for about 30 seconds. Add the breadcrumbs, garlic, 1/4 teaspoon table salt (if using unsalted butter, skip if using salted) and a few grinds of black pepper and cook together, stirring frequently, until crumbs are a shade darker, anywhere from 5 to 10 minutes. Add a scrape or two of lemon zest and adjust seasonings to taste.", 
            "Assemble dish: Place whole cooked cauliflower or cauliflower florets in a low serving bowl. Toss gently with lemon juice, salt and pepper to taste. Spoon crumbs over cauliflower, pressing them onto the florets as you can, and letting the rest fall into the serving dish. Scatter herbs over top and serve with a large spoon.", 
            "Do ahead: Steam or roast cauliflower and make crumbs; keep them separate until serving. Just before serving, rewarm cauliflower and add crumbs.", 
            "Many notes:"
        ], 
        "date": "2013-11-20T12:06:40+00:00"
    }, 
    {
        "ingredient_list": [
            "2 small or 1 large fresh poblano chiles", 
            "1 small head cauliflower, cored and cut into rough 1-inch chunks", 
            "Salt and freshly ground black pepper to taste", 
            "3 tablespoons olive oil, plus more for cooking quesadillas", 
            "3 scallions, thinly sliced", 
            "1 tablespoon lime juice", 
            "2 cups (about 8 ounces) coarsely grated monterey jack cheese", 
            "12 small (7-inch) flour tortillas", 
            "1/2 cup sour cream or Mexican crema", 
            "A few gratings fresh lime zest", 
            "1 tablespoon freshly squeezed lime juice", 
            "1/2 teaspoon ground cumin", 
            "Pinch of salt", 
            "1 bag coleslaw mix or (as used here) 3 cups finely shredded red cabbage and 1 coarsely grated carrot", 
            "Coarse salt", 
            "Juice of half a lime", 
            "2 scallions, sliced thin", 
            "A dollop of mayonnaise, sour cream or plain yogurt", 
            "A dash of hot sauce (optional)", 
            "1/4 cup roughly chopped cilantro or flat-leaf parsley leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/charred-cauliflower-quesadillas1.jpg?w=751", 
        "tags": [
            "Cauliflower", 
            "Peppers", 
            "Photo", 
            "Sandwich", 
            "Tex-Mex", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/02/charred-cauliflower-quesadillas/", 
        "title": "charred cauliflower quesadillas", 
        "directions": [
            "Toss cabbage mix, salt and lime together in a large bowl; set aside for 5 minutes. It will shrink down a bit. Stir in scallions, then mayo and hot sauce. Adjust seasonings/ingredients to taste, then stir in cilantro leaves. Serve alongside quesadillas or any of your favorite tortilla-clad meals. "
        ], 
        "date": "2015-02-02T11:54:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large fresh corn cob", 
            "2 tablespoons butter, melted", 
            "1/2 cup flour", 
            "1 cup milk, any fat level will do", 
            "2 large eggs", 
            "1/2 teaspoon table salt", 
            "Butter or oil for pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/charred-corn-crepes1.jpg?w=500", 
        "tags": [
            "Corn", 
            "Pancakes", 
            "Photo", 
            "Summer", 
            "Tex-Mex", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/08/charred-corn-crepes/", 
        "title": "charred corn crepes", 
        "directions": [
            "To char corn: Shuck your corn but leave the “stem” on if you can; it makes a great handle. Remove small children from the area. Over a hot grill or an open gas-stove flame, char the corn until well-blackened but not completely burnt. It tends to snap, crackle and yes, pop a little making terrifying noises (hence, the removal of small people) but will smell amazing (like popcorn and fireplaces and summer camp). Remove cob from heat, and when cool enough to handle, shave off kernels using a large knife. You should have about 1 cup kernels. Transfer to a bowl and pour melted butter over it; let cool to lukewarm.", 
            "Make crepe batter: Place corn-butter mixture in a blender with flour, milk, eggs and salt. Blend until mostly smooth (a few bits and coarse piece of corn are awesome but too many will make the batter hard to pour and spread in the pan). Cover and refrigerate for 1 hour or two days; this resting time really, really makes it easier to make crepes that don’t fall apart.", 
            "Cook crepes: Heat an 8- to 9-inch skillet (nonstick makes things even easier here) over medium heat. Coat very lightly with butter or oil. Pour 3 (for an 8-inch skillet) to 4 tablespoons (for a larger size) batter into the center of the skillet and roll it around so that it evenly coats the bottom. Cook until edges appear lightly brown, then flip the crepe* and cook it on the reverse side for another 30 seconds.", 
            "Slide crepe onto a paper towel-coated plate or counter. Repeat with remaining crepe batter, re-buttering pan as needed. Cooling crepes can overlap on the towels. Cooled crepes can be stacked and will not stick to each other.", 
            "Mexican Street Corn Crepe Stack: I spread about 1 teaspoon mayonnaise (which is very scant and you can definitely use more; use yogurt or sour cream if you dislike mayo) between each crepe, then sprinkled about 2 teaspoons crumbled cotija cheese (but you can use ricotta salata, feta or another crumbly salty cheese if you cannot find it), a couple shakes of chili powder and a small amount of chopped cilantro (but you can use flat-leaf parsley if you’re not into cilantro). The toppings add up quickly as you stack the crepes, so don’t be afraid to go easy on them; you’ll still get a full amount of topping with each bite. Serve with lime wedges, squeezing some lime juice over each wedge.", 
            "* Flipping crepes is scary! Here are some tips: 1. Crepes fall apart quite easily when they’re pale and undercooked. The ones with slightly more brown spots are easier to flip, for the same reason that toast is firmer than fresh bread. As you get more confident, you can aim for paler crepes. 2. I use a weird, need-to-show-with-a-video-one-day two spatula flipping technique, usually use one offset frosting spatula (I have this one) and one flexible fish spatula (I have this one and is one of my most favorite kitchen tools, ever, the only thing I use for 99% lifting/turning kitchen tasks). I use the smaller one to get underneath the crepe enough that I can lift it enough that I can slide the larger one far underneath it, making flipping it a cinch. I promise. Once you get the hang of it, you’ll be a crepe-making junkie like me."
        ], 
        "date": "2013-08-01T11:46:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound red radishes (from about 2/3 of a bundle with stems and leaves), trimmed", 
            "1 small (4 to 5 ounces) zucchini, long and narrow if you can find it", 
            "2 limes", 
            "Salt", 
            "4 ears corn, husks removed", 
            "2 tablespoons unsalted butter", 
            "1 tablespoon olive oil, plus additional if blistering tacos in skillet", 
            "1 medium white onion, finely chopped", 
            "2 cloves garlic, minced", 
            "3 tablespoons chopped epazote (if you can find it), cilantro or pasley (for the cilantro-averse) leaves (optional)", 
            "1/2 cup (2 1/2 ounces or 70 grams) crumbled cotija cheese (or another salty, crumbly cheese such as ricotta salata or feta)", 
            "1/4 teaspoon chili powder", 
            "10 to 12 small (6-inch) soft corn tortillas"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/07/charred-corn-tacos-with-zucchini-radish-slaw.jpg?w=750", 
        "tags": [
            "Corn", 
            "Photo", 
            "Radishes", 
            "Summer", 
            "Tex-Mex", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2011/07/charred-corn-tacos-with-zucchini-radish-slaw/", 
        "title": "charred corn tacos with zucchini-radish slaw", 
        "directions": [
            "Cut radishes and zucchini into tiny matchsticks with a mandoline. If you don’t have a mandoline, you can use a peeler to peel thick ribbons down the long side of the zucchini. Stack the ribbons and cut them crosswise into thin matchsticks. Cut the radishes into a similar shape by hand. Toss radishes and zucchini together. Squeeze the juice of half a lime over the radish and season with salt to taste. Add more lime juice if desired. Set aside.", 
            "Remove toddlers from the kitchen. Over a hot grill or an open gas-stove flame char two of the ears of corn until well-blackened but not completely burnt. If you’re using the burner method, you’ll probably, quickly, notice that corn likes to pop and snap, occasionally spraying you with splats of corn. It’s a little scary, which is I why I suggest you remove anyone small and easily harmed before you begin. However, I found the charred corn flavor to be completely worth the scare and hope you do too. ", 
            "Remove cobs from heat, and when cool enough to handle, shave off kernels using a large knife and reserve. Remove kernels from remaining two ears of corn.", 
            "Heat a large sauté pan over medium heat. Melt the butter and oil together and once hot, add the onion. Cook the onion for about 5 minutes, until softened. Add the garlic and cook another minute. Add the raw corn kernels and sauté until corn is just cooked through, about three to five minutes. Turn heat to high, add the charred kernels of corn to the mixture, and toss to combine until heated through. Squeeze the juice of one lime over the corn mixture, and use the juice to scrape up any stuck bits. Season the corn mixture with salt and chili powder. Stir in chopped herbs, if using.", 
            "You can heat your tortillas one of two ways. You can wrap the whole stack in foil and place it in a warm (250 degrees) oven for 15 minutes while you prepare the other ingredients. However, I prefer to get a nice blister on them before filling them. Coat the bottom of a cast-iron skillet with olive oil and wipe it out so on the thinnest slick remains. Heat the skillet on high. Once hot, cook a tortilla for about 30 seconds to 1 minute on each side, until lightly blistered. Repeat with remaining tortillas but if your skillet is well-seasoned, no need to repeat the oiling process.", 
            "Fill each taco with a few small spoonfuls of the corn mixture. Top with a spoonful of crumbled cheese and a bit of the radish-zucchini slaw. Serve with an extra lime wedge on the side (you’ll have half a lime left to slice up), and whatever fixings you like (sour cream, avocado wedges, etc. See above)."
        ], 
        "date": "2011-07-21T13:58:00+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups (315 grams) flour", 
            "1 tablespoon (15 grams) sugar", 
            "1 teaspoon (5 grams) table salt", 
            "2 sticks (8 ounces, 225 grams tablespoons or 1 cup) unsalted butter, very cold", 
            "3 1/2 cups pumpkin puree, from 2 15-ounce (425 gram) cans or homemade", 
            "1 1/4 cups granulated sugar", 
            "1 teaspoon (6 grams) fine sea or table salt", 
            "2 teaspoons ground cinnamon", 
            "1 teaspoon ground ginger", 
            "1/4 teaspoon ground cloves", 
            "A few gratings of fresh nutmeg (or a pinch of ground nutmeg)", 
            "2 1/2 cups cold heavy cream, light cream or a combination of cream and milk", 
            "6 large eggs", 
            "8 ounces cream cheese, softened", 
            "1/3 cup sugar", 
            "1 large egg yolk", 
            "2 tablespoons heavy or light cream", 
            "1/4 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/cheesecake-marbled-pumpkin-slab-pie.jpg?w=750", 
        "tags": [
            "Fall", 
            "Photo", 
            "Pumpkin", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2016/11/cheesecake-marbled-pumpkin-slab-pie/", 
        "title": "cheesecake-marbled pumpkin slab pie", 
        "directions": [
            "\nMake the pie dough:", 
            "\nBy hand, with my one-bowl method: In the bottom of a large bowl, combine the flour, salt and sugar. Work the butter into the flour with your fingertips or a pastry blender until mixture resembles a coarse meal and the largest bits of butter are the size of tiny peas. (Some people like to do this by freezing the stick of butter and coarsely grating it into the flour, but I haven’t found the results as flaky.) Add 1/2 cup cold water and stir with a spoon or flexible silicone spatula until large clumps form. Use your hands to knead the dough together, right in the bottom of the bowl. If necessary to bring the dough together, you can add the last tablespoon of water.", 
            "With a food processor: In the work bowl of a food processor, combine flour, salt and sugar. Add butter and pulse machine until mixture resembles a coarse meal and the largest bits of butter are the size of tiny peas. Turn mixture out into mixing bowl. Add 1/2 cup cold water and stir with a spoon or flexible silicone spatula until large clumps form. Use your hands to knead the dough together, right in the bottom of the bowl. If necessary to bring the dough together, you can add the last tablespoon of water.\nBoth methods: Wrap dough in a sheet of plastic wrap and refrigerate for at least one hour, or up to 48 hours, or you can quick-firm this in the freezer for 15 minutes. Longer than 2 days, it’s best to freeze it until needed.\n\nGet ready to bake the pie: Heat oven to 400°F (205°C). Line a 10×15-inch jellyroll pan with a fitted rectangle of parchment paper.", 
            "Form the crust: On a lightly floured surface, roll out dough into a 13-by-18-inch rectangle (i.e. 3 inches bigger than your pan). Do your best to work quickly, keeping the dough as cold as possible (and tossing it in the freezer for a couple minutes if it softens too quickly) and using enough flour that it doesn’t stick to the counter.", 
            "Fold dough gently in half without creasing and transfer to prepared pan. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. Return pan to fridge until ready to fill.", 
            "Make pumpkin filling: Combine pumpkin, sugar, salt and spices in a medium saucepan over medium heat. Bring to a sputtering simmer and cook for 5 to 7 minutes, stirring frequently. Scoop cooked pumpkin filling into bowl, and whisk in cold cream until smooth. Whisk in eggs, one at a time. Pour filling into prepared pie crust.\nMarble cheesecake: Whisk cream cheese, sugar, egg yolk, cream and vanilla in a bowl until smooth. Dollop all over pumpkin batter and use a toothpick or chopstick to swirl decoratively in figure-8s, being very very careful not to drag the point of the toothpick/chopstick into the bottom crust, forming holes.\nBake pie: For 15 minutes, then reduce heat to 350°F (175°C) and bake for another 15 minutes, until only the center barely jiggles and a toothpick inserted into it comes out pumpkin-free. (Damp is fine, but the toothpick shouldn’t have loose pumpkin batter on it.)\nLet cool then chill in fridge until serving."
        ], 
        "date": "2016-11-16T13:09:00+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds boneless skinless chicken parts, cut into 3 to 4 large chunks (I use a 50/50 mix of breasts and thighs)", 
            "1 small yellow onion, chopped small", 
            "2 large garlic cloves, minced", 
            "1 tablespoon ground cumin", 
            "1 1/2 teaspoons dried oregano", 
            "2 teaspoons fine sea salt", 
            "Heat via 1 to 2 jalapenos or other fresh hot pepper, minced, or a ground chili powder of your choice, to taste", 
            "1 28-ounce can crushed tomatoes, fire-roasted if you can find them or 2 10-ounce cans Ro-Tel (yield is a little less but not noticeable in final chili)", 
            "2 2/3 cups small dried beans (I use half black beans, half small red beans; I do not presoak but do read the updated note up top; read the note at the bottom if you’re using kidney beans)", 
            "5 1/3 cups water (can replace all or part with broth)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/chicken-chili1.jpg?w=640", 
        "tags": [
            "Beans", 
            "Gluten-Free", 
            "Photo", 
            "Slow Cooker", 
            "Stew", 
            "Tex-Mex", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/01/chicken-chili/", 
        "title": "chicken chili", 
        "directions": [
            "To serve: Lime wedges, sour cream or Mexican crema, finely chopped white onion or thinly sliced scallion, chopped cilantro, corn or flour tortilla chips, and hot sauce", 
            "(I have always wanted to write recipe instructions just like this!) Throw everything in the pot and turn the heat on:", 
            "To finish: The chicken will likely have fallen apart, but you can help it along by reaching into the pot with two forks and shredding it to your desired texture. Taste and adjust seasonings. Serve with fixings of your choice.", 
            "P.S. We like this with baked tortilla chips. I estimate two small corn tortillas per person and cut them into 8 wedges. Brush a large baking sheet lightly with olive oil, arrange tortilla wedges in one layer, lightly dab the tops with more olive oil and sprinkle with fine salt. Bake at 350 for 10 minutes, check for color, and add more baking time as needed until they’re golden and crisp.", 
            "A note about kidney beans: I do not use kidney beans here, but small red ones, and I do not presoak my beans however if you are using red kidney beans, do keep in mind that due to a pathogen known as phytohaemagglutinin the FDA advises people who wish to use kidney beans in slow-cookers to first soak the beans for at least 5 hours, dump the water, boil them in fresh water for 10 minutes and then continue with the recipe. As your beans will have soaked up more liquid before they go in, you will find you need less to cook them in for the final chili. In terms of how freaked out you should be over kidney beans, from the FDA website: “Reports of this syndrome in the United States are anecdotal and have not been formally published.” And that this was mostly a concern reported in the last 70s in the UK. "
        ], 
        "date": "2016-01-04T11:45:09+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup gold tequila", 
            "1 cup freshly squeezed lime juice (5 to 6 limes)", 
            "1/2 cup freshly squeezed orange juice (2 oranges)", 
            "1 tablespoon chili powder", 
            "1 tablespoon minced fresh jalapeno pepper (1 pepper seeded)", 
            "1 tablespoon minced fresh garlic (3 cloves)", 
            "2 teaspoons kosher salt", 
            "1 teaspoon freshly ground black pepper", 
            "3 whole (6 split) boneless chicken breasts, skin on*", 
            "Combine the tequila, lime juice, orange juice, chili powder, jalapeno pepper, garlic, salt, and pepper in a large bowl. Add the chicken breasts. Refrigerate overnight. ", 
            "1 cup green onions, coarsely chopped", 
            "1/4 cup red wine vinegar", 
            "2 serrano chiles", 
            "2 tablespoons mayonnaise", 
            "Salt and pepper", 
            "1/2 cup pure olive oil", 
            "1 head purple cabbage, finely shredded", 
            "1 small red onion, halved and thinly sliced", 
            "1/4 cup chopped cilantro leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chicken-jealousy1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Chicken", 
            "Citrus", 
            "Photo", 
            "Salad", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2007/04/chicken-jealousy/", 
        "title": "tequila lime chicken + green onion slaw", 
        "directions": [
            "Blend green onions, vinegar, chiles, mayonnaise, salt, pepper and oil in a blender until emulsified. Place cabbage and red onions in a bowl, add the dressing and stir until combined. Fold in the cilantro and season with salt and pepper to taste.  "
        ], 
        "date": "2007-04-26T16:21:34+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups chopped or balled melon (from about 1 cantaloupe or honeydew, or 1/4 a large watermelon)", 
            "Juice of half a lime, divided, plus more to taste", 
            "Coarse salt, to taste", 
            "1/2 to 1 teaspoon chili powder", 
            "3 tablespoons crumbled cotija cheese", 
            "1 tablespoon toasted pepitas (I like the salty ones)", 
            "1 tablespoon chopped fresh cilantro, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_4945.jpg?w=750", 
        "tags": [
            "Cantaloupe", 
            "Honeydew", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Tex-Mex", 
            "Vegetarian", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2016/08/chile-lime-melon-salad/", 
        "title": "chile-lime melon salad", 
        "directions": [
            "Place melon in a wide bowl or on a platter. Squeeze half lime juice over, adding second half to taste, then sprinkle with salt and chili powder. Scatter with cheese, pepitas and cilantro and dig in.", 
            "Do ahead: I’d expected this salad not to keep at all but we found it just fine (with no watery run-off) after 2 hours in the fridge. I wouldn’t keep it assembled too much longer, though. You don’t want the salt to draw the juices out of the fruit before you eat it, and it’s quick enough to put together at the last minute.\n"
        ], 
        "date": "2016-08-09T11:39:50+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups unbleached all-purpose flour (2 1/2 cups, non-lattice)", 
            "1 teaspoon salt", 
            "2 tablespoons sugar", 
            "7 tablespoons all-vegetable shortening, chilled (8 tablespoons, non-lattice)", 
            "10 tablespoons unsalted butter, chilled, cut into 1/4-inch pieces (12 tablespoons, non-lattice)", 
            "10 tablespoons ice water (6 to 8 tablespoons, non-lattice)", 
            "1 1/2 pounds Granny Smith apples (about 3 medium)", 
            "2 pounds McIntosh apples (about 4 large)", 
            "1 tablespoon juice and 1 teaspoon zest from 1 lemon", 
            "3/4 cups (5.25 ounces) plus 1 tablespoon sugar", 
            "2 tablespoons all-purpose flour", 
            "1/4 teaspoon salt", 
            "1 teaspoon cinnamon", 
            "1/4 teaspoon ground nutmeg", 
            "1/4 teaspoon ground allspice", 
            "1 egg white, beaten lightly"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cinnamon-sigh1.jpg?w=500", 
        "tags": [
            "Apple", 
            "Fruit", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2006/11/cinnamon-sigh/", 
        "title": "apple pie", 
        "directions": [
            "1. Adjust oven rack to lowest position and heat rimmed baking sheet and oven to 500°F. Remove one piece of dough from refrigerator (if refrigerated longer than 1 hour, let stand at room temperature until malleable).", 
            "2. Roll dough on lightly floured work surface or between two large sheets of plastic wrap to 12-inch disk. Transfer dough to pie plate by rolling dough around rolling pin and unrolling over 9 1/2-inch pie plate or by folding dough in quarters, then placing dough point in center of pie plate  and unfolding. Working around circumference of pie plate, ease dough into pan corners by gently lifting dough edges with one hand while pressing around pan bottom with other hand. Leave dough that overhangs lip of plate in place; refrigerate dough-lined pie plate.", 
            "3. Peel, core and cut apples in half, and in half again width-wise; cut quarters into 1/4-inch slices and toss with lemon juice and zest. In a medium bowl, mix 3/4 cup sugar, flour, salt and spices. Toss dry ingredients with apples. Turn fruit mixture, including juices, into chilled pie shell and mound slightly in center.", 
            "4. Roll out second piece of dough to 12-inch disk and place over filling. Trim top and bottom edges to 1/2-inch beyond pan lip. Tuck this rim of dough underneath itself so that folded edge is flush with pan lip. Flute edging or press with fork tines to seal. Cut four slits on dough top. If pie dough is very soft, place in freezer for 10 minutes. Brush egg white onto top of crust and sprinkle evenly with remaining 1 tablespoon sugar.", 
            "5. Place pie on baking sheet and lower oven temperature to 425°F. Bake until top crust is golden, about 25 minutes. Rotate pie and reduce oven temperature to 375°F; continue baking until juices bubble and crust is deep golden brown, 30-35 minutes longer. ", 
            "6. Transfer pie to wire rack; cool to room temperature, at least 4 hours. ", 
            "Review: We all loved this pie. However, I might for the first time be taking a no-lattice top approach for apple pies in the future. Shortly after these pictures were taken, the apples fell and it ended up looking a little bird cagey on top. This has happened before, leading me to think that perhaps in the open-top variety, apples have a chance to lose too much of their moisture. It wasn’t particularly gooey inside, though tasty just the same. I’m thinking that peach or cherry pies, with their excessive juiciness, might be better-suited for lattice-tops and Cook’s Illustrated seems to agree.", 
            "Finally, I’d jack up the spices a bit next time, certainly doubling them [updated to note: not everyone agrees that it needs more spice so please, just spice to taste] and cut back on the lemon, which had a very pronounced flavor. In every other way though, crust included, this recipe is a keeper."
        ], 
        "date": "2006-11-23T12:28:36+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 1/4 cups (155 grams) all-purpose flour", 
            "1 1/2 teaspoons (6 grams) granulated sugar", 
            "1/2 teaspoon (3 grams) fine sea or table salt", 
            "1 stick (4 ounces or 115 grams) cold unsalted butter, cut into chunks", 
            "1/4 cup (60 ml) very cold water, plus an additional tablespoon if needed", 
            "Filling", 
            "1 3/4 cups pumpkin puree, from a 15-ounce (425 gram) can or homemade", 
            "2/3 cup (130 grams) granulated sugar", 
            "1/2 teaspoon (3 grams) fine sea or table salt", 
            "1 teaspoon ground cinnamon", 
            "1/2 teaspoon ground ginger", 
            "1/8 teaspoon ground cloves", 
            "A few gratings of fresh nutmeg (or a pinch of ground nutmeg)", 
            "1 1/3 cups (315 ml) cold heavy cream", 
            "3 large eggs", 
            "Topping", 
            "1/2 cup (95 grams) packed light or dark brown sugar", 
            "6 tablespoons (85 grams) unsalted butter", 
            "3 tablespoons (45 ml) heavy cream", 
            "1/4 teaspoon flaky sea salt, or a little less of a coarse salt", 
            "1 teaspoon (5 ml) vanilla extract", 
            "3/4 cup (85 grams) pecans (I coarsely chopped 1/2 cup, left the last 1/4 cup in halves)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/classic-pumpkin-pie-with-pecan-praline-sauce1.jpg?w=640", 
        "tags": [
            "Fall", 
            "Photo", 
            "Pumpkin", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2014/11/classic-pumpkin-pie-with-pecan-praline-sauce/", 
        "title": "classic pumpkin pie with pecan praline sauce", 
        "directions": [
            "Make the pie dough: ", 
            "Form the crust: On a floured counter, roll the dough out into a 12 to 13-inch circle-ish shape. Fold dough gently in quarters without creasing and transfer to a 9-inch standard (not deep-dish) pie plate. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. Return to fridge until ready to fill. (See Notes below for par-baking directions, if desired. I rarely desire this.)", 
            "Heat oven: To 400°F (205°C). ", 
            "Make the filling: Combine pumpkin, sugar, salt and spices in a medium saucepan over medium heat. Bring to a sputtering simmer and cook for 5 to 7 minutes, stirring frequently. Scoop cooked pumpkin filling into bowl, and whisk in cold cream until smooth. Whisk in eggs, one at a time. Pour filling into prepared pie crust.", 
            "Bake pie: For 15 minutes, then reduce heat to 350°F (175°C) and bake for another 30 to 40 minutes, until only the center barely jiggles and a toothpick inserted into it comes out pumpkin-free. (Damp is fine, but the toothpick shouldn’t have loose pumpkin batter on it.)", 
            "Let pie cool on a rack completely, if you, like me, prefer your pumpkin pie cool. You can hasten this along in the fridge. This pie is now ready to serve, but if you want to gild the lily a little, make the topping as well. ", 
            "Make pecan praline topping: In a small/medium saucepan set over medium-low heat, combine the brown sugar, butter, cream and salt. Bring to a simmer and cook until thick and bubbly, 3 to 5 minutes. Remove pan from heat and stir in vanilla and pecans. ", 
            "Serve pie: In wedges, ladles with pecan praline sauce. Extra pie (an unfamiliar phenomenon) keeps in the fridge for up to a week.", 
            "Notes:"
        ], 
        "date": "2014-11-17T11:45:00+00:00"
    }, 
    {
        "ingredient_list": [
            "Dipping sauce", 
            "6 tablespoons Asian fish sauce", 
            "6 tablespoons brown sugar", 
            "12 tablespoons lime juice", 
            "2 garlic cloves, finely grated or minced", 
            "Small Thai or Serrano chiles, thinly sliced, to taste ", 
            "Peanut dressing", 
            "3 tablespoons Asian fish sauce", 
            "3 tablespoons rice vinegar", 
            "9 tablespoons lime juice", 
            "3 tablespoons soy sauce", 
            "1 one-and-a-half inch chunk ginger, peeled and sliced", 
            "6 tablespoons natural unsalted peanut butter", 
            "1 tablespoon toasted sesame oil", 
            "Pinch of cayenne ", 
            "Chicken and noodle salad", 
            "1 1/4 pounds boneless skinless chicken thighs (about 6)", 
            "8 ounces dried rice vermicelli or other rice noodles", 
            "2 small cucumbers, cut in 1/4-inch half moons", 
            "2 medium carrots, cut in thin julienne", 
            "Additional vegetables, as suggested above", 
            "Small handful basil or mint or cilantro sprigs, or your favorite of the three (torn or roughly chopped)", 
            "4 or more scallions, slivered", 
            "1/4 cup crushed or chopped roasted peanuts", 
            "Lime wedges (to serve)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/06/cold-rice-noodles-with-peanut-lime-chicken.jpg?w=751", 
        "tags": [
            "Carrots", 
            "Chicken", 
            "Citrus", 
            "Cucumber", 
            "Pasta", 
            "Photo", 
            "Summer", 
            "Thai", 
            "Vietnamese"
        ], 
        "url": "https://smittenkitchen.com/2012/06/cold-rice-noodles-with-peanut-lime-chicken/", 
        "title": "cold rice noodles with peanut-lime chicken", 
        "directions": [
            "Make the dipping sauce: Whisk ingredients in a small serving bowl, making sure to dissolve the sugar. Leave to ripen for 15 minutes. Refrigerate any extra and use within a few days. ", 
            "Make the peanut dressing: In a blender or small food processor, puree all ingredients to a smooth sauce, about the thickness of heavy cream. Pour into a serving bowl. ", 
            "Marinate the chicken: Stir together 1/2 the dipping sauce and 1/3 the peanut dressing (you can eyeball this) in the bottom of a low-sided bowl or dish. Add the chicken to the mixture and toss to coat. Let marinate at least 15 minutes.", 
            "Cook the noodles: Bring a large pot of water to the boil, then turn off the heat. Add the rice vermicelli and soak for 7 to 8 minutes. (Package directions may vary; check for doneness by tasting.) Drain when noodles are al dente, and cool under running water. Fluff and leave in strainer to drain well.", 
            "Cook the chicken: Grill the chicken on an outdoor grill, a stove-top grill pan, or run under the broiler until nicely browned, about 3 to 4 minutes a side. Let cool slightly, then chop roughly into 3/4-inch pieces. ", 
            "To serve: At this point, you can place everything on a large serving platter, with piles or small bowls for noodles, vegetables, chicken, the dressing and marinade and toppings (peanuts, herbs) and let your family and friends put it together in their own bowls as they wish. Or, you can assemble it for everyone as suggested:", 
            "Toss vegetables with 1 tablespoon dipping sauce in a small bowl. Divide the cooked noodles among 4 to 6 bowls. Top each bowl equally with vegetable mixture and chopped chicken. Toss each bowl with 2 teaspoons of each the dipping sauce and dressing, or more to taste (we wanted more). Add the herbs, peanuts and scallions to each bowl and serve with additional dressing and dipping sauce on the side. "
        ], 
        "date": "2012-06-22T11:02:12+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/columbus-isle-bahamas1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2009/03/columbus-isle-bahamas/", 
        "title": "san salvador island, bahamas", 
        "directions": [], 
        "date": "2009-03-08T23:24:21+00:00"
    }, 
    {
        "ingredient_list": [
            "2 ears corn, husked", 
            "1 15-ounce can black beans, drained and rinsed", 
            "1 large poblano", 
            "Nonstick spray or 2 teaspoons oil", 
            "2 generous cups (about 8 ounces) coarsely grated monterey jack cheese", 
            "2 generous cups (about 8 ounces) coarsely grated cheddar cheese", 
            "1 12-ounce bag tortilla chips, the thicker the better", 
            "Thinly sliced jalapeno (1 used 1/2 a big one)", 
            "Thinly sliced radishes (I used 2 medium)", 
            "1/2 a white onion, minced (you can toss it with a little lime juice and salt to lightly pickle it, if desired)", 
            "Handful fresh cilantro, roughly chopped", 
            "Diced tomatoes", 
            "Shredded lettuce", 
            "Sliced avocado", 
            "Lime wedges", 
            "Hot sauce"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/06/corn-and-black-bean-weeknight-nachos1.jpg?w=750", 
        "tags": [
            "Corn", 
            "Peppers", 
            "Photo", 
            "Summer", 
            "Tex-Mex", 
            "Travel", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/06/corn-and-black-bean-weeknight-nachos/", 
        "title": "corn and black bean weeknight nachos", 
        "directions": [
            "\nOver a gas flame or on a grill over high heat, char corn all over until at least half the kernels are blistered, and poblano until skin is blackened. Let both cool slightly then cut the corn kernels from the cob. Remove the skin and seeds from the poblano and cut it into very thin ribbons. (For a large one, you might only use half.)\nHeat oven to 400 degrees. Coat your largest baking sheet with foil (which I did not, and wish I had) and lightly coat it with oil. Arrange 1/3 of chips on tray and sprinkle 1/3 of corn, black beans, poblano strips and cheese over it. Repeat twice. Bake for 15 to 20 minutes, until the cheese has melted and blistered all over. Use this time to prep your toppings.\nWhen nachos are cooked, you can sprinkle a few toppings over (I used the jalapeños, radishes, tomatoes, onion, cilantro and avocado) or just bring everything to the table and let everyone fix their own.\n"
        ], 
        "date": "2016-06-17T10:29:35+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup granulated sugar", 
            "1 cup water", 
            "1 (12-ounce) package fresh or frozen cranberries, rinsed, drained and sorted through, removing any stems or deflated ones", 
            "Several julienned strips of orange peel, or thick pieces of zest", 
            "A few squeezes of orange juice", 
            "1 15-ounce can jellied cranberry sauce", 
            "1 15-ounce can whole-berry cranberry sauce", 
            "1 bag frozen mixed berries, not defrosted", 
            "1 handful chopped walnuts", 
            "1 2/3 cups ruby Port", 
            "1/4 cup balsamic vinegar", 
            "1/4 cup (packed) golden brown sugar", 
            "8 dried black Mission figs, stemmed, chopped", 
            "1 6-inch-long sprig fresh rosemary", 
            "1/4 teaspoon ground black pepper", 
            "1 12-ounce bag fresh cranberries", 
            "3/4 cup sugar "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/cranberry-sauce.jpg?w=750", 
        "tags": [
            "Cranberries", 
            "Fruit", 
            "Photo", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2006/11/cranberries-candied-fruity-and-drunk/", 
        "title": "cranberries: candied, fruity and drunk", 
        "directions": [
            "Combine first 6 ingredients in medium saucepan. Bring to boil, stirring until sugar dissolves. Reduce heat to low and simmer 10 minutes. Discard rosemary. Mix in cranberries and 3/4 cup sugar. Cook over medium heat until liquid is slightly reduced and berries burst, stirring occasionally, about 6 minutes. Cool. Transfer sauce to bowl; chill until cold. ", 
            "Do ahead: Cranberry sauce can be prepared 1 week ahead. Cover and keep refrigerated."
        ], 
        "date": "2006-11-10T14:08:46+00:00"
    }, 
    {
        "ingredient_list": [
            "13 tablespoons (1 stick plus 5 tablespoons) unsalted butter, cut into 1-inch pieces", 
            "1/3 cup powdered sugar", 
            "1 egg yolk", 
            "1 1/2 cups unbleached flour", 
            "1 tablespoon heavy cream", 
            "1 1/4 cups heavy cream", 
            "1/2 cup (1 stick) unsalted butter, cut into eight pieces", 
            "1 cup granulated sugar", 
            "1 3/4 cup frozen cranberries", 
            "2 cups unblanched sliced almonds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cranberry-caramel-and-almond-tart1.jpg?w=640", 
        "tags": [
            "Cranberries", 
            "Fall", 
            "Fruit", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2007/10/cranberry-caramel-and-almond-tart/", 
        "title": "cranberry, caramel and almond tart", 
        "directions": [
            "1. Keep (or preheat) the oven to 350 degrees. Measure the cream and butter into a saucepan and heat it over low heat. When the butter has melted completely, remove from heat.", 
            "2. To make the caramel, spread the sugar evenly in a perfectly dry, deep 10-inch skillet and place it over medium-low heat.", 
            "3. The sugar should turn straw-colored, then gold and then a nutty-brown caramel after about 10 minutes. If the sugar cooks unevenly, gently tilt or swirl the pan to evenly distribute the sugar. Remove from heat and slowly whisk the cream and butter into the sugar, which can splatter as the cream is added (long sleeves are a good precaution). If the caramel seizes, return it to the heat and continue to stir until it is smooth and creamy. Strain the caramel into a bowl and cool it for 30 minutes.", 
            "4. Stir the frozen cranberries and the almonds into the caramel and mix until all the fruit and nuts are coated. Spoon the filling into the partially baked tart dough mounding toward the center.", 
            "5. Bake for 25 to 30 minutes, until the juices and the caramel are bubbling slowly around the edges. Remove from the oven and let stand for 1 hour, then gently lift the tart ring off the pastry.", 
            "6. Carefully transfer the tart to a serving platter. Serve warm or at room temperature."
        ], 
        "date": "2007-10-31T18:15:19+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough:", 
            "4 large egg yolks", 
            "1 large whole egg", 
            "1/4 cup (50 grams) granulated sugar", 
            "6 tablespoons (85 grams) butter, melted, plus additional to grease pan", 
            "3/4 cup (175 ml) buttermilk", 
            "Zest of 1 orange, finely grated (to be used in dough and filling, below)", 
            "3 3/4 cups (470 grams) all-purpose flour, plus more for dusting counter", 
            "1 packet (7 grams or 2 1/4 teaspoons) instant dry yeast", 
            "1 1/4 teaspoons coarse or kosher salt, or more to taste", 
            "1 teaspoon oil for bowl", 
            "Filling:", 
            "1 1/2 tablespoons (20 grams) butter", 
            "1 cup (190 grams) packed light brown sugar", 
            "1 cup (115 grams) fresh cranberries", 
            "Orange zest leftover from above", 
            "Icing:", 
            "3 1/2 tablespoons (55 ml) orange juice", 
            "2 cups (240 grams) powdered sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cranberry-orange-breakfast-buns1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Cranberries", 
            "Fall", 
            "Orange", 
            "Photo", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2013/11/cranberry-orange-breakfast-buns/", 
        "title": "cranberry-orange breakfast buns", 
        "directions": [
            "Make the dough: In the bottom of the bowl of a stand mixer, whisk the yolks, whole egg, sugar, butter, buttermilk and 3/4 of the orange zest together (saving the rest for the filling). Add 2 cups of the flour along with the yeast and salt; stir until evenly moistened. Switch to the dough hook and add the remaining 1 3/4 cups flour and let the dough hook knead the mixture on low speed for 5 to 7 minutes. The dough should be soft and moist, but not overly sticky. Scrape the dough into a large, lightly oiled bowl (I usually scrape my dough briefly onto the counter, oil the mixing bowl, and scrape the dough back into it) and cover it with plastic wrap. Let dough rise at room temperature until doubled, which will take between 2 and 2 1/2 hours.", 
            "[Don’t have a stand mixer? Stir the mixture together with a wooden spoon, then continue stirring and beating it about in a large bowl for several minutes, until it comes together. Turn the dough out onto a floured counter and knead it for another 5 minutes. It will stick; don’t sweat it. Just scrape everything up and into the oiled bowl when it’s time to let it rise. Try to resist adding extra flour when it sticks; it will only toughen the dough. That would be sad.]", 
            "Prepare the filling: Melt the butter and set it aside. In a food processor, pulse the whole cranberries until they’re ground to a coarse rubble, but not fully pureed. You’ll need to scrape the machine down once or twice. Set them aside. ", 
            "[Don’t have a food processor? Just hand chop them very well, as if to coarsely mince them.]", 
            "Assemble the buns: Butter a 9×13-inch baking dish, a heavier ceramic or glass dish is ideal here. Turn the risen dough out onto a floured work surface and roll it into a rectangle that is 18 inches wide (the side nearest to you) and 12 or so inches long. (It’s okay if it goes longer/thinner.) Brush the dough with the melted butter. Sprinkle it with the brown sugar. Scatter the ground cranberries over it, then the remaining orange zest. ", 
            "Roll the dough into a tight, 18-inch long spiral. Using a sharp serrated knife, very, very gently saw the log into 1 1/2-inch sections; you should get 12. Arrange the buns evenly spread out in your baking dish. Cover with plastic wrap and refrigerate overnight, or up to 16 hours.", 
            "The next morning, bake the buns: Take your buns out of the fridge 30 minutes before you’d like to bake them, to allow them to warm up slightly. Heat your oven to 350 degrees F. Bake your buns until they’re puffed and golden (the internal temperature should read 190 degrees F), approximately 30 minutes.", 
            "Transfer pan to a cooling rack and let cool slightly. Make the icing by whisking the orange juice and powdered sugar together. Spread a little on each bun, or drizzle it over the whole pan. Serve immediately. ", 
            "Many notes:"
        ], 
        "date": "2013-11-13T11:31:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup coarsely chopped pecans", 
            "1 1/2 tablespoons all purpose flour", 
            "2/3 cup granulated sugar", 
            "9 tablespoons (1 stick plus 1 tablespoon) unsalted butter, at room temperature", 
            "1 large egg", 
            "1 large egg white", 
            "1 tablespoon brandy (optional)", 
            "1 1/2 teaspoons finely grated orange zest", 
            "1/2 to 1 cup whole, fresh cranberries", 
            "1 Great Unshrinkable Sweet Tart Shell, baked and cooled", 
            "Powdered sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cranberry-pecan-frangipane-tart1.jpg?w=500", 
        "tags": [
            "Cranberries", 
            "Fall", 
            "Fruit", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2008/11/cranberry-pecan-frangipane-tart/", 
        "title": "cranberry pecan frangipane tart", 
        "directions": [
            "For pecan filling: Finely grind pecans and flour in processor. Mix in sugar, then butter, orange zest and brandy (if using). Blend until smooth. Mix in egg and egg white. Transfer filling to medium bowl. Cover and chill at least 3 hours. (Can be made 2 days ahead. Keep chilled.)", 
            "Position rack in center of oven and preheat to 350°F. Spread pecan filling evenly in baked tart crust. Arrange cranberries on top. Use the smaller amount for a sparsely cranberried tart like you see in these pictures. Use the larger amount if you, like us, really like things extra tart.", 
            "Bake tart until golden and tester inserted into center of filling comes out clean, about 44 to 55 minutes. Cool tart in pan on rack. Push pan bottom up, releasing tart from pan. (Can be made 8 hours ahead. Let stand at room temperature.) Cut tart into wedges; sprinkle with powdered sugar, if desired, and serve.", 
            "Do ahead: Tart dough can be made, wrapped twice and kept in the fridge for a few days, or in the freezer for a week or two. Baked pastry shell, once cool, can be covered in foil and kept at room temperature for up to two days. Frangipane can be made up to three days in advance, and kept in the fridge until ready to fill the shell. Cranberries keep well in the fridge, but even longer in the freezer. Tart can be made up to a day in advance and wrapped in the fridge (probably longer in the fridge, but you may risk losing some crispness) or at room temperature."
        ], 
        "date": "2008-11-19T23:52:25+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 1/4 cups (155 grams) all-purpose flour", 
            "1 1/2 teaspoons (6 grams) granulated sugar", 
            "1/2 teaspoon (3 grams) fine sea or table salt", 
            "1 stick (4 ounces or 115 grams) cold unsalted butter, cut into chunks", 
            "1/4 cup (60 ml) very cold water, plus an additional tablespoon if needed", 
            "Filling", 
            "4 1/2 cups fresh or frozen cranberries (from 1 1/2 12-ounce bags)", 
            "1 cup granulated sugar, plus 1 to 2 more tablespoons, if desired, to taste", 
            "A few gratings of orange zest (yes, clementine zest works great here too)", 
            "A pinch of salt", 
            "1 tablespoon cornstarch", 
            "Streusel", 
            "2/3 cup rolled oats or 1/2 cup oat flour", 
            "1/2 cup all-purpose flour", 
            "1/3 cup granulated sugar", 
            "1/3 cup light or dark brown sugar", 
            "1/2 teaspoon ground cinnamon", 
            "1/4 teaspoon coarse or sea salt", 
            "3/4 cup pecans, toasted if you have the time", 
            "6 tablespoons unsalted butter, melted and cooled", 
            "To serve", 
            "Powdered sugar, sweetened whipped cream with a splash of vanilla extract or vanilla ice cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cranberry-pie-with-thick-pecan-crumble1.jpg?w=640", 
        "tags": [
            "Cranberries", 
            "Fall", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2014/11/cranberry-pie-with-thick-pecan-crumble/", 
        "title": "cranberry pie with thick pecan crumble", 
        "directions": [
            "Make the pie dough: ", 
            "Form the crust: On a floured counter, roll the dough out into a 12 to 13-inch circle-ish shape. Fold dough gently in quarters without creasing and transfer to a 9-inch standard (not deep-dish) pie plate. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. Return to fridge until ready to fill. ", 
            "[Optional: If you’d like to par-bake the crust, once you’ve rolled it out, freeze it for 10 minutes inside your pie tin, until solid. Prick unbaked crust with a fork several times. Line it with lightly buttered foil. Fill with pie weights, dried beans or pennies. Bake at 400°F (205°C) on rimmed baking sheet 15 minutes. Remove paper or foil and weights, and bake 5 to 10 more minutes until crust is golden brown and lightly crisp.]", 
            "Heat oven: (Or reduce oven heat, if you just par-baked your crust) to 375°F (190°C).", 
            "Make the filling: Combine all filling ingredients — no need to defrost frozen cranberries, they’ll just need a couple extra minutes to warm up — in a medium saucepan over medium heat. After about 5 minutes, berries will begin to leak juices. Cook, stirring for 5 minutes more until filling is loose. If desired, you can lightly crush the mixture once or twice with a potato masher, but try to leave most berries intact. Transfer filling to a bowl to let it cool slightly for 5 to 10 minutes while you make the crumble topping.", 
            "Make the topping: If using whole oats, grind them to a powder in a food processor. Add pecans and coarsely grind them too. Add remaining ingredients except the butter, pulsing a few times to combine. Add butter, pulsing until crumbles form. Sprinkle topping over cranberry filling.", 
            "Bake pie: For 45 to 50 minutes, until juices are bubbling enough that they splash a bit onto the crumb topping. If pie browns too quickly, cover top with a piece of foil for remaining baking time. Transfer to a wire rack to cool a bit before serving showered with powdered sugar and alongside whipped cream or vanilla ice cream."
        ], 
        "date": "2014-11-24T12:16:16+00:00"
    }, 
    {
        "ingredient_list": [
            "100 or so pearl onions, unpeeled (from 3 10-ounce bags)", 
            "2 1/2 ounces bacon (applewood-smoked is suggested), cut into a small dice", 
            "1 1/4 cups heavy cream", 
            "1/4 teaspoon freshly grated nutmeg", 
            "2 tablespoons sherry", 
            "1/2 bunch chives, cut into 1/2-inch segments", 
            "Kosher salt, to taste (I used 1 teaspoon of Diamond Kosher salt)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creamed-onions-with-bacon-and-chives1.jpg?w=500", 
        "tags": [
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2010/11/creamed-onions-with-bacon-and-chives/", 
        "title": "creamed onions with bacon and chives", 
        "directions": [
            "Blanch the pearl onions for 3 minutes in a pot of boiling salted water. Drain, shock in a bath of ice water, and drain again. Peel the onions (making a slit with a paring knife down the side made this easiest for me), leaving a little of the root end intact.", 
            "[Want to use frozen, already peeled onions instead? I list some potential sources in the post.]", 
            "in a medium saucepan, cook the bacon until crisp, then remove it with a slotted spoon and drain it on paper towels. Leave only two tablespoons of the cooking fat in the pan, and add the pearl onions, heavy cream and nutmeg. Add salt to taste.", 
            "Cover the pot with a lid, leaving it a little ajar. Cook onions until they are nearly cooked through, about 90 percent of the way then remove the lid and finish cooking the onions while reducing the cream by half. Stir in the sherry.", 
            "If your onions are done cooking before the cream has sufficiently reduced or if you’re unsure about the alcohol in the sherry, remove the onions with a slotted spoon and transfer them to your serving dish. Continue cooking the remaining sauce to the desired consistency and taste and pour it back over the onions.", 
            "Garnish with bacon and chives and don’t forget to share."
        ], 
        "date": "2010-11-17T14:05:35+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds baby spinach or 2 1/2 pounds fresh spinach, tough stems discarded", 
            "1 3/4 cups heavy cream or whole milk, or a mix thereof", 
            "1 small onion, finely chopped", 
            "1 small clove garlic, minced (optional)", 
            "3 tablespoons unsalted butter", 
            "3 tablespoons all-purpose flour", 
            "Pinch of freshly grated nutmeg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/creamed-spinach.jpg?w=753", 
        "tags": [
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Spinach", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/11/creamed-spinach/", 
        "title": "creamed spinach", 
        "directions": [
            "Wash your spinach well but no need to spin or pat it dry. Place spinach in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 2 to 4 minutes for baby spinach and 4 to 6 minutes for regular spinach.", 
            "Press or squeeze out the excess liquid any number of ways, either by wringing it out in cheesecloth (my favorite method), putting it in a mesh strainer and pressing the moisture out with a spatula or large spoon or letting it cool long enough to grab small handfuls and squeezing them to remove as much water as possible. Coarsely chop the wrung-out spinach.", 
            "Wipe out large pot so you can use it again.", 
            "Heat milk or cream in a small saucepan over moderate heat, stirring, until warm. Keep warm. Meanwhile, cook onion and garlic, if using, in butter in your wiped-out large pot over moderately low heat, stirring occasionally, until softened, about six minutes. Whisk in flour and cook roux, whisking, about three minutes. Add warm milk or cream in a slow stream, whisking constantly to prevent lumps, and simmer, whisking, until thickened, three to four minutes. Stir in nutmeg, spinach, and salt and pepper to taste and cook, stirring, until heated through.", 
            "Do ahead: Creamed spinach can be made one day ahead and chilled, covered then reheated over moderately low heat until hot. However, it really tastes best eaten immediately."
        ], 
        "date": "2009-11-19T11:26:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 15-ounce can black beans, drained", 
            "1 teaspoon ground cumin", 
            "5 teaspoons olive oil, divided", 
            "2 tablespoons (or more) fresh lime juice", 
            "2 cups coleslaw mix or shredded cabbage", 
            "2 green onions, thinly sliced", 
            "1/3 cup chopped fresh cilantro", 
            "4 white or yellow corn tortillas", 
            "1/3 cup crumbled feta cheese", 
            "Hot sauce"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/02/crisp-black-bean-tacos.jpg?w=753", 
        "tags": [
            "Beans", 
            "Budget", 
            "Cabbage", 
            "Photo", 
            "Quick", 
            "Tex-Mex", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2009/02/crispy-black-bean-tacos-with-feta-and-slaw/", 
        "title": "crisp black bean tacos with feta and slaw", 
        "directions": [
            "Place beans and cumin in small bowl; partially mash. Season to taste with salt and pepper. Mix 2 teaspoons olive oil and lime juice in medium bowl; add coleslaw, green onions, and cilantro and toss to coat. Season slaw to taste with salt and pepper.", 
            "Heat 1 tablespoon olive oil in large nonstick or cast iron skillet over medium-high heat. Add tortillas in single layer. Spoon 1/4 of bean mixture onto half of each tortilla; cook 1 minute. Fold tacos in half. Cook until golden brown, about 1 minute per side. Fill tacos with feta and slaw. Pass hot sauce alongside, or if your name is Alex, drown your taco in a puddle of it."
        ], 
        "date": "2009-02-02T18:24:23+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons salted or unsalted butter, melted", 
            "3 tablespoons olive oil", 
            "Coarse salt and black pepper or red pepper flakes to taste", 
            "5 pounds sweet potatoes, peeled and sliced thin", 
            "2 shallots, peeled and sliced thin"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/crispy-sweet-potato-roast1.jpg?w=640", 
        "tags": [
            "Fall", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/11/crispy-sweet-potato-roast/", 
        "title": "crispy sweet potato roast", 
        "directions": [
            "Heat oven to 375°F (190°C). Heat butter and oil together until butter has melted. Pour 2 tablespoons of the mixture in the bottom of a 2-quart baking dish. (Mine is 9.5-by-12-inches, if that helps.) Sprinkle butter/oil puddle with some salt and pepper. Arrange your potato slices vertically in the dish. Add a sliver of shallot between every few slices of potato, if desired. Brush tops of potatoes with remaining butter/oil and season generously with more salt and pepper. Cover dish with foil and bake for 45 to 50 minutes, until potatoes are tender and almost fully cooked. Increase oven heat to 450æF (230°C), remove foil and let roast another 10 to 20 minutes, until tops of potatoes are nicely browned. ", 
            "If you’d like to finish this with the Thanksgiving Salsa Verde I show here, or at least serve it on the side, place 1 scant cup of parsley leaves, 1 tablespoon fresh rosemary, 1 generous teaspoon of fresh thyme and sage leaves, 1 small garlic clove, the zest of 1/2 a lemon and 2 teaspoons capers (rinsed and drained if salted) in a food processor or blender and blend until finely chopped. Drizzle in 7 tablespoons olive oil with the machine running, or enough the mixture is loose and somewhat pourable. Season well with salt and pepper flakes. ", 
            "[For more finishing suggestions, see last paragraph of post above.]"
        ], 
        "date": "2014-11-20T11:57:04+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "3/4 pound (12 ounces, 340 grams or about 2 1/4 cups) dried dates", 
            "2 1/4 cups (530 ml) boiling water", 
            "1 1/2 teaspoons baking soda", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "3/4 cup (150 grams) granulated sugar", 
            "2 tablespoons (25 grams) light or dark brown sugar", 
            "2 large eggs", 
            "1/4 teaspoon fine sea or table salt", 
            "1 2/3 cups (210 grams) all-purpose flour", 
            "Sauce", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "1 cup (235 ml) heavy or whipping cream", 
            "1 cup plus 2 tablespoons (215 grams) brown sugar (light is called for, but I’d like to use dark next time)", 
            "2 teaspoons vanilla extract", 
            "To serve", 
            "Unsweetened whipped cream (optional, but please don’t skip it)", 
            "A few flakes of sea salt", 
            "Fresh mint leaves (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/date-cake-with-toffee-sauce-31.jpg?w=640", 
        "tags": [
            "Cake", 
            "Christmas", 
            "Dates", 
            "English", 
            "Everyday Cakes", 
            "Photo", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/11/date-cake-with-toffee-sauce/", 
        "title": "sticky toffee pudding", 
        "directions": [
            "Make the cake: Pit and roughly chop dates and place them in a heatproof bowl. Pour boiling water over them and stir in the baking soda. Cover the bowl and set it aside for 30 minutes.", 
            "Meanwhile, heat oven to 350°F (175°C). Butter a 9×13-inch baking pan. As an extra precaution, if you’re nervous about sticking (although this cake should not), you can line the bottom with a fitted rectangle of parchment paper.", 
            "Blend date-water mixture in a blender or food processor until smooth. In a large bowl, combine the melted butter and sugars. Whisk in eggs, then salt. Stir in the flour, then date puree. Pour the batter into the prepared pan and bake for 25 to 30 minutes, until a toothpick inserted into the center comes out clean. ", 
            "To serve it rustic-style, as we did, let it cool in the pan on a cooling rack. If you’d like to transfer it later to a serving plate, let cool in the pan for 20 minutes, then flip it out onto a cooling rack, removing the parchment paper if you used it.", 
            "Make the sauce: Combine butter, cream, sugar and vanilla in a larger saucepan than you think you’ll need (I vote for 2 1/2 to 3 quarts) over medium heat and bring to a simmer. Whisk for about 10 minutes, until the mixture thickens slightly. ", 
            "To serve: Cut the cake into squares (still warm is just fine). Drizzle each slice with toffee sauce, a pinch of sea salt, and top with a dollop of whipped cream, if desired. If your mint plant has survived the fall better than mine has, a leaf or two would be lovely here, too."
        ], 
        "date": "2014-11-06T12:06:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 to 1 1/4 pounds red cabbage (1 small head or half of a large one), sliced very thin", 
            "3 tablespoons olive oil", 
            "2 tablespoons lime or lemon juice (I use lime)", 
            "Salt and red pepper flakes (I used the mild Aleppo variety) to taste", 
            "About 1/2 cup pitted dates, coarsely chopped or sliced", 
            "4 ounces feta, crumbled into chunks", 
            "1 tablespoon chopped flat-leaf parsley", 
            "2 teaspoons well-toasted sesame seeds "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-feta-and-red-cabbage-salad1.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Dates", 
            "Fall", 
            "Gluten-Free", 
            "Photo", 
            "Salad", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/11/date-feta-and-red-cabbage-salad/", 
        "title": "date, feta and red cabbage salad", 
        "directions": [
            "Toss cabbage with olive oil and first tablespoons of lime juice, plus salt and pepper, coating leaves evenly. Taste and add more lime juice, salt and pepper to taste. I do this a few times, making sure I really get this base well seasoned because it will be hard to do it as well later.", 
            "Toss dressed cabbage gently with half of dates and feta. Sprinkle with remaining dates, then feta, then parsley and sesame seeds. Dig in.", 
            "Do ahead: The whole salad can sit assembled for at least an hour, if not longer in the fridge. Mine is going strong on the second day. You can also prepare the parts separately (feta, chopped dates, sliced cabbage) to assemble right before serving, if you’re planning ahead for Thanksgiving or a dinner party."
        ], 
        "date": "2015-11-10T12:01:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups freshly-brewed espresso (from about 14 single shots or 7 doubles)", 
            "6 tablespoons granulated sugar", 
            "1 cup heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/06/9116514931_7fadc4ddd3_k.jpg?w=750", 
        "tags": [
            "Ice Cream/Sorbet", 
            "Italian", 
            "Photo", 
            "Summer", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2013/06/espresso-granita-with-whipped-cream/", 
        "title": "espresso granita with whipped cream", 
        "directions": [
            "When espresso is still hot, stir in sugar. Chill espresso in fridge until completely cold. This will immensely speed up the time it takes to freeze. Once cold, pour into a large, wide baking dish; I’d recommend something ceramic, glass or enameled over a metal-surfaced baking pan. If you’re me, clear your horribly overstuffed freezer of things that can survive outside of it for a few hours. Place dish in now-cleared freezer and freeze for one hour, then remove the mixture and scrape with two forks to break up the ice. (Your freezing time will vary, depending on the temperature and muscle of your freezer.) Return to the freezer and freeze until solid, about 2 to 3 hours, scraping it again with forks every 30 minutes or so.", 
            "To serve, whip cream to soft peaks; estimate 2 tablespoons unwhipped cream per serving so you don’t have to make too much at at ime. Place one spoonful in the bottom of a small glass. Scoop granita on top. Top with a much larger tuft of cream. Eat with a spoon on a hot day.  "
        ], 
        "date": "2013-06-24T11:09:48+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://i0.wp.com/farm1.static.flickr.com/213/464605524_cb4d9eef9a.jpg", 
        "tags": [
            "Guest Post", 
            "Photo", 
            "Seafood", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2007/04/fish-tacos/", 
        "title": "fish tacos", 
        "directions": [
            "Ciao foodies,", 
            "Jocelyn, Bloggysitter Extraordinaire"
        ], 
        "date": "2007-04-18T21:36:18+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/forgiving-eggplants-tresspasses1.jpg?w=500", 
        "tags": [
            "Eggplant", 
            "Photo", 
            "Thai", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2006/07/forgiving-eggplants-tresspasses/", 
        "title": "thai vegetable and smoky eggplant salad", 
        "directions": [], 
        "date": "2006-07-15T23:51:41+00:00"
    }, 
    {
        "ingredient_list": [
            "Eggs", 
            "2 large eggs, at room temperature", 
            "Enough vegetable oil to reach a depth of 1/4-inch", 
            "Salad", 
            "1 cup lightly-packed torn green leaf lettuce (approximately 2-inch pieces)", 
            "1/4 cup thinly sliced yellow onion", 
            "1/4 cup thin or julienned carrot strips", 
            "1/4 cup coarsely chopped celery, Chinese or other, include leaves", 
            "1/4 cup lightly packed coarsely chopped cilantro, thin stems and leaves", 
            "Dressing", 
            "1 1/2 tablespoons lime juice (Key limes are recommended, but don’t fuss if you can’t find them)", 
            "1 1/2 tablespoons palm sugar simple syrup [see Note up top] or 1 tablespoon water + 1 teaspoon dark brown sugar", 
            "1 tablespoon Thai fish sauce", 
            "1 1/2 teaspoons (1 large clove) very thinly sliced garlic", 
            "2 fresh Thai chiles, preferably green, thinly sliced (more or less to taste)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/fried-egg-salad1.jpg?w=750", 
        "tags": [
            "Budget", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2015/01/fried-egg-salad/", 
        "title": "fried egg salad", 
        "directions": [
            "Fry eggs: Heat a wok or small skillet over the highest heat. Once hot, add enough oil to reach a depth of a generous 1/4-inch. Once the oil is hot enough to smoke, carefully crack the eggs into the oil — cautiously, as they will splatter a lot — and decrease the heat to medium-high. The eggs will hiss, sputter and the whites should puff and develop translucent bubbles. Once they’re very crispy and a deep golden brown underneath, 45 seconds to 1 minute, use a thin spatula to flip the eggs, trying not to break the yolks but not fretting if it happens. Cook for another minute on the second side, until the yolks are set but still slightly molten (aim to have them a little less loose than mine, shown above). Transfer eggs to paper towels; you can cook them up to 15 minutes before serving. Discard oil and wipe out wok or skillet.", 
            "Assemble salad: Place all salad ingredients in a large bowl. Quarter the eggs through the yolks and add them to the salad.", 
            "Make the dressing: Place the lime juice, palm syrup or dark brown sugar and water, fish sauce, garlic and chiles in the same wok or skillet. Set it over medium heat and heat the mixture until it just begins to sizzle at the edges, less than 30 seconds. ", 
            "Finish and serve: Pour the hot dressing over the salad and eggs. Stir gently to combine. If you’re feeling fancy, transfer the salad, liquid at all, to a plate in a low heap. Eat at once."
        ], 
        "date": "2015-01-22T12:04:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup well-shaken buttermilk", 
            "1/2 cup mayonnaise", 
            "1 tablespoon fresh lemon juice", 
            "1/4 teaspoon Worcestershire sauce", 
            "1 small garlic clove, minced", 
            "1/4 teaspoon salt", 
            "1/8 teaspoon black pepper", 
            "2 ounces crumbled firm blue cheese (1/2 cup)", 
            "2 tablespoons finely chopped fresh chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/from-aruba-on-an-iceberg-wedge1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Salad", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/12/from-aruba-on-an-iceberg-wedge/", 
        "title": "aruba + a blue cheese iceberg wedge", 
        "directions": [
            "Blend buttermilk, mayonnaise, lemon juice, Worcestershire sauce, garlic, salt and pepper in a food processor until smooth. Add blue cheese and pulse until cheese is incorporated but dressing is still slightly chunky. Transfer to a bowl and stir in chives. ", 
            "Do ahead: Keeps, covered and chilled, for one week, though we’ve yet to test that theory."
        ], 
        "date": "2007-12-24T12:19:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound mushrooms such as cremini or white, halved lengthwise if large", 
            "2 tablespoons capers, rinsed and chopped", 
            "3 large garlic cloves, minced", 
            "2 tablespoons vegetable oil", 
            "3 tablespoons unsalted butter, cut into pieces", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup chopped flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/12/garlic-butter-roasted-mushrooms.jpg?w=749", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/12/garlic-butter-roasted-mushrooms/", 
        "title": "garlic butter roasted mushrooms", 
        "directions": [
            "Preheat oven to 450°F with rack in middle. Toss mushrooms with capers, garlic, oil, 1/8 teaspoon salt and several grinds of pepper in a 1 1/2- to 2-qt shallow baking dish. Top with butter and roast, stirring occasionally, until mushrooms are tender and golden and bubbly garlic sauce forms below, 15 to 20 minutes. Stir in lemon juice and parsley. Serve immediately, with crusty bread on the side for swiping up the juices."
        ], 
        "date": "2010-12-12T14:34:51+00:00"
    }, 
    {
        "ingredient_list": [
            "Topping", 
            "4 tablespoons butter, plus extra for greasing pan", 
            "1/2 cup dark brown sugar", 
            "Pinch of salt", 
            "4 apples (about 1 3/4 pounds), peeled, cored and cut into 1/4-inch wedges", 
            "Batter", 
            "1/2 cup (1 stick or 4 ounces) butter, at room temperature", 
            "1/2 cup sugar", 
            "1 large egg", 
            "1/3 cup dark molasses", 
            "1/3 cup honey", 
            "1 cup buttermilk", 
            "2 1/4 cups flour", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "1 teaspoon ground ginger", 
            "1 teaspoon cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/gingerbread-upside-down-apple-cake.jpg?w=750", 
        "tags": [
            "Apple", 
            "Cake", 
            "Fall", 
            "Photo", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2009/11/gingerbread-apple-upside-down-cake/", 
        "title": "gingerbread apple upside-down cake", 
        "directions": [
            "Very softly whipped cream", 
            "Make the topping: Preheat the oven to 325°F. Grease a 10-inch cake pan. Melt butter in a small saucepan. Add brown sugar and simmer over moderate heat, stirring, four minutes, then swirl in salt. Remove from heat and pour into the bottom of your cake pan. Make circles of overlapping apple slices on top of the caramel. Chop any remaining slices and place them in the gaps.", 
            "Make the batter: Using a mixer, blend 1/2 cup butter and the sugar on medium-low speed. Increase the speed to high and cream until light and fluffy.", 
            "In a medium bowl, whisk together the egg, molasses, honey and buttermilk. In a separate bowl, sift together the flour, baking soda, salt, ginger and cinnamon. Alternate mixing the flour and molasses mixtures into the butter mixture, adding the next once the last has been incorporated.", 
            "Pour the batter into the pan. Bake at least 45 to 50 minutes (thanks to commenter klp for reminding me this took a bit longer)  or until a wooden tester inserted into the center of the cake comes out clean. Let cool on a rack for 10 to 15 minutes, then turn out onto a platter (one that will catch spills, unlike what you see in the pictures above).", 
            "Serve warm or cool with very softly whipped cream."
        ], 
        "date": "2009-11-23T21:32:39+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups (281 grams) all-purpose flour", 
            "2 teaspoons (10 grams) baking soda", 
            "1/2 teaspoon (2 to 3 grams) table salt", 
            "3 teaspoons (6 grams) ground ginger", 
            "1 teaspoon (2 grams) cinnamon", 
            "1/2 teaspoon (1 gram) allspice", 
            "1/4 teaspoon ground white pepper", 
            "2 sticks (8 ounces or 227 grams) unsalted butter, at room temperature", 
            "1/2 cup (100 grams) granulated sugar", 
            "1/2 cup (96 grams) light brown sugar", 
            "1 large egg", 
            "1/3 cup (79 ml) unsulphured molasses"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/11/gingersnaps.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Fall", 
            "Photo", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2011/11/gingersnaps/", 
        "title": "gingersnaps", 
        "directions": [
            "Optional, for even more of a ginger kick: Add 1 to 2 teaspoons finely grated fresh ginger (with the wet ingredients) or 1 to 2 tablespoons finely minced candied ginger (with the dry ingredients). ", 
            "In a medium bowl, whisk together the flour, baking soda, salt and spices. In a large bowl, beat butter and sugars together until fluffy, about three minutes on medium. Add egg and molasses and beat until combined. Add dry ingredient and beat at low speed until just combined. Thoroughly scrape down bowl, ensuring ingredients are evenly mixed.", 
            "Transfer your cookie dough to plastic wrap — mine was quite soft and I felt like I was spreading frosting over plastic. I used a plate to support it. Chill in fridge for at least two hours, until firm.", 
            "Preheat oven to 350°F (180°C). Roll dough into 1-inch balls and spread at least two inches apart on baking sheets that have either been greased or lined with parchment paper. Bake for 10 to 15 minutes, which is a long range. In the 10 to 12 range, the cookies will be softer. In the 13 to 15 range, a bit snappier. In both cases, you’ll want to leave them on their baking sheets for long enough that they’re firm enough to be transferred to a cooling rack with a spatula, anywhere from 2 to 5 minutes. Cool cookies completely before packing up.", 
            "Do ahead: In an airtight container at room temperature, the cookies will soften a bit each day. Cookies keep for one week at room temperature or one month in the freezer. For even fresher cookies, you can keep balls of the unbaked dough in the freezer for up to two weeks and bake them as you need them, say, on Thanksgiving morning? "
        ], 
        "date": "2011-11-18T15:48:56+00:00"
    }, 
    {
        "ingredient_list": [
            "Crispy Onions", 
            "2 medium yellow onions, halved and thinly sliced", 
            "1/4 cup all-purpose flour", 
            "2 tablespoons panko or plain breadcrumbs", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "Canola, safflower, peanut or other high-heat oil, for deep-frying", 
            "Mushroom Sauce", 
            "3 tablespoons butter", 
            "12 ounces mushrooms, thinly sliced or coarsely chopped", 
            "Few gratings fresh nutmeg (optional)", 
            "Freshly ground black pepper", 
            "3/4 teaspoon table salt", 
            "2 garlic cloves, minced", 
            "3 tablespoons all-purpose flour", 
            "1 1/2 cups vegetable or chicken broth", 
            "1/2 cup heavy cream", 
            "Assembly", 
            "1 to 1 1/2 pounds green beans, trimmed and halved (see note about volume)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/green-bean-casserole-with-crispy-onions1.jpg?w=640", 
        "tags": [
            "Fall", 
            "Green Beans", 
            "Mushrooms", 
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/green-bean-casserole-with-crispy-onions/", 
        "title": "green bean casserole with crispy onions", 
        "directions": [
            "Make the crispy onions: Toss onion with flour, breadcrumbs, salt and pepper. Heat a 1/2-inch or so of oil in a 12-inch cast iron skillet until a drop of water flicked into it will hiss and sputter. Add onions, just a handful at a time in something close to a single layer, and fry until a light golden brown (they’ll get more color in the oven; I overcooked mine a bit, forgetting this). Remove with a spider or large slotted spoon, let oil drip off a little, back into the skillet, then spread onions out on paper towels to drain. Repeat with remaining onions. Set aside until needed; this makes a lot.", 
            "Heat oven to 400 degrees F.", 
            "Prepare the beans: Bring a large pot of salted water to boil and boil greens for 5 minutes (for standard green beans) or 2 to 3 minutes (for haricot vert, or skinny ones). Drain beans, then plunge them into ice water to full stop them from cooking. Drain again, and set aside. (If you are adamant about only using one pot, you can boil them in your 12-inch cast iron skillet that you use for the other steps. But a saucepan can be easier.)", 
            "Make the mushroom sauce: Over medium-high heat, melt butter in the bottom of a 12-inch cast iron skillet. Add the mushrooms, salt and pepper and saute them until they start releasing their liquid, anywhere from 3 to 5 minutes, depending on how they were chopped. Add the garlic and saute one minute more. Add the flour and stir it until it fully coats the mushrooms. Add the broth, 1/4 cup at a time, stirring the whole time. Simmer mixture for 1 minute, then add cream and bring back to a simmer, cooking until the sauce thickens a bit, about 5 to 6 minutes, stirring frequently. ", 
            "Assemble and bake: Add cooked greens beans to sauce and stir until they are coated. Sprinkle crispy onions over the top. Bake for 15 minutes, or until sauce is bubbling and onions are a shade darker. Eat at once.", 
            "Do ahead, a few ways: Onions can be made long in advance (up to a day) and keep at room temperature, loosely wrapped (they’d get soggy in an airtight container). Green beans can be cooked and kept in fridge until needed, at least one day. Green beans can also be combined with mushroom sauce and kept refrigerated for up to a day. Add onions and bake shortly before serving. Finally, it’s less ideal, but the entire dish can be cooked, loosely wrapped (so the crispy top doesn’t get soggy) and then rewarmed in a low oven before serving. Just keep an eye on the topping so it doesn’t get too brown while reheating.", 
            "A few notes: "
        ], 
        "date": "2013-11-18T11:56:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound green beans or haricot vert (skinny ones)", 
            "1/2 a fennel bulb (about 1/2 pound)", 
            "1 stalk celery, trimmed", 
            "1/2 medium red onion", 
            "1 tablespoon lemon juice", 
            "1/4 cup red wine vinegar", 
            "1/4 cup water", 
            "1 tablespoon kosher salt (I use Diamond brand; use less if you’re using Morton or table salt)", 
            "1 1/2 teaspoons sugar", 
            "1/3 cup (about 2 ounces) whole almonds", 
            "2 tablespoons plus 2 teaspoons olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/green-bean-salad-with-fried-almonds.jpg?w=750", 
        "tags": [
            "Easter", 
            "Fennel", 
            "Green Beans", 
            "Photo", 
            "Salad", 
            "Thanksgiving", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/02/green-bean-salad-with-pickled-red-onions-and-fried-almonds/", 
        "title": "green bean salad with fried almonds", 
        "directions": [
            "If you’ve got an adjustable blade slider, time to make it earn its keep! Very thinly slice half your fennel bulb, your celery and your half onion. If you don’t have a fancy slicer, just slice them thinly with a knife. Toss the fennel with lemon juice to prevent browning and also because it makes it extra delicious.", 
            "In a small bowl, whisk together the vinegar, water, salt and sugar together. Add the onions and set them aside for about an hour. If you don’t have an hour, 30 minutes will still pickle them to deliciousness but they will only get better with age.", 
            "Meanwhile, bring a large pot of salted water to boil. Trim and tail green beans, something I just discovered I could do with kitchen shears. For me, it was a time saver. Boil beans until crisp-tender, about 4 to 5 minutes for regular green beans and about 3 minutes for skinny ones (a.k.a. “haricot vert” — what I used). Plunge in an ice water bath. Drain and pat dry. (If you have no patience for the precision of ice water baths, take the green beans out a full minute early as they will continue cooking as they cool.)", 
            "Heat a small heavy skillet to medium heat and add one teaspoon olive oil. Add almonds and toss until lightly browned, 2 to 3 minutes. Season lightly with salt and pepper to taste. Transfer almonds to a plate, let cool, and cut each almond into half or thirds.", 
            "Assemble your salad: Toss green beans with most of fennel, all of celery and half of the pickled red onions. Sprinkle two tablespoons of the red onion pickling liquid and two tablespoons of olive oil over the mixture. Season generously with salt and pepper. Taste, adjust seasonings and ingredient levels to your preferences — we found we wanted more fennel, red onion and pickling liquid.", 
            "Serve, then eat, eat, eat. "
        ], 
        "date": "2011-02-16T21:35:45+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 ounce dried tomatoes (about 5, not packed in oil)", 
            "2 tablespoons olive oil", 
            "18 white mushrooms, stems pulled out and chopped fine and caps reserved", 
            "1/2 cup finely chopped shallots", 
            "2 garlic cloves, minced", 
            "1/3 cup fine dry bread crumbs", 
            "1 large egg yolk, beaten lightly", 
            "1/4 cup fresh parsley leaves, washed well, spun dry, and minced", 
            "1/2 teaspoon dried basil, crumbled", 
            "2 tablespoons freshly grated Parmesan "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/sundried-tomato-stuffed-mushrooms.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2006/11/grievances-aired-caps-stuffed/", 
        "title": "sundried tomato stuffed mushrooms", 
        "directions": [
            "Preheat oven to 400°F.", 
            "In a small bowl soak tomatoes in hot water to cover 5 minutes. Reserving 1 tablespoon soaking liquid, drain tomatoes well and chop fine.* ", 
            "Lay mushroom caps, stems removed, face down on baking sheet either lightly sprayed with cooking spray or parchment paper. Bake them approximately 10 minutes, or until their liquid puddles underneath. Remove from the oven. Carefully pour off liquid that has gathered in the bottom of the pan, and then again, carefully, turn mushroom caps over so they are ready to be filled.", 
            "In a small skillet heat oil over moderate heat until hot but not smoking and cook chopped mushrooms stems, shallots and garlic, stirring until shallots are softened. In a bowl stir together mushrooms mixture, bread crumbs, tomatoes, reserved soaking liquid, yolk, parsley, basil, and salt and pepper to taste. Mound stuffing in reserved mushroom caps and arrange caps in a lightly greased shallow baking dish, or the same parchment-lined pan you’ve roasted your mushrooms in. Sprinkle mushrooms with Parmesan and bake in middle of oven 15 minutes.", 
            "Makes 18 hors d’oeuvres.", 
            "* Can skip this step if using oil-packed tomatoes, as I did."
        ], 
        "date": "2006-11-15T18:12:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup ketchup", 
            "1 tablespoon prepared horseradish", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "1 teaspoon ancho or other mild chili powder", 
            "Pinch cayenne pepper", 
            "1 tablespoon juice from 1 small lemon (we use more)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/3564906953_91d36a4607_o.jpg?w=753", 
        "tags": [
            "Grilling", 
            "Photo", 
            "Seafood", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2009/05/grilled-shrimp-cocktail/", 
        "title": "grilled shrimp cocktail", 
        "directions": [
            "Stir all ingredients together in a small bowl; adjust seasonings as necessary. Cocktail sauce keeps for up to two weeks in the fridge.", 
            "To Grill Your Shrimp Peel and devein shrimp, leaving the tails attached. Toss the shrimp in a large bowl with a generous amount of olive oil, salt and fresh pepper. Grill them for just a minute or two on each side — threading them first on skewers that you’ve soaked in water makes this even easier — being careful not to overcook them. You can squeeze some lemon juice on when you’re done, for an extra hit of flavor. Serve with cocktail sauce.", 
            "To Poach Your Shrimp: Peel and devein shrimp, leaving the tails attached. Bring shrimp stock (you can make this by boiling the shrimp shells for 20 minutes in three cups of water with a tablespoon of salt and straining the liquid) or water to a boil. Additionally, you might add some lemon peels, several glugs of white wine, peppercorns, a bay leaf or tarragon to the boiling liquid for extra flavor. Turn off heat and stir in shrimp; cover and let stand until firm and pink, 8 to 10 minutes. Drain shrimp. Plunge shrimp into ice water to stop cooking, then drain again. Serve shrimp chilled with cocktail sauce."
        ], 
        "date": "2009-05-26T15:07:38+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons minced white onion (from about 1/8 large one)", 
            "1 1/2 tablespoons minced, seeded jalapeño (from about half a medium one)", 
            "2 tablespoons cilantro leaves, minced, plus more to taste", 
            "Juice of half a lime", 
            "1/4 teaspoon coarse or kosher salt, plus more to taste", 
            "2 medium-large ripe avocados"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/guacamole.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Avocado", 
            "Photo", 
            "Snack", 
            "Tex-Mex", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/02/guacamole/", 
        "title": "guacamole", 
        "directions": [
            "\nMix the onion, jalapeño and cilantro in the bottom of a medium bowl. Add lime and salt. Cut avocado in half and remove the pit. Use a knife to score each half in a grid pattern, being careful not to cut through the skin of the avocado. Run a soup  spoon between the avocado and skin to scoop the chunks cleanly into the bowl. Turn them over a few times to coat them with the dressing. Taste mixture, adding more of other ingredients to taste. Use a fork to mash chunks to desired consistency, or not at all. Try not to eat this bowl by yourself, although it will be hard.\n"
        ], 
        "date": "2017-02-03T13:16:54+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds boneless pork shoulder or pork butt, cut into 2-inch cubes", 
            "1/2 cup orange juice", 
            "1/4 cup lime juice (from about 2 to 3 limes)", 
            "4 cloves garlic, peeled and crushed", 
            "1 teaspoon ground cumin", 
            "1 teaspoon Kosher salt, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/11/homesick-texan-carnitas.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2011/11/homesick-texan-carnitas/", 
        "title": "homesick texan carnitas", 
        "directions": [
            "Place the pork in a large Dutch oven or heavy pot. Add the orange juice, lime juice, garlic, cumin, salt and enough water to just barely cover the meat. Bring the pot to a boil and then reduce the heat to a simmer. Simmer uncovered for two hours. Don’t touch the meat.", 
            "After two hours, increase the heat to medium-high and while occasionally stirring and turning the pieces, continue to cook for about 45 minutes, or until all of the liquid has evaporated, leaving only the rendered pork fat. Let it sizzle in this fat long enough to brown at the edges, turning pieces gently (they’ll be eager to fall apart), only as needed.", 
            "When pork has browned on both sides, it’s ready. Adjust seasonings to taste and serve on warmed tortillas with fixings. "
        ], 
        "date": "2011-11-04T11:09:19+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/huevos-rancheros1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Budget", 
            "Eggs", 
            "Photo", 
            "Quick", 
            "Tex-Mex", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/07/huevos-rancheros/", 
        "title": "huevos rancheros", 
        "directions": [], 
        "date": "2008-07-27T21:55:42+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/4-pound (20 ounce) round of sourdough or dense country-style white bread", 
            "1/2 cup olive oil, divided", 
            "3 tablespoons unsalted butter, divided", 
            "3 medium yellow onions, thinly sliced in half-moons", 
            "Kosher salt", 
            "1/2 teaspoon sugar or honey", 
            "2 tablespoons sherry vinegar", 
            "1 pound (large bundle) curly kale, center ribs and stems removed, chopped or torn into large chunks", 
            "2 garlic cloves, minced", 
            "2 cups vegetable, chicken or turkey broth, divided", 
            "Red pepper flakes, to taste", 
            "2 tablespoons sherry"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/kale-and-caramelized-onion-stuffing1.jpg?w=750", 
        "tags": [
            "Kale", 
            "Onions", 
            "Photo", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/11/kale-and-caramelized-onion-stuffing/", 
        "title": "kale and caramelized onion stuffing", 
        "directions": [
            "Heat oven to 400°F. Slice crusts off bread (you can save them for breadcrumbs) and tear loaf into rough 1-ish-inch pieces. Place in a large bowl and drizzle with 4 tablespoons olive oil and toss well. Spread on a large rimmed baking sheet and toast in oven, tossing once or twice for even color, until golden brown and crisp on the outside but still a little tender inside, about 20 minutes. Let cool on sheet, then tip back into that large bowl.", 
            "Meanwhile, melt 1 tablespoon butter in 2 tablespoons oil in the bottom of a large saute pan over low heat. Add the onions, toss to coat them in oil and cover the pan and with the stove on the lowest heat possible, let them cook undisturbed for 15 minutes. (The steaming and wilting will help them caramelize much faster, yay.) Remove lid, raise heat to medium/medium-high, add sugar and 1 teaspoon salt and cook onions, stirring frequently, for another 15 to 20 minutes, until they’re a deep golden brown. Add 1 tablespoon sherry vinegar and use to scrape any stuck bits off bottom of pan, then cook off. Taste onions. If desired, add a second tablespoon of sherry vinegar and cook off in the same method. (I prefer them with 2 tablespoons.) Add onions to bowl with croutons.", 
            "Add 2 more tablespoons olive oil to pan and heat garlic for half a minute, before adding kale. Get kale coated with garlicky oil, then add 2 tablespoons broth. Cook kale until wilted and somewhat tender, seasoning well with salt and pepper, about 6 minutes. Add sherry to pan and cook until it almost disappears. Add remaining broth and last two tablespoons of butter and bring mixture to a simmer. ", 
            "Pour kale-broth mixture over croutons and caramelized onions. Toss well to combine. Pour mixture into a 3-quart casserole dish and cover with foil. Bake for 15 minutes, then remove foil, and bake for another 15 to 20, until golden and crisp on top.", 
            "Do ahead: Each part of this (the croutons, the onions and the kale) can prepared up to 3 days in advance, and assembled and baked when needed. Keep the croutons at room tempearture in a container or bag. Keep the onions in the fridge, as well as the kale and broth mixture. "
        ], 
        "date": "2015-11-04T11:59:12+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (85 grams) slivered almonds", 
            "1 large handful fresh basil leaves", 
            "1 to 2 large garlic cloves", 
            "Several sprinkles of sea salt", 
            "6 ripe plum tomatoes, quartered", 
            "1/2 cup (50 grams) grated Pecorino or Parmesan", 
            "1/4 to 1/3 cup (60 to 80 ml) olive oil", 
            "1 pound (455 grams) linguine"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/linguine-with-tomato-almond-pesto1.jpg?w=500", 
        "tags": [
            "Italian", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Tomatoes", 
            "Travel", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/09/linguine-with-tomato-almond-pesto/", 
        "title": "linguine with tomato-almond pesto", 
        "directions": [
            "In a large skillet, sauté the almonds in a little olive oil until toasted. Let cool, then blend them in a food processor or blender until they are in coarse pieces.  (“The size of orzo,” the original recipe suggests.) Scoop them out of the processor and set them aside.", 
            "Put the basil, garlic and a few pinches of sea salt into the food processor and chop. Add the almonds back to the food processor (keeping them separate will keep them from getting too finely chopped as you get the basil and garlic to the right texture) with the tomatoes, cheese and olive oil and whirl briefly. Season it with freshly ground black pepper.", 
            "Cook your linguine until it is al dente and could use another minute of cooking time. Reserve one cup of pasta cooking water and drain the rest. Immediately toss the hot linguine with the pesto and mix quickly so that it drinks the sauce up a bit. Add more pasta water if needed. Serve this lukewarm, or at room temperature, with a glass of wine, after you get the baby to bed."
        ], 
        "date": "2010-09-14T11:07:16+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound small shrimp, shelled and deveined or pre-cooked and defrosted", 
            "2 firm-ripe avocados, halved, scored into a small dice", 
            "2 cups grape tomatoes, quartered or 2 cups chopped tomatoes, drained a little", 
            "1/2 small white onion, very finely chopped (use red if you can’t find white)", 
            "1 small jalapeño, seeded and finely chopped (optional)", 
            "Drizzle of olive oil", 
            "Juice of 1 to 2 limes", 
            "Salt", 
            "Handful cilantro leaves, roughly chopped", 
            "Hot sauce, on the side", 
            "Tortilla chips, to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/9349257784_815a1814b7_o.jpg?w=750", 
        "tags": [
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Seafood", 
            "Side Dish", 
            "Summer", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2013/07/mama-canales-garcias-avocado-shrimp-salsa/", 
        "title": "mama canales-garcia’s avocado-shrimp salsa", 
        "directions": [
            "To cook the shrimp: Bring salted water* to a boil and turn off heat. Add shrimp, cover pot and let stand until firm and pink, about 5 to 7 minutes. Drain shrimp, pat dry and chill. ", 
            "Make salsa: Chop shrimp into small bites and put in medium bowl. Scoop avocados into bowl. Add tomatoes, white onion, jalapeño (if using, to taste) and a drizzle of olive oil. Add the juice of one lime, and a second one, if needed. Add salt to taste, then cilantro. Serve with tortilla chips.", 
            "* If you have more time, you can first make a shrimp stock with about 3 cups water, 1 cup beer or wine, the reserved shrimp shells, additional lime juice or the peels from the lime juice you’ll use in the salad and some peppercorns or red pepper flakes. Boil these together for 20 minutes, then strain the mixture. Cook the shrimp in this stock instead."
        ], 
        "date": "2013-07-23T12:01:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 mangoes, peeled, pitted and julienned", 
            "1 to 1 1/4 pounds Napa cabbage, halved and sliced very thinly", 
            "1 red pepper, julienned", 
            "1/2 red onion, thinly sliced", 
            "6 tablespoons of fresh lime juice, from about two limes", 
            "1/4 cup rice vinegar", 
            "2 tablespoons oil of your choice", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon red pepper flakes, or to taste (or omit this and whisk in a chile paste to taste)", 
            "1/4 cup thinly sliced fresh mint leaves", 
            "1/4 cup toasted cashews, coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/mango-slaw-with-cashews-and-mint.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Mango", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2010/07/mango-slaw-with-cashews-and-mint/", 
        "title": "mango slaw with cashews and mint", 
        "directions": [
            "Toss mangoes, cabbage, pepper and onion in a large bowl. Whisk lime juice, vinegar, oil, salt and red pepper in a smaller bowl and pour over slaw. You can either serve this immediately or leave the flavors to muddle for an hour in the fridge. Before serving, toss with mint leaves and sprinkle with cashews.", 
            "About your mango: This salad will work with almost any variety or ripeness of mango, whether sour or sweet. Use the one you can get, or that you enjoy the most. In general, a firmish not overly ripe mango (unlike the very ripe, sweet one I used) holds up best but all will be delicious in this salad."
        ], 
        "date": "2010-07-08T12:58:00+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large, round tomatoes or best available", 
            "2 garlic cloves, minced", 
            "1/2 white or Spanish onion, minced (Torres says the white onion is more commonly used in Mexico)", 
            "1 chipotle en adobo, from a can (I used half of one and thought it had a plenty-big kick, you can always start with a quarter and add more if desired)", 
            "Kosher or sea salt to taste", 
            "Migas", 
            "2 links Mexican or Spanish chorizo, removed from casing, diced or coarsely chopped", 
            "4 tablespoons oil (a mixture of corn and olive oil works best)", 
            "8 eggs, lightly beaten", 
            "20 corn tortilla chips, preferably fresh", 
            "Fresh cilantro for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/migas-with-tomato-chipotle-coulis1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Budget", 
            "Eggs", 
            "Photo", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2009/03/migas-with-tomato-chipotle-coulis/", 
        "title": "migas with tomato-chipotle coulis", 
        "directions": [
            "First, cook the chorizo. Heat a medium-sized stainless steel saucepan over medium-high heat and add two tablespoons of oil. Add the chorizo and cook, stirring frequently, until the chorizo is golden and cooked through, about ten minutes. Add the eggs and after a minute, the chips. Use a wooden spoon to crush the chips as you stir to cook the eggs. Cook for about five minutes (mine took less) or until almost cooked through.Remove from heat.", 
            "[Deb note: I’m a stickler about not overcooking/drying out scrambled eggs — blech — and always remove them from the heat while they still look a little damp; they continue cooking in their residual heat even once plated.]", 
            "Set up four plates for serving. Ladle some coulis in the bottom of each dish, top with some of the egg mixture and sprinkle with the cilantro. Serve immediately."
        ], 
        "date": "2009-03-11T14:26:40+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup pearl barley or farro", 
            "3 cups water", 
            "1 tablespoon unsalted butter", 
            "1 tablespoon olive oil", 
            "2 garlic cloves, minced", 
            "9 scallions, finely chopped (1 1/3 cups), divided", 
            "1 pound cremini mushrooms, sliced", 
            "1/4 cup dry Madeira (preferably Verdelho or Sercial)", 
            "1 cup whole-milk ricotta", 
            "1 (1-pound) package frozen all-butter puff pastry, thawed (if you can get DuFour, it will be worth every extra penny–promise)", 
            "1 egg yolk, beaten with 1 teaspoon water and a pinch of salt", 
            "Make filling:", 
            "If using farro, cover it with cold water in a bowl and soak 30 minutes, then drain in a colander, discarding soaking water. Bring farro, water (3 cups), and 1/4 teaspoon salt to a boil in a medium saucepan, then reduce heat and simmer, uncovered, until tender, 15 to 20 minutes. Drain.", 
            "Roll out pastry while filling cools:", 
            "If pastry is in 1 piece, cut into 2 equal pieces. Roll out each piece on a lightly floured surface into an 11-inch square. Stack squares on a parchment-paper-lined baking sheet with a second sheet of parchment between them, then cover with plastic wrap and chill at least 30 minutes.", 
            "Assemble and bake pie: ", 
            "Put a large baking sheet on rack in middle of oven and preheat oven to 400°F."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-and-barley-pie1.jpg?w=500", 
        "tags": [
            "Grain/Rice", 
            "Mushrooms", 
            "Photo", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/11/mushroom-and-barley-pie/", 
        "title": "mushroom and barley pie", 
        "directions": [
            "Set aside top square of pastry on parchment. Spread cooled filling evenly over pastry on baking sheet, leaving a 1-inch border. Brush border with some of egg wash, and, using parchment, invert second square on top, lightly pressing to seal border. Brush top with remaining egg wash, then crimp border with a fork and trim with a pizza wheel or sharp knife.", 
            "Cut a few small steam vents in top of pie and decoratively score pastry. Slide pie on parchment onto preheated baking sheet in oven and bake until puffed and deep golden brown, about 45 minutes.", 
            "Do ahead: The filling can be made and pastry rolled out 1 day ahead and chilled. Or, you can assemble the pie up to three hours ahead of time and chill it uncovered until you’re ready to bake it."
        ], 
        "date": "2008-11-17T22:52:59+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/napa-day-one1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/08/napa-day-one/", 
        "title": "napa, day one", 
        "directions": [], 
        "date": "2007-08-18T11:31:43+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/napa-days-two-three1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/08/napa-days-two-three/", 
        "title": "napa, days two & three", 
        "directions": [], 
        "date": "2007-08-20T01:14:36+00:00"
    }, 
    {
        "ingredient_list": [
            "2 medium red bell peppers", 
            "3 medium mixed bell peppers (orange, yellow, green)", 
            "3/4 teaspoon kosher salt", 
            "1/2 teaspoon ground black pepper", 
            "3 tablespoons butter", 
            "1 onion, finely chopped", 
            "2 cloves garlic, minced", 
            "1 medium zucchini, cut into 1/4-inch dice", 
            "1 medium yellow squash, cut into 1/4-inch dice", 
            "2 cups fresh or frozen corn kernels (from 3 to 4 ears of corn; for extra flavor, once you’ve cut the kernels off, use the dull side of your knife blade to scrape the remaining corn and juices, or “milk” from the cob)", 
            "1 medium tomato, seeded and cut into 1/4-inch dice", 
            "2 tablespoons chopped fresh herbs (such as parley, oregano, basil or a mix)", 
            "1/4 cup plain dried breadcrumbs", 
            "Oil for coating grill grate", 
            "2 tablespoons grates Parmesan cheese (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/08/smoke-roasted-stuffed-bell-peppers.jpg?w=753", 
        "tags": [
            "Grilling", 
            "Peppers", 
            "Photo", 
            "Tips", 
            "Travel", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/08/napa-wrapper/", 
        "title": "smoke-roasted stuffed bell peppers", 
        "directions": [
            "If using a gas grill: Use indirect heat on medium (325° to 350°F), a 2- to 4-burner grill-middle burner(s) off, or a 2-burner grill with 1 side off and a clean, oiled grate.", 
            "If using a charcoal grill: Indirect heat, medium ash, split charcoal bed (about 2 dozen coals per side) with a clean, oiled grate on medium setting", 
            "1.\tHeat the grill as directed. Soak 2 cups of apple or oak wood chips or chunks in water for one hour. ", 
            "2.\tSeed, core and cut one of the red bell peppers into 1/4-inch dice. Cut the remaining bell peppers in half lengthwise right through the stem, leaving a bit of stem attached to each half. Cut out the cores, seeds, and ribs from the interiors of the peppers, leaving the stem intact. Sprinkle the insides of the peppers with 1/4 teaspoon of the salt and 1/4 teaspoon of the pepper. ", 
            "3.\tMelt the butter in a large skillet over medium heat. Add the onion and saute until almost tender, about 4 minutes. Add the garlic, chopped bell pepper, zucchini and yellow squash. Saute the vegetables until crisp-tender, about 4 minutes. Stir in the corn and tomato and cook until heated through, 1 to 2 minutes. Stir in herbs, breadcrumbs, and the remaining 1/2 teaspoon salt and 1/4 teaspoon pepper. Cook and stir until the breadcrumbs soak up most of the liquid in the pan. Remove from the heat and spoon the filling equally into the pepper cavities. ", 
            "4.\tWhen the grill is hot, put the soaked wood chips or chunks over the coal on both sides of the grill. If using gas, put the wood chips in a smoker box or in a perforated foil packet directly over one of the heated burners. ", 
            "5.\tBrush the grill grate and coat it with oil. Put the stuffed peppers over the unheated part of the grill, cover, and cook until just tender 20 to 30 minutes. If your grill has a temperature gauge, it should stay around 350ÂºF. ", 
            "6.\tRemove the peppers to a large serving platter. Sprinkle with the Parmesan (if using) and serve. "
        ], 
        "date": "2007-08-23T00:09:03+00:00"
    }, 
    {
        "ingredient_list": [
            "Lid", 
            "2 cups (250 grams) all- purpose flour", 
            "1/2 teaspoon table salt", 
            "13 tablespoons (185 grams or 1 stick plus 5 tablespoons) cold unsalted butter, diced", 
            "6 tablespoons (90 grams) sour cream or whole Greek yogurt (i.e., a strained", 
            "yogurt)", 
            "1 tablespoon (15 ml) white wine vinegar", 
            "1/4 cup (60 ml) ice water", 
            "1 egg, beaten with 1 tablespoon water, for egg wash", 
            "Filling", 
            "2 tablespoons (30 ml) olive oil", 
            "4 ounces (115 grams or 3/4 to 1 cup) 1/4-inch-diced pancetta", 
            "1 large or 2 small onions, finely chopped", 
            "1 large carrot, finely chopped", 
            "1 large stalk celery, finely chopped", 
            "Pinch of red pepper flakes", 
            "Salt and freshly ground black pepper", 
            "2 garlic cloves, minced", 
            "Thinly sliced Swiss chard leaves from an 8- to 10-ounce (225- to 285-gram)", 
            "bundle (4 cups); if leaves are very wide, you can halve them lengthwise", 
            "3 1/2 tablespoons (50 grams) butter", 
            "3 1/2 tablespoons (25 grams) all- purpose flour", 
            "3 1/2 cups (765 ml) sodium- free or low- sodium chicken or vegetable broth", 
            "2 cups white beans, cooked and drained, or from one and a third 15.5- ounce", 
            "(440-gram) cans"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/10/pancetta-swiss-chard-and-white-bean-pot-pies.jpg?w=750", 
        "tags": [
            "Beans", 
            "Cookbooks", 
            "Fall", 
            "Photo", 
            "Swiss Chard", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2012/10/pancetta-white-bean-and-swiss-chard-pot-pies/", 
        "title": "pancetta, white bean and chard pot pies", 
        "directions": [
            "Make lids: In a large, wide bowl (preferably one that you can get your hands into), combine the fl our and salt. Add the butter and, using a pastry blender or your fingertips, cut them up and into the flour mixture until it resembles little pebbles. Keep breaking up the bits of butter until the texture is like uncooked couscous. In a small dish, whisk together the sour cream, vinegar, and water, and combine it with the butter-flour mixture. Using a flexible spatula, stir the wet and the dry together until a craggy dough forms. If needed, get your hands into the bowl to knead it a few times into one big ball. Pat it into a flattish ball, wrap it in plastic wrap, and chill it in the fridge for 1 hour or up to 2 days.", 
            "Make filling: Heat 1 tablespoon olive oil over medium- high heat in a large, wide saucepan, and then add the pancetta. Brown the pancetta, turning it frequently, so that it colors and crisps on all sides; this takes about 10 minutes. Remove it with a slotted spoon, and drain it on paper towels before transferring to a medium bowl. Leave the heat on and the renderings in the pan. Add an additional tablespoon of olive oil if needed and heat it until it is shimmering. Add onions, carrot, celery, red pepper flakes, and a few pinches of salt, and cook over medium heat until the vegetables are softened and begin to take on color, about 7 to 8 minutes. Add the garlic, and cook for 1 minute more. Add the greens and cook until wilted, about 2 to 3 minutes. Season with the additional salt and freshly ground black pepper to taste. Transfer all of the cooked vegetables to the bowl with the pancetta, and set aside.", 
            "Make sauce: Wipe out the large saucepan; don’t worry if any bits remain stuck to the bottom. Then melt the butter in the saucepan over medium- low heat. Add the flour, and stir with a whisk until combined. Continue cooking for 2 minutes, stirring the whole time, until it begins to take on a little color. Whisk in the broth, one ladleful at a time, mixing completely between additions. Once you’ve added one- third of the broth, you can begin to add the rest more quickly, two to three ladlefuls at a time; at this point you can scrape up any bits that were stuck to the bottom — they’ll add great flavor.", 
            "Once all of the broth is added, stirring the whole time, bring the mixture to a boil and reduce it to a simmer. Cook the sauce until it is thickened and gravylike, about 10 minutes. Season with salt and pepper. Stir the white beans and reserved vegetables into the sauce. ", 
            "Preheat your oven to 375 degrees.", 
            "Assemble and cook pot pies: Divide the filling between four ovenproof 2-cup bowls. (You’ll have about 1 1/2 cups filling in each.) Set the bowls on a baking pan. Divide the dough into four pieces, and roll it out into rounds that will cover your bowls with an overhang, or about 1 inch wider in diameter than your bowls. Whisk the egg wash and brush it lightly around the top rim of your bowls (to keep the lid glued on; nobody likes losing their lid!) and drape the pastry over each, pressing gently to adhere it. Brush the lids with egg wash, then cut decorative vents (smaller than mine, please, as they led to lots of draping) in each to help steam escape. Bake until crust is lightly bronzed and filling is bubbling, about 30 to 35 minutes.", 
            "Do ahead: The dough, wrapped twice in plastic wrap and slipped into a freezer bag, will keep for up to 2 days in the fridge, and for a couple months in the freezer. The filling can be made up to a day in advance and stored in a covered container in the fridge."
        ], 
        "date": "2012-10-16T11:18:35+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup sugar", 
            "3 ounces (6 tablespoons) salted butter, the better you can get, the better it will taste", 
            "1/2 cup plus two tablespoons heavy cream, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/paris-a-deep-dark-salted-butter-caramel-sauce1.jpg?w=500", 
        "tags": [
            "French", 
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/10/paris-a-deep-dark-salted-butter-caramel-sauce/", 
        "title": "paris + a deep, dark salted butter caramel sauce", 
        "directions": [
            "Melt the sugar over medium to moderately high heat in a larger pot than you think you’ll need–at least two or three quarts, whisking or stirring the sugar as it melts to ensure it heats evenly. Cook the liquefied sugar to a nice, dark copper color. Add the butter all at once and stir it in, before turning off the stove and pour in the heavy cream (The sauce will foam up quite a bit when you add it; this is why you want the larger pot.), whisking it until you get a smooth sauce. ", 
            "You use it right away or pour it into a jar and store it in the fridge for up to two weeks. When you take it out, it will likely have thickened a bit but 60 seconds in the microwave brings it right back to pouring consistency.", 
            "Serve over everything."
        ], 
        "date": "2008-10-21T16:39:54+00:00"
    }, 
    {
        "ingredient_list": [
            "3 ounces (6 tablespoons) unsalted butter", 
            "8 small-medium baking potatoes (about 4 pounds), scrubbed", 
            "16 fresh flat-leaf parsley leaves", 
            "Coarse salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/parsley-leaf-potatoes1.jpg?w=640", 
        "tags": [
            "Budget", 
            "Herbs", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/parsley-leaf-potatoes/", 
        "title": "parsley leaf potatoes", 
        "directions": [
            "Heat oven to 450 degrees F. Place roasting pan in oven with butter; once butter has melted, just a minute or two later, remove pan from oven. Halve each potato lengthwise. Place one parsley leaf in the center of each cut half, then sprinkle cut sides generously with salt. Arrange face-down in pan with melted butter; try not to nudge them around or the leaves will move (as mine did) off-center. Roast potatoes for 35 to 45 minutes (depending on size) until tender. There’s no need to turn the potatoes over unless they get so dark underneath (this can happen with a thinner roasting pan or oven than runs hotter) that they risk overcooking before becoming fully tender; if so, just flip the potatoes for the remaining roasting time.", 
            "Serve immediately; cut sides up."
        ], 
        "date": "2013-11-22T14:14:13+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups all-purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "3/4 teaspoon baking soda", 
            "1/2 teaspoon fine sea salt", 
            "6 tablespoons cold unsalted butter, diced", 
            "1 1/4 cups (2 7/8 ounces) finely grated aged pecorino or parmesan cheese", 
            "2 slim scallions, minced (optional)", 
            "2 tablespoons flat-leaf parsley, chopped small plus 16 extra leaves for garnish", 
            "1 cup well-shaken buttermilk", 
            "1 large egg, lightly beaten with 1 teaspoon water for wash"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/parsley-pecorino-biscuits1.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Breakfast", 
            "Brunch", 
            "Herbs", 
            "Photo", 
            "Put An Egg On It", 
            "Scones/Biscuits", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2015/11/parsley-pecorino-biscuits/", 
        "title": "parsley pecorino biscuits", 
        "directions": [
            "Heat oven to 425 degrees F. Stir together flour, baking powder, baking soda, and salt in the bottom of a large bowl, then use your fingertips or a pastry blender to work the butter into the dry mixture, until the largest chunks are the size of tiny peas. Stir in cheese, scallions and chopped parsley, then buttermilk, stirring just until combined. Knead once or twice right inside the bowl to form into a rough dough.", 
            "Pat or roll it out to a 1/2-inch thickness on a floured counter. Cut into 2-inch rounds, pressing straight down and not twisting the cutter. Place on an parchment-lined baking sheet. Brush the tops of each with egg wash, then place one leaf at the center of each biscuit top. Use brush to dab leaf with egg wash.", 
            "Bake biscuits for 11 to 13 minutes, until golden brown. Eat right away, or at least before the day is out. ", 
            "Because biscuits are best on the first day, if planning ahead, I like to make the dough, cut in into rounds and freeze it until needed. Biscuits can be baked right from the freezer and will only require about 2 minutes extra. Brush egg wash and leaf on right before baking. "
        ], 
        "date": "2015-11-24T12:08:24+00:00"
    }, 
    {
        "ingredient_list": [
            "4 pounds (1.8 kilograms) peaches", 
            "1 cup (237 ml) water", 
            "2 cups (400 grams) granulated sugar", 
            "Juice of one lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peach-butter1.jpg?w=500", 
        "tags": [
            "Peach", 
            "Photo", 
            "Summer", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2011/09/peach-butter/", 
        "title": "peach butter", 
        "directions": [
            "Without a food mill: Cut a small “x” in the bottom of each peach. Dip each into a pot of boiling water for 30 seconds, and then into a bowl of cold water for a minute. The peels should slide right off.  [If you have a food mill, skip the peeling step and I’ll tell you where to use it in a moment.] ", 
            "Halve your peaches and remove the pits, then cut each half into quarters (i.e. 8 chunks from each peach). Place peach chunks and water in a large pot and bring to a boil. Simmer until peaches are tender, about 15 to 20 minutes, stirring occasionally to ensure they cook evenly. If you have a food mill, run them through it to puree them and remove the skins. If you don’t have a food mill — i.e. you already peeled your peaches — you can puree in a food processor, blender or with an immersion blender. I like my peach butter very smooth, but feel free to leave any amount of texture you prefer.", 
            "Return the peaches to the large pot, add the sugar and lemon juice and bring the mixture to a good strong simmer/gentle boil, cooking them at this level for 30 to 40 minutes, stirring occasionally in the beginning and more often near the end, as it thickens up and the fruit masses risk scorching on the bottom of the pot. ", 
            "There are several methods to test for doneness: You can drizzle a ribbon of sauce across the surface; when that ribbon holds its shape before dissolve into the pot, it is done. Some people use cold or frozen plates; dollop a spoonful in the middle of one and if no water forms a ring around it in a couple minutes, it is done. Others use a spoon; if the butter remains rounded on a spoon for two minutes, it is done. You can also check the pot itself; the butter is usually done when a wooden spoon leaves a clear trail when scraped across the bottom.", 
            "Let peach butter cool (unless you’re canning it, in which, follow the directions below). If you’re not canning it, keep it in an airtight container in the fridge. It should be good for at least two weeks.", 
            "To can your peach butter: First, sterilize your jars, either by boiling them in a large, deep pot of water (which should cover the jars completely) for 10 minutes or washing them in lots of hot soapy water, rinsing and drying the parts well and then place the jars only in a 200 degree oven for 20 minutes. Then, divide your hot piping hot peach butter between your jars, leaving a little room at the top. Wipe the rims clean with a dry towel and cover the jars with their lids. Submerge the jars in a large, deep pot of boiling water for 10 minutes, either in a removable basket or using tongs to dip and remove them. Let cool completely on towels, a process that can take overnight. If canned properly, the peach butter should last indefinitely at room temperature. ", 
            "I did not have canning jars around when I made this, but am so so so in love with it that I will be buying some and making more before the last peaches are gone. I am a woman converted."
        ], 
        "date": "2011-09-02T13:48:38+00:00"
    }, 
    {
        "ingredient_list": [
            "Crumble", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 cup (50 grams) granulated sugar", 
            "3 tablespoons (37 grams) packed dark or light brown sugar", 
            "1 cup gingersnap crumbs (4 ounces or 113 grams or about 16 storebought cookies)", 
            "1/8 teaspoon ground ginger", 
            "1/8 teaspoon table salt", 
            "Pinch of white pepper, especially if your gingersnaps aren’t particularly snappish", 
            "1/2 cup (4 ounces or 113 grams or 1 stick) unsalted butter, melted and cooled", 
            "Filling", 
            "2 pounds (about 4 to 5) large ripe pears (I used Anjou, suggested in the original recipe) peeled, halved, cored and sliced 1/4 inch thick", 
            "1 1/2 cups (6 ounces or 170 grams) fresh cranberries", 
            "1 tablespoon (15 ml) lemon juice", 
            "1/2 teaspoon finely grated lemon zest", 
            "1/2 teaspoon vanilla extract", 
            "1/2 cup (100 grams) granulated sugar", 
            "2 tablespoons (14 grams) cornstarch"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/10/pear-cranberry-and-gingersnap-crumble.jpg?w=750", 
        "tags": [
            "Cranberries", 
            "Crumbles/Crisps", 
            "Fall", 
            "Pear", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/10/pear-cranberry-and-gingersnap-crumble/", 
        "title": "pear cranberry and gingersnap crumble", 
        "directions": [
            "Preheat the oven to 350°F.", 
            "Stir together the flour, granulated sugar, brown sugar, gingersnap crumbs, ginger and salt. Stir in the melted butter until large crumbs form.", 
            "In a 1 1/2 to 2 quart baking dish, mix the pears, cranberries, lemon juice, lemon zest and vanilla. In a small bowl, whisk the sugar and cornstarch together then toss it with the fruit mixture in the pan. Sure, you could do this in a bowl but then you’d also have to wash that bowl and hooray for fewer dishes.", 
            "Sprinkle the gingersnap crumble over the fruit. Set the crumble on a foil-lined baking sheet (in a 2 quart dish, mine didn’t come close to bubbling over but I see no reason to risk it) and bake it for about 45 minutes, until the crumble is a shade darker and you see juices bubbling through the crumbs. See how long you can wait before digging in."
        ], 
        "date": "2011-10-26T09:47:57+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust:", 
            "1 1/4 cups (155 grams) all-purpose flour", 
            "1 1/2 teaspoons (6 grams) granulated sugar", 
            "1/2 teaspoon (3 grams) fine sea or table salt", 
            "1 stick (4 ounces or 115 grams) cold unsalted butter, cut into chunks", 
            "1/4 cup (60 ml) very cold water, plus an additional tablespoon if needed", 
            "Filling", 
            "6 tablespoons unsalted butter", 
            "1 cup packed dark brown sugar", 
            "3/4 cup golden syrup (see Note up top)", 
            "A pinch or two of sea salt", 
            "2 cups (225 grams) pecan halves", 
            "1 teaspoon apple cider vinegar", 
            "1 tablespoon bourbon (optional)", 
            "2 teaspoons vanilla extract", 
            "3 large eggs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/pecan-pie1.jpg?w=750", 
        "tags": [
            "Christmas", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2015/11/pecan-pie/", 
        "title": "pecan pie", 
        "directions": [
            "Make the pie dough: ", 
            "Form the crust: On a floured counter, roll the dough out into a 12 to 13-inch circle-ish shape. Fold dough gently in quarters without creasing and transfer to a 9-inch standard (not deep-dish) pie plate. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. If not parbaking, place in fridge until ready to fill. If parbaking, place in freezer for 20 minutes, until solid.", 
            "Par-bake the crust: [Optional, but will lead to a crispier base.] Heat oven 400°F (205°C). Line frozen crust with lightly buttered or oiled foil. Fill with pie weights, dried beans or pennies. Bake on a rimmed baking sheet for 20 minutes. Carefully remove foil and weights and let cool a little before filling. ", 
            "Heat oven: (Or reduce oven heat, if you just par-baked your crust) to 350°F (175°C).", 
            "Prepare filling: Spread pecans on a rimmed baking sheet and toast in the oven for 10 to 12 minutes, stirring once or twice so that they toast evenly. Set aside until needed. If you like smaller bits, you can chop them, or as shown here, chop half of them (although I usually leave them whole).", 
            "In medium saucepan, combine butter, brown sugar, golden syrup and pinch of salt. Bring to a simmer over medium heat and cook for 2 minutes, stirring. Remove from heat and stir in pecans, cider vinegar, vanilla and bourbon (if using). Pour into a bowl (so that it cools faster) and set the mixture aside to cool a little, about 5 to 10 minutes. Then, whisk in one egg at a time until combined. Pour mixture into prepared pie shell. ", 
            "Bake: For 40 to 45 minutes. The pie is done with the edges are set and puffed slightly and the center is slightly firm to the touch but still has some jiggle to it. Cool on a rack. Serve slightly warm or room temperature."
        ], 
        "date": "2015-11-12T12:04:09+00:00"
    }, 
    {
        "ingredient_list": [
            "2 thin slices or small wedges grapefruit", 
            "Kosher salt for rim, if desired", 
            "2 tablespoons grapefruit juice", 
            "2 tablespoons pomegranate juice", 
            "1 teaspoon honey, sugar or agave", 
            "1/4 cup white tequila", 
            "About 3 medium-sized ice cubes", 
            "1/4 cup club soda or seltzer", 
            "A few pomegranate arils (for garnish)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/pomegranate-grapefruit-paloma.jpg?w=750", 
        "tags": [
            "Drinks", 
            "Grapefruit", 
            "Photo", 
            "Pomegranate", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2017/02/pomegranate-grapefruit-paloma/", 
        "title": "pomegranate grapefruit paloma", 
        "directions": [
            "If you'd like to salt the rim of you glass, put a little kosher salt on a small plate. Swipe the rim of your glass with a wedge of grapefruit (or a wedge from the emptied grapefruit you've just juiced) and place the damp rim in the salt, twisting to coat it.\nPlace both juices and honey or sugar in the bottom of your glass and use a long spoon to stir it until combined, and/or until the sugar has dissolved. Add tequila, stir to combine. Add ice then club soda or seltzer. Garnish with additional grapefruit slices and pomegranate arils.  Repeat as needed."
        ], 
        "date": "2017-02-24T13:03:41+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/prague-vienna-and-a-mixed-salad1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Salad", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/05/prague-vienna-and-a-mixed-salad/", 
        "title": "prague, vienna and a mixed salad", 
        "directions": [], 
        "date": "2008-05-13T12:44:30+00:00"
    }, 
    {
        "ingredient_list": [
            "Rolls", 
            "3/4 cup plus 2 tablespoons milk", 
            "1 1/2 tablespoons granulated sugar", 
            "1 1/4 teaspoons (half a 1/4-ounce or 7-gram packet) active dry yeast", 
            "3 tablespoons unsalted butter, melted, plus extra to coat bowl", 
            "2 cups flour, either all-purpose or bread flour, or a mix thereof, plus extra for dusting", 
            "1 teaspoon fine sea or table salt", 
            "To finish", 
            "1/2 cup water", 
            "1 1/2 teaspoons baking soda or food-grade lye (see Notes below)", 
            "1 egg, beaten with 1 teaspoon water", 
            "Pretzel salt, coarse salt or sesame seeds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/pretzel-parker-house-rolls1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Bread", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2014/11/pretzel-parker-house-rolls/", 
        "title": "pretzel parker house rolls", 
        "directions": [
            "Make dough: Warm milk and sugar together until they’re about 105 to 110°F (41 to 44°C) in the bottom of a large mixing bowl. If you don’t have a thermometer, the correct temperature is when you can dip your finger into the liquid without noticing any temperature change (i.e. not warmer or cooler than your finger). Add yeast to milk-sugar mixture and let stand for 5 to 7 minutes. It should dissolve and become slightly foamy. ", 
            "Stir in butter, then 3/4 of flour, the salt, then remaining flour. Using spoon (for manual mixing) or dough hook (of a stand mixer), mix the dough until it forms a slightly sticky dough that balls together. If making by hand, turn out onto a floured counter and knead until smooth and elastic, about 10 minutes. If using a machine, let the dough hook do the work, running it for 5 minutes on low. If, at the end of the kneading process, the dough still feels quite sticky (a little sticky is good; more tips here), add 1 more tablespoon flour.", 
            "First rise: With kneaded dough on counter, butter or oil your mixing bowl. Return dough to bowl, cover with plastic wrap and place in a draft-free warmish spot for 1 hour, or until doubled in bulk.", 
            "Second rise: Butter an 8×8-inch square or equivalent size baking pan (such as a 9-inch round cake pan or deep-dish pie plate). Flour your counter and let dough fall out onto it. I like to take advantage of the round shape left by the bowl to divide my dough into even-enough wedges, like slices of a pie. Divide into 16 pieces. Form each into a round. Arrange seam side-down in prepared pan, with an even amount of space between rolls. Cover loosely with plastic wrap and let rise for another hour. About 10 minutes before the hour is up, begin the next step to heat the oven and prep pretzel wash.", 
            "Pretzel it! Heat oven to 375°F (190°C). If using the baking soda option, bring your water to a boil and slowly stir in baking soda — it will foam up. If using the food-grade lye option, do not heat your water, just stir the lye into the water in a sink, wearing gloves (see more precautions in Notes below). ", 
            "Thoroughly brush tops and creases between rolls (as best as your brush can get in) with the lye or soda pretzel wash. Rinse brush and beat your egg with 1 teaspoon water. Brush the rolls a second time, this time with the egg wash. Sprinkle rolls with either sesame seeds or coarse salt. Use a sharp paring knife to make +-sign slashes in the top of each roll; you want to cut at least 1/2-inch down (I always make my cuts too shallow and they get lost when baked). ", 
            "Bake: Bake rolls for 20 to 25 minutes, until a lovely brown on top. Let cool in pan on rack. Salt-topped rolls are best on the first day. Sesame-topped rolls keep better, and can easily be frozen and stashed for future bread emergencies urgencies.", 
            "Notes:"
        ], 
        "date": "2014-11-13T11:46:18+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups whole milk (Or 1 cup heavy cream plus 1/2 cup whole milk)", 
            "3/4 cup canned solid-pack pumpkin", 
            "1/2 cup sugar", 
            "2 large eggs plus 1 yolk", 
            "1/2 teaspoon salt", 
            "1 teaspoon ground cinnamon", 
            "1/2 teaspoon ground ginger", 
            "1/8 teaspoon ground allspice", 
            "Pinch of ground cloves", 
            "2 tablespoons bourbon (optional)", 
            "5 cups cubed (1-inch) day-old baguette or crusty bread", 
            "3/4 stick unsalted butter, melted* (can skip this step if using the second set of instructions)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/10/pumpkin-bread-pudding.jpg?w=750", 
        "tags": [
            "Fall", 
            "Photo", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2007/10/pumpkin-bread-pudding/", 
        "title": "pumpkin bread pudding", 
        "directions": [
            "Preheat oven to 350°F with rack in middle.", 
            "Gourmet’s Instructions: Whisk together pumpkin, cream, milk, sugar, eggs, yolk, salt, spices and bourbon, if using, in a bowl. ", 
            "Toss bread cubes with butter in another bowl, then add pumpkin mixture and toss to coat. Transfer to an ungreased 8-inch square baking dish and bake until custard is set, 25 to 30 minutes.", 
            "Alternate, Come On, Be Lazy With Me, instructions: While preheating oven to 350°F with rack in middle, melt butter in bottom of a 8-inch square baking dish. Once it is melted, take it out of the oven and toss bread cubes with butter, coating thoroughly. In a separate bowl, whisk together all the remaining ingredients. Pour them over buttered bread cubes in baking dish, stirring to make sure all pieces are evenly coated. Bake until custard is set, 25 to 30 minutes. "
        ], 
        "date": "2007-10-18T13:49:07+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "6 tablespoons (85 grams) unsalted butter, to be divided", 
            "1/2 cup (120 ml) whole milk, warmed (but not over 116 degrees)", 
            "2 1/4 teaspoons active dry yeast (from 1 .25-ounce or 7 gram envelope yeast)", 
            "3 1/2 cups (440 grams) all-purpose flour, plus extra for rolling out", 
            "1/4 cup (packed) (50 grams) light or dark brown sugar", 
            "1/4 cup (50 grams) granulated sugar", 
            "1 teaspoon (6 grams) table salt", 
            "1/2 teaspoon ground cinnamon", 
            "1/4 teaspoon freshly grated nutmeg", 
            "1/8 teaspoon ground cardamom (optional)", 
            "1/4 teaspoon ground ginger", 
            "2/3 cups (160 grams) pumpkin puree, canned or homemade", 
            "1 large egg", 
            "Oil for coating rising bowl", 
            "Filling", 
            "3/4 cup (packed, 145 grams) light or dark brown sugar", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/8 teaspoon table salt", 
            "2 teaspoons (5 grams) ground cinnamon", 
            "Glaze", 
            "4 ounces (115 grams) cream cheese, softened", 
            "2 tablespoons (30 ml) milk or buttermilk", 
            "2 cups (240 grams) powdered sugar, sifted", 
            "Few drops vanilla extract (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/10/pumpkin-cinnamon-rolls.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Fall", 
            "Photo", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2012/10/pumpkin-cinnamon-rolls/", 
        "title": "pumpkin cinnamon rolls", 
        "directions": [
            "Make your dough: Melt your butter, and hey, if you’re melting it in a little saucepan, you might as well brown it for extra flavor. Once the butter has melted, keep cooking it over medium heat for a few additional minutes. It will become hissy and sizzle a lot, then take on a nutty flavor as golden bits form at the bottom of the pot. Remove from heat and set aside to cool slightly.", 
            "Combine your warmed milk and yeast in a small bowl and set aside. After five to seven minutes, it should be a bit foamy. If it’s not, you might have some bad yeast and should start again with a newer packet.", 
            "In the bottom of the bowl of an electric mixer combine flour, sugars, salt and spices. Add just 1/4 cup (or two-thirds of; leave the rest for assembly) of your melted/browned butter and stir to combine. Add yeast-milk mixture, pumpkin and egg and mix combined. Switch mixer to a dough hook and run it for 5 minutes on low.", 
            "Scrape mixture into a large oiled bowl and cover with plastic wrap. Set aside for 1 hour in a draft-free place; it should just about double.", 
            "While it is rising, line the bottom of two 9-inch round cake pans (8-inch round should work too, as does an 8-inch square) with parchment paper and butter the sides of the pan and the paper.", 
            "Assemble buns: Scoop dough onto a very well floured surface and flour the top of it well. With a rolling pin, roll the dough to an approximately 16×11-inch rectangle. Brush reserved melted/browned butter over dough. Stir together remaining filling ingredients and sprinkle mixture evenly over dough. Starting on a longer side, roll the dough into a tight spiral. It’s going to make a mess because the dough is crazy soft and some stuff spills off the ends; don’t sweat it. It will all be delicious in the end.", 
            "Here’s how to cut cinnamon rolls without squishing their pretty spirals: With a sharp serrated knife, using absolutely no pressure whatsoever (only the weight of the blade should land on the dough) gently saw your log with a back-forth motion into approximately 1-inch sections. When a soft dough like this is rolled, it tends to grow longer, which means that you’ll have the option to either make more buns (say, 18 instead of 16) or just cut them a little larger (in generous inches).", 
            "Divide buns between two prepared pans. You can sprinkle any sugar that fell off onto the counter over them. Cover each pan with plastic wrap and let rise for another 45 minutes.", 
            "If you’re doing this ahead of time, you can now put them in the fridge overnight. In the morning, leave them out for an hour to warm up and finish rising.", 
            "15 minutes before you’re ready to bake them, heat the oven to 350°F. Meanwhile, you can make the glaze. Beat your cream cheese until it is light and fluffy. Add powdered sugar and vanilla. Drizzle in milk until you get the consistency you’re looking for, either thick enough to ice or thin enough to drizzle.", 
            "Finish your buns: Remove the plastic and bake buns for 25 minutes, until puffed and golden and the aroma brings all the boys to your yard is like a snickerdoodle. Transfer pans to wire cooling racks and drizzle/schmear with cream cheese glaze, then have at them."
        ], 
        "date": "2012-10-05T11:30:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound bakery white or challah bread, crusts removed, cut into 1-inch cubes", 
            "1 Granny Smith apple, peeled and cut into 1/2-inch pieces", 
            "1 cup (6 ounces) golden raisins, plumped in hot water for 15 minutes", 
            "3 large eggs", 
            "3/4 cup sugar", 
            "1/4 teaspoon cinnamon", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1/8 teaspoon ground ginger", 
            "1/4 teaspoon pure vanilla extract", 
            "1/4 teaspoon salt", 
            "3 cups whole milk", 
            "2 tablespoons unsulfured molasses", 
            "1/4 cup sliced almonds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/raisin-studded-apple-bread-pudding1.jpg?w=500", 
        "tags": [
            "Apple", 
            "Fall", 
            "Photo", 
            "Pudding", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2009/11/raisin-studded-apple-bread-pudding/", 
        "title": "raisin-studded apple bread pudding", 
        "directions": [
            "Preheat the oven to 350°F. Spread the bread cubes on a baking sheet and toast in the oven for 6 minutes, until crisp. Transfer to a bowl and add the apple and raisins.", 
            "Generously butter either a 9×13-inch deep baking dish or six 8-ounce ramekins. If using ramekins, set them on the baking sheet.", 
            "In a medium bowl, using a handheld electric mixer or whisk, beat the eggs with the sugar. Beat in the ground spices, vanilla and salt.", 
            "In a medium saucepan, heat the milk with the molasses until just warm to the touch. Gradually beat the warm milk into the egg mixture, scraping the bottom and side of the bowl.", 
            "Spread bread mixture out in your large baking dish, or distribute it among ramekins. Pour the custard over the bread mixture, nudging the bread around a bit to make sure it soaks all of the pieces. Let stand for 5 minutes. Sprinkle the almonds on top. Bake in the center of the oven for about 40 minutes, until puffed and set, with the tops lightly browned. Let the bread pudding(s) rest for at least 15 minutes before serving."
        ], 
        "date": "2009-11-10T09:53:03+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/raspberry-breakfast-bars.jpg?w=753", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Raspberries", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/09/raspberry-breakfast-bars/", 
        "title": "raspberry breakfast bars", 
        "directions": [
            "Make the crust and crumb: Preheat the oven to 350°F. Butter the bottom and sides of a 9-by-13-inch glass or light-colored metal baking pan. Put a long piece of parchment paper in the bottom of the pan, letting the parchment extend up the two short sides of the pan and overhang slightly on both ends. (This will make it easy to remove the bars from the pan after they have baked.) Butter the parchment.", 
            "Put the flour, brown sugar, oats, salt, baking powder, baking soda, and cinnamon in a food processor. Pulse in short bursts until combined. Add the butter and pulse until loose crumbs form.", 
            "Reserve 1 1/2 cup of the mixture and set aside. (Note: The book suggests you reserve one cup only. My gut told me that was too little, and I upped it. I wanted to make sure the top of the raspberries were mostly covered, at least for packing purposes, and was glad I had changed it.) Pour the rest of the mixture into the prepared pan and use your hans or the back of a large wooden spoon to push the crust into an even layer at the bottom of the pan. The crust should touch the sides of the pan. Bake until golden brown, 12 to 15 minutes. Transfer to a wire rack and let the crust cool. Keep the oven on while you make the raspberry filling.", 
            "Make the raspberry filling: In a medium bowl, whisk the sugar, lemon zest, cinnamon and flour together. Add the raspberries, lemon juice and butter and use your hands to toss gently until the raspberries are evenly coated.", 
            "Assemble and bake the bars: Spread the raspberry filling evenly on top of the cooled crust. Sprinkle the reserved crust mixture evenly on top of the filling.", 
            "Bake for 35 to 45 minutes, rotating the pan every 15 minutes, until the top is golden brown and the filling starts to bubble around the edges.", 
            "Transfer to a wire rack to cool completely, then cut into squares and serve. The bars can be stored in the refrigerator in an airtight container for up to two days."
        ], 
        "date": "2008-09-02T15:50:41+00:00"
    }, 
    {
        "ingredient_list": [
            "Grains", 
            "2 fresh poblano chile peppers, seeded and roughly chopped", 
            "1 cup cilantro leaves (picked from 1 bunch)", 
            "3/4 medium white onion, roughly chopped (I save the last 1/4 to finely mince as a topping)", 
            "2 cloves garlic, chopped", 
            "3 cups water or broth (amount needed for wheat berries, adjust if needed)", 
            "1 cup uncooked wheatberries", 
            "Salt to taste", 
            "Beans", 
            "1 tablespoon olive oil", 
            "1 clove garlic, minced", 
            "1/2 to 1 finely chopped chipotle from a can, a rehydrated and finely chopped dried chipotle or in a pinch, chipotle powder to taste", 
            "1 teaspoon ground cumin", 
            "1/2 teaspoon dried oregano", 
            "1 1/2 tablespoons tomato paste", 
            "1/2 cup water or broth", 
            "1 3/4 cups cooked small red beans (from a 15-ounce can, or cooked from about 1/4 pound dried)", 
            "Kosher or coarse salt to taste", 
            "Fixings", 
            "Minced white onion or picked red onions, lime wedges, hot sauce, pickled jalapenos, sour cream or Mexican crema, sliced avocado, pico de galo, crumbled or shredded cheese or some crumbled tortilla chips if you’re having trouble convincing your child to try it "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/green-grain-and-red-bean-taco-bowl1.jpg?w=750", 
        "tags": [
            "Beans", 
            "Budget", 
            "Grain/Rice", 
            "Tex-Mex", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/03/red-bean-and-green-grain-taco-bowl/", 
        "title": "red bean and green grain taco bowl", 
        "directions": [
            "Make green grains: In a blender or food processor, combine poblanos, cilantro, onion and garlic with a splash of cooking broth or water and puree until smooth. In a medium saucepan, combine wheat berries, remaining cooking water or broth, 3/4 of green puree and salt to taste over high heat and bring to a boil. Reduce to a very low simmer and cover, cooking for 1 hour, or until grains are chewy-tender. Add remaining green puree and cook for 5 minutes more. ", 
            "Meanwhile, make red beans: In a smaller saucepan, heat olive oil over medium. Add garlic and cook for 30 seconds, just until sizzling. Add chipotle, cumin, oregano and tomato paste and cook together for 1 minute. Add water or broth, beans and salt to taste and bring to a gentle simmer. Cook for 10 minutes on low.", 
            "Assemble and eat: For each bowl, I like about 2/3 grains and 1/3 beans, but you can go half-half as well. Top with desired fixings, don’t hold back. (The sour cream was particularly awesome here, in our opinion, although decidedly un-vegan.) Repeat as needed.", 
            "* Cilantro: If you’ve been following along for a while here (although I cannot imagine why my persnickety ingredient preferences would hold your attention), you might have heard me refer over the years to cilantro as “the devil’s herb” as I am one of the unfortunate ones for whom it tastes mostly like dirt. Yes, unfortunate, as it comes on or in almost every cuisine I adore. I don’t know what came over me this week, but I went to the store with a plan to replace the cilantro with parsley, as I often do, and bought the evil greens instead. And cooked with them. And ate them. Maybe it’s the blending with peppers, onions and broth that mellowed it. Maybe, for once, these food cravings could be for good, and not just butter. Either way: hooray! "
        ], 
        "date": "2015-03-10T12:07:27+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons (30 ml) olive oil, divided", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "1 large or 2 small heads of cauliflower (about 2 1/4 to 2 3/4 pounds)", 
            "2 tablespoons (30 grams) unsalted butter", 
            "1/4 cup (30 grams) hulled pumpkin seeds (sold as pepitas) (see note above)", 
            "1/2 teaspoon crushed red pepper flakes, or less to taste", 
            "Juice of half a lime (about 1 tablespoon)", 
            "Handful chopped fresh cilantro, parsley or chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/cauliflower-with-pumpkin-seeds-brown-butter-and-lime.jpg?w=750", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/11/roasted-cauliflower-with-pumpkin-seeds-brown-butter-and-lime/", 
        "title": "roasted cauliflower with pumpkin seeds, brown butter and lime", 
        "directions": [
            "Heat oven to 450°F. Coat a large rimmed baking sheet with just over 1 tablespoon of the olive oil. Sprinkle the sheet with salt and pepper. Trim cauliflower and cut into 1/2-inch slices. Arrange in a single layer on baking sheet, then drizzle with remaining scant 1 tablespoon olive oil and sprinkle with more salt and pepper. Roast for 15 to 20 minutes, until underside is deeply browned. Carefully flip pieces and roast until dark brown and crisp on second side, about 15 to 20 minutes longer.\nWhile cauliflower roasts, in a small skillet over medium heat, melt butter, then reduce heat to medium-low and add pumpkin seeds. Stirring the whole time, cook until butter becomes light brown and smells toasty, about 4 to 6 minutes. Let cool for 10 minutes, then add lime juice and season with salt, black pepper and red pepper flakes to taste.\nArrange cauliflower on a serving platter and drizzle with dressing. Serve topped with herbs."
        ], 
        "date": "2016-11-01T11:24:09+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups (160 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "8 tablespoons (4 ounces or 115 grams) cold unsalted butter, cut into pieces and chill again", 
            "1/4 cup (60 grams) plain yogurt or sour cream", 
            "2 teaspoons (10 ml) fresh lemon juice", 
            "1/4 cup (60 ml) ice water", 
            "For the filling", 
            "6 small-to-medium leeks, dark green tops discarded, white and light green parts halved lengthwise", 
            "2 tablespoons olive oil", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "1 15-ounce can cannellini beans, rinsed and drained", 
            "1 garlic clove, minced", 
            "1/4 teaspoon finely grated lemon zest", 
            "1/4 cup chopped flat-leaf parsley", 
            "2/3 cup grated gruyère cheese, divided", 
            "Glaze:", 
            "1 egg yolk beaten with 1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/roasted-leek-and-white-bean-galettes1.jpg?w=750", 
        "tags": [
            "Beans", 
            "Leeks", 
            "Photo", 
            "Tarts/Quiche", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/11/roasted-leek-and-white-bean-galettes/", 
        "title": "roasted leek and white bean galettes", 
        "directions": [
            "Make dough: Stir the flour and salt together in a large bowl. Sprinkle bits of butter over dough and, using a pastry blender or your fingertips, work it into the flour until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, stir together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball. Wrap with plastic and refrigerate for 1 hour, or up to 2 days.", 
            "Meanwhile, prepare filling: Heat the oven to 400 degrees F. Arrange leeks cut-side-up in a large (9×13-inch) baking dish. Drizzle with olive oil. Sprinkle with 1 teaspoon kosher salt and freshly ground black pepper. Flip the leeks so that their cut sides face down, add 3 tablespoons of water to the dish, cover tightly with aluminum foil and bake for 20 minutes until tender. Uncover and continue roasting the leeks for 10 to 15 minutes, or until caramelized. Leave oven on. Let leeks cool slightly, then chop into segments and place in a large bowl. Toss with beans, garlic, lemon zest, parsley, 1/2 cup grated cheese and season with salt and pepper to taste. ", 
            "Assemble galettes: Divide dough into 4 pieces. On a floured counter, roll the first piece dough out into a roughly 8-inch round, although it really doesn’t need to be perfectly shaped. Transfer to a large parchment-lined baking sheet; I like to fold my dough gently, without creasing, in quarters then unfold it onto the baking pan. Sprinkle about 1/4 of the prepared filling into the center of the dough, leaving a 1 1/2-inch border. Sprinkle with about 1/4 of the remaining cheese. Fold the border over the filling, pleating the edge to make it fit. The center will be open. Brush crust with egg yolk glaze. Repeat with remaining dough and filling, making 4 small galettes.", 
            "Bake the galettes: For 25 to 30 minutes, until golden brown all over. Remove from the oven and let stand for 5 minutes, then slide the galette onto a serving plate. Or, if you’re planning ahead, let cool completely and refrigerate until needed. Gently rewarm before serving in a low oven."
        ], 
        "date": "2015-11-18T12:09:49+00:00"
    }, 
    {
        "ingredient_list": [
            "10 medium red and yellow onions (4 lb)", 
            "1 lb sliced bacon, cut crosswise into 1-inch-wide pieces", 
            "3 celery ribs, cut crosswise into 1/2-inch-thick slices", 
            "1 teaspoon salt", 
            "1 teaspoon black pepper", 
            "3 garlic cloves, minced", 
            "15 oz baby spinach, trimmed and coarsely chopped (14 cups)", 
            "1 (9-inch) round loaf country-style bread (1 1/4 lb), cut into 1/2-inch cubes (10 cups), lightly toasted", 
            "2 cups salted roasted cashews (10 oz), coarsely chopped", 
            "1 stick (1/2cup) unsalted butter, melted", 
            "1 1/4 cups turkey giblet stock"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-stuffed-onions1.jpg?w=500", 
        "tags": [
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2007/11/roasted-stuffed-onions/", 
        "title": "roasted stuffed onions", 
        "directions": [
            "Make onion shells: Cut a 1/2-inch-thick slice from tops of onions, discarding tops, and trim just enough from bottoms for onions to stand upright. Scoop out all but outer 2 or 3 layers from each using a small ice cream scoop or spoon (don’t worry if you make a hole in the bottom), reserving scooped-out onion and onion shells separately. ", 
            "Make stuffing: Coarsely chop enough scooped-out onion to measure 3 cups. ", 
            "Cook bacon in 2 batches in a 12-inch heavy skillet over moderate heat, stirring, until crisp, about 10 minutes, then transfer with a slotted spoon to paper towels to drain, reserving about 1/3 cup fat in skillet. ", 
            "Add chopped onion, celery, salt, and pepper to skillet and sautÃƒÂ© over moderately high heat, stirring, until vegetables are softened, about 5 minutes. Add garlic and sautÃƒÂ©, stirring, 1 minute. Transfer mixture to a large bowl and stir in spinach, bread, cashews, butter, 1 cup stock, and bacon, then cool completely. ", 
            "Roast onions: Preheat oven to 425Â°F. Arrange onion shells, open sides up, in a 13- by 9- by 2-inch baking pan, then add 1/2cup water and cover pan tightly with foil. Roast onions in middle of oven until tender but not falling apart, 25 to 30 minutes. ", 
            "Stuff and bake onions: Reduce oven temperature to 350Â°F. Transfer shells to a work surface and pour off water in pan. Fill shells with stuffing, mounding it, and return to pan. Reserve 5 to 7 cups stuffing for turkey cavity, then put remaining stuffing in a buttered shallow 3 1/2-quart baking dish and drizzle with remaining 1/4 cup stock. ", 
            "Bake stuffed onions and stuffing in dish in middle of oven, uncovered, until heated through, about 25 minutes. "
        ], 
        "date": "2007-11-05T00:43:26+00:00"
    }, 
    {
        "ingredient_list": [
            "Olive oil", 
            "1 large onion, sliced (1 1/2 cups)", 
            "2 cups (1/4-inch-sliced) fennel, top and core, if thick, removed", 
            "3 cloves garlic, minced (1 tablespoon)", 
            "1 pound sweet potatoes, peeled and sliced 1/4-inch thick", 
            "1 pound celery root, peeled and sliced 1/4-inch thick", 
            "1 pound yukon gold, peeled and sliced 1/4-inch thick", 
            "1 cup heavy cream (see Note up top)", 
            "2 cups chicken or vegetable stock or brother", 
            "2 cups grated gruyere cheese (6 ounces with rind)", 
            "2 teaspoons minced fresh thyme leaves", 
            "Kosher salt and freshly ground black pepper", 
            "2 1/2 cups coarse fresh breadcrumbs or panko (what I used)", 
            "2 to 3 tablespoons melted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/root-vegetable-gratin.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Fennel", 
            "Freezer Friendly", 
            "Onions", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/11/root-vegetable-gratin/", 
        "title": "root vegetable gratin", 
        "directions": [
            "Heat your oven to 350°F. Butter a 13×9-inch deep baking dish.\nHeat 2 tablespoons olive oil in a large deep (ideally 12-inch) saute pan over medium heat and add the onions and fennel. Cooking, tossing occasionally, until lightly browned and tender, about 10 minutes. Add the garlic and cook for one minute more.\nMeanwhile, in the largest bowl you own, combine the onion mixture with remaining vegetables, cream, stock, cheese, thyme, 1 tablespoon kosher salt and 1 1/2 teaspoons black pepper. Pour mixture into prepared dish and spread until even. Mix breadcrumbs and butter until evenly coated and distribute evenly over top of dish.\nBake 1 1/2 hours uncovered, or until vegetables are very tender when tested with a small knife and the top is browned and bubbly. Allow to set for 15 minutes at room temperature and serve hot."
        ], 
        "date": "2016-11-10T13:09:08+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/savh1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/03/savh/", 
        "title": "sav’h", 
        "directions": [
            "Alas, we’ve been home less than 24 hours and already gone out for a birthday dinner and missed many hours of sleep, all of which means no new recipes for you! For me! At least not today. I hope to be back in the swing of the things shortly, as I have a blissful Southern-inspired recipe I’m tweaking just for you. I mean, us. Until then, I will do my best to lure that great thaw a few states north.", 
            "[Remainder of the vacation pictures over here.]", 
            ""
        ], 
        "date": "2007-03-07T23:00:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup heavy cream", 
            "1 cup whole milk (I used 2 cups of half and half instead of one cup each of cream and milk)", 
            "3 large eggs plus 2 large egg yolks", 
            "1 teaspoon vanilla extract", 
            "1 (15-ounce) can pumpkin puree", 
            "1 cup drained candied yams from 15-ounce can (regular canned yams can be substituted)", 
            "3/4 cup sugar", 
            "1/4 cup maple syrup", 
            "2 teaspoons grated fresh ginger (I used 1 1/2 teaspoons of ground because I’m not a huge fan of fresh ginger)", 
            "1/2 teaspoon ground cinnamon", 
            "1/4 teaspoon ground nutmeg", 
            "1 teaspoon table salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/silky-smooth-pumpkin-pie1.jpg?w=753", 
        "tags": [
            "Photo", 
            "Pumpkin", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2008/11/silky-smooth-pumpkin-pie/", 
        "title": "silky smooth pumpkin pie", 
        "directions": [
            "Preheat oven to 400 degrees F.", 
            "Roll out dough on generously floured (up to 1/4 cup) work surface to make 12-inch circle about 1/8-inch thick.  Roll dough loosely around rolling pin and unroll into pie plate, leaving at least 1-inch overhang all around pie plate.", 
            "Working around circumference, ease dough into plate by gently lifting edge of dough with one hand while pressing into plate bottom with other hand. Refrigerate 15 minutes. Trim overhang to 1/2 inch beyond lip of pie plate. Fold overhang under itself; edge should be flush with edge of pie plate. Using thumb and forefinger, flute edge of dough. Refrigerate dough-lined plate until firm, about 15 minutes.", 
            "Remove pan from refrigerator, line crust with foil and fill with pie weights or pennies. Bake on rimmed baking sheet 15 minutes. Remove foil and weights, rotate plate. Bake 5 to 10 more minutes until crust is golden brown and crisp. Remove plate and baking sheet from oven.", 
            "Make the filling: While pie shell is baking, whisk cream, milk, eggs, yolks and vanilla together in medium bowl. Combine pumpkin puree, yams, sugar, maple syrup, ginger, cinnamon, nutmeg and salt in large heavy-bottomed saucepan; bring to sputtering simmer over medium heat, 5 to 7 minutes. Continue to simmer pumpkin mixture, stirring constantly and mashing yams against sides of pot, until thick and shiny, 10 to 15 minutes.", 
            "Remove pan from heat. Whisk in cream mixture slowly, until fully incorporated. Strain mixture through fine-mesh strainer set over medium bowl, using back of ladle or spatula to press solids through strainer. Re-whisk mixture and transfer to warm pre-baked pie shell. Return pie plate with baking sheet to oven and bake pie for 10 minutes. Reduce heat to 300 degrees. Continue baking until edges are set (instant-read thermometer inserted in center registers 175 degrees), 20 to 35 minutes longer. Transfer pie to wire rack and cool to room temperature, 2 to 3 hours. (The pie finishes cooking with resident heat; to ensure the filling sets, cool it at room temperature and not in the refrigerator.)"
        ], 
        "date": "2008-11-07T21:11:29+00:00"
    }, 
    {
        "ingredient_list": [
            "For the chicken", 
            "1 1/2 pounds boneless, skinless chicken thighs (though, frankly, a little more or less will be fine here)", 
            "2 tablespoons lime juice (half a juicy lime)", 
            "1 1/2 teaspoons kosher salt", 
            "1 1/2 teaspoons dried oregano", 
            "2 teaspoons ground cumin", 
            "1 teaspoon chili powder", 
            "1/2 teaspoon smoked paprika", 
            "1 garlic clove, minced or pressed", 
            "Few dashes hot sauce, optional", 
            "To assemble", 
            "8 (6-inch) flour or corn tortillas", 
            "Olive oil", 
            "2 large bell peppers, cut into thin strips (I use a mix of green, red and other colors, if I can find them)", 
            "1 large yellow or sweet onion, halved and sliced thin", 
            "Coarse salt", 
            "Fixings (pick your favorites)", 
            "1 1/2 cup cooked black beans (1 15-ounce can, drained and rinsed)", 
            "Salsa or pico de gallo", 
            "Sliced avocado or guacamole", 
            "Shredded cheese or sour cream", 
            "Minced white onion or pickled red onions", 
            "Chopped cilantro, pickled jalalpenos, hot sauce and lime wedges"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/sizzling-chicken-fajitas1.jpg?w=640", 
        "tags": [
            "Chicken", 
            "Photo", 
            "Tex-Mex", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/03/sizzling-chicken-fajitas/", 
        "title": "sizzling chicken fajitas", 
        "directions": [
            "Slacker Pico de Gallo: Diced tomatoes + minced white onion + 1 minced jalapeno + squeeze of lime juice + splash of olive oil + salt + cilantro, if that’s your thing.", 
            "Pickled Red Onions: Mix 1/4 cup red wine vinegar + 1/4 cup cold water + 1 1/2 teaspoons granulated sugar + 1 tablespoon Diamond Kosher salt or generous 1/2 tablespoon Morton or another brand of kosher salt until sugar and salt have dissolved. Add thinly sliced red onion. Let marinate for 30 minutes (for very light pickling) or up to a week in the fridge. Put on everything."
        ], 
        "date": "2014-03-20T12:08:04+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds beef brisket", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "2 tablespoons vegetable oil", 
            "5 cloves garlic, peeled and smashed", 
            "1 Spanish onion, halved and thinly sliced", 
            "1 tablespoon chili powder", 
            "2 teaspoons ground coriander", 
            "2 teaspoons ground cumin", 
            "1/4 cup apple cider vinegar", 
            "1 1/2 cups water", 
            "1 (14 1/2-ounce) can whole peeled tomatoes, with their juices", 
            "1 to 2 whole canned chipotle chiles en adobo [Read: 1 or 2 from a can, not one or two cans, m’kay? Many misread this amount!] (I used one pepper; two will give it a real kick)", 
            "2 bay leaves", 
            "1/4 cup molasses"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/southwestern-pulled-brisket1.jpg?w=500", 
        "tags": [
            "Freezer Friendly", 
            "Meat", 
            "Photo", 
            "Slow Cooker", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2010/01/southwestern-pulled-brisket/", 
        "title": "southwestern pulled brisket", 
        "directions": [
            "Season the beef generously with salt and pepper, to taste. Heat a large, heavy skillet over medium-high heat. Add the oil and heat just until beginning to smoke. Add the meat and cook, turning once, until browned on both sides, about 10 minutes total. Transfer the meat to the slow cooker; leave the skillet on the heat.", 
            "Add garlic, onion, chili powder, coriander, and cumin to drippings in the skillet and stir until fragrant, about one minute. Add vinegar and boil until it’s almost gone (and seriously, get your head out of the way of the steam; inhaling vinegar is no fun!), scraping the bottom of the pan with a wooden spoon. Stir in water and pour the mixture over the brisket. Crush the tomatoes through your fingers into the slow cooker; add the tomato juices, chipotles, bay leaves, and molasses. Cover the cooker, set it on LOW, and cook the brisket until it pulls apart easily with a fork, about 8 to 10 hours. (The original recipe suggests 8 hours, but my mother-in-law, who makes wonderful brisket, says she cooks hers for 10. So I went with 10 and it was lovely, but feel free to check in on yours at 8 hours to determine if it needs more tenderizing.)", 
            "To serve, you’ve got two options: Leave the meat in the slow cooker and use two forks to pull it apart and stir it evenly into the sauce; season with salt and pepper, to taste. Remove and discard bay leaves. This is obviously the simplest route.", 
            "Your second option is to do as I did, just a little more work. I strained the sauce (to remove the cooked-until-dead vegetables and bay leaves), chilled it so the fat would be easy to remove, then reheated and reseasoned it well, simmering it down (to about 2/3 the volume) to thicken it a bit. We poured it back over the brisket as we pulled it, and then, when we got where we were going, reheated the whole pan on low.   (You could also thicken the sauce without skimming the excess fat — there was actually not as much as I’d anticipated.) ", 
            "Either way, I suspect you will be making this again sooner that you’d anticipated.", 
            "Don’t have a slow cooker? Fear not. Mr. Pearson kindly informed me that he has made this recipe in a Dutch oven in the oven at 350°F for 3 hours. I have not tested it this way but it sounds more than all right by me."
        ], 
        "date": "2010-01-02T00:23:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound spaghetti or linguine", 
            "Salt", 
            "3 lemons", 
            "1/4 cup extra virgin olive oil , plus additional for serving", 
            "1/4 cup heavy cream", 
            "1 ounce finely grated Parmesan cheese (about 1/2 cup), plus additional for serving", 
            "Ground black pepper", 
            "Small handful fresh basil or arugula (what I used, deliciously, in a pinch) leaves, shredded"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaghetti-with-lemon-and-olive-oil-al-limone1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Date Night", 
            "Italian", 
            "Lemon", 
            "Pasta", 
            "Photo", 
            "Travel", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/02/spaghetti-with-lemon-and-olive-oil-al-limone/", 
        "title": "spaghetti with lemon and olive oil", 
        "directions": [
            "Cook linguine or spaghetti in well-salted water to your al dente tastes in a large, wide-bottomed pot. (You’ll have fewer dishes to wash if you use this pot to assemble the dish as well.) ", 
            "While pasta is cooking, zest lemons until you have a little shy of a tablespoon of zest. Juice lemons — you’ll have anywhere from 1/3 to 1/2 cup lemon juice.  ", 
            "Drain pasta, reserving 1 1/2 cups of pasta cooking water. Dry out your pot, then boil the olive oil, cream, zest and 1 cup of the reserved pasta water together for two minutes over high heat.  Return pasta to pot and stir until coated. Add the cheese and 1/4 cup lemon juice and toss, toss, toss everything together. Add more pasta water, 1/4 cup at a time, if you’d like your dish a little looser. Quickly taste a strand of pasta and see if you want to add the remaining lemon juice (we did). Stir in basil or arugula and season generously with salt and pepper. ", 
            "Serve immediately, drizzling individual portions with a bit of extra olive oil and sprinkling with extra Parmesan cheese."
        ], 
        "date": "2011-02-24T12:00:55+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup black or green lentils", 
            "6 cups peeled, seeded and cubed butternut squash or sugar pumpkin (1-inch cubes) (from about a 2-poudn squash)", 
            "3 tablespoons olive oil, divided", 
            "1 teaspoon ground cumin", 
            "1 teaspoon hot smoked Spanish paprika*", 
            "1/2 teaspoon coarse salt", 
            "4 cups baby arugula (I skipped this)", 
            "1 cup soft crumbled goat cheese", 
            "1/4 cup thinly sliced mint leaves (optional; I used this, but added it after I took a photo)", 
            "1 tablespoon red wine vinegar, plus additional to taste", 
            "Roasted seeds (about 1/2 cup) from your butternut squash (optional; see note above)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/spicy-squash-salad-with-lentils-and-goat-cheese.jpg?w=751", 
        "tags": [
            "Beans", 
            "Fall", 
            "Photo", 
            "Salad", 
            "Thanksgiving", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2010/10/spicy-squash-salad-with-lentils-and-goat-cheese/", 
        "title": "spicy squash salad with lentils and goat cheese", 
        "directions": [
            "Preheat oven to 400°F. Toss squash or pumpkin cubes with 2 tablespoons oil, cumin, paprika and salt. Arrange in a single layer on baking sheet and roast 20 minutes. Flip pieces and roast for an additional 10 to 15 minutes, until tender. Cool.", 
            "Meanwhile, soak lentils for 10 minutes in a small bowl, then drain. Cook lentils in boiling salted water until tender but firm, about 30 minutes. Rinse with cold water, then drain and cool.", 
            "Combine lentils, pumpkin, any oil you can scrape from the baking sheet (I didn’t get enough for this to be worth it) with arugula, if using, half of goat cheese, mint, vinegar, and 1 tablespoon oil. Season with salt and pepper and extra vinegar, if desired (we felt it needed it). Divide among plates and pass with remaining goat cheese to sprinkle.", 
            "* I swapped half with sweet (not hot) smoked paprika to make sure it didn’t get too spicy for a 13 month-old’s tastes. If you don’t have either on hand, there are ways to approximate this smoky/spiciness with what you have in your pantry, such as mixing some regular paprika with a ground chipotle powder or another smoky spice, and then a pinch of cayenne for extra heat."
        ], 
        "date": "2010-10-27T12:47:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 2 1/2- to 3-pound kabocha or other yellow-fleshed squash (such as delicata, acorn or butternut, which I used)", 
            "1/2 to 3/4 cup olive oil", 
            "1/2 teaspoon dried chile flakes, more or less to taste", 
            "Coarse sea or kosher salt", 
            "1 yellow onion, peeled and thinly sliced", 
            "1/3 cup apple cider vinegar", 
            "1/4 cup maple syrup (though I’ll probably use 3 tablespoons next time)", 
            "4 slices country bread, 1-inch thick", 
            "1/2 cup (4 ounces) ricotta, goat cheese, feta or mascarpone", 
            "4 tablespoons chopped mint leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/squash-toasts-with-ricotta-and-cider-vinegar1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Fall", 
            "Photo", 
            "Thanksgiving", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2014/10/squash-toasts-with-ricotta-and-cider-vinegar/", 
        "title": "squash toasts with ricotta and cider vinegar", 
        "directions": [
            "Heat oven to 450. Line large baking sheet with parchment paper. No need to peel your squash (as shown above), just halved, seed and cut your squash into 1/4-inch thick slices. Toss with 3 tablespoons olive oil, 1 to 2 teaspoons salt (Vongerichten recommends 2 teaspoons; I used a bit less) and chile flakes until evenly coated. Transfer mixture to prepared sheet and roast until tender and slightly colored, anywhere from 15 to 30 minutes (depending on the density of the squash you use), flipping once about 2/3 of the way through. Once tender, you can cut the flesh from the skin and discard it. Leave roasted squash on the tray.", 
            "Meanwhile, heat 3 tablespoons olive oil in large skillet over medium-high heat. Add the onions and 1 teaspoon salt and cook, stirring frequently, until onions are softened and beginning to brown, about 10 to 15 minutes. Add vinegar and syrup and reduce heat to medium. Cook, stirring, until onions are jammy and broken down, another 10 to 15 minutes.", 
            "Pile onions on top of roasted squash, still on their baking sheet. Use a fork to gently half-mash the mixture; I like this best when the mixture is not uniformly combined. Taste and adjust seasonings if needed.", 
            "Heat a large skillet over medium-high heat. Add 1 tablespoon olive oil per slice of bread, and cook bread until just golden brown on both sides. Drain on paper towels. Spread cheese on toasts, heap with the squash-onion mixture, sprinkle with coarse salt and garnish with mint. ", 
            "Do ahead: Now that we’ve finished lunch, I can note with great confidence that these reheat wonderfully, even fully assembled, with none of the sog you’d expect from day-old stuff on bread. (It helps if you use a sturdy bread, of course.) Reheat on a baking sheet in a 300 degree oven for 15 minutes. "
        ], 
        "date": "2014-10-29T11:39:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup cornmeal", 
            "2 3/4 cups whole milk", 
            "4 tablespoons unsalted butter, plus additional for greasing dish", 
            "2 cups corn kernels (from 3 to 4 ears of corn, or frozen, if defrosted and well drained)", 
            "1 teaspoon sugar", 
            "1 teaspoon salt", 
            "1/8 teaspoon cayenne", 
            "3 large eggs, separated", 
            "1/4 teaspoon cream of tartar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/11/sweet-corn-spoonbread.jpg?w=750", 
        "tags": [
            "Corn", 
            "Gluten-Free", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2010/11/sweet-corn-spoonbread/", 
        "title": "sweet corn spoonbread", 
        "directions": [
            "Preheat oven to 400°F (see Note above if this seems too early). Very generously grease a 1 1/2 quart soufflé dish or an 8-inch square baking dish. Whisk cornmeal and 3/4 cup of milk in a small bowl until combined and set aside.", 
            "Melt butter in a Dutch oven or large, heavy pot over medium-high heat. Cook corn until beginning to brown, which can take as little as 3 minutes with fresh corn but with defrosted frozen corn, took me closer to 10 minutes. Stir in sugar, salt, cayenne and remaining 2 cups milk and bring to a boil. Remove from heat, cover, and let mixture steep for 15 minutes.", 
            "If you’ve got an immersion blender, please use it to save time. Otherwise, transfer mixture to a blender or food processor and puree until smooth. Back in the pot (or still, if it had never left) bring it back to a boil, reduce heat to low and add the cornmeal-milk mixture, whisking constantly until thickened, about 2 to 3 minutes. If you want to do fewer dishes and don’t mind if it takes longer to cool, you can leave it in the pot. Otherwise, transfer to a large bowl and return mixture to room temperature, about 20 minutes.", 
            "Once cool, whisk in egg yolks. Beat egg whites and cream of tartar in a medium bowl until stiff peaks form and fold it in to the corn mixture, one-third at a time. Pour batter into prepared baking dish and baked until spoonbread is golden brown and has risen above rim of dish, about 45 minutes. Serve immediately."
        ], 
        "date": "2010-11-24T10:46:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound sweet potatoes (red skinned are my favorite)", 
            "1/3 cup (79 ml) buttermilk", 
            "2 cups (250 grams) all-purpose flour", 
            "1 tablespoon (15 grams) baking powder", 
            "3 tablespoons (38 grams) granulated sugar", 
            "1 teaspoon ground (2 grams) cinnamon", 
            "1/4 teaspoon ground nutmeg", 
            "1/4 teaspoon ground ginger", 
            "1/8 teaspoon ground cloves", 
            "1/2 teaspoon (2 grams) table salt", 
            "5 tablespoons (71 grams) unsalted butter, cold", 
            "1 cup miniature marshmallows (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sweet-potato-and-marshmallow-biscuits1.jpg?w=500", 
        "tags": [
            "Fall", 
            "Photo", 
            "Potatoes", 
            "Scones/Biscuits", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2011/11/sweet-potato-and-marshmallow-biscuits/", 
        "title": "sweet potato (and marshmallow) biscuits", 
        "directions": [
            "The day before or a couple hours in advance: Preheat oven to 400°F. Place sweet potato on a tray and roast until soft, about 40 to 45 minutes. Let cool completely in skin (the fridge can speed this up) then peel. Either run potato flesh through a potato ricer or mash it until very smooth. You’re looking for 3/4 cup (191 grams) sweet potato puree (I get closer to 1 1/3 cups from 1 pound. Melt some salted butter over any remainder and sprinkle with chives — happy lunch!) ", 
            "You’ll probably have turned your oven off by now, so preheat it again to 400°F. Line a baking sheet with parchment paper and set aside. Whisk 3/4 cup reserved sweet potato puree with buttermilk until smoothly combined. Keep nearby.", 
            "In the bottom of a large, wide-ish bowl, whisk flours, baking powder, sugar, spices and salt together. If you have a  pastry blender, add the butter (if you have a sturdy pastry blender, no need to chop it first) and use the blender to cut the butter into the flour mixture until the biggest pieces are the size of small peas. If you don’t have a pastry blender, cut the butter into small pieces with a knife and work the butter into the flour mixture with your fingertips until the mixture resembles a coarse meal. ", 
            "For both methods, continue by adding the sweet potato mixture and stir and break it up until the mixture is in big, soft chunks. Get your hands in the bowl and gently knead the dough into an even mass, using as few motions as possible (and thus, warming the dough as little as possible.). ", 
            "With marshmallows: Roll or pat dough out on a floured counter to a 1/2-inch thickness and divide evenly in half. Sprinkle marshmallows loosely over half of dough. Place the second half on top of marshmallow and use rolling pin to gently press the sides together, keeping the final dough thickness at a full inch. ", 
            "Without marshmallows: Roll or pat dough out on a floured counter to a 1-inch thickness. ", 
            "Both methods: Dip a 2-inch biscuit cutter in flour then form biscuits by cutting straight down and not twisting — this will help give your biscuits the maximum rise. Bake biscuits on prepared sheet for 13 to 15 minutes, until puffed and slightly golden on top. Cool on rack and enjoy as soon as possible.", 
            "Do ahead: Biscuits are best on the first day that they’re baked. To make them ahead of time, arrange cut biscuits on a tray to freeze them. Once frozen, transfer them to a freezer bag until needed. Bake at same temperature straight from freezer; biscuits will take about 2 minutes longer to bake."
        ], 
        "date": "2011-11-22T17:15:25+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds sweet potatoes (about 2 medium potatoes), peeled and chopped into a 1/2-inch dice", 
            "4 tablespoons unsalted butter, melted", 
            "2 tablespoons fresh lemon juice (optional)", 
            "1/2 teaspoon freshly grated nutmeg", 
            "1/2 teaspoon ground cinnamon", 
            "1/2 teaspoon kosher salt", 
            "3 large eggs, separated", 
            "1/2 cup sugar", 
            "2 tablespoons all-purpose flour", 
            "3/4 cup full- or lowfat buttermilk (or, you can make your own)", 
            "1 All-Butter, Really Flaky Pie Crust (a half recipe will yield a single crust), prebaked (instructions below)", 
            "Whipped cream, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/sweet-potato-pie.jpg?w=753", 
        "tags": [
            "Fall", 
            "Photo", 
            "Potatoes", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2009/11/sweet-potato-buttermilk-pie/", 
        "title": "sweet potato buttermilk pie", 
        "directions": [
            "Preheat the oven to 375°F.", 
            "Pour 1 1/2 inches of water into a 3-quart stock part with a strainer basket suspended over it and bring to a boil over medium-high heat. Add the sweet potatoes, cover and steam until fork-tender, about 20 minutes. Place the steamed sweet potatoes in a large bowl and let cool to room temperature. Mash them into a smooth puree with a fork or potato masher (though I suspect that a potato ricer would also do a great job). You should have 1 1/4 cups puree; discard any excess (by topping with a pat of butter, sprinkling with salt and making yourself a most-excellent snack). Add the butter, lemon juice if using, nutmeg, cinnamon and salt and mix thoroughly with a wooden spoon or rubber spatula after each addition.", 
            "In a small bowl, beat the egg yolks lightly with a whisk, about 30 seconds. Add the sugar and beat until they’re a creamy lemon-yellow color, about 1 1/2 minutes. Add the egg mixture to the sweet potato mixture and stir until the eggs are thoroughly incorporated and the filling is a consistent bright orange color. Add the flour a little at a time, stirring after each addition until thoroughly incorporated. Add the buttermilk and again stir until smooth and even.", 
            "With a cleaned whisk (or electric hand mixer), whisk the egg whites to soft peaks in a clean, dry bowl. With a wooden spoon or rubber spatula, gently fold the egg whites into the sweet potato-buttermilk mixture until thoroughly combined. Pour the mixture into the prebaked crust and bake on the middle rack of the oven until the center is firm and set, 35 to 40 minutes.", 
            "Remove the pie from the oven and cool completely on a rack. Serve at room temperature (or cold from the fridge; you can cover it with plastic wrap before chilling) with a dollop of whipped cream.", 
            "To pre-bake your pie crust, choose a method: “Proper” method — Lay a sheet of aluminum foil over the dough and carefully scatter pie weights, dried beans or pennies over it. Bake on the middle rick of your oven at 325°F for 12 to 15 minutes. Remove the pie weights and the foil, prick the bottom of the crust with a fork, and bake for 10 minutes more.", 
            "Deb’s “Cheater” method — Freeze your rolled-out pie shell for 20 to 30 minutes until solid. Press a piece of buttered foil, buttered side down, very frozen shell and blind bake it at 325°F for 20 minutes, then carefully pull back the foil, press any part of the crust that has bubbled up gently back with the back of a spoon, prick the bottom of the crust with a fork, and bake for 10 minutes more."
        ], 
        "date": "2009-11-17T11:37:41+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "1 1/2 pounds sweet potatoes (about 2 to 3 medium or 2 large)", 
            "2 cups (250 grams) all-purpose flour", 
            "1 3/4 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon table salt", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon (more to taste) ground ginger", 
            "Two pinches (more to taste) ground cloves", 
            "1/2 cup (1 stick or 115 grams) unsalted butter, at room temperature", 
            "1 cup (190 grams) packed light brown sugar", 
            "1/2 teaspoon vanilla extract", 
            "2 large eggs", 
            "Frosting", 
            "3 large egg whites", 
            "3/4 cup granulated sugar", 
            "Pinch of salt", 
            "1/4 teaspoon cream of tartar (will help stabilize egg whites, don’t worry if you don’t have it)", 
            "1/2 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/sweet-potato-cake-with-toasted-marshmallow-frosting1.jpg?w=640", 
        "tags": [
            "Celebration Cakes", 
            "Everyday Cakes", 
            "Fall", 
            "Photo", 
            "Potatoes", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2013/11/sweet-potato-cake-with-marshmallow-frosting/", 
        "title": "sweet potato cake with marshmallow frosting", 
        "directions": [
            "Roast sweet potatoes: Heat oven to 375 degrees. Prick potatoes all over with a fork. Rest on a baking sheet. Roast for 45 minutes to 1 hour, turning once or twice, until soft. Let cool completely. Can be kept in fridge for up to 3 days, if baked in advance.", 
            "Make cake: Heat oven to 350 degrees F. Line the bottom of an 8- to 9-inch square pan with parchment paper, then butter the paper and sides of the pan. [If you trust your nonstick pan, you might be able to skip the parchment, but I don’t like to live on the edge when it comes to getting cakes out of a pan.]", 
            "Peel cooled sweet potatoes and run flesh through a potato ricer, or mash until very smooth. (Do not blend in a blender or food processor.) Measure 1 1/2 packed cups (about 12 to 13 ounces) from sweet potato mash; you may have a little extra, which you should warm up with a pat of butter and sprinkle of sea salt and not share with anyone.", 
            "Whisk flour, baking powder, baking soda, salt and spices together in a medium bowl. In a large bowl, beat butter and brown sugar together with an electric mixer until light and fluffy, about 2 to 3 minutes. Add vanilla and eggs, and beat until just combined. Mix in sweet potato puree, then stir in dry ingredients just until they disappear. ", 
            "Spread batter in prepared pan, and bake cake until a toothpick inserted into the center comes out clean, about 35 to 40 minutes. Let cake rest in pan for 5 minutes on a cooling rack, then invert onto cooling rack, and let cool completely. You can speed this up, as I always do, in the fridge.", 
            "Make frosting: Place egg whites, granulated sugar, a pinch of salt and cream of tartar in a heatproof bowl set over a saucepan of gently simmering water. Whisk mixture for 3 minutes, until whites are warmed and sugar granules feels mostly dissolved. Remove bowl from top of saucepan, then, with an electric mixer, beat egg white mixture on high speed until stiff, glossy peaks form, about 4 to 7 minutes longer. Add vanilla and mix until combined.", 
            "Frost and decorate: If you’d like to make huge, marshmallow-like dollops, spread a bit of frosting thinly over cooled sweet potato cake. Then, using a very large round piping tip (I have an almost comically large one with a 1/2-inch opening) or the corner snipped off a freezer bag, pipe large dollops of frosting all over thin frosting layer. If you’d like to skip the dollops, you can just spread the frosting, thick and swirly, all over.", 
            "Using a kitchen torch, lightly brown the dollops so that they look (and smell!) like toasted marshmallows. ", 
            "Serve: At room temperature cut into squares. Cake keeps at room temperature for two days; any longer, I like to keep it in the fridge."
        ], 
        "date": "2013-11-26T12:51:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds sweet potato, scrubbed, unpeeled, in 3/4- to 1-inch coins", 
            "4 tablespoons olive oil, divided", 
            "1/4 cup toasted and cooled pecan halves", 
            "2 tiny or 1 small shallot", 
            "2 stalks celery", 
            "2 tablespoons flat-leaf parsley", 
            "1 tablespoon dried cranberries or cherries (optional)", 
            "2 ounces firmish goat cheese", 
            "Salt and freshly ground black pepper", 
            "2 teaspoons red wine vinegar", 
            "1/2 teaspoon smooth Dijon mustard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/11/sweet-potatoes-with-pecans-and-goat-cheese.jpg?w=749", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/11/sweet-potatoes-with-pecans-and-goat-cheese/", 
        "title": "sweet potatoes with pecans and goat cheese", 
        "directions": [
            "Preheat oven to 450 degrees. Coat a large baking sheet generously with olive oil, about 1 to 2 tablespoons. Lay sweet potatoes in one layer on the oiled sheet. Sprinkle with salt and freshly ground black pepper. Roast, without disturbing, for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release from the pan with no effort. If they’re not, let it cook longer. Sprinkle them with additional salt and freshly ground black pepper and return the pan to the oven for another 10 minutes or so, until the undersides match the tops.", 
            "Meanwhile, prepare your salad. Chop your pecans well, mince your shallot, chop your celery and parsley, mince cranberries if using them. Crumble your goat cheese. If you, like me, got too soft of a goat cheese for mixing, set it aside and sprinkle it on top. If it’s firmer, stir it into the mixture. In a small dish, whisk together 2 tablespoons olive oil, 2 teaspoons red wine vinegar and 1/2 teaspoon dijon. Pour half over salad.", 
            "When the sweet potatoes are done, set a couple coins aside just in case the baby isn’t into the toppings. Lay the rest on a serving platter. Scoop a spoonful of the salsa over each round. Pour remaining salad dressing over top, to taste. Eat immediately."
        ], 
        "date": "2010-11-15T16:43:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (1/2 stick or 2 ounces) butter", 
            "1 small onion, finely chopped", 
            "3 pounds Swiss chard, leaves and stems separated and both cut into 1-inch pieces", 
            "Pinch of freshly grated nutmeg", 
            "2 cups heavy cream or whole milk", 
            "2 garlic cloves, minced", 
            "2 tablespoons flour", 
            "2 pounds medium red-skinned sweet potatoes (yams), peeled and cut into 1/8-inch thick rounds", 
            "1 tablespoon minced fresh Italian parsley", 
            "1 tablespoon minced fresh thyme", 
            "Fine sea salt", 
            "Freshly ground black pepper", 
            "1 1/4 cups (about 5 ounces) coarsely grated Gruyére cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/swiss-chard-and-sweet-potato-gratin.jpg?w=753", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Freezer Friendly", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Swiss Chard", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/11/swiss-chard-and-sweet-potato-gratin/", 
        "title": "swiss chard and sweet potato gratin", 
        "directions": [
            "Prep greens: Cook onion in 2 tablespoons butter in a wide 8-quart heavy pot over moderately low heat, stirring, until softened. Add chard stems, pinch of nutmeg, and salt and pepper to taste and cook, stirring, until vegetables are tender but not browned, about 8 minutes. Increase heat to moderately high and add chard leaves by large handfuls, stirring, until all greens are wilted. Season with salt and pepper then transfer greens to a colander to drain well and press out liquid with back of a large spoon.", 
            "Make sauce: Combine cream or milk and garlic in small saucepan; bring to simmer; keep warm. Melt two tablespoons butter in a medium heavy saucepan over moderate heat and stir in flour. Cook roux, whisking, one minute, then slowly whisk in warm cream/milk and boil, whisking, one minute. Season sauce with salt and pepper.", 
            "Assemble gratin: Preheat oven to 400°F. Butter deep 9×13 baking dish. Spread half of sweet potatoes in the prepared baking dish. Sprinkle with salt, pepper, a quarter of the herbs and a 1/4 cup of the cheese. Distribute half of the greens mixture over the cheese, then sprinkle salt, pepper, a quarter of the herbs and 1/4 cup of the cheese over it. Pour half of bechamel sauce over the first two layers then continue with the remaining sweet potatoes, more salt, pepper, herbs and cheese and then the remaining greens, salt, pepper and herbs. Pour the remaining sauce over the top of the gratin, pressing the vegetables slightly to ensure that they are as submerged as possible. Sprinkle with the last 1/4 cup of cheese.", 
            "Bake gratin for about 1 hour until golden and bubbly, and most of the liquid is absorbed. Let stand 10 minutes before serving. ", 
            "Do ahead: You can make the entire gratin but not bake it up to a day in advance and keep it in the fridge. You can also make and bake the gratin and reheat it. Gratins reheat well, but they take almost as much time to gently heat through as they do to bake in the first place, especially deep ones like this. As for reheating, already baked and frozen, I will find out very soon! But I am near-positive it will be fine."
        ], 
        "date": "2009-11-12T17:08:23+00:00"
    }, 
    {
        "ingredient_list": [
            "2 15-ounce cans black beans, drained and well-rinsed", 
            "4 bell peppers, a mix of colors, chopped into a small dice", 
            "1/2 super-large or 1 medium white onion, chopped into a small dice", 
            "Juice of one lime", 
            "3 tablespoons olive oil", 
            "1 teaspoon ground cumin", 
            "3/4 teaspoon salt", 
            "1 fresh chile, very thinly sliced or finely chopped or hot sauce, to taste", 
            "Optional: If you’re the kind of person who loves cilantro, it’s a great match for this salad. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/black-bean-confetti-salad1.jpg?w=640", 
        "tags": [
            "Beans", 
            "Gluten-Free", 
            "Peppers", 
            "Photo", 
            "Salad", 
            "Tex-Mex", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/04/tabula-beana/", 
        "title": "black bean confetti salad", 
        "directions": [
            "Mix beans, bell peppers and white onion in a large bowl. In a separate, smaller bowl, whisk remaining ingredients into a vinaigrette. Ideally, you’ll have a 1/2 cup of dressing. Pour it over the bean mixture, toss it well and adjust seasonings to taste.  "
        ], 
        "date": "2007-04-23T00:22:59+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/taco-torte1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Beans", 
            "Photo", 
            "Tex-Mex", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/02/taco-torte/", 
        "title": "taco torte", 
        "directions": [
            "Heat the oven to 400°F. Line a 9-inch round cake pan or cast-iron skillet tightly with foil and spray it with a nonstick spray. Or, you can coat a 9-inch springform with nonstick spray and skip the foil, since it’s easier to remove from a springform.", 
            "Heat the oil in a large skillet over medium heat. Add the onion, garlic, fresh chile pepper (if using), cumin, chili powder, and and cook until you can smell the spices and the onion is softened, about 3 minutes. Stir in the tomatoes with the 1/3 cup of reserved juice and the tomato paste, then stir in the beans. Season with salt and pepper to taste. Let the bean mixture simmer until everything is hot, about 3 minutes. Add the corn and spinach and stir until the spinach has wilted and everything is well blended and hot, about 3 minutes. Taste for seasoning, adding more salt and/or pepper as necessary.", 
            "Place 1 tortilla in the prepared cake pan. Spread one-sixth (just eyeball it) of the bean and vegetable mixture evenly over the tortilla, then sprinkle 1/4 to 1/3 cup of the shredded cheese evenly over the top. Repeat with 5 more layers, ending with the last of the bean mixture and shredded cheese.", 
            "Bake the tortilla stack until it is hot throughout and the top is lightly browned, about 20 minutes. You can run it under the broiler for extra color on top, if you wish. Let the it sit at room temperature for 5 minutes, before removing it from the pan, either by carefully lifting the foil that lines the pan or by opening the sprinform sides. Cut it into wedges using a sharp knife and serve it with a spatula or better yet a pie server. Sprinkle the top with cilantro, if desired, and serve with sour cream and/or salsa on the side, if you like.", 
            "Do ahead: You can make this ahead of time, cover it in the fridge overnight then leave it at room temperature for 20 to 30 minutes before baking it. The torte also reheats well."
        ], 
        "date": "2016-02-01T12:03:10+00:00"
    }, 
    {
        "ingredient_list": [
            "5 garlic cloves, coarsely chopped", 
            "1/4 cup chopped cilantro (or flat-leaf parsley if you are cilantro-averse)", 
            "1/4 cup Asian fish sauce*", 
            "1/4 cup vegetable oil", 
            "2 tablespoons hoisin sauce (I accidentally doubled this and can only advise you do the same)", 
            "1 1/2 teaspoons ground coriander", 
            "1 teaspoon kosher salt", 
            "1 teaspoon freshly ground black or white pepper", 
            "8 whole chicken legs, split, or 8 drumsticks and 8 thighs (about 5 pounds total)", 
            "Thai sweet chili sauce, for serving "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/thai-style-chicken-legs1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Grilling", 
            "Photo", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2010/07/thai-style-chicken-legs/", 
        "title": "thai-style chicken legs", 
        "directions": [
            "Combine the garlic, cilantro, fish sauce, vegetable oil, hoisin sauce, coriander, kosher salt and pepper in a blender until smooth. Arrange the pieces of chicken in a large, shallow glass or ceramic dish. Pour the marinade over the chicken and turn to coat the pieces thoroughly. Cover and refrigerate for several hours, or overnight.", 
            "To roast the chicken: Preheat oven to 450 degrees. Cover baking dish with a lid or foil and roast chicken for about 25 minutes. If the sauce begins to char, sprinkle a few tablespoons water into the dish. Remove the lid or foil and bake for an additional 5 to 10 minutes, until the skin is crisp and the meat is cooked through.**", 
            "To grill the chicken: [Lacking a grill, I did not test this method but I will be happy to if you invite me over tonight, okay?] Light a grill. If using a gas grill, turn off the center burners; if using a charcoal grill, once the coals are covered with a light ash, push them to opposite sides, forming a well in the middle. Set a disposable drip pan in the center. Cook chicken on the hot grate above, skin side down, with the cover down for about 40 minutes. The skin should be crisp and the meat should be cooked through.**", 
            "Both methods: Once cooked, transfer to plates and serve with Thai chili sauce.", 
            "Do ahead: The marinade can be refrigerated overnight. I like it so much, I am tempted to make a larger batch of it to keep in the freezer until needed.", 
            "* Don’t like fish sauce? Don’t want to eat it? Neither did I before about five minutes ago. Anyway, I often see low-sodium soy sauce suggested as an alternative but I’m not convinced it’s a fair swap. There’s something more caramelized and fermented in the fish sauce that you’d miss. If you feel like playing around, I might whisk some additional hoisin or even miso into that soy sauce for a more complex flavor.", 
            "** To ensure your chicken is “cooked through”: Lacking x-ray vision and decades of chicken-cooking practice, I’m a big fan of using a thermometer to ensure that my meat is properly cooked. A thermometer inserted into the thigh/leg joint should register 180 to 185 degrees if you’re following Proper Chicken Cooking Protocol, or 170 to 175 degrees, if you’re me, and have very specific chicken-cooking preferences despite what food safety experts advise. I like to live on the edge, obviously. Another classic, though less precise way, to see if chicken is cooked through is to pierce it with a knife. If the juices that run out are clear, your chicken should be just right."
        ], 
        "date": "2010-07-12T11:30:28+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds fresh spinach", 
            "3 1/2 to 4 1/2 tablespoons unsalted butter", 
            "Salt and pepper", 
            "1 1/2 tablespoons flour", 
            "1 cup stock (your choice; Julia recommends beef) or cream (I used stock; it doesn’t *need* cream)", 
            "3/4 cup grated Swiss cheese", 
            "2 tablespoons fine, dry breadcrumbs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/03/best-baked-spinach.jpg?w=751", 
        "tags": [
            "French", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Spinach", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/03/the-best-baked-spinach/", 
        "title": "the best baked spinach", 
        "directions": [
            "Stem and wash your spinach (see Tips below) well but no need to spin or pat it dry. Place spinach in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 2 to 4 minutes for baby spinach and 4 to 6 minutes for regular spinach. Transfer to a colander, immediately fill pot with cold water, transfer it back to the pot of cold water to shock it (stop the cooking) and drain again. Squeeze a small amount of the spinach at a time in your hands to extract as much water as possible. Chop the spinach coarsely. You should have about 3 cups of chopped spinach, or about 1 cup per pound.", 
            "Wipe out pot then melt 2 tablespoons butter over moderately high heat and stir in the spinach. Cook for 2 to 3 minutes or until all of the moisture from the spinach has boiled off — you’ll know you’re done when the spinach begins to stick to the pan.", 
            "Lower the heat and sprinkle with flour and stir for 2 minutes to cook the flour. Add 2/3 of your stock or cream, a tiny bit at a time, scraping up any stuck spinach as you do. Once the liquid is added, simmer for another minute or two, stirring frequently to prevent sticking. If you’re feeling especially indulgent, stir in one more tablespoon of butter. If needed, add all or part of remaining liquid. Season with salt (I found 1/2 teaspoon table salt about right) and pepper.  ", 
            "Preheat oven to 375 degrees. Lightly butter a shallow 1-quart baking dish. Stir 1/2 cup cheese into the spinach and pour it into the baking dish. Mix the remaining cheese with breadcrumbs and sprinkle on spinach. Melt 1 1/2 tablespoons remaining butter and pour it over the top. Bake until heated through and slightly brown on the top, about 30 minutes.", 
            "Serve with steaks, chops, veal, chicken, broiled fish or, if you’re us, eggs, glorious eggs.", 
            "Do ahead: Spinach can be blanched and chopped several hours or a day in advance. Cover and refrigerate until needed. Gratin can be fully assembled and 30 minutes before needed, placed in a preheated 375 degree oven to bake, then served.", 
            "To stem spinach, as per Julia: If spinach is young and tender, remove the stems at the base of the leaf. If more mature, fold the leaf vertically with its underside up, grasp the leaf in one hand and the stem in the other and and rip it off toward the tip of the leaf, removing the stem and the tough tendrils. Discard any wilted or yellow leaves.", 
            "How I wash greens: Fill a large bowl or basin with cold water. Drop in the spinach and swish it around a few times so it deposits any sand and grit before lifting it out of the bowl (leaving any grit/dirt at the bottom of the bowl and not dragging the clean leaves through it) and drop it in a colander. No need to dry it for this recipe, but in others, I either spread it out on towels or run it through a salad spinner."
        ], 
        "date": "2011-03-08T19:45:59+00:00"
    }, 
    {
        "ingredient_list": [
            "Soup", 
            "1/4 cup (1/2 stick) butter", 
            "1 large onion, finely chopped", 
            "4 large garlic cloves, chopped", 
            "3 14 1/2-ounce cans low-salt chicken broth", 
            "4 cups 1-inch pieces peeled butternut squash (about 1 1/2 pounds)*", 
            "4 cups 1-inch pieces peeled acorn squash (about 1 1/2 pounds)*", 
            "1 1/4 teaspoons minced fresh thyme", 
            "1 1/4 teaspoons minced fresh sage", 
            "1 1/2 teaspoons ground cumin", 
            "1/2 teaspoon ground ginger", 
            "1/8 cup whipping cream", 
            "Croutons", 
            "2 tablespoons (1/4 stick) butter", 
            "24 1/4-inch-thick baguette bread slices", 
            "1 cup grated Gruyere cheese", 
            "1 teaspoon minced fresh thyme", 
            "1 teaspoon minced fresh sage ", 
            "1 deep pie dish, or frankly, any old dish you feel like baking in", 
            "1/4 peck of your favorite apples to bake with, or whatever the lady is selling that day", 
            "1 tablespoon flour", 
            "1-2 tablespoons sugar, or to taste", 
            "1 teaspoon cinnamon", 
            "1/2 teaspoon nutmeg", 
            "A pinch of allspice", 
            "5-6 tablespoons unsalted or salted butter, your choice, melted", 
            "1/3 cup brown sugar", 
            "1 teaspoon cinnamon", 
            "1/3 cup dried oatmeal", 
            "Up to 1 cup all-purpose flour "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/10/winter-squash-soup-with-gruyere-croutons.jpg?w=750", 
        "tags": [
            "Fall", 
            "Photo", 
            "Soup", 
            "Thanksgiving", 
            "Travel", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2006/10/the-leaf-peeps/", 
        "title": "winter squash soup with gruyere croutons", 
        "directions": [
            "Mix the brown sugar, cinnamon and oatmeal into the melted butter. Now, here’s where all of your personal choice comes in. You could: ", 
            "Add flour a couple tablespoons at a time until the mixture forms a dry crumble. I find the more I add, as long as I don’t add so much that there is flour that can’t adhere at all, the better it comes out. Taste a clump, and adjust the sugar and spice to taste. ", 
            "Sprinkle this over your apples and bake at 400 degrees for about 45 minutes, or until the top is golden and the apples underneath are bubbling in their thickened juices. If the top browns before this happens, cover it with foil until the apples are done. ", 
            "Serve alone or with ice cream, whipped cream, creme fraiche, plain or vanilla yogurt or dusted with powdered sugar. "
        ], 
        "date": "2006-10-16T16:53:55+00:00"
    }, 
    {
        "ingredient_list": [
            "2 3/4 cup pastry flour (all-purpose is also fine)", 
            "1/4 cup sugar", 
            "1 tablespoon aluminum-free baking powder*", 
            "1 teaspoon baking soda", 
            "6 ounces of butter, in 1/2-inch cubes", 
            "1 cup golden raisins plus 1 tablespoon caraway seeds -or- 1 cup fresh fruit of your choice, chopped (I used raspberries)", 
            "3/4 to 1 cup buttermilk (use the smaller amount if using fresh fruit, the larger if using the raisin-caraway combo)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-north-fork-and-its-scones1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Photo", 
            "Scones/Biscuits", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/09/the-north-fork-and-its-scones/", 
        "title": "the north fork and its scones", 
        "directions": [
            "Turbinado or sanding sugar for sprinkling (optional, not in the original recipe)", 
            "Preheat oven to 375°.", 
            "Place cubed butter in freezer for 15 minutes. Meanwhile, measure other ingredients (except buttermilk and fruit) and mix in the bowl of a food processor.", 
            "Add butter to processor bowl and mix until the butter and flour mixture are the texture of coarse cornmeal. Transfer the mixture to the bowl of a mixer and add buttermilk and fruit, mixing on the lowest speed until the dough just comes together.", 
            "Turn out onto a lightly floured surface and knead gently a couple times. Roll dough out to approximately one-inch thickness (I skipped the rolling pin and just patted it out with floured hands) and cut into squares. Cut those squares again on the diagonal, creating triangles. Sprinkle with coarse sugar, if you’re using it.", 
            "Bake on an ungreased baking sheet (mine stuck ever-so-slightly, so I might line it with parchment next time, though no biggie if you don’t) for 25 to 30 minutes, until lightly browned.", 
            "* If you use fresh fruit in a scone, it’s very important that you use an aluminum-free baking powder, or your scones will turn out as blue as mine did — not a pretty sight! Frankly, aluminum-free baking powder is always best to use, especially if you’ve noticed a tinny taste in your biscuits, muffins scones; it is avoidable. "
        ], 
        "date": "2008-09-09T14:40:02+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds boneless chicken thighs", 
            "1 large white onion, peeled and quartered", 
            "5 cloves garlic, peeled and lightly crushed", 
            "2 bay leaves", 
            "1 tablespoon ground cumin", 
            "1 ancho or other mild dried chili, optional", 
            "Salt and pepper to taste.", 
            "2 large fresh ripe tomatoes, chopped", 
            "1/2 large white onion, peeled and minced", 
            "1/4 teaspoon minced raw garlic, or to taste", 
            "1 habanero or jalapeño pepper, stemmed, seeded and minced, or to taste", 
            "1/4 cup chopped cilantro leaves", 
            "1 tablespoon fresh lime juice or 1 teaspoon red-wine vinegar", 
            "Salt and freshly ground pepper."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-taco-joint-on-my-shirt1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Photo", 
            "Tex-Mex", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2006/08/the-taco-joint-on-my-shirt/", 
        "title": "chicken tacos + salsa fresca", 
        "directions": [], 
        "date": "2006-08-01T09:11:50+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            "1 medium onion, chopped small", 
            "1 to 2 peppers of your choice (see Notes, below), finely chopped", 
            "3 cloves garlic, minced", 
            "2 tablespoons chili powder", 
            "2 teaspoons ground cumin", 
            "1 teaspoon dried oregano", 
            "1 1/2 teaspoons table salt or 2 1/2 teaspoons kosher or coarse salt", 
            "1 12-ounce bottle beer", 
            "1 28-ounce can crushed tomatoes, fire-roasted if you can find them", 
            "1 1/2 cups mixed dried beans (see Note)", 
            "3 1/2 to 4 cups water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/three-bean-chili.jpg?w=750", 
        "tags": [
            "Beans", 
            "Photo", 
            "Slow Cooker", 
            "Stew", 
            "Tex-Mex", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/04/three-bean-chili/", 
        "title": "three-bean chili", 
        "directions": [
            "To serve: Lime wedges, sour cream, diced white onion, cilantro, corn or flour tortillas or tortilla chips or rice", 
            "Heat oil in the bottom of a medium-sized heavy pot or Dutch oven (if finishing it on the stove), in the pot of your pressure-cooker (if using one) or in a large skillet (if finishing in a slow-cooker). Once warm, add onion and cook for 5 minutes, until translucent. Add any fresh peppers and cook for 3 more minutes. Add garlic, chili powder, cumin, oregano and salt and cook for 2 minutes, until browned and deeply fragrant. Add beer and scrape up any bits stuck to the pot. Boil until reduced by half, or, if you’re nervous about alcohol content, until it has all but disappeared. ", 
            "If finishing on the stove: Add tomatoes, dried beans, any dried or rehydrated-and-pureed chiles and the smaller amount of water. Bring mixture to a full boil and boil for one minute, then reduce heat to a very low, gentle simmer, place a lid on your pot, and cook for 2 1/2 to 3 hours, until the beans are tender, stirring occasionally. Add the last 1/2 cup water if mixture seems to be getting dry, though I didn’t need it in most of my tested batches. If a slightly more sloshy chili wouldn’t bother you, you can add it from the get-go.", 
            "If finishing in a slow-cooker: Scrape onion, spice and beer mixture into a slow-cooker and add tomatoes, dried beans, any dried or rehydrated-and-pureed chiles and the smaller amount of water. Cook on HIGH for 6 to 7 hours, until beans are tender. You can add the last 1/2 cup water if needed, but probably will not find it necessary.", 
            "If finishing in a pressure-cooker: Follow the directions from your pressure cooker manufacturer. I failed to get this fully tested in my new one (boo) but estimate that it will take 20 to 22 minutes on high. ", 
            "Serve as-is or with fixings of your choice.", 
            "Notes:"
        ], 
        "date": "2014-04-02T12:13:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound plum or roma tomatoes, stemmed and cut in half", 
            "1 or 2 jalapeños (depending on how hot you want the salsa), stemmed and cut in half", 
            "2 cloves garlic, peeled", 
            "Salt and pepper, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/three-ingredient-summertime-salsa1.jpg?w=640", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Quick", 
            "Summer", 
            "Tex-Mex", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/07/three-ingredient-summertime-salsa/", 
        "title": "three-ingredient summertime salsa", 
        "directions": [
            "Turn on your broiler and place a rack five inches away from the heating element. Line a skillet or baking sheet with foil and place the tomatoes, jalapeño halves and garlic on the skillet; season with salt. Cook under the broiler for five minutes (this, and all broiling steps, took much longer in my weak oven), or until the jalapeño and garlic have brown spots. Remove the jalapeño and garlic from the skillet and place in a blender.", 
            "Meanwhile, return the skillet to the oven and continue to broil the tomatoes for five more minutes, or until they have browned on top. Remove the tomatoes from the oven and add them to the blender, also pouring into the blender any juices that may be in the skillet. Begin to pulse on a low speed until the salsa reaches your desired texture; I usually add about 2 tablespoons water to loosen mine — you may need up to 1/4 cup, or more, for a thinner salsa. Adjust salt and pepper to taste. Eat with everything."
        ], 
        "date": "2014-07-29T11:21:58+00:00"
    }, 
    {
        "ingredient_list": [
            "Crushed croutons", 
            "4 slices hearty white bread", 
            "1 small shallot, minced (about 2 tablespoons)", 
            "1 garlic clove, minced or pressed through garlic press", 
            "1/4 teaspoon table salt", 
            "Freshly ground black pepper", 
            "2 tablespoons olive oil", 
            "2 tablespoons grated Parmesan cheese", 
            "Tomato salad", 
            "1 pound cherry or grape tomatoes, mixed colors if you can find them", 
            "2 teaspoons olive oil", 
            "1 tablespoon mellow red wine vinegar (yours isn’t mellow? use less)", 
            "1/8 teaspoon table salt", 
            "Pinch of sugar", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/08/6046162939_322f528323_b.jpg?w=750", 
        "tags": [
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2011/08/tomato-salad-with-crushed-croutons/", 
        "title": "tomato salad with crushed croutons", 
        "directions": [
            "Handful basil leaves, slivered. ", 
            "Prepare the crushed croutons: Preheat oven to 350 degrees. Tear bread into chunks and pule them in a food processor until coarsely ground (largest chunks can be lima bean sized). No food processor? Keep tearing the bread up until it is in ragged, mixed sized crumbs. Spread crumbs on a rimmed baking sheet and toss with shallots, garlic, salt, pepper, olive oil and parmesan until croutons are evenly coated with oil. Bake until golden brown and dry, about 15 to 20 minutes, stirring occasionally. Remove from oven and set aside to cool slightly. (Warm is fine, hot might wilt your tomatoes, boo.)", 
            "Assemble salad: Halve each tomato lengthwise and arrange cut side up on a platter. Whisk together vinegar, olive oil, salt, sugar and a few grinds of pepper in a small dish. Drizzle over tomatoes. Sprinkle tomatoes with crushed croutons. Garnish with slivers of basil."
        ], 
        "date": "2011-08-15T14:43:34+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/tres-leches-cake1.jpg?w=750", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Everyday Cakes", 
            "Photo", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2015/12/tres-leches-cake-a-taco-party/", 
        "title": "tres leches cake + a taco party", 
        "directions": [
            "Heat oven to 350 degrees F. Butter and flour a 9×13 baking pan, or coat it with a nonstick cooking spray.", 
            "In a small bowl, whisk together flour, cornstarch (together, these make “cake flour” without you having to buy it), salt and baking powder. If using a fresh vanilla bean, rub seeds into 1 1/4 cups granulated sugar to disperse them and help release the most flavor. In the bowl of an electric mixer fitted with the whisk attachment, beat egg whites on medium speed until soft peaks form. With the machine still running, gradually add the sugar (vanilla bean-infused or plain) and beat on medium-high until stiff peaks form. If you haven’t used a vanilla bean, now add your vanilla extract and beat to combine.", 
            "Add yolks one at at time, beating thoroughly after each addition. Add milk and beat just to combine. Add flour mixture, one-third at at time, folding in each addition gently by hand. ", 
            "Pour batter in prepared pan and smooth top. Bake for 18 to 24 minutes, or until a tester inserted into cake comes out clean. Let completely cool in pan on a rack. ", 
            "In a large bowl, preferably one with a pouring spout, whisk together evaporated milk, condensed milk and 1 1/2 cups heavy or light cream. Add rum, if using.  Use a wooden skewer to poke holes all over cake. Pour all but 1/2 cup milk mixture over cake and transfer to fridge, giving the cake several hours but ideally overnight to soak it up. (Save last bit of milk mixture for serving.)", 
            "Before serving, beat 2 cups heavy cream with 2 tablespoons powdered or granulated sugar until soft peaks form. Spread over top of cake. ", 
            "Serve cake in squares, first pouring a little puddle of reserved three-milk mixture at the bottom of plate. "
        ], 
        "date": "2015-12-09T12:05:09+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/upside-down-cranberry-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Cranberries", 
            "Fall", 
            "Photo", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2010/11/upside-down-cranberry-cake/", 
        "title": "upside-down cranberry cake", 
        "directions": [
            "Preheat oven to 375°F. Grease a 9-inch round cake pan with butter and cover the bottom with parchment paper (see Note above). In a medium saucepan over medium heat, combine the brown sugar, 4 tablespoons (1/4 cup) of the melted butter, molasses and 1/4 cup water and bring to a boil. Stir well and pour into prepared cake pan. Set pan aside.", 
            "Sift the flour, sugar, baking powder and salt together into a bowl or onto a sheet of waxed paper and set aside. In the bowl of an electric mixture fitted with the whisk attachment (eh, I just used a handmixer with standard beaters) beat the eggs and sour cream together at medium speed until well blended. Add optional flavorings of your choice. Scrape down the bowl and add remaining melted butter (1/2 cup) and beat until combined. Add flour mixture and beat until smooth.", 
            "Add the cranberries to the prepared baking pan and gently press the fruit into an even layer. Dollop the batter on top and use an offset spatula to gently nudge it into place without disturbing the cranberries underneath. Bake on the center rack (with a tray underneath to catch drips… just in case; mine did not overflow but came stressfully close) until golden and a tester inserted into just the cake comes out clean, which took 30 to 35 minutes in my oven but is suggested to take 45. Please, please check yours on the early side. Remove from the oven and let cool in pan for 15 minutes. Run a thin knife around the inside of the pan then insert over a flat platter that is (Learn From My Mistakes Alert!) larger than your cake pan, to catch any puddling or jumping cranberries. Remove the parchment paper.", 
            "Serve warm, with freshly whipped cream. However, this cake wasn’t half bad two to three days layer, kept covered at room temperature."
        ], 
        "date": "2010-11-10T14:06:58+00:00"
    }, 
    {
        "ingredient_list": [
            "1 recipe Great Unshrinkable Sweet Tart Shell, unbaked", 
            "1 cup whipping cream", 
            "1/2 cup sugar", 
            "1/4 cup (packed) golden brown sugar", 
            "1/4 cup honey", 
            "2 teaspoons grated orange peel", 
            "1/2 teaspoon whole aniseed (we liked this level, but use 1/4 teaspoon if you’re anise-phobic)", 
            "1 3/4 cups walnuts, toasted, chopped", 
            "1/2 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/walnut-tartlets1.jpg?w=640", 
        "tags": [
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2008/11/walnut-tartlets/", 
        "title": "walnut tartlets", 
        "directions": [
            "Preheat oven to 370°F. Cut pastry dough into six pieces, and roll out each one to a 6-inch circle. Transfer to a lightly-buttered 4 1/2-inch-diameter tartlet pan with removable bottom. Press crust onto bottom and up sides of pan; trim overhang to 1/2 inch. Fold overhang in and press, forming double-thick sides. Repeat with remaining dough disks and 5 more pans and prick them all over with a fork.", 
            "Freeze crusts for 30 minutes. Lightly butter six pieces of foil and press them tightly against frozen tart shells. Bake crusts for 10 minutes before taking them out, carefully removing the foil, pressing down any pastry that has bubbled up gently with the back of a spoon and baking them for an additional 7 minutes, or until lightly golden at the edges. [More detailed instructions in this post.] Take them out of the oven and let them cool. Increase oven temperature to 400°F.", 
            "Meanwhile, make the filling. Stir cream and next 5 ingredients in heavy medium saucepan over medium-low heat until sugar dissolves. Increase heat; boil until mixture bubbles thickly and color darkens slightly, about 6 minutes. Remove from heat; stir in walnuts then salt.", 
            "Place crusts on baking sheet lined with foil. Divide filling among crusts. (I had a bit extra. Can we say “best ice cream topping, ever”?) Bake tartlets until filling bubbles thickly and crusts are golden, about 25 minutes. Cool tartlets in pans on rack 5 minutes. Remove pan sides while tartlets are still warm. (Hm, I ignored this and found them easier to remove when they were fully cool, but I’ll let you decide.)", 
            "Serve slightly warm or at room temperature."
        ], 
        "date": "2008-11-21T23:21:18+00:00"
    }
]