{
  "date": "2015-11-18T12:09:49+00:00",
  "directions": [
    "Make dough: Stir the flour and salt together in a large bowl. Sprinkle bits of butter over dough and, using a pastry blender or your fingertips, work it into the flour until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, stir together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball. Wrap with plastic and refrigerate for 1 hour, or up to 2 days.",
    "Meanwhile, prepare filling: Heat the oven to 400 degrees F. Arrange leeks cut-side-up in a large (9×13-inch) baking dish. Drizzle with olive oil. Sprinkle with 1 teaspoon kosher salt and freshly ground black pepper. Flip the leeks so that their cut sides face down, add 3 tablespoons of water to the dish, cover tightly with aluminum foil and bake for 20 minutes until tender. Uncover and continue roasting the leeks for 10 to 15 minutes, or until caramelized. Leave oven on. Let leeks cool slightly, then chop into segments and place in a large bowl. Toss with beans, garlic, lemon zest, parsley, 1/2 cup grated cheese and season with salt and pepper to taste. ",
    "Assemble galettes: Divide dough into 4 pieces. On a floured counter, roll the first piece dough out into a roughly 8-inch round, although it really doesn’t need to be perfectly shaped. Transfer to a large parchment-lined baking sheet; I like to fold my dough gently, without creasing, in quarters then unfold it onto the baking pan. Sprinkle about 1/4 of the prepared filling into the center of the dough, leaving a 1 1/2-inch border. Sprinkle with about 1/4 of the remaining cheese. Fold the border over the filling, pleating the edge to make it fit. The center will be open. Brush crust with egg yolk glaze. Repeat with remaining dough and filling, making 4 small galettes.",
    "Bake the galettes: For 25 to 30 minutes, until golden brown all over. Remove from the oven and let stand for 5 minutes, then slide the galette onto a serving plate. Or, if you’re planning ahead, let cool completely and refrigerate until needed. Gently rewarm before serving in a low oven."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/roasted-leek-and-white-bean-galettes1.jpg?w=750",
  "ingredient_list": [
    "For the pastry:",
    "1 1/4 cups (160 grams) all-purpose flour",
    "1/4 teaspoon table salt",
    "8 tablespoons (4 ounces or 115 grams) cold unsalted butter, cut into pieces and chill again",
    "1/4 cup (60 grams) plain yogurt or sour cream",
    "2 teaspoons (10 ml) fresh lemon juice",
    "1/4 cup (60 ml) ice water",
    "For the filling",
    "6 small-to-medium leeks, dark green tops discarded, white and light green parts halved lengthwise",
    "2 tablespoons olive oil",
    "Kosher salt",
    "Freshly ground black pepper",
    "1 15-ounce can cannellini beans, rinsed and drained",
    "1 garlic clove, minced",
    "1/4 teaspoon finely grated lemon zest",
    "1/4 cup chopped flat-leaf parsley",
    "2/3 cup grated gruyère cheese, divided",
    "Glaze:",
    "1 egg yolk beaten with 1 teaspoon water"
  ],
  "tags": [
    "Beans",
    "Leeks",
    "Photo",
    "Tarts/Quiche",
    "Thanksgiving",
    "Vegetarian"
  ],
  "title": "roasted leek and white bean galettes",
  "url": "https://smittenkitchen.com/2015/11/roasted-leek-and-white-bean-galettes/"
}