{
  "date": "2007-06-28T14:24:24+00:00",
  "directions": [
    "If using dried black-eyed peas, rinse and soak them in enough water to cover for 6 to 8 hours. Drain. ",
    "In a large saucepan, heat the oil over medium-low heat and saute the onion until it turns dark brown, about 8 minutes. Add the coriander, garlic, ginger, turmeric, cayenne and cumin, and stir for 2 minutes. Add the tomato and stir over low heat until it disintegrates. ",
    "Add the peas and mix well. Pour in the hot water, if using, add the salt and sugar, and bring to a boil. Turn the heat down to low, cover, and simmer until the peas are cooked through, about 20 minutes. If using canned peas, simmer for only 10 minutes (it is essential to simmer the canned peas, too, so that all the flavors blend better). Stir in the coconut milk and simmer uncovered for another 8 to 10 minutes, again allowing the flavors to come together. ",
    "Add the cilantro and lemon juice, simmer for 1 minute more, and remove from heat. Serve hot. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/and-then-i-moved-into-the-refrigerator1.jpg?w=500",
  "ingredient_list": [
    "2 cups tightly packed, shredded green cabbage (use the large holes of a grater)",
    "1 small serrano chile, seeded and minced",
    "2 tablespoons fresh lemon juice, or more as needed",
    "1/4 to 1/2 to 1 teaspoon table salt  (adjusted from 1 tsp. as a few commenters found it too salty)",
    "1/2 teaspoon sugar",
    "1 tablespoon canola oil",
    "1/2 teaspoon mustard seeds ",
    "1 cup yellow split peas, soaked in cold water for 1 hour",
    "1 large tomato (about 8 ounces), cut into 8 wedges",
    "1/4 cup canola oil",
    "1/2 teaspoon cumin seeds",
    "1 medium red onion, finely chopped (about 1 1/2 cups)",
    "5 large garlic cloves, thinly sliced",
    "1 teaspoon coriander seeds, finely ground",
    "3/4 teaspoon ground turmeric",
    "1/2 teaspoon cayenne (I used 1/4, thought it was plenty, although I may be a wuss.)",
    "1/4 cup minced cilantro leaves (I abhor cilantro, and always replace it with flat-leaf parsley.)",
    "1 tablespoon unsalted butter",
    "1 teaspoon salt ",
    "1 cup dried black-eyed peas or two 15-ounce cans, drained",
    "2 tablespoons, canola oil",
    "1 small yellow onion, minced (about 1 cup)",
    "1 teaspoon coriander seeds, finely ground",
    "1/2 teaspoon finely grated garlic (about 1 large clove)",
    "1/2 teaspoon finely grated ginger (about a 1-inch piece)",
    "1/2 teaspoon ground turmeric",
    "1/2 teaspoon cayenne (I always start with the half the suggested cayenne, and then decide if it needs more. Mine didn’t.)",
    "1/2 teaspoon cumin seeds, finely ground",
    "1/4 cup minced tomato (1 small tomato)",
    "2 cups (or 1 cup if using canned peas) hot water",
    "1/2 teaspoon salt, or to taste if using canned peas",
    "1/2 teaspoon sugar",
    "1 cup canned coconut milk",
    "2 tablespoons minced cilantro leaves",
    "1 tablespoon lemon juice "
  ],
  "tags": [
    "Beans",
    "Indian",
    "Photo",
    "Vegetarian"
  ],
  "title": "everyday yellow dal",
  "url": "https://smittenkitchen.com/2007/06/and-then-i-moved-into-the-refrigerator/"
}