{
  "date": "2017-05-24T12:05:32+00:00",
  "directions": [
    "Bring a medium/large pot of salted water to boil. Once boiling, add broccoli and boil for 2 to 2 1/2 minutes, until slightly softened but still crisp overall. Scoop out with slotted spoon or tongs, then drain.",
    "Add farro back to same pot (I’m totally okay with some errant leftover broccoli flecks and vitamins here, if you’re not, use another pot of salted water) and cook, simmering, for 25 to 30 minutes, until tender. (Since there are so many varieties of farro, however, if your package suggests otherwise, it’s best to defer to its cooking suggestion.) Drain and tip into a large mixing bowl; cool to lukewarm.\nPat drained broccoli dry on towels, trying to remove as much excess moisture as possible. Chop into small (roughly 1/2-inch) bits. In a large sauté pan, heat olive oil over medium-high heat until hot. Add garlic and pepper flakes, to taste, and cook for 1 minute, until garlic is faintly golden. Add chopped broccoli, lemon zest, and salt (I use a full teaspoon kosher salt here, but adjust the amount to your taste) and cook, stirring, for 3 to 4 more minutes, until broccoli is well-seasoned and slightly more tender.\nAdd broccoli and every bit of garlic and oil from the pan to the bowl of farro and stir to combine. Add lemon juice, black pepper and more salt to taste (but 1/2 teaspoon of each is what we used) and stir to combine. Stir in cheese.",
    "Serve warm or at room temperature as-in, with an egg on top, burrata, and/or seasoned breadcrumbs."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/broccoli-rubble-farro-salad.jpg?w=750",
  "ingredient_list": [
    "Salt",
    "1 cup semi-pearled farro",
    "1 pound broccolini or regular broccoli (previously: 2 pounds, see note)",
    "4 tablespoons olive oil",
    "2 cloves garlic, minced",
    "Red pepper flakes, to taste",
    "Finely grated zest, then juice, of 1 lemon (juice before zesting only if you enjoy being grumpy)",
    "Freshly ground black pepper",
    "4 ounces pecorino romano, grated or ground in a food processor"
  ],
  "tags": [
    "Broccoli",
    "Grain/Rice",
    "Lunch",
    "Picnics",
    "Put An Egg On It",
    "Recipes",
    "Salad",
    "Summer",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "broccoli rubble farro salad",
  "url": "https://smittenkitchen.com/2017/05/broccoli-rubble-farro-salad/"
}