{
  "date": "2012-10-23T11:28:02+00:00",
  "directions": [
    "Preheat oven to 375 degrees F. ",
    "Peel squash, then halve lengthwise and scoop out seeds. Cut squash into approximately 3/4-inch chunks. Coat one large or two small baking sheets with 2 tablespoons oil total. Spread squash out in single layer on sheet. Sprinkle with salt and freshly ground black pepper. Roast until pieces are tender, about 30 to 40 minutes, turning them over halfway through the cooking time. Set aside to cool slightly.",
    "While squash is roasting, cook farro in a large pot of simmering salted water until the grains are tender but chewy, about 30 minutes. (Since there are so many varieties of farro, however, if your package suggests otherwise, it’s best to defer to its cooking suggestion.) Drain and cool slightly.",
    "While squash is roasting and farro is simmering, in a small bowl, whisk together sherry vinegar, water, 1/2 teaspoon table salt and granulated sugar until sugar and salt dissolve. Stir in onion; it will barely be covered by vinegar mixture but don’t worry. Cover and set in fridge until needed; 30 minutes is ideal but less time will still make a lovely, lightly pickled onion.",
    "In a large bowl, mix together butternut squash, farro, red onion and its vinegar brine, the crumbled cheese and pepitas. Toss with 3 tablespoons of the remaining olive oil, use the 4th one only if needed. Taste and adjust seasonings. Eat now or later. Salad keeps in the fridge for up to a week."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/butternut-squash-salad-with-farro-and-pepitas1.jpg?w=500",
  "ingredient_list": [
    "1 medium butternut squash (about 2 pounds)",
    "5 to 6 tablespoons olive oil, divided",
    "Salt and freshly ground black pepper, to taste",
    "1 cup semi-pearled farro (see Note up top)",
    "1/3 cup toasted pepitas (I used, and love, the salted ones)",
    "3 ounces ricotta salata or another salty cheese, crumbled or coarsely grated (about 3/4 cup)(omit to make vegan)",
    "1 tablespoon sherry vinegar",
    "1 tablespoon water",
    "1/2 teaspoon table salt",
    "1/2 teaspoon granulated sugar",
    "1/2 small red onion, finely chopped"
  ],
  "tags": [
    "Fall",
    "Grain/Rice",
    "Lunch",
    "Photo",
    "Salad",
    "Vegan",
    "Vegetarian",
    "Winter Squash"
  ],
  "title": "butternut squash salad with farro and pepitas",
  "url": "https://smittenkitchen.com/2012/10/butternut-squash-salad-with-farro-and-pepitas/"
}