{
  "date": "2009-11-19T11:26:48+00:00",
  "directions": [
    "Wash your spinach well but no need to spin or pat it dry. Place spinach in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 2 to 4 minutes for baby spinach and 4 to 6 minutes for regular spinach.",
    "Press or squeeze out the excess liquid any number of ways, either by wringing it out in cheesecloth (my favorite method), putting it in a mesh strainer and pressing the moisture out with a spatula or large spoon or letting it cool long enough to grab small handfuls and squeezing them to remove as much water as possible. Coarsely chop the wrung-out spinach.",
    "Wipe out large pot so you can use it again.",
    "Heat milk or cream in a small saucepan over moderate heat, stirring, until warm. Keep warm. Meanwhile, cook onion and garlic, if using, in butter in your wiped-out large pot over moderately low heat, stirring occasionally, until softened, about six minutes. Whisk in flour and cook roux, whisking, about three minutes. Add warm milk or cream in a slow stream, whisking constantly to prevent lumps, and simmer, whisking, until thickened, three to four minutes. Stir in nutmeg, spinach, and salt and pepper to taste and cook, stirring, until heated through.",
    "Do ahead: Creamed spinach can be made one day ahead and chilled, covered then reheated over moderately low heat until hot. However, it really tastes best eaten immediately."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/creamed-spinach.jpg?w=753",
  "ingredient_list": [
    "2 pounds baby spinach or 2 1/2 pounds fresh spinach, tough stems discarded",
    "1 3/4 cups heavy cream or whole milk, or a mix thereof",
    "1 small onion, finely chopped",
    "1 small clove garlic, minced (optional)",
    "3 tablespoons unsalted butter",
    "3 tablespoons all-purpose flour",
    "Pinch of freshly grated nutmeg"
  ],
  "tags": [
    "Fall",
    "Photo",
    "Side Dish",
    "Spinach",
    "Thanksgiving",
    "Vegetarian"
  ],
  "title": "creamed spinach",
  "url": "https://smittenkitchen.com/2009/11/creamed-spinach/"
}