{
  "date": "2007-07-08T13:54:11+00:00",
  "directions": [
    "Sour cream, melted butter or vinegar to serve ",
    "Cook the potatoes in a large pot of salted boiling water until just tender. Drain and set aside. ",
    "Melt the butter in a large heavy frying pan and cook the onions until they soften then lightly brown, darkly browned in spots. ",
    "Mash the potatoes in a bowl then mix in the onions and their cooking butter. Season generously with salt and pepper. ",
    "Using a round cookie or biscuit cutter the width of the smaller side of the dumpling wrapper, cut 10 to 12 wrappers at a time into circles, discarding the extra. Working on at a time, brush the edge of the round wrapper with water and place a spoonful of filling in the center. Fold dumpling in half, pressing the edges together to thoroughly seal. ",
    "Place each dumpling on a parchment or waxed paper lined baking sheet and repeat until all filling has been used. ",
    "Chill in the refrigerator if you are making them ahead of time. If you wish to freeze the dumplings for later use, make sure they are not touching, then freeze them until solid and later gather them into a freezer bag. This ensures that you will avoid having one mega-pierogi clump when you are ready to cook them.",
    "To cook the pierogi: Bring a large pot of salted water to a boil and add the dumplings one at a time, until the surface of the pan is covered with dumplings. Do not overcrowd; you’ll have to work in batches. When they are done, about 2-3 minutes, remove with a slotted spoon. ",
    "Transfer to bowls and serve sprinkled with green onions, parsley or chives, drizzled with a little melted butter or vinegar or topped with a deb of sour cream. ",
    "Alternatively, you can pan-brown the pierogi. Heat some oil in a heavy frying pan and add dumplings in a single layer. When they are golden and in spots, browned, turn and brown other side. Add enough water to reach about 1/4-1/2 inch in depth. Cover and cook 3-4 minutes; remove lid and check for doneness. When pierogi are tender but not mushy to the tooth, and the liquid is evaporated, they are ready. ",
    "Note: To make fried onions, saute 2 to 3 thinly sliced onions, in butter in a heavy frying pan until they are limp and lightly browned; add several tablespoons water and cook until the onions are soft and silky, the liquid mostly evaporated. Season with salt and pepper. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/from-insert-your-origin-here-with-love1.jpg?w=500",
  "ingredient_list": [
    "1 1/2 pounds baking potatoes, peeled and cut into chunks",
    "4 to 5 tablespoons unsalted butter + a little extra to melt and drizzle over the dumplings (Deb note: I was able to make do with just 2 T butter in a non-stick)",
    "3 onions, finely chopped",
    "Salt and black pepper to taste",
    "1 to 2 packages of gyoza (pot sticker) wrappers",
    "3 to 5 green onions, thinly sliced or 1/4 cup chopped chives or 2 tablespoons chopped parsley or additional fried onions (see note), to serve"
  ],
  "tags": [
    "Dumplings",
    "Photo",
    "Potatoes",
    "Vegetarian"
  ],
  "title": "quick potato pierogi",
  "url": "https://smittenkitchen.com/2007/07/from-insert-your-origin-here-with-love/"
}