{
  "date": "2006-11-15T18:12:05+00:00",
  "directions": [
    "Preheat oven to 400°F.",
    "In a small bowl soak tomatoes in hot water to cover 5 minutes. Reserving 1 tablespoon soaking liquid, drain tomatoes well and chop fine.* ",
    "Lay mushroom caps, stems removed, face down on baking sheet either lightly sprayed with cooking spray or parchment paper. Bake them approximately 10 minutes, or until their liquid puddles underneath. Remove from the oven. Carefully pour off liquid that has gathered in the bottom of the pan, and then again, carefully, turn mushroom caps over so they are ready to be filled.",
    "In a small skillet heat oil over moderate heat until hot but not smoking and cook chopped mushrooms stems, shallots and garlic, stirring until shallots are softened. In a bowl stir together mushrooms mixture, bread crumbs, tomatoes, reserved soaking liquid, yolk, parsley, basil, and salt and pepper to taste. Mound stuffing in reserved mushroom caps and arrange caps in a lightly greased shallow baking dish, or the same parchment-lined pan you’ve roasted your mushrooms in. Sprinkle mushrooms with Parmesan and bake in middle of oven 15 minutes.",
    "Makes 18 hors d’oeuvres.",
    "* Can skip this step if using oil-packed tomatoes, as I did."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/sundried-tomato-stuffed-mushrooms.jpg?w=750",
  "ingredient_list": [
    "1/2 ounce dried tomatoes (about 5, not packed in oil)",
    "2 tablespoons olive oil",
    "18 white mushrooms, stems pulled out and chopped fine and caps reserved",
    "1/2 cup finely chopped shallots",
    "2 garlic cloves, minced",
    "1/3 cup fine dry bread crumbs",
    "1 large egg yolk, beaten lightly",
    "1/4 cup fresh parsley leaves, washed well, spun dry, and minced",
    "1/2 teaspoon dried basil, crumbled",
    "2 tablespoons freshly grated Parmesan "
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Mushrooms",
    "Photo",
    "Thanksgiving",
    "Vegetarian"
  ],
  "title": "sundried tomato stuffed mushrooms",
  "url": "https://smittenkitchen.com/2006/11/grievances-aired-caps-stuffed/"
}