{
  "date": "2015-05-12T12:04:17+00:00",
  "directions": [
    "Melt 2 tablespoons butter and olive oil together in a large, heavy skillet over medium-high heat. One fully hot, add mushrooms to pan and cook, stirring regularly, until they’ve released their water and started to turn golden brown, about 8 minutes. ",
    "Meanwhile, grill or toast your bread.",
    "One the mushrooms have a nice color on them, add the garlic or shallots and cook, stirring constantly, for 1 minute. Drizzle with vinegar, most of the chile or chile flakes, salt and pepper and stir to combine. Add the greens; pretty much any kind aside from baby spinach will benefit from about 5 to 8 minutes cooking time, just until collapsed. If you’re me, you’ll add 1 more tablespoon vinegar for brightness at this point. Stir in remaining tablespoon butter and adjust seasonings to taste. Rip bread into irregular croutons and push them into the sauteed vegetables. Lay pieces of cheese atop everything. Turn the heat down to medium low, place a lid on the pan and let the cheese melt, which will take 5 to 10 minutes, depending on the pan and the kind of cheese you used. ",
    "Sprinkle with remaining chile, “hand out forks, then bring the the pan to the table.” "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroooms-and-greens-with-toast1.jpg?w=640",
  "ingredient_list": [
    "3 tablespoons unsalted butter, divided",
    "1 tablespoon olive oil",
    "1 1/2 pounds mixed mushrooms, cleaned, trimmed and torn into bite size pieces (see suggestions above)",
    "2 thick slices bread from a large, crusty loaf (I’d use 4 from a smaller loaf)",
    "2 cloves garlic or 1 shallot, minced",
    "1 tablespoon white wine vinegar, or more to taste (I used 2)",
    "1 fresh red chile, stemmed, seeded and minced or red pepper flakes, to taste",
    "Coarse salt and freshly ground black pepper",
    "6 ounces chopped fresh greens (see suggestions above)",
    "8 ounces of a good melting cheese, thickly sliced (suggestions above)"
  ],
  "tags": [
    "Casserole",
    "Greens",
    "Kale",
    "Mushrooms",
    "Photo",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "mushrooms and greens with toast",
  "url": "https://smittenkitchen.com/2015/05/mushrooms-and-greens-with-toast/"
}