{
  "date": "2009-01-15T15:48:36+00:00",
  "directions": [
    "Heat the one tablespoon of the olive oil and one tablespoon of butter in a medium Dutch oven or heavy sauce pan over high heat. Sear the mushrooms until they begin to darken, but not yet release any liquid — about three or four minutes. Remove them from pan.",
    "Lower the flame to medium and add the second tablespoon of olive oil. Toss the carrots, onions, thyme, a few good pinches of salt and a several grinds of black pepper into the pan and cook for 10, stirring occasionally, until the onions are lightly browned. Add the garlic and cook for just one more minute. ",
    "Add the wine to the pot, scraping any stuck bits off the bottom, then turn the heat all the way up and reduce it by half. Stir in the tomato paste and the broth. Add back the mushrooms with any juices that have collected and once the liquid has boiled, reduce the temperature so it simmers for 20 minutes, or until mushrooms are very tender. Add the pearl onions and simmer for five minutes more.",
    "Combine remaining butter and the flour with a fork until combined; stir it into the stew. Lower the heat and simmer for 10  more minutes. If the sauce is too thin, boil it down to reduce to the right consistency. Season to taste.",
    "To serve, spoon the stew over a bowl of egg noodles, dollop with sour cream (optional) and sprinkle with chives or parsley."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/mushroom-bourguignon-e1477582482731.jpg?w=625",
  "ingredient_list": [
    "2 tablespoons olive oil",
    "2 tablespoons butter, softened",
    "2 pounds portobello mushrooms, in 1/4-inch slices (save the stems for another use) (you can use cremini instead, as well)",
    "1/2 carrot, finely diced",
    "1 small yellow onion, finely diced",
    "2 cloves garlic, minced",
    "1 cup full-bodied red wine",
    "2 cups beef or vegetable broth (beef broth is traditional but vegetable to make it vegetarian; it works with either)",
    "2 tablespoons tomato paste",
    "1 teaspoon fresh thyme leaves (1/2 teaspoon dried)",
    "1 1/2 tablespoons all-purpose flour",
    "1 cup pearl onions, peeled (thawed if frozen)",
    "Egg noodles, for serving",
    "Sour cream and chopped chives or parsley, for garnish (optional)"
  ],
  "tags": [
    "Date Night",
    "Elsewhere",
    "Freezer Friendly",
    "Mushrooms",
    "Photo",
    "Vegetarian",
    "Winter"
  ],
  "title": "mushroom bourguignon",
  "url": "https://smittenkitchen.com/2009/01/mushroom-bourguignon/"
}