{
  "date": "2012-04-06T13:33:01+00:00",
  "directions": [
    "Make buttery shell: In a stand mixer fitted with the paddle attachment, mix 1 cup of the flour with all of the salt. Then, with the machine on low speed, add the bits of butter, a handful at a time, until the butter is completely incorperated. Add the remaining flour until just blended, then the cold water until thoroughly incorporated. Dump dough onto a piece of plastic wrap and form it into a flat, round disc. Wrap it with the plastic and chill it for at least one hour, preferably overnight, and up to two days.",
    "Prepare shell: Set the ring of a 9-inch springform pan, leaving the hinge open, on a rimmed baking sheet lined with parchment paper. Brush the inside of the ring with lightly with oil and set aside.",
    "Generously flour your counter, then place the chilled, unwrapped dough on the flour and flour the top of the dough. Roll you dough into a 16-inch round. The dough is going to be very hard at first, but keep at it, pressing your rolling pin gently from the center; it will get easier as it stretches out, and it’s best to start when its very cold as it will remain the coolest/most firm longer. Re-flour your surface as needed, continually lifting and rotating your dough to make sure no parts are sticking. If at any point the dough becomes sticky, soft and, frankly, annoying, just slide it onto a floured baking sheet and pop it into the freezer for two minutes for it to cool down again. If it tears, just overlap the sides of the tear and roll them back together. Don’t fret tiny holes; there will be time to patch later.",
    "You can transfer your dough to the prepared pastry ring in one of two ways. Keller’s method is to roll it up on your rolling pin, then unroll it in the ring. I like to gently fold mine into quarters, without creases, and unfold it in the ring. Gently lift the edges so that the slack of the dough drapes in. Press the dough into the corners and up the sides of the ring. Trim the overhang to 1-inch and please, save your scraps. (I did not. The ring your see pictured is round two. I don’t want to talk about it.) Chill the pastry shell (and the scraps, so they don’t get mushy) in the fridge for 20 minutes (if par-baking) or until needed (if not par-baking).",
    "Preheat oven to 325°F.",
    "Decide if you want to par-bake your buttery pastry shell: Read the Note up top first.",
    "To par-bake your pastry shell: Line your chilled buttery pastry shell with a 14-inch round of parchment paper, or, if your parchment paper isn’t that wide, two sheets in opposite directions. Fill completely (or whichever wall parts aren’t filled will collapse a little) with pie weights/dried beans/uncooked rice/loose change and bake in your preheated oven for 30 to 40 minutes, or until lightly golden at edges. Carefully remove weights and parchment paper and return shell to oven, baking another 10 to 15 minutes longer, until “richly brown” (as per Keller) on bottom. Set aside to cool while you make your filling. Leave the oven on.",
    "Prepare filling: In a very large skillet, heat the oil. Add the mushrooms, season with salt and pepper and cook over high heat, stirring, until starting to soften, about 5 minutes. Reduce the heat to moderate. Add the butter, shallots and thyme and cook, stirring often, until the mushrooms are tender, about 12 minutes longer. Season with salt and pepper and let cool.",
    "Assemble quiche: Whether or not your par-baked your buttery pastry shell, check it for holes or cracks that would cause leakage. If you see any, seal them with the trimmed scraps from the dough. Scatter 1/4 cup (one-third of) cheese and half the mushrooms in the bottom of the pastry shell. Either in a blender (Keller’s recommendation) or with a hand whisk (what I did), mix half the milk, cream and eggs with 1 1/2 teaspoons kosher salt (this seemed like a lot, I used less, wish I’d used the full amount), several grinds of black pepper and a pinch of nutmeg (if using) until frothy. Pour into the pastry shell. Top with another 1/4 cup of the cheese and remaining mushrooms. Make the custard again with the remaining eggs/milk/cream and same seasonings and pour it into the shell. Sprinkle remaining 1/4 cup cheese on top.",
    "Bake quiche: For 1 1/2 hours, until nicely bronzed on top and the custard is just set. (My tester came out damp but not eggy; i.e. clean.) Let cool in pan until warm.",
    "Serve quiche: Using a serrated knife, trim the pastry shell flush with the top of the pan. Run your knife around the outside of the quiche, inside the ring to make sure it’s not stuck anywhere. Take a deep breath. Lift the springform pan ring off the quiche. Applaud. You can trim your crust further if there’s a big gap between the top and the top of your crust but you might want to do so more neatly than I did. Cut the quiche into wedges and serve warm, with a delicate greens salad."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/over-the-top-mushroom-quiche1.jpg?w=500",
  "ingredient_list": [
    "Buttery Pastry Shell",
    "2 cups (250 grams) all-purpose flour, plus more for dusting",
    "1 teaspoon kosher salt",
    "1 cup (2 sicks or 225 grams) very cold unsalted butter, cut into a small dice",
    "1/4 cup (60 ml) water, ice cold",
    "Neutral oil, for brushing springform",
    "Filling",
    "1 tablespoon (15 ml) olive or vegetable oil",
    "2 pounds (905 grams) mushrooms (see Note up top for suggestions)",
    "Salt and freshly ground black pepper",
    "1 tablespoon (15 grams) unsalted butter",
    "2 shallots, minced (I used 4 small because I’m a rebel)",
    "1 tablespoon fresh thyme, minced (use 1 teaspoon only if dried/jarred)",
    "3/4 cup (2 1/2 ounces or 70 grams) Comte, Emmantel or Gruyere, grated",
    "2 cups (475 ml) milk",
    "2 cup (475 ml) heavy cream",
    "6 large eggs, lightly beaten",
    "Freshly grated nutmeg (optional)"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Easter",
    "Mushrooms",
    "Photo",
    "Tarts/Quiche",
    "Vegetarian"
  ],
  "title": "over-the-top mushroom quiche",
  "url": "https://smittenkitchen.com/2012/04/over-the-top-mushroom-quiche/"
}