{
  "date": "2007-01-29T22:36:01+00:00",
  "directions": [
    "Bring broth and water to a boil in a 4-quart pot. Add asparagus and cook, uncovered, until crisp-tender, 3 to 4 minutes. Transfer asparagus with a slotted spoon to a large bowl of ice and cold water to stop cooking, then drain and pat dry. Keep broth at a bare simmer, covered. ",
    "Heat oil with 1 tablespoon butter in a 4-quart heavy saucepan over moderately high heat until foam subsides, then saute mushrooms, stirring occasionally, until browned, about 4 minutes. Season with salt and pepper, then transfer to a bowl. ",
    "Cook onion in 2 tablespoons butter in saucepan over moderate heat, stirring, until softened, about 3 minutes. Add shallots and cook until softened, about 2 to 3 minutes, then add rice and cook, stirring, 1 minute. Add wine and cook, stirring, until absorbed, about 1 minute. ",
    "Ladle in 1 cup simmering broth and cook at a strong simmer, stirring, until absorbed, about 2 minutes. Continue simmering and adding broth, about 1/2 cup at a time, stirring frequently and letting each addition be absorbed before adding next, until rice is just tender and looks creamy, 18 to 20 minutes. (Save leftover broth for thinning.) ",
    "Remove from heat and stir in 1/2 cup cheese, remaining tablespoon butter, and salt and pepper to taste. Gently stir in asparagus, artichokes and mushrooms, then cover pan and let stand 1 minute. If desired, thin risotto with some of remaining broth. Serve immediately with remaining cheese on the side.",
    "* My absolutely favorite artichoke heart preparation is to remove all the outer leaves, choke and stem of a whole artichoke, leaving just the heart. Cut the heart into 1/4 inch slices and toss it immediately in a bowl filled with the juice of one lemon. Make sure each and every edge, angle and side of the hearts gets coated in lemon juice, or they will brown very quickly. In a small pot, boil water with a good glug or two of white wine, a splash of white vinegar and if you’re feeling fancy, a smashed garlic clove and/or a bay leaf. Drop in the artichoke hearts with all of their lemon juice, and simmer them for about 10 minutes, or longer if needed for them to become tender. Drain and set them aside. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/someday-my-spring-will-come1.jpg?w=500",
  "ingredient_list": [
    "5 cups chicken broth (40 fl ounces)",
    "1 cup water",
    "1 pound thin to medium asparagus, trimmed and cut into 1/4 inch thick slices, leaving tips 1 1/2 inches long",
    "1 tablespoon olive oil",
    "1/2 stick (1/4 cup) unsalted butter",
    "3/4 pound fresh shiitake mushrooms, stems discarded and caps cut into 1/4 inch thick slices",
    "2 large fresh artichoke hearts, cut into 1/4 inch thick slices, prepared*",
    "2 shallots, finely chopped",
    "1 1/2 cups Arborio rice (10 ounces)",
    "1/2 cup dry white wine",
    "2 ounces finely grated Parmigiano-Reggiano (1 cup, though I used half) "
  ],
  "tags": [
    "Artichokes",
    "Asparagus",
    "Easter",
    "Grain/Rice",
    "Mushrooms",
    "Photo",
    "Vegetarian"
  ],
  "title": "asparagus, artichoke and shiitake risotto",
  "url": "https://smittenkitchen.com/2007/01/someday-my-spring-will-come/"
}