{
  "date": "2009-01-28T23:23:25+00:00",
  "directions": [
    "Preheat the oven to 425°F.",
    "In a large bowl, combine the butternut squash, garlic, allspice, olive oil, and a few pinches of salt. Toss the squash pieces until  evenly coated. Roast them on a baking sheet for 25 minutes, or until soft. Remove from the oven and cool.",
    "Meanwhile, make the tahini dressing: In a small bowl, whisk together the garlic and lemon juice. Add the tahini, and whisk to blend. Add the water and olive oil, whisk well, and taste for seasoning. The sauce should have plenty of nutty tahini flavor, but also a little kick of lemon. You will probably need to add more water to thin it out.",
    "To assemble the salad, combine the squash, chickpeas, onion, and cilantro or parsley in a mixing bowl. Either add the tahini dressing to taste, and toss carefully, or you could serve the salad with the dressing on the side. Serve immediately.",
    "Do ahead: Molly says this salad, lightly dressed, keeps beautifully in the fridge, that you should hold a little of the dressing on the side and that it can be reheated in the microwave. I, for one, have never had any leftovers."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/warm-butternut-squash-and-chickpea-salad.jpg?w=750",
  "ingredient_list": [
    "For salad:",
    "1 medium butternut squash (about 2 to 2 1/2 pounds), peeled, seeded, and cut into 1 1/2-inch pieces",
    "1 medium garlic clove, minced or pressed",
    "1/2 teaspoons ground allspice (I skip this)",
    "2 tablespoons olive oil",
    "Salt",
    "One 15-ounce can chickpeas, drained and rinsed (1 1/2 cups)",
    "1/4 of a medium red onion, finely chopped",
    "1/4 cup coarsely chopped fresh cilantro or parsley",
    "For tahini dressing:",
    "1 medium garlic clove, finely minced with a pinch of salt",
    "1/4 cup lemon juice",
    "3 tablespoons well-stirred tahini",
    "2 tablespoons water",
    "2 tablespoons olive oil, plus more to taste"
  ],
  "tags": [
    "Beans",
    "Fall",
    "Photo",
    "Salad",
    "Vegan",
    "Vegetarian",
    "Winter Squash"
  ],
  "title": "warm butternut squash and chickpea salad",
  "url": "https://smittenkitchen.com/2009/01/warm-butternut-squash-and-chickpea-salad/"
}