{
  "date": "2010-03-04T22:23:24+00:00",
  "directions": [
    "Preheat the oven to 375°F. Toast the hazelnuts on a baking sheet for 8 to 10 minutes, rolling them around once or twice to make sure they toast evenly. Rub nuts in a dish towel to remove skins then let cool. Chop the hazelnuts coarsely.",
    "Whisk the shallots, vinegar, 1/2 teaspoon salt together in a bowl and let sit for five minutes (this will soften and almost pickle the shallots), before whisking in 5 tablespoons olive oil.",
    "Heat a large sauté pan over medium-high heat. Add 2 tablespoons olive oil and 1 tablespoon butter until the butter foams. Add half the mushrooms, half the thyme and season with salt and pepper. Sauté the mushrooms for about 5 minutes, until they’re softened but not limp (your cooking time will depend on the type of mushrooms you used).",
    "Transfer mushrooms to a plate then repeat with the second half. When they are cooked, return the first half of the mushrooms to the pan then toss in sliced shallots, cooking for an additional 2 minutes.",
    "Spread salad greens on a plate. Sprinkle fresh herbs on top, if using. Spoon hot mushrooms over the salad greens. Pour three-quarters of the vinaigrette in the sauté pan and swirl it in the pan until heated. Season it with 1/4 teaspoon salt and freshly ground black pepper. Pour over salad and toss carefully. Adjust to taste — you may need more salt, pepper, vinaigrette or even more sherry vinegar.",
    "Use a vegetable peeler to shave cheese over the salad. Sprinkle with hazelnuts. Serve immediately."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/03/warm-mushroom-salad-with-hazelnuts.jpg?w=753",
  "ingredient_list": [
    "1/2 cup hazelnuts",
    "2 tablespoons finely diced shallots",
    "3 tablespoons sherry or a white wine vinegar",
    "9 tablespoons extra-virgin olive oil",
    "2 pounds mushrooms (cremini or a mix of wild mushrooms), cleaned and sliced",
    "2 tablespoons unsalted butter",
    "6 ounces salad greens such as frisé, arugula or a mix of your choice",
    "A 1 cup mix of fresh herbs (optional) such as chives, tarragon",
    "1 teaspoon fresh thyme or a couple pinches of dried",
    "1/4 cup sliced shallots",
    "1/4 pound pecorino (Goin loves di Grotta, and we did too, but Romano would also work) or Parmesan-Reggiano or another hard, sharp cheese"
  ],
  "tags": [
    "Mushrooms",
    "Photo",
    "Salad"
  ],
  "title": "warm mushroom salad with hazelnuts",
  "url": "https://smittenkitchen.com/2010/03/warm-mushroom-salad-with-hazelnuts/"
}