[
    {
        "ingredient_list": [
            "2 cups diced (1/4 inch) cantaloupe (from a 2 1/4-lb piece)", 
            "1/4 cup diced (1/4 inch) sweet onion (such as Vidalia) or red onion", 
            "2 tablespoons chopped fresh basil or cilantro", 
            "1 (2-inch-long) fresh hot red or green chile (skip the seeds if you want to dim the heat), minced", 
            "2 tablespoons fresh lime juice", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/cantaloupe-salsa.jpg?w=752", 
        "tags": [
            "Cantaloupe", 
            "Fruit", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2009/07/cantaloupe-salsa/", 
        "title": "cantaloupe salsa", 
        "directions": [
            "Mix everything and eat immediately. "
        ], 
        "date": "2009-07-28T21:42:29+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups chopped or balled melon (from about 1 cantaloupe or honeydew, or 1/4 a large watermelon)", 
            "Juice of half a lime, divided, plus more to taste", 
            "Coarse salt, to taste", 
            "1/2 to 1 teaspoon chili powder", 
            "3 tablespoons crumbled cotija cheese", 
            "1 tablespoon toasted pepitas (I like the salty ones)", 
            "1 tablespoon chopped fresh cilantro, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_4945.jpg?w=750", 
        "tags": [
            "Cantaloupe", 
            "Honeydew", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Tex-Mex", 
            "Vegetarian", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2016/08/chile-lime-melon-salad/", 
        "title": "chile-lime melon salad", 
        "directions": [
            "Place melon in a wide bowl or on a platter. Squeeze half lime juice over, adding second half to taste, then sprinkle with salt and chili powder. Scatter with cheese, pepitas and cilantro and dig in.", 
            "Do ahead: I’d expected this salad not to keep at all but we found it just fine (with no watery run-off) after 2 hours in the fridge. I wouldn’t keep it assembled too much longer, though. You don’t want the salt to draw the juices out of the fruit before you eat it, and it’s quick enough to put together at the last minute.\n"
        ], 
        "date": "2016-08-09T11:39:50+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (4-pound*) cantaloupe or honeydew melon, seeded and cut into 1-inch cubes (about 8 cups)", 
            "1 1/2 cups water", 
            "1 to 2 tablespoons fresh lime juice", 
            "1 tablespoon sugar (optional, I skipped this)", 
            "1/4 teaspoons salt", 
            "1 quart chilled club soda or seltzer"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/melon-agua-fresca1.jpg?w=500", 
        "tags": [
            "Cantaloupe", 
            "Drinks", 
            "Honeydew", 
            "Photo", 
            "Picnics"
        ], 
        "url": "https://smittenkitchen.com/2009/08/melon-agua-fresca/", 
        "title": "melon agua fresca", 
        "directions": [
            "Garnish: lime wedges or melon slices", 
            "Purée melon in batches with water in a blender or food processor, however, if you use the latter be extra careful as the food processor does not excel in handling large amounts of liquid.", 
            "Transfer to a colander lined with a kitchen towel (not terry cloth) or fine cheesecloth set over a deep bowl and let drain about one hour. Gather ends of towel and very gently squeeze any remaining juice from melon, then discard solids. Stir in lime juice, sugar, and 1/4 tsp salt and chill for another hour.", 
            "Divide among 8 (10-ounces) glasses and top off with club soda. Or vodka. Look, I know some of you are going to anyway; just don’t forget to share.", 
            "Do ahead: Drinks, without club soda, can be made 4 days ahead and chilled. Add soda just before serving.", 
            "* My cantaloupe weighed 2 pounds, my honeydew weighed 7 1/2. I suppose that perfect four-pound melon specimens exist, just certainly not where I shop!"
        ], 
        "date": "2009-08-20T11:48:06+00:00"
    }
]