[
    {
        "ingredient_list": [
            "3 whole boneless chicken breasts with skin (about 2 1/2 pounds), halved (see Note)", 
            "1 1/2 tablespoons olive oil", 
            "3 1/2 tablespoons unsalted butter", 
            "1 onion, halved and sliced thin", 
            "3/4 pound mushrooms, sliced thin, any variety you like", 
            "1/2 cup dry Marsala", 
            "1 cup chicken broth", 
            "2 tablespoons minced fresh parsley leaves (optional, for garnish)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/03/alexs-chicken-and-mushroom-marsala.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Date Night", 
            "Gluten-Free", 
            "Mushrooms", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/03/alexs-chicken-and-mushroom-marsala/", 
        "title": "alex’s chicken and mushroom marsala", 
        "directions": [
            "Pat chicken dry and season with salt and pepper. In a large heavy skillet heat oil and 1 1/2 tablespoons butter over moderately high heat until hot but not smoking and brown chicken in 2 batches, transferring with tongs to a large plate as browned.", 
            "Discard all but 1 tablespoon fat from skillet and sauté onion and mushrooms, stirring occasionally, until liquid mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until Marsala is almost evaporated. Add broth and chicken with any juices that have accumulated on plate and simmer, turning chicken once, until cooked through, about 15 minutes. Transfer chicken with tongs to a platter.", 
            "Simmer mushroom sauce until liquid is reduced to about 1/2 cup. Remove skillet from heat and stir in remaining 2 tablespoons butter and salt and pepper to taste, stirring until butter is just incorporated. Spoon mushroom sauce around chicken and sprinkle with parsley. ", 
            "New note, 11/21/13: Tonight, I made this with boneless, skinless chicken thighs and it was fantastic — and quick, with refreshingly few ingredients. This takes well under an hour to cook, and deserves to be placed back in the weeknight rotation. "
        ], 
        "date": "2008-03-03T12:44:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 can (28 ounces) diced tomatoes in juice", 
            "1 tablespoon olive oil", 
            "3/4 pound sweet or hot Italian sausage, casings removed", 
            "1 small onion, finely chopped", 
            "Coarse salt and ground pepper", 
            "1 cup Arborio rice", 
            "1/2 cup dry white wine", 
            "1 bunch flat-leaf spinach (10 to 14 ounces), washed well, tough stems removed, chopped (about 7 cups)", 
            "1/2 cup grated Parmesan cheese, plus more for serving (optional)", 
            "2 tablespoons butter "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/tomato-and-sausage-risotto.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Gluten-Free", 
            "Meat", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2006/11/alexs-restaurant/", 
        "title": "tomato and sausage risotto", 
        "directions": [], 
        "date": "2006-11-14T17:44:30+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (455 grams) loaf white sandwich or pullman bread or 14 to 16 slices, stale is fine", 
            "3 tablespoons (45 grams) unsalted butter, softened or melted, plus a smidge to butter the pan", 
            "1 cup (170 grams) fresh blueberries", 
            "6 tablespoons (75 grams) granulated sugar", 
            "Zest of 1/2 lemon", 
            "2 teaspoons (10 ml) vanilla extract", 
            "6 large eggs", 
            "3 cups (710 ml) whole milk", 
            "1/4 teaspoon fine sea or table salt", 
            "Powdered sugar, golden or maple syrup to finish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/07/img_4275.jpg?w=750", 
        "tags": [
            "Blueberries", 
            "Breakfast", 
            "British", 
            "Brunch", 
            "Photo", 
            "Recipes"
        ], 
        "url": "https://smittenkitchen.com/2016/07/blueberry-bread-and-butter-pudding/", 
        "title": "blueberry bread and butter pudding", 
        "directions": [
            "Dab bread slices with 3 tablespoons melted butter. If your bread is already stale, no need to pre-toast/dry it out. If it’s fresh, heat oven to 350 degrees. Spread slices on two trays and bake for 5 to 10 minutes, until firm to the touch but not yet browned. If desired, you can cut the slices on the diagonal now too. (I find this easier once the bread is firm.)", 
            "Lightly butter a 9×13-inch or other 3-quart casserole dish. Fan bread slices out in pan. Scatter blueberries over and be sure to tuck some between slices so that they can burrow and collapse. Place sugar and lemon zest in the bottom of a small dish and use your fingertips to rub the zest into the sugar, so it breaks up a bit and also releases the most flavor. Sprinkle half of lemon sugar over bread and blueberries. Whisk eggs in a large bowl and slowly whisk in milk. Stir in vanilla and salt. Pour custard slowly and evenly over bread, berries and sugar. Sprinkle with remaining lemon sugar.", 
            "Let mixture soak for 15 minutes at room temperature or overnight in the fridge. When you’re ready to bake it, heat oven (or increase temperature) to 375 degrees. Bake pudding until a knife inserted into the center of the casserole and turned slightly causes no liquid custard to spill into the crack, approximately 30 to 40 minutes. This can vary by the density of your bread; it can sometimes take up to 45 minutes.", 
            "Let cool slightly before cutting into squares. Dust with powdered sugar or serve with a syrup on the side, if desired."
        ], 
        "date": "2016-07-29T11:58:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 bone-in pork shoulder, about 4 pounds", 
            "Kosher salt", 
            "2 tablespoons olive oil", 
            "1 medium white or yellow onion, peeled and cut into large pieces", 
            "1 large rib celery, cut into large pieces", 
            "1 small fennel bulb, trimmed and cut into large pieces", 
            "1 quart chicken stock, plus a splash or two more, if needed", 
            "3 sprigs fresh thyme", 
            "Freshly ground black pepper", 
            "4 tablespoons unsalted butter", 
            "2 9-ounce boxes dry lasagna, broken into 3-inch shards", 
            "2 tablespoons fresh lemon juice, or more to taste", 
            "2 tablespoons (although I use more) grated or shaved parmesan or grana padano cheese", 
            "1 tablespoon chopped parsley (optional)", 
            "Large handful arugula leaves, cleaned"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/broken-pasta-with-pork-ragu.jpg?w=750", 
        "tags": [
            "Arugula", 
            "Date Night", 
            "Fall", 
            "Freezer Friendly", 
            "Italian", 
            "Meat", 
            "Pasta", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/10/broken-pasta-with-pork-ragu/", 
        "title": "broken pasta with pork ragu", 
        "directions": [
            "Prepare pork: Use a sharp knife to remove the thick skin from the pork, but not trimming off all the fat — leave a thin sheen. Season generously with salt and place in fridge until ready to use — overnight is ideal but a few hours will cut it as well.\nBraise the pork: Heat your oven to 350 degrees. Heat a deep saucepan or Dutch oven over medium-high and add 2 tablespoons of the olive oil. When it shimmers, gently cook the onion, celery and fennel until they begin to soften, about 10 minutes. Add the stock and thyme and bring to a simmer, then season well with salt and pepper.", 
            "Rinse pork to remove excess salt, dry with a paper towel and add to seasoned broth. Cover and place in the oven for 90 minutes or more, until the meat just begins to pull away from the bone.\nAllow both meat and broth to cool in the braise out of the oven for 30 minutes, or until you can touch the meat with your hands. Remove the pork and gently pull the meat from the bone, then tear the chunks into bite-size shreds. Place these in a large bowl.\nStrain the braising liquid, pouring enough of it over the pork to barely cover it and keep it from drying out.", 
            "Pour the rest back into the pot, simmering it until it is reduced by half. Add pork and cooking liquid that has covered it, and warm it back to a simmer. Taste and adjust seasonings, adding more salt and pepper if needed. Add the butter and stir to emulsify.\nBring large pot of well-salted water to boil. Cook pasta until al dente, or usually a minute shy of package directions. Drain and add to the pork ragu, simmering for 1 minute.  Add the lemon juice, half the cheese and parsley, if using. Ladle into wide pasta bowls with and top with arugula and remaining cheese. We enjoyed this with an extra lemon wedge on the side.’\nDo ahead: Should you wish to freeze this — we froze half and I was overjoyed to find it again last month — shred the pork and return it to the reduced cooking liquid, stopping short of the butter; freeze them together in a bag. Once defrosted, rewarm to a simmer, add a splash or two of pasta cooking water if needed to loosen it, and then the butter (this ensures you get the most flavor from it). Add freshly cooked pasta, lemon and parmesan from here."
        ], 
        "date": "2016-10-24T12:26:38+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium head (about 2 to 2 1/4 pounds) cauliflower", 
            "4 tablespoons (55 grams or 2 ounces) unsalted butter", 
            "4 tablespoons (30 grams or 1 ounce) all-purpose flour", 
            "2 teaspoons mustard powder", 
            "Salt, to taste", 
            "Freshly ground black pepper or ground cayenne", 
            "2 cups (475 ml) milk, whole is best but low-fat will probably work just fine", 
            "1 1/4 cups plus 2 tablespoons (about 155 grams or 5 1/2 ounces total) grated cheddar, the strongest you can get, preferably English or Irish", 
            "Chopped chives or flat-leaf parsley, for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-cheese1.jpg?w=640", 
        "tags": [
            "British", 
            "Cauliflower", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/10/cauliflower-cheese/", 
        "title": "cauliflower cheese", 
        "directions": [
            "Heat oven to 400 degrees.", 
            "Trim cauliflower and remove tough core. Cut into 1 to 2-inch florets. Steam (for about 10 minutes) or par-boil (6 to 7 minutes) florets until firm but tender. Drain, if needed, and spread florets on a towel so that it can wick out as much moisture as possible", 
            "Meanwhile, in a medium saucepan, melt butter over medium-high heat. Add flour and whisk to combine; cook for 1 minute to ensure you get rid of the floury taste. Add mustard powder and a pinch of cayenne or few grinds of black pepper, and stir to combine. Drizzle in milk in a thin, steady stream, whisking the whole time so that no lumps form. Season with salt and bring mixture to a simmer, stirring with a spoon; mixture should thicken. Stir in 1 1/4 cups cheddar, a handful at a time, letting each handful melt before adding the next. Taste sauce and adjust seasonings if needed.", 
            "Spread cauliflower florets in a 2-quart baking ovenproof baking dish. Spoon sauce over florets and sprinkle with remaining 2 tablespoons cheese. Bake until until bronzed and bubbly, about 30 minutes. For reference, f I wasn’t in such a rush to get dinner out on the table, I’d have baked mine a minute or two longer, up to 35 minutes.", 
            "Sprinkle with herbs, if desired. Eat with abandon.", 
            "P.S. A hat tip to Kate, who reminded me earlier this week that this site is way overdue for cauliflower cheese, and immediately solving my what-to-make-for-dinner crisis du jour."
        ], 
        "date": "2014-10-23T12:03:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            "Zest and juice of 1 lemon", 
            "3 cloves garlic, minced", 
            "1 1/2 teaspoon kosher salt", 
            "3/4 teaspoon paprika", 
            "1/4 teaspoon hot smoked paprika, plus more to taste", 
            "1 1/2 teaspoons dried oregano, crumbled", 
            "Freshly ground black pepper", 
            "10 boneless, skinless chicken thighs (about 3 pounds)", 
            "2 cups (554 grams) plain, unsweetened Greek yogurt", 
            "1 hothouse, English or seedless cucumber, unpeeled (about 1 pound)", 
            "2 tablespoons freshly squeezed lemon juice", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon minced fresh dill", 
            "2 medium cloves garlic, minced", 
            "1 1/2 teaspoons kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "1 head romaine lettuce, chopped", 
            "1 red onion, thinly sliced", 
            "About 1 pound small-medium tomatoes, chopped", 
            "1 hothouse, English or seedless cucumber, chopped", 
            "4 large pitas (intending 1/2 per person) or more as needed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/chicken-gyro-salad1.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Cucumber", 
            "Greek", 
            "Greens", 
            "Grilling", 
            "Onions", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/05/chicken-gyro-salad/", 
        "title": "chicken gyro salad", 
        "directions": [
            "Prepare the chicken: Combine all ingredients in a large freezer bag. Rub all around, coating chicken as evenly as possible. Let marinate for 20 minutes or up to 24 hours, whatever time you have.\nMake tzatziki: Place the yogurt in a medium bowl. Quarter your cucumber lengthwise and cut out the seeded area. Coarsely grate your cucumber onto a clean dishcloth and wring it out as well as you can. All of that liquid makes for a soggy sauce. Add wrung-out cucumber to yogurt bowl along with lemon, vinegar, dill, garlic, salt and pepper and stir to combine. Taste and adjust seasonings. Chill until needed.\nPrepare salad components: Arrange lettuce, onion, tomatoes and cucumbers on a platter. If desired, toss onion with a squeeze of lemon and/or dash or two of vinegar and salt so that it mellows/lightly pickles while it rests.\nCook chicken: Heat your grill to high heat or a grill pan to medium-high. Remove chicken from marinade and grill on first side until dark lines appear, about 5 minutes, then flip and grill for 3 minutes more on second side. Cooking times will vastly range by the thickness and coldness of your chicken, as well as variations between grills. Transfer cooked chicken to a cutting board, let rest for a couple minutes while you quickly heat/toast your pitas on the grill.\nCut chicken into thin strips. Cut pitas into wedges. Add to platter with vegetables and let everyone dig in. Repeat all summer."
        ], 
        "date": "2016-05-31T12:01:10+00:00"
    }, 
    {
        "ingredient_list": [
            "For pork", 
            "1 pound solid piece boneless pork butt (shoulder) or pork tenderloin", 
            "1/4 cup hoisin sauce", 
            "1/4 cup soy sauce (low-sodium is best here)", 
            "1/4 cup Chinese rice wine or sake", 
            "1 tablespoon finely chopped peeled fresh ginger", 
            "1 teaspoon finely chopped garlic", 
            "1/2 teaspoon salt (see Note below)", 
            "For dressing", 
            "3/4 cup seasoned rice vinegar", 
            "1/2 cup peanut or vegetable oil**", 
            "3 tablespoons fresh lime juice", 
            "3 tablespoons finely grated peeled fresh ginger", 
            "1 large fresh jalapeno chile, seeded and minced", 
            "For salad", 
            "8 oz very thin bean-thread noodles (also known as cellophane, glass, or mung bean noodles)", 
            "3/4 lb Chinese long beans (1 bunch) or green beans, trimmed and cut into 3-inch pieces", 
            "1 seedless cucumber (usually plastic-wrapped; about 1 lb), halved lengthwise and sliced diagonally 1/8 inch thick", 
            "1 bunch scallions, cut into matchsticks", 
            "1 firm-ripe mango, peeled, pitted, and thinly sliced", 
            "2 thin carrots, cut into 1/8-inch-thick matchsticks", 
            "1/2 cup loosely packed fresh cilantro leaves", 
            "1/2 cup loosely packed fresh mint leaves", 
            "1/2 cup loosely packed fresh small basil leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/05/cellophane-noodle-salad-with-roast-pork.jpg?w=753", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Salad", 
            "Vietnamese"
        ], 
        "url": "https://smittenkitchen.com/2007/05/deb-1-mandoline-0/", 
        "title": "cellophane noodle salad with roast pork", 
        "directions": [
            "Prepare pork:  Cut pork along the grain into long 1 1/2- to 2-inch-wide strips. Remove and discard any sinew but do not trim fat. Transfer pork to a large sealable plastic bag. Stir together remaining pork ingredients in a small bowl until combined well. Add to pork and turn to coat, then squeeze bag to eliminate as much air as possible and seal. Marinate pork, chilled, at least 4 hours but no longer than 24.", 
            "Roast pork: Put oven rack in lower third of oven and preheat oven to 375°F. Put 1/2 inch water in a 13- by 9-inch roasting pan and place a metal rack across top of pan (rack should not touch water). ", 
            "Remove pork from marinade, reserving marinade, and arrange pork strips 1 inch apart on rack. Roast in oven 15 minutes.", 
            "Meanwhile, bring marinade to a boil in a 1-quart saucepan, then boil 1 minute (marinade may look curdled). Remove from heat.", 
            "Brush both sides of pork with some marinade and roast 10 minutes more. Generously brush both sides of pork with marinade again and roast, basting 2 or 3 times, 10 minutes more. I recommend brushing it as many times as it takes to use the marinade up; you won’t regret it.", 
            "Increase oven temperature to 400°F and roast pork until strips are mahogany-colored and caramelized on edges, 10 to 15 minutes more (pork shoulder will need the most time, tenderloin the least; totally cooking time will be about 50 minutes). Transfer to a cutting board and let stand, loosely covered with foil, 10 minutes.", 
            "Make dressing while pork roasts:  Blend together all dressing ingredients in a blender until smooth. (See Note below about an alternate dressing.)", 
            "Cook noodles and beans while pork finishes roasting: Soak noodles in cold water to cover until pliable, about 15 minutes, then drain in a colander. Cut noodles in half with kitchen shears.", 
            "Cook beans in a 5- to 6-quart pot of boiling salted water, uncovered, until crisp-tender, 4 to 5 minutes. Transfer with a skimmer or slotted spoon to a large bowl of ice and cold water to stop cooking, reserving cooking liquid in pot. Drain beans and pat dry.", 
            "Return bean-cooking liquid to a boil, then cook noodles, uncovered, stirring occasionally, until just tender, about 2 minutes. Drain noodles in colander and rinse under cold water to stop cooking. Drain noodles again, then spread out on paper towels and pat dry.", 
            "Assemble salad:  Cut as much pork as desired for salad across the grain into 1/4-inch-thick slices. Toss noodles with 1/4 cup dressing in a bowl. Toss long beans with 2 tablespoons dressing in another bowl. Arrange pork, noodles, beans, and remaining salad ingredients on a large platter. Drizzle with some of dressing and serve remaining dressing on the side.", 
            "Many notes (Updated 1/10/14):"
        ], 
        "date": "2007-05-21T12:37:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound salt pork, pancetta or bacon, diced", 
            "1 large onion, finely diced", 
            "3 shallots, chopped", 
            "4 tablespoons butter, as needed", 
            "2 pounds beef chuck, in 1-inch cubes", 
            "2 tablespoons flour", 
            "Salt and freshly ground black pepper", 
            "1/2 cup Cognac (see Note)", 
            "2 cups unsalted beef stock", 
            "1/2 cup smooth Dijon mustard", 
            "4 tablespoons coarse Dijon or Pommery mustard (see Note)", 
            "4 medium carrots, peeled and cut into half-moon slices", 
            "1/2 pound mushrooms, stemmed, cleaned and quartered", 
            "1/4 cup red wine (see Note)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/dijon-and-cognac-beef-stew.jpg?w=750", 
        "tags": [
            "Beef", 
            "Date Night", 
            "French", 
            "Photo", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/02/dijon-and-cognac-beef-stew/", 
        "title": "dijon and cognac beef stew", 
        "directions": [
            "Place salt pork in a Dutch oven or a large heavy kettle over low heat, and cook until fat is rendered. Remove solid pieces with a slotted spoon, and save for another use, like your salad, vegetables or, uh, snacking. Raise heat to medium-low, and add onion and shallots. Cook until softened but not browned, about 10 to 15 minutes. Use a slotted spoon to transfer to a large bowl.", 
            "If necessary, add 2 tablespoons butter to the pan to augment fat. Dust beef cubes with flour, and season lightly with salt and more generously with pepper. Shake off excess flour, and place half the cubes in the pan. Cook over medium-high heat until well browned, almost crusty, on all sides, then transfer to a bowl with onions. Repeat with remaining beef.", 
            "Add Cognac to the empty pan, and cook, stirring, until the bottom is deglazed and any crusted-on bits come loose. Add stock, smooth Dijon mustard and 1 tablespoon coarse or Pommery mustard. Whisk to blend, then return meat and onion mixture to pan. Lower heat, cover pan partway, and simmer gently until meat is very tender, about 1 1/4 hours.", 
            "Add carrots, and continue simmering for 40 minutes, or until slices are tender. As they cook, heat 2 tablespoons butter in medium skillet over medium-high heat, and sauté mushrooms until browned and tender. Stir mushrooms into stew along with remaining mustard and red wine. Simmer 5 minutes, then taste, and adjust seasoning. Serve hot."
        ], 
        "date": "2014-02-24T12:16:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds small (I used Manila) clams", 
            "2 thick slices country or sourdough bread", 
            "1/2 tablespoon olive oil to brush bread (optional)", 
            "2 tablespoons butter", 
            "2 cloves garlic, thinly sliced or minced", 
            "1 large or 2 small shallots, minced or 1/4 cup minced white onion", 
            "Salt and red pepper flakes", 
            "1/2 cup dry white wine", 
            "1 tablespoon chopped fresh herbs — parsley, cilantro, chives or a mix", 
            "1 lemon, in wedges"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/garlic-wine-and-butter-steamed-clams.jpg?w=750", 
        "tags": [
            "Budget", 
            "Date Night", 
            "Photo", 
            "Portuguese", 
            "Quick", 
            "Seafood", 
            "Summer", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/09/garlic-wine-and-butter-steamed-clams/", 
        "title": "garlic wine and butter steamed clams", 
        "directions": [
            "If you think your clams may not be clean, wash them first: Fill a large bowl with cool tap water and place the clams in it. Let them soak for 20 minutes during which they’ll expel any sand and grit.", 
            "While they’re soaking, grill or broil your bread: Dab both sides lightly with olive oil, if using, and grill or broil until well-toasted on both sides.", 
            "Lightly scrub your clams. Discard any with chipped shells.", 
            "In a large saute pan with a lid, melt butter and add garlic, shallots, salt and pepper flakes. Cook for 1 to 2 minutes over medium-high. Add wine — and as soon as it simmers, add all the clams and cover with a lid. In three minutes, almost all should be wide open; discard any that do not open. Transfer to a bowl and ladle cooking liquid over. Scatter with herbs and serve with grilled bread and lemon."
        ], 
        "date": "2016-09-20T11:58:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 a large, seedless English cucumber (about 6 to 7 ounces), chopped", 
            "1/2 a green bell pepper, chopped", 
            "1 cup (about 6 ounces) cherry or grape tomatoes, halved", 
            "1/4 cup kalamata olives (you can also serve these alongside)", 
            "1/4 small red onion, thinly sliced", 
            "1 lemon, halved", 
            "2 to 3 ounces feta (Bulgarian or French, if you can find them, are my favorites), in thick slices", 
            "2 tablespoons olive oil, or more to taste", 
            "Salt and freshly ground black pepper", 
            "1 sprig oregano, leaves minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/greek-salad-with-lemon-and-oregano.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Greek", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/05/greek-salad-with-lemon-and-oregano/", 
        "title": "greek salad with lemon and oregano", 
        "directions": [
            "Toss cucumbers, pepper, tomatoes, olives (if using) and onion in a shallow bowl or deep plate. Squeeze half a lemon over it. Arrange feta slices on top. Drizzle with olive oil, sprinkle with salt, pepper and oregano. Serve with a slice of feta on top of each serving, and the second half of the lemon for those that like their salads punchier.", 
            "* If you’re concerned about the pungency of the raw onion, you can squeeze the lemon juice on top of it and let it sit for a while in a dish before adding both to the salad. It will mellow and soften it.   "
        ], 
        "date": "2013-05-21T13:27:21+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound plain yogurt (regular or lowfat)", 
            "1/4 cup olive oil, plus more for brushing grill", 
            "1 teaspoon lemon zest", 
            "1/4 cup freshly squeezed lemon juice (2 lemons)", 
            "5 tablespoons fresh whole rosemary leaves, chopped", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "2 pounds top round lamb", 
            "1 red onion", 
            "14 ounces Greek yogurt (Ina recommends Fage Total; I recommend whatever you like best, and yes, I use full fat, always)", 
            "1 hothouse cucumber, unpeeled and seeded", 
            "1/4 cup sour cream", 
            "2 tablespoons freshly squeezed lemon juice", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon minced fresh dill", 
            "1 1/2 teaspoons minced garlic", 
            "2 teaspoons kosher salt", 
            "1/2 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/grilled-lamb-kebabs-tzatziki1.jpg?w=500", 
        "tags": [
            "Cucumber", 
            "Date Night", 
            "Greek", 
            "Grilling", 
            "Meat", 
            "Photo", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2009/09/grilled-lamb-kebabs-tzatziki/", 
        "title": "grilled lamb kebabs + tzatziki", 
        "directions": [
            "Place the yogurt in a medium bowl. Grate the cucumber on a box grater (or in your food processor, if you like to get things done in one hundreth of the time!) and squeeze the grated cucumber with your hand to remove some of the liquid. (Pressing it in mesh sieve with a spoon to extract the extra water or wringing it in cheesecloth also work well.) Add it to the yogurt along with the sour cream, lemon juice, vinegar, dill, garlic, salt and pepper and stir. Serve with grilled pita wedges."
        ], 
        "date": "2009-09-14T17:35:40+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds boneless pork shoulder or pork butt, cut into 2-inch cubes", 
            "1/2 cup orange juice", 
            "1/4 cup lime juice (from about 2 to 3 limes)", 
            "4 cloves garlic, peeled and crushed", 
            "1 teaspoon ground cumin", 
            "1 teaspoon Kosher salt, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/11/homesick-texan-carnitas.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2011/11/homesick-texan-carnitas/", 
        "title": "homesick texan carnitas", 
        "directions": [
            "Place the pork in a large Dutch oven or heavy pot. Add the orange juice, lime juice, garlic, cumin, salt and enough water to just barely cover the meat. Bring the pot to a boil and then reduce the heat to a simmer. Simmer uncovered for two hours. Don’t touch the meat.", 
            "After two hours, increase the heat to medium-high and while occasionally stirring and turning the pieces, continue to cook for about 45 minutes, or until all of the liquid has evaporated, leaving only the rendered pork fat. Let it sizzle in this fat long enough to brown at the edges, turning pieces gently (they’ll be eager to fall apart), only as needed.", 
            "When pork has browned on both sides, it’s ready. Adjust seasonings to taste and serve on warmed tortillas with fixings. "
        ], 
        "date": "2011-11-04T11:09:19+00:00"
    }, 
    {
        "ingredient_list": [
            "Meatballs", 
            "3 to 8 tablespoons water", 
            "2 pounds ground lamb", 
            "1 large egg", 
            "1 1/4 cup (about 70 grams) breadcrumbs, fresh or plain, such as Panko", 
            "1/2 cup (55 grams) crumbled feta cheese", 
            "3/4 teaspoon table salt", 
            "Pinch of red pepper flakes", 
            "2 small garlic cloves, minced", 
            "3 tablespoons chopped parsley", 
            "2 tablespoons (35 grams) tomato paste", 
            "Zest of half a lemon", 
            "2 tablespoons olive oil", 
            "Sauce", 
            "1 medium onion, finely chopped", 
            "1 garlic clove, minced", 
            "A couple glugs of red wine or white/dry vermouth (optional)", 
            "1 28-ounce (795 grams) can of crushed or pureed tomatoes", 
            "1 teaspoon dried oregano", 
            "Zest of half a lemon", 
            "3/4 to 1 teaspoon table salt", 
            "Pinches of red pepper flakes (to taste)", 
            "1/3 cup (about 45 grams) pitted, chopped kalamata olives", 
            "1 tablespoon thinly sliced mint leaves, plus more for garnish", 
            "2 tablespoons roughly chopped parsley, plus more for garnish", 
            "Juice of one lemon", 
            "1/4 cup (30 grams) crumbled feta, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/lamb-meatballs-with-feta-and-lemon1.jpg?w=640", 
        "tags": [
            "Greek", 
            "Meat", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/04/lamb-meatballs-with-feta-and-lemon/", 
        "title": "lamb meatballs with feta and lemon", 
        "directions": [
            "Make meatballs: If you plan don’t plan to brown the meatballs, use only 3 tablespoons water. If you do, use all 8 tablespoons (1/2 cup). In a large bowl, combine all meatball ingredients except oil; I like to do this with a fork. Using wet hands, form mixture into small (1 1/2 to 2-inch diameter) meatballs; I have taken to using a large (just shy of 3 tablespoon) cookie scoop for easy sizing. ", 
            "Brown meatballs: Heat a large skillet over medium heat. Add olive oil and heat it through. Evenly space meatballs in pan and very carefully turn and roll them so that all sides become brown. Don’t worry if they don’t remain perfectly round; mine never do. Don’t worry if some pieces become stuck to the pan; they will deliciously infuse the sauce in a minute. Drain meatballs on a paper towel-lined plate.", 
            "[If you prefer not to fry your meatballs before cooking them in the sauce, you can cook them right in the sauce — it will take about 10 minutes longer.]", 
            "Make sauce and finish cooking meatballs: Pour out all but 1 tablespoon fat from skillet and return to medium heat. Add onion and garlic and cook until they begin to soften, about 5 minutes. Add wine or vermouth and scrape up any bits stuck to the pan. Cook until the liquid almost disappears. Add tomatoes, oregano, lemon zest, salt, pepper flakes, olives (if you’re using them now), mint and parsley. Bring mixture to a simmer and return meatballs to the pan. Cover with a lid and cook at the lowest simmer for 20 to 24 minutes, until meatballs are cooked through. Squeeze lemon juice over meatballs and sauce.", 
            "Serve: Sprinkled with additional olives, feta and herbs. We had this with orzo and a Greek salad. ", 
            "In a pressure cooker: I made these on the stove, but as they were riffed from a pressure cooker recipe (from the wonderful Lorna Sass, no less), it would be rude not to add her approach, which is to chop everything more coarsely (the pressure cooking will break down the bigger chunks for you), make the sauce directly in a pressure cooker as described above and drop the meatballs in to cook them without browning them first. Once at high pressure, she recommends cooking them for 5 minutes. More here."
        ], 
        "date": "2014-04-29T12:40:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup olive oil, divided", 
            "4 large links of sweet Italian sausage, casings removed (I used half of this, preferring the sausage to not dominate the soup’s flavor [update] and from the comments, it sounds like most of you preferred it with just 2 links as well)", 
            "1 medium onion, diced", 
            "2 celery stalks, sliced or diced", 
            "2 medium carrots, peeled and sliced into half-moons or diced", 
            "4 cloves garlic, sliced (reserve half for later in recipe)", 
            "Kosher salt", 
            "A pinch of crushed red pepper flakes (optional)", 
            "1 cup brown lentils, sorted and rinsed", 
            "2 bay leaves", 
            "1 28-ounce can crushed tomatoes", 
            "6 cups water", 
            "Freshly ground black pepper", 
            "3 to 4 cups shredded or thinly ribboned Swiss chard leaves or kale", 
            "Grated Pecorino Romano cheese to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/01/lentil-soup-with-sausage-chard-and-garlic.jpg?w=750", 
        "tags": [
            "Beans", 
            "Date Night", 
            "Photo", 
            "Soup", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2013/01/lentil-soup-with-sausage-chard-and-garlic/", 
        "title": "lentil soup with sausage, chard and garlic", 
        "directions": [
            "Heat 1/4 cup olive oil (enough to coat bottom of pot) in a large pot on medium heat. When hot, add the sausage, breaking it up with a wooden spoon until it starts to brown, about five minutes. Add the onion, celery, carrots, first two garlic cloves, a pinch of salt, and if you like your soup spicy, a pinch of red pepper flakes. Cook with the sausage until the vegetables soften a bit, another 5 minutes. Add the lentils, bay leaves, tomatoes, water (6 cups is, conveniently, a little less than 2 empty 28-ounce cans, so you can get any tomato pulp you missed), more salt and black pepper to taste. Bring to a simmer and allow to cook until the lentils are tender, about 40 minutes. (It might be necessary to add more water if the soup gets too thick, though we preferred ours on the thick side.)", 
            "When the lentils are cooked, add the chard and cook until the leaves are tender, just a few minutes more. Discard the bay leaves. ", 
            "To finish, divide soup among bowls, then add the remaining 1/4 cup olive oil and 2 garlic cloves to a small skillet and heat over medium until the garlic softens and hisses. Drizzle this over soup bowls, and top with fresh Romano, passing more at the table. Leftovers will keep for several days in the fridge."
        ], 
        "date": "2013-01-22T11:36:49+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive oil", 
            "2 tablespoons butter, softened", 
            "2 pounds portobello mushrooms, in 1/4-inch slices (save the stems for another use) (you can use cremini instead, as well)", 
            "1/2 carrot, finely diced", 
            "1 small yellow onion, finely diced", 
            "2 cloves garlic, minced", 
            "1 cup full-bodied red wine", 
            "2 cups beef or vegetable broth (beef broth is traditional but vegetable to make it vegetarian; it works with either)", 
            "2 tablespoons tomato paste", 
            "1 teaspoon fresh thyme leaves (1/2 teaspoon dried)", 
            "1 1/2 tablespoons all-purpose flour", 
            "1 cup pearl onions, peeled (thawed if frozen)", 
            "Egg noodles, for serving", 
            "Sour cream and chopped chives or parsley, for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/mushroom-bourguignon-e1477582482731.jpg?w=625", 
        "tags": [
            "Date Night", 
            "Elsewhere", 
            "Freezer Friendly", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2009/01/mushroom-bourguignon/", 
        "title": "mushroom bourguignon", 
        "directions": [
            "Heat the one tablespoon of the olive oil and one tablespoon of butter in a medium Dutch oven or heavy sauce pan over high heat. Sear the mushrooms until they begin to darken, but not yet release any liquid — about three or four minutes. Remove them from pan.", 
            "Lower the flame to medium and add the second tablespoon of olive oil. Toss the carrots, onions, thyme, a few good pinches of salt and a several grinds of black pepper into the pan and cook for 10, stirring occasionally, until the onions are lightly browned. Add the garlic and cook for just one more minute. ", 
            "Add the wine to the pot, scraping any stuck bits off the bottom, then turn the heat all the way up and reduce it by half. Stir in the tomato paste and the broth. Add back the mushrooms with any juices that have collected and once the liquid has boiled, reduce the temperature so it simmers for 20 minutes, or until mushrooms are very tender. Add the pearl onions and simmer for five minutes more.", 
            "Combine remaining butter and the flour with a fork until combined; stir it into the stew. Lower the heat and simmer for 10  more minutes. If the sauce is too thin, boil it down to reduce to the right consistency. Season to taste.", 
            "To serve, spoon the stew over a bowl of egg noodles, dollop with sour cream (optional) and sprinkle with chives or parsley."
        ], 
        "date": "2009-01-15T15:48:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound (8 ounces or 225 grams) pasta of you choice, such as a ziti or twisty shape", 
            "1 tablespoon (15 ml) olive oil", 
            "3/4 pounds (340 grams) fresh mushroom, sliced (I used pre-sliced cremini, my new favorite thing)", 
            "1 small-to-medium yellow onion, halved and sliced thin", 
            "Salt and freshly ground black pepper to taste", 
            "1/4 cup (60 ml) dry marsala wine (see notes at end for more information)", 
            "3 tablespoons (45 grams) unsalted butter", 
            "3 tablespoons (25 grams) all-purpose flour", 
            "1 1/2 cups (355 ml) stock or broth (chicken, vegetable or mushroom)", 
            "1/2 cup (50 grams) finely grated parmesan cheese", 
            "4 ounces (115 grams) mozzarella, cut into small cubes", 
            "3 tablespoons chopped fresh flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/mushroom-marsala-pasta-bake1.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Date Night", 
            "Freezer Friendly", 
            "Mushrooms", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/01/mushroom-marsala-pasta-bake/", 
        "title": "mushroom marsala pasta bake", 
        "directions": [
            "A tip: If we play our cards right here, this can be made entirely in one dish. I used a 4-quart Staub braiser (Happy Hanukah to me!) but any 3-to-4 quart stovetop-to-oven type dish will work.", 
            "Cook the pasta: Bring a pot of well-salted water to a boil. Add pasta and cook until al dente, about 1 to 2 minutes before perfect doneness. Drain and set aside.", 
            "Heat oven: To 400 degrees.", 
            "Make the sauce: Reheat your empty pasta pot over high heat. Add oil and once it is hot, add mushrooms and cook until they’ve begun to brown and glisten, but have not yet released their liquid. Reduce heat to medium-high, add onions, salt and pepper and saute together until the liquid the mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until it has almost or fully evaporated (depending on your preference). Add butter, stir until melted. Add flour, and stir until all has been dampened and absorbed. Add stock, a very small splash at a time, stirring the whole time with a spoon. Make sure each splash has been fully mixed into the butter/flour/mushroom mixture, scraping from the bottom of the pan and all around, before adding the next splash. Repeat until all stock has been added. Let mixture simmer together for 2 minutes, stirring frequently; the sauce will thicken. Remove pan from heat.", 
            "Assemble and bake dish: If you’re cooking in an ovensafe dish, add cooked pasta and stir until combined. (If you’re not cooking in an ovensafe dish, transfer this mixture to a 2-quart baking dish.) Stir in half the parmesan, all of the mozzarella and two tablespoons of the parsley until evenly mixed. Sprinkle the top with remaining parmesan. Bake for 25 to 30 minutes, until edges of pasta are golden brown and irresistible. Sprinkle with reserved parsley and serve hot. Reheat as needed.", 
            "A bunch of notes: "
        ], 
        "date": "2015-01-12T12:03:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1 28-ounce can whole tomatoes", 
            "1 (3 to 3 1/2 pound) boneless beef chuck roast, tied with a string", 
            "1 head garlic, separated into cloves, left unpeeled"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic1.jpg?w=750", 
        "tags": [
            "Beef", 
            "Budget", 
            "Date Night", 
            "Gluten-Free", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic/", 
        "title": "oven-braised beef with tomatoes and garlic", 
        "directions": [
            "Heat oven to 300°F (150°C). Coarsely chop tomatoes with their juice in a food processor (Gourmet’s suggestion) or go at them in their can with kitchen shears (my lazy preference) to break them up. Put roast in an ovenproof 4- to 5-quart heavy pot or a casserole dish with a lid — a tight fit is just fine, as it will shrink very soon. Pour tomatoes over roast and scatter garlic around it. Season generously with salt and pepper. Braise in middle of oven, covered, until very tender, 3 to 4 hours. Cut roast into 1/4-inch-thick slices and serve with sauce, garlic, squeezed from its peels (or you can leave others to do this) and orzo (Gourmet’s suggestion, of course not gluten-free), mashed potatoes (recipe at the end) or crusty bread. Leftovers shredded over egg noodles sound wonderful as well.", 
            "Do ahead: Like almost all braises, this is even better on the second day, which means it’s a dream of a dinner party dish. Let it cool to room temperature, then chill it in the fridge until needed. Defat the sauce before warming (it will be a cinch once solidified on top) and rewarm at 300 for 30 to 45 minutes. ", 
            "Notes:"
        ], 
        "date": "2015-02-09T11:59:10+00:00"
    }, 
    {
        "ingredient_list": [
            "2 to 3 tablespoons olive oil", 
            "Coarse or Kosher salt", 
            "6 medium-to-large (mine were 3 inches across, averaged 8 1/4 ounces in weight) tomatoes", 
            "Red pepper flakes, to taste", 
            "1/4 medium or 1/2 small onion, finely chopped", 
            "1 garlic clove, minced", 
            "9 tablespoons arborio or another short-grained starchy rice", 
            "Few tablespoons chopped parsley, oregano or slivered basil (or mix thereof)", 
            "Handful breadcrumbs, if using (unless using gluten-free breadcrumbs, this will of course negate the dish’s gluten-free status)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/rice-stuffed-tomatoes.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Gluten-Free", 
            "Grain/Rice", 
            "Italian", 
            "Photo", 
            "Summer", 
            "Tomatoes", 
            "Vegan", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/08/rice-stuffed-tomatoes/", 
        "title": "rice-stuffed tomatoes", 
        "directions": [
            "Heat oven to 350 degrees. Lightly coat an ovenproof baking dish with olive oil. ", 
            "Prepare tomatoes: Cut the tops off the tomatoes and scoop out tomato juices, seeds and flesh into a non-reactive (i.e. just about anything but aluminum) bowl. I like to use a grapefruit knife to make the first cuts, then a spoon to remove the rest, but you can use anything you have around, being careful not to pierce the bottom of the tomatoes. Salt the cavities of the tomatoes and turn them upside down on a plate to drain.", 
            "Prepare reserve: Run scooped-out tomato flesh and juices through a food mill or pulse in a blender until coarsely pureed. Heat a large skillet over medium heat, then add 2 tablespoons olive oil, heating it too. Once hot, add onion, garlic and red pepper flakes, cooking them together for 2 minutes, or until onion begins to soften. Add rice and cook them together for about 3 minutes, or until rice toasts a little. Add tomato puree and bring to a simmer, then reduce heat to medium-low. Season with 3/4 teaspoon salt, then cover skillet with a lid, and let simmer for 10 to 15 minutes, stirring occasionally, until rice is par-cooked. Adjust seasoning if needed.", 
            "[If using the potatoes, as mentioned in the Notes up top, prepare them while the rice simmers.]", 
            "Reassemble tomatoes: Stir fresh herbs into tomato-rice mixture. Arrange tomatoes right-side-up in baking pan then spoon mixture into tomatoes, filling them just 7/8 of the way to leave room for the rice to finish expanding. Coat with breadcrumbs that you can drizzle lightly with olive oil, if using, or you can replace the tomato lid on each (though, do not spend 10 minutes trying to match them back up, as I did last summer. It’s pointless.)", 
            "Bake: Uncovered for 30 minutes, until tomato walls are soft and the rice inside has finished cooking. Serve hot. Repeat again tomorrow."
        ], 
        "date": "2013-08-19T12:05:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound skirt steak, trimmed of excess fat if necessary, halved crosswise, at room temperature", 
            "1 to 2 tablespoons olive oil", 
            "1 pint (2 cups) cherry tomatoes, halved", 
            "1/2 cup (about 4 ounces) crumbled blue cheese", 
            "1/2 pound baby arugula", 
            "Vinaigrette (below)", 
            "3 tablespoons minced chives, 2 thinly sliced scallions or 3 tablespoons finely chopped red onion, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/09/skirt-steak-salad-with-blue-cheese.jpg?w=749", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Salad", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/09/skirt-steak-salad-with-arugula-and-blue-cheese/", 
        "title": "skirt steak salad with blue cheese", 
        "directions": [
            "Whisk ingredients. Season with salt and pepper and adjust ingredients to taste (usually more Dijon and vinegar for me)."
        ], 
        "date": "2010-09-17T13:41:24+00:00"
    }, 
    {
        "ingredient_list": [
            "24 ladyfingers (savioardi) cookies (storebought or from recipe below)", 
            "3 large eggs, separated", 
            "1/3 cup (65 grams) plus 1 tablespoon (13 grams) granulated sugar, divided", 
            "1 8.8-ounce (250 ml) package mascarpone", 
            "1/3 cup (80 ml) sweet or dry marsala", 
            "1 cup (235 ml) strong, warm espresso coffee", 
            "A couple tablespoons of your favorite cocoa powder, for sifting over"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/small-batch-tiramisu.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Italian", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2017/02/small-batch-tiramisu/", 
        "title": "small batch tiramisu", 
        "directions": [
            "In a medium bowl, beat egg whites until stiff.", 
            "In a larger bowl, using same beaters, beat egg yolks and 1/3 cup sugar until thick and pale yellow, 3 to 4 minutes. Beat in mascarpone cheese until combined, and continue beating another minute for extra fluff. Beat in marsala until smooth. Gently fold in egg whites until combined, trying not to deflate the mixture. It will be a loose, soft, creamy custard.", 
            "In a small bowl wide enough to dip cookies into, combine the espresso and 1 tablespoon sugar. Set aside.\nTo assemble small cups: Dip first cookie in espresso mixture until almost fully saturated but not falling apart. Break in half and place the first half in the bottom of your cup. Spoon 1 generous (I use a measuring spoon, but heaped a little) tablespoon cream over it. Repeat with second half of first biscuit and another spoonful of cream. Dust with cocoa powder. Dip second cookie in coffee and break in half. Place side-by-side over cocoa then top with 2 generous tablespoons cream mixture, which should take you nearly to the top of the cup. Dust with more cocoa. Repeat with remaining cups.\nTo assemble large cups: Dip first cookie in espresso mixture until almost fully saturated but not falling apart. Break in half and place side-by-side in the bottom of your larger cup. Spoon 2 generous tablespoons (I use a measuring spoon, but heaped a little) cream over and dust with cocoa powder. Dip two biscuits in espresso mixture and break in half. Place 3 of the halves on top of the cocoa powder, cover with another 2 generous tablespoons of cream and cocoa powder. Dip a 4th biscuit in the espresso mixture, break it in half, and place these two halves plus the leftover half from the previous layer on top of the cocoa. Dollop more cream over and repeat with remaining cups.\nIf you can bear it, let cups chill in fridge overnight to set. Before eating, you can dust them with fresh cocoa powder for a prettier look.", 
            ""
        ], 
        "date": "2017-02-13T13:02:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup olive oil", 
            "1 pound dried spaghetti", 
            "2 tablespoons butter", 
            "4 ounces Pecorino Romano cheese, finely grated", 
            "1 1/2 teaspoon finely ground black pepper", 
            "Salt (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaghetti-cacio-e-pepe1.jpg?w=500", 
        "tags": [
            "Date Night", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/02/spaghetti-cacio-e-pepe/", 
        "title": "spaghetti with cheese + black pepper", 
        "directions": [
            "Cook spaghetti in well-salted water to your al dente tastes in a large, wide-bottomed pot. (You’ll have fewer dishes to wash if you use this pot to assemble the dish as well.) Drain spaghetti, reserving 1 1/2 cups of pasta cooking water.", 
            "Dry out your pot, then heat the olive oil over high heat until almost smoking. Add drained spaghetti and 1 cup of reserved pasta water and jump back, this will splatter mightily, also known as “I made this three times, and never once learned my lesson. Do as I say, not as I do.”", 
            "Add butter, 3 ounces cheese and ground pepper and toss together with tongs. Taste, adding more pasta water, cheese, pepper or salt (which should not be neccessary, as Romano is very salty) to taste.", 
            "Serve immediately, sprinkling with reserved cheese and an extra grind or two of black pepper."
        ], 
        "date": "2010-02-12T11:09:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound spaghetti or linguine", 
            "Salt", 
            "3 lemons", 
            "1/4 cup extra virgin olive oil , plus additional for serving", 
            "1/4 cup heavy cream", 
            "1 ounce finely grated Parmesan cheese (about 1/2 cup), plus additional for serving", 
            "Ground black pepper", 
            "Small handful fresh basil or arugula (what I used, deliciously, in a pinch) leaves, shredded"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaghetti-with-lemon-and-olive-oil-al-limone1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Date Night", 
            "Italian", 
            "Lemon", 
            "Pasta", 
            "Photo", 
            "Travel", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/02/spaghetti-with-lemon-and-olive-oil-al-limone/", 
        "title": "spaghetti with lemon and olive oil", 
        "directions": [
            "Cook linguine or spaghetti in well-salted water to your al dente tastes in a large, wide-bottomed pot. (You’ll have fewer dishes to wash if you use this pot to assemble the dish as well.) ", 
            "While pasta is cooking, zest lemons until you have a little shy of a tablespoon of zest. Juice lemons — you’ll have anywhere from 1/3 to 1/2 cup lemon juice.  ", 
            "Drain pasta, reserving 1 1/2 cups of pasta cooking water. Dry out your pot, then boil the olive oil, cream, zest and 1 cup of the reserved pasta water together for two minutes over high heat.  Return pasta to pot and stir until coated. Add the cheese and 1/4 cup lemon juice and toss, toss, toss everything together. Add more pasta water, 1/4 cup at a time, if you’d like your dish a little looser. Quickly taste a strand of pasta and see if you want to add the remaining lemon juice (we did). Stir in basil or arugula and season generously with salt and pepper. ", 
            "Serve immediately, drizzling individual portions with a bit of extra olive oil and sprinkling with extra Parmesan cheese."
        ], 
        "date": "2011-02-24T12:00:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (12-ounce) 1-inch thick New York strip boneless beef top loin steak", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "Olive oil", 
            "2 yellow onions, sliced in rings", 
            "1/2 teaspoon fresh thyme leaves", 
            "Mustard Mayo, recipe follows", 
            "2 mini focaccia buns, sliced in 1/2 (we used a small ciabatta)", 
            "1/2 cup baby arugula", 
            "1/3 cup good mayonnaise", 
            "2 tablespoons Dijon mustard", 
            "1 tablespoon whole-grain mustard", 
            "2 tablespoons sour cream", 
            "1/8 teaspoon kosher salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/steak-sandwiches1.jpg?w=500", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Picnics", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2009/02/steak-sandwiches/", 
        "title": "steak sandwiches", 
        "directions": [
            "Whisk the ingredients together in a small bowl. Serve at room temperature."
        ], 
        "date": "2009-02-28T17:00:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 ounce dried mushrooms (porcini, morels, or shitakes)", 
            "1/2 cup olive oil", 
            "2 sprigs of rosemary", 
            "4 sprigs of sage", 
            "1 large yellow onion, peeled and thinly sliced", 
            "3 garlic cloves, peeled and thinly sliced", 
            "1 1/2 teaspoons salt", 
            "1/4 tsp freshly ground white pepper", 
            "1 pound white button mushrooms, cleaned and thinly sliced", 
            "1 pound shitake mushrooms stemmed, cleaned and thinly sliced", 
            "6 cups chicken stock or water", 
            "1 cup heavy cream", 
            "2 tablespoons unsalted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/01/balthazars-cream-of-mushroom-soup.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Gluten-Free", 
            "Mushrooms", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2007/01/superlatively-souper/", 
        "title": "balthazar’s cream of mushroom soup", 
        "directions": [
            "1.\tSoak the dry mushrooms in 1 cup of warm water for 20 to 30 minutes, until plump.", 
            "2.\tStrain the soaking liquid through a coffee filter to remove grit and reserve, along with the reconstituted mushrooms, until needed.", 
            "3.\tHeat the olive oil in a large pot over a medium flame. Bundle the rosemary and sage together and tie with kitchen twine.  When the oil is hot, add the herb bundle and sizzle for a few minutes on both sides to infuse the oil.", 
            "4.\tAdd the onion, garlic, salt and pepper and cook for 5 minutes, until the onion is soft and translucent but not brown.", 
            "5.\tTurn the flame to high and add the white mushrooms and shitakes.", 
            "6.\tCook for 10 minutes, during which the mushrooms will give off their liquid (which should evaporate quickly due to the high heat) and deflate significantly. Stir occasionally.", 
            "7.\tAdd the chicken stock and the dried mushrooms along with the soaking water.", 
            "8.\tSimmer for 30 minutes. Remove the herbs, then add the cream and butter. Working in batches, puree the soup in a blender until smooth. Return to the pot and keep at a very low simmer until ready to serve.", 
            "Deb adjustments: I used far less olive oil, replaced some of the chicken stock with beef, as I had it on hand and love mixing that flavor with mushrooms; half as much cream, preferring a more potent soup and thyme instead of rosemary, also due to personal preference."
        ], 
        "date": "2007-01-04T14:38:10+00:00"
    }, 
    {
        "ingredient_list": [
            "28 ounces (800 grams) whole peeled tomatoes from a can (San Marzano, if you can find them)*", 
            "5 tablespoons (70 grams) unsalted butter", 
            "1 medium-sized yellow onion, peeled and halved", 
            "Salt to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/tomato-sauce-with-butter-and-onion.jpg?w=753", 
        "tags": [
            "Budget", 
            "Date Night", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/01/tomato-sauce-with-butter-and-onions/", 
        "title": "tomato sauce with onion and butter", 
        "directions": [
            "Put the tomatoes, onion and butter in a heavy saucepan (it fit just right in a 3-quart) over medium heat. Bring the sauce to a simmer then lower the heat to keep the sauce at a slow, steady simmer for about 45 minutes, or until droplets of fat float free of the tomatoes. Stir occasionally, crushing the tomatoes against the side of the pot with a wooden spoon. Remove from heat, discard the onion, add salt to taste (you might find, as I did, that your tomatoes came salted and that you didn’t need to add more) and keep warm while you prepare your pasta.", 
            "Serve with spaghetti, with or without grated parmesan cheese to pass.", 
            "* I liked this enough to make us more the next day, but I only had a can of tomato puree. It also worked well, despite having slightly less texture. You will need a little less simmering time as the tomatoes are already broken down."
        ], 
        "date": "2010-01-17T13:36:23+00:00"
    }, 
    {
        "ingredient_list": [
            "2 ounces (4 tablespoons) vodka", 
            "1 1/2 ounces (3 tablespoons) coffee liqueur (such as kahlua or tia maria)", 
            "1 1/2 ounces (3 tablespoons) half-and-half or 1 ounce (2 tablespoons) milk plus 1/2 ounce (1 tablespoon) heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/white-russian1.jpg?w=640", 
        "tags": [
            "Date Night", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/02/white-russian/", 
        "title": "white russian", 
        "directions": [
            "Fill a short — or rocks — glass with ice. Add vodka and coffee liqueur. Finish with the cream. For the layered effect, pour the cream in a very slow drizzle off the back of a spoon held over — but not touching — the surface of the drink. To swirl it prettily, insert a stirrer along the inner wall of the glass only as a deep as the cream and move it around in a slow circle."
        ], 
        "date": "2016-02-19T12:01:37+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/zuni-cafe-roast-chicken-bread-salad1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Date Night", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/12/zuni-cafe-roast-chicken-bread-salad/", 
        "title": "zuni cafe’s roasted chicken + bread salad", 
        "directions": [
            "Preheat the broiler. Carve off all of the bottom and most of the top and side crusts from your bread (you can reserve these to use as croutons for soup or another salad). Tear bread into irregular 2- to 3-inch chunks, wads, bite-sized bits and fat crumbs. You should get about 4 cups.", 
            "Toss them with just a tablespoon or two of olive oil, lightly coating them, and broil them very briefly, just to lightly color the edges. If you’d like to toast the pine nuts (recommended) you can put them on your broiler tray as well, but watch them very carefully — they cook quickly!", 
            "Combine about 1/4 cup of the olive oil with the Champagne or white wine vinegar and salt and pepper to taste. Toss about 1/4 cup of this tart vinaigrette with the torn bread in a wide salad bowl; the bread will be unevenly dressed. Taste one of the more saturated pieces. If it is bland, add a little salt and pepper and toss again.", 
            "Heat a spoonful of the olive oil in a small skillet, add the garlic and scallions, and cook over medium-low heat, stirring constantly, until softened. Don’t let them color. Scrape into the bread and fold to combine. Drain the plumped currants and fold them in, along with the pine nuts, if they were not already mixed with the bread scraps from the broiling step. Dribble the chicken stock or lightly salted water over the salad and fold again.", 
            "Taste a few pieces of bread — a fairly saturated one and a dryish one. If it is bland, add salt, pepper, and/or a few drops of vinegar, then toss well.", 
            "If you’re going to serve the salad under the roast chicken (recipe above), you can pile the bread salad on the serving dish you want to use and tent it with foil. If you want to serve it separately, do the same, but in a 1-quart shallow baking dish. Hang onto the bowl you mixed it in — you’ll use it again.", 
            "Place the salad in the oven after you flip the chicken the final time, for about 5 to 10 minutes.", 
            "Tip the bread salad back into the salad bowl. It will be steamy-hot, a mixture of soft, moist wads, crispy-on-the-outside-but-moist-in-the-middle-wads, and a few downright crispy ones. Drizzle and toss with a spoonful of the pan juices. Add the greens, a drizzle of vinaigrette, and fold well. Taste again."
        ], 
        "date": "2008-12-10T14:30:48+00:00"
    }
]