{
  "date": "2007-04-05T14:44:47+00:00",
  "directions": [
    "Prepare your artichokes: Peel the toughest, smallest and greenest outer leaves off and discard them. Once you reach the first of the yellow leaves, of moderate thickness, you’re good. Leaving half to one full inch of the yellow leaves attached to the stem, cut the remainder off in one clean cut. Now, start scooping, with a small paring knife and a small spoon (a grapefruit one works great here). You want to remove all of the spindly inner leaves as well as all off the furry choke, while creating a bowl shape, using those truncated yellow leaves as sides. Rub half a lemon over every cut surface, so it doesn’t brown. Be generous. Now, as carefully as you can, peel all of the dark green skin from the stem, again rubbing each cut surface with the halved lemon. Trim the stem down to one inch or less, making sure that it is flat and that when turned upside-down, the artichoke can balance on the surface, again coating the surface with lemon. Repeat this process for the second artichoke.",
    "Bring a large pot of water to boil, adding a few glugs of plain vinegar, those garlic cloves and the lemons you’d used to coat the artichokes, first squeezing any remaining juice into the pot. If you have any old white wine, this is also an excellent flavor to impart in the artichokes. Boil the bowl-shaped artichoke hearts for about 25 to 35 minutes, or until they can be pierced easily with a fork. Drain them and set them aside. (These can be cooked a day or even two in advance, and reheated when you’re ready to make the salad.)",
    "Make your dressing: Whisk your mayonnaise with the juice of one lemon. You want a thin dressing. Season it with salt and pepper.",
    "Assemble your salad: Turn each artichoke upside-down on a plate so it stands on it’s truncated stem. Toss about 1/2 to 2/3 of a cup of beans with a spoonful or two of the dressing, and fill the artichoke cavity with them. Toss the arugula with more dressing, and arrange it over and around the artichoke. Season with more salt and pepper. Leave the extra dressing near you as you’ll probably want more for your artichoke heart. Eat with vigor."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/gulping-beanfuls1.jpg?w=500",
  "ingredient_list": [
    "2 of the largest, most globe-like artichokes you can find",
    "2 lemons",
    "A few cloves of garlic, smashed but left in their skins",
    "One can of cranberry beans, rinsed and drained",
    "A bundle of fresh arugula, washed and dried",
    "2 to 3 tablespoons mayonnaise",
    "Salt and pepper to taste"
  ],
  "tags": [
    "Artichokes",
    "Arugula",
    "Beans",
    "Photo",
    "Salad",
    "Spring",
    "Vegetarian"
  ],
  "title": "artichoke, cranberry bean and arugula salad",
  "url": "https://smittenkitchen.com/2007/04/gulping-beanfuls/"
}