{
  "date": "2008-12-28T15:25:53+00:00",
  "directions": [
    "Preheat the oven to 375°F.",
    "Dice the onion and toss it in a small ovenproof sauté pan with a pinch of salt and enough olive oil to coat lightly, and the leaves of the thyme. Put the pan in the oven to roast, stirring occasionally, until the onion is cooked and golden, about 30 minutes.",
    "While the onion is roasting, wash and drain the broccoli raab, remove the heavy stems, and roughly chop the leaves and sprouts into coarse chiffonade. There should be enough to make about 2 cups. Peel and finely chop the garlic. Heat a large sauté pan and coat it with olive oil. Ad the broccoli raab, season with salt, pepper, and the hot pepper flakes, and fry over high heat until the broccoli raab is tender. Add the garlic and fry, tossing, for a few seconds.",
    "When the onions are done, take them out of the oven and turn the heat up to 450° to 500°F. Put a pizza stone in the oven. Roll out of shape a 12- to 14-inch disk of pizza dough and slide it onto a floured pizza peel or the back of a baking sheet. Lightly brush the dough with olive oil, leave a 1/2-inch boarder dry. Evenly sprinkle the cheese on the oiled surface,spread the onions over, and top with the broccoli raab and the olives. Drizzle about 1 tablespoon olive oil over the pizza. Slide the pizza onto the preheated stone in the oven and bake from 5 to 10 minutes, until the crust is brown and crisp. Remove the pizza from the oven, sprinkle a few drops of lemon juice on it, slice and serve."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pizza-with-broccoli-rabe-and-roasted-onions1.jpg?w=500",
  "ingredient_list": [
    "1 medium yellow onion",
    "Salt and pepper",
    "Olive oil",
    "2 sprig thyme (optional)",
    "1 bunch broccoli raab (aka broccoli rabe or rapini)",
    "1 clove garlic",
    "1 pinch hot pepper flakes",
    "Pizza dough for one recipes (super-simple recipe here and an almost as simple recipe here)",
    "1/2 cup grated mozzarella cheese",
    "16 niçoise olives, pitted",
    "1 lemon"
  ],
  "tags": [
    "Broccoli Rabe",
    "Onions",
    "Photo"
  ],
  "title": "pizza with broccoli rabe and roasted onions",
  "url": "https://smittenkitchen.com/2008/12/pizza-with-broccoli-rabe-and-roasted-onions/"
}