{
  "date": "2010-06-29T09:51:02+00:00",
  "directions": [
    "Make dough: Whisk together the flour and salt in a large bowl. Sprinkle bits of butter over dough and using a pastry blender, cut it in until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, whisk together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour.",
    "Make filling: Spread the zucchini out over several layers of paper towels. Sprinkle with 1/2 teaspoon salt and let drain for 30 minutes; gently blot the tops of the zucchini dry with paper towels before using. In a small bowl, whisk the olive oil and the garlic together; set aside. In a separate bowl, mix the ricotta, Parmesan, mozzarella, and 1 teaspoon of the garlicky olive oil together and season with salt and pepper to taste.",
    "Prepare galette: Preheat oven to 400 degrees. On a floured work surface, roll the dough out into a 12-inch round. Transfer to an ungreased baking sheet (though if you line it with parchment paper, it will be easier to transfer it to a plate later).  Spread the ricotta mixture evenly over the bottom of the galette dough, leaving a 2-inch border. Shingle the zucchini attractively on top of the ricotta in concentric circles, starting at the outside edge. Drizzle the remaining tablespoon of the garlic and olive oil mixture evenly over the zucchini. Fold the border over the filling, pleating the edge to make it fit. The center will be open. Brush crust with egg yolk glaze.",
    "Bake the galette until the cheese is puffed, the zucchini is slightly wilted and the galette is golden brown, 30 to 40 minutes. Remove from the oven, sprinkle with basil, let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/4744441126_6c461103dd_o.jpg?w=750",
  "ingredient_list": [
    "For the pastry:",
    "1 1/4 cups all-purpose flour, chilled in the freezer for 30 minutes",
    "1/4 teaspoon salt",
    "8 tablespoons (1 stick) cold unsalted butter, cut into pieces and chill again",
    "1/4 cup sour cream",
    "2 teaspoons fresh lemon juice",
    "1/4 cup ice water",
    "Filling:",
    "1 large or 2 small zucchinis, sliced into 1/4 inch thick rounds",
    "1 tablespoon plus 1 teaspoon olive oil",
    "1 medium garlic clove, minced (about 1 teaspoon)",
    "1/2 cup ricotta cheese",
    "1/2 cup (about 1 ounce) grated Parmesan cheese",
    "1/4 cup (1 ounce) shredded mozzarella",
    "1 tablespoon slivered basil leaves",
    "Glaze:",
    "1 egg yolk beaten with 1 teaspoon water"
  ],
  "tags": [
    "Herbs",
    "Photo",
    "Picnics",
    "Summer",
    "Tarts/Quiche",
    "Vegetarian",
    "Zucchini"
  ],
  "title": "zucchini and ricotta galette",
  "url": "https://smittenkitchen.com/2010/06/zucchini-and-ricotta-galette/"
}