[
    {
        "ingredient_list": [
            "Meringue Cake", 
            "4 large (120 grams) egg whites", 
            "Pinch of salt", 
            "1 cup (200 grams) superfine (castor) or regular sugar", 
            "1 teaspoon white vinegar", 
            "1/2 tablespoon cornstarch, potato starch or arrowroot powder", 
            "Raspberry Sauce", 
            "This is as good for desserts as it is over plain yogurt. Keep it refrigerated.", 
            "1 10-ounce bag frozen raspberries, thawed", 
            "3 tablespoons sugar", 
            "Whipped Cream", 
            "1 cup heavy whipping cream", 
            "1 tablespoon granulated white sugar", 
            "1 teaspoon pure vanilla extract", 
            "Mixed Berry Topping", 
            "1/2 pint fresh strawberries, hulled and sliced", 
            "1/2 pint fresh blueberries", 
            "1/2 pint fresh raspberries", 
            "Pavlova Assembly", 
            "When the meringue disk is cooled, put it on a plate. Spread the top completely with the sweetened whipped cream. Add the mixed berries and sauce mixture, spooning them carefully into the middle of the pavlova, leaving a border of cream and meringue. Serve immediately in large scoops with extra raspberry sauce."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/04/mixed-berry-pavlova.jpg?w=750", 
        "tags": [
            "Blueberries", 
            "Disasters", 
            "Fruit", 
            "Passover", 
            "Photo", 
            "Raspberries", 
            "Strawberries"
        ], 
        "url": "https://smittenkitchen.com/2007/04/a-ballet-of-sorts/", 
        "title": "mixed berry pavlova", 
        "directions": [], 
        "date": "2007-04-02T11:34:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/8 cups (225 grams) sugar, divided", 
            "4 teaspoons finely grated lemon peel (from two large lemons)", 
            "2 cups (260 grams) all purpose flour", 
            "2 1/2 teaspoons baking powder", 
            "3/4 teaspoon fine sea or table salt", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, at room temperature", 
            "1 large egg", 
            "1 cup (235 ml) buttermilk", 
            "2 teaspoons (10 ml) vanilla extract", 
            "1 1/2 1/2-pint containers (about) fresh raspberries"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/05/raspberry-topped-lemon-muffins.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Fruit", 
            "Lemon", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Raspberries"
        ], 
        "url": "https://smittenkitchen.com/2007/05/a-new-muffin-in-town/", 
        "title": "raspberry-topped lemon muffins", 
        "directions": [
            "Preheat oven to 375°F. Line 14 standard muffin cups (or 56 minis) with paper liners. Mash 1/8 cup (25 grams) sugar and lemon peel in small bowl until sugar is slightly moist. Whisk flour, baking powder, and salt in medium bowl to blend. Using electric mixer, beat remaining 1 cup sugar and butter in large bowl until smooth. Beat in egg. Beat in buttermilk, then vanilla and lemon sugar. Beat in flour mixture.", 
            "Divide batter among muffin cups (the 2/3-3/4 level worked well for minis). Top each large muffin with 4 raspberries (or mini muffins with one each). Bake muffins until lightly browned on top and tester inserted into center comes out clean, about 35 minutes (baking time was on the shy side of 20 minutes for mini muffins). "
        ], 
        "date": "2007-05-11T15:19:46+00:00"
    }, 
    {
        "ingredient_list": [
            "Pastry", 
            "1 1/4 cups (160 grams) all-purpose flour", 
            "1/2 teaspoon table salt", 
            "1 1/2 teaspoons granulated sugar", 
            "Zest of half a lemon", 
            "8 tablespoons (4 ounces or 113 grams) cold unsalted butter, cut into pieces", 
            "1/4 cup ricotta, yogurt or sour cream", 
            "3 to 4 tablespoons cold water", 
            "Filling", 
            "2 cups berries or chopped fruit (I used raspberries and cherries on the red one, blueberries for on the blue)", 
            "3 to 4 tablespoons granulated sugar (use the lower amount if your fruit is especially sweet)", 
            "2 tablespoons cornstarch", 
            "Juice of half a lemon", 
            "Pinch of salt", 
            "Glaze", 
            "1 egg yolk beaten with 1 teaspoon water", 
            "1 heaped teaspoon turbinado or coarse sugar for sprinkling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/blue-and-red-berry-ricotta-galettes1.jpg?w=640", 
        "tags": [
            "Blueberries", 
            "Cherries", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/07/blue-and-red-berry-ricotta-galette/", 
        "title": "blue and red berry ricotta galette", 
        "directions": [
            "Make dough: Whisk the flour, salt, sugar and zest together in the bottom of a large bowl. Work the butter into the flour with your fingertips or a pastry blender until mixture resembles a coarse meal and the largest bits of butter are the size of tiny peas. Stir ricotta and 3 tablespoons water together in a small dish and pour into butter-flour mixture. Stir together with a flexible spatula as best as you can, then use your hands to knead the mixture into a rough, craggy ball. Wrap in plastic and flatten into a disc. Chill in the fridge for 1 hour or up to 48 hours, or you can quick-firm this in the freezer for 15 minutes.", 
            "Assemble galette: Heat oven to 400 degrees. On a floured counter, roll the dough out into a large round-ish shape, about 14 to 15 inches across. ", 
            "[If you’d like to form yours into a star, as shown, use the red dashed outline of this template [PDF]. It will print smaller on an 8.5×11-inch piece of paper than you need, but you can use it as a rough guide to cut as large of a pentagon shape as your dough will allow.] ", 
            "Transfer round or pentagon-shaped dough to a parchment-lined baking sheet; I like to fold my dough gently, without creasing, in quarters then unfold it onto the baking pan. [If you’re making a star, cut a 1-inch notch in the center of each side, angling it toward the center, as shown in the blue dashed lines of the template.] ", 
            "Stir together all of the filling ingredients and spread them in the center of the dough, leaving a 2-inch border. If you’re making a round galette, fold the border over the filling, pleating the edge to make it fit. [If you’re making a star shape, fold each of the 5 corners into the center, along the green dotted lines of the template. Pinch the outer corners closed, to seal in the filling and the shape.] ", 
            "Whisk egg yolk and water together and brush over exposed crust. Sprinkle with coarse sugar.", 
            "Bake galette: For 30 minutes, or golden all over. Remove from the oven and let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature, preferably with vanilla ice cream. [My favorite vanilla ice cream recipe is used here.]"
        ], 
        "date": "2014-07-02T10:25:05+00:00"
    }, 
    {
        "ingredient_list": [
            "Topping", 
            "1/3 cup (40 grams or 1 1/2 ounces) chopped dark chocolate", 
            "1/2 cup (50 grams) rolled oats", 
            "1/4 cup maple syrup", 
            "Pinch of salt", 
            "Filling", 
            "3 tablespoons (40 grams) butter", 
            "3 tablespoons (40 grams) sugar", 
            "2 pears, peeled, halved, cored and diced into small chunks (I used firm D’Anjous; cooking times for other varieties will vary)", 
            "1 cup (115 grams or 4 ounces) raspberries "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/chocolate-oat-crumble1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Crumbles/Crisps", 
            "Fruit", 
            "Gluten-Free", 
            "Pear", 
            "Photo", 
            "Quick", 
            "Raspberries"
        ], 
        "url": "https://smittenkitchen.com/2015/02/chocolate-oat-crumble/", 
        "title": "chocolate oat crumble", 
        "directions": [
            "Heat oven to 350°F(180°C). ", 
            "In a small dish, combine chocolate, oats, maple syrup and salt and set aside. In a small/medium ovenproof skillet (mine was 8-inch/1-quart), melt butter over medium heat. Add sugar and cook together, stirring, until it becomes golden at the edges. Add pear chunks and cook in this caramel-y syrup for 5 to 8 minutes, until slightly softened or half-cooked. (Bosc pears always take longer for me; ripe Bartletts, less.) Scatter raspberries over top. Sprinkle with chocolate-oat mixture. Bake for 20 to 25 minutes, until fruit is soft and the oats crisp."
        ], 
        "date": "2015-02-06T11:48:14+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups (295 grams) all-purpose flour", 
            "2 1/4 teaspoons baking powder", 
            "3/4 teaspoon baking soda", 
            "3 tablespoons (40 grams) granulated sugar", 
            "1/4 teaspoon fine sea or table salt", 
            "6 tablespoons (85 grams or 3 ounces) unsalted butter, cold, cut into chunks", 
            "2 large egg yolks", 
            "3/4 cup plus 2 tablespoons (205 ml) heavy cream", 
            "3 tablespoons (35 grams) raw or turbinado sugar", 
            "1 pound (455 grams) strawberries or mixed berries, hulled and halved if large", 
            "2 tablespoons (25 grams) granulated sugar, or more to taste", 
            "1 tablespoon (15 ml) fresh lemon juice (optional)", 
            "1 cup (235 ml) heavy or whipping cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/easy-drop-berry-shortcakes-1.jpg?w=750", 
        "tags": [
            "Blackberries", 
            "Blueberries", 
            "Everyday Cakes", 
            "Photo", 
            "Quick", 
            "Raspberries", 
            "Scones/Biscuits", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2017/06/easy-drop-berry-shortcakes/", 
        "title": "easy drop berry shortcakes", 
        "directions": [
            "Make shortcakes: Heat oven to 400 degrees F. Line a large baking sheet with parchment paper.\nIn a large bowl, whisk together flour, baking powder, baking soda, granulated sugar, and salt until thoroughly combined. Add butter and using your fingertips or a pastry blender, break it into small bits, the largest should be no bigger than a small pea. In a small bowl, whisk yolks with a splash of cream, then pour rest of cream in and whisk to combine. Pour into butter-flour mixture and use a rubber spatula to mix and mash it together into one cohesive dough.", 
            "Divide dough into 6 (for large, 3 1/2 to 3 3/4-inch wide and up to 2-inch tall) shortcakes or 8 smaller ones. I do this by pressing the dough somewhat flat into the bottom of the bowl (to form a circle) and using a knife to divide it into pie-like wedges. Place raw or turbinado sugar in a small bowl. Roll each wedge of shortcake into a ball in your hands and roll it through the raw/turbinado sugar, coating it in all but a small area that you should leave bare. (I found that the sugar underneath the shortcakes would burn, so better to leave it off.)\nPlace it, bare spot down, on the prepared baking sheet. Repeat with remaining wedges of dough. Bake for 15 minutes, until lightly golden all over. Let cool completely on tray or on a cooling rack.\nWhile cooling, prepare fruit and cream:  Mix berries, 2 tablespoons sugar (more or less to taste), and lemon juice, if desired, in a bowl and let macerate so that the juices run out.\nIn a larger bowl, beat cream until soft peaks form. Add sugar to taste, or leave unsweetened, if that’s your preference.\nTo serve: Carefully split each cooled shortcake with a serrated knife. Spoon berries and their juices over bottom half. Heap generously with whipped cream. Place shortcake “lid” on top. Eat immediately and don’t forget to share.\nDo ahead: Shortcakes keep well for a day at room temperature. I prefer to keep them uncovered. I found on the second day, they were a little more firm but not half-bad, but they’re definitely “best” on day one.\n"
        ], 
        "date": "2017-06-13T11:56:56+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "2 sticks (1 cup, 1/2 pound or 225 grams) unsalted butter, softened", 
            "2 cups (400 grams) sugar", 
            "4 large eggs, at room temperature", 
            "2 teaspoons (10 ml) pure vanilla extract", 
            "4 cups (465 grams) cake flour or 3 2/3 cups (460 grams) all-purpose flour plus 1/3 cup (45 grams) cornstarch", 
            "2 teaspoons (10 grams) baking powder", 
            "1 teaspoon (5 grams) baking soda", 
            "1 teaspoon (6 grams) table salt", 
            "2 cups buttermilk (475 ml), well-shaken", 
            "Frosting", 
            "8-ounce (225 gram) block cream cheese, at room temperature", 
            "1/2 cup (1 stick or 1/4 pound) butter, at room temperature", 
            "1 teaspoon (5 ml) vanilla extract", 
            "2 to 3 cups (240 to 360 grams) powdered sugar", 
            "Decoration", 
            "Powdered sugar", 
            "1 cup blueberries (1/2 pint, about 170 grams), very dry", 
            "3 cups raspberries (1 1/2 pints, about 360 grams), very dry"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/flag-cake.jpg?w=750", 
        "tags": [
            "Blueberries", 
            "Cake", 
            "Photo", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/07/flag-cake/", 
        "title": "flag cake", 
        "directions": [
            "Make cake: Preheat oven to 350°F. Butter a 9×13-inch baking pan and line the bottom with a rectangle of parchment paper, then butter parchment. (Or, you can use a nonstick cooking spray instead of butter for speed and ease.)", 
            "Beat butter and sugar together in the bottom of a large bowl with an electric mixer until light and fluffy, at least 3 minutes. Add eggs, one at a time, scraping down the bowl between each addition. Add vanilla extract. Place flour, cornstarch (if using), baking powder, baking soda and table salt in a sifter or fine-mesh strainer and shake half of mixture into mixing bowl. (If this makes a huge mess, you can also do so onto a piece of waxed paper and use that to dump it into the mixing bowl.) Mix until just combined. Add buttermilk and stir it in slowly, because it will splash easily. The mixture might look curdled, but it will come together just fine in a moment. Add remaining dry ingredients and mix until combined.", 
            "Pour batter in prepared pan and smooth top. Bake until golden and a wooden pick inserted in center of cake comes out clean, [updated!] 30 to 35 minutes my initial notes said 35 minutes baking time, but early testers report it took 45 to 50, which, frankly, sounds a little closer to what I’d expect. Please, check at 35 and if the cake is quite battery still, come back in 10 minutes to check again. Don’t remove the cake until a tester inserted into the center comes out clean. Once it does, transfer the cake to a rack to cool completely. ", 
            "Make frosting Beat cream cheese and butter together until light and very fluffy, scraping down the sides to make sure no pesky cream cheese is left unmixed. Add the vanilla. Add the first cup of powdered sugar, and beat it until combined. Add the second. I prefer my cream cheese frostings less sweet, so I stopped there. Because the frosting is just going to be a layer between the berries and cake, it doesn’t need to be terribly stiff, so you can get away with skipping the additional cup of sugar. However, if yours still seems way too soft to use as frosting or not sweet enough, add the third cup of powdered sugar. ", 
            "If your cake is very domed on top and you’d rather it be flat, you can level it a bit with a small serrated knife. Spread frosting evenly over top of cake. Or not evenly. Nobody will know, which is another reason why this cake is the greatest.", 
            "Decorate away Place your powdered sugar in a sifter or fine-mesh strainer. If you’ve got an open tea strainer, this is a great time to use it, although it will only hold a spoonful at a time. The short side of the blue rectangle of an American flag – yes, I looked this up, and yes, I need a hobby — will fall at roughly half the height of the short side of your cake. The long side will fall at a little more than one-third the width of your cake. You can outline this shape with blueberries. Then, dot a few blueberries inside, spaced apart. Coat the inside berries with a dusting of powdered sugar. Then, fill the rest of the space with uncoated blueberries.", 
            "An American flag has 13 stripes total, beginning and ending with a red stripe. Unless you have really tiny berries, you’re not going to fit all of them and nobody, least of you, should care. Eyeball the width your first row of raspberries will take up, and start your second row after that (approximately 1/2 to 2/3-inch down). Continue this pattern of an empty row followed by a row of raspberries the rest of the way down your cake. Coat these rows with a dusting of powdered sugar. Fill the empty rows with uncoated raspberries. Admire your pretty work. Cover pan with lid or foil and refrigerate until needed for your party/picnic/barbecue. "
        ], 
        "date": "2012-07-03T16:38:52+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup water", 
            "1/2 cup sugar", 
            "1 cup whole raspberries", 
            "2 cups peeled chopped peaches in small/medium chunks", 
            "1/8 teaspoon almond extract (optional)", 
            "1 1/2 cups vanilla ice cream, frozen yogurt or non-dairy vanilla ice cream of your choice, slightly softened (think: soft-serve consistency)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_4528.jpg?w=750", 
        "tags": [
            "Ice Cream/Sorbet", 
            "Peach", 
            "Photo", 
            "Popsicles", 
            "Raspberries", 
            "Recipes", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/08/peach-melba-popsicles/", 
        "title": "peach melba popsicles", 
        "directions": [
            "Combine sugar and water in a small-medium saucepan (intentionally larger than it requires) and bring to a simmer; stir until sugar dissolves. Pour 1/4 cup syrup (just eyeball it — it’s 1/3 of mixture) over raspberries in a bowl. Add peach chunks to remaining syrup in saucepan and bring back to a simmer, cook for 1 to 2 minute, until they soften. Let both raspberries and peaches cool in syrup. The raspberries will quickly but you can hasten the peaches along by setting them in a larger bowl of ice water for 10 to 15 minutes. In a blender or food processor, puree peaches and their syrup first, then scrape into a measuring cup with a spout and stir in almond extract, if using, then puree raspberries and place in a smaller spouted cup. (The raspberry color would muddle the peach puree much more than vice-versa, hence blending peaches first.)\nPour a tiny splash of raspberry (you’ll only want to use half of your total sauce) in the bottom of each popsicle mold or small glass that you’re using as a mold (I like champagne flutes, for this and really everything), following by a larger splash of peaches (again, using about half the puree) and dolloping in a little softened ice cream. Repeat with remaining raspberry, peaches and ice cream. Use a skewer to lightly marble the mixtures together — I get the best swirls by swiping the skewer right along the inside of each mold. Freeze popsicles according to manufacturer’s instructions."
        ], 
        "date": "2016-08-04T11:44:04+00:00"
    }, 
    {
        "ingredient_list": [
            "For the base:", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 teaspoon freshly grated lemon zest", 
            "1/8 teaspoon table salt", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cut into chunks", 
            "1 cup (125 grams) flour", 
            "For the lemonade layer", 
            "1 cup (about 5 ounces or 140 grams) raspberries", 
            "2 large eggs", 
            "3/4 cup (150 grams) granulated sugar", 
            "1/4 cup freshly squeezed lemon juice; this should only require 2 lemons", 
            "1/3 cup (40 grams) all-purpose flour", 
            "Confectioners’ sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Citrus", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/08/pink-lemonade-bars/", 
        "title": "pink lemonade bars", 
        "directions": [
            "Preheat your oven to 350°F (180°C) and line an 8x8x2-inch baking pan with parchment, letting it extend up two sides. Butter or coat the bottom and sides with a nonstick spray and set the pan aside.", 
            "Make the base: In a food processor, pulse together the sugar, zest and salt until combined. Add the butter and pulse until it is evenly dispersed in the dough. Add the flour and pulse the machine until it’s just combined and the mixture is crumbly. Press the dough into the prepared pan and about 1/2-inch up the sides. Don’t worry about making this perfect; mine was an uneven mess and nobody can tell. Bake for 15 minutes, until lightly browned at edges. Let cool on a rack while you prepare the filling (though no need for it to be completely cool when you fill it). Leave oven on.", 
            "Make the pink lemonade layer: Puree the raspberries in your food processor until they’re as liquefied as they’ll get. I don’t even bother cleaning mine between steps, but I’m also probably lazier than you. Run the puree through a fine-mesh sieve, trying to press out all the raspberry puree that you can, leaving the seeds behind. I ended up with 1/3 cup strained puree; don’t worry if you get a smidge less.", 
            "In a medium bowl, whisk together the eggs, sugar and lemon juice until smooth. Whisk in 3 tablespoons of raspberry puree. Stir in flour. Pour into cooling crust and return pan to the oven, baking the bars until they’re set (they’ll barely jiggle) and slightly golden at the edges, about 25 to 30 minutes. Cool completely before cutting into rectangles. (You can speed this up in the fridge.)", 
            "I intended to cut mine into 32 2×1-inch rectangles but actually cut them into 28 2×1-ish rectangles. I like lemony bars small but you could also cut them into 16 2×2-inch squares. Dust with powdered sugar before serving. Store in fridge for up to a week."
        ], 
        "date": "2012-08-03T13:26:11+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup granulated sugar", 
            "1 3/4 cups water (1 cup can be very cold)", 
            "1 cup (about 5 ounces or 140 grams) fresh or frozen raspberries", 
            "1 cup lemon juice (from approximately 7 to 8 lemons)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/9625541640_9753729a31_o.jpg?w=750", 
        "tags": [
            "Citrus", 
            "Lemon", 
            "Photo", 
            "Popsicles", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/08/pink-lemonade-popsicles/", 
        "title": "pink lemonade popsicles", 
        "directions": [
            "No popsicle molds? You could any kind of tiny cup to mold them instead, but my favorite is a champagne flute for shape; you could even use those disposable plastic ones. When the mixture is halfway frozen, insert a popsicle stick and now no retro popsicle mold needs to come between you and Popsicle Week.", 
            "To unmold: To unmold popsicles, dip the frozen molds in a warm bowl of water. I give them a tug every couple seconds to see if they’re loose yet because I don’t want to soften them any more thn absolutely necessary. If the stick comes out before the popsicle (boo!), they just weren’t frozen enough. You’ll want to freeze most popsicles for 5 to 6 hours, just to be certain they’re hard enough to unmold.", 
            "To store popsicles: Here’s how I do it: I put a tray in the freezer and cover it with waxed or parchment paper, just long enough for it to get cold. I unmold all of the popsicles and place them on the tray, and refreeze them for 10 minutes out of their molds before putting them in a freezer bag. This extra step ensures that any melting/softening that happens when you unmold them doesn’t mess up their shapes or cause them to stick to one another. You can also separate them in their freezer bags by extra strips of waxed or parchment paper. Then you can wash the molds and use them again for everything you may have missed this week."
        ], 
        "date": "2013-08-30T08:47:00+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups cold water", 
            "1/4 cup plus 1 tablespoon granulated sugar, divided", 
            "1 cup (about 5 ounces) fresh raspberries, blackberries or sliced strawberries", 
            "1 cup lemon juice (from 4 to 6 lemons, depending on size and juicer efficiency)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade1.jpg?w=640", 
        "tags": [
            "Blackberries", 
            "Citrus", 
            "Drinks", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/05/pink-lemonade/", 
        "title": "picnic pink lemonade", 
        "directions": [
            "In a 1-liter carafe, combine water and 1/4 cup granulated sugar and shake it several times. Set this aside in the fridge to chill and dissolve while you prepare the other ingredients.", 
            "Combine your berry of choice with remaining tablespoon of sugar; it’s best to let the strawberries sit with the sugar for 10 minutes to get the color and juices flowing; blackberries and raspberries can be used right away. Blend the berries and sugar until fully pureed, and then a minute longer. Press through a fine-mesh strainer if you, like me, prefer your lemonade without seeds. You should have a generous 1/4 cup of each puree.", 
            "Remove sugar water carafe from the fridge; if sugar hasn’t fully dissolved, give it a few more shakes and it will. Add lemon juice and berry puree. For the pink hues you see above, use 1 tablespoon blackberry puree, 2 tablespoons raspberry puree or 4 tablespoons (or all) of the strawberry puree. If you don’t mind a dark red/purple color and want a stronger black- or raspberry flavor, you can use all of the puree. Extra puree makes an ideal yogurt or yogurt popsicle stir-in, or can be used for additional batches of pink lemonade, because this will go on repeat.", 
            "Give the carafe another shake, and drink right away or chill until your next picnic. ", 
            "A whole bunch of things about lemonade, from an obsessive: "
        ], 
        "date": "2015-05-29T12:03:04+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/raspberry-breakfast-bars.jpg?w=753", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Raspberries", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/09/raspberry-breakfast-bars/", 
        "title": "raspberry breakfast bars", 
        "directions": [
            "Make the crust and crumb: Preheat the oven to 350°F. Butter the bottom and sides of a 9-by-13-inch glass or light-colored metal baking pan. Put a long piece of parchment paper in the bottom of the pan, letting the parchment extend up the two short sides of the pan and overhang slightly on both ends. (This will make it easy to remove the bars from the pan after they have baked.) Butter the parchment.", 
            "Put the flour, brown sugar, oats, salt, baking powder, baking soda, and cinnamon in a food processor. Pulse in short bursts until combined. Add the butter and pulse until loose crumbs form.", 
            "Reserve 1 1/2 cup of the mixture and set aside. (Note: The book suggests you reserve one cup only. My gut told me that was too little, and I upped it. I wanted to make sure the top of the raspberries were mostly covered, at least for packing purposes, and was glad I had changed it.) Pour the rest of the mixture into the prepared pan and use your hans or the back of a large wooden spoon to push the crust into an even layer at the bottom of the pan. The crust should touch the sides of the pan. Bake until golden brown, 12 to 15 minutes. Transfer to a wire rack and let the crust cool. Keep the oven on while you make the raspberry filling.", 
            "Make the raspberry filling: In a medium bowl, whisk the sugar, lemon zest, cinnamon and flour together. Add the raspberries, lemon juice and butter and use your hands to toss gently until the raspberries are evenly coated.", 
            "Assemble and bake the bars: Spread the raspberry filling evenly on top of the cooled crust. Sprinkle the reserved crust mixture evenly on top of the filling.", 
            "Bake for 35 to 45 minutes, rotating the pan every 15 minutes, until the top is golden brown and the filling starts to bubble around the edges.", 
            "Transfer to a wire rack to cool completely, then cut into squares and serve. The bars can be stored in the refrigerator in an airtight container for up to two days."
        ], 
        "date": "2008-09-02T15:50:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pint (2 cups) fresh raspberries (or your choice of berry)", 
            "1 pint (2 cups) sour cream (or crème fraîche)", 
            "1 cup dark brown sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/raspberry-brown-sugar-gratin1.jpg?w=500", 
        "tags": [
            "Fruit", 
            "Gluten-Free", 
            "Photo", 
            "Raspberries", 
            "Russian", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/07/raspberry-brown-sugar-gratin/", 
        "title": "raspberry brown sugar gratin", 
        "directions": [
            "Preheat broiler. Gently fold raspberries and sour cream together in a shallow 1-quart dish. Press the brown sugar through a sieve or mesh colander so that it sprinkles evenly over the dish. (I tried using a sifter; don’t bother, it doesn’t work.) Run the dish under the broiler until the sugar just starts to caramelize. Eat at once.", 
            "Keeping: The leftovers might look like something died in your fridge but I can assure you, are equally delicious. "
        ], 
        "date": "2010-07-21T10:26:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (130 grams) all-purpose flour", 
            "1/2 teaspoon (2 grams) baking powder", 
            "1/2 teaspoon (2 grams) baking soda", 
            "1/4 teaspoon salt", 
            "1/2 stick (56 grams) unsalted butter, softened", 
            "2/3 cup (146 grams) plus 1 1/2 tablespoons (22 grams) sugar, divided", 
            "1/2 teaspoon pure vanilla extract", 
            "1/2 teaspoon finely grated lemon zest (optional)", 
            "1 large (57 grams) egg", 
            "1/2 cup (118 ml) well-shaken buttermilk", 
            "1 cup (5 ounces or 140 grams) fresh raspberries "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/raspberry-buttermilk-cake.jpg?w=753", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/05/raspberry-buttermilk-cake/", 
        "title": "raspberry buttermilk cake", 
        "directions": [
            "Preheat oven to 400°F with rack in middle. Butter and flour a 9-inch round cake pan.", 
            "Whisk together flour, baking powder, baking soda, and salt and set aside. In a larger bowl, beat butter and 2/3 cup (146 grams) sugar with an electric mixer at medium-high speed until pale and fluffy, then beat in vanilla and zest, if using. Add egg and beat well.", 
            "At low speed, mix in flour mixture in three batches, alternating with buttermilk, beginning and ending with flour, and mixing until just combined.Spoon batter into cake pan, smoothing top. Scatter (see Note) raspberries evenly over top and sprinkle with remaining 1 1/2 tablespoons (22 grams) sugar.", 
            "Bake until cake is golden and a wooden pick inserted into center comes out clean, 20 to 25 minutes.  Cool in pan 10 minutes, then turn out onto a rack and cool to warm, 10 to 15 minutes more. Invert onto a plate.", 
            "[Baking time updated, shortened, after so many of you concurred that this cake bakes crazy quickly.]", 
            "Note: Directions like “scatter” always scare me. Where’s the science? Here’s what my neuroses taught us: the ones that were downward were almost all swallowed by the batter. The \"o\" ones stayed empty, like cups. Both were delicious.", 
            "Make your own almost-buttermilk: No need to buy buttermilk especially for this or any recipe. Add one teaspoon tablespoon [updated, as an astute reader pointed out that the larger amount is more common] of vinegar or lemon juice to one cup of milk and let it sit until it clabbers, about 10 minutes. Voila, buttermilk!"
        ], 
        "date": "2009-05-19T15:40:42+00:00"
    }, 
    {
        "ingredient_list": [
            "14 ounces (400 grams) sweetened, flaked coconut", 
            "2/3 cup (130 grams) granulated sugar", 
            "3 large egg whites", 
            "Heaped 1/4 teaspoon flaked sea salt or level 1/4 teaspoon table salt", 
            "1/2 teaspoon almond extract", 
            "1/2 pint (6 ounces, 170 grams or 1 1/4 cups) fresh raspberries (if washed, patted very dry)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/03/raspberry-coconut-macaroons.jpg?w=750", 
        "tags": [
            "Coconut", 
            "Cookie", 
            "Easter", 
            "Gluten-Free", 
            "Passover", 
            "Photo", 
            "Raspberries"
        ], 
        "url": "https://smittenkitchen.com/2012/03/raspberry-coconut-macaroons/", 
        "title": "raspberry coconut macaroons", 
        "directions": [
            "Preheat oven to 325°F. Line two large baking sheets with parchment paper.", 
            "In a food processor, blend the coconut for a minute. Add sugar, blend another minute. Add egg whites, salt and almond extract and blend for another minute. Add raspberries and pulse machine on and off in short bursts until they are largely, but not fully, broken down. (I counted 13 pulses. I might have been a little obsessive, what with the counting.) Some visible flecks of raspberry here and there are great. When you open the machine, you’ll see some parts of the batter that are still fully white while others are fully pink. Resist stirring them together.", 
            "With a tablespoon measure or cookie scoop (I used a #70), scoop batter into 1-inch mounds. You can arrange the cookies fairly close together as they don’t spread, just puff a bit. Scooping a little of the pink batter and a little of the white batter together makes them look extra marble-y and pretty.", 
            "Bake cookies for 25 to 30 minutes, until they look a little toasted on top. Let them rest on the tray for 10 minutes after baking (or you can let them fully cool in place, if you’re not in a rush to use the tray again), as they’ll be hard to move right out of the oven. They’ll firm up as they cool, but still remain softer and less dry inside than traditional macaroons. Thank goodness."
        ], 
        "date": "2012-03-29T09:20:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup water", 
            "1/2 cup granulated sugar", 
            "3 cups fresh raspberries", 
            "1 tablespoon lemon juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/08/raspberry-crushed-ice1.jpg?w=640", 
        "tags": [
            "Blackberries", 
            "Gluten-Free", 
            "Ice Cream/Sorbet", 
            "Photo", 
            "Raspberries", 
            "Summer", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2015/08/raspberry-crushed-ice/", 
        "title": "raspberry crushed ice", 
        "directions": [
            "Stir water and sugar together in a glass or bowl and let sit 15 minutes. Stir again thoroughly; sugar should have dissolved. In a blender, combine this sugar water, berries and lemon and run until smooth. Pour into a large baking dish; keeping the thickness of the puddle shallow means your dessert will be finished more quickly. After about an hour — freezing time will vary by freezer temperature and puddle depth — the mixture should be half-frozen. Stir with a fork, scraping the surface and out to the corners to break up the ice, forming coarse glittery crystals. Return to the freezer and repeat this process every 30 minutes for another hour or two, until the mixture is fully frozen in flakes. To serve, scoop into glasses."
        ], 
        "date": "2015-08-11T10:58:25+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup freshly squeezed lime juice", 
            "1 cup raspberries", 
            "1 cup water", 
            "4 cups ice", 
            "2/3 cup sugar", 
            "1 cup soda water", 
            "Lime wedges, for serving", 
            "4 chilled glasses, if you’re feeling fancy (or are interested in your slushie staying slushy longer)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/08/4885444217_b0f3425822_o.jpg?w=751", 
        "tags": [
            "Citrus", 
            "Drinks", 
            "Lime", 
            "Photo", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/08/raspberry-limeade-slushies/", 
        "title": "raspberry limeade slushies", 
        "directions": [
            "In a blender, blend the lime juice, raspberries, water, ice and sugar until slushy. Pour into glasses. Top off with about 1/4 cup soda water and garnish with a lime wedge. Drink quickly enough to get a brain freeze.", 
            "If you’re averse to raspberry seeds (I generally am, but was feeling rushed that day), you can puree the berries first, press them through a fine-mesh strainer to remove the seeds, then put them back in the blender and add the rest of the ingredients. I will note that the seeds were far less annoying than I’d expected them to be, likely because they’re less noticeable with the added texture from the ice.", 
            "Also: I probably don’t need to tell you how good this would be with booze. "
        ], 
        "date": "2010-08-12T19:51:58+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "2 cups (about 250 grams) finely ground chocolate cookie crumbs (from about 1 9-ounce sleeve chocolate wafers; see more suggestions below)", 
            "6 tablespoons (85 grams) unsalted butter, melted", 
            "3 tablespoons (40 grams) granulated sugar", 
            "1/8 teaspoon table salt", 
            "Raspberry Swirl", 
            "6 ounces (170 grams) fresh or frozen raspberries (which have been thawed or they will not puree easily)", 
            "2 tablespoons (25 grams) granulated sugar", 
            "Cheesecake", 
            "32 ounces (905 grams) cream cheese, very soft at room temperature", 
            "1 1/2 cups (300 grams) granulated sugar", 
            "Pinch of salt", 
            "1 teaspoon pure vanilla extract", 
            "4 large eggs, room temperature", 
            "Chocolate sauce for serving (optional)", 
            "1/2 cup (120 ml) heavy or whipping cream", 
            "4 ounces (115 grams) semisweet or bittersweet chocolate"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/raspberry-swirl-cheesecake1.jpg?w=640", 
        "tags": [
            "Celebration Cakes", 
            "Photo", 
            "Raspberries"
        ], 
        "url": "https://smittenkitchen.com/2014/08/raspberry-swirl-cheesecake/", 
        "title": "raspberry swirl cheesecake", 
        "directions": [
            "Heat oven to 350°F (180°C). Wrap exterior of a 9-inch springform pan (including base) tightly in a triple layer of foil; set aside.", 
            "Make crust: Stir together cracker crumbs, melted butter, and sugar in a medium bowl. Press crumb mixture firmly into bottom of pan and up the sides to about 1-inch from the top of the pan. I like to use the bottom and outside of a 1-cup measure to help press them in firmly. Bake until set, about 10 minutes. Let cool in pan on a wire rack. Reduce oven temperature to 325 degrees.", 
            "Make raspberry sauce for swirl: Process raspberries with sugar in a food processor until smooth, about 30 seconds. Pass puree through a fine sieve into a small bowl; discard solids. Set aside.", 
            "Make cheesecake: Put cream cheese in the bowl of an electric mixer fitted with a paddle attachment; mix on medium speed until fluffy, about 3 minutes. With mixer on low speed, add remaining 1 1/2 cups sugar in a slow, steady stream; scrape down bowl. Add salt and vanilla; mix until well combined. Add eggs, one at a time, mixing each until just combined and scraping down the bowl. Pour cream cheese filling over crust.", 
            "Using a squeeze bottle, piping bag or a zip-lock bag with a tiny corner snipped off, place tiny droplets of raspberry sauce all over top of cake. Use a toothpick or skewer to swirl the sauce and filling together decoratively. I had extra sauce; it makes a delicious dessert sauce to serve with the cake.", 
            "Bake cake: Set cake pan inside a large, shallow roasting pan — I set mine inside a 12-inch round saucepan. Transfer to oven. Carefully pour or ladle boiling water into roasting pan until it reaches halfway up the sides of the cake pan. Bake until cake is set but still slightly wobbly in center, 60 to 65 minutes. (This always takes longer in my oven because I always fail to seal the foil around the pan well enough that water doesn’t get in. Just keep baking it until it seems mostly set, like loose Jell-O. A toothpick inserted near the center should not have wet, thin batter on it when removed)", 
            "Transfer cake pan to rack; let cake cool to room temperature then refrigerate, uncovered, at least 6 hours or overnight. Before unmolding, run a knife around edge of cake.", 
            "If you’d like to serve this with a chocolate sauce, bring heavy cream to a boil in a small saucepan. Remove from heat, stir in chocolate until melted. ", 
            "Serve cake in wedges, with any leftover raspberry sauce or chocolate sauce, or both. ", 
            "Notes: "
        ], 
        "date": "2014-08-14T11:59:12+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pints fresh strawberries rinsed, hulled, and sliced 1  pint  fresh raspberries", 
            "1/2 pint fresh blueberries", 
            "1/2 pint fresh blackberries", 
            "3/4 cup granulated sugar", 
            "2 tablespoons lemon juice from 1 lemon", 
            "8 slices potato bread (stale), challah, or other good-quality white bread "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/some-sweet-for-your-suffering1.jpg?w=500", 
        "tags": [
            "Blueberries", 
            "Fruit", 
            "Photo", 
            "Raspberries", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2007/08/some-sweet-for-your-suffering/", 
        "title": "summer berry pudding", 
        "directions": [
            "1. Heat strawberries, raspberries, blueberries, blackberries, and sugar in large nonreactive saucepan over medium heat, stirring occasionally, until berries begin to release their juice and sugar has dissolved, about 5 minutes. Off heat, stir in lemon juice; let cool to room temperature.", 
            "2. While berries are cooling, spray a 9 x 5-inch loaf pan with vegetable cooking spray. Following illustrations below, remove crusts from bread slices and trim them to fit in a single layer in the loaf pan (it will take approximately 2 1/2 slices to form one layer). Line the loaf pan with plastic wrap. Make sure the plastic wrap lies flat against the surface of the loaf pan, leaving no air space.", 
            "3. Place the loaf pan on a rimmed cookie sheet and use a slotted spoon to place about 2 cups of fruit into the bottom. Lightly soak enough bread slices for one layer in juice and place on top of fruit. Repeat with two more layers of fruit and bread. Top with remaining juices, cover loosely with plastic wrap, and weight with a second cookie sheet and several heavy cans. Refrigerate puddings for at least 8 and up to 24 hours.", 
            "4. Remove weights, cookie sheet, and plastic wrap. To unmold, invert onto serving platter. Lift off loaf pan; remove plastic wrap lining and serve."
        ], 
        "date": "2007-08-04T16:21:01+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "2 1/2 cups (355 grams) plus 2 tablespoons (20 grams) all-purpose flour", 
            "2 teaspoons (10 grams) baking powder", 
            "1 teaspoon fine sea salt or table salt", 
            "1 cup (8 ounces or 225 grams) unsalted butter, at room temperature", 
            "1 3/4 cups (340 grams) granulated sugar", 
            "Zest of 1 lemon", 
            "3 large eggs, at room temperature", 
            "1/2 teaspoon vanilla extract", 
            "3/4 cup (175 ml) buttermilk", 
            "3 cups (350 to 450 grams) mixed berries", 
            "Glaze", 
            "2 cups (240 grams) powdered or confections’ sugar", 
            "Juice of 1 lemon", 
            "1 tablespoon (15 grams) unsalted butter, very, very soft"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/06/triple-berry-summer-buttermilk-bundt.jpg?w=750", 
        "tags": [
            "Blackberries", 
            "Blueberries", 
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/06/triple-berry-summer-buttermilk-bundt/", 
        "title": "triple berry summer buttermilk bundt", 
        "directions": [
            "Preheat your oven to 350°F. Generously grease a 10-cup Bundt pan, either with butter or a nonstick spray.* Set aside.", 
            "In a medium bowl, whisk or sift 2 1/2 cups flour (leaving 2 tablespoons back), baking powder and salt together and set aside. In the bowl of a stand mixer or large mixing bowl, cream together the butter, sugar and lemon zest until light and impossibly fluffy, about 3 to 5 minutes. Then, with the mixer on a low speed, add your eggs one at a time, scraping down the bowl between each addition. Beat in vanilla, briefly. Add 1/3 flour mixture to batter, beating until just combined, followed by half the buttermilk, another 1/3 of the flour mixture, the remaining buttermilk and remaining flour mixture. Scrape down from time to time and don’t mix any more than you need to. In the bowl where you’d mixed your dry ingredients, toss the berries with the remaining 2 tablespoons of flour. With a silicon spatula, gently fold the berries into the cake batter. The batter will be very thick and this will seem impossible without squishing the berries a little, but just do your best and remember that squished berries do indeed make for a pretty batter.", 
            "Spread cake batter — you might find it easier to plop it in the pan in large spoonfuls, because it’s so thick — in the prepared baking pan and spread the top smooth. Bake for 55 to 60 minutes, rotating the cake 180 degrees after 30 (to make sure it browns evenly). The cake is done as soon as a tester comes out clean of batter. At 10 minutes before my baking time was up, a tester was totally wet with batter and I was certain it would never be done in the estimated time. 7 minutes later, the same tester was clean as a whistle, so fret not.", 
            "Set cake pan on a wire rack to cool for 30 minutes, before inverting the cake onto a serving platter to cool the rest of the way. Cool completely. Once cool, whisk together the powdered sugar, lemon juice and butter until smooth and very, very thick. (If you’d like it thinner, add more juice, but I like the thick drippiness of it, seen above.) Spread carefully over top of cake, letting it trickle down the sides when and where it wishes. Serve at once or keep it covered at room temperature for 3 to 4 days. ", 
            "* Updated note, due to comments about cake sticking: If you have a nonstick Bundt, just a coat of butter or nonstick spray should do. However, if you have a regular Bundt, not nonstick coated, you’re really going to want to make sure every nook and cranny is well-coated with butter or even shortening (the solidity of both helps them stick to the cake walls), and then dust the inside with flour. Setting your cake pan in the fridge or freezer (to set the coating even further) while you make the cake batter will provide even more insurance. I hope this improves the release rate of the cake! "
        ], 
        "date": "2012-06-25T16:02:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (120 grams) whole wheat flour", 
            "1 cup (125 grams) all-purpose flour", 
            "1 tablespoon baking powder, preferably aluminum-free", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 teaspoon table salt", 
            "6 tablespoons (85 grams) cold unsalted butter", 
            "1 cup  (136 grams or 4 3/4 ounces) fresh raspberries", 
            "3/4 cup (189 grams) whole milk ricotta", 
            "1/3 cup (79 ml) heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/07/whole-wheat-raspberry-ricotta-scones.jpg?w=734", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Photo", 
            "Raspberries", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2011/07/whole-wheat-raspberry-ricotta-scones/", 
        "title": "whole wheat raspberry ricotta scones", 
        "directions": [
            "Preheat oven to 425 degrees. Line a large baking sheet with parchment paper. In the bottom of a large, wide-ish bowl, whisk flours, baking powder, sugar and salt together.", 
            "With a pastry blender: Add the butter (no need to chop it first) and use the blender to both cut the butter into the flour mixture until the biggest pieces are the size of small peas. Toss in raspberries and use the blender again to break them into halves and quarter berry sized chunks.", 
            "Without a pastry blender: Cut the butter into small pieces with a knife and work the butter into the flour mixture with your fingertips until the mixture resembles a coarse meal. Roughly chop the raspberries on a cutting board and stir them into the butter-flour mixture.", 
            "Both methods: Add the ricotta and heavy cream together and stir them in to form a dough with a flexible spatula.Using your hands, gently knead dough into an even mass, right in the bottom of the bowl. Don’t fret if the raspberries get muddled and smudge up the dough. This is a pretty thing.", 
            "With as few movements as possible, transfer the dough to a well-floured counter, flour the top of the dough and pat it into a 7-inch square about 1-inch tall. With a large knife, divide the dough into 9 even squares. Transfer the scones to prepared baking sheet with a spatula. Bake the scones for about 15 minutes, until lightly golden at the edges. Cool in pan for a minute, then transfer to a cooling rack. It’s best to cool them about halfway before eating them, so they can set a bit more. I know, way to be a big meanie, right?", 
            "Do ahead: Scones are always best the day they are baked. However, if you wish to get a lead on them, you can make them, arrange them on your parchment-lined sheet and freeze them. If you’re prepping just one day in advance, cover the tray with plastic wrap and bake them the day you need them. If you’re preparing them more than one day in advance, once they are frozen, transfer them to a freezer bag or container. Bring them back to a parchment-lined sheet when you’re ready to bake them. No need to defrost the froze, unbaked scones, just add 2 to 3 minutes to your baking time."
        ], 
        "date": "2011-07-16T12:48:58+00:00"
    }
]