[
    {
        "ingredient_list": [
            "1/2 pound thick-cut bacon, cut into small dice", 
            "1 pound red potatoes, scrubbed clean and diced into 1/4- to 1/2-inch cubes (about 3 to 3 1/4 cups)", 
            "Salt and freshly ground black pepper", 
            "4 medium-large ears corn, kernels cut from the cob (2 1/2 to 3 cups)", 
            "1 bundle scallions, thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/bacon-corn-hash.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Budget", 
            "Corn", 
            "Gluten-Free", 
            "Meat", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Summer", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2012/07/bacon-corn-hash/", 
        "title": "bacon corn hash", 
        "directions": [
            "Toss bacon into a large skillet over medium heat, no need to heat the pan first. Let rest for a few minutes until it starts sizzling, then move the bits around so that they begin to brown evenly. Again, wait a couple minutes before shuffling the pieces around; you’re looking for them to get evenly golden and crisp. This should take about 10 minutes. Remove the bacon bits with a slotted spoon, leaving the drippings in the pan and transferring the bacon to paper towels to drain.", 
            "If your bacon is like mine, you’ll be left with a spectacular amount of fat behind. You’ll be tempted to drain it off. May I ask you not to? The potatoes that cook in this will be gorgeous and you will have a chance to remove this extra in a bit. It will mostly stay in the pan.", 
            "Heat the pan to medium/medium-high, making sure the bacon fat is nicely sizzly, then add your potatoes all at once in a single layer. Sprinkle them with 1/2 teaspoon table salt and several grinds of black pepper. Let them cook for a few minutes in one place and get a bit golden underneath before turning them over and moving them around. Repeat this process until the potatoes are browned on all sides; this takes about 20 minutes.", 
            "At this point, you can push aside the potatoes and pour or spoon off all but a small amount of the fat. I won’t tell you how much I was able to remove but it rhymes with shmoo to shmee shmablespoons. If you save it, you can use it to fry an egg in a bit.", 
            "Bump up the heat a little and add the corn to the skillet. Saute the potatoes and corn together until the corn gets a bit brown but stays fairly crisp, about 4 to 5 minutes. Add the drained bacon, and stir the mixture together until it’s evenly warm, about 1 more minute. Remove the skillet from the burner and sprinkle the scallions (reserving a couple spoonfuls if you’d like to use them as fried egg garnish) over the hash. In two minutes, they should be warm and mellowed. Season with more salt or pepper to taste, if needed.", 
            "Add a fried egg to it: Heat a small skillet over medium-high heat and swirl in one to two teaspoons bacon fat or butter. Crack one egg into the skillet and reduce heat to medium. I like to cover the skillet with a small lid at this point, as it seems to help the egg cook faster and more evenly. In one minute, you should have a perfect sunny-side-up egg. Season with salt and pepper, serve on top of a pile of bacon corn hash. "
        ], 
        "date": "2012-07-17T14:28:15+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups (160 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "8 tablespoons (4 ounces or 113 grams) cold unsalted butter, cut into pieces and chill again", 
            "1/4 cup (60 grams) plain yogurt or sour cream", 
            "2 teaspoons (10 ml) fresh lemon juice", 
            "1/4 cup (60 ml) ice water", 
            "For the filling:", 
            "1 tablespoon (15 ml) olive oil", 
            "1/4 teaspoon coarse Kosher or sea salt", 
            "3 cups (about 450 grams) cherry or grape tomatoes", 
            "1 ear corn, cut from the cob (about 1 cup)", 
            "1 small (8 ounces or 225 grams) zucchini or summer squash, diced", 
            "1 bundle (3 to 4 ounces or 85 to 115 grams) scallions, thinly sliced", 
            "1/2 cup (2 ounces or 55 grams) grated parmesan", 
            "Glaze:", 
            "1 egg yolk beaten with 1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/burst-tomato-zucchini-and-corn-galette.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Corn", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Quiche", 
            "Tomatoes", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2013/08/burst-tomato-galette-with-corn-and-zucchini/", 
        "title": "burst tomato galette with corn and zucchini", 
        "directions": [
            "Make dough: Whisk stir the flour and salt in a large bowl. Sprinkle bits of butter over dough and using a pastry blender or your fingertips, work it into the flour until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, stir together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball. Wrap with plastic and refrigerate for 1 hour, or up to 2 days.", 
            "Make filling: Get down the saute pan with the lid. If you don’t have one, any large lid will do. Add olive oil, tomatoes, salt and a pinch of red pepper flakes (if that’s your thing) to your saute pan then cover and heat over high heat. Roll the tomatoes around from time to time so that they’ll cook evenly. In a few minutes, you’ll hear some putts and pops as the tomatoes burst a little. When most have, remove lid, turn heat down to medium and add zucchini chunks. Saute for two minutes, until they soften. Add corn and cook one minute. Add scallions, just stirring them in, then turn off heat. Adjust seasonings if needed. Transfer mixture to a large plate and spread it out, so that it will cool faster. You want it cooled to at least lukewarm before assembling the galette.", 
            "Assemble galette: Heat oven to 400 degrees. On a floured counter, roll the dough out into a 12-inch round and it really doesn’t need to be perfectly shaped. Transfer to a parchment-lined baking sheet; I like to fold my dough gently, without creasing, in quarters then unfold it onto the baking pan. Sprinkle tomato-zucchini-corn mixture with half of parmesan and spoon the mixture into the center of the dough, leaving a 2-inch border. If any liquid has puddle in plate, try to leave it there as you spoon. Sprinkle with almost all of remaining parmesan, leaving a pinch or two behind for the crust. Fold the border over the filling, pleating the edge to make it fit. The center will be open. Brush crust with egg yolk glaze. Sprinkle glaze with last pinches of parmesan.", 
            "Bake the galette: For 30 to 40 minutes, or until puffed and golden brown. Remove from the oven and let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature."
        ], 
        "date": "2013-08-05T12:19:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large fresh corn cob", 
            "2 tablespoons butter, melted", 
            "1/2 cup flour", 
            "1 cup milk, any fat level will do", 
            "2 large eggs", 
            "1/2 teaspoon table salt", 
            "Butter or oil for pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/charred-corn-crepes1.jpg?w=500", 
        "tags": [
            "Corn", 
            "Pancakes", 
            "Photo", 
            "Summer", 
            "Tex-Mex", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/08/charred-corn-crepes/", 
        "title": "charred corn crepes", 
        "directions": [
            "To char corn: Shuck your corn but leave the “stem” on if you can; it makes a great handle. Remove small children from the area. Over a hot grill or an open gas-stove flame, char the corn until well-blackened but not completely burnt. It tends to snap, crackle and yes, pop a little making terrifying noises (hence, the removal of small people) but will smell amazing (like popcorn and fireplaces and summer camp). Remove cob from heat, and when cool enough to handle, shave off kernels using a large knife. You should have about 1 cup kernels. Transfer to a bowl and pour melted butter over it; let cool to lukewarm.", 
            "Make crepe batter: Place corn-butter mixture in a blender with flour, milk, eggs and salt. Blend until mostly smooth (a few bits and coarse piece of corn are awesome but too many will make the batter hard to pour and spread in the pan). Cover and refrigerate for 1 hour or two days; this resting time really, really makes it easier to make crepes that don’t fall apart.", 
            "Cook crepes: Heat an 8- to 9-inch skillet (nonstick makes things even easier here) over medium heat. Coat very lightly with butter or oil. Pour 3 (for an 8-inch skillet) to 4 tablespoons (for a larger size) batter into the center of the skillet and roll it around so that it evenly coats the bottom. Cook until edges appear lightly brown, then flip the crepe* and cook it on the reverse side for another 30 seconds.", 
            "Slide crepe onto a paper towel-coated plate or counter. Repeat with remaining crepe batter, re-buttering pan as needed. Cooling crepes can overlap on the towels. Cooled crepes can be stacked and will not stick to each other.", 
            "Mexican Street Corn Crepe Stack: I spread about 1 teaspoon mayonnaise (which is very scant and you can definitely use more; use yogurt or sour cream if you dislike mayo) between each crepe, then sprinkled about 2 teaspoons crumbled cotija cheese (but you can use ricotta salata, feta or another crumbly salty cheese if you cannot find it), a couple shakes of chili powder and a small amount of chopped cilantro (but you can use flat-leaf parsley if you’re not into cilantro). The toppings add up quickly as you stack the crepes, so don’t be afraid to go easy on them; you’ll still get a full amount of topping with each bite. Serve with lime wedges, squeezing some lime juice over each wedge.", 
            "* Flipping crepes is scary! Here are some tips: 1. Crepes fall apart quite easily when they’re pale and undercooked. The ones with slightly more brown spots are easier to flip, for the same reason that toast is firmer than fresh bread. As you get more confident, you can aim for paler crepes. 2. I use a weird, need-to-show-with-a-video-one-day two spatula flipping technique, usually use one offset frosting spatula (I have this one) and one flexible fish spatula (I have this one and is one of my most favorite kitchen tools, ever, the only thing I use for 99% lifting/turning kitchen tasks). I use the smaller one to get underneath the crepe enough that I can lift it enough that I can slide the larger one far underneath it, making flipping it a cinch. I promise. Once you get the hang of it, you’ll be a crepe-making junkie like me."
        ], 
        "date": "2013-08-01T11:46:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound red radishes (from about 2/3 of a bundle with stems and leaves), trimmed", 
            "1 small (4 to 5 ounces) zucchini, long and narrow if you can find it", 
            "2 limes", 
            "Salt", 
            "4 ears corn, husks removed", 
            "2 tablespoons unsalted butter", 
            "1 tablespoon olive oil, plus additional if blistering tacos in skillet", 
            "1 medium white onion, finely chopped", 
            "2 cloves garlic, minced", 
            "3 tablespoons chopped epazote (if you can find it), cilantro or pasley (for the cilantro-averse) leaves (optional)", 
            "1/2 cup (2 1/2 ounces or 70 grams) crumbled cotija cheese (or another salty, crumbly cheese such as ricotta salata or feta)", 
            "1/4 teaspoon chili powder", 
            "10 to 12 small (6-inch) soft corn tortillas"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/07/charred-corn-tacos-with-zucchini-radish-slaw.jpg?w=750", 
        "tags": [
            "Corn", 
            "Photo", 
            "Radishes", 
            "Summer", 
            "Tex-Mex", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2011/07/charred-corn-tacos-with-zucchini-radish-slaw/", 
        "title": "charred corn tacos with zucchini-radish slaw", 
        "directions": [
            "Cut radishes and zucchini into tiny matchsticks with a mandoline. If you don’t have a mandoline, you can use a peeler to peel thick ribbons down the long side of the zucchini. Stack the ribbons and cut them crosswise into thin matchsticks. Cut the radishes into a similar shape by hand. Toss radishes and zucchini together. Squeeze the juice of half a lime over the radish and season with salt to taste. Add more lime juice if desired. Set aside.", 
            "Remove toddlers from the kitchen. Over a hot grill or an open gas-stove flame char two of the ears of corn until well-blackened but not completely burnt. If you’re using the burner method, you’ll probably, quickly, notice that corn likes to pop and snap, occasionally spraying you with splats of corn. It’s a little scary, which is I why I suggest you remove anyone small and easily harmed before you begin. However, I found the charred corn flavor to be completely worth the scare and hope you do too. ", 
            "Remove cobs from heat, and when cool enough to handle, shave off kernels using a large knife and reserve. Remove kernels from remaining two ears of corn.", 
            "Heat a large sauté pan over medium heat. Melt the butter and oil together and once hot, add the onion. Cook the onion for about 5 minutes, until softened. Add the garlic and cook another minute. Add the raw corn kernels and sauté until corn is just cooked through, about three to five minutes. Turn heat to high, add the charred kernels of corn to the mixture, and toss to combine until heated through. Squeeze the juice of one lime over the corn mixture, and use the juice to scrape up any stuck bits. Season the corn mixture with salt and chili powder. Stir in chopped herbs, if using.", 
            "You can heat your tortillas one of two ways. You can wrap the whole stack in foil and place it in a warm (250 degrees) oven for 15 minutes while you prepare the other ingredients. However, I prefer to get a nice blister on them before filling them. Coat the bottom of a cast-iron skillet with olive oil and wipe it out so on the thinnest slick remains. Heat the skillet on high. Once hot, cook a tortilla for about 30 seconds to 1 minute on each side, until lightly blistered. Repeat with remaining tortillas but if your skillet is well-seasoned, no need to repeat the oiling process.", 
            "Fill each taco with a few small spoonfuls of the corn mixture. Top with a spoonful of crumbled cheese and a bit of the radish-zucchini slaw. Serve with an extra lime wedge on the side (you’ll have half a lime left to slice up), and whatever fixings you like (sour cream, avocado wedges, etc. See above)."
        ], 
        "date": "2011-07-21T13:58:00+00:00"
    }, 
    {
        "ingredient_list": [
            "2 ears corn, husked", 
            "1 15-ounce can black beans, drained and rinsed", 
            "1 large poblano", 
            "Nonstick spray or 2 teaspoons oil", 
            "2 generous cups (about 8 ounces) coarsely grated monterey jack cheese", 
            "2 generous cups (about 8 ounces) coarsely grated cheddar cheese", 
            "1 12-ounce bag tortilla chips, the thicker the better", 
            "Thinly sliced jalapeno (1 used 1/2 a big one)", 
            "Thinly sliced radishes (I used 2 medium)", 
            "1/2 a white onion, minced (you can toss it with a little lime juice and salt to lightly pickle it, if desired)", 
            "Handful fresh cilantro, roughly chopped", 
            "Diced tomatoes", 
            "Shredded lettuce", 
            "Sliced avocado", 
            "Lime wedges", 
            "Hot sauce"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/06/corn-and-black-bean-weeknight-nachos1.jpg?w=750", 
        "tags": [
            "Corn", 
            "Peppers", 
            "Photo", 
            "Summer", 
            "Tex-Mex", 
            "Travel", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/06/corn-and-black-bean-weeknight-nachos/", 
        "title": "corn and black bean weeknight nachos", 
        "directions": [
            "\nOver a gas flame or on a grill over high heat, char corn all over until at least half the kernels are blistered, and poblano until skin is blackened. Let both cool slightly then cut the corn kernels from the cob. Remove the skin and seeds from the poblano and cut it into very thin ribbons. (For a large one, you might only use half.)\nHeat oven to 400 degrees. Coat your largest baking sheet with foil (which I did not, and wish I had) and lightly coat it with oil. Arrange 1/3 of chips on tray and sprinkle 1/3 of corn, black beans, poblano strips and cheese over it. Repeat twice. Bake for 15 to 20 minutes, until the cheese has melted and blistered all over. Use this time to prep your toppings.\nWhen nachos are cooked, you can sprinkle a few toppings over (I used the jalapeños, radishes, tomatoes, onion, cilantro and avocado) or just bring everything to the table and let everyone fix their own.\n"
        ], 
        "date": "2016-06-17T10:29:35+00:00"
    }, 
    {
        "ingredient_list": [
            null, 
            "1/4 pound bacon, ideally thick-cut, diced", 
            "2 ears corn, shucked and kernels cut from cob", 
            "Salt and freshly ground black pepper or red pepper flakes", 
            "3 scallions, thinly sliced", 
            "1/3 cup finely grated parmesan", 
            "Fistful of fresh basil and chives, chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/07/img_3799.jpg?w=750", 
        "tags": [
            "Corn", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Recipes", 
            "Summer", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/07/corn-bacon-and-parmesan-pasta/", 
        "title": "corn, bacon and parmesan pasta", 
        "directions": [
            "\n"
        ], 
        "date": "2016-07-19T12:05:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup buttermilk (or make your own sour milk)", 
            "1/2 cup corn kernels (from most of one cob)", 
            "3 large eggs", 
            "2 tablespoons melted butter, cooled, divided", 
            "1 cup all-purpose flour", 
            "1 tablespoon yellow cornmeal", 
            "1 teaspoon granulated sugar", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "1 tablespoon snipped fresh chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/07/corn-buttermilk-and-chive-popovers.jpg?w=750", 
        "tags": [
            "Corn", 
            "Muffin/Quick Bread", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2011/07/corn-buttermilk-and-chive-popovers/", 
        "title": "corn, buttermilk and chive popovers", 
        "directions": [
            "Place buttermilk and corn in a blender together and blend for just 3 seconds — you’re looking to break up the corn a bit, not puree it. Add the eggs, one tablespoon of the melted butter and blend for one second more. Add the flour, cornmeal, sugar, salt, a few grinds of black pepper (I used four, not that you asked or that I’d expect a normal person to count) and the chives and blend again until barely combined, some lumps are fine.", 
            "Set the batter aside to rest while you preheat your oven to 375 degrees, about 15 minutes. Brush your popover, muffin or ramekin cups with the remaining tablespoon of butter. Fill each cup slightly more than halfway with batter (see top of recipe for cup estimates).", 
            "Bake popovers 30 to 35 minutes (see Note above about baking times in a muffin tin). Try not to open the oven door! Crack it just 1-inch to take a peak if absolutely necessary towards the end. Popovers are done when they’re tall and bronzed. Flip popovers out onto cooling rack and let cool for a few minutes before tearing in. Even then, they will be filled with steam and very hot in the middle — be careful. Eat with a great big summery salad on a deck somewhere, please."
        ], 
        "date": "2011-07-30T14:11:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon butter", 
            "3 cups fresh corn (cut from 3 small-to-average cobs)", 
            "1 1/2 cup thinly sliced scallions (both white and green parts from a 4-ounce bundle)", 
            "8 cups whole wheat, country or French bread in 1-inch cubes (weight will vary from 10 to 14 ounces, depending on bread type)", 
            "2 cups (6 ounces) coarsely grated sharp cheddar", 
            "1 cup (2 ounces) finely grated parmesan", 
            "9 large eggs", 
            "2 tablespoons mayonnaise (optional, see Note up top)", 
            "2 3/4 cups milk", 
            "1 teaspoon table salt or 2 teaspoons of a coarse sea salt", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/corn-cheddar-and-scallion-strata1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Corn", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/corn-cheddar-and-scallion-strata/", 
        "title": "corn, cheddar and scallion strata", 
        "directions": [
            "Generously butter a 3-quart baking dish (a lasagna or 9×13-inch pan works well here too). Toss corn and scallions together in a medium bowl. Combine cheeses in another bowl. In a large bowl, gently beat eggs and mayo together, then whisk in milk, salt and lots (or, if measuring, 1/2 teaspoon) of freshly ground black pepper. Spread one-third of bread cubes in prepared baking dish — it will not fully cover bottom of dish; this is fine. Add one-third of corn, then cheese mixture. Repeat layering twice with remaining bread, corn and cheese. Pour egg mixture evenly over strata. Cover with plastic wrap and refrigerate for at least 8 hours or up to 1 day.", 
            "When ready to bake, heat oven to 350 degrees F. Bake strata, uncovered, until puffed, golden brown and cooked through, about 45 to 55 minutes. Let stand 5 minutes before serving. ", 
            "Do ahead: Strata keeps baked in the fridge for 4 days or longer in the freezer, wrapped well. It reheats wonderfully, either from the fridge or freezer and holds up well in lunch boxes."
        ], 
        "date": "2014-09-03T11:00:41+00:00"
    }, 
    {
        "ingredient_list": [
            "4 thick slices of bacon (4 ounces), cut crosswise 1/2 inch thick", 
            "1 pound Yukon gold potatoes, peeled and cut into 1/2-inch dice", 
            "2 red bell peppers, cut into 1/2-inch dice, although I made mine smaller", 
            "6 large or 8 medium ears of corn, kernels removed (I used 8 large and it was a massive salad)", 
            "1 medium red onion, thinly sliced", 
            "1/4 cup cider vinegar", 
            "Salt and crushed red pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/08/corn-chowder-salad1.jpg?w=640", 
        "tags": [
            "Corn", 
            "Peppers", 
            "Photo", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/08/corn-chowder-salad/", 
        "title": "corn chowder salad", 
        "directions": [
            "Cook bacon: In a large frying pan, cook the bacon over moderately low heat, stirring a few times, until it is crisp, about 5 to 10 minutes. Using a slotted spoon, transfer the bacon to paper towels and let drain.", 
            "Fry potatoes, peppers and corn: Pour off all but 3 tablespoons of the bacon fat in the skillet. Add the potatoes and cook over moderately high heat until they start to brown, about about 3 to 6 minutes. Stir and cook for about 2 minutes longer, until almost tender; they’ll finish cooking with the other vegetables. Add the diced red peppers and cook, stirring occasionally, until the potatoes and peppers are tender, about 5 minutes. Add the corn kernels and cook, stirring, until heated through but still crisp, about 3 minutes.", 
            "Assemble and serve: Transfer the vegetables to a large bowl and stir in the onion, cider vinegar and bacon. Season with red pepper and salt to taste. Serve warm, or at room temperature."
        ], 
        "date": "2015-08-31T11:23:49+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon vegetable or olive oil", 
            "1 tablespoon unsalted butter", 
            "3 large leeks (about 1 1/2 pounds)", 
            "1 12-ounce bundle chard or about 6 cups (6 ounces) of leaves, cut into 1/2-inch ribbons", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "1 cup fresh corn kernels (cut from 1 to 2 medium ears corn)", 
            "Cornmeal, for sprinkling baking surface", 
            "4-ounce goat cheese log, cold"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/08/leek-chard-and-corn-flatbread.jpg?w=750", 
        "tags": [
            "Corn", 
            "Leeks", 
            "Photo", 
            "Picnics", 
            "Pizza", 
            "Summer", 
            "Swiss Chard", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/08/leek-chard-and-corn-flatbread/", 
        "title": "leek, chard and corn flatbread", 
        "directions": [
            "Trim the ends off your leeks and halve them lengthwise. Cut them crosswise into 1/2-inch half-rings. Fill a medium bowl with very cold water and drop in sliced leeks. Swish them around with your fingers, letting any sandy dirt fall to the bottom. Scoop out the leeks and drain them briefly on a towel, but no need to get them fully dry. Do the same with your chard ribbons, but you can leave the leaves on towels until they’re nearly fully dry, while you cook the leeks.", 
            "Heat your oven to 450 degrees. ", 
            "Heat a large, heavy skillet over medium heat. Once hot, add butter and oil and once they’re fully melted and a bit sizzly, add the leek slices. Reduce heat to low, cover with a lid and cook leek for 10 to 13  minutes, stirring occasionally. Raise heat back to medium, add the chard ribbons and cook until they wilt, about 4 minutes. Season mixture with salt and freshly ground black pepper, adding more if needed. Finally, add your corn kernels, cooking them with the leeks and chard for just another minute.", 
            "Sprinkle two baking sheets with cornmeal. If you have pesky old baking trays like I do, and your breads really like to stick to them, I find things will release more reliably if you first lightly spray them with an oil before sprinkling on the cornmeal. Roll or stretch half your dough into a rectangular-ish shape (flatbreads are prettiest when they’re irregularly shaped, in my humble opinion) and arrange it on the prepared sheet. Spread half the leek-corn-chard mixture on it. Sprinkle it with half the log of goat cheese, crumbled into small bits. ", 
            "Bake flatbread in oven for 10 to 15 minutes, until the edges of the bread begin to brown slightly (they might brown more deeply in a better oven than they did in my lousy one). Repeat with remaining dough, filling and goat cheese. ", 
            "To serve, slide each flatbread onto a cutting board and cut into 8 rectangles. Serve immediately. "
        ], 
        "date": "2012-08-28T14:58:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound fresh shell beans in pod or 1 cup frozen baby lima beans (I used 1/2 pound fresh cranberry beans, 1/2 pound fresh lima beans)", 
            "1/4 pound bacon (about 4 slices)", 
            "1 1/2 tablespoons olive oil", 
            "1 small Vidalia onion or other sweet onion, chopped", 
            "1 large garlic clove, minced", 
            "3/4 pound cherry tomatoes (about 1 1/2 pints), halved", 
            "Fresh kernels from 4 ears corn", 
            "1 tablespoon sherry vinegar, plus more to taste", 
            "1/4 cup packed small fresh basil leaves (I used less)", 
            "1/4 cup packed small fresh arugula leaves (I used more)", 
            "1 garlic clove, peeled and halved", 
            "1 round loaf crusty bread", 
            "2 tablespoons extra-virgin olive oil", 
            "Salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/4819859550_857986cd86_o.jpg?w=748", 
        "tags": [
            "Arugula", 
            "Beans", 
            "Corn", 
            "Photo", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2010/07/summer-succotash-with-bacon-and-croutons/", 
        "title": "summer succotash with bacon and croutons", 
        "directions": [
            "Cut three 1-inch-thick slices from middle of loaf and brush bread with oil. Lightly oil a well-seasoned ridged grill pan and heat over moderately high heat until hot but not smoking. Grill bread until golden brown on both sides. Alternately, you can run toasts under the broiler for a minute. Remove from heat and immediately rub bread both sides with cut side of garlic and sprinkle with salt. Cut into cubes and toss into succotash."
        ], 
        "date": "2010-07-25T08:17:19+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons butter (1 ounce or 28 grams), plus additional for brushing pan", 
            "3/4 cup kernels cut from one large ear sweet fresh corn", 
            "1/8 teaspoon (1 gram) salt plus additional for seasoning corn", 
            "1 large egg", 
            "1 1/4 cups (296 ml) buttermilk", 
            "1/4 teaspoon vanilla extract", 
            "1 tablespoon (13 grams) sugar", 
            "3/4 cup (3 3/8 ounces) all-purpose flour", 
            "1/4 cup (3/4 ounce or 22 grams) cornmeal, any kind", 
            "1 teaspoon (5 grams) baking powder", 
            "1/2 teaspoon baking soda"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/08/4895873895_4fd0805304_o.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Corn", 
            "Pancakes", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/08/sweet-corn-pancakes/", 
        "title": "sweet corn pancakes", 
        "directions": [
            "Melt butter in a large cast iron skillet or griddle pan over medium heat. Add corn and saute for 4 to 5 minutes, until it begins to brown ever-so-slightly. Sprinkle with salt and set aside to cool. Wipe out skillet.", 
            "Lightly beat egg in the bottom of a large bowl, then whisk in buttermilk, corn, vanilla and sugar.  In a smaller bowl, whisk flour, cornmeal, baking powder, baking soda and 1/8 teaspoon salt. Stir dry ingredients into wet, mixing until just combined but still lumpy in appearance.", 
            "Reheat your skillet or saute pan to medium. Brush the pan with butter and ladle 1/4 cup batter at a time, 2 inches apart. When the pancakes have bubbles on top and are slightly dry around the edges, flip them over and cook them until golden brown underneath. If they seem to be cooking too quickly (dark on the outside, raw centers) turn your heat down to low for the next batch and inch it up as needed. Repeat with remaining batter, and serve immediately with a pat of salted butter and a healthy dose of maple syrup."
        ], 
        "date": "2010-08-17T11:12:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup cornmeal", 
            "2 3/4 cups whole milk", 
            "4 tablespoons unsalted butter, plus additional for greasing dish", 
            "2 cups corn kernels (from 3 to 4 ears of corn, or frozen, if defrosted and well drained)", 
            "1 teaspoon sugar", 
            "1 teaspoon salt", 
            "1/8 teaspoon cayenne", 
            "3 large eggs, separated", 
            "1/4 teaspoon cream of tartar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/11/sweet-corn-spoonbread.jpg?w=750", 
        "tags": [
            "Corn", 
            "Gluten-Free", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2010/11/sweet-corn-spoonbread/", 
        "title": "sweet corn spoonbread", 
        "directions": [
            "Preheat oven to 400°F (see Note above if this seems too early). Very generously grease a 1 1/2 quart soufflé dish or an 8-inch square baking dish. Whisk cornmeal and 3/4 cup of milk in a small bowl until combined and set aside.", 
            "Melt butter in a Dutch oven or large, heavy pot over medium-high heat. Cook corn until beginning to brown, which can take as little as 3 minutes with fresh corn but with defrosted frozen corn, took me closer to 10 minutes. Stir in sugar, salt, cayenne and remaining 2 cups milk and bring to a boil. Remove from heat, cover, and let mixture steep for 15 minutes.", 
            "If you’ve got an immersion blender, please use it to save time. Otherwise, transfer mixture to a blender or food processor and puree until smooth. Back in the pot (or still, if it had never left) bring it back to a boil, reduce heat to low and add the cornmeal-milk mixture, whisking constantly until thickened, about 2 to 3 minutes. If you want to do fewer dishes and don’t mind if it takes longer to cool, you can leave it in the pot. Otherwise, transfer to a large bowl and return mixture to room temperature, about 20 minutes.", 
            "Once cool, whisk in egg yolks. Beat egg whites and cream of tartar in a medium bowl until stiff peaks form and fold it in to the corn mixture, one-third at a time. Pour batter into prepared baking dish and baked until spoonbread is golden brown and has risen above rim of dish, about 45 minutes. Serve immediately."
        ], 
        "date": "2010-11-24T10:46:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup pearl barley", 
            "1/2 pound haricot vert (slim green beans) trimmed and cut into 2″ segments", 
            "1 large ear corn", 
            "1 large bunch of arugula (about 4 ounces total)", 
            "1/4 cup extra-virgin olive oil", 
            "1/8 cup white wine vinegar", 
            "2 tablespoons minced shallots", 
            "1 tablespoon minced fresh thyme", 
            "1 teaspoon Dijon mustard", 
            "4 tablespoons soft fresh goat cheese (such as Montrachet), crumbled "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-new-recipe-smell1.jpg?w=500", 
        "tags": [
            "Corn", 
            "Grain/Rice", 
            "Green Beans", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/05/the-new-recipe-smell/", 
        "title": "barley, corn and haricot vert salad", 
        "directions": [
            "Cook barley in medium saucepan of boiling salted water until tender, about 30 to 40 minutes. Drain; cool. Transfer to large bowl.", 
            "Cook haricot vert in large pot of boiling salted water until crisp-tender, about 3 minutes. Don’t drain water. Transfer beans to bowl of ice water to cool. Drain well. Transfer to bowl with barley. Add corn to boiling water and cook for 2 to 3 minutes, then also plunge in ice water. Dry and cut kernels from cob, then add to salad bowl. Coarsely chop washed and dried arugula; add to bowl with barley mixture.", 
            "Whisk olive oil, vinegar, shallots, thyme and Dijon mustard in small bowl to blend. Pour enough dressing over barley mixture to coat. Season salad to taste with salt and pepper. Sprinkle with goat cheese and serve alongside any remaining dressing."
        ], 
        "date": "2007-05-02T10:09:11+00:00"
    }
]