[
    {
        "ingredient_list": [
            "For squash soup", 
            "3/4 stick (6 tablespoons) unsalted butter, cut into pieces", 
            "1 medium onion, halved lengthwise and thinly sliced crosswise", 
            "1/2 teaspoon salt", 
            "2 lb yellow summer squash, halved and thinly sliced", 
            "2 carrots, thinly sliced", 
            "1 yellow-fleshed potato (1/2 pound), peeled, halved, and thinly sliced", 
            "4 cups chicken stock or reduced-sodium chicken broth", 
            "For pistou**", 
            "3/4 cup loosely packed fresh mint leaves", 
            "1/2 cup loosely packed fresh flat-leaf parsley sprigs", 
            "1 large scallion, chopped (1/2 cup)", 
            "1/4 cup extra-virgin olive oil", 
            "2 tablespoons water", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/a-soup-to-build-dream-on1.jpg?w=500", 
        "tags": [
            "Carrots", 
            "Gluten-Free", 
            "Photo", 
            "Potatoes", 
            "Soup", 
            "Summer", 
            "Summer Squash"
        ], 
        "url": "https://smittenkitchen.com/2006/09/a-soup-to-build-dream-on/", 
        "title": "summer squash soup", 
        "directions": [], 
        "date": "2006-09-11T09:26:32+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large carrot, peeled and roughly chopped", 
            "1 small shallot, peeled and roughly chopped", 
            "2 tablespoons roughly chopped fresh ginger", 
            "2 tablespoons white miso", 
            "2 tablespoons rice vinegar", 
            "2 tablespoons toasted sesame seed oil", 
            "1/4 cup grape seed or another neutral oil", 
            "2 tablespoons water", 
            "1 small/medium head of lettuce (I used Bibb)", 
            "1/4 red onion, thinly sliced", 
            "1 avocado, quartered and thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/avocado-salad-with-carrot-ginger-dressing.jpg?w=750", 
        "tags": [
            "Avocado", 
            "Carrots", 
            "Photo", 
            "Salad", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/04/avocado-salad-with-carrot-ginger-dressing/", 
        "title": "avocado salad with carrot-ginger dressing", 
        "directions": [
            "Make the dressing: Whiz the carrots, shallot and ginger in a blender or food processor until finely chopped. Scrape down the sides, then add the miso, vinegar and sesame oil. While the machine running, slowly drizzle in the grape seed oil and the water.\nAssemble salad: Trim and chop lettuce into small wedges. Arrange on a platter. Scatter onion and avocado on top.* If you’d like, and I do, sprinkle some flaky sea salt and black pepper over the salad at this point. Dollop with plenty of dressing and serve with remaining dressing on the side.I also added a few strips of purple and yellow carrot on top that had been cut with a juleinne peeler, plus some snipped chives. Toasted black and white sesame seeds would also make a pretty garnish here."
        ], 
        "date": "2010-04-26T17:25:21+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1 cup all-purpose flour", 
            "1 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon table salt", 
            "1/2 teaspoon ground cinnamon", 
            "1/2 teaspoon freshly grated nutmeg (I used a smidge less)", 
            "1/8 teaspoon ground ginger", 
            "2 tablespoons chopped walnuts (optional, I skipped them)", 
            "2 tablespoons golden raisins (optional, ditto)", 
            "1 large egg", 
            "2 tablespoons packed brown sugar", 
            "1 cup buttermilk", 
            "1 teaspoon pure vanilla extract", 
            "2 cups finely grated carrots (from about a 3/4 pound bundle whole carrots)", 
            "3 tablespoons butter, for griddle", 
            "Cream cheese topping", 
            "4 ounces cream cheese, at room temperature", 
            "1/4 cup powdered sugar", 
            "2 to 3 tablespoons milk", 
            "1/2 teaspoon pure vanilla extract", 
            "Dash of ground cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/03/carrot-cake-pancakes.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Carrots", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/03/carrot-cake-pancakes/", 
        "title": "carrot cake pancakes", 
        "directions": [
            "Place a rack in the upper third of your oven and preheat to 200°F. This will keep the pancakes warmed as they’re fried in batches.", 
            "To make the pancakes: In a large bowl, whisk together flour, baking powder, baking soda, salt, cinnamon, nutmeg, ginger and, if using, nuts and raisins. In a small bowl, whisk together the egg, brown sugar, buttermilk and vanilla. Stir in carrots. Stir carrot mixture into dry ingredients, stirring until just Incorporated. Let rest for five minutes while you make the cream cheese topping.", 
            "To make the cream cheese topping: In a small bowl, beat the cream cheese until fluffy and lump-free. Whisk in powdered sugar, two tablespoons milk, vanilla and cinnamon. If you’d like the mixture thinner, add the remaining tablespoon of milk (I did not).", 
            "Over medium heat, melt 1 tablespoon butter in a cast-iron skillet or griddle pan. Spoon 2 tablespoons batter into the hot pan per pancake (to me, this seemed like too little but after experimenting with larger pancakes, I advise you to listen to Joy; It’s a wiggly batter and much easier to and cook in small puddles), flipping once, until pancakes are golden on both sides, about 2 minutes per side. Transfer finished pancakes to a serving dish or tray in the oven, to keep warm while you repeat the process with the remaining batter, adding more butter as needed.", 
            "Serve warm with cream cheese topping. "
        ], 
        "date": "2012-03-19T16:45:10+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/3 cups (290 grams) all-purpose flour", 
            "3/4 teaspoon (5 grams) table or fine sea salt", 
            "2 teaspoons (10 grams) baking powder (I prefer aluminum-free)", 
            "1 1/4 teaspoon ground cinnamon", 
            "1/4 teaspoon ground or a bunch of gratings of whole nutmeg", 
            "1/8 teaspoon ground cloves", 
            "1/2 cup (120 ml) olive oil", 
            "3/4 cup (145 grams) dark brown sugar", 
            "2 large eggs", 
            "1 cup cider (235 ml, see buying suggestions below)", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 1/2 cups packed coarsely grated carrots from about 9 ounces (2 to 2 1/2 meaty/large or 4 to 5 slim; about 255 grams) whole carrots", 
            "Olive oil or nonstick cooking spray for baking pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/carrot-cake-with-cider-and-olive-oil1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Carrots", 
            "Dairy-Free", 
            "Everyday Cakes", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/10/carrot-cake-with-cider-and-olive-oil/", 
        "title": "carrot cake with cider and olive oil", 
        "directions": [
            "Heat oven to 350 degrees. Coat a 9×5-inch loaf pan* with olive oil or a nonstick cooking spray. If yours is old and you’re nervous about the cake sticking, it cannot hurt to line yours with a fitted rectangle of parchment paper.", 
            "In a large bowl, whisk together flour, salt, baking powder, cinnamon, nutmeg and cloves. In a medium bowl, whisk together olive oil, brown sugar, eggs, cider and vanilla. Stir grated carrots into wet ingredients until evenly coated, then stir wet ingredients into dry just until no floury bits remain. ", 
            "Pour into prepared pan and bake for 60 to 70 minutes, until a skewer inserted into the center comes out batter-free. Let cool in loaf pan for 20 to 30 minutes, then remove from pan and cool the rest of the way on a rack. Loaf should keep at room temperature for a few days, and longer in the fridge. It’s even more moist on the second day.", 
            "Whatever you do, definitely avoid making a cream cheese frosting-like spread whipped together from 4 ounces of softened cream cheese, 2 tablespoons softened unsalted butter, 1/2 teaspoon vanilla extra and 6 tablespoons powdered sugar, some of which can be replaced with honey or maple syrup but will make for a softer spread. It will unquestionably compromise this cake’s dairy-free status. It might be dangerously good.", 
            "Notes: "
        ], 
        "date": "2014-10-16T11:58:27+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups all purpose flour", 
            "2 teaspoons baking soda", 
            "1 teaspoon table salt", 
            "2 teaspoons ground cinnamon", 
            "1/2 teaspoon ground nutmeg", 
            "1 teaspoon ground ginger", 
            "2 cups granulated sugar", 
            "1 1/4 cups canola oil", 
            "4 large eggs", 
            "3 cups grated peeled carrots", 
            "1 cups coarsely chopped walnuts (optional)", 
            "1/2 cup raisins (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/carrot-cake-with-maple-cream-cheese-frosting1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Carrots", 
            "Celebration Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/12/carrot-cake-with-maple-cream-cheese-frosting/", 
        "title": "carrot cake with maple-cream cheese frosting", 
        "directions": [
            "In a stand mixer beat all the ingredients on medium until fluffy. Chill the frosting for 10 to 20 minutes, until it has set up enough to spread smoothly.", 
            "The spazzy star decorations were created by putting the maple cream cheese frosting into a piping bag fitted with a large star tip and dolloping away. An extra layer of dollops were piped nearer to the center, to create a domed effect.", 
            "To assemble a carrot layer cake, frost the top of one cake, place the other cake on top. Frost the sides and top, swirling decoratively. Refrigerate the cake for 30 minutes to set up frosting.", 
            "For the layer cake scenario, you will probably have a bit of leftover frosting, which you can tint and use for decorating, or save to smear on gingersnaps. What, you don’t do that too?"
        ], 
        "date": "2008-12-08T15:31:28+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake layers", 
            "1 cup (125 grams) all-purpose flour", 
            "3/4 cup (95 grams) finely ground graham cracker crumbs, plus extra for decoration if you wish", 
            "3/4 teaspoon baking soda", 
            "1 1/2 teaspoons baking powder", 
            "3/4 teaspoon fine sea or table salt", 
            "1 1/2 teaspoons ground cinnamon", 
            "1/4 teaspoon ground nutmeg or a bunch of gratings of fresh", 
            "3/4 teaspoon ground ginger", 
            "3/4 cup (150 grams) granulated sugar", 
            "3/4 cup (145 grams) dark brown sugar", 
            "3/4 cup plus 3 tablespoons (210 grams) neutral oil or melted butter (i.e. 1 tablespoon short of 1 cup)", 
            "3 large eggs", 
            "3 cups (about 12 3/4 ounces or 360 grams) peeled and grated carrots (2 cups = 8.5 ounces, peeled/grated)", 
            "Filling", 
            "2 (8-ounce) packages cream cheese, softened (455 grams total)", 
            "1 cup (2 sticks, 8 ounces or 230 grams) unsalted butter, at room temperature", 
            "2 cups (240 grams) powdered sugar, sifted if lumpy", 
            "2 teaspoons vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/carrot-graham-layer-cake1.jpg?w=640", 
        "tags": [
            "Carrots", 
            "Celebration Cakes", 
            "Easter", 
            "Photo", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2015/03/carrot-graham-layer-cake/", 
        "title": "carrot graham layer cake", 
        "directions": [
            "Make the cake: Heat oven to 350°F (175°C). Line three 9-inch cake pans with a fitted round of parchment paper and coat with a nonstick cooking spray. Don’t have three matching cake pans? Me neither. As soon as you finish baking and unmolding the first cake layer, wipe out the baking pan, put down a new round of parchment and coat the pan with spray before using it again. ", 
            "In a large bowl, whisk together flour, graham crumbs, baking soda, baking powder, salt, cinnamon, nutmeg and ginger. In a medium-sized bowl, whisk (yes, you can use the same one) together the sugars, oil and eggs until smooth. Stir in grated carrots. Pour wet ingredients into dry and stir until flour just disappears. ", 
            "Pour batter evenly between three prepared baking pans. Bake each layer for 15 to 18 minutes, until a tester comes out clean. Cake will seem soft and likely still sticky on top. Let rest in cake pans for 5 minutes on a cooling rack, then run a knife around the edges of the first cake layer to ensure no parts are sticking to the sides, flip cake out onto cooling rack, remove parchment paper and flip back right-side-up on another cooling rack. Repeat with remaining layers and let the cake layers cool completely before filling. To hurry the cooling process along, and to make this very soft cake easier to handle, you can place cake layers in your freezer until cool and slightly firm. ", 
            "Fill the cake With an electric mixer, beat cream cheese and butter together until smooth and fluffy. Beat in powdered sugar, a little at a time. Beat in vanilla until combined. ", 
            "Arrange first cake layer on a cake plate or stand. Spread top with frosting; repeat twice with remaining layers. If desired, sprinkle top decoratively with extra graham crumbs — I used a cookie cutter to make a loose outline of a flower shape on mine. Let cake chill until serving. ", 
            "Do ahead: Cake is wonderful on the first day, and even more moist on the second and third and I’ve never met a person who had one last four days. Keep in fridge. To prepare further in advance, you can make the cake layers, wrap them well and freeze them until you’re ready to fill the cake. "
        ], 
        "date": "2015-03-26T12:03:35+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 pound carrots, peeled, trimmed and coarsely grated", 
            "4 tablespoons olive oil", 
            "1 crushed clove of garlic", 
            "1/2 teaspoon caraway seeds or about half as much, ground (I used seeds but ground them first)", 
            "3/4 teaspoon cumin seeds or about half as much, ground (I used the seed but ground them first, again)", 
            "1/2 teaspoon paprika", 
            "3/4 teaspoon harissa (for a solid kick of heat; adjust yours to taste, and to the heat level of your harissa)", 
            "1/2 teaspoon sugar", 
            "3 tablespoons lemon juice", 
            "2 tablespoons flat leaf parsley, finely chopped", 
            "2 tablespoons fresh mint, finely chopped", 
            "100 grams feta, crumbled or chopped into bits"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/carrot-salad-with-harissa-feta-mint.jpg?w=750", 
        "tags": [
            "Carrots", 
            "North African", 
            "Photo", 
            "Salad", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/05/carrot-salad-with-harissa-feta-and-mint/", 
        "title": "carrot salad with harissa, feta and mint", 
        "directions": [
            "In a small sauté pan, cook the garlic, caraway, cumin, paprika, harissa and sugar in the oil until fragrant, about one to two minutes. Remove from heat and add the lemon juice and a pinch of salt. Pour over the carrots and mix. Add the herbs and mix. Leave to infuse for an hour and add the feta before eating. With a fork.", 
            "Harissa: Is a North African chile paste that has become so popular, we were tickled to find it all over tables in Paris two years ago, right next to the Dijon mustard. There is almost nothing it doesn’t make more delicious: eggs, potatoes, stews, couscous, sandwiches and more, and there are almost as many recipes as there are people who consume it. Most boil down to hot chiles ground with garlic, cumin, coriander, caraway and olive oil, often with a smidge of sundried tomatoes. You can make your own (I’ve been eying this recipe for some time) or you can buy some (I brought home this brand, which we love). The adavantage of making your own, as always, is that you can adjust the recipe to suit your tastes and desired level of heat."
        ], 
        "date": "2010-05-17T16:05:52+00:00"
    }, 
    {
        "ingredient_list": [
            "Chickpeas", 
            "1 3/4 cups cooked chickpeas, or 1 15-ounce can, drained and patted dry on paper towels", 
            "1 tablespoon olive oil", 
            "1/2 teaspoon coarse sea salt", 
            "1/4 teaspoon ground cumin", 
            "Salad", 
            "1 pound carrots, peeled and coarsely grated", 
            "1/4 cup coarsely chopped parsley", 
            "1/4 cup shelled, salted pistachios, coarsely chopped", 
            "Dressing", 
            "1 medium garlic clove, minced", 
            "1/4 cup lemon juice", 
            "3 tablespoons well-stirred tahini", 
            "2 tablespoons water, plus more if needed", 
            "2 tablespoons olive oil", 
            "Salt and red pepper flakes to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/carrot-salad-with-tahini-and-crisped-chickpeas1.jpg?w=640", 
        "tags": [
            "Carrots", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/05/carrot-salad-with-tahini-and-crisped-chickpeas/", 
        "title": "carrot salad with tahini and crisped chickpeas", 
        "directions": [
            "Roast chickpeas: Heat oven to 425 degrees F. Toss chickpeas with one tablespoon olive oil, salt and cumin until they’re all coated. Spread them on a baking sheet or pan and roast them in the oven until they’re browned and crisp. This can take anywhere from 15 to 20 minutes, depending on the size and firmness of your chickpeas. Toss them occasionally to make sure they’re toasting evenly. Set aside until needed.", 
            "Make dressing: Whisk all ingredients together until smooth, adding more water if needed to thin the dressing slightly. Taste and adjust seasoning; don’t worry if it tastes a little sharp on the lemon, it will marry perfectly with the sweet grated carrots.", 
            "Assemble salad: Place grated carrots in large bowl and toss with parsley. Mix in 2/3 of the dressing, adding more if desired. Add more salt and pepper if needed. Sprinkle with a large handful of chickpeas (you’ll have extra and if you’re like us, won’t regret it) and pistachios and dig in.", 
            "Do ahead: Salad keeps well in the fridge for two days, however, I’d add the chickpeas and pistachios right before serving, so they don’t get soft."
        ], 
        "date": "2014-05-29T10:45:11+00:00"
    }, 
    {
        "ingredient_list": [
            "Soup", 
            "2 tablespoons olive oil", 
            "2 pounds carrots, peeled, thinly sliced", 
            "1 large onion, finely chopped", 
            "4 regular or 6 small garlic cloves, peeled and smashed", 
            "1 tablespoon finely chopped or grated ginger, or more to taste (it could easily be doubled)", 
            "4 cups vegetable broth", 
            "1/4 cup white miso paste, or more to taste", 
            "To finish", 
            "Drizzle of toasted sesame oil", 
            "2 scallions, very thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/carrot-soup-with-miso-and-sesame1.jpg?w=500", 
        "tags": [
            "Carrots", 
            "Gluten-Free", 
            "Photo", 
            "Quick", 
            "Soup", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/01/carrot-soup-with-miso-and-sesame/", 
        "title": "carrot soup with miso and sesame", 
        "directions": [
            "Heat oil in heavy large saucepan over medium heat. Add carrots, onion and garlic sauté until onion is translucent, about 10 minutes. Add broth and ginger. Cover and simmer until carrots are tender when pierced, stirring occasionally, about 30 minutes. ", 
            "Puree soup in batches in blender, or all at once with an immersion blender. In a small bowl, whisk together the miso an a half-cup of the soup. Stir the mixture back into the pot of soup. Taste the soup and season with salt, pepper or additional miso to taste.", 
            "Ladle into bowls and garnish each with a drizzle of sesame oil and small mound of scallions.", 
            "Pickled scallions? I didn’t do this in the end, but was tempted to lightly pickled the scallions by letting them hang out in a mixture of 6 tablespoons rice vinegar, 2 tablespoons water, 1 tablespoon of Kosher salt (I use Diamond brand, use less if you’re using Morton or another, which are more dense) and 1 1/2 teaspoons sugar for a while before using them as garnish. "
        ], 
        "date": "2012-01-03T10:41:23+00:00"
    }, 
    {
        "ingredient_list": [
            "Soup", 
            "2 tablespoons (30 ml) olive oil", 
            "2 pounds (905 grams) carrots, peeled, diced or thinly sliced", 
            "1 large onion, finely chopped", 
            "4 regular or 6 small garlic cloves, peeled and smashed", 
            "1/4 teaspoon ground coriander", 
            "1/2 teaspoon ground cumin", 
            "1/2 teaspoon table salt, plus more if needed", 
            "Pinch of Aleppo pepper or red pepper flakes", 
            "4 cups (945 ml) vegetable broth", 
            "Crisped chickpeas", 
            "1 3/4 cups cooked chickpeas, or 1 15-ounce (425-gram) can, drained, patted dry on paper towels", 
            "1 generous tablespoon (15 ml or so) olive oil", 
            "1/2 teaspoon coarse salt", 
            "1/4 teaspoon ground cumin", 
            "Lemon-tahini dollop", 
            "3 tablespoons (25 grams) tahini paste", 
            "2 tablespoons (30 ml) lemon juice", 
            "Pinch or two of salt", 
            "2 tablespoons (30 ml) water", 
            "Pita wedges, garnish", 
            "A few large pitas, cut into 8 wedges", 
            "Olive oil, to brush pitas", 
            "Za’atar (a Middle Eastern spice-herb blend) or sesame seeds and sea salt to sprinkle", 
            "2 tablespoons flat-leaf parsley, coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/carrot-soup-with-tahini-and-crisped-chickpeas1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Carrots", 
            "Gluten-Free", 
            "Soup", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/01/carrot-soup-with-tahini-and-crisped-chickpeas/", 
        "title": "carrot soup with tahini and crisped chickpeas", 
        "directions": [
            "Heat two tablespoons olive oil in heavy large pot over medium heat. Add carrots, onion, garlic, coriander, cumin, salt and pepper flakes and sauté until they begin to brown, about 15 minutes. ", 
            "Meanwhile, heat your oven to 425 degrees F. Toss chickpeas with one tablespoon olive oil, salt and cumin until they’re all coated. Spread them on a baking sheet or pan and roast them in the oven until they’re browned and crisp. This can take anywhere from 10 to 20 minutes, depending on the size and firmness of your chickpeas. Toss them occasionally to make sure they’re toasting evenly.", 
            "Once vegetables have begun to brown, add broth, using it to scrape up any bits stuck to the bottom of the pot. Cover pot with lid and simmer until carrots are tender, stirring occasionally, about 30 minutes. ", 
            "Meanwhile, in a small dish, whisk together tahini, lemon juice, salt and water until smooth with a yogurt-like consistency. If more liquid is needed to thin it, you can add more lemon juice or water, a spoonful at a time, until you get your desired consistency.", 
            "Spread pita wedges on a second baking sheet and brush lightly with olive oil. Sprinkle with za’atar or a combination of sea salt and sesame seeds and toast in oven with chickpeas until brown at edges, about 5 minutes.", 
            "Puree soup in a blender or with an immersion blender until smooth. Ladle into bowls. Dollop each with lemon-tahini, sprinkle with crisped chickpeas and garnish with chopped parsley. Serve with pita wedges. Forget January, you’d eat this anytime. Right?"
        ], 
        "date": "2013-01-03T12:24:36+00:00"
    }, 
    {
        "ingredient_list": [
            "Muffins", 
            "1/4 cup (60 ml) olive oil", 
            "1/4 cup (30 grams) well-stirred tahini", 
            "1/2 cup (80 grams) firmly packed light brown sugar", 
            "2 large eggs", 
            "3/4 cup (175 ml) buttermilk, almond milk or (nonalcoholic) apple cider", 
            "1 teaspoon (5 ml) vanilla extract", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/4 teaspoon fine sea salt", 
            "2 cups (260 grams) all-purpose flour (see Note)", 
            "2 cup packed coarsely grated carrots (from about 9 ounces or 5 slim carrots)", 
            "Glaze (optional)", 
            "1/2 cup (60 grams) powdered sugar", 
            "3 tablespoons (25 grams) tahini", 
            "2 tablespoons (30 ml) water", 
            "Toasted sesame seeds for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/carrot-tahini-muffins1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Carrots", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/04/carrot-tahini-muffins/", 
        "title": "carrot tahini muffins", 
        "directions": [
            "Heat oven to 425 degrees F. Whisk olive oil, tahini and brown sugar together in the bottom of a large bowl. Whisk in eggs, then buttermilk and vanilla. Whisk in baking powder, baking soda and salt, then switch to a spoon or flexible spatula and stir in flour, then carrots, mixing just until combined. ", 
            "Either line a 12-cup standard muffin pan with paper liners or coat them with a nonstick spray. Fill each about 3/4 of the way with batter. You’ll probably have enough for 2 more after this, so you can hold some back if needed. Bake muffins for 14 to 16 minutes, or until a tester inserted into the center of each comes out batter-free. Muffins should be domed and lightly golden on top. Let them cool in pan for 5 minutes on a rack before transferring them to the cooling rack to cool completely.", 
            "If you’d like to glaze your muffins, whisk powdered sugar, tahini and water together in a medium dish. Either drizzle this over the cooled muffins or dunk them into the puddle. Sprinkle with sesame seeds, if desired. "
        ], 
        "date": "2016-04-07T12:01:19+00:00"
    }, 
    {
        "ingredient_list": [
            "Dipping sauce", 
            "6 tablespoons Asian fish sauce", 
            "6 tablespoons brown sugar", 
            "12 tablespoons lime juice", 
            "2 garlic cloves, finely grated or minced", 
            "Small Thai or Serrano chiles, thinly sliced, to taste ", 
            "Peanut dressing", 
            "3 tablespoons Asian fish sauce", 
            "3 tablespoons rice vinegar", 
            "9 tablespoons lime juice", 
            "3 tablespoons soy sauce", 
            "1 one-and-a-half inch chunk ginger, peeled and sliced", 
            "6 tablespoons natural unsalted peanut butter", 
            "1 tablespoon toasted sesame oil", 
            "Pinch of cayenne ", 
            "Chicken and noodle salad", 
            "1 1/4 pounds boneless skinless chicken thighs (about 6)", 
            "8 ounces dried rice vermicelli or other rice noodles", 
            "2 small cucumbers, cut in 1/4-inch half moons", 
            "2 medium carrots, cut in thin julienne", 
            "Additional vegetables, as suggested above", 
            "Small handful basil or mint or cilantro sprigs, or your favorite of the three (torn or roughly chopped)", 
            "4 or more scallions, slivered", 
            "1/4 cup crushed or chopped roasted peanuts", 
            "Lime wedges (to serve)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/06/cold-rice-noodles-with-peanut-lime-chicken.jpg?w=751", 
        "tags": [
            "Carrots", 
            "Chicken", 
            "Citrus", 
            "Cucumber", 
            "Pasta", 
            "Photo", 
            "Summer", 
            "Thai", 
            "Vietnamese"
        ], 
        "url": "https://smittenkitchen.com/2012/06/cold-rice-noodles-with-peanut-lime-chicken/", 
        "title": "cold rice noodles with peanut-lime chicken", 
        "directions": [
            "Make the dipping sauce: Whisk ingredients in a small serving bowl, making sure to dissolve the sugar. Leave to ripen for 15 minutes. Refrigerate any extra and use within a few days. ", 
            "Make the peanut dressing: In a blender or small food processor, puree all ingredients to a smooth sauce, about the thickness of heavy cream. Pour into a serving bowl. ", 
            "Marinate the chicken: Stir together 1/2 the dipping sauce and 1/3 the peanut dressing (you can eyeball this) in the bottom of a low-sided bowl or dish. Add the chicken to the mixture and toss to coat. Let marinate at least 15 minutes.", 
            "Cook the noodles: Bring a large pot of water to the boil, then turn off the heat. Add the rice vermicelli and soak for 7 to 8 minutes. (Package directions may vary; check for doneness by tasting.) Drain when noodles are al dente, and cool under running water. Fluff and leave in strainer to drain well.", 
            "Cook the chicken: Grill the chicken on an outdoor grill, a stove-top grill pan, or run under the broiler until nicely browned, about 3 to 4 minutes a side. Let cool slightly, then chop roughly into 3/4-inch pieces. ", 
            "To serve: At this point, you can place everything on a large serving platter, with piles or small bowls for noodles, vegetables, chicken, the dressing and marinade and toppings (peanuts, herbs) and let your family and friends put it together in their own bowls as they wish. Or, you can assemble it for everyone as suggested:", 
            "Toss vegetables with 1 tablespoon dipping sauce in a small bowl. Divide the cooked noodles among 4 to 6 bowls. Top each bowl equally with vegetable mixture and chopped chicken. Toss each bowl with 2 teaspoons of each the dipping sauce and dressing, or more to taste (we wanted more). Add the herbs, peanuts and scallions to each bowl and serve with additional dressing and dipping sauce on the side. "
        ], 
        "date": "2012-06-22T11:02:12+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1/2 small head cabbage, very thinly sliced (1 pound or 5 to 6 cups shreds) which will be easiest on a mandoline if you have one", 
            "4 medium carrots, peeled into ribbons with a vegetable peeler", 
            "5 lacinato kale leaves, ribs removed, leaves cut into thin ribbons", 
            "4 scallions, thinly sliced on an angle", 
            "1 teaspoon kosher salt", 
            "1/2 cup all-purpose flour", 
            "6 large eggs, lightly beaten", 
            "Canola, safflower or peanut oil for frying", 
            "Tangy Sauce", 
            "1/4 cup ketchup", 
            "1 1/2 tablespoons Worcestershire sauce (note: this is not vegetarian)", 
            "1/4 teaspoon dijon mustard", 
            "1 tablespoon rice cooking wine or sake", 
            "1 teaspoon soy sauce", 
            "1 tablespoon honey (use 2 if you like a sweeter sauce)", 
            "1/8 teaspoon ground ginger"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/japanese-vegetable-pancakes.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cabbage", 
            "Carrots", 
            "Japanese", 
            "Kale", 
            "Lunch", 
            "Pancakes", 
            "Put An Egg On It", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/05/japanese-cabbage-and-vegetable-pancakes/", 
        "title": "japanese vegetable pancakes", 
        "directions": [
            "Make the pancakes: Toss cabbage, carrot, kale, scallions and salt together in a large bowl. Toss mixture with flour so it coats all of the vegetables. Stir in the eggs. Heat a large heavy skillet on medium-high heat. Coat the bottom with oil and heat that too. ", 
            "To make a large pancake, add 1/4 of the vegetable mixture to the skillet, pressing it out into a 1/2- to 3/4-inch pancake. Gently press the pancake down flat. Cook until the edges beging to brown, about 3 minutes. 30 seconds to 1 minute later, flip the pancake with a large spatula. (If this is terrifying, you can first slide the pancake onto a plate, and, using potholders, reverse it back into the hot skillet.) Cook on the other side until the edges brown, and then again up to a minute more (you can peek to make sure the color is right underneath).", 
            "To make small pancakes, you can use tongs but I seriously find using my fingers and grabbing little piles, letting a little batter drip back into the bowl, and depositing them in piles on the skillet easier, to form 3 to 4 pancakes. Press down gently with a spatula to they flatten slightly, but no need to spread them much. Cook for 3 minutes, or until the edges brown. Flip the pancakes and cook them again until brown underneath. ", 
            "Regardless of pancake size, you can keep them warm on a tray in the oven at 200 to 250 degrees until needed. ", 
            "If desired, make okonomiyaki sauce: Combine all sauce ingredients in a small saucepan and let simmer for 3 to 5 minutes, until smooth and thick. ", 
            "Serve pancakes with sauce and any of the other fixings listed above, from Japanese mayo to scallions and toasted sesame seeds. ", 
            "Do ahead: Extra pancakes will keep in the fridge for a couple days, or can be spread on a tray in the freezer until frozen, then combined in a freezer bag to be stored until needed. Reheat on a baking sheet in a hot oven until crisp again."
        ], 
        "date": "2013-05-15T11:01:47+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound carrots, cut into 3 1/2- by 1/3-inch sticks", 
            "1 1/4 cups water", 
            "1 cup cider or plain vinegar (the former makes a sweeter, milder brine)", 
            "1/4 cup sugar", 
            "2 garlic cloves, lightly crushed", 
            "1 1/2 tablespoons dill seeds*", 
            "1 1/2 tablespoons salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pickled-carrot-sticks1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Carrots", 
            "Photo", 
            "Pickled", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/01/pickled-carrot-sticks/", 
        "title": "pickled carrot sticks", 
        "directions": [
            "Place carrots in a heatproof bowl. Bring remaining ingredients to a boil in saucepan, then reduce heat and simmer 2 minutes. Pour pickling liquid over carrots and cool, uncovered. Chill carrots, covered, at least 1 day for flavors to develop.", 
            "Carrots keep, chilled in an airtight container, 1 month.", 
            "* From my own experience, and from comments I have received, I’ve learned that dill seeds aren’t always the easiest thing to find. Mine are from McCormick, but they were also the only bottle I could find in the two different stores I went to. If you can’t find them, use fresh or dried dill instead. You can put the dried dill in with the brine as you boil it. If fresh dill, I would drop it in the container your are storing the carrots in, just before you put them in the fridge."
        ], 
        "date": "2008-01-11T15:29:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound carrots, scrubbed or peeled and cut into two-inch segments (angled if you’re feeling fancy)", 
            "3 tablespoons olive oil, divided", 
            "1/4 teaspoon ground cumin", 
            "Coarse salt and freshly ground black pepper", 
            "1/2 an avocado, pitted and sliced (we had a mega-‘cado and only used 1/4 of it)", 
            "Juice of half a lemon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-carrot-and-avocado-salad1.jpg?w=500", 
        "tags": [
            "Avocado", 
            "Carrots", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2009/08/roasted-carrot-and-avocado-salad/", 
        "title": "roasted carrot and avocado salad", 
        "directions": [
            "Roast the carrots: Preheat your oven to 400 degrees. Toss the carrot chunks in a medium bowl with two tablespoons of the olive oil, cumin and as generous of a helping of salt and pepper as you like. (We like a lot. Especially with sweet things like carrots.)", 
            "Spread them on a roasting sheet (I lined ours with foil because despite having a dishwasher these days, old must-create-fewer-dishes-at-all-times habits die hard) and roast for about 20 minutes, or until tender and browned. Of course, roasting time will vary depending on the thickness of your carrots. Our heftier chunks took over 30.", 
            "Finish the salad: Once the carrots are roasted, arrange them on a serving platter with slices of avocado on top. Drizzle the salad with the last tablespoons of olive oil, lemon juice and extra salt and pepper, if it needs it. Eat immediately."
        ], 
        "date": "2009-08-03T09:53:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup water", 
            "1 1/2 teaspoons teaspoon cumin seeds, toasted and cooled if you have the patience, ground will work here as well", 
            "1 1/2 teaspoons coriander seeds, toasted and cooled if you have the patience, ground will work here as well", 
            "2 teaspoon fresh thyme leaves", 
            "1 teaspoon coarse or kosher salt, plus more to taste", 
            "Red chile flakes, to taste", 
            "Freshly ground black pepper, to taste", 
            "4 garlic cloves, minced or pressed", 
            "1 tablespoon red wine vinegar", 
            "1/4 cup olive oil", 
            "3 pounds thin-to-medium carrots, scrubbed, not peeled; mixed colors are prettier here but not essential", 
            "2 tablespoons olive oil", 
            "2 tablespoons orange juice (from about 1/4 orange)", 
            "2 tablespoons lemon juice (from about 1/2 lemon)", 
            "1 large or 2 medium firm-ripe avocados, cut in thin slices", 
            "Salt and pepper to taste", 
            "1 to 2 cups radish sprouts, other sprouts or light salad greens of your choice", 
            "1/4 cup plain yogurt", 
            "2 tablespoons roasted hulled pumpkin seeds, sunflower seeds, toasted sesame seeds or a mix thereof"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/spiced-roasted-carrots-with-avocado-and-yogurt1.jpg?w=750", 
        "tags": [
            "Avocado", 
            "Carrots", 
            "Photo", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/05/roasted-carrots-with-avocado-and-yogurt/", 
        "title": "roasted carrots with avocado and yogurt", 
        "directions": [
            "Heat your oven to 400 degrees F. Cover 1 large (half-sheet) or 2 smaller (quarter-sheet) roasting pans with foil for easy cleanup. Pour 1/4 cup water in bottom of pan (or divide between both).\nMake your spice paste by either pounding the cumin, coriander, thyme, salt and peppers in a mortar and pestle until roughly ground, using an electric spice grinder (i.e. a coffee grinder you don’t mind smelling like spices) or small food processor to do the same, or, if using ground spices, just combining them in the bottom of the large bowl you’re about to use. In the bottom of a very large bowl, combine prepared spices, salt and pepper, garlic, vinegar and 1/4 cup olive oil and whisk to blend. Add carrots and toss to coat.\nSpread carrots, drizzling with any extra marinade, in prepared pans and cover tightly with foil. Roast for 25 minutes covered then remove the foil and roast for 35 minutes more, until the carrots are lightly browned and tender but not falling apart.\nMeanwhile, combine 2 tablespoons olive oil, orange and lemon juices in a small dish with salt and pepper. When carrots are done, scatter with avocado and sprouts then drizzle with this citrus dressing all over. Dollop yogurt over the top and sprinkle with seeds. Dig in."
        ], 
        "date": "2016-05-17T11:57:35+00:00"
    }
]