{
  "date": "2010-09-27T14:35:19+00:00",
  "directions": [
    "Preheat oven to 425°F. Whisk together the flour, baking powder, baking soda and salt in a large bowl. Either cut the butter pieces into the flour mixture with a pastry blender or rub them in with your fingertips until well-combined. Stir in the cheddar, jalapeños and sour cream until the mixture forms a sticky dough. Pat it out to a 1/2-inch thickness on a very well-floured counter and use a 3 1/2-inch biscuit cutter to cut six rounds. Bake on an ungreased (or parchment-lined, if your baking sheets are as “weathered” as mine are) for 15 to 17 minutes, until golden on top.",
    "Do ahead: If you’d like to serve them over a couple days, I recommend freezing already formed but unbaked biscuits until you are ready to bake them — you can bake them directly from the freezer, adding just a minute or two to the baking time."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/beef-chili-sour-cream-and-cheddar-biscuits1.jpg?w=500",
  "ingredient_list": [
    "2 large onions, chopped (about 3 cups)",
    "1/4 cup vegetable oil",
    "1 tablespoon minced garlic",
    "2 carrots, sliced thin (suggested by Gourmet) or in a small dice, as I’d chop them next time",
    "3 pounds boneless beef chuck, ground coarse or 3 pounds ground beef",
    "1/4 cup chili powder",
    "1 tablespoon ground cumin",
    "2 tablespoons paprika",
    "1 tablespoon crumbled dry oregano",
    "Dried red pepper flakes, to taste (Gourmet suggests 1 tablespoon; I used 1 teaspoon knowing that my flakes are very hot)",
    "2 8-ounce cans tomato sauce or 2 cups fresh tomato sauce or tomato puree",
    "1 1/4 cups beef broth",
    "3 tablespoons cider vinegar",
    "1 3/4 cups or 1 19-ounce can kidney beans, rinsed and drained",
    "2 green bell peppers, chopped",
    "Sour Cream and Cheddar Biscuits, below",
    "Sour cream and pickled jalapeños (optional, to finish)",
    "1 1/2 cups all-purpose flour",
    "2 teaspoons baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon salt",
    "2 tablespoons cold unsalted butter, cut into bits",
    "1/4 pound sharp Cheddar cheese, coarsely grated (about 1 1/2 cups)",
    "Drained and chopped pickled jalapeños, to taste (I used about 2 tablespoons)",
    "1 cup sour cream"
  ],
  "tags": [
    "Beef",
    "Freezer Friendly",
    "Photo",
    "Scones/Biscuits",
    "Tex-Mex"
  ],
  "title": "beef chili + sour cream and cheddar biscuits",
  "url": "https://smittenkitchen.com/2010/09/beef-chili-sour-cream-and-cheddar-biscuits/"
}