{
  "date": "2007-08-23T00:09:03+00:00",
  "directions": [
    "If using a gas grill: Use indirect heat on medium (325° to 350°F), a 2- to 4-burner grill-middle burner(s) off, or a 2-burner grill with 1 side off and a clean, oiled grate.",
    "If using a charcoal grill: Indirect heat, medium ash, split charcoal bed (about 2 dozen coals per side) with a clean, oiled grate on medium setting",
    "1.\tHeat the grill as directed. Soak 2 cups of apple or oak wood chips or chunks in water for one hour. ",
    "2.\tSeed, core and cut one of the red bell peppers into 1/4-inch dice. Cut the remaining bell peppers in half lengthwise right through the stem, leaving a bit of stem attached to each half. Cut out the cores, seeds, and ribs from the interiors of the peppers, leaving the stem intact. Sprinkle the insides of the peppers with 1/4 teaspoon of the salt and 1/4 teaspoon of the pepper. ",
    "3.\tMelt the butter in a large skillet over medium heat. Add the onion and saute until almost tender, about 4 minutes. Add the garlic, chopped bell pepper, zucchini and yellow squash. Saute the vegetables until crisp-tender, about 4 minutes. Stir in the corn and tomato and cook until heated through, 1 to 2 minutes. Stir in herbs, breadcrumbs, and the remaining 1/2 teaspoon salt and 1/4 teaspoon pepper. Cook and stir until the breadcrumbs soak up most of the liquid in the pan. Remove from the heat and spoon the filling equally into the pepper cavities. ",
    "4.\tWhen the grill is hot, put the soaked wood chips or chunks over the coal on both sides of the grill. If using gas, put the wood chips in a smoker box or in a perforated foil packet directly over one of the heated burners. ",
    "5.\tBrush the grill grate and coat it with oil. Put the stuffed peppers over the unheated part of the grill, cover, and cook until just tender 20 to 30 minutes. If your grill has a temperature gauge, it should stay around 350ÂºF. ",
    "6.\tRemove the peppers to a large serving platter. Sprinkle with the Parmesan (if using) and serve. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/08/smoke-roasted-stuffed-bell-peppers.jpg?w=753",
  "ingredient_list": [
    "2 medium red bell peppers",
    "3 medium mixed bell peppers (orange, yellow, green)",
    "3/4 teaspoon kosher salt",
    "1/2 teaspoon ground black pepper",
    "3 tablespoons butter",
    "1 onion, finely chopped",
    "2 cloves garlic, minced",
    "1 medium zucchini, cut into 1/4-inch dice",
    "1 medium yellow squash, cut into 1/4-inch dice",
    "2 cups fresh or frozen corn kernels (from 3 to 4 ears of corn; for extra flavor, once you’ve cut the kernels off, use the dull side of your knife blade to scrape the remaining corn and juices, or “milk” from the cob)",
    "1 medium tomato, seeded and cut into 1/4-inch dice",
    "2 tablespoons chopped fresh herbs (such as parley, oregano, basil or a mix)",
    "1/4 cup plain dried breadcrumbs",
    "Oil for coating grill grate",
    "2 tablespoons grates Parmesan cheese (optional)"
  ],
  "tags": [
    "Grilling",
    "Peppers",
    "Photo",
    "Tips",
    "Travel",
    "Vegetarian"
  ],
  "title": "smoke-roasted stuffed bell peppers",
  "url": "https://smittenkitchen.com/2007/08/napa-wrapper/"
}