{
  "date": "2015-12-09T12:05:09+00:00",
  "directions": [
    "Heat oven to 350 degrees F. Butter and flour a 9×13 baking pan, or coat it with a nonstick cooking spray.",
    "In a small bowl, whisk together flour, cornstarch (together, these make “cake flour” without you having to buy it), salt and baking powder. If using a fresh vanilla bean, rub seeds into 1 1/4 cups granulated sugar to disperse them and help release the most flavor. In the bowl of an electric mixer fitted with the whisk attachment, beat egg whites on medium speed until soft peaks form. With the machine still running, gradually add the sugar (vanilla bean-infused or plain) and beat on medium-high until stiff peaks form. If you haven’t used a vanilla bean, now add your vanilla extract and beat to combine.",
    "Add yolks one at at time, beating thoroughly after each addition. Add milk and beat just to combine. Add flour mixture, one-third at at time, folding in each addition gently by hand. ",
    "Pour batter in prepared pan and smooth top. Bake for 18 to 24 minutes, or until a tester inserted into cake comes out clean. Let completely cool in pan on a rack. ",
    "In a large bowl, preferably one with a pouring spout, whisk together evaporated milk, condensed milk and 1 1/2 cups heavy or light cream. Add rum, if using.  Use a wooden skewer to poke holes all over cake. Pour all but 1/2 cup milk mixture over cake and transfer to fridge, giving the cake several hours but ideally overnight to soak it up. (Save last bit of milk mixture for serving.)",
    "Before serving, beat 2 cups heavy cream with 2 tablespoons powdered or granulated sugar until soft peaks form. Spread over top of cake. ",
    "Serve cake in squares, first pouring a little puddle of reserved three-milk mixture at the bottom of plate. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/tres-leches-cake1.jpg?w=750",
  "ingredient_list": [],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Everyday Cakes",
    "Photo",
    "Tex-Mex"
  ],
  "title": "tres leches cake + a taco party",
  "url": "https://smittenkitchen.com/2015/12/tres-leches-cake-a-taco-party/"
}