[
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/anything-but-clementine-clafoutis1.jpg?w=500", 
        "tags": [
            "Disasters", 
            "French", 
            "Fruit", 
            "Orange", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/01/anything-but-clementine-clafoutis/", 
        "title": "anything-but-clementine clafoutis", 
        "directions": [
            "1. Heat oven to 350 degrees. Prepare a gratin dish, about 9 by 5 by 2 inches, or a 10-inch round deep pie plate or porcelain dish, by smearing it with butter, just a teaspoon or so. Dust it with flour, rotating pan so flour sticks to all the butter; invert dish to get rid of excess.", 
            "2. In a large bowl, whisk eggs until frothy. Add 1/2 cup flour, and whisk until smooth. Add granulated sugar and salt and whisk until combined. Add cream and milk and whisk until smooth.", 
            "3. Layer fruit over bottom of the dish. Pour batter over fruit to as close to top of dish as you dare; you may have a little leftover batter, depending on size of your dish. Bake for about 40 minutes, or until clafoutis is nicely browned on top and a knife inserted into it comes out clean. Sift some powdered sugar over it and serve warm or at room temperature. Clafoutis does not keep (not sure I agree with this); serve within a couple of hours of making it."
        ], 
        "date": "2008-01-22T14:15:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup brown sugar", 
            "1 tablespoon water", 
            "3 large eggs, separated", 
            "2/3 cup (135 grams) granulated sugar", 
            "2 blood oranges, or another orange of your choice", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, softened", 
            "2/3 cup (165 grams) ricotta", 
            "1/3 cup (45 grams) cornmeal", 
            "1 cup (135 grams) firm-packed almond flour or meal", 
            "1/2 teaspoon fine sea salt", 
            "1/4 cup apple, quince or apricot jam (optional, for glossy finish)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/blood-orange-almond-and-ricotta-cake1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Citrus", 
            "Everyday Cakes", 
            "Gluten-Free", 
            "Italian", 
            "Orange", 
            "Passover", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/01/blood-orange-almond-and-ricotta-cake/", 
        "title": "blood orange, almond and ricotta cake", 
        "directions": [
            "Heat oven to 300 degrees F. Butter a 9-inch round cake pan and line the bottom with a round of parchment paper. ", 
            "Stir brown sugar and water together so they form a thick slurry. Pour into prepared cake pan and spread thin. Set aside.", 
            "Whip egg whites in a medium bowl with an electric mixer until they hold thick peaks. Set aside.", 
            "Place granulated sugar in a large mixing bowl. Finely zest both oranges over it. ", 
            "Cut both oranges in half. Cut one of the halves into paper-thin slices and arrange slices over brown sugar base in cake pan. Juice other three halves (I had about 1/3 cup juice) and set juice aside.", 
            "Add butter to zest and granulated sugar in large mixing bowl and beat with an electric mixer (you can use same beaters you just did for egg whites) until light and fluffy. Add egg yolks, one at a time, and beat to combine. Add juice and ricotta; mix until smooth. Sprinkle salt over batter, then add almond flour and cornmeal and mix until just combined. Gently fold in egg whites. ", 
            "Scoop batter in large dollops over prepared cake pan base. Gently spread batter flat, trying not to disturb orange slices underneath. Bake in heated oven for 35 to 40 minutes [updated to warn that this took longer for many people, but remains accurate for my oven– better to check early than late], or until a toothpick inserted into the center comes out clean and then (my preference) for 5 more minutes. The final cake is so moist, almost damp, I found the extra baking time beneficial. ", 
            "Cool cake in pan on rack for 5 minutes, and then run a knife around the side and invert onto a cake plate. If any orange slices don’t come out easily, just gently arrange them on the top of the cake. If desired, heat jam until loose and brush over cake top for a glossier finish. Let cool and cut into slices. This would be delicious served with an extra dollop of ricotta, creme fraiche or barely sweetened whipped cream. The cake keeps at room temperature, but we prefer it from the fridge."
        ], 
        "date": "2016-01-14T12:05:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup blood orange juice", 
            "2 tablespoons freshly squeezed lime juice", 
            "3 tablespoons triple sec or cointreau, or more to taste", 
            "7 tablespoons white or “silver” tequila", 
            "Lime or blood orange slices for garnish, plus some of those drink umbrellas"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/blood-orange-margaritas1.jpg?w=640", 
        "tags": [
            "Citrus", 
            "Drinks", 
            "Orange", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2013/02/blood-orange-margaritas/", 
        "title": "blood orange margaritas", 
        "directions": [
            "Mix. Fill two glasses with ice and divide between them. Garnish. Drink and daydream."
        ], 
        "date": "2013-02-22T11:20:43+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/blood-orange-olive-oil-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Citrus", 
            "Orange", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/02/blood-orange-olive-oil-cake/", 
        "title": "blood orange olive oil cake", 
        "directions": [
            "Preheat oven to 350 degrees. Butter a 9-by-5-inch loaf pan. Grate zest from 2 oranges and place in a bowl with sugar. Using your fingers, rub ingredients together until orange zest is evenly distributed in sugar.", 
            "Supreme an orange: Cut off bottom and top so fruit is exposed and orange can stand upright on a cutting board. Cut away peel and pith, following curve of fruit with your knife. Cut orange segments out of their connective membranes and let them fall into a bowl. Repeat with another orange. Break up segments with your fingers to about 1/4-inch pieces.", 
            "Halve remaining orange and squeeze juice into a measuring cup; you’ll will have about 1/4 cup. Add buttermilk or yogurt to juice until you have 2/3 cup liquid altogether. Pour mixture into bowl with sugar and whisk well. Whisk in eggs and olive oil.", 
            "In another bowl, whisk together flour, baking powder, baking soda and salt. Gently stir dry ingredients into wet ones. Fold in pieces of orange segments. Pour batter into prepared pan.", 
            "Bake cake for 50 to 55 minutes, or until it is golden and a knife inserted into center comes out clean. Cool on a rack for 5 minutes, then unmold and cool to room temperature right-side up. Serve with whipped cream and honey-blood orange compote (below), if desired.", 
            "Honey-Blood Orange Compote: Supreme 3 more blood oranges according to directions above. Drizzle in 1 to 2 teaspoons honey. Let sit for 5 minutes, then stir gently."
        ], 
        "date": "2011-02-08T23:03:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup water", 
            "2 tea bags (whatever you like for iced tea)", 
            "1 cup bourbon", 
            "1/4 cup granulated sugar", 
            "1 1/2 cups orange juice (about 3 well-squeezed oranges)", 
            "6 tablespoons lemon juice (about 2 lemons)", 
            "16 to 17 ounces (about 5 cups of small pieces of ice) ice cubes", 
            "Mint sprigs or lemon slices, for garnish "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/bourbon-slush-punch1.jpg?w=640", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Lemon", 
            "Orange", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/07/bourbon-slush-punch/", 
        "title": "bourbon slush punch", 
        "directions": [
            "Boil 1 cup water for tea. Add the tea bags and let steep until cool. Discard the tea bags and set aside. Pour tea into a pitcher. Add bourbon, sugar, orange juice and lemon juice and refrigerate until needed. Don’t worry about stirring the sugar so that it dissolves; after 30 minutes in the fridge, it will have. ", 
            "To serve: Shake or stir punch base to ensure ingredients are evenly distributed. To make two liters of punch, add base and full amount of ice cubes to your blender, blending until the ice is crushed and slushy. For each individual glass of punch, place 1/2 cup punch base and slightly heaped 1/2 cup small pieces of ice (mine were chipped off an ice block; don’t ask) and blend until slushy. Add an extra whole ice cube or two to glasses if desired. Garnish glass with a sprig of mint or slice of lemon."
        ], 
        "date": "2014-07-24T12:01:28+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/candy-girl1.jpg?w=500", 
        "tags": [
            "Candy", 
            "Chocolate", 
            "Citrus", 
            "Fruit", 
            "Orange", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/candy-girl/", 
        "title": "orangettes", 
        "directions": [], 
        "date": "2006-11-18T20:07:28+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/caramelized-brown-sugar-oranges-with-yogurt-and-mint1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Gluten-Free", 
            "Orange", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/03/caramelized-brown-sugar-oranges-with-yogurt/", 
        "title": "caramelized brown sugar oranges with yogurt", 
        "directions": [
            "Heat your broiler. ", 
            "Cut tops and bottoms off oranges, exposing the flesh inside and creating a flat edge that you can stand it up on. Then slice off all the white from each orange. Cut skinned oranges into 1/2-inch crosswise slices, so that each resemble a wheel or flower.", 
            "Line a heavy baking sheet with foil and lightly coat it with oil or a nonstick spray. Arrange orange slices in one layer on it. Dab or schmear each with a little bit of brown sugar — I used about 1/4 teaspoon on each. Run under the broiler until they begin to brown on top; this can take anywhere from 5 minutes in a very good broiler to 10 to 15 in my sleepy one. Keep an eye on it. ", 
            "Transfer oranges and any juices on tray to a bowl, cover with plastic wrap and chill in the fridge for several hours or overnight. More juices will have puddled by the morning. Place a few orange slices in a small glass or cup, top with yogurt, a spoonful of juices and mint. "
        ], 
        "date": "2016-03-31T12:07:06+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough:", 
            "4 large egg yolks", 
            "1 large whole egg", 
            "1/4 cup (50 grams) granulated sugar", 
            "6 tablespoons (85 grams) butter, melted, plus additional to grease pan", 
            "3/4 cup (175 ml) buttermilk", 
            "Zest of 1 orange, finely grated (to be used in dough and filling, below)", 
            "3 3/4 cups (470 grams) all-purpose flour, plus more for dusting counter", 
            "1 packet (7 grams or 2 1/4 teaspoons) instant dry yeast", 
            "1 1/4 teaspoons coarse or kosher salt, or more to taste", 
            "1 teaspoon oil for bowl", 
            "Filling:", 
            "1 1/2 tablespoons (20 grams) butter", 
            "1 cup (190 grams) packed light brown sugar", 
            "1 cup (115 grams) fresh cranberries", 
            "Orange zest leftover from above", 
            "Icing:", 
            "3 1/2 tablespoons (55 ml) orange juice", 
            "2 cups (240 grams) powdered sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cranberry-orange-breakfast-buns1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Citrus", 
            "Cranberries", 
            "Fall", 
            "Orange", 
            "Photo", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2013/11/cranberry-orange-breakfast-buns/", 
        "title": "cranberry-orange breakfast buns", 
        "directions": [
            "Make the dough: In the bottom of the bowl of a stand mixer, whisk the yolks, whole egg, sugar, butter, buttermilk and 3/4 of the orange zest together (saving the rest for the filling). Add 2 cups of the flour along with the yeast and salt; stir until evenly moistened. Switch to the dough hook and add the remaining 1 3/4 cups flour and let the dough hook knead the mixture on low speed for 5 to 7 minutes. The dough should be soft and moist, but not overly sticky. Scrape the dough into a large, lightly oiled bowl (I usually scrape my dough briefly onto the counter, oil the mixing bowl, and scrape the dough back into it) and cover it with plastic wrap. Let dough rise at room temperature until doubled, which will take between 2 and 2 1/2 hours.", 
            "[Don’t have a stand mixer? Stir the mixture together with a wooden spoon, then continue stirring and beating it about in a large bowl for several minutes, until it comes together. Turn the dough out onto a floured counter and knead it for another 5 minutes. It will stick; don’t sweat it. Just scrape everything up and into the oiled bowl when it’s time to let it rise. Try to resist adding extra flour when it sticks; it will only toughen the dough. That would be sad.]", 
            "Prepare the filling: Melt the butter and set it aside. In a food processor, pulse the whole cranberries until they’re ground to a coarse rubble, but not fully pureed. You’ll need to scrape the machine down once or twice. Set them aside. ", 
            "[Don’t have a food processor? Just hand chop them very well, as if to coarsely mince them.]", 
            "Assemble the buns: Butter a 9×13-inch baking dish, a heavier ceramic or glass dish is ideal here. Turn the risen dough out onto a floured work surface and roll it into a rectangle that is 18 inches wide (the side nearest to you) and 12 or so inches long. (It’s okay if it goes longer/thinner.) Brush the dough with the melted butter. Sprinkle it with the brown sugar. Scatter the ground cranberries over it, then the remaining orange zest. ", 
            "Roll the dough into a tight, 18-inch long spiral. Using a sharp serrated knife, very, very gently saw the log into 1 1/2-inch sections; you should get 12. Arrange the buns evenly spread out in your baking dish. Cover with plastic wrap and refrigerate overnight, or up to 16 hours.", 
            "The next morning, bake the buns: Take your buns out of the fridge 30 minutes before you’d like to bake them, to allow them to warm up slightly. Heat your oven to 350 degrees F. Bake your buns until they’re puffed and golden (the internal temperature should read 190 degrees F), approximately 30 minutes.", 
            "Transfer pan to a cooling rack and let cool slightly. Make the icing by whisking the orange juice and powdered sugar together. Spread a little on each bun, or drizzle it over the whole pan. Serve immediately. ", 
            "Many notes:"
        ], 
        "date": "2013-11-13T11:31:56+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups coarsely chopped dates (10 ounces or 285 grams pitted)", 
            "1/3 cup orange liqueur such as Cointreau or Triple Sec", 
            "4 tablespoons (2 ounces or 55 grams) unsalted butter, at room temperature", 
            "3/4 cup (145 grams) light brown sugar, lightly packed", 
            "1 large egg", 
            "1 teaspoon pure vanilla extract", 
            "1 tablespoon grated orange zest (2 oranges)", 
            "2 cups (250 grams) all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1 teaspoon ground cinnamon", 
            "1 teaspoon ground nutmeg", 
            "1/4 teaspoon ground cloves", 
            "1 teaspoon kosher salt", 
            "3/4 cup freshly squeezed orange juice (3 oranges)", 
            "3/4 cup (3 ounces or 85 grams) coarsely chopped pecans"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/09/date-spice-loaf.jpg?w=750", 
        "tags": [
            "Cake", 
            "Dates", 
            "Everyday Cakes", 
            "Fruit", 
            "Orange", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/09/date-spice-loaf/", 
        "title": "date spice loaf", 
        "directions": [
            "Preheat the oven to 350°F. Butter the bottom of an 8 1/2 by 4 1/2 by 2 1/2-inch loaf pan. Line the bottom with parchment paper, then butter and flour the pan.", 
            "Combine the dates and orange liqueur in a small bowl and set aside for 30 minutes. Stir occasionally.", 
            "In the bowl of an electric mixer fitted with the paddle attachment, beat the butter and brown sugar together on medium speed for one minute. Scrape down the bowl. With the mixer on low, add the egg, vanilla, and orange zest. Sift together the flour, baking powder, baking soda, cinnamon, nutmeg, cloves, and salt. With the mixer still on low, add the flour mixture alternately with the orange juice to the creamed mixture, beating only until combined. By hand, stir in the dates with their liquid, and the pecans.", 
            "Pour the batter into the prepared loaf pan and smooth the top. Bake for 50 to 60 minutes, until a toothpick comes out clean. Cool in the pan for 10 minutes, then turn out onto a wire rack and cool completely.", 
            "Serving: Ina suggests you serve this bread with an orange cream cheese spread, which you can make by creaming 6 ounces of room temperature cream cheese with 1/3 cup sugar and one tablespoon orange zest in an electric mixer until just combined. "
        ], 
        "date": "2009-09-25T20:15:15+00:00"
    }, 
    {
        "ingredient_list": [
            "3 oranges (I used 2 navel and one cara cara orange)", 
            "2 heads of endive", 
            "2 ounces soft goat cheese or chevre, crumbled", 
            "1/3 cup sliced almonds or chopped marcona almonds, well-toasted", 
            "Freshly ground black pepper", 
            "Olive oil for drizzling", 
            "Sherry vinegar", 
            "1 tablespoon minced chives", 
            "Flaky or other sea salt, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/endives-with-oranges-and-almonds1.jpg?w=750", 
        "tags": [
            "Citrus", 
            "Endive", 
            "Gluten-Free", 
            "Orange", 
            "Photo", 
            "Salad", 
            "Spanish", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/endives-with-oranges-and-almonds/", 
        "title": "endives with oranges and almonds", 
        "directions": [
            "Cut the top and bottom off your oranges, exposing the citrus flesh inside. Then, resting on either end, cut the peels, including the white pith, off the oranges. [Set aside for orangettes!] Use your knife to cut between each membrane and orange segment, cutting only so far as the center, which should release the orange segments. You can chop them once or twice more, so the pieces are not too large. ", 
            "Trim end off endives and arrange individual leaves on a medium platter. Add a few orange chunks to each, then goat cheese crumbles and almonds. Season with black pepper, then drizzle with a very thin stream of olive oil. Add a few droplets of sherry vinegar to each “boat.” Scatter chives over and finish each with sea salt. ", 
            "Dig in. No forks needed, unless you’re classy."
        ], 
        "date": "2014-12-15T11:50:02+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup hazelnuts or walnuts", 
            "1 medium-large fennel bulb, leaves and stems trimmed off", 
            "Salt and freshly ground black pepper", 
            "Juice of 1 lemon", 
            "2 large blood oranges", 
            "1 small shallot, peeled and cut into paper-thin slices", 
            "10 mint leaves", 
            "2 tablespoons extra-virgin olive oil", 
            "1 teaspoon lime zest "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/fennel-and-blood-orange-salad1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Fennel", 
            "Orange", 
            "Photo", 
            "Salad", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/02/fennel-and-blood-orange-salad/", 
        "title": "fennel and blood orange salad", 
        "directions": [
            "Place nuts in dry skillet and cook over medium heat, stirring, to toast. Let cool. If using hazelnuts, roll them around in a dishcloth (or, if cool enough, in your hands), discarding any loose skins. Coarsely chop nuts; set aside.", 
            "Slice about 1/2 inch from bottom of fennel and discard. Slice fennel very thinly on a mandonline, benriner or with a knife, starting with flat bottom side. Toss in serving bowl with salt, pepper and lemon juice. ", 
            "Trim all peel and pith from oranges. Holding peeled fruit over bowl containing fennel, use sharp knife to cut sections from membrane and let them drop into bowl. Squeeze remaining membrane over bowl to sprinkle salad with remaining juice, and discard membrane.Add shallots, mint leaves, olive oil and reserved nuts and toss gently. Sprinkle with lime zest. ", 
            "Do ahead: While the mint leaves will look and taste best on the first day, I really enjoyed the leftovers from this salad for lunch the next day."
        ], 
        "date": "2014-02-03T11:37:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour, plus more for dusting", 
            "1/4 cup plus 2 tablespoons granulated sugar", 
            "1/4 teaspoon baking powder", 
            "1/4 teaspoon salt", 
            "1 stick plus 1 tablespoon unsalted butter, the stick cut into 1/2-inch pieces and chilled", 
            "3 tablespoons ice water", 
            "8 to 10 blood oranges (about 5 ounces each) [I only needed 7]", 
            "1 large egg yolk mixed with 2 tablespoons of water", 
            "Deep, Dark Salted Butter Caramel Sauce, for serving (after using Zoe Nathans, decided that I definitely prefer my own, reprinted below)", 
            "1 cup sugar", 
            "3 ounces (6 tablespoons) salted butter, the better you can get, the better it will taste", 
            "1/2 cup plus two tablespoons heavy cream, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/flaky-blood-orange-tart.jpg?w=750", 
        "tags": [
            "Citrus", 
            "Fruit", 
            "Orange", 
            "Photo", 
            "Tarts/Pies", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2009/01/flaky-blood-orange-tart/", 
        "title": "flaky blood orange tart", 
        "directions": [
            "Melt the sugar over medium to moderately high heat in a larger pot than you think you’ll need–at least two or three quarts, whisking or stirring the sugar as it melts to ensure it heats evenly. Cook the liquefied sugar to a nice, dark copper color. Add the butter all at once and stir it in, before turning off the stove and pour in the heavy cream (The sauce will foam up quite a bit when you add it; this is why you want the larger pot.), whisking it until you get a smooth sauce.", 
            "You use it right away or pour it into a jar and store it in the fridge for up to two weeks. When you take it out, it will likely have thickened a bit but 30 seconds in the microwave brings it right back to pouring consistency.", 
            "Serve over everything."
        ], 
        "date": "2009-01-26T18:50:13+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 tablespoons red onion, cut into tiny bits", 
            "4 pieces of citrus, preferably a mix of grapefruits and oranges but use what you can get, and what you like to eat (spoiled by the spread at the store, I used 1 pink grapefruit, 1 cara cara and 1 blood orange, and 1 mineola)", 
            "1 tablespoon red wine vinegar or lemon juice", 
            "1 teaspoon smooth Dijon mustard", 
            "1 tablespoon olive oil", 
            "Salt and freshly ground pepper, to taste", 
            "3 to 4 tablespoons (1.5 ounces) feta cheese, chopped or crumbled", 
            "1 tablespoon fresh mint, chopped or cut into tiny slivers"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mixed-citrus-salad-with-feta-and-mint1.jpg?w=500", 
        "tags": [
            "Fruit", 
            "Grapefruit", 
            "Herbs", 
            "Orange", 
            "Photo", 
            "Salad", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2010/01/mixed-citrus-salad-with-feta-and-mint/", 
        "title": "mixed citrus salad with feta and mint", 
        "directions": [
            "Place your red onion in the bottom of a medium bowl. Nest a strainer over the bowl.", 
            "Prepare your citrus fruits by beveling the stem end of one, cutting enough off that you reveal the pith-free flesh of the fruit. Repeat on the other end. Rest your fruit on one of its now-flat surface and begin cutting the peel and pith off in large, vertical pieces. You want the fruit’s exterior to be “white”-free.", 
            "Turn the fruit back on its side and cut it into 1/4-inch thick wheels, removing any seeds and thick white stem as you do. Place the wheels and any collected juices from the cutting board in the strainer over the bowl with onion. Repeat with remaining citrus fruits. (As the extra juices drip over the bowl, it will soften the raw onion bite.)", 
            "Spread the fruit slices out on a platter. Scoop out the onion bits (a slotted spoon or fork does the trick) and sprinkle them over, leaving the juice in the bowl. Whisk one tablespoon of juice (this is all I had accumulated) with red wine vinegar or lemon juice, Dijon and olive oil. Season with salt and freshly cracked black pepper. Drizzle the dressing over the citrus, sprinkle with feta and mint, adjust salt and pepper to taste, serve immediately and daydream of warmer places."
        ], 
        "date": "2010-01-22T15:44:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound (8 ounces or 225 grams) unsalted butter at room temperature", 
            "2 cups (400 grams) granulated sugar", 
            "4 extra-large eggs at room temperature", 
            "1/4 cup grated orange zest (from 4 large oranges)", 
            "3 cups (390 grams) all-purpose flour plus 2 tablespoons (15 grams)", 
            "1/2 teaspoon baking powder", 
            "1/2 teaspoon baking soda", 
            "1 teaspoon kosher salt", 
            "1/4 cup (60 ml) freshly squeezed orange juice", 
            "3/4 cup (175 ml) buttermilk, at room temperature", 
            "1 teaspoon (5 ml) vanilla extract", 
            "2 cups (12 ounces or 340 grams) semisweet chocolate chunks", 
            "Syrup:", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 cup (60 ml) freshly squeezed orange juice", 
            "Ganache:", 
            "8 ounces (225 grams) semisweet chocolate chips or chopped semisweet chocolate", 
            "1/2 cup (120 ml) heavy cream", 
            "1 teaspoon instant coffee granules"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/this-cake-has-a-hole-in-it1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Chocolate", 
            "Citrus", 
            "Fruit", 
            "Orange", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/09/this-cake-has-a-hole-in-it/", 
        "title": "orange chocolate chunk cake", 
        "directions": [
            "1. Preheat the oven to 350°F (175°C). Grease and flour a 10-inch Bundt pan.", 
            "2. Cream the butter and sugar in the bowl of an electric mixer fitted with the paddle attachment for about 5 minutes, or until light and fluffy. Add the eggs, one at a time, then the orange zest.", 
            "3. Sift together 3 cups flour, the baking powder, baking soda, and salt in a large bowl. In another bowl, combine the orange juice, buttermilk, and vanilla. Add the flour and buttermilk mixtures alternately to the creamed butter, beginning and ending with the flour. Toss the chocolate chunks with 2 tablespoons flour and add to the batter. Pour into the pan, smooth the top, and bake for 45 minutes to 1 hour, until a cake tester comes out clean. Let the cake cool in the pan on a wire rack for 10 minutes.", 
            "4. Meanwhile, make the syrup. In a small saucepan over medium-low heat, cook the sugar with the orange juice until the sugar dissolves. Remove the cake from the pan, set it on a rack over a tray, and spoon the orange syrup over the cake. Allow the cake to cool completely.", 
            "5. For the ganache, melt the chocolate, heavy cream, and coffee in the top of a double boiler over simmering water until smooth and warm, stirring occasionally. Drizzle over the top of the cake."
        ], 
        "date": "2006-09-24T09:10:34+00:00"
    }
]