[
    {
        "ingredient_list": [
            "Dough", 
            "1 cup all-purpose flour plus additional for kneading and rolling", 
            "3/4 cup cake flour (not self-rising)", 
            "2 large eggs", 
            "3/4 teaspoon salt", 
            "1/4 cup water", 
            "Filling", 
            "1/4 cup water", 
            "1/4 cup plus 2 tablespoons sugar", 
            "2 tablespoons apricot brandy (optional)", 
            "6 oz dried apricots (1 cup; preferably California)", 
            "1/2 cup walnuts (2 oz), finely chopped", 
            "Dough (recipe above)", 
            "1 stick (1/2 cup) unsalted butter", 
            "1/2 cup fresh bread crumbs", 
            "1/4 teaspoon cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apricot-and-walnut-vareniki1.jpg?w=500", 
        "tags": [
            "Apricots", 
            "Dumplings", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/apricot-and-walnut-vareniki/", 
        "title": "apricot and walnut vareniki", 
        "directions": [
            "Make filling: Bring water and 1/4 cup sugar to a boil, stirring until sugar is dissolved. Remove from heat and stir in brandy. Finely chop apricots in a food processor, then add sugar syrup and pulse until just combined (do not puree). Transfer to a bowl and stir in 1/4 cup walnuts. Cool.", 
            "Roll out dough and fill varenikis: Halve dough and roll out 1 piece on a lightly floured surface into a 15-inch round, keeping remaining dough wrapped. Trim dough to a 13-inch square. Cut lengthwise into 4 strips, then crosswise into fourths to form 16 (3 1/4-inch) squares. ", 
            "Put 1 slightly rounded teaspoon filling in center of each square. Working with 1 square at a time, moisten edges with water and fold in half diagonally to form a triangle, pressing edges firmly together to seal. overlap bottom points of triangle and press to seal (dumpling will look like a pointed hat). Transfer vareniki to a flour-dusted kitchen towel. Repeat with remaining squares, then make more dumplings with remaining dough and filling.", 
            "Cook varenikis in a large pot of lightly salted boiling water until tender, about 15 minutes. Make topping while varenikis cook:", 
            "Heat 2 tablespoons butter in a skillet over moderate heat, then cook bread crumbs and remaining 1/4 cup walnuts, stirring frequently, until golden, 2 to 3 minutes. Remove from heat and season lightly with salt. Stir together cinnamon and remaining 2 tablespoons sugar. Sprinkle 2 teaspoons cinnamon sugar over crumb mixture and toss. ", 
            "To serve varenikis: Melt remaining 6 tablespoons butter, then drizzle about 2 tablespoons on a warmed serving platter. Transfer varenikis with a slotted spoon to platter and drizzle with remaining 4 tablespoons butter. ", 
            "Serve hot, sprinkled with bread-crumb mixture and remaining cinnamon sugar to taste. "
        ], 
        "date": "2007-11-08T23:15:27+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine ", 
            "Filling", 
            "3/4 cup (a scant 4 ounces or 110 grams) shelled unsalted pistachios", 
            "1 tablespoon (10 grams) all purpose flour", 
            "Few pinches of sea salt", 
            "6 tablespoons (75 grams) sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/4 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1 pound firm-ripe apricots", 
            "To finish", 
            "Powdered sugar or 1/4 cup apricot jam"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/apricot-pistachio-squares1.jpg?w=640", 
        "tags": [
            "Apricots", 
            "Bars", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/08/apricot-pistachio-squares/", 
        "title": "apricot pistachio squares", 
        "directions": [
            "Heat your oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (If you have an 8-inch square springform, you can skip this and just butter it well.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. Transfer the dough clumps to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "(Don’t have a food processor? You might have an easier time using softened butter and preparing this cookie-style: cream it with the sugar with a hand mixer, then spoon in the salt and flour, beating until just combined. It might help to chill this mixture a bit before pressing it into the pan, or it might feel too greasy to easily spread.)", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind your pistachios, sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. ", 
            "Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. Cut apricots in half (or, you might find that you can tear them open at the seams with your fingers) and remove pits. From here, you have a few decoration options: you can place the apricot halves in facedown or up all over the pistachio base. You can do as I did, which is cut them into strips, then slide each cut half onto a butter knife or offset spatula, tilt it so that it fans a little, and slide it onto your pistachio filling decoratively. (With this method, I ended up not using all of my apricots.) You could also arrange the strips like petals of flower around the pan, for maximum pretties.]]", 
            "Bake the bars for 60 minutes, or until they are golden and a toothpick inserted into the pistachio portion comes out batter-free. This might take up to 10 minutes longer depending on the juiciness of your apricots and the amount you were able to nestle in. Let cool completely in pan; you can hasten this along in the fridge. ", 
            "To finish, you can make a shiny glaze for your tart by warming the jam in a small saucepan until it thins, and brushing this mixture over the top of the cooled tart. Or, you can keep it rustic with just a dusting of powdered sugar, as I did. ", 
            "Cut bars into squares — chilled bars will give you the cleanest cuts. Keep leftover bars chilled. "
        ], 
        "date": "2014-08-07T12:18:31+00:00"
    }, 
    {
        "ingredient_list": [
            "Fruit Base", 
            "1 pound apricots", 
            "3 tablespoons sugar", 
            "1 tablespoon flour", 
            "Grated fresh nutmeg, a pinch", 
            "Crisp Topping", 
            "1/2 stick (4 tablespoons, 2 ounces) butter, melted", 
            "6 tablespoons turbinado or regular sugar (turbinado, also sold as Sugar in the Raw, gives an excellent crunch)", 
            "1/2 cup oats", 
            "1/2 cup all-purpose flour (or a mixture of whole wheat and all-purpose flour)", 
            "Pinch of salt", 
            "2 tablespoons sliced almonds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/06/2554534909_1c47b6eccb_b.jpg?w=750", 
        "tags": [
            "Apricots", 
            "Breakfast", 
            "Brunch", 
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/06/breakfast-apricot-crisp/", 
        "title": "breakfast apricot crisp", 
        "directions": [
            "Prepare fruit: Preheat oven to 400 degrees. Pull apart apricots at their seam, remove pits, and tear them one more time into quarters, placing them in a small baking dish (one that holds two to three cups is ideal). Stir in sugar, flour and pinch of nutmeg. ", 
            "Make topping: Melt butter and stir in sugar, then oats, then flour, salt and almonds until large clumps form. Sprinkle mixture over the fruit.  Bake for about 30 to 40 minutes and serve warm.", 
            "Although you could dust this with powdered sugar and serve it warm with vanilla ice cream for dessert, as I noted, it is on the tart side for an after-dinner treat. Truly, this excels cooled in the fridge overnight, and mixed with a scoop of plain yogurt for a weekday breakfast that will cure you of all weekday breakfast doldrums. It sure did for me. "
        ], 
        "date": "2008-06-07T11:43:35+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups diced (1/4 inch) cantaloupe (from a 2 1/4-lb piece)", 
            "1/4 cup diced (1/4 inch) sweet onion (such as Vidalia) or red onion", 
            "2 tablespoons chopped fresh basil or cilantro", 
            "1 (2-inch-long) fresh hot red or green chile (skip the seeds if you want to dim the heat), minced", 
            "2 tablespoons fresh lime juice", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/cantaloupe-salsa.jpg?w=752", 
        "tags": [
            "Cantaloupe", 
            "Fruit", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2009/07/cantaloupe-salsa/", 
        "title": "cantaloupe salsa", 
        "directions": [
            "Mix everything and eat immediately. "
        ], 
        "date": "2009-07-28T21:42:29+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups chopped or balled melon (from about 1 cantaloupe or honeydew, or 1/4 a large watermelon)", 
            "Juice of half a lime, divided, plus more to taste", 
            "Coarse salt, to taste", 
            "1/2 to 1 teaspoon chili powder", 
            "3 tablespoons crumbled cotija cheese", 
            "1 tablespoon toasted pepitas (I like the salty ones)", 
            "1 tablespoon chopped fresh cilantro, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_4945.jpg?w=750", 
        "tags": [
            "Cantaloupe", 
            "Honeydew", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Tex-Mex", 
            "Vegetarian", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2016/08/chile-lime-melon-salad/", 
        "title": "chile-lime melon salad", 
        "directions": [
            "Place melon in a wide bowl or on a platter. Squeeze half lime juice over, adding second half to taste, then sprinkle with salt and chili powder. Scatter with cheese, pepitas and cilantro and dig in.", 
            "Do ahead: I’d expected this salad not to keep at all but we found it just fine (with no watery run-off) after 2 hours in the fridge. I wouldn’t keep it assembled too much longer, though. You don’t want the salt to draw the juices out of the fruit before you eat it, and it’s quick enough to put together at the last minute.\n"
        ], 
        "date": "2016-08-09T11:39:50+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound Campari or plum tomatoes, diced, drained", 
            "1 1/2 cups diced seeded watermelon", 
            "1 large green bell pepper, seeded, cut into 1/3-inch cubes", 
            "1/2 large English hothouse cucumber, seeded, cut into 1/3-inch cubes", 
            "1/2 cup very thinly sliced radishes", 
            "3 tablespoons olive oil, divided", 
            "10 ounces feta cheese, cut into small cubes (about 2 1/2 cups),", 
            "2 divided green onions, chopped, divided", 
            "1/4 cup thinly sliced fresh mint leaves, divided", 
            "1/2 cup plain Greek-style yogurt", 
            "1 teaspoon dried oregano"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2653761539_5d0fcda7de_b.jpg?w=750", 
        "tags": [
            "Fruit", 
            "Peppers", 
            "Photo", 
            "Radishes", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2008/07/chopped-vegetable-watermelon-and-feta-salad/", 
        "title": "chopped vegetable, watermelon and feta salad", 
        "directions": [
            "Toss first five ingredients and two tablespoons oil in large bowl. Add half each of cheese, green onions, and mint. Mix remaining cheese, green onions, mint, and oil in processor; add yogurt and oregano. Process just to blend (do not over-mix or dressing will get thin). Season dressing with salt and pepper; mix into salad."
        ], 
        "date": "2008-07-10T12:36:51+00:00"
    }, 
    {
        "ingredient_list": [
            "For the filling", 
            "1 1/2 cups (8 ounces) pitted dates, chopped", 
            "3/4 cup water", 
            "1 teaspoon finely grated orange (or mandarin or clementine) zest", 
            "For the crumbs", 
            "2 tablespoons packed brown sugar", 
            "1/4 cup raw or turbinado sugar", 
            "1/2 cup olive oil, coconut oil, melted butter or a mix of the above", 
            "3/4 cups rolled oats, I used quick-cooking but old-fashioned should work just fine", 
            "3/4 cup plus 2 tablespoons whole wheat flour, or a wholegrain flour mix of your choice", 
            "1/2 teaspoon ground cinnamon", 
            "A few gratings of fresh nutmeg", 
            "A pinch or two of ground cloves", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon coarse sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-breakfast-squares1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Dates", 
            "Photo", 
            "Snack", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2015/11/date-breakfast-squares/", 
        "title": "date breakfast squares", 
        "directions": [
            "Heat oven to 400 degrees. Either grease bottom and sides of an 8×8-inch pan or line the bottom and sides with parchment paper. ", 
            "In a small saucepan, combine dates, water and zest over low heat, simmering for 5 to 10 minutes, until liquid has absorbed and mixture has thickened. Set aside while you make the crumbs.", 
            "In a large bowl, mix the sugars and oil or butter together. Add the oats, flour, spices, baking soda and salt and stir to combine; the mixture should form a coarse rubble. ", 
            "Press half into the bottom of your prepared pan. Dollop the date mixture over it and use a small offset spatula (or whatever you have on hand) to spread the mixture smoothly over the crumbs. Don’t worry if the crumbs move around a little underneath; these bars don’t require perfection. Sprinkle remaining crumbs over date layer and press lightly to cover. ", 
            "Bake bars for 25 minutes, or until light brown at the edges. Cool in pan. Cut into squares. They’ll keep just fine at room temperature but will last up to a week in the fridge and longer in the freezer."
        ], 
        "date": "2015-11-20T11:50:15+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "3/4 pound (12 ounces, 340 grams or about 2 1/4 cups) dried dates", 
            "2 1/4 cups (530 ml) boiling water", 
            "1 1/2 teaspoons baking soda", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "3/4 cup (150 grams) granulated sugar", 
            "2 tablespoons (25 grams) light or dark brown sugar", 
            "2 large eggs", 
            "1/4 teaspoon fine sea or table salt", 
            "1 2/3 cups (210 grams) all-purpose flour", 
            "Sauce", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "1 cup (235 ml) heavy or whipping cream", 
            "1 cup plus 2 tablespoons (215 grams) brown sugar (light is called for, but I’d like to use dark next time)", 
            "2 teaspoons vanilla extract", 
            "To serve", 
            "Unsweetened whipped cream (optional, but please don’t skip it)", 
            "A few flakes of sea salt", 
            "Fresh mint leaves (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/date-cake-with-toffee-sauce-31.jpg?w=640", 
        "tags": [
            "Cake", 
            "Christmas", 
            "Dates", 
            "English", 
            "Everyday Cakes", 
            "Photo", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/11/date-cake-with-toffee-sauce/", 
        "title": "sticky toffee pudding", 
        "directions": [
            "Make the cake: Pit and roughly chop dates and place them in a heatproof bowl. Pour boiling water over them and stir in the baking soda. Cover the bowl and set it aside for 30 minutes.", 
            "Meanwhile, heat oven to 350°F (175°C). Butter a 9×13-inch baking pan. As an extra precaution, if you’re nervous about sticking (although this cake should not), you can line the bottom with a fitted rectangle of parchment paper.", 
            "Blend date-water mixture in a blender or food processor until smooth. In a large bowl, combine the melted butter and sugars. Whisk in eggs, then salt. Stir in the flour, then date puree. Pour the batter into the prepared pan and bake for 25 to 30 minutes, until a toothpick inserted into the center comes out clean. ", 
            "To serve it rustic-style, as we did, let it cool in the pan on a cooling rack. If you’d like to transfer it later to a serving plate, let cool in the pan for 20 minutes, then flip it out onto a cooling rack, removing the parchment paper if you used it.", 
            "Make the sauce: Combine butter, cream, sugar and vanilla in a larger saucepan than you think you’ll need (I vote for 2 1/2 to 3 quarts) over medium heat and bring to a simmer. Whisk for about 10 minutes, until the mixture thickens slightly. ", 
            "To serve: Cut the cake into squares (still warm is just fine). Drizzle each slice with toffee sauce, a pinch of sea salt, and top with a dollop of whipped cream, if desired. If your mint plant has survived the fall better than mine has, a leaf or two would be lovely here, too."
        ], 
        "date": "2014-11-06T12:06:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 to 1 1/4 pounds red cabbage (1 small head or half of a large one), sliced very thin", 
            "3 tablespoons olive oil", 
            "2 tablespoons lime or lemon juice (I use lime)", 
            "Salt and red pepper flakes (I used the mild Aleppo variety) to taste", 
            "About 1/2 cup pitted dates, coarsely chopped or sliced", 
            "4 ounces feta, crumbled into chunks", 
            "1 tablespoon chopped flat-leaf parsley", 
            "2 teaspoons well-toasted sesame seeds "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-feta-and-red-cabbage-salad1.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Dates", 
            "Fall", 
            "Gluten-Free", 
            "Photo", 
            "Salad", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/11/date-feta-and-red-cabbage-salad/", 
        "title": "date, feta and red cabbage salad", 
        "directions": [
            "Toss cabbage with olive oil and first tablespoons of lime juice, plus salt and pepper, coating leaves evenly. Taste and add more lime juice, salt and pepper to taste. I do this a few times, making sure I really get this base well seasoned because it will be hard to do it as well later.", 
            "Toss dressed cabbage gently with half of dates and feta. Sprinkle with remaining dates, then feta, then parsley and sesame seeds. Dig in.", 
            "Do ahead: The whole salad can sit assembled for at least an hour, if not longer in the fridge. Mine is going strong on the second day. You can also prepare the parts separately (feta, chopped dates, sliced cabbage) to assemble right before serving, if you’re planning ahead for Thanksgiving or a dinner party."
        ], 
        "date": "2015-11-10T12:01:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups coarsely chopped dates (10 ounces or 285 grams pitted)", 
            "1/3 cup orange liqueur such as Cointreau or Triple Sec", 
            "4 tablespoons (2 ounces or 55 grams) unsalted butter, at room temperature", 
            "3/4 cup (145 grams) light brown sugar, lightly packed", 
            "1 large egg", 
            "1 teaspoon pure vanilla extract", 
            "1 tablespoon grated orange zest (2 oranges)", 
            "2 cups (250 grams) all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1 teaspoon ground cinnamon", 
            "1 teaspoon ground nutmeg", 
            "1/4 teaspoon ground cloves", 
            "1 teaspoon kosher salt", 
            "3/4 cup freshly squeezed orange juice (3 oranges)", 
            "3/4 cup (3 ounces or 85 grams) coarsely chopped pecans"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/09/date-spice-loaf.jpg?w=750", 
        "tags": [
            "Cake", 
            "Dates", 
            "Everyday Cakes", 
            "Fruit", 
            "Orange", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/09/date-spice-loaf/", 
        "title": "date spice loaf", 
        "directions": [
            "Preheat the oven to 350°F. Butter the bottom of an 8 1/2 by 4 1/2 by 2 1/2-inch loaf pan. Line the bottom with parchment paper, then butter and flour the pan.", 
            "Combine the dates and orange liqueur in a small bowl and set aside for 30 minutes. Stir occasionally.", 
            "In the bowl of an electric mixer fitted with the paddle attachment, beat the butter and brown sugar together on medium speed for one minute. Scrape down the bowl. With the mixer on low, add the egg, vanilla, and orange zest. Sift together the flour, baking powder, baking soda, cinnamon, nutmeg, cloves, and salt. With the mixer still on low, add the flour mixture alternately with the orange juice to the creamed mixture, beating only until combined. By hand, stir in the dates with their liquid, and the pecans.", 
            "Pour the batter into the prepared loaf pan and smooth the top. Bake for 50 to 60 minutes, until a toothpick comes out clean. Cool in the pan for 10 minutes, then turn out onto a wire rack and cool completely.", 
            "Serving: Ina suggests you serve this bread with an orange cream cheese spread, which you can make by creaming 6 ounces of room temperature cream cheese with 1/3 cup sugar and one tablespoon orange zest in an electric mixer until just combined. "
        ], 
        "date": "2009-09-25T20:15:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (4-pound*) cantaloupe or honeydew melon, seeded and cut into 1-inch cubes (about 8 cups)", 
            "1 1/2 cups water", 
            "1 to 2 tablespoons fresh lime juice", 
            "1 tablespoon sugar (optional, I skipped this)", 
            "1/4 teaspoons salt", 
            "1 quart chilled club soda or seltzer"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/melon-agua-fresca1.jpg?w=500", 
        "tags": [
            "Cantaloupe", 
            "Drinks", 
            "Honeydew", 
            "Photo", 
            "Picnics"
        ], 
        "url": "https://smittenkitchen.com/2009/08/melon-agua-fresca/", 
        "title": "melon agua fresca", 
        "directions": [
            "Garnish: lime wedges or melon slices", 
            "Purée melon in batches with water in a blender or food processor, however, if you use the latter be extra careful as the food processor does not excel in handling large amounts of liquid.", 
            "Transfer to a colander lined with a kitchen towel (not terry cloth) or fine cheesecloth set over a deep bowl and let drain about one hour. Gather ends of towel and very gently squeeze any remaining juice from melon, then discard solids. Stir in lime juice, sugar, and 1/4 tsp salt and chill for another hour.", 
            "Divide among 8 (10-ounces) glasses and top off with club soda. Or vodka. Look, I know some of you are going to anyway; just don’t forget to share.", 
            "Do ahead: Drinks, without club soda, can be made 4 days ahead and chilled. Add soda just before serving.", 
            "* My cantaloupe weighed 2 pounds, my honeydew weighed 7 1/2. I suppose that perfect four-pound melon specimens exist, just certainly not where I shop!"
        ], 
        "date": "2009-08-20T11:48:06+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (6 ounces or 170 grams) unsalted butter, plus additional for greasing pan", 
            "1 1/2 cups (6 3/4 ounces or 190 grams) all purpose flour", 
            "2 teaspoons (9 grams) baking powder", 
            "3/4 teaspoon (4 grams) salt", 
            "Pinch of allspice", 
            "1 cup (7 ounces or 200 grams) sugar", 
            "2 large eggs", 
            "2/3 cup whole milk or buttermilk", 
            "1 1/2 pounds nectarines, halved, pitted and cut into 1/2-inch thick wedges (about 4 cups)", 
            "1 tablespoon lemon juice", 
            "Streusel", 
            "Reserved butter from cake (above)", 
            "1/2 cup (3 1/2 ounces or 100 grams) sugar", 
            "1/2 cup (2 1/4 ounces or 64 grams) all purpose flour", 
            "1/4 teaspoon cinnamon", 
            "Pinch of salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/4833941545_0c7c5409a1_o-1.jpg?w=751", 
        "tags": [
            "Brown Butter", 
            "Cake", 
            "Cookbooks", 
            "Everyday Cakes", 
            "Nectarine", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/07/nectarine-brown-butter-buckle/", 
        "title": "nectarine brown butter buckle", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns. Set aside and let cool (the fridge will hasten this along).", 
            "Prepare you pan: Preheat oven to 350°F. Line the bottom of a 10-inch round cake pan, springform or cast iron skillet with parchment paper and butter the paper and rest of the pan generously; set aside.", 
            "Make the cake: Whisk flour, baking powder, salt and allspice in medium bowl to blend. In a large bowl, whisk together 1/2 cup cooled browned butter (set aside remaining 1/4 cup for topping), sugar and then eggs, one at  a time. Stir in milk or buttermilk. Stir dry ingredients into this wet mixture; mix until just combined and spread batter in prepared pan. Toss nectarine wedges with lemon juice and arrange them in a single layer on top of the batter.", 
            "Make the streusel and bake the cake: Stir remaining brown butter, sugar, flour, cinnamon and salt together until large crumbs form. Sprinkle the nectarine-topped batter with crumbs. Bake until top is golden brown and tester inserted into center comes out with moist crumbs, about 40 to 45 minutes. Let cool in pan for 5 minutes before flipping out onto a cooling rack."
        ], 
        "date": "2010-07-28T10:13:53+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup unbleached all-purpose flour", 
            "1/2 teaspoons sugar", 
            "1/8 teaspoon salt", 
            "6 tablespoons (3/4 stick or 3 ounces) unsalted butter, chilled, cut into 1/2–inch pieces", 
            "Filling", 
            "1 tablespoon ground almonds", 
            "1 tablespoon flour", 
            "1/4 cup plus 3 tablespoons sugar", 
            "1 tablespoon amaretti, pulverized — or — 1 extra tablespoon ground almonds plus an extra teaspoon sugar", 
            "10 ounces galette dough, rolled into a 14-inch circle and chilled", 
            "1 and 1/2 pounds ripe nectarines (about 4 large)", 
            "1 tablespoon unsalted butter, melted", 
            "1/4 cup sliced almonds (optional)", 
            "Peach or nectarine jam (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/nectarine-galette1.jpg?w=500", 
        "tags": [
            "Fruit", 
            "Nectarine", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/08/nectarine-galette/", 
        "title": "nectarine galette", 
        "directions": [
            "Make the crust: Combine the flour, sugar, and salt in a large, wide mixing bowl. Cut in six tablespoons of the butter with a pastry blender or two knives, mixing until the dough resembles coarse cornmeal. Dribble four tablespoons ice water over the mixture, using a rubber spatula to pull the mixture together. Gather the dough into a mound (either in the bowl or on a counter) and gently knead it together, for just a few seconds. If it’s not coming together, add ice water, a tablespoon at a time, until it does. Wrap dough in a flat disc in plastic and refrigerate for at least 30 minutes before rolling out.", 
            "When you are ready to roll out the dough, take one disk and let it soften slightly so that it is malleable but still cold. On a lightly floured surface, roll out the disk into a 14-inch circle about 1/8 inch thick. Transfer the dough to a parchment-lined baking sheet and refrigerate at least 1/2 hour before using.", 
            "Make the galette: Preheat the oven to 400 degrees. Place a pizza stone, if you have one, on a lower rack. Toss the ground almonds, flour, one tablespoon of the sugar, and pulverized amaretti (or mix of extra ground almonds and sugar) together.", 
            "Remove the prerolled dough from the refrigerator or freezer and sprinkle the almond mixture evenly over the pastry, leaving a 1 1/2 to 2-inch border uncoated. Cut nectarines in half, removing pits, then each half into thirds (you’ll get six wedges per nectarine). Arrange the fruit, skin-side-down, in concentric circles on the dough, making a single layer of snugly touching pieces, leaving the border bare. Sprinkle 1/4 cup of the sugar evenly over the fruit.", 
            "While rotating the tart, fold the border of exposed dough up and over itself at regular intervals, crimping and pushing it up against the fruit. Pinch or trim off any excess dough. (Make sure there are no breaks that will let juices leak.) Brush the border with melted butter, and sprinkle it with two tablespoons sugar.", 
            "Bake in the lower third of the oven (preferably on a pizza stone) for about 45 to 50 minutes, until the crust is well browned and its edges are slightly caramelized. If you wish, sprinkle sliced almonds over the galette 15 minutes before the baking time ends, so they get toasty and extra-crisp. As soon as the galette is out of the oven, use a large metal spatula to slide it onto a cooling rack, to keep it from getting soggy. Let cool for 20 minutes. If you want to glaze the tart, brush the fruit lightly with a little warmed peach (or nectarine, if you have it) jam. Serve warm, with vanilla ice cream or with plain yogurt.", 
            "Do ahead: This galette keeps at room temperature for at least two days, and even longer in the fridge. The unbaked dough, wrapped in plastic, will keep in the freezer for a few weeks, the fridge for a day or more. Rolled-out dough may be frozen and used the next day."
        ], 
        "date": "2009-08-30T12:35:26+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "37 gingersnap cookies, coarsely broken (about 9 ounces; about 3 1/4 cups plus 2 tablespoons of pieces)", 
            "6 tablespoons unsalted butter, melted", 
            "Filling", 
            "1 8-ounce container mascarpone cheese", 
            "6 ounces cream cheese, room temperature", 
            "1/4 cup sour cream", 
            "1/4 cup sugar", 
            "1 teaspoon grated lemon peel", 
            "1/4 teaspoon vanilla extract", 
            "1 tablespoon finely chopped crystallized ginger (optional)", 
            "Topping", 
            "4 to 5 small nectarines, halved, pitted, cut into thin slices", 
            "1/4 cup peach jam, warmed", 
            "2 tablespoons finely chopped crystallized ginger (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2691000910_676f814784_o.jpg?w=750", 
        "tags": [
            "Fruit", 
            "Nectarine", 
            "Photo", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/07/nectarine-mascarpone-and-gingersnap-tart/", 
        "title": "nectarine, mascarpone and gingersnap tart", 
        "directions": [
            "For crust: Preheat oven to 350°F. Finely grind gingersnaps in processor. Add butter and blend until crumbs are evenly moistened. Press mixture over bottom and up sides of 9-inch-diameter tart pan with removable bottom. (I like to use a cold metal measuring cup to get a nice, clear demarcation between the base and sides.) Bake crust until color darkens, pressing sides with back of spoon if beginning to slide, about 8 minutes. Cool completely.", 
            "For filling: Beat first 6 ingredients in medium bowl until smooth. Beat in crystallized ginger if you’re using it. Spread filling in prepared crust. Cover loosely and refrigerate at least 2 hours and up to 1 day.", 
            "For topping: Overlap nectarine slices atop filling in concentric circles. Brush with jam. Sprinkle with chopped crystallized ginger if you’re using it. (Mint makes an excellent garnish, if you’re skipping the ginger.) Serve, or refrigerate up to 6 hours."
        ], 
        "date": "2008-07-22T09:47:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup boiling water (optional, see note up top)", 
            "1 cup pitted dates (about 120 grams), roughly chopped", 
            "A few gratings of fresh nutmeg", 
            "2/3 cup milk", 
            "2 cups (410 grams) vanilla ice cream", 
            "Whipped cream and maraschino cherry, to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/palm-springs-date-shake-monkey-flip1.jpg?w=640", 
        "tags": [
            "Dates", 
            "Ice Cream/Sorbet", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/04/palm-springs-date-shake-monkey-flip/", 
        "title": "palm springs date shake + monkey flip", 
        "directions": [
            "If you’d like the smoothest date shake: Pour boiling water over dates in a medium bowl, cover with a lid and let steep for 10 to 15 minutes (longer if you have time). Blend both water and dates in blender until smooth — it will seem like too much water at first but will eventually become a thickish puree. Transfer to freezer for a few minutes to cool it, if it’s not cold enough already. Add date puree back to blender bowl, if they’re not there already.", 
            "If you don’t mind some nubby bits of dates in your shake: Blend dates with a splash or two of the milk until they’re finely ground.", 
            "Both methods: Add nutmeg, milk and ice cream and blend until smooth. Pour into glasses, top with whipped cream and a cherry. ", 
            "To Make A Monkey Flip", 
            "Use all the ingredients above, plus 1/4 cup smooth peanut butter, 1/4 cup chocolate syrup and 2 medium bananas and blend until smooth. You’ll end up with 5 small (8-ounce) shakes instead of 4, but that last one can be your little secret."
        ], 
        "date": "2016-04-29T12:00:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (2 ounces) fresh-squeezed lemon juice", 
            "1/2 cup (4 ounces) fresh watermelon puree, strained through a coarse strainer to remove seeds", 
            "3 tablespoons (1 1/2 ounces) simple syrup*", 
            "3/4 cup (6 ounces) cold water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/watermelon-lemonade.jpg?w=750", 
        "tags": [
            "Citrus", 
            "Drinks", 
            "Fruit", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2009/07/watermelon-lemonade/", 
        "title": "watermelon lemonade", 
        "directions": [
            "Stir it all together and serve over ice. Garnish it with a thin watermelon or lemon wedge, if you’re feeling fancy.", 
            "Spritzy variation: I have never met a beverage I didn’t think would taste better bubbly, thus, if you’re looking for a spritzier version of this, swap one-third (1/4 cup) or more of the water with seltzer or sparkling water.", 
            "Boozy variation: My husband thinks this would taste even better with a splash of vodka. I am not one to argue.", 
            "* Make your own simple syrup: Please. I see it sold in stores and it just boggles my mind. Simmer one part water with one part sugar (I did a cup of each and ended up with more than I needed for a quadruple batch) until sugar has dissolved. Let cool. Or, you can use my speedier method where you simmer one part sugar with half as much water and once it has dissolved, add the second half of the water, cold, which cools the mixture down faster (when you like nothing to slow your pace to the nearest mocktail)."
        ], 
        "date": "2009-07-02T17:48:00+00:00"
    }
]