{
  "date": "2009-08-30T12:35:26+00:00",
  "directions": [
    "Make the crust: Combine the flour, sugar, and salt in a large, wide mixing bowl. Cut in six tablespoons of the butter with a pastry blender or two knives, mixing until the dough resembles coarse cornmeal. Dribble four tablespoons ice water over the mixture, using a rubber spatula to pull the mixture together. Gather the dough into a mound (either in the bowl or on a counter) and gently knead it together, for just a few seconds. If it’s not coming together, add ice water, a tablespoon at a time, until it does. Wrap dough in a flat disc in plastic and refrigerate for at least 30 minutes before rolling out.",
    "When you are ready to roll out the dough, take one disk and let it soften slightly so that it is malleable but still cold. On a lightly floured surface, roll out the disk into a 14-inch circle about 1/8 inch thick. Transfer the dough to a parchment-lined baking sheet and refrigerate at least 1/2 hour before using.",
    "Make the galette: Preheat the oven to 400 degrees. Place a pizza stone, if you have one, on a lower rack. Toss the ground almonds, flour, one tablespoon of the sugar, and pulverized amaretti (or mix of extra ground almonds and sugar) together.",
    "Remove the prerolled dough from the refrigerator or freezer and sprinkle the almond mixture evenly over the pastry, leaving a 1 1/2 to 2-inch border uncoated. Cut nectarines in half, removing pits, then each half into thirds (you’ll get six wedges per nectarine). Arrange the fruit, skin-side-down, in concentric circles on the dough, making a single layer of snugly touching pieces, leaving the border bare. Sprinkle 1/4 cup of the sugar evenly over the fruit.",
    "While rotating the tart, fold the border of exposed dough up and over itself at regular intervals, crimping and pushing it up against the fruit. Pinch or trim off any excess dough. (Make sure there are no breaks that will let juices leak.) Brush the border with melted butter, and sprinkle it with two tablespoons sugar.",
    "Bake in the lower third of the oven (preferably on a pizza stone) for about 45 to 50 minutes, until the crust is well browned and its edges are slightly caramelized. If you wish, sprinkle sliced almonds over the galette 15 minutes before the baking time ends, so they get toasty and extra-crisp. As soon as the galette is out of the oven, use a large metal spatula to slide it onto a cooling rack, to keep it from getting soggy. Let cool for 20 minutes. If you want to glaze the tart, brush the fruit lightly with a little warmed peach (or nectarine, if you have it) jam. Serve warm, with vanilla ice cream or with plain yogurt.",
    "Do ahead: This galette keeps at room temperature for at least two days, and even longer in the fridge. The unbaked dough, wrapped in plastic, will keep in the freezer for a few weeks, the fridge for a day or more. Rolled-out dough may be frozen and used the next day."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/nectarine-galette1.jpg?w=500",
  "ingredient_list": [
    "Crust",
    "1 cup unbleached all-purpose flour",
    "1/2 teaspoons sugar",
    "1/8 teaspoon salt",
    "6 tablespoons (3/4 stick or 3 ounces) unsalted butter, chilled, cut into 1/2–inch pieces",
    "Filling",
    "1 tablespoon ground almonds",
    "1 tablespoon flour",
    "1/4 cup plus 3 tablespoons sugar",
    "1 tablespoon amaretti, pulverized — or — 1 extra tablespoon ground almonds plus an extra teaspoon sugar",
    "10 ounces galette dough, rolled into a 14-inch circle and chilled",
    "1 and 1/2 pounds ripe nectarines (about 4 large)",
    "1 tablespoon unsalted butter, melted",
    "1/4 cup sliced almonds (optional)",
    "Peach or nectarine jam (optional)"
  ],
  "tags": [
    "Fruit",
    "Nectarine",
    "Photo",
    "Picnics",
    "Tarts/Pies"
  ],
  "title": "nectarine galette",
  "url": "https://smittenkitchen.com/2009/08/nectarine-galette/"
}