[
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "3/4 cup (75 grams or 2 1/2 to 2 3/4 ounces) sliced almonds, ideally toasted and cooled", 
            "1 tablespoon (10 grams) all purpose flour", 
            "A few pinches of sea salt", 
            "6 tablespoons (75 grams) plus 1 teaspoon (5 grams) granulated sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/2 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1/2 pound rhubarb", 
            "To finish", 
            "Powdered sugar or 1/4 cup jam of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/almond-rhubarb-picnic-bars-e14640188536441.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Photo", 
            "Picnics", 
            "Rhubarb", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2016/05/almond-rhubarb-picnic-bars/", 
        "title": "almond rhubarb picnic bars", 
        "directions": [
            "Heat oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] ", 
            "Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind almonds, 6 tablespoons sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. ", 
            "Arrange the fruit: Trim rhubarb and cut it half horizontally top to bottom, i.e. like splitting a hamburger bun, with the flatter part on the bottom. [Update: Does this diagram help?] Keep tops and bottoms matched/stacked and cut stalks on the diagonal into about 1 1/4-inch lengths. The top and bottom of each segment should nicely “V” together, color side up, in a chevron pattern. If you mostly reach for the more green segments first and the pink-er segments second, you’ll end up with an ombré look on top. Sprinkle fruit with 1 teaspoon granulated sugar.", 
            "Bake the bars: For 45 to 55 minutes, until they’re golden on top and a toothpick inserted into the almond cream underneath comes out cream-free. The rhubarb pieces are going to move around a little as it bakes so don’t be surprised if the pattern looks a little different when it’s done. ", 
            "Let cool in pan on a rack, or in the fridge, or even in the freezer. You can decorate the bars with a little powdered sugar, or warm some jam and brush it over for a glossier finish. I find it easiest to get very clean cuts when the bars are very cold. A serrated knife, used gently, can ensure the rhubarb stays perfectly put if it’s not cold enough. While bars do not need to be refrigerated if it will just be a day or so, they keep longer and (I think) more nicely chilled."
        ], 
        "date": "2016-05-23T11:56:10+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine ", 
            "Filling", 
            "3/4 cup (a scant 4 ounces or 110 grams) shelled unsalted pistachios", 
            "1 tablespoon (10 grams) all purpose flour", 
            "Few pinches of sea salt", 
            "6 tablespoons (75 grams) sugar", 
            "5 tablespoons (70 grams) unsalted butter, cold is fine", 
            "1 large egg", 
            "1/4 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", 
            "1 pound firm-ripe apricots", 
            "To finish", 
            "Powdered sugar or 1/4 cup apricot jam"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/apricot-pistachio-squares1.jpg?w=640", 
        "tags": [
            "Apricots", 
            "Bars", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/08/apricot-pistachio-squares/", 
        "title": "apricot pistachio squares", 
        "directions": [
            "Heat your oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (If you have an 8-inch square springform, you can skip this and just butter it well.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. Transfer the dough clumps to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.", 
            "(Don’t have a food processor? You might have an easier time using softened butter and preparing this cookie-style: cream it with the sugar with a hand mixer, then spoon in the salt and flour, beating until just combined. It might help to chill this mixture a bit before pressing it into the pan, or it might feel too greasy to easily spread.)", 
            "Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind your pistachios, sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. ", 
            "Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. Cut apricots in half (or, you might find that you can tear them open at the seams with your fingers) and remove pits. From here, you have a few decoration options: you can place the apricot halves in facedown or up all over the pistachio base. You can do as I did, which is cut them into strips, then slide each cut half onto a butter knife or offset spatula, tilt it so that it fans a little, and slide it onto your pistachio filling decoratively. (With this method, I ended up not using all of my apricots.) You could also arrange the strips like petals of flower around the pan, for maximum pretties.]]", 
            "Bake the bars for 60 minutes, or until they are golden and a toothpick inserted into the pistachio portion comes out batter-free. This might take up to 10 minutes longer depending on the juiciness of your apricots and the amount you were able to nestle in. Let cool completely in pan; you can hasten this along in the fridge. ", 
            "To finish, you can make a shiny glaze for your tart by warming the jam in a small saucepan until it thins, and brushing this mixture over the top of the cooled tart. Or, you can keep it rustic with just a dusting of powdered sugar, as I did. ", 
            "Cut bars into squares — chilled bars will give you the cleanest cuts. Keep leftover bars chilled. "
        ], 
        "date": "2014-08-07T12:18:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (4 sticks) unsalted butter, slightly softened", 
            "4 egg yolks", 
            "2 cups granulated sugar", 
            "4 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/4 teaspoon salt", 
            "Optional additions: 1 teaspoon vanilla extract or 1 teaspoon lemon zest", 
            "1 cup raspberry jam, at room temperature", 
            "1/4 cup confectioners’ sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/12/austrian-raspberry-shortbread.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/austrian-raspberry-shortbread/", 
        "title": "austrian raspberry shortbread", 
        "directions": [
            "Cream the butter in a mixer fitted with a paddle attachment (or using a hand mixer) until soft and fluffy. Add the egg yolks and mix well.", 
            "Mix the granulated sugar, flour, baking powder, and salt together. Add to the butter and egg yolk mixture and mix just until incorporated and the dough starts to come together. Turn the dough out onto a floured work surface and form into two balls. Wrap each ball in plastic wrap and freeze at least 2 hours or overnight (or as long as a month, if you like).", 
            "Heat the oven to 350 degrees.", 
            "Remove one ball of dough from the freezer and coarsely grate it by hand or with the grating disk in a food processor into the bottom of a 9×13-inch baking pan or a 10-inch tart pan with a removable bottom (oops, sorry, no). Make sure the surface is covered evenly with shreds of dough.", 
            "With a piping bag with a wide tip or a zip-lock bag with the corner cut off, squeeze the jam over the surface as evenly as possible, to within 1/2 inch of the edge all the way around. Remove the remaining dough from the freezer and coarsely grate it over the entire surface.", 
            "Bake until lightly golden brown and the center no longer wiggles, 50 to 60 minutes. As soon as the shortbread comes out of the oven, dust with confectioners’ sugar. ", 
            "Cool on a wire rack, then cut in the pan with a serrated knife. I find that for this an all bar cookies, chilling the pan in the fridge makes it a lot easier to get clean cuts. "
        ], 
        "date": "2007-12-19T09:00:32+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust: ", 
            "1 1/4 pounds unsalted butter, room temperature", 
            "3/4 cup granulated sugar", 
            "3 extra-large eggs", 
            "3/4 teaspoon pure vanilla extract", 
            "4 1/2 cups all-purpose flour", 
            "1/2 teaspoon baking powder", 
            "1/4 teaspoon salt ", 
            "Topping: ", 
            "1 pound unsalted butter", 
            "1 cup good honey", 
            "3 cups light brown sugar, packed", 
            "1 teaspoon grated lemon zest", 
            "1 teaspoon grated orange zest", 
            "1/4 cup heavy cream", 
            "2 pounds pecans, coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/aww-yeah-1017-grams-of-butter1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/12/aww-yeah-1017-grams-of-butter/", 
        "title": "pecan squares", 
        "directions": [
            "Preheat the oven to 350°F. ", 
            "For the crust: Beat the butter and granulated sugar in the bowl of an electric mixer fitted with a paddle attachment, until light, approximately 3 minutes. Add the eggs and the vanilla and mix well. Sift together the flour, baking powder, and salt. Mix the dry ingredients into the batter with the mixer on low speed until just combined. Press the dough evenly into an ungreased 18 by 12 by 1-inch baking sheet, making an edge around the outside. It will be very sticky; sprinkle the dough and your hands lightly with flour. Bake for 15 minutes, until the crust is set but not browned. Allow to cool. ", 
            "For the topping: Combine the butter, honey, brown sugar, and zests in a large, heavy-bottomed saucepan. Cook over low heat until the butter is melted, using a wooden spoon to stir. Raise the heat and boil for 3 minutes. Remove from the heat. Stir in the heavy cream and pecans. Pour over the crust, trying not to get the filling between the crust and the pan. Bake for 25 to 30 minutes, until the filling is set. Remove from the oven and allow to cool. Wrap in plastic wrap and refrigerate until cold. Cut into bars and serve."
        ], 
        "date": "2006-12-08T14:07:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (200 grams) granulated sugar", 
            "1 teaspoon baking powder", 
            "3 cups (390 grams) all-purpose flour", 
            "1/4 teaspoon salt", 
            "Zest of one lemon", 
            "1 cup (8 ounces or 225 grams) cold unsalted butter, cut into chunks", 
            "1 large egg", 
            "Juice of 1 lemon", 
            "1/2 cup (100 grams) granulated sugar", 
            "4 teaspoons cornstarch", 
            "4 cups fresh blueberries"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2710636010_a64fe15ab8_o.jpg?w=750", 
        "tags": [
            "Bars", 
            "Blueberries", 
            "Crumbles/Crisps", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/07/blueberry-crumb-bars/", 
        "title": "blueberry crumb bars", 
        "directions": [
            "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9×13 inch pan.\nIn a medium bowl, stir together 1 cup sugar, 3 cups flour, baking powder, salt, and lemon zest. Use a fork or pastry cutter to blend in the butter and egg. Dough will be crumbly. Pat half of dough into the prepared pan.\nIn another bowl, stir together the sugar, cornstarch and lemon juice. Gently mix in the blueberries. Sprinkle the blueberry mixture evenly over the crust. Crumble remaining dough over the berry layer.\nBake in preheated oven for 45 minutes, or until top is slightly brown. (This took an extra 10 to 15 minutes in my oven.) Cool completely before cutting into squares.\n"
        ], 
        "date": "2008-07-29T15:25:26+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust:", 
            "7 tablespoons unsalted butter, melted", 
            "1/3 cup sugar", 
            "1/4 teaspoon vanilla extract", 
            "1 cup plus 1 tablespoon all purpose flour", 
            "Pinch of salt", 
            "Filling:", 
            "1/2 cup sugar", 
            "2 large eggs", 
            "Pinch of salt", 
            "1/4 cup all purpose flour", 
            "1 teaspoon vanilla extract", 
            "1/2 cup (1 stick) unsalted butter, diced", 
            "1 pound sweet cherries, which will yield 12 ounces of pitted cherries, which yielded some leftovers, perfect for snacking (alternately, you can use 12 ounces of the berry of your choice)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/3664441408_6dbba66669_b.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cherries", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/06/cherry-brown-butter-bars/", 
        "title": "cherry brown butter bars", 
        "directions": [
            "Make crust: Preheat over to 375°F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. (It should look like this.) Congratulations! You’ve just faked a square tart pan.", 
            "Using rubber spatula or fork, mix melted butter, sugar, and vanilla in medium bowl, or if you’re Deb, in the bottom of the small saucepan you used to melt the butter. Add flour and salt and stir until incorporated. Transfer dough to your prepared pan, and use your fingertips to press the dough evenly across the bottom of the pan. Bake the crust until golden, about 18 minutes (it will puff slightly while baking). Transfer crust to rack and cool in pan. Maintain oven temperature.", 
            "Make the filling: Cook butter in heavy small saucepan (a lighter-colored one will make it easier to see the color changing, which happens quickly) over medium heat until deep nutty brown (do not burn), stirring often and watching carefully, about six minutes. Immediately pour browned butter into glass measuring cup to cool slightly.", 
            "Whisk sugar, eggs, and salt in medium bowl to blend. Add flour and vanilla and whisk until smooth. Gradually whisk browned butter into sugar-egg mixture; whisk until well blended.", 
            "Arrange pitted cherries, or the berries of your choice, in bottom of cooled crust. Carefully pour browned butter mixture evenly over the fruit. Bake bars until filling is puffed and golden and tester inserted into center comes out clean, about 40 minutes (though, of course, this took less time in my hyperactive oven so please watch your baking times carefully). Cool bars completely in pan on rack.", 
            "Use the parchment paper overhang to carefully remove cooled bars from pan and place them on a cutting board and cut them into squares with a very sharp knife. The cherries, if they fall over your slicing lines, will want to give you trouble but if you saw a sharp knife into them slowly before pressing down, they’ll cut neatly and with minimum carnage.", 
            "Do ahead: Can be made at least a day ahead, and stored at room temperature. Any longer, keep them cool in the fridge."
        ], 
        "date": "2009-06-29T13:07:57+00:00"
    }, 
    {
        "ingredient_list": [
            "For the filling", 
            "1 1/2 cups (8 ounces) pitted dates, chopped", 
            "3/4 cup water", 
            "1 teaspoon finely grated orange (or mandarin or clementine) zest", 
            "For the crumbs", 
            "2 tablespoons packed brown sugar", 
            "1/4 cup raw or turbinado sugar", 
            "1/2 cup olive oil, coconut oil, melted butter or a mix of the above", 
            "3/4 cups rolled oats, I used quick-cooking but old-fashioned should work just fine", 
            "3/4 cup plus 2 tablespoons whole wheat flour, or a wholegrain flour mix of your choice", 
            "1/2 teaspoon ground cinnamon", 
            "A few gratings of fresh nutmeg", 
            "A pinch or two of ground cloves", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon coarse sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-breakfast-squares1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Dates", 
            "Photo", 
            "Snack", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2015/11/date-breakfast-squares/", 
        "title": "date breakfast squares", 
        "directions": [
            "Heat oven to 400 degrees. Either grease bottom and sides of an 8×8-inch pan or line the bottom and sides with parchment paper. ", 
            "In a small saucepan, combine dates, water and zest over low heat, simmering for 5 to 10 minutes, until liquid has absorbed and mixture has thickened. Set aside while you make the crumbs.", 
            "In a large bowl, mix the sugars and oil or butter together. Add the oats, flour, spices, baking soda and salt and stir to combine; the mixture should form a coarse rubble. ", 
            "Press half into the bottom of your prepared pan. Dollop the date mixture over it and use a small offset spatula (or whatever you have on hand) to spread the mixture smoothly over the crumbs. Don’t worry if the crumbs move around a little underneath; these bars don’t require perfection. Sprinkle remaining crumbs over date layer and press lightly to cover. ", 
            "Bake bars for 25 minutes, or until light brown at the edges. Cool in pan. Cut into squares. They’ll keep just fine at room temperature but will last up to a week in the fridge and longer in the freezer."
        ], 
        "date": "2015-11-20T11:50:15+00:00"
    }, 
    {
        "ingredient_list": [
            "For crust", 
            "3 1/2 ounces (100 grams or 1 cup) graham crackers, crumbled", 
            "2 tablespoons (25 grams) sugar", 
            "3 tablespoons (45 grams) unsalted butter, melted", 
            "For filling", 
            "1 teaspoon unflavored gelatin (from a 1/4-ounce or 7-gram envelope, will be just about half an envelope)", 
            "1/4 cup (60 ml) whole milk", 
            "8 ounces (225 grams) cream cheese, softened", 
            "2 large eggs", 
            "3/8 teaspoon salt", 
            "1 cup dulce de leche (12 1/2-ounce or 355-gram can) (recipe follows)", 
            "For glaze", 
            "3 ounces (85 grams) fine-quality bittersweet chocolate (not unsweetened), coarsely chopped", 
            "1/2 stick (2 ounces or 55 grams) unsalted butter, cut into pieces", 
            "2 teaspoons light corn syrup"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/dulce-de-leche-cheesecake-squares.jpg?w=750", 
        "tags": [
            "Bars", 
            "Cake", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/02/dulce-de-leche-cheesecake-squares/", 
        "title": "dulce de leche cheesecake squares", 
        "directions": [
            "Make crust: Put oven rack in middle position and preheat oven to 325°F. Line bottom and sides of an 8-inch square baking pan with 2 sheets of foil (crisscrossed), leaving a 2-inch overhang on all sides.", 
            "Finely grind crackers with sugar and a pinch of salt in a food processor. With motor running, add butter, blending until combined. Press mixture evenly onto bottom of baking pan. Bake 10 minutes, then cool in pan on a rack 5 minutes.", 
            "Make filling: Sprinkle gelatin over milk in a small bowl and let stand 2 minutes to soften. Beat together cream cheese, eggs, salt, and gelatin mixture in a bowl with an electric mixer at medium speed until well combined, about 2 minutes, then stir in dulce de leche gently but thoroughly. Pour filling over crust, smoothing top, then bake in a hot water bath (I was able to fit mine in a 9×13-inch baking pan) in oven until center is just set, about 45 minutes. Cool cheesecake completely in pan on rack, about 2 hours. Chill, covered, at least 6 hours.", 
            "Glaze cake within 2 hours of serving: Heat all glaze ingredients in a double boiler or a small metal bowl set over a saucepan of barely simmering water, stirring until smooth, then pour over cheesecake, tilting baking pan to coat top evenly. Chill, uncovered, 30 minutes.", 
            "Lift cheesecake from pan using foil overhang and cut into 1-inch squares with a thin knife, wiping off knife after each cut. (Don’t skip this step! A clean knife is essential for uber-neat squares.)", 
            "Note: Cheesecake (without glaze) can be chilled up to 3 days.", 
            "Dulce de Leche (Milk Caramel)", 
            "I know that most of the world makes this by boiling the milk inside a closed can, but honestly, that scares the bejesus out of me and according to the Carnation can label I pulled this technique from, is not recommended by them (likely because they do not want to get sued, but still). This method works just as well.", 
            "Pour one can (14 ounce) sweetened condensed milk into top of double-boiler pan; cover. Place over boiling water. Cook over low heat, stirring occasionally, for 40 to 50 minutes, or until thick and light caramel-colored.", 
            "Remove from heat. Whisk until smooth."
        ], 
        "date": "2008-02-06T13:08:40+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups old-fashioned oatmeal", 
            "1 cup sliced almonds", 
            "1 cup shredded coconut, loosely packed (I used unsweetened)", 
            "1/2 cup toasted wheat germ", 
            "2/3 cup honey", 
            "1 1/2 teaspoons pure vanilla extract", 
            "1/4 teaspoon kosher salt", 
            "1 1/2 cup dried fruit, or a mix of dried fruit (I used chopped apricots, cranberries and raisins)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/granola-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Coconut", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/09/granola-bars/", 
        "title": "granola bars", 
        "directions": [
            "Preheat your oven to 350°F. Butter an 8×12-inch baking dish (lacking this, I used a 9×13-inch) and line it with parchment paper.", 
            "Toss the oatmeal, almonds, and coconut together on a sheet pan and bake for 10 to 12 minutes, stirring occasionally, until lightly browned. Transfer the mixture to a large mixing bowl and stir in the wheat germ. Reduce the oven temperature to 300°F.", 
            "While the mixture is still warm, stir in the honey, vanilla and salt until the mixture is well coated, then the dried fruit. Pour the mixture into your prepared baking dish and press, press, press it in (wet fingers and/or a silicon spatula work great for this) until the mixture is packed as tightly as possible.", 
            "Bake for 25 to 30 minutes, until light golden brown. Cool for 2 to 3 hours before cutting into squares — your best serrated knife is great for this.", 
            "You can store these in an airtight container at room temperature for a week or two, as you would cookies, however, I prefer to store mine in the freezer. I find that they stay the most crisp this way as all granola tends to soften at room temperature after a day or more. "
        ], 
        "date": "2009-09-02T11:24:48+00:00"
    }, 
    {
        "ingredient_list": [
            "For the crust: ", 
            "1/2 pound unsalted butter, at room temperature", 
            "1/2 cup granulated sugar", 
            "2 cups flour", 
            "1/8 teaspoon kosher salt", 
            "For the full-size lemon layer: ", 
            "6 extra-large eggs at room temperature", 
            "2 1/2 cups granulated sugar", 
            "2 tablespoons grated lemon zest (4 to 6 lemons)", 
            "1 cup freshly squeezed lemon juice", 
            "1 cup flour", 
            "4 extra-large eggs at room temperature", 
            "1 2/3 cups granulated sugar", 
            "1 tablespoon + 1 teaspoon grated lemon zest (3 to 4 lemons)", 
            "2/3 cup freshly squeezed lemon juice", 
            "2/3 cup flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/01/lemon-bars.jpg?w=750", 
        "tags": [
            "Bars", 
            "Citrus", 
            "Cookie", 
            "Fruit", 
            "Lemon", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/01/lemon-bars/", 
        "title": "lemon bars", 
        "directions": [
            "Confectioners’ sugar, for dusting", 
            "Preheat the oven to 350°F and grease a 9 by 13 by 2-inch baking sheet.", 
            "For the crust, cream the butter and sugar until light in the bowl of an electric mixer fitted with the paddle attachment. Combine the flour and salt and, with the mixer on low, add to the butter until just mixed. Dump the dough onto a well-floured board and gather into a ball. Flatten the dough with floured hands and press it into the greased baking sheet, building up a 1/2-inch edge on all sides. Chill.", 
            "Bake the crust for 15 to 20 minutes, until very lightly browned. Let cool on a wire rack. Leave the oven on.", 
            "For the lemon layer, whisk together the eggs, sugar, lemon zest, lemon juice, and flour. Pour over the crust and bake for 30 to 35 minutes (less if you are using the thinner topping), or about five minutes beyond the point where the filling is set. Let cool to room temperature.", 
            "Cut into rectangles and dust with confectioners’ sugar."
        ], 
        "date": "2008-01-07T23:12:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (1 stick) salted butter, cut into large pieces", 
            "1 1/2 cups graham crackers crumbs (about 8 graham crackers, pulsed in a food processor)", 
            "1 1/2 cups chocolate chips", 
            "1 cup butterscotch chips", 
            "1 cup shredded coconut", 
            "1 cup pecans, coarsely chopped", 
            "1/3 cup sweetened condensed milk (just under half a small can)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/lookin-swell-dolly1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Candy", 
            "Chocolate", 
            "Coconut", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/10/lookin-swell-dolly/", 
        "title": "hello dolly bars", 
        "directions": [
            "Preheat oven to 350 degrees.", 
            "Melt butter in microwave in heatproof bowl until just melted when stirred. Add graham cracker crumbs. Mix and then press evenly into the bottom of 8×8 baking pan. ", 
            "Layer coconut, pecans, butterscotch and chocolate chips on top of graham cracker base. Pour sweetened condensed milk over whole mixture. ", 
            "Bake in oven for 25 to 30 minutes, or until the top is light brown.", 
            "Like all brownie and cookie bars, I find them easier to cut cleanly once they’ve been thoroughly cooled in the fridge, but I also don’t expect you to be able to wait that long. ", 
            "Because they’re so sweet, I like to cut them into really tiny squares. Those mini-cupcake liners come in handy as well, too, so they don’t all cluster together, not that anyone would mind. "
        ], 
        "date": "2007-10-08T21:07:08+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup granulated (50 grams) or powdered (30 grams) sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "6 tablespoons (85 grams) unsalted butter", 
            "1/3 cup dark brown sugar", 
            "1/3 cup granulated sugar", 
            "1 large egg", 
            "1 large egg yolk", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 tablespoon bourbon (optional)", 
            "1 teaspoon vanilla extract", 
            "6 tablespoons all-purpose flour", 
            "3/4 cup (4 1/2 ounces or 130 grams) chocolate chips or chopped chocolate", 
            "3/4 cup toasted (always) and coarsely chopped walnuts or pecans", 
            "Flaky sea salt on top, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/not-derby-pie-bars1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Bourbon", 
            "Chocolate", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2015/04/not-derby-pie-bars/", 
        "title": "not derby pie bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. A little nonstick spray underneath helps keep the strips in place. (If you have an 8-inch square springform, you can skip this and just butter it lightly.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take another 30 seconds for it to come together, but it will. Transfer the dough clumps to prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. Meanwhile, prepare the filling.", 
            "Make the filling: Melt your butter and, if desired, brown it too, by continuing to cook the butter in a small saucepan over medium heat, stirring frequently, until golden brown bits form at the bottom, about 5 minutes. Transfer butter to a large bowl and let it cool; you can hasten this along by setting it in the freezer for a couple minutes or stirring it over an ice water bath.", 
            "Whisk sugars into butter until smooth, then egg, (edited to add) yolk, salt, bourbon (if using) and vanilla. Stir in flour until just combined, then mix in chocolate and nuts. Pour over par-baked crust, spreading evenly. Sprinkle lightly with sea salt before baking, if desired. ", 
            "Bake bars: For 20 to 25 minutes, until top is firm and golden. Bars are much easier to cut if you let them cool almost completely, but I suspect there’s little fun in that. Once they’re cool, however, you can easily transfer them from the pan to a cutting board with the parchment paper sling you created. Serve plain, with whipped cream or a tiny scoop of vanilla ice cream. Can dust with powdered sugar for extra pretties. ", 
            "Store at room temperature for up to 3 days, or in the fridge for longer."
        ], 
        "date": "2015-04-30T12:00:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (7 ounces or 200 grams) white sugar", 
            "1 teaspoon (5 grams) baking powder", 
            "2 3/4 cups plus 2 tablespoons (12 5/8 ounces or 359 grams) cups all-purpose flour (or you can measure 3 cups and remove 2 tablespoons flour)", 
            "1/4 teaspoon cinnamon", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1/4 teaspoon (2 grams) salt", 
            "1 cup (2 sticks or 8 ounces or 227 grams) cold unsalted butter", 
            "1 large egg", 
            "2 peaches, pitted and thinly sliced (between 1/8 and 1/4-inch thick)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/09/4950027940_b3512efca3_o.jpg?w=749", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Cookie", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/09/peach-shortbread/", 
        "title": "peach shortbread", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns and the very second that you turn around to do something else. Set it in the freezer until solid (about 30 minutes).", 
            "[Don’t have time for all this brown butter madness? Check the head notes to use regular softened butter instead.]", 
            "Preheat the oven to 375°F (190°C). Butter a 9×13 inch pan, or spray it with a nonstick spray. In a medium bowl, stir together sugar, baking powder, flour, salt and spices with a whisk.  Use a pastry blender, fork or your fingertips, blend the solidified brown butter and egg into the flour mixture. It will be crumbly. Pat 3/4 of the crumbs into the bottom of the prepared pan, pressing firmly. Tile peach slices over crumb base in a single layer. Scatter remaining crumbs evenly over peaches and bake in preheated oven for 30 minutes, until top is slightly brown and you can see a little color around the edges. Cool completely in pan before cutting into squares.", 
            "Keeping: I’ve kept mine in the fridge and they’ve held up great there since Monday. I imagine that these would freeze well, between layers of waxed paper, with the container sealed well in plastic wr"
        ], 
        "date": "2010-09-02T15:58:05+00:00"
    }, 
    {
        "ingredient_list": [
            "", 
            "\t\t", 
            "\t", 
            "\t\tPeople, these things are nothing but trouble, so whatever you do, don’t do this:", 
            "", 
            "", 
            "Do not start with a bowl of vaguely healthful and intensely fortified bowl of Snap, Crackle and Pop.", 
            "", 
            "Do not boil some sugar, because obviously unsweetened cereal will not do.", 
            "", 
            "(Try not to do this to your lens, either, when you take a picture.)", 
            "", 
            "Do not mix the caramel with the Krispies and press them into a pan.", 
            "", 
            "", 
            "Definitely don’t melt some chocolate and peanut butter together. ", 
            "", 
            "Or do this.", 
            "", 
            "And this.", 
            "", 
            "Then this.", 
            "", 
            "Or sit back and scratch your head as they disappear, because there’s only two of you at home. Just don’t, okay?", 
            "I’m sorry, are you still there? I figure that by now, half of you rebels have already run to the grocery store to buy your first box of Rice Krispies in half a lifetime, and the other half of you are appalled, simply appalled, at the syrupy, overindulgent, processed and fattening “treats” we Americans are so fond of.", 
            "Well, here’s a warning to those of you in the latter camp (those of you in the former one already know this): these bars will win you over. I wholly admit that as awesome as they sound, I really made them because I live with a 3rd grader 34 year old that has only one reaction to the suggestion of chocolate and peanut butter: WANT. ", 
            "But when I first tried them, I was a little taken aback. The crispy layer crumbled to the point that I couldn’t get a clean cut and I thought the peanut butter layer was too thick and sweet. Were I a more patient cook this week–you see, I am quietly considering partaking in this NaBloPoMo madness again this year, because I never learn, which would mean that I should preserve my cooking energy–I might have tried it over again with a few tweaks…", 
            "But a day or two later now, they’ve completely won me over and I now realize why the Baked boys say that this is, hands down, the most popular refrigerated bar they make at the bakery. Curious about the others? The Rasberry Breakfast Bars and Baked Brownies weren’t enough for you? (And how could they be, with as yet un-auditioned recipes for Pumpkin Whoopie Pies and S’more Nut Bars and Butterscotch Pudding Tarts?) You’ve got to get your own copy.", 
            "Chocolate and peanut butter, previously: Chocolate and Peanut Butter Cake, Peanut Butter Brownies and Peanut Butter Cookies", 
            "One year ago: Sweet Potato and Sausage Soup", 
            "Two years ago Bretzel Rolls", 
            "\t", 
            "", 
            "\t", 
            "Peanut Butter Crispy Bars", 
            "Adapted from Baked: New Frontiers in Baking", 
            "These bars are sticky and indulgent and not good for you in any way, so before you even ask, perhaps you can make them with organic, low-fat peanut butter, whole grain bio-crisped rice cereal or a sugar substitute but you shouldn’t. Nobody likes a party pooper.", 
            "For the crispy crust", 
            "1 3/4 cups crisped rice cereal", 
            "1/4 cup sugar", 
            "3 tablespoons light corn syrup", 
            "3 tablespoons unsalted (their recommendation) or salted (what I used, and liked) butter, melted", 
            "For the milk chocolate peanut butter layer", 
            "5 ounces good-quality milk (their recommendation) or semi-sweet (what I’d use next time) chocolate, coarsely chopped", 
            "1 cup creamy peanut butter", 
            "For the chocolate icing", 
            "3 ounces dark chocolate (60 to 72 percent cocoa), coarsely chopped", 
            "1/2 teaspoon light corn syrup", 
            "4 tablespoons (1/2 stick or 2 ounces) unsalted (their recommendation) or salted (what I used, and liked) butter", 
            "Make the crispy crust: Lightly spray a paper towel with nonstick cooking spray and use it to rub the bottom and sides of an 8-inch square baking pan.", 
            "Put the cereal in a large bowl and set aside.", 
            "Pour 1/4 cup water into a small saucepan. Gently add the sugar and corn syrup (do not let any sugar or syrup get on the sides of the pan) and use a small wooden spoon to stir the mixture until just combined. Put a candy thermometer in the saucepan. Cook over medium-high heat and bring to a boil; cook until the mixture reaches the soft ball stage, 235 degrees F.", 
            "Remove from the heat, stir in the butter, and pour the mixture over the cereal. Working quickly, stir until the cereal is thoroughly coated, then pour it into the prepared pan. Using your hands, press the mixture into the bottom of the pan (do not press up the sides). Let the crust cool to room temperature while you make the next layer.", 
            "Make the milk chocolate peanut butter layer: In a large nonreactive metal bowl, stir together the chocolate and the peanut butter. Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is smooth. Remove the bowl from the pan and stir for about 30 seconds to cool slightly. Pour the mixture over the cooled crust. Put the pan in the refridgerator for 1 hour, or until the top layer hardens.", 
            "Make the chocolate icing: In a large nonreactive metal bowl, combine the chocolate, corn syrup, and butter.", 
            "Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is completely smooth. Remove the bowl from the pan and stir for 30 seconds to cool slightly. Pour the mixture over the chilled milk chocolate peanut butter layer and spread (actually, I found it easier to just roll it around until it coated smoothly, avoiding the risk of picking up any of the peanut butter layer with it) into an even layer. Put the pan into the refrigerator for 1 hour, or until the topping hardens.", 
            "Cut into 9 (they say, I say 16, at least!) squares and serve. The bars can be stored in the refrigerator, covered tightly, for up to 4 days.", 
            "Rate this:Do More:TwitterFacebookPinterestPrintEmail\t\t\t", 
            "For the crispy crust", 
            "1 3/4 cups crisped rice cereal", 
            "1/4 cup sugar", 
            "3 tablespoons light corn syrup", 
            "3 tablespoons unsalted (their recommendation) or salted (what I used, and liked) butter, melted", 
            "For the milk chocolate peanut butter layer", 
            "5 ounces good-quality milk (their recommendation) or semi-sweet (what I’d use next time) chocolate, coarsely chopped", 
            "1 cup creamy peanut butter", 
            "For the chocolate icing", 
            "3 ounces dark chocolate (60 to 72 percent cocoa), coarsely chopped", 
            "1/2 teaspoon light corn syrup", 
            "4 tablespoons (1/2 stick or 2 ounces) unsalted (their recommendation) or salted (what I used, and liked) butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peanut-butter-crispy-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Candy", 
            "Peanut Butter", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/10/peanut-butter-crispy-bars/", 
        "title": "peanut butter crispy bars", 
        "directions": [
            "Make the crispy crust: Lightly spray a paper towel with nonstick cooking spray and use it to rub the bottom and sides of an 8-inch square baking pan.", 
            "Put the cereal in a large bowl and set aside.", 
            "Pour 1/4 cup water into a small saucepan. Gently add the sugar and corn syrup (do not let any sugar or syrup get on the sides of the pan) and use a small wooden spoon to stir the mixture until just combined. Put a candy thermometer in the saucepan. Cook over medium-high heat and bring to a boil; cook until the mixture reaches the soft ball stage, 235 degrees F.", 
            "Remove from the heat, stir in the butter, and pour the mixture over the cereal. Working quickly, stir until the cereal is thoroughly coated, then pour it into the prepared pan. Using your hands, press the mixture into the bottom of the pan (do not press up the sides). Let the crust cool to room temperature while you make the next layer.", 
            "Make the milk chocolate peanut butter layer: In a large nonreactive metal bowl, stir together the chocolate and the peanut butter. Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is smooth. Remove the bowl from the pan and stir for about 30 seconds to cool slightly. Pour the mixture over the cooled crust. Put the pan in the refridgerator for 1 hour, or until the top layer hardens.", 
            "Make the chocolate icing: In a large nonreactive metal bowl, combine the chocolate, corn syrup, and butter.", 
            "Set the bowl over a saucepan of simmering water and cook, stirring with a rubber spatula, until the mixture is completely smooth. Remove the bowl from the pan and stir for 30 seconds to cool slightly. Pour the mixture over the chilled milk chocolate peanut butter layer and spread (actually, I found it easier to just roll it around until it coated smoothly, avoiding the risk of picking up any of the peanut butter layer with it) into an even layer. Put the pan into the refrigerator for 1 hour, or until the topping hardens.", 
            "Cut into 9 (they say, I say 16, at least!) squares and serve. The bars can be stored in the refrigerator, covered tightly, for up to 4 days."
        ], 
        "date": "2008-10-28T15:39:11+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (190 grams) smooth peanut butter", 
            "2/3 (135 grams) cup granulated sugar", 
            "1 large egg", 
            "1/4 teaspoon vanilla extra", 
            "A few pinches of flaky or coarse sea salt", 
            "3 ounces (85 grams) unsweetened chocolate, roughly chopped", 
            "1/2 cup (115 grams or 4 ounces) unsalted butter, plus extra for pan", 
            "1 1/4 cups (250 grams) granulated sugar", 
            "2 large eggs", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1/2 teaspoon flaky or heaped 1/4 teaspoon of coarse sea salt", 
            "2/3 cup (85 grams) all-purpose flour", 
            "1/4 cup (40 grams) semi- or bittersweet chocolate chips"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/peanut-butter-swirled-brownies.jpg?w=750", 
        "tags": [
            "Bars", 
            "Brownies/Blondies", 
            "Chocolate", 
            "Peanut Butter", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2017/03/peanut-butter-swirled-brownies/", 
        "title": "peanut butter swirled brownies", 
        "directions": [
            "Heat oven: To 350°F (175°C).", 
            "Line an 8-inch square baking pan with parchment and coat the bottom and sides with nonstick cooking spray or butter.", 
            "Make peanut butter batter: Whisk all ingredients in a bowl until smooth.\nMake brownie batter: In a medium heatproof bowl over gently simmering water, melt chocolate and butter together until only a couple unmelted bits remain. Off the heat, stir until smooth and fully melted. You can also do this in the microwave in 30-second bursts, stirring between each. Whisk in sugar, then eggs, one at a time, then vanilla and salt. Stir in flour with a spoon or flexible spatula.\nAssemble brownies: Spread a thin layer of brownie batter (about 1/3 of total batter, but no need to be exact) in bottom of prepared baking pan. Dollop peanut butter batter all over in big spoonfuls. Dollop remaining brownie batter in pan, aiming, if you can, between the peanut butter dollops. Use a butter knife to swirl the batters together in loose figure-8s. Sprinkle chips all over.\nBake: For 30 to 35 minutes, or until a toothpick inserted into the center comes out batter-free.\nTo keep: Brownies keep well at room temperature, in the fridge or freezer."
        ], 
        "date": "2017-03-17T11:46:13+00:00"
    }, 
    {
        "ingredient_list": [
            "For the base:", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 teaspoon freshly grated lemon zest", 
            "1/8 teaspoon table salt", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cut into chunks", 
            "1 cup (125 grams) flour", 
            "For the lemonade layer", 
            "1 cup (about 5 ounces or 140 grams) raspberries", 
            "2 large eggs", 
            "3/4 cup (150 grams) granulated sugar", 
            "1/4 cup freshly squeezed lemon juice; this should only require 2 lemons", 
            "1/3 cup (40 grams) all-purpose flour", 
            "Confectioners’ sugar, for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pink-lemonade-bars1.jpg?w=500", 
        "tags": [
            "Bars", 
            "Citrus", 
            "Lemon", 
            "Photo", 
            "Picnics", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/08/pink-lemonade-bars/", 
        "title": "pink lemonade bars", 
        "directions": [
            "Preheat your oven to 350°F (180°C) and line an 8x8x2-inch baking pan with parchment, letting it extend up two sides. Butter or coat the bottom and sides with a nonstick spray and set the pan aside.", 
            "Make the base: In a food processor, pulse together the sugar, zest and salt until combined. Add the butter and pulse until it is evenly dispersed in the dough. Add the flour and pulse the machine until it’s just combined and the mixture is crumbly. Press the dough into the prepared pan and about 1/2-inch up the sides. Don’t worry about making this perfect; mine was an uneven mess and nobody can tell. Bake for 15 minutes, until lightly browned at edges. Let cool on a rack while you prepare the filling (though no need for it to be completely cool when you fill it). Leave oven on.", 
            "Make the pink lemonade layer: Puree the raspberries in your food processor until they’re as liquefied as they’ll get. I don’t even bother cleaning mine between steps, but I’m also probably lazier than you. Run the puree through a fine-mesh sieve, trying to press out all the raspberry puree that you can, leaving the seeds behind. I ended up with 1/3 cup strained puree; don’t worry if you get a smidge less.", 
            "In a medium bowl, whisk together the eggs, sugar and lemon juice until smooth. Whisk in 3 tablespoons of raspberry puree. Stir in flour. Pour into cooling crust and return pan to the oven, baking the bars until they’re set (they’ll barely jiggle) and slightly golden at the edges, about 25 to 30 minutes. Cool completely before cutting into rectangles. (You can speed this up in the fridge.)", 
            "I intended to cut mine into 32 2×1-inch rectangles but actually cut them into 28 2×1-ish rectangles. I like lemony bars small but you could also cut them into 16 2×2-inch squares. Dust with powdered sugar before serving. Store in fridge for up to a week."
        ], 
        "date": "2012-08-03T13:26:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (130 grams) all-purpose flour", 
            "1/2 cup (55 grams) sliced almonds, toasted or equivalent weight almond flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup (50 grams) granulated sugar", 
            "1/4 teaspoon almond extract", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "2/3 cup (85 grams) all purpose flour", 
            "1/3 cup (packed) almond paste (about 3.5 ounces or half a 7-ounce tube)", 
            "1/3 cup (65 grams) light brown sugar", 
            "1/4 teaspoon fine sea or table salt", 
            "4 tablespoons (2 ounces or 55 grams) chilled unsalted butter, cut into cubes", 
            "1/4 cup (30 grams) sliced, toasted almonds", 
            "1 pounds plums (about 6 to 7), halved, pitted, thinly sliced", 
            "3 tablespoons granulated sugar", 
            "1 1/2 tablespoons cornstarch"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/plum-squares-with-marzipan-crumble.jpg?w=750", 
        "tags": [
            "Bars", 
            "Crumbles/Crisps", 
            "Photo", 
            "Plum", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/09/plum-squares-with-marzipan-crumble/", 
        "title": "plum squares with marzipan crumble", 
        "directions": [
            "Heat oven to 375 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.\nMake the crust: Combine the flour, almonds, salt, sugar and extract in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.\nMake crumble: Blend flour, almond paste, sugar and salt in processor until almond paste is finely ground. Add butter and blend, using on/off turns, until coarse crumbs form. Transfer crumble to bowl; mix in almonds.\nMake filling: Combine all ingredients in medium bowl; toss to coat well.\nAssemble squares: Sprinkle 1/2 cup prepared crumble over cooled crust. Top with plum mixture. Sprinkle with remaining crumble.", 
            "Bake: Until filling bubbles thickly and top is golden, about 35 to 40 minutes. If the bars brown too quickly, cover them with foil for the remaining baking time. Cool in pan. I like to hurry this (too) along in the fridge or freezer. Once firm, I’ll use the parchment sling to remove the bars and cut them more cleanly on a cutting board. Dust with powdered sugar, if desired, before serving.\nDo ahead: These bars keep for up to a week in the fridge, longer in the freezer."
        ], 
        "date": "2016-09-01T07:33:56+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/raspberry-breakfast-bars.jpg?w=753", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Elsewhere", 
            "Fruit", 
            "Photo", 
            "Raspberries", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/09/raspberry-breakfast-bars/", 
        "title": "raspberry breakfast bars", 
        "directions": [
            "Make the crust and crumb: Preheat the oven to 350°F. Butter the bottom and sides of a 9-by-13-inch glass or light-colored metal baking pan. Put a long piece of parchment paper in the bottom of the pan, letting the parchment extend up the two short sides of the pan and overhang slightly on both ends. (This will make it easy to remove the bars from the pan after they have baked.) Butter the parchment.", 
            "Put the flour, brown sugar, oats, salt, baking powder, baking soda, and cinnamon in a food processor. Pulse in short bursts until combined. Add the butter and pulse until loose crumbs form.", 
            "Reserve 1 1/2 cup of the mixture and set aside. (Note: The book suggests you reserve one cup only. My gut told me that was too little, and I upped it. I wanted to make sure the top of the raspberries were mostly covered, at least for packing purposes, and was glad I had changed it.) Pour the rest of the mixture into the prepared pan and use your hans or the back of a large wooden spoon to push the crust into an even layer at the bottom of the pan. The crust should touch the sides of the pan. Bake until golden brown, 12 to 15 minutes. Transfer to a wire rack and let the crust cool. Keep the oven on while you make the raspberry filling.", 
            "Make the raspberry filling: In a medium bowl, whisk the sugar, lemon zest, cinnamon and flour together. Add the raspberries, lemon juice and butter and use your hands to toss gently until the raspberries are evenly coated.", 
            "Assemble and bake the bars: Spread the raspberry filling evenly on top of the cooled crust. Sprinkle the reserved crust mixture evenly on top of the filling.", 
            "Bake for 35 to 45 minutes, rotating the pan every 15 minutes, until the top is golden brown and the filling starts to bubble around the edges.", 
            "Transfer to a wire rack to cool completely, then cut into squares and serve. The bars can be stored in the refrigerator in an airtight container for up to two days."
        ], 
        "date": "2008-09-02T15:50:41+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces (113 grams) unsalted butter, plus extra for the pan", 
            "1 10-ounce (285-gram) bag marshmallows", 
            "Heaping 1/4 teaspoon coarse sea salt", 
            "6 cups (160 grams) crispy rice cereal (about half a 12-ounce box)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/salted-brown-butter-crispy-treats.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Candy", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2009/11/salted-brown-butter-crispy-treats/", 
        "title": "salted brown butter crispy treats", 
        "directions": [
            "Butter (or coat with non-stick spray) an 8-inch square cake pan with 2-inch sides.", 
            "In a large pot, melt butter over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as while you may be impatient for it to start browning, the period between the time the butter begins to take on color and the point where it burns is often less than a minute.", 
            "As soon as the butter takes on a nutty color, turn the heat off and stir in the marshmallows. The residual heat from the melted butter should be enough to melt them, but if it is not, turn it back on low until the marshmallows are smooth.", 
            "Remove the pot from the stove and stir in the salt and cereal together. Quickly spread into prepared pan. I liked to use a piece of waxed or parchment paper that I’ve sprayed with oil to press it firmly and evenly into the edges and corners, though a silicon spatula works almost as well.", 
            "Let cool, cut into squares and get ready to make new friends. "
        ], 
        "date": "2009-11-02T13:52:13+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (80 grams) rolled oats", 
            "3/4 cup (95 grams) plus up to 2 tablespoons (15 grams) extra all-purpose flour", 
            "1/2 cup (95 grams) light brown sugar", 
            "Heaped 1/4 teaspoon table salt", 
            "6 tablespoons (85 grams) unsalted butter, melted", 
            "1 teaspoon cornstarch (optional, but helps firm up the filling)", 
            "1 tablespoon (15 ml) lemon juice", 
            "1 tablespoon (15 grams) granulated sugar, divided", 
            "1 cup (125 grams) small-diced rhubarb (from about 1 1/2 medium stalks)", 
            "1 cup (155 grams) small-diced strawberries", 
            "Powdered sugar, for decoration, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/strawberry-rhubarb-crisp-bars1.jpg?w=640", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Crumbles/Crisps", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Rhubarb", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/05/strawberry-rhubarb-crisp-bars/", 
        "title": "strawberry rhubarb crisp bars", 
        "directions": [
            "Heat oven to 375 degrees F. For easy removal, line bottom and two sides of 8-by-8-inch square baking pan with parchment paper. No need to bother (and no greasing needed) if you plan to serve them right in the pan, as I did. ", 
            "Place oats, 3/4 cup flour, brown sugar and salt in bottom of baking pan and mix. Pour melted butter over, and stir until clumps form. If the clumps feel soft or look overly damp, add the remaining 2 tablespoons flour. Set aside 1/2 cup of the crumble mixture. Press the rest of the crumb mixture evenly in the bottom of the pan.", 
            "Spread half the fruit over the crust. Sprinkle it evenly with cornstarch, then lemon juice, and 1/2 tablespoon of granulated sugar. Spread remaining fruit over this, and top with second 1/2 tablespoon sugar. Scatter reserved crumbs over fruit and bake bars for 30 to 40 minutes (firmer fruits will take longer), until fruit is bubbly and crisp portion is golden and smells toasty and amazing. ", 
            "Let cool in pan; I do this in the fridge, where they become crisp once chilled (less so at room temperature). Cut into squares and sprinkle with powdered sugar before serving. Store leftovers in fridge."
        ], 
        "date": "2014-05-09T11:20:41+00:00"
    }
]