[
    {
        "ingredient_list": [
            "Cake", 
            "2 cups (250 grams or 8 3/4 ounces) all-purpose flour", 
            "1 teaspoon baking powder", 
            "3/4 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "1 stick (113 grams or 4 ounces) unsalted butter, softened", 
            "1/4 cup light (55 grams or 2 ounces) brown sugar", 
            "1 tablespoon (15 ml) dark rum", 
            "2 large eggs, at room temperature", 
            "1 cup (237 ml) cream of coconut", 
            "1/2 cup (72 grams or 2 1/2 ounces) finely chopped fresh pineapple (or pineapple from a can, strained, juice reserved)", 
            "To brush over the cake", 
            "1 to 2 tablespoons rum (optional)", 
            "2 tablespoons pineapple juice (optional)", 
            "Glaze", 
            "1 cup (120 grams or 4 ounces) powdered sugar", 
            "Pinch of table or fine sea salt", 
            "1 1/2 to 3 tablespoons pineapple juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pina-colada-cake1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Coconut", 
            "Everyday Cakes", 
            "Photo", 
            "Pineapple"
        ], 
        "url": "https://smittenkitchen.com/2011/02/pina-colada-cake/", 
        "title": "piña colada cake", 
        "directions": [
            "2 tablespoons dark rum for sprinkling over cake (optional)", 
            "Preheat oven to 350°F. Butter a 9-inch round cake pan and line the bottom with a circle of parchment paper, then butter parchment. (Alternately, you can use a cooking spray, either with just butter or butter and flour to speed this process up.)", 
            "Whisk together flour, baking powder, baking soda, and salt in a medium bowl. In a large mixing bowl, beat butter and brown sugar with an electric mixer at medium speed until pale and fluffy, then beat eggs, one at a time, and rum. Add cream of coconut and mix; the batter will look curdly and worrisome but will all work out in the end. Add dry ingredients, half at a time, mixing and scraping down bowl between additions. Mix only until flour is just incorporated. Using a rubber spatula, fold in bits of pineapple.", 
            "Spread batter evenly in prepared pan. Bake until golden and a wooden pick inserted in center of cake comes out clean, 35 to 40 minutes. Cool in pan on a rack 10 minutes, then run a knife around edge of pan. Invert onto rack and discard parchment.", 
            "For extra flavor, while the cake is still hot you can brush it with rum or pineapple juice.", 
            "Cool cake completely at room temperature, or in the fridge if you are impatient for cake (who isn’t?). Once completely cool, place powdered sugar and salt in a small bowl with 1 1/2 tablespoons pineapple juice and whisk until a thick glaze forms. Thin glaze only as needed, adding additional pineapple juice a teaspoon at a time until glaze is just thick enough to pour. Pour glaze into middle of cake and if it’s too thick to crawl to the edges itself, nudge it with a spatula until the top is covered. Serve immediately or let it set in the fridge for 20 minutes or so."
        ], 
        "date": "2011-02-28T12:24:53+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/the-consolation-prize-a-pineapple-lime-coconut-and-mint-mocktail1.jpg?w=750", 
        "tags": [
            "Coconut", 
            "Drinks", 
            "Lime", 
            "Photo", 
            "Pineapple"
        ], 
        "url": "https://smittenkitchen.com/2015/03/the-consolation-prize-a-mocktail/", 
        "title": "the consolation prize (a mocktail)", 
        "directions": [
            "In the bottom of a cocktail shaker, lightly muddle mint — no need to render it into small flecks, but if you break it up a little, more flavor will be released. Add pineapple, lime, honey, coconut milk and a few ice cubes and shake it well. Pour over ice cubes in glasses, finish with a splash of seltzer and garnishes. Close your eyes and pretend you’re somewhere tropical."
        ], 
        "date": "2015-03-19T11:55:25+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-sunny-day-yawn1.jpg?w=500", 
        "tags": [
            "Cake", 
            "Everyday Cakes", 
            "Photo", 
            "Pineapple"
        ], 
        "url": "https://smittenkitchen.com/2007/05/the-sunny-day-yawn/", 
        "title": "pineapple upside-down cake", 
        "directions": [
            "Special equipment: A well-seasoned 10-inch cast-iron skillet. If you lack a cast-iron skillet of this size, make the caramel in a small pot and scrape it into the bottom of a similarly-sized cake pan.  (I used a 9″ cake pan in the pictures above.)", 
            "Preheat oven to 350°F (175°C).", 
            "Make topping: Cut pineapple crosswise into 3/8-inch-thick pieces. Melt butter in skillet. Add brown sugar and simmer over moderate heat, stirring, four minutes. Remove from heat. Arrange pineapple on top of sugar mixture in concentric circles, overlapping pieces slightly.", 
            "Make batter: Sift together flour, baking powder, and salt. Beat butter in a large bowl with an electric mixer until light and fluffy, then gradually beat in granulated sugar. Add eggs, one at a time, beating well after each addition. Beat in vanilla and rum. Add half of flour mixture and beat on low speed just until blended. Beat in pineapple juice, then add remaining flour mixture, beating just until blended. (Batter may appear slightly curdled.) ", 
            "Spoon batter over pineapple topping and spread evenly. Bake cake in middle of oven until golden and a tester comes out clean, about 45 minutes. Let cake stand in skillet five minutes. Invert a plate over skillet and invert cake onto plate (keeping plate and skillet firmly pressed together). Replace any pineapple stuck to bottom of skillet. Sprinkle rum over cake and cool on plate on a rack. ", 
            "Serve cake just warm or at room temperature.", 
            "Do ahead: Cake may be made one day ahead and chilled, covered. Bring to room temperature before serving."
        ], 
        "date": "2007-05-07T14:38:35+00:00"
    }
]