{
  "date": "2010-01-07T19:18:26+00:00",
  "directions": [
    "In a medium saucepan, bring the chicken stock to a simmer over moderately high heat. Reduce the heat to low and keep warm.",
    "In a large, deep skillet, heat the olive oil. Add the onion and thyme and cook over moderate heat, stirring occasionally, until the onion is softened, about 6 minutes. Add the barley and cook, stirring, for 2 minutes. Add the wine if using and cook, stirring until absorbed, about one minute. Add 1 cup of the warm stock and cook, stirring, until nearly absorbed. Continue adding the stock 1/2 cup at a time in six additions — you’ll have a cup of stock left in the pot — stirring until it is nearly absorbed between additions. Most barley risottos are done when the barley is al dente and suspended in a thick, creamy sauce, about 35 minutes, however, I like to take this one a little “soupier” adding another half to one cup of stock. (This gives the beans something to drink up, and you a margin of error if you grains continue to absorb the stock once you think they are done.)  Stir it in until the risotto is on the loose side, then add the beans and let them cook for a minute. Add the escarole and let it wilt and then cook for an additional minute. Stir in the 1/2 cup of Parmigiano-Reggiano and the butter and season with salt and pepper. Serve at once, passing more cheese at the table.",
    "Do ahead: Although it’s not generally ideal to reheat rice risottos, I actually enjoyed this barley one reheated. Keep the flame low, splash in some more broth if it seems thick and slowly warm the dish, stirring. Top with extra cheese. ",
    "Bean cooking wonder! Cooked my beans in the slow-cooker — they were perfect. No presoaking, just put them in covered with 2 to 3 inches of water for 3 hours on high. (You may need up to 4 hours with larger beans.) I let them cool in their cooking water, which was by then quite flavorful. They were dreamy. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/barley-risotto-with-beans-and-greens1.jpg?w=500",
  "ingredient_list": [
    "5 cups low-sodium vegetable or chicken stock",
    "2 tablespoons extra-virgin olive oil",
    "1 medium onion, cut into 1/4-inch dice",
    "1/4 teaspoon thyme",
    "1/2 cup white wine (optional)",
    "1 cup pearled barley (7 ounces)",
    "1 cup beans, canned or precooked (white would be great; I used some Red Nightfall Beans mostly because they were languishing in my cabinet)",
    "3 cups chopped escarole",
    "1/2 cup freshly grated Parmigiano-Reggiano cheese, plus more for serving",
    "2 tablespoons unsalted butter, softened",
    "Salt and freshly ground pepper"
  ],
  "tags": [
    "Beans",
    "Escarole",
    "Grain/Rice",
    "Photo",
    "Vegetarian"
  ],
  "title": "barley risotto with beans and greens",
  "url": "https://smittenkitchen.com/2010/01/barley-risotto-with-beans-and-greens/"
}