{
  "date": "2014-03-11T12:37:05+00:00",
  "directions": [
    "Heat 1 tablespoon butter in a medium saucepan over medium heat. Once melted, add onion and saute until translucent, about 5 minutes. Add rice to onion and cook for 1 minute, then add 1 1/3 cups water and a few pinches of salt. Bring mixture to a simmer, then reduce heat to lowest temperature and cook with the lid on for about 50 minutes (or whatever amount of time is suggested on your package of rice). If you’d like a rice cooker to do this for you, transfer onions, water and rice to the machine and set the machine.",
    "Heat oven to 400 degrees.",
    "Peel broccoli stems and dice them into large chunks. Cut florets into 1-inch pieces. Cook in boiling, well-salted water for 2 to 3 minutes, then drain.",
    "You can use this same pan to make the cheese sauce. Melt remaining 2 tablespoons butter in pan over medium heat. Once melted, add the mustard powder (if using), a pinch of cayenne and garlic and let sizzle for 1 minute. Add flour and whisk until combined, cooking the butter-flour mixture for 1 to 2 minutes. Slowly drizzle in milk, whisking constantly, then broth. Bring to a simmer and cook mixture at a simmer, stirring the whole time, until sauce is slightly thickened, about 5 minutes. Stir in smooth Dijon mustard if you didn’t use mustard powder.",
    "Remove pan from heat and stir in 1/3 of grated cheese until melted. Season generously with salt and pepper.",
    "Combine cooked wild rice blend and broccoli in a 2-quart baking dish or a 9-inch oven-safe skillet. Pour cheese sauce over and gently nudge to ensure all pieces get some sauce. Sprinkle remaining cheese over top. Bake casserole for 10 to 15 minutes, until the sauce is bubbly, then run mixture under the broiler until cheese is toasty on top. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/03/broccoli-cheddar-and-wild-rice-casserole.jpg?w=750",
  "ingredient_list": [
    "3 tablespoons butter",
    "1/2 large onion, diced",
    "Salt",
    "2/3 cup uncooked wild rice blend, rinsed",
    "1 pound broccoli",
    "1 garlic clove, minced or pressed",
    "1/4 teaspoon ground mustard powder or 1/2 teaspoon smooth Dijon",
    "Pinch of cayenne pepper",
    "2 tablespoons all-purpose flour",
    "1 cup whole milk",
    "2/3 cup low-sodium vegetable or chicken broth",
    "8 ounces cheddar cheese, coarsely grated",
    "Freshly ground black pepper"
  ],
  "tags": [
    "Broccoli",
    "Photo",
    "Side Dish",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "broccoli, cheddar and wild rice casserole",
  "url": "https://smittenkitchen.com/2014/03/broccoli-cheddar-and-wild-rice-casserole/"
}