{
  "date": "2016-08-16T12:10:11+00:00",
  "directions": [
    "Cook lentils: Pick over and rinse lentils. Place them in a medium saucepan and cover with 3 inches of cold water, seasoned well with salt. Simmer the lentils over medium heat for 25 to 30 minutes, until firm-tender. Drain and set aside.\nMeanwhile, make vinaigrette: Blend basil, mustard and vinegar together in a food processor. With machine running, drizzle in olive oil in a thin stream. Season well with salt and black pepper. You’ll need to scrape the machine down a few times to get all of the leaves minced. No food processor? Very finely mince leaves on a cutting board with a sharp knife. Place in medium bowl and whisk with mustard and vinegar. Drizzle in olive oil in a thin stream, whisking the whole time. Season well with salt and pepper.\nIn a large frying pan, heat 1 tablespoon olive oil over medium heat. Add zucchini, onion, thyme, salt and pepper and cooking, stirring frequently, until softened and just barely picking up color, about 9 minutes. Add garlic and cook 1 minute more. Add cooked lentils back to pan and stir to mix and re-warm; you can add a splash of water if they’re sticking. Adjust seasonings to taste.",
    "Assemble: Transfer lentil-vegetable mixture to a large, wide serving bowl and stir in 2/3 of vinaigrette. Place intact* burratas on top and then cut into quarters with a sharp knife so you don’t miss any of the wonderful stuff that spills out. The warmth of the lentils will melt it further. Drizzle with a little extra vinaigrette, a few pinches of sea salt and a couple extra grinds of black pepper. Scatter basil leaves over and dig in.\n(* Unless you’re me and tripped walking home from errands yesterday because you were carrying too much and smashed blueberries, cherries, heirloom tomatoes and burratas and now I am grumpy despite having a Muppet bandaid on each knee.)"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_5165.jpg?w=750",
  "ingredient_list": [
    "1 1/2 cups dried lentils de puy or other small green lentils",
    "1 tablespoon olive oil",
    "2 medium zucchinis (about 6 ounces each), diced",
    "1 small or 1/2 medium onion, diced",
    "Leaves from 3 fresh sprigs thyme",
    "2 small or 1 large garlic cloves, minced",
    "Salt and freshly ground black pepper",
    "1 1/4 cups fresh basil leaves",
    "2 teaspoons smooth Dijon mustard, plus more to taste",
    "1 tablespoon plus 2 teaspoons red or white wine vinegar",
    "6 tablespoons olive oil",
    "Salt and freshly ground black pepper",
    "2 large balls of burrata (or 4 smaller ones), at room temperature (see Note up top)",
    "Sea salt and more black pepper",
    "A few small basil leaves for garnish"
  ],
  "tags": [
    "Beans",
    "Italian",
    "Photo",
    "Summer",
    "Summer Squash",
    "Vegetarian",
    "Zucchini"
  ],
  "title": "burrata with lentils and basil vinaigrette",
  "url": "https://smittenkitchen.com/2016/08/burrata-with-lentils-and-basil-vinaigrette/"
}