{
  "date": "2008-11-17T22:52:59+00:00",
  "directions": [
    "Set aside top square of pastry on parchment. Spread cooled filling evenly over pastry on baking sheet, leaving a 1-inch border. Brush border with some of egg wash, and, using parchment, invert second square on top, lightly pressing to seal border. Brush top with remaining egg wash, then crimp border with a fork and trim with a pizza wheel or sharp knife.",
    "Cut a few small steam vents in top of pie and decoratively score pastry. Slide pie on parchment onto preheated baking sheet in oven and bake until puffed and deep golden brown, about 45 minutes.",
    "Do ahead: The filling can be made and pastry rolled out 1 day ahead and chilled. Or, you can assemble the pie up to three hours ahead of time and chill it uncovered until you’re ready to bake it."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-and-barley-pie1.jpg?w=500",
  "ingredient_list": [
    "3/4 cup pearl barley or farro",
    "3 cups water",
    "1 tablespoon unsalted butter",
    "1 tablespoon olive oil",
    "2 garlic cloves, minced",
    "9 scallions, finely chopped (1 1/3 cups), divided",
    "1 pound cremini mushrooms, sliced",
    "1/4 cup dry Madeira (preferably Verdelho or Sercial)",
    "1 cup whole-milk ricotta",
    "1 (1-pound) package frozen all-butter puff pastry, thawed (if you can get DuFour, it will be worth every extra penny–promise)",
    "1 egg yolk, beaten with 1 teaspoon water and a pinch of salt",
    "Make filling:",
    "If using farro, cover it with cold water in a bowl and soak 30 minutes, then drain in a colander, discarding soaking water. Bring farro, water (3 cups), and 1/4 teaspoon salt to a boil in a medium saucepan, then reduce heat and simmer, uncovered, until tender, 15 to 20 minutes. Drain.",
    "Roll out pastry while filling cools:",
    "If pastry is in 1 piece, cut into 2 equal pieces. Roll out each piece on a lightly floured surface into an 11-inch square. Stack squares on a parchment-paper-lined baking sheet with a second sheet of parchment between them, then cover with plastic wrap and chill at least 30 minutes.",
    "Assemble and bake pie: ",
    "Put a large baking sheet on rack in middle of oven and preheat oven to 400°F."
  ],
  "tags": [
    "Grain/Rice",
    "Mushrooms",
    "Photo",
    "Thanksgiving",
    "Vegetarian"
  ],
  "title": "mushroom and barley pie",
  "url": "https://smittenkitchen.com/2008/11/mushroom-and-barley-pie/"
}