{
  "date": "2009-03-16T15:57:07+00:00",
  "directions": [
    "Meanwhile, wash the rocket* (older, larger leaves are preferable to the tender sprouts), drain, and set aside. Slice the red onion thin. Peel and chop fine the garlic cloves and the rosemary leaves. Put a large pot of salter water on to boil for the pasta.",
    "When the potatoes are done, remove them from teh oven and put the pasta on to boil. Heat a saute pan, add some of olive oil, and saute the sliced onion until it is soft and translucent and starting to brown, about 5 minutes. Add the rocket and garlic, and saute both until they just begin to wilt and soften. Lower the heat, add the potato slices and rosemary and toss together for a minutre or two. When the noodles are done, drain them and add them to the potatoes and onion. Add a squeeze of lemon juice and toss everything together. Drizzle with a little olive oil and serve.",
    "* I’m kind of a nut about arugula-washing techniques, so here is my tried-and-true method: Get a very big bowl. Fill it with cold, cold water. Cut the attached part of the arugula bundle off (so they’re in individual sprigs) and drop the bundle in the water. Have a colander nearby. Swish, swish, swish the arugula around with your hand and then scoop it up and dump it in the colander, being careful not to pick up the sandy dirt you’ve just dropped to the bottom of the water. (That’s the genius, by the way, the dirt always drops off.) If the water is still foggy/beige, rinse the bowl out and repeat this process until it is clear, and the sand at the bottom is at a minimum. Shake out the lettuce in the colander and either spin it in a salad spinner or spread it out on a big dish towel until it is dry. I actually wash all lettuces this way, but arugula, being particularly dirt-crusted, is particularly made for this technique."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/penne-with-potatoes-and-rocket1.jpg?w=500",
  "ingredient_list": [],
  "tags": [
    "Arugula",
    "Pasta",
    "Photo",
    "Potatoes",
    "Vegetarian"
  ],
  "title": "penne with potatoes and rocket",
  "url": "https://smittenkitchen.com/2009/03/penne-with-potatoes-and-rocket/"
}