{
  "date": "2017-05-16T11:51:55+00:00",
  "directions": [
    "Assemble the potatoes: Heat your oven to 375°F. Combine the cheese, potato starch or cornstarch, salt, and pepper in a small dish. Taste a pinch; you want it to have a strong salty-peppery kick, because it’s going to be distributed all over the galette.\nPour 1 tablespoon butter or oil into the bottom of a 9-inch-diameter cast-iron or ovenproof skillet, and swirl it up the sides. Arrange the potatoes in overlapping concentric circles in a single layer at the bottom of the pan. (This will use approximately a quarter of your sliced potatoes.) Drizzle with 1 teaspoon butter or oil, and sprinkle with 2 tablespoons of the cheese-pepper mixture. You’ll need to repeat this three or four times to use up your potatoes (depending on their size). At the end, you should have about 1 tablespoon cheese-pepper mixture left over; reserve this. Drizzle any remaining melted butter over the top.\nTo bake: Lightly coat a piece of foil with nonstick spray and cover the skillet tightly with it. Put in heated oven for 35 minutes, at which point the potatoes will be almost tender. Use potholdered hands to press firmly on the foil to compact the potatoes a bit. Remove and reserve the foil and bake for 25 to 30 minutes more, until lightly brown all over. Press again with the foil, remove, then briefly run under the broiler for an even golden-brown finish.\nTo finish and serve: While the galette bakes, toss the arugula with the olive oil and vinegar, keeping the dressing very light.\nOnce the galette is out of the oven, let it rest in the skillet for a few minutes before running a knife around to ensure that it is loose. Gently tip the skillet over your sink to drain any excess butter or oil. Invert it onto a plate or cutting board, then flip right side up. Cut the galette into wedges, then top with the dressed greens, and sprinkle with the reserved cheese-pepper mixture.\nDo ahead: This galette can be made up to 3 days in advance. Rewarm at 350 degrees for 15 minutes with foil on top."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/cacio-e-pepe-potatoes-anna.jpg?w=750",
  "ingredient_list": [
    "1/2 cup (65 grams) finely grated aged Pecorino Romano",
    "1 tablespoon (10 grams) potato starch or cornstarch",
    "1/2 teaspoon fine sea or table salt, or to taste",
    "1/2 teaspoon finely ground black pepper, or a larger amount coarsely ground",
    "3 tablespoons (45 grams) unsalted butter, melted, or olive oil",
    "2 pounds (roughly 1 kg) Yukon Gold potatoes, peeled, cut into 1/8-inch-thick, ideally on a mandolin",
    "8 cups (5 2/3 ounces or 160 grams) loosely packed arugula",
    "1 tablespoon (15 ml) olive oil",
    "2 teaspoons (10 ml) white wine vinegar"
  ],
  "tags": [
    "Announcements",
    "Cookbooks",
    "Potatoes",
    "Put An Egg On It",
    "Recipes",
    "Vegetarian"
  ],
  "title": "potatoes anna + new cookbook preview",
  "url": "https://smittenkitchen.com/2017/05/potatoes-anna-new-cookbook-preview/"
}