{
  "date": "2015-10-13T12:02:37+00:00",
  "directions": [
    "Heat oven to 450 degrees F. Coat a large roasting pan with a glug or two of olive oil. Combine rub ingredients in a small dish. Taste a pinch; it should be flavorful, but more salty than sweet, with a kick. Make adjustments to taste.",
    "Prep broccoli by peeling any knobby bits and outer skin off stalks. Cut smaller heads lengthwise through stem into two “steaks;” cut larger ones a second time into four wedge-shaped “steaks,” if desired. Place cut side down in roasting pan; drizzle tops very lightly with olive oil and sprinkle with rub. Roast for 20 minutes, until deeply brown underneath. While roasting, combine cider vinegar dip ingredients. Flip, coat cut side with more rub and roast for another 10 to 15 minutes, until charred at edges. Remove from oven and immediately grate a small amount of cheese over broccoli.",
    "Serve with cider vinegar dip and, if you’d like to be more like the restaurant, with a little pile of smoked sea salt on the side. Eat with forks and steak knives. ",
    "P.S. Looking for a different flavor? Try these stunning broccoli steaks, also inspired by my Burnside obsession, with a red chile-sambal romesco."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/the-broccoli-roast1.jpg?w=750",
  "ingredient_list": [
    "Dry rub",
    "2 teaspoons packed dark brown sugar",
    "1 teaspoon paprika, ideally smoked but regular will also work",
    "1 tablespoon chili powder",
    "1 teaspoon onion powder",
    "Chipotle powder or ground red pepper (cayenne) to taste",
    "1 teaspoon coarse or kosher salt, and more to taste",
    "Cider vinegar dip",
    "1 tablespoon cider vinegar",
    "1/4 teaspoon smooth dijon mustard",
    "Pinch of salt, smoked flaky sea salt is wonderful here if you have it",
    "Pinch of pepper flakes",
    "Shake of smoked hot paprika or chipotle powder"
  ],
  "tags": [
    "Broccoli",
    "Budget",
    "Fall",
    "Photo",
    "Quick",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "the broccoli roast",
  "url": "https://smittenkitchen.com/2015/10/the-broccoli-roast/"
}