{
  "date": "2010-07-15T10:40:25+00:00",
  "directions": [
    "Preheat oven to 425°F (218°C).Toss peaches with blueberries, sugar, flour, lemon juice, cinnamon and salt in the bottom of a 2-quart ovenproof dish.",
    "Make the biscuit dough: Stir together the flour, cornmeal, brown sugar, baking powder and salt. Cut the butter into the dry mixture with your fingertips, a fork or a pastry blender. Stir in buttermilk with a rubber spatula until a wet, tacky dough comes together.",
    "Plop spoonfuls of the biscuit dough over the filling; don’t worry about covering entire surface. Bake until the cobbler’s syrup is bubbly and the biscuit tops are browned, about 20 to 25 minutes. Let cool slightly and scoop it into bowls. Top with whipped cream, vanilla ice cream, of if you’re having an accidental run-in with this cobbler before noon, plain yogurt.",
    "* Want to peel your peaches? Here’s how: Cut a small “x” in the bottom of each peach. Dip them in boiling water for 30 seconds, and the skins will slide right off."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cornmeal-drop-biscuit-peach-blueberry-cobbler1.jpg?w=500",
  "ingredient_list": [
    "For the fruit",
    "1 1/2 (about 4 cups) pounds peaches, pitted and cut into slices*",
    "1 pint (about 2 cups) blueberries, rinsed and dried",
    "2/3 cup packed dark-brown sugar",
    "2 tablespoons flour",
    "2 tablespoons fresh lemon juice",
    "1/4 teaspoon ground cinnamon",
    "1/4 teaspoon salt",
    "For the biscuit topping",
    "3/4 cup (3 1/4 ounces) all-purpose flour",
    "1/4 cup fine stone-ground cornmeal (yellow or white)",
    "3 tablespoons dark brown sugar",
    "1 1/2 teaspoons baking powder",
    "1/4 teaspoon salt",
    "3 tablespoons cold unsalted butter, cut into pieces",
    "1/2 cup buttermilk"
  ],
  "tags": [
    "Blueberries",
    "Peach",
    "Photo",
    "Summer"
  ],
  "title": "peach blueberry cobbler",
  "url": "https://smittenkitchen.com/2010/07/cornmeal-drop-biscuit-peach-blueberry-cobbler/"
}