{
  "date": "2013-10-25T11:20:46+00:00",
  "directions": [
    "Make pie crust: Whisk together flour, sugar and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in the water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough roughly in half (it’s okay if one is slightly larger). Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day. [Still freaked out about making your own pie dough? Read this for a ton of additional tips and details.]",
    "Heat oven  oven to 375 degrees F. Line bottom of 10x15x1-inch baking sheet or jellyroll pan with parchment paper.",
    "Prepare filling: In a large bowl, toss apples with lemon juice until coated. Top with remaining filling ingredients and stir to evenly coat. ",
    "Assemble pie: On a lightly floured surface, roll one of your dough halves (the larger one, if you have two different sizes) into an 18-by-13-inch rectangle. This can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible and using enough flour that it doesn’t stick to the counter. Transfer to your prepared baking sheet and gently drape some of the overhang in so that the dough fills out the inner edges and corners. Some pastry will still hang over the sides of the pan; trim this to 3/4-inch. ",
    "Pour apple mixture over and spread evenly. ",
    "Roll the second of your dough halves (the smaller one, if they were different sizes) into a 16-by-11-inch rectangle. Drape over filling and fold the bottom crust’s overhang over the edges sealing them together. Cut small slits to act as vents all over lid. Brush lid heavy cream or egg wash. Bake until crust is golden and filling is bubbling, 40 to 45 minutes. Transfer to a wire rack until just warm to the touch, about 45 minutes.",
    "In a medium bowl, stir together confectioners’ sugar and liquid of your choice until a pourable glaze consistency is reached. Use a spoon to drizzle over top. Serve slab pie in squares or rectangles, warm or at room temperature. ",
    "It keeps at room temperature for at least three days."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/apple-slab-pie1.jpg?w=640",
  "ingredient_list": [
    "Crust",
    "3 3/4 (470 grams) cups all-purpose flour",
    "1 1/2 tablespoons sugar",
    "1 1/2 teaspoons table salt",
    "3 sticks (340 grams) unsalted butter, very cold",
    "3/4 cup very cold water",
    "Filling",
    "3 1/2 to 4 pounds apples, peeled, cored and chopped into approximately 1/2-inch chunks (about 8 cups)",
    "Squeeze of lemon juice",
    "2/3 to 3/4 cup sugar (depending on how sweet you like your pies)",
    "3 tablespoons cornstarch",
    "1 teaspoon ground cinnamon",
    "1/4 teaspoon ground nutmeg",
    "1/4 teaspoon ground allspice",
    "1/8 teaspoon table salt",
    "To finish",
    "2 tablespoons heavy cream or one egg, beaten with 1 tablespoon of water",
    "Glaze (optional)  (only need half, barely, for what’s in photos)",
    "1/2 cup confectioners’ sugar",
    "1 tablespoon milk, water, lemon juice or fresh apple cider, plus a drop or two more if needed"
  ],
  "tags": [
    "Apple",
    "Fall",
    "Photo",
    "Tarts/Pies",
    "Thanksgiving"
  ],
  "title": "apple slab pie",
  "url": "https://smittenkitchen.com/2013/10/apple-slab-pie/"
}