{
  "date": "2012-03-07T12:28:19+00:00",
  "directions": [
    "Preheat oven to 350 degrees. Arrange eight 6-ounce ramekins (these are my favorite) on a baking tray. Peel, halve and core apples, then chop them into a small (about 1/2-inch) dice. The smaller the pieces, the faster the crisps will bake and the less they’ll “deflate” as they cool. Toss apples with 1 tablespoon cornstarch and 3 tablespoons raw sugar until evenly coated, then divide apples between ramekins.",
    "Grind 1/4 cup oats with almonds in a food processor until powdery. (If you have both almond meal and oat flour, you can replace this with 1/4 cup of each.) In a medium bowl, mix oat/almond mixture with remaining rolled oats, wheat flour, remaining 1/4 cup raw sugar, brown sugar, cinnamon, sea salt and baking powder. Melt butter in a small saucepan (or in microwave), then stir in olive oil. Pour mixture over dry ingredients and stir until crumbly. Divide crumbs over each dish of apples, packing them on with your palms if needed to get them all on (don’t worry, the apples will deflate a bit when they bake). ",
    "Bake apple crisps for about 30 to 40 minutes, or until you can see the juices from the apples bubbling around the crumbs. If tops brown too quickly, put a sheet of foil over the whole tray for remaining baking time. Let cool on rack and serve when lukewarm. Store remaining crisps in fridge. They are quite excellent with a dollop of plain yogurt."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/multigrain-apple-crisps1.jpg?w=500",
  "ingredient_list": [
    "4 large or 5 small-medium apples (about 2 pounds)",
    "1 tablespoon cornstarch",
    "3 tablespoons plus 1/4 cup raw or Turbinado (often sold as Sugar in the Raw) sugar",
    "1/4 cup plus 3/4 cup rolled oats",
    "1/4 cup sliced or slivered almonds",
    "1/2 cup whole wheat flour (or a mix; see Note up top)",
    "1/4 cup light or dark brown sugar",
    "1/4 teaspoon ground cinnamon",
    "Two pinches sea salt",
    "1/2 teaspoon baking powder",
    "2 tablespoons unsalted butter",
    "1/4 cup olive oil"
  ],
  "tags": [
    "Apple",
    "Coconut",
    "Crumbles/Crisps",
    "Fruit",
    "Photo"
  ],
  "title": "multigrain apple crisps",
  "url": "https://smittenkitchen.com/2012/03/multigrain-apple-crisps/"
}