{
  "date": "2010-04-04T12:16:36+00:00",
  "directions": [
    "Place the egg yolk in a stainless steel bowl. Begin whisking in the grapeseed oli drop by drop, as slowly as you can bear. (I find having a second person dripping it in makes it easier.) Continue in this manner until the mixture begins to thicken.Once the mayo has emulsified, you can add the rest of the oil in a slow, steady stream (however, as a beginner, I still take it very slowly), whisking all the time. Arm getting tired? Try to murmur “jiggle-free upper arms… sleeveless sundresses…” to yourself. I find it helps.",
    "Combine the shallot, 1 tablespoon lemon juice and 1/2 teaspoon salt in a small bowl and let it sit for 5 minutes. Whisk in the crème fraîche and buttermilk. Gently whisk this mixture into the mayonnaise, and taste for balance and seasoning.",
    "Slice the apples and pears away from the core. Cut into 1/8-inch thick slices (I went even thinner, using a mandoline) and place them in a large salad bowl. Tear the radicchio into bite-sized pieces and add to the salad bowl. Toss salad with half of dressing (Goin suggests three-fourths but I found this to make an overly-creamy salad; you can always add more) and season with salt and pepper. Add a squeeze of lemon juice and a little more dressing if necessary.",
    "Transfer to a platter (chilled, if you’re being fancy) and scatter the mint and parsley on top."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/radicchio-apple-and-pear-salad1.jpg?w=500",
  "ingredient_list": [
    "1 extra-large egg yolk (I used one large and a smidgen of another)",
    "1/2 cup plus 2 tablespoons grapeseed oil (suggested for its neutrality; I used half olive oil but suggest you do so sparingly as the olive flavor becomes very pronounced)",
    "2 tablespoons finely diced shallot",
    "1 to 2 lemons, for juicing",
    "1/4 cup crème fraîche (did you know you can make your own?)",
    "1/4 cup buttermilk (did you know you can make your own?)",
    "2 apples, firm, crisp and juicy",
    "2 pears, Asian or your favorite variety",
    "2 heads radicchio",
    "2 tablespoons sliced mint",
    "1 tablespoon chopped flat-leaf parsley",
    "Kosher salt and freshly ground black pepper"
  ],
  "tags": [
    "Apple",
    "Pear",
    "Photo",
    "Radicchio",
    "Salad"
  ],
  "title": "radicchio, apple and pear salad",
  "url": "https://smittenkitchen.com/2010/04/radicchio-apple-and-pear-salad/"
}