{
  "date": "2012-09-18T11:39:51+00:00",
  "directions": [
    "Roast apples: Heat oven to 375°F. Line a baking sheet or roasting pan with parchment paper. Arrange apple halves face down on paper and roast in a single layer until they feel dry to the touch and look a little browned underneath, about 20 minutes. Slide parchment paper with apples onto a cooling rack and set aside. Reduce oven temperature to 350°F.",
    "Make cake layers: Butter two 9×13-inch cake pans and line the bottoms with a fitted rectangle of parchment paper. Butter the paper as well. Feel free to use a nonstick baking spray instead of butter, too. [If you, like most people, only have one cake pan, don’t fret. Just bake half the batter and as soon as you can flip the cake out of the pan, wash it and start again with a fresh piece of parchment, baking the remaining batter.]",
    "In a large bowl, whisk together flour, salt, baking soda, baking powder, cinnamon, ginger, cloves and nutmeg. In a medium bowl, whisk together applesauce and honey. ",
    "In a large bowl with an electric mixer, beat the butter and dark brown sugar until very fluffy. Add the eggs, one at a time, scraping down the bowl between every other addition. Add one third of the flour-spice mixture and mix it until just combined. Add half the applesauce-honey mixture, again mixing it until combined. [At this point, if you, like me, have a 5-quart KitchenAid, things are going to get a little full in the bowl. I suggest stirring in the remaining additions carefully by hand.] Add the second third of the flour-spice mixture, the remaining applesauce-honey mixture, and the remaining flour-spice mixture, stirring between each addition. ",
    "Chop roasted apples into smallish chunks (1/2 to 2/3-inches) and fold into batter. Divide batter between baking pans and bake cake layers, rotating the cake pans top to bottom and back-to-front halfway through the baking time, about 35 to 40 minutes, until a tester inserted into the center comes out clean. Transfer baking pans to cooling racks and let rest for 10 minutes, before flipping out of the pans onto racks, removing the parchment paper lining, and cooling the cakes right-side-up.",
    "[Do ahead: I pause my cake-making all of the time here. I freeze the cake layers overnight, or until needed (up to two weeks, longer if your freezer doesn’t make things smell freezer-y for a while), wrapped in a double-layer of plastic wrap. When you’re ready to decorate them, you can do so while the cake is still frozen — it will be easier to handle/move/trim. Simply leave it at room temperature for a few hours once it is decorated or in the fridge for a day to fully defrost. More layer cake tips live here.]",
    "Make the frosting: Whip butter and cream cheese together with an electric mixture until light and fluffy. Beat in vanilla extract. Add powdered sugar and beat again until smooth and light. ",
    "Decorate your cake: Arrange first cake layer on cake board or serving platter, tucking pieces of waxed paper underneath the outer edges to keep your platter clean while you decorate (which I forgot to do, typically). Use a serrated knife to level the top, removing any dome so that the next layer will rest neatly on top. Thickly spread about 1/3 of frosting on the bottom layer, then transfer the cake to the freezer for just 5 or 10 minutes, to firm up the filling. Place the second cake layer on top of the filling. Trim the top again until level (if desired; seeing as you’re not adding another layer, it would be for a neat appearance, not for cake stability). If the sides don’t align perfectly with the bottom layer, you can trim them until straight as well. Thinly apply a coat of frosting over entire exterior of cake. Once again, you can get this to “set” quickly by sliding the cake into the freezer for 5 minutes. One set, add your final coat of frosting, a thicker more decorative one. (This is of course where you can add any decorations desired. You should have plenty of leftover frosting to go to town with.)",
    "Remove bits of waxed paper and serve with a big “ta-da!” Should any survive the party, this cake keeps exceptionally well in the fridge. Five days out, our leftover pieces are, if possible, more moist than one day one."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/09/roasted-apple-spice-sheet-cake.jpg?w=750",
  "ingredient_list": [
    "Cake",
    "6 medium apples, any variety you like to bake with, peeled, halved and cored",
    "7 1/2 cups (940 grams) all-purpose flour",
    "1 1/2 teaspoons (10 grams) table salt",
    "1 1/2 teaspoons (8 grams) baking soda",
    "2 tablespoons (30 grams) baking powder",
    "1 tablespoon ground cinnamon",
    "1 1/2 teaspoons (3 grams) ground ginger",
    "1/2 teaspoon (1 gram) ground cloves",
    "1/2 teaspoon (1 gram) freshly grated nutmeg",
    "1 1/2 cups (505 grams) honey",
    "4 1/2 cups (585 grams updated: 1170 grams) applesauce",
    "1 1/2 cups (3 sticks) unsalted butter, at room temperature",
    "1 1/2 cups packed (285 grams) dark-brown sugar",
    "6 large eggs",
    "Frosting",
    "3 8-ounce (675 grams total) blocks cream cheese, at room temperature",
    "1 1/2 cups (3 sticks, 3/4 pound or 340 grams) butter, at room temperature",
    "1 tablespoon (15 ml) vanilla extract",
    "6 cups (720 grams) powdered sugar, sifted"
  ],
  "tags": [
    "Apple",
    "Celebration Cakes",
    "Fall",
    "Photo"
  ],
  "title": "roasted apple spice sheet cake",
  "url": "https://smittenkitchen.com/2012/09/roasted-apple-spice-sheet-cake/"
}