{
  "date": "2017-04-17T12:05:11+00:00",
  "directions": [
    "\nCombine maple syrup, sugar, water, vanilla and salt in a small saucepan and bring to a boil, stirring to dissolve the sugar and salt. Remove from heat and let cool to lukewarm.\nMeanwhile combine cinnamon (if using), oats, almonds, coconut, seeds, almond or hazelnut flour in a large bowl.\nHeat oven to 325 degrees. Line a rimmed half-sheet (13×18-inch) pan with parchment paper or a silicone mat.\nOnce liquid mixture is back to room temperature, whisk in olive oil, which will cool it further, then egg white. Pour over dry ingredients and mix well.",
    "Spread mixture evenly across the prepared baking sheet. Press down firmly to compact it before baking, using another same-size baking sheet or the bottom of a pot. Bake for 40 to 50 minutes, until dark golden brown, rotating the sheet every 15 minutes to promote even browning. While it bakes, open the oven door a few times to release steam.\nSet on a cooling rack until surface of granola is crisp. Leave oven on. If surface is still tacky to the touch once it has cooled — although I didn’t find this at all — return the pan to the oven and continue baking for another 10 to 15 minutes, checking every 5 minutes. Don’t let it get too dark or it tastes bitter.\nOnce totally cool, break into pieces in store in an airtight container at room temperature for up to 2 weeks, or in the fridge up to 1 month.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/04/granola-bark1.jpg?w=750",
  "ingredient_list": [
    "1/2 cup (120 ml) maple syrup, honey or half of each",
    "1/2 cup (75 grams) coconut or brown sugar",
    "1/4 cup (60 ml) water",
    "1 teaspoon vanilla extract",
    "1/4 teaspoon fine sea salt",
    "1 1/2 teaspoons ground cinnamon (but I skipped this)",
    "3 cups (300 grams) rolled oats (not quick-cooking)",
    "1 1/4 cups (175 grams) almonds, chopped",
    "1 1/4 cups (60 grams) unsweetened shredded coconut",
    "1/2 cup (80 grams) flax seeds or chia seeds, whole or ground",
    "1/4 cup (35 grams) sesame seeds",
    "1/2 cup (60 grams) almond or hazelnut flour",
    "1/3 cup (80 ml) olive, vegetable or coconut oil, or melted butter",
    "1 large egg white, whisked until frothy"
  ],
  "tags": [
    "Breakfast",
    "Coconut",
    "Dairy-Free",
    "Gluten-Free",
    "Photo"
  ],
  "title": "granola bark",
  "url": "https://smittenkitchen.com/2017/04/granola-bark/"
}