[
    {
        "ingredient_list": [
            "2 pounds (32 ounces) ounces fresh baby spinach or regular spinach leaves", 
            "1 small yellow onion, finely chopped", 
            "3 small garlic cloves, minced", 
            "4 tablespoons unsalted butter", 
            "1 pound mushrooms, thinly sliced (I use creminis)", 
            "1 cup heavy cream", 
            "3/4 teaspoon table salt", 
            "Freshly ground black pepper", 
            "1/4 teaspoon freshly grated nutmeg (optional; I skip this)", 
            "12 large eggs", 
            "6 tablespoons finely grated Parmesan cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/baked-eggs-with-spinach-and-mushrooms.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Mushrooms", 
            "Spinach", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/04/baked-eggs-with-spinach-and-mushrooms/", 
        "title": "baked eggs with spinach and mushrooms", 
        "directions": [
            "If you’ve just washed your spinach, no need to dry it before wilting it in the pan. If it’s already dry, bring 1/2 inch water to a boil in a very large ovenproof heavy skillet, then add half of spinach and cook, turning with tongs, until wilted, about 30 seconds. Add remaining spinach and wilt in same manner, then cook, covered, over moderately high heat until spinach is tender, about 1 to 2 minutes. Drain in a colander and cool under cold running water. Gently squeeze handfuls of spinach to remove as much liquid as possible, then coarsely chop. You will have about 2 cups fairly tightly packed cooked spinach.", 
            "Wipe skillet dry, then melt butter over medium-low heat. Cook onion and garlic until softened, 2 to 3 minutes. Add mushrooms and increase heat to medium-high, then cook, stirring, until mushrooms have softened, exuded liquid and that liquid has cooked off, about 5 minutes. Stir in cream, salt, pepper, nutmeg (if using), and chopped spinach and bring back a simmer. Remove skillet from heat.", 
            "If baking eggs in this skillet, make 12 large indentations in mixture, each large enough to fit an egg. Otherwise, you can transfer this mixture to a 9×13-inch baking dish and do the same there. I like to use 2 teaspoons to make the wells; I press the backs of them together to “pinch” up the spinach mixture to form taller walls so that the eggs will not merge together. ", 
            "Do ahead: You can then set this aside for a few hours or up to one day in the fridge, covered.", 
            "When you’re ready to bake the dish, or about 30 minutes before serving, put oven rack in upper third of oven and heat oven to 450°F. Crack an egg into each well. Bake until whites are firm and yolks are still runny. You can check this by inserting a toothpick into various parts of the eggs and seeing whether they’re runny or set, which takes anywhere from 15 to 30 minutes. The range is long due to different ovens and baking vessels. It’s better to have to check more often than to let them overcook.", 
            "[Cooking note: It is nearly impossible to get all 12 eggs to cook evenly. The ones in the center will be more runny; at the edges, they’ll be more firm. But don’t fret. I’ve found that almost all people have an egg preference (more runny vs. more firm) and each egg manages to find the right home. Just ask people their preference as you serve them.]", 
            "Remove dish from oven, sprinkle with additional salt and pepper, plus grated Parmesan. Serve immediately."
        ], 
        "date": "2014-04-16T12:31:29+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large (mine was just over 1 1/4 pounds/570 grams) eggplant, cut into 3/4-inch dice", 
            "Salt and black pepper", 
            "1/4 cup (60 ml) olive oil", 
            "1 medium carrot, peeled and cut into 1/4-inch dice", 
            "1 celery stalk, in a 1/4-inch dice", 
            "1 medium onion, finely diced", 
            "3 garlic cloves, minced", 
            "8 ounces (225 grams) orzo, a rice-shaped pasta, rinsed", 
            "1 teaspoon (6 grams) tomato paste", 
            "1 1/2 cups (355 ml) vegetable stock", 
            "1 to 3 tablespoons fresh oregano, chopped", 
            "1 teaspoon grated lemon zest or more to taste, up to the zest of a whole lemon", 
            "4 ounces (115 grams) mozzarella, firmer is better here, cut into 1/3-inch dice", 
            "1 1/2 ounces (a generous 1/2 cup or 45 grams) parmesan, grated", 
            "3 medium tomatoes, diced "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/09/baked-orzo-with-eggplant-and-mozz.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Eggplant", 
            "Pasta", 
            "Photo", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/09/baked-orzo-with-eggplant-and-mozzarella/", 
        "title": "baked orzo with eggplant and mozzarella", 
        "directions": [
            "Sprinkle your eggplant generously with salt and let it drain in a colander for 30 minutes. I used this time to get the rest of my ingredients ready. After 30 minutes, rinse it well and pat it dry on towels. ", 
            "Preheat your oven to 350°F. Heat a large frying pan over medium-high heat. Once hot, add the oil and once the oil is shimmering, add the eggplant. Fry for 8 minutes, stirring pieces occasionally. Using a slotted spoon or spatula, transfer them to paper towels to drain. Add celery and carrots to remaining oil and cook for 3 minutes before adding onion and garlic. Cook together for 5 more minutes on medium heat. Stir in the orzo and tomato paste and cook for two minutes more. Off the heat, add the oregano, mozzarella, parmesan, tomatoes, fried eggplant, lemon zest, 1 teaspoon table salt, many grinds of black pepper and the stock and mix well. ", 
            "Transfer mixture to an 8×11-inch (about 2 quarts) ovenproof baking dish. Cover with foil and bake 20 minutes, then bake 20 minutes without the foil. (You can increase the ration of foil-on to foil-off time if you don’t like a crunchy pasta lid.) Let rest for 5 minutes before serving. "
        ], 
        "date": "2012-09-06T15:02:05+00:00"
    }, 
    {
        "ingredient_list": [
            "Pasta and assembly", 
            "1 pound chunky pasta of your choice (I love bell shapes; see above for details)", 
            "1 bundle broccoli rabe (see above for options), stems and leaves cut into 1-inch segments", 
            "1 pound Italian sausage (sweet or spicy pork or chicken), casings removed", 
            "2/3 cup grated parmesan or pecorino romano cheese", 
            "6 ounces mozzarella, cut into small cubes", 
            "Bechamel", 
            "2 cups milk, full fat is ideal", 
            "4 tablespoons unsalted butter", 
            "1/4 cup all-purpose flour", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "2 cloves garlic, minced", 
            "Few gratings fresh nutmeg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/09/baked-pasta-with-broccoli-rabe-and-sausage.jpg?w=750", 
        "tags": [
            "Broccoli Rabe", 
            "Casserole", 
            "Fall", 
            "Freezer Friendly", 
            "Meat", 
            "Pasta", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/09/baked-pasta-with-broccoli-rabe-and-sausage/", 
        "title": "baked pasta with broccoli rabe and sausage", 
        "directions": [
            "Cook the pasta and rabe: Bring a large pot of well-salted water to a boil. Add pasta and five minutes before its cooking time is up, add the broccoli rabe. It will seem like too much for the water, but with a stir or two, the rabe should wilt and cook alongside the pasta. Drain the broccoli rabe and pasta together and place in a large bowl.", 
            "Cook your sausage: Meanwhile, heat 1 to 2 tablespoons olive oil in a large, wide saucepan (you will use this for the bechamel in a few minutes; you could also use your pasta pot, once it is drained) over medium heat. When hot, add the sausage, breaking it up with a wooden spoon until it starts to brown, about five minutes. Remove with slotted spoon or spatula, leaving any fat behind. Eyeball the drippings (pork sausage will leave some; chicken usually does not) — use one tablespoon less butter next if it looks like there’s a tablespoon there. Any less, don’t worry about adjusting the butter.", 
            "Heat oven to 400 degrees.", 
            "Make the bechamel: Melt your butter in same saucepan over medium heat. Once melted, add your flour and stir it into the butter until smooth. Cook the mixture together for a minute, stirring constantly. Pour in a small drizzle of your milk, whisking constantly into the butter-flour mixture until smooth. Continue to drizzle a very small amount at a time, whisking constantly. Once you’ve added a little over half of your milk, you’ll find that you have more of a thick sauce or batter, and you can start adding the milk in larger splashes, being sure to keep mixing. Once all of the milk is added, add the salt, garlic, nutmeg, and few grinds of black pepper, and bring the mixture to a lower simmer and cook it, stirring frequently, for 10 minutes. Taste and adjust seasonings if needed.", 
            "Assemble and bake: Add the sausage and bechamel to the bowl with the pasta and broccoli rabe. Stir in mozzarella and half of grated parmesan or pecorino until combined. Pour into a lasagna pan, deep 9×13-inch baking dish* or 3-quart casserole dish and coat with remaining parmesan or pecorino. Bake for 20 to 30 minutes, until the edges and craggy points are nicely bronzed.", 
            "Eat warm. Reheat as needed.", 
            "* I love this so much, I’ve bought two, and it’s usually crazy inexpensive."
        ], 
        "date": "2013-09-11T11:36:34+00:00"
    }, 
    {
        "ingredient_list": [
            "For the meatballs:", 
            "1/4 cup milk", 
            "1 slice good white bread trimmed of its crust", 
            "1 pound ground pork (or beef, or lamb, or a mix of the three)", 
            "1 teaspoon chopped garlic", 
            "2 tablespoons chopped parsley", 
            "1/3 cup freshly grated parmigiano-reggiano (Parmesan)", 
            "1 egg", 
            "Salt", 
            "Black pepper in a grinder", 
            "1 cup flour, spread on a plate", 
            "Vegetable oil for frying", 
            "For the bèchamel:", 
            "4 1/2 cups milk", 
            "6 tablespoons butter", 
            "5 tablespoons flour", 
            "1/8 teaspoon grated nutmeg", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "To finish:", 
            "1 pound rigatoni", 
            "3/4 cup freshly grated parmigiano-reggiano", 
            "1 tablespoon butter", 
            "1/4 cup milk"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/baked-rigatoni-with-tiny-meatballs1.jpg?w=500", 
        "tags": [
            "Casserole", 
            "Freezer Friendly", 
            "Italian", 
            "Meat", 
            "Pasta", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/02/baked-rigatoni-with-tiny-meatballs/", 
        "title": "baked rigatoni with tiny meatballs", 
        "directions": [
            "Make the meatballs: Heat the milk, but don’t let it simmer. Tear pieces of the white bread into it and let it soak for 5 minutes, before picking it up with your hand, squeezing it of excess milk and putting it in a large mixing bowl.", 
            "Add the pork, garlic, parsley, grated cheese, egg, salt, and pepper. Combine all the ingredients with a fork until they are evenly mixed (or “amalgamated”, as Hazan so charmingly says).", 
            "Pinch off a small lump of meat, about the size of a raspberry and roll the lump into a ball in the palm of your hands. (Hazan says if you are good with your hands, you can try making 3 balls at a time. It turns out, I am not.) When all the meatballs have been shaped (a process that took less time than I had expected, just the same), roll them in the flour, 15 to 20 at a time. Place the floured meatballs in a strainer and shake it smartly to dispose of excess flour.", 
            "Put enough vegetable oil in a skillet to rise 1/4-inch up the sides of the pan and turn on the heat to medium high. When the oil is hot, put as many meatballs in the skillet as will fit without overcrowding. Brown them until they form a nice crust all around. When one batch is done, transfer it with a slotted spoon to a platter covered with paper towels to drain and do the next batch until all are done.", 
            "Make the bèchamel:  Heat the milk over low heat in a saucepan until it forms a ring of pearly bubbles, but do not let it break into a boil. In a larger saucepan, melt the butter over low heat, add the flour and stirring constantly with a wooden spoon or flat whisk until combined. Add 2 tablespoons of milk at a time to the flour and butter mixture, stirring steadily and thoroughly, then repeat through 8 additions. At this point, you can add the milk in 1/2 cup increments, stirring constantly to keep it smooth. Add the salt, pepper and nutmeg and stir the sauce until it thickens.", 
            "Assemble the dish: Cook the rigatoni in a pot of well salted water. Drain when still al dente, and combine immediately in bowl with two-thirds of the bèchamel, half the grated cheese, and all the meatballs.", 
            "Preheat the oven to 400°F. Heavily butter a 9×13 baking dish. (Original recipe calls for a 12-inch springform, which I am sure would be lovely but is not the commonest U.S. cake pan.) Spread the rigatoni and meatball mixture in the pan, leveling it off with a spatula. Pour the milk over the dish, the spread the rest of bèchamel on top, and sprinkle with the remaining grated cheese.", 
            "Place in the uppermost level of the preheated oven. Bake for 15 to 20 minutes until a golden brown crust forms on top."
        ], 
        "date": "2010-02-27T13:14:54+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large onions, chopped (about 3 cups)", 
            "1/4 cup vegetable oil", 
            "1 tablespoon minced garlic", 
            "2 carrots, sliced thin (suggested by Gourmet) or in a small dice, as I’d chop them next time", 
            "3 pounds boneless beef chuck, ground coarse or 3 pounds ground beef", 
            "1/4 cup chili powder", 
            "1 tablespoon ground cumin", 
            "2 tablespoons paprika", 
            "1 tablespoon crumbled dry oregano", 
            "Dried red pepper flakes, to taste (Gourmet suggests 1 tablespoon; I used 1 teaspoon knowing that my flakes are very hot)", 
            "2 8-ounce cans tomato sauce or 2 cups fresh tomato sauce or tomato puree", 
            "1 1/4 cups beef broth", 
            "3 tablespoons cider vinegar", 
            "1 3/4 cups or 1 19-ounce can kidney beans, rinsed and drained", 
            "2 green bell peppers, chopped", 
            "Sour Cream and Cheddar Biscuits, below", 
            "Sour cream and pickled jalapeños (optional, to finish)", 
            "1 1/2 cups all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/2 teaspoon salt", 
            "2 tablespoons cold unsalted butter, cut into bits", 
            "1/4 pound sharp Cheddar cheese, coarsely grated (about 1 1/2 cups)", 
            "Drained and chopped pickled jalapeños, to taste (I used about 2 tablespoons)", 
            "1 cup sour cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/beef-chili-sour-cream-and-cheddar-biscuits1.jpg?w=500", 
        "tags": [
            "Beef", 
            "Freezer Friendly", 
            "Photo", 
            "Scones/Biscuits", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2010/09/beef-chili-sour-cream-and-cheddar-biscuits/", 
        "title": "beef chili + sour cream and cheddar biscuits", 
        "directions": [
            "Preheat oven to 425°F. Whisk together the flour, baking powder, baking soda and salt in a large bowl. Either cut the butter pieces into the flour mixture with a pastry blender or rub them in with your fingertips until well-combined. Stir in the cheddar, jalapeños and sour cream until the mixture forms a sticky dough. Pat it out to a 1/2-inch thickness on a very well-floured counter and use a 3 1/2-inch biscuit cutter to cut six rounds. Bake on an ungreased (or parchment-lined, if your baking sheets are as “weathered” as mine are) for 15 to 17 minutes, until golden on top.", 
            "Do ahead: If you’d like to serve them over a couple days, I recommend freezing already formed but unbaked biscuits until you are ready to bake them — you can bake them directly from the freezer, adding just a minute or two to the baking time."
        ], 
        "date": "2010-09-27T14:35:19+00:00"
    }, 
    {
        "ingredient_list": [
            "2 hard-boiled large eggs, chopped into bits", 
            "1/2 medium onion, finely chopped", 
            "1 tablespoon olive oil", 
            "1 garlic clove, finely chopped", 
            "1 teaspoon ground cumin", 
            "3/4 teaspoon dried oregano", 
            "3/4 pound ground beef chuck", 
            "2 tablespoons raisins (optional)", 
            "1 1/2 tablespoons chopped pimiento-stuffed olives", 
            "1 (14-ounce) can whole tomatoes in juice, drained, reserving 2 tablespoons juice, and chopped", 
            "1 package frozen empanada pastry disks, thawed (or homemade, recipe follows)", 
            "4 1/2 cups unbleached all-purpose flour (I used 1 1/2 cups whole wheat flour + 3 cups all-purpose)", 
            "3 teaspoons salt", 
            "2 sticks (1 cup or 8 ounces) cold unsalted butter, cut into 1/2-inch cubes", 
            "2 large eggs", 
            "2/3 cup ice water", 
            "2 tablespoons distilled white vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/beef-empanadas1.jpg?w=500", 
        "tags": [
            "Beef", 
            "Freezer Friendly", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/03/beef-empanadas/", 
        "title": "beef empanadas", 
        "directions": [
            "Sift flour with salt into a large bowl and blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal with some (roughly pea-size) butter lumps. Beat together egg, water, and vinegar in a small bowl with a fork. Add to flour mixture, stirring with fork until just incorporated. (Mixture will look shaggy.) Turn out mixture onto a lightly floured surface and gather together, then knead gently with heel of your hand once or twice, just enough to bring dough together. Form dough into two flat rectangles and chill them, each wrapped in plastic wrap, at least 1 hour. Dough can be chilled up to 6 hours total."
        ], 
        "date": "2009-03-23T16:45:52+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/cabbage-and-sausage-casserole1.jpg?w=640", 
        "tags": [
            "Cabbage", 
            "Casserole", 
            "French", 
            "Meat", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/01/cabbage-and-sausage-casserole/", 
        "title": "cabbage and sausage casserole", 
        "directions": [
            "Heat oven to 300 degrees. Bring a large pot of salted water to a boil and butter a 9-by-13-by-2-inch baking dish. If using sausages, remove casings and discard them.", 
            "Place cabbage in boiling water, cover, and let water come back to the boil. Uncover and boil for 3 minutes. Drain cabbage in a colander and run cold water over it to stop cooking. Drain well. ", 
            "Put about 1/3 of the cabbage in buttered dish and cover with 1/2 the meat. Sprinkle with salt and pepper and dot with butter. Repeat, ending with a final layer of cabbage, and dot top with butter.", 
            "Cover dish tightly with a layer of parchment paper (commenters who skipped the parchment said that their vegetables discolored against the foil), then top with a lid or a layer of aluminum foil. Cook for about 2 1/2 hours, until cabbage is soft and sweet, and top is lightly browned. After 2 hours, uncover the dish; if there is a lot of liquid in the bottom, leave uncovered for the rest of the cooking time. If not, re-cover and finish cooking. In our case, there was not a lot of liquid but I hoped to get a little color on the top so left it uncovered for the remaining time."
        ], 
        "date": "2016-01-19T12:03:35+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/3 cups (290 grams) all-purpose flour", 
            "3/4 teaspoon (5 grams) table or fine sea salt", 
            "2 teaspoons (10 grams) baking powder (I prefer aluminum-free)", 
            "1 1/4 teaspoon ground cinnamon", 
            "1/4 teaspoon ground or a bunch of gratings of whole nutmeg", 
            "1/8 teaspoon ground cloves", 
            "1/2 cup (120 ml) olive oil", 
            "3/4 cup (145 grams) dark brown sugar", 
            "2 large eggs", 
            "1 cup cider (235 ml, see buying suggestions below)", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 1/2 cups packed coarsely grated carrots from about 9 ounces (2 to 2 1/2 meaty/large or 4 to 5 slim; about 255 grams) whole carrots", 
            "Olive oil or nonstick cooking spray for baking pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/carrot-cake-with-cider-and-olive-oil1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Carrots", 
            "Dairy-Free", 
            "Everyday Cakes", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/10/carrot-cake-with-cider-and-olive-oil/", 
        "title": "carrot cake with cider and olive oil", 
        "directions": [
            "Heat oven to 350 degrees. Coat a 9×5-inch loaf pan* with olive oil or a nonstick cooking spray. If yours is old and you’re nervous about the cake sticking, it cannot hurt to line yours with a fitted rectangle of parchment paper.", 
            "In a large bowl, whisk together flour, salt, baking powder, cinnamon, nutmeg and cloves. In a medium bowl, whisk together olive oil, brown sugar, eggs, cider and vanilla. Stir grated carrots into wet ingredients until evenly coated, then stir wet ingredients into dry just until no floury bits remain. ", 
            "Pour into prepared pan and bake for 60 to 70 minutes, until a skewer inserted into the center comes out batter-free. Let cool in loaf pan for 20 to 30 minutes, then remove from pan and cool the rest of the way on a rack. Loaf should keep at room temperature for a few days, and longer in the fridge. It’s even more moist on the second day.", 
            "Whatever you do, definitely avoid making a cream cheese frosting-like spread whipped together from 4 ounces of softened cream cheese, 2 tablespoons softened unsalted butter, 1/2 teaspoon vanilla extra and 6 tablespoons powdered sugar, some of which can be replaced with honey or maple syrup but will make for a softer spread. It will unquestionably compromise this cake’s dairy-free status. It might be dangerously good.", 
            "Notes: "
        ], 
        "date": "2014-10-16T11:58:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/4 cups (100 grams) rolled oats (be sure that they’re labeled gluten-free if needed; I prefer old-fashioned but any will work)", 
            "1/4 cup (20 grams) rolled oats, finely ground, or 1/4 cup oat flour", 
            "3/4 cup (60 grams) dried unsweetened shredded coconut (I used a medium grind)", 
            "1/3 cup (65 grams) uncooked millet (see alternatives up top)", 
            "1/2 teaspoon fine sea salt", 
            "1/4 teaspoon ground cinnamon (optional)", 
            "1 cup (about 140 grams) chopped dried fruit", 
            "1 cup (170 grams) chopped dark chocolate or chocolate chips", 
            "1/4 cup (65 grams) sunflower seed butter", 
            "1/4 cup olive oil or coconut oil, warmed until liquefied", 
            "1/4 cup (about 85 grams) maple syrup, honey or golden syrup"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/chocolate-chunk-granola-bars1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Dairy-Free", 
            "Freezer Friendly", 
            "Gluten-Free", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2015/06/chocolate-chunk-granola-bars/", 
        "title": "chocolate chunk granola bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Line an 8-by-8 inch square pan with two sheets of parchment paper, extending each up two sides, forming a “sling” for your bars to make them easy to remove.", 
            "In a large bowl, combine oats, oat flour or ground oats, coconut, millet, salt, cinnamon (if using), dried fruit and chocolate. In a separate, small bowl, whisk together sunflower seed butter, oil and sweetener of choice until smooth. Pour wet mixture into dry and stir until combined. Transfer to prepared pan, spreading until flat, then use an addition square of parchment paper to protect your hand as you press, press, press the ingredients tightly into all corners of the pan, until they can be pressed no flatter.", 
            "Bake for 25 to 30 minutes, until the tops are golden and the edges are light brown. Let cool completely before cutting; they’ll be even easier to cut without crumbling if you chill them in the fridge first, so feel free to cool them there. Once cool, use the parchment “sling” to lift bars from pan and transfer to cutting board. Use a sharp, serrated knife in a very gentle sawing motion to cut bars into desired sizes (I usually go for 16 2×2-inch squares). ", 
            "Bars will keep at room temperature for up to a week in an airtight container, but I prefer to freeze them, individually wrapped, until needed. They only need to be out of the freezer for about an hour to fully defrost. "
        ], 
        "date": "2015-06-25T11:25:21+00:00"
    }, 
    {
        "ingredient_list": [
            "Noodles and vegetables", 
            "8 ounces buckwheat noodles", 
            "A mixture of raw vegetables of your choice (such as carrots, cucumbers, radishes or daikon; see Note for more suggestions)", 
            "Sauce", 
            "2 to 3 tablespoons miso (red is recommend; white would be just fine)", 
            "1 2-inch piece ginger, finely grated", 
            "2 teaspoons granulated sugar", 
            "1/8 teaspoon ground cayenne, or to taste", 
            "2 tablespoons mirin", 
            "1 tablespoon soy sauce", 
            "2 tablespoons lime juice (from about 1 lime), plus lime wedges for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/cold-noodles-with-miso-lime-and-ginger1.jpg?w=640", 
        "tags": [
            "Citrus", 
            "Cucumber", 
            "Japanese", 
            "Lunch", 
            "Pasta", 
            "Photo", 
            "Radishes", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/08/cold-noodles-with-miso-lime-and-ginger/", 
        "title": "cold noodles with miso, lime and ginger", 
        "directions": [
            "Cook the noodles in well-salted water until tender but firm for the time recommended on your package of noodles. What, your package is only in Japanese, like mine? Most are cooked between 5 and 8 minutes, so test at 5 and add more minutes if needed.", 
            "Meanwhile, grate, julienne or thinly slice vegetables of your choice.", 
            "Drain noodles and run cold water over them to cool. Drain again, shaking out excess water.", 
            "Make the dressing by whisking the smaller amount of miso plus the remaining sauce ingredients in a bowl. Taste and adjust to make sweeter (with more sugar) or more intense and salty (with the last tablespoon of miso) if desired. ", 
            "Divide noodles among four bowls; toss each with a tablespoon of the sauce, plus more to taste. Top with vegetables and extra droplets of sauce. Serve with lime wedges.", 
            "The leftovers won’t keep well with the sauce on. It’s best to keep it in one container and the noodles and vegetables in another, combining when needed, if you have extras. ", 
            "Notes:"
        ], 
        "date": "2014-08-04T12:14:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon butter", 
            "3 cups fresh corn (cut from 3 small-to-average cobs)", 
            "1 1/2 cup thinly sliced scallions (both white and green parts from a 4-ounce bundle)", 
            "8 cups whole wheat, country or French bread in 1-inch cubes (weight will vary from 10 to 14 ounces, depending on bread type)", 
            "2 cups (6 ounces) coarsely grated sharp cheddar", 
            "1 cup (2 ounces) finely grated parmesan", 
            "9 large eggs", 
            "2 tablespoons mayonnaise (optional, see Note up top)", 
            "2 3/4 cups milk", 
            "1 teaspoon table salt or 2 teaspoons of a coarse sea salt", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/corn-cheddar-and-scallion-strata1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Corn", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/corn-cheddar-and-scallion-strata/", 
        "title": "corn, cheddar and scallion strata", 
        "directions": [
            "Generously butter a 3-quart baking dish (a lasagna or 9×13-inch pan works well here too). Toss corn and scallions together in a medium bowl. Combine cheeses in another bowl. In a large bowl, gently beat eggs and mayo together, then whisk in milk, salt and lots (or, if measuring, 1/2 teaspoon) of freshly ground black pepper. Spread one-third of bread cubes in prepared baking dish — it will not fully cover bottom of dish; this is fine. Add one-third of corn, then cheese mixture. Repeat layering twice with remaining bread, corn and cheese. Pour egg mixture evenly over strata. Cover with plastic wrap and refrigerate for at least 8 hours or up to 1 day.", 
            "When ready to bake, heat oven to 350 degrees F. Bake strata, uncovered, until puffed, golden brown and cooked through, about 45 to 55 minutes. Let stand 5 minutes before serving. ", 
            "Do ahead: Strata keeps baked in the fridge for 4 days or longer in the freezer, wrapped well. It reheats wonderfully, either from the fridge or freezer and holds up well in lunch boxes."
        ], 
        "date": "2014-09-03T11:00:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (210 grams) dried farro", 
            "3 cups water or broth", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "Olive oil", 
            "2 1/4 to 2 1/2 pound (1 to 1 1/8 kgs) head of cauliflower, cut into small florets", 
            "2 tablespoons finely chopped fresh sage leaves", 
            "2 tablespoons capers (brine-packed), drained", 
            "2 large or 3 regular cloves garlic, minced", 
            "1/2 teaspoon finely grated lemon zest", 
            "Crushed red pepper flakes, to taste", 
            "2 cups (6 ounces or 170 grams) coarsely grated, lightly packed Italian Fontina (Val d’Aosta variety, if you can find it) (buy about 8 ounces with rind)", 
            "1/2 cup (125 grams) ricotta cheese", 
            "1/2 cup (25 grams) panko (plain Japanese-style breadcrumbs)", 
            "1/3 cup (30 grams) finely grated pecorino romano cheese", 
            "2 tablespoons finely chopped fresh parsley leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/01/crusty-baked-cauliflower-and-farro.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Cauliflower", 
            "Freezer Friendly", 
            "Grain/Rice", 
            "Photo", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2017/01/crusty-baked-cauliflower-and-farro/", 
        "title": "crusty baked cauliflower and farro", 
        "directions": [
            "Cook farro: Rinse and drain farro. There are many, many ways to cook farro and any of them work here. You can follow the package directions on any farro you buy for best results.", 
            "On the stove: If you plan to cook this on the stove and want to save time, you can presoak the grains overnight in their 3 cups of liquid and they should then cook in only 10 minutes of simmering. Otherwise, simmer the farro in water or broth for about 30 minutes, until quite tender. Drain any excess liquid. Transfer farro to large bowl.\nIn a rice-cooker: I cook mine on the quick setting and have been very happy with the results. Drain any excess liquid once the farro is tender. Transfer farro to large bowl.\nMeanwhile, parcook cauliflower:\nIn the oven: Heat oven to 425 degrees. Brush a large baking sheet with 2 tablespoons olive oil. Spread florets in one layer, drizzle with 1 more tablespoon olive oil and sprinkle with salt and freshly ground black pepper. Roast for 20 minutes until lightly browned and crisp-tender (they will finish baking with the farro). Reduce heat to 400 degrees.", 
            "One the stove: Heat 2 tablespoons olive oil in a large saute pan over medium-high heat. Add half the cauliflower and cook, tossing occasionally, until lightly browned and tender, about 6 to 7 minutes. Add to bowl with farro. Repeat with more olive oil and second half of cauliflower, then add to bowl. Heat oven to 400 degrees.\nAssemble casserole: Add the sage, capers, garlic, lemon zest, red pepper flakes, 1 teaspoon salt and 1/2 teaspoon black pepper to cauliflower and farro and stir to combine. Stir in fontina. Transfer half of the mixture to an oiled 10-inch ovenproof frying pan or equivalent baking dish. Dollop rounded tablespoons of ricotta all over. Sprinkle remaining cauliflower and farro over the ricotta, leaving the pockets of it undisturbed.", 
            "In a small dish, combine panko with pecorino, parlsey and 1 tablespoon olive oil until evenly mixed. Sprinkle over cauliflower and farro.", 
            "Bake casserole: For 20 minutes, until browned and crusty on top. Dig in.\nDo ahead: Farro can be cooked up to 3 days in advance, kept in an airtight container in fridge. Cauliflower can be cooked 2 days in advance. Casserole can be assembled and baked a day later, easily, although the crumbs might lose their crisp from absorbing the moisture below if not added right before baking. Casserole keeps for several days in fridge and longer in freezer."
        ], 
        "date": "2017-01-13T12:58:52+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound salt pork, pancetta or bacon, diced", 
            "1 large onion, finely diced", 
            "3 shallots, chopped", 
            "4 tablespoons butter, as needed", 
            "2 pounds beef chuck, in 1-inch cubes", 
            "2 tablespoons flour", 
            "Salt and freshly ground black pepper", 
            "1/2 cup Cognac (see Note)", 
            "2 cups unsalted beef stock", 
            "1/2 cup smooth Dijon mustard", 
            "4 tablespoons coarse Dijon or Pommery mustard (see Note)", 
            "4 medium carrots, peeled and cut into half-moon slices", 
            "1/2 pound mushrooms, stemmed, cleaned and quartered", 
            "1/4 cup red wine (see Note)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/dijon-and-cognac-beef-stew.jpg?w=750", 
        "tags": [
            "Beef", 
            "Date Night", 
            "French", 
            "Photo", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/02/dijon-and-cognac-beef-stew/", 
        "title": "dijon and cognac beef stew", 
        "directions": [
            "Place salt pork in a Dutch oven or a large heavy kettle over low heat, and cook until fat is rendered. Remove solid pieces with a slotted spoon, and save for another use, like your salad, vegetables or, uh, snacking. Raise heat to medium-low, and add onion and shallots. Cook until softened but not browned, about 10 to 15 minutes. Use a slotted spoon to transfer to a large bowl.", 
            "If necessary, add 2 tablespoons butter to the pan to augment fat. Dust beef cubes with flour, and season lightly with salt and more generously with pepper. Shake off excess flour, and place half the cubes in the pan. Cook over medium-high heat until well browned, almost crusty, on all sides, then transfer to a bowl with onions. Repeat with remaining beef.", 
            "Add Cognac to the empty pan, and cook, stirring, until the bottom is deglazed and any crusted-on bits come loose. Add stock, smooth Dijon mustard and 1 tablespoon coarse or Pommery mustard. Whisk to blend, then return meat and onion mixture to pan. Lower heat, cover pan partway, and simmer gently until meat is very tender, about 1 1/4 hours.", 
            "Add carrots, and continue simmering for 40 minutes, or until slices are tender. As they cook, heat 2 tablespoons butter in medium skillet over medium-high heat, and sauté mushrooms until browned and tender. Stir mushrooms into stew along with remaining mustard and red wine. Simmer 5 minutes, then taste, and adjust seasoning. Serve hot."
        ], 
        "date": "2014-02-24T12:16:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (120 ml) maple syrup, honey or half of each", 
            "1/2 cup (75 grams) coconut or brown sugar", 
            "1/4 cup (60 ml) water", 
            "1 teaspoon vanilla extract", 
            "1/4 teaspoon fine sea salt", 
            "1 1/2 teaspoons ground cinnamon (but I skipped this)", 
            "3 cups (300 grams) rolled oats (not quick-cooking)", 
            "1 1/4 cups (175 grams) almonds, chopped", 
            "1 1/4 cups (60 grams) unsweetened shredded coconut", 
            "1/2 cup (80 grams) flax seeds or chia seeds, whole or ground", 
            "1/4 cup (35 grams) sesame seeds", 
            "1/2 cup (60 grams) almond or hazelnut flour", 
            "1/3 cup (80 ml) olive, vegetable or coconut oil, or melted butter", 
            "1 large egg white, whisked until frothy"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/04/granola-bark1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Coconut", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2017/04/granola-bark/", 
        "title": "granola bark", 
        "directions": [
            "\nCombine maple syrup, sugar, water, vanilla and salt in a small saucepan and bring to a boil, stirring to dissolve the sugar and salt. Remove from heat and let cool to lukewarm.\nMeanwhile combine cinnamon (if using), oats, almonds, coconut, seeds, almond or hazelnut flour in a large bowl.\nHeat oven to 325 degrees. Line a rimmed half-sheet (13×18-inch) pan with parchment paper or a silicone mat.\nOnce liquid mixture is back to room temperature, whisk in olive oil, which will cool it further, then egg white. Pour over dry ingredients and mix well.", 
            "Spread mixture evenly across the prepared baking sheet. Press down firmly to compact it before baking, using another same-size baking sheet or the bottom of a pot. Bake for 40 to 50 minutes, until dark golden brown, rotating the sheet every 15 minutes to promote even browning. While it bakes, open the oven door a few times to release steam.\nSet on a cooling rack until surface of granola is crisp. Leave oven on. If surface is still tacky to the touch once it has cooled — although I didn’t find this at all — return the pan to the oven and continue baking for another 10 to 15 minutes, checking every 5 minutes. Don’t let it get too dark or it tastes bitter.\nOnce totally cool, break into pieces in store in an airtight container at room temperature for up to 2 weeks, or in the fridge up to 1 month.\n"
        ], 
        "date": "2017-04-17T12:05:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (110 grams) plain yogurt", 
            "A small handful finely chopped leafy fresh herbs (parsley, cilantro, mint, chives, dill or a mix thereof) plus a few roughly chopped, to serve", 
            "1 teaspoon red wine vinegar, or more to taste", 
            "Kosher salt", 
            "Olive oil", 
            "A handful shredded red cabbage to serve (optional)", 
            "Lemon wedges, to serve", 
            "Kosher salt", 
            "1/2 teaspoon cumin seeds or a heaped 1/2 teaspoon ground", 
            "1/2 teaspoon coriander seeds or a heaped 1/2 teaspoon ground", 
            "1/2 teaspoon fennel seeds or a heaped 1/2 teaspoon ground", 
            "1 teaspoon sweet paprika", 
            "2 garlic cloves, minced", 
            "2 tablespoons harissa paste (I just used a small squeeze) or another hot sauce", 
            "1 pound (455 grams) ground lamb, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/homemade-merguez-with-herby-yogurt1.jpg?w=750", 
        "tags": [
            "Lamb", 
            "Middle Eastern", 
            "North African", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/09/homemade-merguez-with-herby-yogurt/", 
        "title": "homemade merguez with herby yogurt", 
        "directions": [
            "\nMake the herby yogurt: Mix the yogurt, finely chopped herbs and vinegar in a small bowl. Season to taste with salt and extra vinegar, if desired. Set aside until needed.\nMake the merguez: If using whole spices, toast them in a dry skillet over medium heat for a few minutes until fragrant. Grind them in a spice grinder or with a mortar and pestle.", 
            "Combine lamb, spices, including paprika, harissa, garlic and 1 teaspoon (Turshen called for 1 1/2, which was very salty and we liked it but probably not for everyone) kosher salt and mix to combine. Form into 12 mounds.\n[Do ahead: You can keep the mixed meat patties and herbed yogurt in the fridge for up to 3 days.]\nHeat a large, heavy skillet over high heat. Coat with olive oil and once it is very hot, add a few sausage mounds. Once they hit the frying pan, flatten them with the back of your spatula. Cook until brown and crispy underneath, then flip and cook for another minute or two. Drain on paper towels. Repeat with remaining meat.\nServe patties warm with herby yogurt and scattered with extra herbs and shredded cabbage, if desired, plus wedges of lemon to squeeze over.\n"
        ], 
        "date": "2016-09-13T12:14:13+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound (8 ounces or 225 grams) pasta of you choice, such as a ziti or twisty shape", 
            "1 tablespoon (15 ml) olive oil", 
            "3/4 pounds (340 grams) fresh mushroom, sliced (I used pre-sliced cremini, my new favorite thing)", 
            "1 small-to-medium yellow onion, halved and sliced thin", 
            "Salt and freshly ground black pepper to taste", 
            "1/4 cup (60 ml) dry marsala wine (see notes at end for more information)", 
            "3 tablespoons (45 grams) unsalted butter", 
            "3 tablespoons (25 grams) all-purpose flour", 
            "1 1/2 cups (355 ml) stock or broth (chicken, vegetable or mushroom)", 
            "1/2 cup (50 grams) finely grated parmesan cheese", 
            "4 ounces (115 grams) mozzarella, cut into small cubes", 
            "3 tablespoons chopped fresh flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/mushroom-marsala-pasta-bake1.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Date Night", 
            "Freezer Friendly", 
            "Mushrooms", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/01/mushroom-marsala-pasta-bake/", 
        "title": "mushroom marsala pasta bake", 
        "directions": [
            "A tip: If we play our cards right here, this can be made entirely in one dish. I used a 4-quart Staub braiser (Happy Hanukah to me!) but any 3-to-4 quart stovetop-to-oven type dish will work.", 
            "Cook the pasta: Bring a pot of well-salted water to a boil. Add pasta and cook until al dente, about 1 to 2 minutes before perfect doneness. Drain and set aside.", 
            "Heat oven: To 400 degrees.", 
            "Make the sauce: Reheat your empty pasta pot over high heat. Add oil and once it is hot, add mushrooms and cook until they’ve begun to brown and glisten, but have not yet released their liquid. Reduce heat to medium-high, add onions, salt and pepper and saute together until the liquid the mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until it has almost or fully evaporated (depending on your preference). Add butter, stir until melted. Add flour, and stir until all has been dampened and absorbed. Add stock, a very small splash at a time, stirring the whole time with a spoon. Make sure each splash has been fully mixed into the butter/flour/mushroom mixture, scraping from the bottom of the pan and all around, before adding the next splash. Repeat until all stock has been added. Let mixture simmer together for 2 minutes, stirring frequently; the sauce will thicken. Remove pan from heat.", 
            "Assemble and bake dish: If you’re cooking in an ovensafe dish, add cooked pasta and stir until combined. (If you’re not cooking in an ovensafe dish, transfer this mixture to a 2-quart baking dish.) Stir in half the parmesan, all of the mozzarella and two tablespoons of the parsley until evenly mixed. Sprinkle the top with remaining parmesan. Bake for 25 to 30 minutes, until edges of pasta are golden brown and irresistible. Sprinkle with reserved parsley and serve hot. Reheat as needed.", 
            "A bunch of notes: "
        ], 
        "date": "2015-01-12T12:03:33+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons unsalted butter, divided", 
            "1 tablespoon olive oil", 
            "1 1/2 pounds mixed mushrooms, cleaned, trimmed and torn into bite size pieces (see suggestions above)", 
            "2 thick slices bread from a large, crusty loaf (I’d use 4 from a smaller loaf)", 
            "2 cloves garlic or 1 shallot, minced", 
            "1 tablespoon white wine vinegar, or more to taste (I used 2)", 
            "1 fresh red chile, stemmed, seeded and minced or red pepper flakes, to taste", 
            "Coarse salt and freshly ground black pepper", 
            "6 ounces chopped fresh greens (see suggestions above)", 
            "8 ounces of a good melting cheese, thickly sliced (suggestions above)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroooms-and-greens-with-toast1.jpg?w=640", 
        "tags": [
            "Casserole", 
            "Greens", 
            "Kale", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/05/mushrooms-and-greens-with-toast/", 
        "title": "mushrooms and greens with toast", 
        "directions": [
            "Melt 2 tablespoons butter and olive oil together in a large, heavy skillet over medium-high heat. One fully hot, add mushrooms to pan and cook, stirring regularly, until they’ve released their water and started to turn golden brown, about 8 minutes. ", 
            "Meanwhile, grill or toast your bread.", 
            "One the mushrooms have a nice color on them, add the garlic or shallots and cook, stirring constantly, for 1 minute. Drizzle with vinegar, most of the chile or chile flakes, salt and pepper and stir to combine. Add the greens; pretty much any kind aside from baby spinach will benefit from about 5 to 8 minutes cooking time, just until collapsed. If you’re me, you’ll add 1 more tablespoon vinegar for brightness at this point. Stir in remaining tablespoon butter and adjust seasonings to taste. Rip bread into irregular croutons and push them into the sauteed vegetables. Lay pieces of cheese atop everything. Turn the heat down to medium low, place a lid on the pan and let the cheese melt, which will take 5 to 10 minutes, depending on the pan and the kind of cheese you used. ", 
            "Sprinkle with remaining chile, “hand out forks, then bring the the pan to the table.” "
        ], 
        "date": "2015-05-12T12:04:17+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 to 1 pound seedless cucumber, washed and chopped into chunks", 
            "2 thin or 1 regular scallions, thinly sliced", 
            "1 large avocado, pitted and diced", 
            "2 tablespoons mayonaise", 
            "Juice of half a lime, plus more to taste", 
            "Salt and hot sauce (we used Sriracha) to taste", 
            "Chopped cilantro or flat-leaf parsley to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/17041084926_d38d46dae0_k.jpg?w=750", 
        "tags": [
            "Avocado", 
            "Cucumber", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/04/obsessively-good-avocado-cucumber-salad/", 
        "title": "obsessively good avocado cucumber salad", 
        "directions": [
            "Combine cucumber, scallions and avocado in a bowl. Whisk together mayo, lime and seasonings, adjusting levels to taste. Drizzle salad with dressing and garnish with cilantro or parsley. Repeat again tomorrow. "
        ], 
        "date": "2015-04-07T12:00:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1 28-ounce can whole tomatoes", 
            "1 (3 to 3 1/2 pound) boneless beef chuck roast, tied with a string", 
            "1 head garlic, separated into cloves, left unpeeled"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic1.jpg?w=750", 
        "tags": [
            "Beef", 
            "Budget", 
            "Date Night", 
            "Gluten-Free", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic/", 
        "title": "oven-braised beef with tomatoes and garlic", 
        "directions": [
            "Heat oven to 300°F (150°C). Coarsely chop tomatoes with their juice in a food processor (Gourmet’s suggestion) or go at them in their can with kitchen shears (my lazy preference) to break them up. Put roast in an ovenproof 4- to 5-quart heavy pot or a casserole dish with a lid — a tight fit is just fine, as it will shrink very soon. Pour tomatoes over roast and scatter garlic around it. Season generously with salt and pepper. Braise in middle of oven, covered, until very tender, 3 to 4 hours. Cut roast into 1/4-inch-thick slices and serve with sauce, garlic, squeezed from its peels (or you can leave others to do this) and orzo (Gourmet’s suggestion, of course not gluten-free), mashed potatoes (recipe at the end) or crusty bread. Leftovers shredded over egg noodles sound wonderful as well.", 
            "Do ahead: Like almost all braises, this is even better on the second day, which means it’s a dream of a dinner party dish. Let it cool to room temperature, then chill it in the fridge until needed. Defat the sauce before warming (it will be a cinch once solidified on top) and rewarm at 300 for 30 to 45 minutes. ", 
            "Notes:"
        ], 
        "date": "2015-02-09T11:59:10+00:00"
    }, 
    {
        "ingredient_list": [
            "4 teaspoons fine sea or table salt", 
            "6 to 8 (1 kilo) small to medium Yukon Gold potatoes, peeled", 
            "1 medium yellow onion, diced", 
            "1/2 teaspoon freshly ground black pepper", 
            "4 to 5 tablespoons olive oil", 
            "About 1 tablespoon fresh rosemary leaves", 
            "2 cups minus 1 tablespoon (250 grams) all-purpose or bread flour", 
            "1 1/4 teaspoons (5 grams) instant or active dry yeast", 
            "A heaped 1/4 teaspoon fine sea or table salt", 
            "A heaped 1/4 teaspoon granulated sugar", 
            "2/3 cups (150 grams) room temperature water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/potato-pizza-pizza-con-potate1.jpg?w=640", 
        "tags": [
            "Dairy-Free", 
            "Photo", 
            "Pizza", 
            "Potatoes", 
            "Vegan", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/04/potato-pizza-even-better/", 
        "title": "potato pizza, even better", 
        "directions": [
            "In a medium bowl, stir together the flour, yeast, salt, and sugar. Add the water and, using a wooden spoon or your hand, mix until well blended, about 30 seconds. Cover the bowl and let sit at room temperature until the dough has more than doubled in volume, about 2 hours. Continue using instructions above."
        ], 
        "date": "2016-04-04T12:04:43+00:00"
    }, 
    {
        "ingredient_list": [
            "Olive oil", 
            "1 large onion, sliced (1 1/2 cups)", 
            "2 cups (1/4-inch-sliced) fennel, top and core, if thick, removed", 
            "3 cloves garlic, minced (1 tablespoon)", 
            "1 pound sweet potatoes, peeled and sliced 1/4-inch thick", 
            "1 pound celery root, peeled and sliced 1/4-inch thick", 
            "1 pound yukon gold, peeled and sliced 1/4-inch thick", 
            "1 cup heavy cream (see Note up top)", 
            "2 cups chicken or vegetable stock or brother", 
            "2 cups grated gruyere cheese (6 ounces with rind)", 
            "2 teaspoons minced fresh thyme leaves", 
            "Kosher salt and freshly ground black pepper", 
            "2 1/2 cups coarse fresh breadcrumbs or panko (what I used)", 
            "2 to 3 tablespoons melted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/root-vegetable-gratin.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Fennel", 
            "Freezer Friendly", 
            "Onions", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/11/root-vegetable-gratin/", 
        "title": "root vegetable gratin", 
        "directions": [
            "Heat your oven to 350°F. Butter a 13×9-inch deep baking dish.\nHeat 2 tablespoons olive oil in a large deep (ideally 12-inch) saute pan over medium heat and add the onions and fennel. Cooking, tossing occasionally, until lightly browned and tender, about 10 minutes. Add the garlic and cook for one minute more.\nMeanwhile, in the largest bowl you own, combine the onion mixture with remaining vegetables, cream, stock, cheese, thyme, 1 tablespoon kosher salt and 1 1/2 teaspoons black pepper. Pour mixture into prepared dish and spread until even. Mix breadcrumbs and butter until evenly coated and distribute evenly over top of dish.\nBake 1 1/2 hours uncovered, or until vegetables are very tender when tested with a small knife and the top is browned and bubbly. Allow to set for 15 minutes at room temperature and serve hot."
        ], 
        "date": "2016-11-10T13:09:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups (335 grams) packed light brown sugar", 
            "2 large eggs, at room temperature", 
            "1/2 teaspoon vanilla extract", 
            "1 3/4 cups (450 grams) smooth peanut butter (see note at end)", 
            "Coarse-grained sea salt, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/salted-peanut-butter-cookies1.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Peanut Butter", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2015/10/salted-peanut-butter-cookies/", 
        "title": "salted peanut butter cookies", 
        "directions": [
            "Preheat the oven to 350°F. Line a rimmed baking sheet with parchment paper.", 
            "In a medium bowl, whisk together the light brown sugar and eggs until smooth. Whisk in the vanilla extract, then the peanut butter until smooth and completely incorporated; you shouldn’t be able to see any ribbons of peanut butter. Ovenly says you know the dough is ready when it has the consistency of Play-Doh, but I can tell you as the mom of a Play-Doh fanatic that mine was thinner, softer.", 
            "If you’d like to get those pretty striations across the top of the cookies, chill the dough by freezing it in its bowl for 15 minutes, stirring it once (so the edges don’t freeze first), before scooping it. If you’re not obsessed with these markings, you can scoop it right away. Scoop or spoon the dough into balls — Ovenly uses about a 1/4-cup scoop (probably #16); I use a 1 2/3 tablespoons or #40 scoop. Place on prepared pan. For the tallest final shape, place the tray in the freezer for 15 minutes before baking.", 
            "Sprinkle the dough balls lightly with coarse-grained sea salt just before baking. Bake smaller cookies for 14 to 15 minutes and larger for 18 to 20. When finished, cookies should be golden at edges. They’ll need to set on the sheet for a minute or two before they can be lifted intact to a cooling sheet. Trust me, you should let these cool completely before eating so the different textures (crisp outside, soft inside) can set up.", 
            "Do ahead: You can definitely make the dough in advance and either refrigerate it for a couple days or freeze it longer. However, if I were going to freeze it, I’d probably go ahead and scoop it first. You can bake them right from the freezer.", 
            "About chilling the dough: The Ovenly recipe says you can scoop and bake the cookies right away, but they keep their shape better if you chill them in the freezer for 15 minutes first. I tried it with and without and did find a better dome and final shape with the 15 minutes after. However, I was incredibly charmed by the striated marks from the cookie scoop on top of the cookie I bought last weekend, as well as in the photo in their book, and I realized that I couldn’t get it at home with just-mixed dough; you’ll get more of a blob shape from your scoop. So, I also chilled the dough for 15 minutes before scooping it and was then satisfied with the shape. It’s not necessary unless you’re as taken with top pattern as I am.", 
            "Two questions I suspect someone will ask very soon: Can you make this with all-natural peanut butter and can you make this with almond or a nut butter? The answer to both is yes, however, the authors themselves warn that you’ll get the best final shape and texture from a smooth, thick processed peanut butter like Skippy (their recommendation; updated to note, thanks to a commenter suggestion, that the 16.3-ounce jar of Skippy is estimated to contain 1 3/4 cups, saving you some measuring). I suspect an almond or cashew butter will have a similar effect as natural peanut butter. "
        ], 
        "date": "2015-10-15T11:56:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            null, 
            "1/2 cup (about 3 ounces) ricotta", 
            "1 cup coarsely grated fontina (about 3 ounces)", 
            "1 cup coarsely grated mozzarella (about 3 ounces", 
            "1 cup grated pecorino romano (about 3 ounces)", 
            "3/4 cup mild blue cheese, crumbled (about 3 ounces)", 
            "1 cup crushed tomatoes from a can", 
            "1 cup whole milk (see notes up top for adjustments)", 
            "Kosher salt and freshly ground black pepper to taste", 
            "1 tablespoon finely chopped rosemary or 6 fresh basil leaves, coarsely chopped", 
            "2 scallions, sliced thinly at an angle"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/skillet-baked-pasta-with-five-cheeses.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Pasta", 
            "Photo", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/10/skillet-baked-pasta-with-five-cheeses/", 
        "title": "skillet-baked pasta with five cheeses", 
        "directions": [
            "Bring a pot of well-salted water to a boil. Add the pasta and cook until very al dente, a full 2 minutes shy of whatever your package says. Try a piece of pasta — it should have a toothsome bite to it because it will continue softening in the oven after this. If it’s still crunchy, however, continue to boil the rest of the pasta for another minute.\nHeat your oven to 500 degrees F.\nMeanwhile, in the bottom of a large bowl, combine the five cheeses. Scoop out half and set aside. Whisk milk and tomatoes in the half of cheese left in the large bowl. When pasta is drained, add it to the bowl and stir to combine. Season well with salt and pepper and stir in any herbs you plan to use.\nCoat the sides and bottom of a 12-inch cast-iron or other oven-proof skillet with olive oil. Pour the pasta and sauce in. Sprinkle with remaining cheese. Bake until the top is bubbling and golden brown, 16 to 18 minutes. If it’s not brown enough for your tastes, run it under the broiler for 1 minute.", 
            "Top with scallions and dig in."
        ], 
        "date": "2016-10-04T12:04:20+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/spaghetti-pie-with-pecorino-and-black-pepper1.jpg?w=640", 
        "tags": [
            "Casserole", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/01/spaghetti-pie-with-pecorino-and-black-pepper/", 
        "title": "spaghetti pie with pecorino and black pepper", 
        "directions": [
            "Heat oven to 425 degrees. Butter a 9-inch springform pan and this is very important, wrap the outside of the springform, focusing on the places where the ring meets the base, tightly in aluminum foil. Set aside.", 
            "Bring a large pot of well-salted water to a boil. If using broccoli rabe, add it to the pot and boil for 1 to 2 minutes, until it has some give. Fish it out with a large slotted spoon and drain it well. Set aside.", 
            "Add spaghetti to boiling water and cook until (this is also important) 2 minutes shy of done, so very al dente, as the spaghetti will continue cooking in the oven. Drain well and let cool slightly.", 
            "If using broccoli rabe, wring all extra moisture out of it and blot greens on paper towels to be extra careful. Mince rabe into very small bits. You’ll have about 1 cup total.", 
            "In a large bowl, whisk eggs and milk together with salt and pepper. Stir in all but 1/2 cup of each cheese and chopped rabe, if using. Add spaghetti and toss to coat. ", 
            "Pour into prepared springform and sprinkle remaining cheese on top. Bake for 35 to 40 minutes (without greens) and up to 15 minutes more (with greens, as they add moisture too), until the cheese is melted and bubbling and a knife inserted into the center of the pie and turned slightly will not release any loose egg batter into the center. If the top of your pie browns too quickly before the center is set, cover it with foil for the remaining cooking time.", 
            "Turn on your oven’s broiler. Broil the pie a few inches from the heat for 2 to 3 minutes, until browned on top. Cut along springform ring to loosen, then remove ring. Run a spatula underneath the pie to loosen the base and slide onto a serving plate. Cut into wedges."
        ], 
        "date": "2016-01-26T12:08:58+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (10 ounce) package frozen spinach, thawed, squeeze of all excess liquid, and chopped", 
            "1 1/2 cups finely chopped onion (1 large)", 
            "3 tablespoons unsalted butter", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper", 
            "1/4 teaspoon freshly grated nutmeg", 
            "8 cups cubed French or Italian bread in 1-inch cubes (1/2 lb)", 
            "6 ounces coarsely grated Gruyère (2 cups)", 
            "2 ounces finely grated parmesan (1 cup)", 
            "2 3/4 cups milk", 
            "9 large eggs", 
            "2 tablespoons Dijon mustard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spinach-and-cheese-strata1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/12/spinach-and-cheese-strata/", 
        "title": "spinach and cheese strata", 
        "directions": [
            "Sauté onion in butter in a large, heavy skillet over medium heat until soft, about 5 minutes. Add 1/2 teaspoon salt, 1/4 teaspoon pepper and nutmeg and continue cooking for one minute. Stir in spinach, remove from heat and set aside.", 
            "Spread one third of the bread cubes in a well-buttered 3-quart gratin dish or other ceramic baking dish. Top with one-third of spinach mixture and one-third of each cheese. Repeat layering twice with remaining bread, spinach and cheese.", 
            "Whisk eggs, milk, mustard and remaining 1/2 teaspoon salt and 1/4 teaspoon pepper together in a large bowl and pour evenly over strata. Cover with plastic wrap and chill strata for eat least 8 hours or up to a day.", 
            "The next day, let it stand at room temperature for 30 minutes while preheating the oven to 350°F. Bake strata, uncovered, in middle of oven until puffed, golden brown, and cooked through, 45 to 55 minutes. Let stand 5 minutes before serving."
        ], 
        "date": "2009-12-22T12:27:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 2/3 cups (215 grams) all-purpose flour", 
            "3/4 teaspoon kosher salt", 
            "12 tablespoons (170 grams) cold unsalted butter, diced", 
            "3 tablespoons (45 grams) very cold water", 
            "Nonstick spray oil, for coating pan", 
            "3/4 cup (176 grams, 6 ounces, or 3/4 of an 8-ounce brick) cream cheese, soft at room temperature", 
            "2/3 cup (155 ml) half-and-half or 1/3 cup each whole milk and heavy cream", 
            "6 large eggs", 
            "2 10-ounce (283-gram) packages frozen chopped spinach, thawed", 
            "1 cup (115 grams or 4 ounces) grated cheddar or gruyere", 
            "1/2 cup (50 grams) finely grated Parmesan", 
            "1 small bundle (2 to 3 ounces or about 8 thin green onions) thinly sliced", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/spinach-sheet-pan-quiche.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Casserole", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Spinach", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/11/spinach-sheet-pan-quiche/", 
        "title": "spinach sheet pan quiche", 
        "directions": [
            "Make crust: In a food processor, blend flour and salt together. Add butter and pulse machine until butter is reduced to a fine meal, or couscous-sized bits. While running machine, drizzle in water; stop when dough has balled, a few seconds later.\nWrap dough in plastic or waxed paper and set in freezer to quick-chill until firm but not rock-hard, about 15 to 20 minutes. You can also chill it in the fridge for 2 hours or up to 1 week until needed.\nLightly coat a 9×13-inch (quarter-sheet) pan with oil. Line bottom with parchment paper.\nTo roll out crust (trickier, but go for it if you’re up for the challenge): Flour your counter well. Remove crust from freezer or fridge, unwrap and flour the top of it. Even if it’s very hard, begin rolling it very gently, in light motions, so it doesn’t crack too much as you stretch it out, to about a 12×16-inch rectangle. Keep flouring top and counter underneath dough as it is prone to sticking. Work as quickly as possible because this dough softens even more than regular pie dough as it warms.\nTransfer dough to prepared pan. Lift overhang to let dough slack/droop into corners so you’re not stretching it a lot to shape it to the pan. Trim overhang to 1/2- to 1-inch, then fold overhang onto sides of dough, pressing all around and letting the dough extend slightly over the edge of the pan.\nTo press in crust (less tricky, and what I always wish I’d done): Press dough in an even layer across bottom of pan; leave it thicker as it goes up the sides; pressing all around and letting the dough extend slightly over the edge of the pan.\nBoth methods: Freeze shaped dough until solid, about 20 minutes. Save your scraps! You can use them to patch any holes or cracks formed when baking.\nMeanwhile, heat oven to 425 degrees F. Coat a large sheet of foil lightly with spray oil. Once crust is solid, prick it all over with a fork and press foil, oiled side down, tightly against dough. Fill foiled crust to the top with pie weights, dried beans or rice (that you don’t plan to eat at any time) or even pennies. Bake for 20 minutes then gently, carefully remove foil and weights and bake for 5 more minutes, unfilled.\nWhile crust par-bakes, make filling: Use an electric mixer or your best whisking skills to beat cream cheese in the bottom of a large bowl until smooth and fluffy. Gradually drizzle in half-and-half, whisking the whole time so that the mixture incorporates smoothly. Whisk in eggs, two at a time, until combined. Squeeze out spinach in handfuls, removing as much extra moisture as possible. Stir in spinach, cheddar, parmesan, scallions, salt and pepper.\nWhen crust has finished parbaking, leave oven on. Inspect crust for cracks or holes and use reserved dough to patch them if necessary. Pour in filling just to the top of the crust. You will probably have about 3/4 cup more filling than you can fit in the crust (not an issue if going crust-less or if you didn’t parbake the crust); you can bake this off in a separate oiled dish for an excellent breakfast on toast tomorrow.\nBake quiche until crust is golden brown and filling is set, about 25 minutes. Cool at least 10 minutes before serving. Quiche keeps in fridge for 4 to 5 days."
        ], 
        "date": "2016-11-28T13:12:54+00:00"
    }, 
    {
        "ingredient_list": [
            "Gratin", 
            "2 pounds summer squash", 
            "Salt", 
            "1 1/2 cup fresh breadcrumbs", 
            "3 tablespoons unsalted butter", 
            "3/4 cup thinly sliced shallots (from 4 to 5 medium)", 
            "1 cup grated gruyere cheese", 
            "1/4 cup salsa verde (below)", 
            "Freshly ground black pepper", 
            "Salsa verde", 
            "1 tablespoon thyme leaves", 
            "1 teaspoon marjoram or oregano leaves (or half, if dried)", 
            "1/4 cup coarsely chopped mint leaves", 
            "1 cup coarsely chopped flat-leaf parsley", 
            "2 small cloves garlic", 
            "1 salt-packed anchovy, rinsed and bones removed", 
            "1 tablespoon capers, drained (and rinsed, too, if salt-packed)", 
            "1/2 cup olive oil", 
            "1/2 lemon, or more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/summer-squash-gratin-with-salsa-verde1.jpg?w=640", 
        "tags": [
            "Casserole", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Summer Squash", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2014/07/summer-squash-gratin-with-salsa-verde/", 
        "title": "summer squash gratin with salsa verde", 
        "directions": [
            "Heat your oven to 400°F. Cut the squash into thin (1/8-inch thick) coins. Toss with 1 teaspoon kosher salt and set aside for at least 10 minutes. Drain zucchini in a colander, and if you have time, spread them on a towel for a few minutes to further wick away moisture before placing it in a large mixing bowl.", 
            "Meanwhile, place breadcrumbs in a small bowl. In a small skillet or saucepan, melt butter and keep cooking it over medium heat until it browns and smells nutty. Carefully pour (in a small drizzle at first) over breadcrumbs and be sure to scrape out any brown bits from the pot. Toss crumbs to evenly coat.", 
            "Make the salsa verde by blending the herbs in a food processor or blender with garlic, anchovy and capers until it forms a paste, scraping down as needed. With the machine running, stream in the olive oil in a drizzle. Season with salt and black pepper. Add lemon juice to taste.", 
            "Add shallots, gruyere, half the breadcrumbs, 1/4 cup salsa verde (about half; you can use the rest to dress eggs or any roasted meat) and some freshly ground black pepper to the bowl with the summer squash and toss. Transfer to a 9×9-inch (or equivalent; I used a 9-inch round cast-iron skillet) baking dish. Scatter remaining breadcrumbs over the top and bake 35 to 40 minutes, until the squash is tender and the crumbs are crisp."
        ], 
        "date": "2014-07-22T12:23:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (1/2 stick or 2 ounces) butter", 
            "1 small onion, finely chopped", 
            "3 pounds Swiss chard, leaves and stems separated and both cut into 1-inch pieces", 
            "Pinch of freshly grated nutmeg", 
            "2 cups heavy cream or whole milk", 
            "2 garlic cloves, minced", 
            "2 tablespoons flour", 
            "2 pounds medium red-skinned sweet potatoes (yams), peeled and cut into 1/8-inch thick rounds", 
            "1 tablespoon minced fresh Italian parsley", 
            "1 tablespoon minced fresh thyme", 
            "Fine sea salt", 
            "Freshly ground black pepper", 
            "1 1/4 cups (about 5 ounces) coarsely grated Gruyére cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/swiss-chard-and-sweet-potato-gratin.jpg?w=753", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Freezer Friendly", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Swiss Chard", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/11/swiss-chard-and-sweet-potato-gratin/", 
        "title": "swiss chard and sweet potato gratin", 
        "directions": [
            "Prep greens: Cook onion in 2 tablespoons butter in a wide 8-quart heavy pot over moderately low heat, stirring, until softened. Add chard stems, pinch of nutmeg, and salt and pepper to taste and cook, stirring, until vegetables are tender but not browned, about 8 minutes. Increase heat to moderately high and add chard leaves by large handfuls, stirring, until all greens are wilted. Season with salt and pepper then transfer greens to a colander to drain well and press out liquid with back of a large spoon.", 
            "Make sauce: Combine cream or milk and garlic in small saucepan; bring to simmer; keep warm. Melt two tablespoons butter in a medium heavy saucepan over moderate heat and stir in flour. Cook roux, whisking, one minute, then slowly whisk in warm cream/milk and boil, whisking, one minute. Season sauce with salt and pepper.", 
            "Assemble gratin: Preheat oven to 400°F. Butter deep 9×13 baking dish. Spread half of sweet potatoes in the prepared baking dish. Sprinkle with salt, pepper, a quarter of the herbs and a 1/4 cup of the cheese. Distribute half of the greens mixture over the cheese, then sprinkle salt, pepper, a quarter of the herbs and 1/4 cup of the cheese over it. Pour half of bechamel sauce over the first two layers then continue with the remaining sweet potatoes, more salt, pepper, herbs and cheese and then the remaining greens, salt, pepper and herbs. Pour the remaining sauce over the top of the gratin, pressing the vegetables slightly to ensure that they are as submerged as possible. Sprinkle with the last 1/4 cup of cheese.", 
            "Bake gratin for about 1 hour until golden and bubbly, and most of the liquid is absorbed. Let stand 10 minutes before serving. ", 
            "Do ahead: You can make the entire gratin but not bake it up to a day in advance and keep it in the fridge. You can also make and bake the gratin and reheat it. Gratins reheat well, but they take almost as much time to gently heat through as they do to bake in the first place, especially deep ones like this. As for reheating, already baked and frozen, I will find out very soon! But I am near-positive it will be fine."
        ], 
        "date": "2009-11-12T17:08:23+00:00"
    }, 
    {
        "ingredient_list": [
            "4 teaspoons vegetable oil", 
            "1/4 cup (60 grams) tomato paste", 
            "2 tablespoons cider vinegar", 
            "2 teaspoons honey", 
            "2 teaspoons Worcestershire sauce", 
            "2 teaspoons smooth dijon mustard", 
            "1/4 teaspoon table salt", 
            "2 slices sandwich bread", 
            "1/2 medium onion, roughly chopped", 
            "1 garlic clove, chopped", 
            "1 medium stalk celery, roughly chopped", 
            "1 medium carrot, roughly chopped", 
            "Olive oil, for cooking", 
            "1 teaspoon fine sea or table table salt, plus more for vegetables", 
            "Freshly ground black pepper", 
            "2 pounds ground beef", 
            "2 large eggs", 
            "1 tablespoon tomato paste", 
            "1 teaspoon dijon mustard", 
            "1 teaspoon smoked paprika", 
            "2 tablespoons Worcestershire sauce", 
            "1/4 cup chopped fresh flat-leaf parsley", 
            "1/2 cup (120 grams) milk", 
            "2 pounds (905 grams) yukon gold potatoes (about 6)", 
            "8 tablespoons (4 ounces or 115 grams) unsalted butter", 
            "1 cup (235 ml) buttermilk", 
            "1 teaspoon fine sea or table salt", 
            "Finely ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/tomato-glazed-meatloaves-with-brown-butter-mashed-potatoes.jpg?w=750", 
        "tags": [
            "Beef", 
            "Freezer Friendly", 
            "Meat", 
            "Photo", 
            "Potatoes", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2017/02/tomato-glazed-meatloaves-with-brown-butter-mashed-potatoes/", 
        "title": "tomato-glazed meatloaves with brown butter mashed potatoes", 
        "directions": [
            "Make the glaze: Combine glaze ingredients in a small saucepan, and simmer, whisking constantly, for 2 minutes until and glaze is satiny smooth. Set aside.\nPrepare the meatloaves: Heat your oven to 350 degrees F. Lightly coat 2 9×13-inch baking dishes with nonstick spray or oil. Tear the bread into chunks and then blend it, in a food processor, into breadcrumbs. Place the breadcrumbs in a large bowl. You should have about 1 cup.\nAdd the onion, garlic, celery, and carrot to the food processor, and pulse it until they are finely chopped. Heat a large skillet over medium heat. Once the skillet is hot, coat the bottom with olive oil, and heat the oil for a minute; add the finely chopped vegetables. Season with salt and pepper, and cook, stirring frequently, until they begin to brown, about 10 minutes.\nAdd the vegetables to the large bowl with breadcrumbs, then add the remaining ingredients. Stir the ingredients together with a fork or your hands until evenly blended.\nPause for a moment to start mashed potatoes: Place the potatoes in a medium pot, and cover with a couple inches of cold water. Bring to a boil over high heat, and once it’s boiling, reduce the heat to a simmer. Cook for about 20 minutes once the simmering begins; the potatoes are ready when a paring knife or fork can be inserted into the center with little resistance. Drain potatoes, then wipe the pot dry.", 
            "Resume your meatloaves while the potatoes boil: Form the meatloaf mixture into twelve 3-inch meatballs; each will weigh about 4 ounces. Arrange 6 in each prepared baking pan, evenly. Drizzle or brush each meatball with a teaspoon or so of the tomato glaze you made earlier, and bake until cooked through, about 20 to 25 minutes (an instant-read thermometer inserted into the center of a cooked meatball will register 160 to 165F).\nFinish mashed potatoes: As soon as you can hold them (I use potholders), peel your potatoes. The skins should come right off with a paring knife. Run the potatoes through a potato ricer or mash them with a masher until smooth. In your empty potato pot, melt butter over medium heat and continue cooking once it has melted, stirring almost constantly, until brown bits form around edge and bottom and it smells nutty. Pour the hot butter and any browned bits over the potatoes. Add buttermilk to pot and warm it gently (so it doesn’t cool down your potatoes when you add it). Pour this over the potatoes too. Add salt and pepper and stir to combine.\nTo serve: Place a dollop of potatoes in the bottom of a plate or shallow bowl. Top with a meatloaf. Garnish with extra chopped parsley, if desired.\n"
        ], 
        "date": "2017-02-16T13:08:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups hazelnuts", 
            "1 cup granulated sugar, divided", 
            "1/4 teaspoon fine sea or table salt", 
            "4 large egg whites", 
            "2 teaspoons instant espresso powder (optional)", 
            "8 ounces (about 1 1/3 cups) miniature chocolate chips or bittersweet chocolate, chopped small"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/ugly-but-good-brutti-ma-buoni-cookies1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Italian", 
            "Passover", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/01/ugly-but-good-cookies/", 
        "title": "ugly but good cookies", 
        "directions": [
            "Heat oven to 350 degrees F. Place hazelnuts on a baking sheet and toast in oven for 10 minutes, rolling around once to ensure they cook evenly. Check the color; I believe that they taste best when toasted to a real golden color. Put them back in for 2 minutes at a time and check again if they’re not there yet. Let cool completely. (Putting the tray outside in winter for all of 5 minutes does the trick.) Place nuts in a dishtowel and roll them around so that the skins largely come off. Reduce heat to 300 degrees F.", 
            "Transfer toasted, peeled hazelnuts to a food processor and add 1/4 cup sugar and the salt. Grind until they reach your desired consistency; I went for well-chopped but not fully powdery. ", 
            "In a large bowl, beat egg whites with an electric mixer until very foamy. Slowly pour in remaining 3/4 cup sugar, beating the whole time. Beat until stiff peaks form; when you lift the beater, they should flop over slightly after forming a peak. Fold in nuts, espresso powder (if using) and chocolate.", 
            "Line two large baking sheets with parchment paper or a nonstick baking mat. Scoop batter into about 1 1/2 tablespoon mounds with about an inch of space between them. Bake for 25 minutes, until very faintly golden. Let cool on baking sheet for 5 to 10 minutes, after which they’ll be easier to remove with a thin spatula. Let finish cooling on racks. ", 
            "Cookies keep at room temperature in an airtight container for a week, but only if you don’t tell anyone they’re there."
        ], 
        "date": "2016-01-07T12:11:22+00:00"
    }, 
    {
        "ingredient_list": [
            "Butter for dish", 
            "2 1/2 pounds (about 1 1/8 kg) zucchini", 
            "2 1/2 teaspoons kosher salt (I use Diamond brand, use 1 1/2 of other brands)", 
            "1/2 cup (90 grams) plain, uncooked white rice", 
            "1 medium onion, minced (about 1 cup)", 
            "5 tablespoons (75 ml) olive oil, divided", 
            "2 large cloves garlic, mashed or finely minced", 
            "2 tablespoons (15 grams) all-purpose flour (optional)", 
            "1/2 cup milk, as needed, although water or broth of your choice would work just fine [1/2 cup needed for streamlined directions, less for original]", 
            "2/3 cup (55 grams) grated Parmesan cheese, divided", 
            "Salt and pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/zucchini-rice-and-cheese-gratin1.jpg?w=750", 
        "tags": [
            "Budget", 
            "Casserole", 
            "Freezer Friendly", 
            "Grain/Rice", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Summer", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2015/09/zucchini-rice-cheese-gratin/", 
        "title": "zucchini rice and cheese gratin", 
        "directions": [
            "\nNew, simplified directions:", 
            "Heat oven to 325 degrees F. Oil or butter a 2-quart baking dish, or 2 smaller 1-quart dishes (as I did, with the intention of freezing one).", 
            "Prepare zucchini: Wash zucchini and trim ends. Halve lengthwise, and if seeds are particularly large, core them out. Coarsely grate and place in a large bowl.", 
            "Prepare remaining ingredients: In a large frying pan, cook the onions slowly in 3 tablespoons oil for 8 to 10 minutes until tender and translucent. Raise heat slightly and stir several minutes until very lightly browned. Stir in garlic and cook another minute. Add uncooked rice and sauté for another two minutes. Season generously with salt and pepper.\nAssemble gratin: Transfer to bowl with zucchini and stir together with 1/2 cup liquid of your choice and all but 2 tablespoons cheese. Taste and adjust seasoning if needed. Transfer to prepared baking dish.", 
            "Bake gratin: Cover tightly with foil and bake for 50 to 60 minutes, until rice within is cooked but not mush. Increase oven temperature to 450 degrees. Remove foil, drizzle top with remaining olive oil (or dot with butter), sprinkle on remaining cheese and bake uncovered until browned and crisp on top, about another 10 to 15 minutes. For extra color, you can run it under the broiler for one minute at the end.\nDirections as originally published here:", 
            "Prepare zucchini: Wash zucchini and trim ends. Halve lengthwise, and if seeds are particularly large, core them out. Coarsely grate and place in a colander set over a bowl. Toss with kosher salt. Let drain for 5 minutes, says Julia Child, but more like 20 or, if you’ve got the time, up to 30 minutes.", 
            "Save drained liquid and squeeze a handful of the zucchini and taste. If it’s very salty, rinse and drain it again (not saving liquid this time). Squeeze all of the zucchini in handfuls, gently, collecting any juices in the bowl of drained liquid. Blot dry on paper towels.", 
            "Prepare rice: Boil for exactly 5 minutes in salted water. Drain and set aside. [In comments I’ve read about this recipe online, many people say that they skip this step and it all works out in the oven. But I didn’t this time.]\nPrepare remaining ingredients: In a large frying pan, cook the onions slowly in 3 tablespoons oil for 8 to 10 minutes until tender and translucent. Raise heat slightly and stir several minutes until very lightly browned. Stir in the grated and dried zucchini and garlic; season with salt and pepper. Toss and turn for 5 to 6 minutes until the zucchini is almost tender.  Sprinkle in the flour, stir over moderate heat for 2 minutes, and remove from heat.\nAssemble dish: Measure the drained liquid from the zucchini. If you have less than 2 1/2 cups, add milk to bring the level up to it. (I became sidetracked and mine drained for an hour; I ended up with the full 2 1/2 cups and needed no milk.)\nStir into zucchini-onion mixture, return pan to stove over medium-high heat and bring to a simmer, stirring. Remove from heat again, stir in par-cooked rice and all but 2 tablespoons cheese. Taste and adjust seasoning if needed.", 
            "Turn into a 2-quart baking dish, or 2 smaller 1-quart dishes (as I did, with the intention of freezing one). Sprinkle with reserved cheese and remaining olive oil, although I apparently used butter instead, because: butter\nYou can cook it right away, or let it sit until 30 minutes before you want to serve it.", 
            "30 minutes before serving: Heat oven to 425 degrees. Bake in upper third of oven until bubbling and browned on top, about 25 to 30 minutes. (If yours begins to brown too quickly, you can cover it with foil until the last 5 minutes.) The rice should absorb all the liquid. Serve immediately.", 
            ""
        ], 
        "date": "2015-09-16T12:05:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup uncooked white rice, long-grain is suggested but use whatever you prefer", 
            "5 tablespoons olive oil", 
            "1 1/2 pounds zucchini (about 3 medium), sliced 1/4-inch thick", 
            "1/2 pound plum tomatoes, sliced 1/4-inch thick", 
            "Table salt and freshly ground black pepper", 
            "1 medium onion, halved lengthwise and thinly sliced", 
            "3 garlic cloves, minced", 
            "2 large eggs, lightly beaten", 
            "1 teaspoon chopped fresh thyme leaves", 
            "1/2 cup grated Parmesan, divided"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/zucchini-tomato-and-rice-gratin.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Gluten-Free", 
            "Grain/Rice", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2012/07/zucchini-tomato-and-rice-gratin/", 
        "title": "zucchini, tomato and rice gratin", 
        "directions": [
            "Preheat oven to 450°F. Cook the rice according to your favorite method. The package directions work in some cases, but check my notes above about adjustments I find I have to make. If you cook the rice in a large, wide-ish covered skillet, it might cook even faster but you’ll have the chance to use it again (and save on dirty dishes) when you need to cook the onions in a bit.", 
            "While rice cooks, coat two large (or, if you have the same pitifully small oven as I do, three smaller) baking sheets each with a tablespoon of a of olive oil (a bit less for smaller pans). Spread zucchini and tomato slices on the baking sheets in as close to a single layer as you can. Sprinkle with 1/2 teaspoon salt and a few grinds of black pepper. Roast tomatoes for 10 minutes and zucchini for 20. Flip zucchini halfway through; it’s not worth the messy effort for the tomatoes. Leave oven on.", 
            "Heat large, heavy skillet (such as the one you used to cook your rice) over medium heat. Once hot, add 2 tablespoons olive oil, heat oil, then add onions, garlic and 1/4 teaspoon salt to pan. Cover and reduce heat to low, cooking onion until limp and tender, about 15 to 20 minutes. Stir occasionally.", 
            "Combine onion mixture, rice, eggs, thyme, half of your grated cheese and a half-tablespoon of olive oil in a bowl. Add a good amount of freshly ground black pepper. Use the remaining half-tablespoon of olive oil to coat a shallow 2-quart baking dish. Spread half of rice mixture in bottom of dish. Arrange half of roasted zucchini on top. Spread remaining rice mixture over it and please don’t worry about being neat about this; dinner will be “rustic” tonight! Arrange remaining zucchini on top, then tomato slices. Sprinkle with remaining grated cheese and bake until set and golden brown, about 20 minutes. Each oven varies, but I find mine does the very best browning when the dish is on a rack near the top of the oven."
        ], 
        "date": "2012-07-31T17:55:18+00:00"
    }
]