[
    {
        "ingredient_list": [
            "1 3-ounce package cream cheese, room temperature", 
            "1/3 cup half and half", 
            "3 eggs", 
            "1 10-ounce package frozen chopped spinach, thawed and drained", 
            "1/2 cup grated cheddar", 
            "1/4 cup grated Parmesan", 
            "4 to 6 green onions, sliced", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon pepper ", 
            "2 (14- to 15-oz.) cans pink or pinto beans, drained and rinsed", 
            "4 cups water", 
            "1 2-oz bunch cilantro (without roots)", 
            "1 large onion, chopped", 
            "2 large garlic gloves, chopped", 
            "2 tablespoons olive oil", 
            "3 tablespoons tomato paste", 
            "1 tablespoon distilled white vinegar", 
            "1 Cubanelle or Italian frying pepper (not spicy; 4 oz) halved lengthwise, steam and seeds discarded", 
            "2 Turkish bay leaves or 1 California", 
            "1 teaspoon salt", 
            "1/2 teaspoon dried oregano, crumbled", 
            "1/2 teaspoon black pepper", 
            "3 cups old-fashioned rolled oats", 
            "1 cup sweetened flaked coconut", 
            "1/2 cup vegetable oil*", 
            "1/3 cup sliced almonds (1 oz)", 
            "1/2 cup chopped walnuts", 
            "1/3 cup green (hulled) pumpkin seeds, sometimes called pepitas (1 1/2 oz; not roasted) **", 
            "1/3 cup packed dark brown sugar", 
            "1/4 cup mild honey", 
            "Pinch cinnamon", 
            "Pinch salt", 
            "1 cup tart dried cherries ***", 
            "1/2 cup dried blueberries", 
            "1/2 cup dried pears (1/4-inch dice)", 
            "1/2 cup diced dried apricots (1/4 inch dice)", 
            "1/3 cup golden raisins"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/ah-ha-ha-come-and-take-my-hand1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Photo", 
            "Spinach", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2006/10/ah-ha-ha-come-and-take-my-hand/", 
        "title": "spinach quiche", 
        "directions": [], 
        "date": "2006-10-23T09:33:41+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds (32 ounces) ounces fresh baby spinach or regular spinach leaves", 
            "1 small yellow onion, finely chopped", 
            "3 small garlic cloves, minced", 
            "4 tablespoons unsalted butter", 
            "1 pound mushrooms, thinly sliced (I use creminis)", 
            "1 cup heavy cream", 
            "3/4 teaspoon table salt", 
            "Freshly ground black pepper", 
            "1/4 teaspoon freshly grated nutmeg (optional; I skip this)", 
            "12 large eggs", 
            "6 tablespoons finely grated Parmesan cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/baked-eggs-with-spinach-and-mushrooms.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Mushrooms", 
            "Spinach", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/04/baked-eggs-with-spinach-and-mushrooms/", 
        "title": "baked eggs with spinach and mushrooms", 
        "directions": [
            "If you’ve just washed your spinach, no need to dry it before wilting it in the pan. If it’s already dry, bring 1/2 inch water to a boil in a very large ovenproof heavy skillet, then add half of spinach and cook, turning with tongs, until wilted, about 30 seconds. Add remaining spinach and wilt in same manner, then cook, covered, over moderately high heat until spinach is tender, about 1 to 2 minutes. Drain in a colander and cool under cold running water. Gently squeeze handfuls of spinach to remove as much liquid as possible, then coarsely chop. You will have about 2 cups fairly tightly packed cooked spinach.", 
            "Wipe skillet dry, then melt butter over medium-low heat. Cook onion and garlic until softened, 2 to 3 minutes. Add mushrooms and increase heat to medium-high, then cook, stirring, until mushrooms have softened, exuded liquid and that liquid has cooked off, about 5 minutes. Stir in cream, salt, pepper, nutmeg (if using), and chopped spinach and bring back a simmer. Remove skillet from heat.", 
            "If baking eggs in this skillet, make 12 large indentations in mixture, each large enough to fit an egg. Otherwise, you can transfer this mixture to a 9×13-inch baking dish and do the same there. I like to use 2 teaspoons to make the wells; I press the backs of them together to “pinch” up the spinach mixture to form taller walls so that the eggs will not merge together. ", 
            "Do ahead: You can then set this aside for a few hours or up to one day in the fridge, covered.", 
            "When you’re ready to bake the dish, or about 30 minutes before serving, put oven rack in upper third of oven and heat oven to 450°F. Crack an egg into each well. Bake until whites are firm and yolks are still runny. You can check this by inserting a toothpick into various parts of the eggs and seeing whether they’re runny or set, which takes anywhere from 15 to 30 minutes. The range is long due to different ovens and baking vessels. It’s better to have to check more often than to let them overcook.", 
            "[Cooking note: It is nearly impossible to get all 12 eggs to cook evenly. The ones in the center will be more runny; at the edges, they’ll be more firm. But don’t fret. I’ve found that almost all people have an egg preference (more runny vs. more firm) and each egg manages to find the right home. Just ask people their preference as you serve them.]", 
            "Remove dish from oven, sprinkle with additional salt and pepper, plus grated Parmesan. Serve immediately."
        ], 
        "date": "2014-04-16T12:31:29+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "3 3/4 (470 grams) cups all-purpose flour (feel free to replace up to half with whole-wheat)", 
            "1 1/2 teaspoons table salt", 
            "3 sticks (340 grams) unsalted butter, very cold", 
            "3/4 cup very cold water", 
            "Filling", 
            "1 pound yukon gold potatoes, peeled if desired, cut into 1/2-inch slices", 
            "10 ounces spinach (baby, “grown-up,” or frozen)", 
            "1 cup coarsely grated sharp cheddar cheese", 
            "4 scallions, thinly sliced", 
            "11 large eggs + 1 large egg white (you’ll use the yolk in a minute)", 
            "1 teaspoon kosher or coarse sea salt, plus more to taste", 
            "Freshly ground black pepper", 
            "To finish", 
            "1 large egg yolk (leftover from filling)", 
            "1 teaspoon water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/breakfast-slab-pie1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Potatoes", 
            "Spinach", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/12/breakfast-slab-pie/", 
        "title": "breakfast slab pie", 
        "directions": [
            "Make pie crust: Whisk together flour, and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in the water with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. Divide dough roughly in half (it’s okay if one is slightly larger). Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day. [Still freaked out about making your own pie dough? Read this for a ton of additional tips and details.]", 
            "Heat oven  oven to 375 degrees F. Line bottom of 10x15x1-inch baking sheet or jellyroll pan with parchment paper.", 
            "Prepare filling: Place potatoes in a medium saucepan and cover with cold water. Bring to a boil, then reduce to a simmer, cooking for 7 to 10 minutes, until potatoes are tender but not falling apart. Drain. ", 
            "Wash spinach but no need to dry it. Place wet spinach in hot skillet and cook until it just wilts. Drain in a colander, pressing or squeezing out as much liquid as possible. You should have about 1 cup of spinach one wilted and squeezed. If spinach leaves were large, you might want to roughly chop the squeezed-out piles of spinach before adding it to the filling. ", 
            "Assemble pie: On a lightly floured surface, roll one of your dough halves (the larger one, if you have two different sizes) into an 18-by-13-inch rectangle. This can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible and using enough flour that it doesn’t stick to the counter. Transfer to your prepared baking sheet and gently drape some of the overhang in so that the dough fills out the inner edges and corners. Some pastry will still hang over the sides of the pan; trim this to 3/4-inch overhang.", 
            "Layer vegetables evenly over bottom pie crust. [You don’t want your pie to look like this, after all. NSFW language there, btw.] If using the fillings that I did, beat 11 whole eggs and 1 egg white lightly and pour over vegetables. If you’ve used other fillings, you might find that you need more or fewer eggs to mostly fill (I did not want to fill the crust to the top with eggs, as it would have been more difficult to bake without filling) the bottom crust; if you’re nervous, just beat a few eggs at a time and pour them in until your filling reaches the desired level. Sprinkle with salt and many grinds of black pepper.", 
            "Roll the second of your dough halves (the smaller one, if they were different sizes) into a 16-by-11-inch rectangle. Drape over filling and fold the bottom crust’s overhang over the edges sealing them together. Cut only a couple tiny slits in the lid to act as vents — too many or too big, and the filling will want to leak out before the eggs set. Beat remaining egg yolk with 1 teaspoon water and brush over lid. ", 
            "Bake pie: Until crust is golden and filling is set, about 40 to 45 minutes. Transfer to a wire rack and cool a bit before cutting into squares.", 
            "Do ahead: I haven’t frozen this pie, but suspect that it will freeze well already baked. Or, you could make the pie doughs up to one month in advance (storing them in the freezer), four days in advance (to store in the fridge) and roll them out when you’re ready to bake the pie. Baked slab pie will keep in the fridge for 3 to 4 days. Squares can be reheated as needed. Vegetables can be prepped (spinach wilted, potato par-boiled) and stored in the fridge for 2 days before using."
        ], 
        "date": "2013-12-20T12:29:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 small red cabbage, trimmed, cored, and shredded (about 6 cups)", 
            "1/2 small green cabbage, trimmed, cored, and shredded (about 6 cups)", 
            "1 tablespoon kosher salt, plus more to taste", 
            "1 bunch fresh baby spinach, stemmed and cut into 1/2-inch wide ribbons (about 4 cups loosely packed)", 
            "1/4 cup fresh lime juice (from about 2 small limes)", 
            "1 tablespoon Dijon or other salty prepared mustard", 
            "1/2 teaspoon ground cumin", 
            "1/4 cup peanut oil", 
            "1/2 cup roasted unsalted peanuts, coarsely chopped", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-and-lime-salad-with-roasted-peanuts1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Citrus", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Spinach", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/04/cabbage-and-lime-salad-with-roasted-peanuts/", 
        "title": "cabbage and lime salad with roasted peanuts", 
        "directions": [
            "In a large bowl, toss the shredded red and green cabbage with the salt. Transfer the cabbage to a colander and let it drain for two hours. (I was in a rush and did this in one. It was still nicely wilted, but of course could have been even softer.)", 
            "If you’re worried about the cabbage being too salty when you’re done with the salting process, taste a piece of cabbage and if it concerns you, rinse and drain the cabbage well. This is not a suggestion in the original recipe, but something I suspect might bother some people.", 
            "Put the salted, drained cabbage back into your (rinsed and dried) large bowl and add the spinach. In a medium bowl, whisk the lime juice, mustard and cumin together. Add the peanut oil in a thin stream, whisking constantly until the ingredients are thoroughly emulsified. Toss the salad with the dressing and add the roasted peanuts. Season to taste with salt and pepper.", 
            "This salad is best served immediately, but it does keep surprisingly well in the fridge for a day or two. "
        ], 
        "date": "2010-04-28T22:35:23+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds baby spinach or 2 1/2 pounds fresh spinach, tough stems discarded", 
            "1 3/4 cups heavy cream or whole milk, or a mix thereof", 
            "1 small onion, finely chopped", 
            "1 small clove garlic, minced (optional)", 
            "3 tablespoons unsalted butter", 
            "3 tablespoons all-purpose flour", 
            "Pinch of freshly grated nutmeg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/creamed-spinach.jpg?w=753", 
        "tags": [
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Spinach", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/11/creamed-spinach/", 
        "title": "creamed spinach", 
        "directions": [
            "Wash your spinach well but no need to spin or pat it dry. Place spinach in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 2 to 4 minutes for baby spinach and 4 to 6 minutes for regular spinach.", 
            "Press or squeeze out the excess liquid any number of ways, either by wringing it out in cheesecloth (my favorite method), putting it in a mesh strainer and pressing the moisture out with a spatula or large spoon or letting it cool long enough to grab small handfuls and squeezing them to remove as much water as possible. Coarsely chop the wrung-out spinach.", 
            "Wipe out large pot so you can use it again.", 
            "Heat milk or cream in a small saucepan over moderate heat, stirring, until warm. Keep warm. Meanwhile, cook onion and garlic, if using, in butter in your wiped-out large pot over moderately low heat, stirring occasionally, until softened, about six minutes. Whisk in flour and cook roux, whisking, about three minutes. Add warm milk or cream in a slow stream, whisking constantly to prevent lumps, and simmer, whisking, until thickened, three to four minutes. Stir in nutmeg, spinach, and salt and pepper to taste and cook, stirring, until heated through.", 
            "Do ahead: Creamed spinach can be made one day ahead and chilled, covered then reheated over moderately low heat until hot. However, it really tastes best eaten immediately."
        ], 
        "date": "2009-11-19T11:26:48+00:00"
    }, 
    {
        "ingredient_list": [
            "5 ounces baby spinach leaves", 
            "2 3/4 to 3 cups all-purpose flour, preferably unbleached", 
            "1/2 teaspoon sea salt or kosher salt", 
            "3 large eggs", 
            "3 large egg yolks", 
            "Water (only if absolutely needed)", 
            "Additional flour for rolling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/fresh-spinach-pasta1.jpg?w=640", 
        "tags": [
            "Italian", 
            "Pasta", 
            "Photo", 
            "Spinach", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/05/fresh-spinach-pasta/", 
        "title": "fresh spinach pasta", 
        "directions": [
            "Wash spinach but no need to dry. With water droplets still clinging to the leaves, wilt spinach in a hot skillet until completely soft, about 4 minutes. Let cool and wring all the water — seriously, every drop you can get out — out of the spinach in small fistfuls, and then pressing these little bundles out against a fine-mesh strainer. Rest spinach on paper towels to remove even more water, then mince spinach on a cutting board.", 
            "Dump spinach, smaller amount of flour and salt on countertop and mix with your fingers, then form into a pile. Make a deep well in the center and add the whole eggs and yolks to it. Use your fingertips to break up the eggs and begin moving your fingers in a circular motion, keeping the eggs within the well (or you’ll have egg lava running everywhere and be in a very bad mood). Each circular movement pulls in a little bit of flour from the sides. In a few minutes, the mixture will become thicker and thicker, finally becoming too tight to move easily with your fingers. At this point, you can use a bench scraper (a perfect tool here) or spatula to start adding the remaining, a little pile at a time. Once a shaggy dough has formed, begin kneading the mixture, scraping it up when it sticks, until a ball is formed. It will look flaky but will hold together.", 
            "Knead the dough, pressing it away with the heels of your hands then forming it back into a blob, for 1 to 2 minutes, until the dough is moist but not sticky. Add remaining flour, a spoonful at a time, only if dough is too sticky. Add a drop or two of water only if it’s cracking when you knead it. In almost all cases, I find that erring on the side of firmer pasta is safer than softer pasta, which doesn’t hold shapes well and will want to stick a pasta roller. Let it rest for 5 minutes, then knead it again for 5 to 8 minutes. Wrap dough in plastic and let rest at room temperature for an hour.", 
            "Divide dough into sixths. On a floured surface, roll the pasta as thin as you can; as thin as a credit card and translucent is ideal. Letting rolled-out pasta rest for 10 minutes before cutting it into your desired shape helps yield cleaner, easier cuts. ", 
            "Cook pasta in a large pot of boiling, well-salted water for anywhere from 2 to 6 minutes (depending on thickness), until al dente. Drain and toss with fixings of your choice — garlic-sizzled olive oil or melted butter, parmesan or pecorino, dollops of ricotta or mascarpone. Eat immediately.", 
            "Many notes:"
        ], 
        "date": "2014-05-06T12:28:39+00:00"
    }, 
    {
        "ingredient_list": [
            "5 ounces tomato juice", 
            "1 1/2 ounces vodka", 
            "Juice of 2 lime wedges", 
            "1/2 teaspoon finely grated", 
            "fresh horseradish", 
            "2 or 3 dashes of Worcestershire sauce", 
            "3 or 4 drops of Tabasco sauce", 
            "Pinch of salt", 
            "Pinch of celery salt", 
            "Small pinch of cayenne pepper", 
            "Ice ", 
            "10 oz baby spinach leaves", 
            "1/4 cup finely chopped onion", 
            "1 garlic clove, finely chopped", 
            "2 tablespoons unsalted butter", 
            "5 oz mushrooms, thinly sliced (2 cups)", 
            "1/3 cup heavy cream", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "1/8 teaspoon freshly grated nutmeg", 
            "4 large eggs", 
            "2 tablespoons finely grated parmesan", 
            "3 cups all purpose flour", 
            "1 teaspoon sugar (originally recipe calls for 2 tablespoons)", 
            "4 teaspoons baking powder", 
            "1 teaspoon salt", 
            "1 teaspoon baking soda", 
            "3/4 cup (1 1/2sticks) chilled unsalted butter, cut into 1/4-inch pieces", 
            "1/4 cup minced fresh chives", 
            "1 cup buttermilk "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/my-bacon-is-always-crisp1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Drinks", 
            "Eggs", 
            "Mushrooms", 
            "Photo", 
            "Scones/Biscuits", 
            "Spinach"
        ], 
        "url": "https://smittenkitchen.com/2007/05/my-bacon-is-always-crisp/", 
        "title": "baked eggs + chive biscuits + bloody marys", 
        "directions": [
            "Preheat oven to 425°F. Whisk flour, sugar, baking powder, salt and baking soda in large bowl to blend. Using fingertips, rub 3/4 cup chilled butter into dry ingredients until mixture resembles coarse meal. Stir in chives. Add buttermilk and stir until evenly moistened. Using 1/4 cup dough for each biscuit, drop biscuits onto baking sheet, spacing 2 inches apart.* Bake until biscuits are golden brown on top, about 15 minutes. Cool slightly. Serve warm. ", 
            "* I’m a sucker for the round, bumpy-edged biscuit shape so I rolled it out on well-floured counter and cut them with a 3″ biscuit-cutter. Take care to handle the dough as little as humanly possible, so not to warm or soften it too much. "
        ], 
        "date": "2007-05-13T20:49:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon unsalted butter", 
            "1/2 cup sliced green onions", 
            "1 clove garlic, minced", 
            "1 pound fresh spinach (coarse stems removed if ‘grown-up’ spinach; baby spinach can be used in full)", 
            "3/4 pound feta, crumbled", 
            "1 tablespoon lemon juice", 
            "Salt and pepper to taste", 
            "1/4 ounce dried wild mushrooms, such as chanterelles, porcini or shiitakes", 
            "1 cup boiling water", 
            "2 tablespoons unsalted butter", 
            "3/4 cup sliced green onions", 
            "1 garlic clove, minced", 
            "1/2 teaspoon chopped fresh rosemary", 
            "1/2 teaspoon chopped fresh thyme", 
            "1/2 pound assorted fresh wild mushrooms, such as chanterelles, porcini and shiitakes, brushed clean and chopped small", 
            "1/2 pound fresh button mushrooms, brushed clean and chopped small", 
            "5 ounces blue cheese crumbles", 
            "Salt and pepper to taste", 
            "3 tablespoons olive oil", 
            "1 teaspoon fennel seeds", 
            "2 large yellow onions, chopped small", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper", 
            "1 heaping tablespoon Dijon mustard", 
            "4 ounces goat cheese, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/spanikopita-triangles.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/06/spanakopita-triangles-then-some/", 
        "title": "spanakopita triangles + then some", 
        "directions": [
            "Preheat oven to 375°F. Melt butter in a small saucepan, then cool. Cover phyllo stack with 2 overlapping sheets of plastic wrap and then a dampened kitchen towel. [I won’t lie, as I got more confident with the phyllo I sorta skipped this part, opting instead to work quickly. Proceed at your own risk, however!]", 
            "Take one phyllo sheet from stack and arrange on a work surface with a long side nearest you (keeping remaining sheets covered) and brush with some butter. Top with another phyllo sheet and brush with more butter. Cut buttered phyllo stack crosswise into 6 (roughly 12- by 2 3/4-inch) strips.", 
            "Put a heaping teaspoon of filling near one corner of a strip on end nearest you, then fold corner of phyllo over to enclose filling and form a triangle. Continue folding strip (like a flag), maintaining triangle shape. Put triangle, seam side down, on a large baking sheet and brush top with butter. Make more triangles in same manner, using all of phyllo.", 
            "Bake triangles in middle of oven until golden brown, 20 to 25 minutes, then transfer to a rack to cool slightly.", 
            "Do ahead: Pastry triangles can be formed, but not baked, three days ahead. Arrange in one layer in heavy-duty sealed plastic bags, then freeze. Bake frozen pastries (do not thaw) in same manner as above."
        ], 
        "date": "2009-06-10T08:43:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (10 ounce) package frozen spinach, thawed, squeeze of all excess liquid, and chopped", 
            "1 1/2 cups finely chopped onion (1 large)", 
            "3 tablespoons unsalted butter", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper", 
            "1/4 teaspoon freshly grated nutmeg", 
            "8 cups cubed French or Italian bread in 1-inch cubes (1/2 lb)", 
            "6 ounces coarsely grated Gruyère (2 cups)", 
            "2 ounces finely grated parmesan (1 cup)", 
            "2 3/4 cups milk", 
            "9 large eggs", 
            "2 tablespoons Dijon mustard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spinach-and-cheese-strata1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Eggs", 
            "Freezer Friendly", 
            "Lunch", 
            "Photo", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/12/spinach-and-cheese-strata/", 
        "title": "spinach and cheese strata", 
        "directions": [
            "Sauté onion in butter in a large, heavy skillet over medium heat until soft, about 5 minutes. Add 1/2 teaspoon salt, 1/4 teaspoon pepper and nutmeg and continue cooking for one minute. Stir in spinach, remove from heat and set aside.", 
            "Spread one third of the bread cubes in a well-buttered 3-quart gratin dish or other ceramic baking dish. Top with one-third of spinach mixture and one-third of each cheese. Repeat layering twice with remaining bread, spinach and cheese.", 
            "Whisk eggs, milk, mustard and remaining 1/2 teaspoon salt and 1/4 teaspoon pepper together in a large bowl and pour evenly over strata. Cover with plastic wrap and chill strata for eat least 8 hours or up to a day.", 
            "The next day, let it stand at room temperature for 30 minutes while preheating the oven to 350°F. Bake strata, uncovered, in middle of oven until puffed, golden brown, and cooked through, 45 to 55 minutes. Let stand 5 minutes before serving."
        ], 
        "date": "2009-12-22T12:27:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound (230 grams) dried chickpeas, cooked until soft and tender* or two 15-ounce cans of chickpeas, drained and rinsed", 
            "6 tablespoon olive oil", 
            "1 pound (450 grams) spinach, washed", 
            "A hefty 1-inch slice from a country loaf or about 2 slices from sandwich loaf bread (2.5 ounces or 75 grams), crusts removed and cut inset small cubes", 
            "1/2 cup (4 ounces) tomato sauce (I used canned stuff I keep around)", 
            "3 garlic cloves, thinly sliced", 
            "1/2 teaspoon ground cumin", 
            "Pinch of red pepper flakes", 
            "1 1/2 tablespoons red wine vinegar", 
            "1/2 teaspoon smoked paprika**", 
            "Salt and freshly ground black pepper", 
            "Lemon juice, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/03/spinach-and-chickpeas.jpg?w=752", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Beans", 
            "Photo", 
            "Put An Egg On It", 
            "Spanish", 
            "Spinach", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/03/spinach-and-chickpeas/", 
        "title": "spinach and chickpeas", 
        "directions": [
            "Place a large saucepan over medium heat and add half the olive oil. When it is hot, add the spinach with a pinch of salt (in batches, if necessary) and stir well. Remove when the leaves are just tender, drain in a colander and set aside.", 
            "Heat 2 more tablespoons olive oil in a frying pan over medium heat. Fry the bread for about 5 minutes or until golden brown all over, then the remaining tablespoon of oil and the garlic, cumin and pepper. Cook for 1 minute more or until the garlic is nutty brown.", 
            "Transfer to a food processor, blender or mortar and pestle along with the vinegar, and mash to a paste. Return the mixture to the pan and add the drained chickpeas and tomato sauce. Stir until the chickpeas have absorbed the flavors and are hot. Season with salt and pepper.", 
            "If the consistency is a little thick, add some water. Add the spinach and cook until it is hot. Check for seasoning and serve with paprika on top, or on fried bread toasts (as the Spanish do).", 
            "* I make all of my dried beans in the slow-cooker these days. They are perfect every time, and the flavor of fresh beans — even the sad-looking ones from grocery store bins I used — is incomparable. No presoaking, just cover them 2 to 3 inches of water and cook them 3 hours on high. (I have learned that cooking time can vary widely in slow-cookers so allot more time than you might need. I often make mine in the day or days before and let them cool in their cooking water, which is then by then very flavorful.)", 
            "** This might be my favorite ingredient on earth — it’s amazing on eggs and potatoes, too. If you can’t find it locally, Amazon and Penzeys are among a bunch of places that sell it online."
        ], 
        "date": "2010-03-17T11:26:41+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/spinach-and-egg-pizzettes1.jpg?w=640", 
        "tags": [
            "Brunch", 
            "Eggs", 
            "Italian", 
            "Photo", 
            "Pizza", 
            "Put An Egg On It", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/spinach-and-egg-pizzettes/", 
        "title": "spinach and egg pizzette", 
        "directions": [
            "Heat oven to 500 degrees. Place parchment paper* on tray and sprinkle with cornmeal. Stretch pieces of dough into 6 to 7-inch thin, round-ish shapes.", 
            "If using grown-up spinach, remove coarse stems. No need to remove stems from baby spinach. Wash and drain spinach leaves but no need to fully dry. In a large skillet, cook spinach with water droplets still clinging to the leaves (if it seems too dry, add another tablespoon or two of water to the pan) until spinach just wilts. Plunge spinach in cold water, then transfer it to a colander. Press out as much liquid as you can, then squeeze the rest in small fisfuls.", 
            "Transfer to cutting board and chop spinach into small bits. In a bowl, combine it with creme fraiche, garlic, parmesan, salt and pepper. ", 
            "Divide spinach mixture over each dough round, spreading almost to the edges, thinning it slightly in the center with a spoon to make an indentation to help hold the egg in place. If using small eggs, crack one into the center of each pizzette. If using larger eggs, separate the egg. Add yolk to center of spinach, then pour in egg white carefully, so not to add so much that it floods the pizza. However, if it does spill over, don’t sweat it, that’s what the parchment is for. ", 
            "Either bake pizza directly on parchment covered trays or slide parchment onto pizza stones for anywhere from 6 to 8 minutes (in a very robust oven), to 10 to 13 minutes (in a regular one)**, until egg white is set and the yolk is still loose. As soon as you remove the pizzette from the oven, add a grind of black pepper, very thin drizzle of olive oil and scatter some extra parmesan over it. Eat immediately.", 
            "* Technically speaking, parchment paper should not go in an oven hotter than 450 degrees, but I’ve found that nothing bad happens, it only gets a little brown at the edges. Without the parchment, any egg run-off tends to cement the pizzette to the pan, no fun at all.", 
            "** The baking times are especially finicky here. These will work for most people, however, if your egg becomes too cooked before the pizza is remotely golden at the edges, you might want to add it later in the cooking time. Be especially cautious of this if using small eggs."
        ], 
        "date": "2013-11-04T12:05:18+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large egg", 
            "1 slice of your favorite hearty bread", 
            "2 ounces baby spinach", 
            "1 pat butter", 
            "1 tablespoon minced shallot or white onion", 
            "1 tablespoon heavy cream", 
            "Sea salt and freshly ground black pepper", 
            "1 teaspoon smooth Dijon mustard", 
            "1 tablespoon crumbled cheese, such as goat cheese or feta"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/spinach-and-smashed-egg-toast.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Eggs", 
            "Photo", 
            "Put An Egg On It", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/04/spinach-and-smashed-egg-toast/", 
        "title": "spinach and smashed egg toast", 
        "directions": [
            "Bring small pot of water to boil. Lower egg into it and boil for five (for a runnier egg, as seen in top photo) to six (for a less-runny but still loose egg, as seen in bottom two photos) minutes.* Rinse egg briefly under cool water and set aside.", 
            "Wash your spinach but no need to dry it. Put a small puddle of water in the bottom of a skillet and heat it over medium-high. Once the water is simmering, add the spinach and cook it until it is just wilted, and not a moment longer. Transfer it to a colander and press as much of the excess water out with the back of a fork as possible. No need to wring it out here; we’re hoping to those lovely wilted leaves intact. Keep that fork; you’ll use it again in a moment.", 
            "Put your bread in to toast.", 
            "Dry your skillet if it is still wet. Heat a pat of butter in it over medium-low heat. Add shallots and cook them for a few minutes, until translucent and a little sweet. Return spinach to skillet and add cream. Simmer them together for one minute, then season with salt and freshly ground black pepper.", 
            "Put your toast on your plate and spread it thinly with Dijon mustard. Heap the spinach-and-shallot mixture on top, then add the crumbled cheese. Peel your egg; doing so under running water can make this easier. Once peeled, place it on your spinach toast, smash it open with the back of that fork you used a minute ago, and sprinkle it with salt and freshly ground black pepper. Eat immediately.", 
            "* When you’re eating a soft-boiled egg right away, six minutes is the way to go. But here, since we boil the egg and then prepare the rest of the toast, it continues to cook and firm up a bit in its shell, so I’ve found that a 5 to 5 1/2 minute egg will give you the equivalent in the end."
        ], 
        "date": "2013-04-09T11:41:57+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3-ounce package cream cheese, room temperature", 
            "1/3 cup half and half (or milk)", 
            "3 eggs", 
            "1 10-ounce package frozen chopped spinach, thawed and drained", 
            "1/2 cup grated cheddar (gruyere works well, too)", 
            "1/4 cup grated Parmesan", 
            "4 to 6 green onions, thinly sliced (1/2 cup finely diced red or white onion or shallots work as well)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spinach-quiche-revisited1.jpg?w=640", 
        "tags": [
            "Easter", 
            "Freezer Friendly", 
            "Photo", 
            "Picnics", 
            "Spinach", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2008/09/spinach-quiche-revisited/", 
        "title": "spinach quiche, revisited", 
        "directions": [
            "Preheat oven to 425°. Beat cream cheese in medium bowl until smooth. Gradually beat in half and half and eggs. Mix in remaining ingredients. Pour mixture into prepared crust. Bake until crust is golden brown and filling is set, about 25 minutes. Cool 10 minutes before serving."
        ], 
        "date": "2008-09-14T12:58:55+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces baby spinach", 
            "2 large white mushrooms, thinly sliced", 
            "1/4 small or medium red onion, very thinly sliced", 
            "1 large egg, hard-boiled (see above), chilled, peeled and thinly sliced", 
            "4 pieces thick-sliced bacon (about 4 ounces), finely diced", 
            "2 tablespoons red wine vinegar", 
            "1/2 teaspoon honey or sugar", 
            "1/2 teaspoon smooth Dijon mustard", 
            "Coarse salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/spinach-salad-with-warm-bacon-vinaigrette1.jpg?w=750", 
        "tags": [
            "Mushrooms", 
            "Photo", 
            "Salad", 
            "Spinach"
        ], 
        "url": "https://smittenkitchen.com/2012/11/spinach-salad-with-warm-bacon-vinaigrette/", 
        "title": "spinach salad with warm bacon vinaigrette", 
        "directions": [
            "Place spinach in a large, wide salad serving bowl. Scatter with mushrooms, red onion (see above for a different, mellower way to add the onions) and coins of hard-boiled egg. In a large skillet, fry bacon bits over medium-high heat until they’re brown and crisp and have rendered their fat. Use a slotted spoon to scoop them out of the skillet and spread them on a piece of paper towel briefly before sprinkling them over the salad. Pour out all but two tablespoons of hot bacon fat from the skillet. Reheat over medium and quickly whisk in the red wine vinegar, honey and Dijon. Pour over entire salad and season salt and pepper. Toss gently and serve hot. Repeat tomorrow night."
        ], 
        "date": "2012-11-23T13:27:45+00:00"
    }, 
    {
        "ingredient_list": [
            "1 2/3 cups (215 grams) all-purpose flour", 
            "3/4 teaspoon kosher salt", 
            "12 tablespoons (170 grams) cold unsalted butter, diced", 
            "3 tablespoons (45 grams) very cold water", 
            "Nonstick spray oil, for coating pan", 
            "3/4 cup (176 grams, 6 ounces, or 3/4 of an 8-ounce brick) cream cheese, soft at room temperature", 
            "2/3 cup (155 ml) half-and-half or 1/3 cup each whole milk and heavy cream", 
            "6 large eggs", 
            "2 10-ounce (283-gram) packages frozen chopped spinach, thawed", 
            "1 cup (115 grams or 4 ounces) grated cheddar or gruyere", 
            "1/2 cup (50 grams) finely grated Parmesan", 
            "1 small bundle (2 to 3 ounces or about 8 thin green onions) thinly sliced", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/spinach-sheet-pan-quiche.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Casserole", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Spinach", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/11/spinach-sheet-pan-quiche/", 
        "title": "spinach sheet pan quiche", 
        "directions": [
            "Make crust: In a food processor, blend flour and salt together. Add butter and pulse machine until butter is reduced to a fine meal, or couscous-sized bits. While running machine, drizzle in water; stop when dough has balled, a few seconds later.\nWrap dough in plastic or waxed paper and set in freezer to quick-chill until firm but not rock-hard, about 15 to 20 minutes. You can also chill it in the fridge for 2 hours or up to 1 week until needed.\nLightly coat a 9×13-inch (quarter-sheet) pan with oil. Line bottom with parchment paper.\nTo roll out crust (trickier, but go for it if you’re up for the challenge): Flour your counter well. Remove crust from freezer or fridge, unwrap and flour the top of it. Even if it’s very hard, begin rolling it very gently, in light motions, so it doesn’t crack too much as you stretch it out, to about a 12×16-inch rectangle. Keep flouring top and counter underneath dough as it is prone to sticking. Work as quickly as possible because this dough softens even more than regular pie dough as it warms.\nTransfer dough to prepared pan. Lift overhang to let dough slack/droop into corners so you’re not stretching it a lot to shape it to the pan. Trim overhang to 1/2- to 1-inch, then fold overhang onto sides of dough, pressing all around and letting the dough extend slightly over the edge of the pan.\nTo press in crust (less tricky, and what I always wish I’d done): Press dough in an even layer across bottom of pan; leave it thicker as it goes up the sides; pressing all around and letting the dough extend slightly over the edge of the pan.\nBoth methods: Freeze shaped dough until solid, about 20 minutes. Save your scraps! You can use them to patch any holes or cracks formed when baking.\nMeanwhile, heat oven to 425 degrees F. Coat a large sheet of foil lightly with spray oil. Once crust is solid, prick it all over with a fork and press foil, oiled side down, tightly against dough. Fill foiled crust to the top with pie weights, dried beans or rice (that you don’t plan to eat at any time) or even pennies. Bake for 20 minutes then gently, carefully remove foil and weights and bake for 5 more minutes, unfilled.\nWhile crust par-bakes, make filling: Use an electric mixer or your best whisking skills to beat cream cheese in the bottom of a large bowl until smooth and fluffy. Gradually drizzle in half-and-half, whisking the whole time so that the mixture incorporates smoothly. Whisk in eggs, two at a time, until combined. Squeeze out spinach in handfuls, removing as much extra moisture as possible. Stir in spinach, cheddar, parmesan, scallions, salt and pepper.\nWhen crust has finished parbaking, leave oven on. Inspect crust for cracks or holes and use reserved dough to patch them if necessary. Pour in filling just to the top of the crust. You will probably have about 3/4 cup more filling than you can fit in the crust (not an issue if going crust-less or if you didn’t parbake the crust); you can bake this off in a separate oiled dish for an excellent breakfast on toast tomorrow.\nBake quiche until crust is golden brown and filling is set, about 25 minutes. Cool at least 10 minutes before serving. Quiche keeps in fridge for 4 to 5 days."
        ], 
        "date": "2016-11-28T13:12:54+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds fresh spinach", 
            "3 1/2 to 4 1/2 tablespoons unsalted butter", 
            "Salt and pepper", 
            "1 1/2 tablespoons flour", 
            "1 cup stock (your choice; Julia recommends beef) or cream (I used stock; it doesn’t *need* cream)", 
            "3/4 cup grated Swiss cheese", 
            "2 tablespoons fine, dry breadcrumbs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/03/best-baked-spinach.jpg?w=751", 
        "tags": [
            "French", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Spinach", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/03/the-best-baked-spinach/", 
        "title": "the best baked spinach", 
        "directions": [
            "Stem and wash your spinach (see Tips below) well but no need to spin or pat it dry. Place spinach in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 2 to 4 minutes for baby spinach and 4 to 6 minutes for regular spinach. Transfer to a colander, immediately fill pot with cold water, transfer it back to the pot of cold water to shock it (stop the cooking) and drain again. Squeeze a small amount of the spinach at a time in your hands to extract as much water as possible. Chop the spinach coarsely. You should have about 3 cups of chopped spinach, or about 1 cup per pound.", 
            "Wipe out pot then melt 2 tablespoons butter over moderately high heat and stir in the spinach. Cook for 2 to 3 minutes or until all of the moisture from the spinach has boiled off — you’ll know you’re done when the spinach begins to stick to the pan.", 
            "Lower the heat and sprinkle with flour and stir for 2 minutes to cook the flour. Add 2/3 of your stock or cream, a tiny bit at a time, scraping up any stuck spinach as you do. Once the liquid is added, simmer for another minute or two, stirring frequently to prevent sticking. If you’re feeling especially indulgent, stir in one more tablespoon of butter. If needed, add all or part of remaining liquid. Season with salt (I found 1/2 teaspoon table salt about right) and pepper.  ", 
            "Preheat oven to 375 degrees. Lightly butter a shallow 1-quart baking dish. Stir 1/2 cup cheese into the spinach and pour it into the baking dish. Mix the remaining cheese with breadcrumbs and sprinkle on spinach. Melt 1 1/2 tablespoons remaining butter and pour it over the top. Bake until heated through and slightly brown on the top, about 30 minutes.", 
            "Serve with steaks, chops, veal, chicken, broiled fish or, if you’re us, eggs, glorious eggs.", 
            "Do ahead: Spinach can be blanched and chopped several hours or a day in advance. Cover and refrigerate until needed. Gratin can be fully assembled and 30 minutes before needed, placed in a preheated 375 degree oven to bake, then served.", 
            "To stem spinach, as per Julia: If spinach is young and tender, remove the stems at the base of the leaf. If more mature, fold the leaf vertically with its underside up, grasp the leaf in one hand and the stem in the other and and rip it off toward the tip of the leaf, removing the stem and the tough tendrils. Discard any wilted or yellow leaves.", 
            "How I wash greens: Fill a large bowl or basin with cold water. Drop in the spinach and swish it around a few times so it deposits any sand and grit before lifting it out of the bowl (leaving any grit/dirt at the bottom of the bowl and not dragging the clean leaves through it) and drop it in a colander. No need to dry it for this recipe, but in others, I either spread it out on towels or run it through a salad spinner."
        ], 
        "date": "2011-03-08T19:45:59+00:00"
    }
]