[
    {
        "ingredient_list": [
            "2 teaspoons fennel seeds, toasted", 
            "1/4 cup olive oil", 
            "3 tablespoons fresh lemon juice", 
            "3 tablespoons finely chopped shallot (1 large)", 
            "1 teaspoon salt", 
            "1/2 teaspoon sugar", 
            "1/2 pound frisée (French curly endive), torn into bite-size pieces (10 cups) [we swapped butter lettuce]", 
            "3 Belgian endives, cut crosswise into 1/2-inch-wide slices [we swapped regular green endives]", 
            "1 bunch of celery ribs, thinly sliced crosswise (1 to 2 cups, depending on the size of your bundle)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/endive-and-celery-salad-with-fennel-vinaigrette1.jpg?w=500", 
        "tags": [
            "Celery", 
            "Endive", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/05/endive-and-celery-salad-with-fennel-vinaigrette/", 
        "title": "endive and celery salad with fennel vinaigrette", 
        "directions": [
            "In addition: Either an electric coffee/spice grinder or exceptional skill crushing spices in a mortar and pestle", 
            "Grind fennel seeds in grinder until ground but not powdery. Transfer to a small bowl or cup, then stir in oil until combined. Let stand 15 minutes.", 
            "Whisk together lemon juice, shallot, salt, and sugar in another small bowl or cup until salt and sugar are dissolved. Stir fennel oil, then add to shallot mixture in a slow stream, whisking until combined.", 
            "Toss lettuces and celery in a large bowl with just enough vinaigrette to coat. Season with black pepper to taste.", 
            "Pairing: I think this salad would be fantastic with maybe some shards of your favorite hard cheese and a poached egg on top, should those of you out there not be at a point in your lives when runny yolks are verboten. (Sniffle.)"
        ], 
        "date": "2009-05-06T15:58:59+00:00"
    }, 
    {
        "ingredient_list": [
            "3 oranges (I used 2 navel and one cara cara orange)", 
            "2 heads of endive", 
            "2 ounces soft goat cheese or chevre, crumbled", 
            "1/3 cup sliced almonds or chopped marcona almonds, well-toasted", 
            "Freshly ground black pepper", 
            "Olive oil for drizzling", 
            "Sherry vinegar", 
            "1 tablespoon minced chives", 
            "Flaky or other sea salt, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/endives-with-oranges-and-almonds1.jpg?w=750", 
        "tags": [
            "Citrus", 
            "Endive", 
            "Gluten-Free", 
            "Orange", 
            "Photo", 
            "Salad", 
            "Spanish", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/endives-with-oranges-and-almonds/", 
        "title": "endives with oranges and almonds", 
        "directions": [
            "Cut the top and bottom off your oranges, exposing the citrus flesh inside. Then, resting on either end, cut the peels, including the white pith, off the oranges. [Set aside for orangettes!] Use your knife to cut between each membrane and orange segment, cutting only so far as the center, which should release the orange segments. You can chop them once or twice more, so the pieces are not too large. ", 
            "Trim end off endives and arrange individual leaves on a medium platter. Add a few orange chunks to each, then goat cheese crumbles and almonds. Season with black pepper, then drizzle with a very thin stream of olive oil. Add a few droplets of sherry vinegar to each “boat.” Scatter chives over and finish each with sea salt. ", 
            "Dig in. No forks needed, unless you’re classy."
        ], 
        "date": "2014-12-15T11:50:02+00:00"
    }
]