[
    {
        "ingredient_list": [
            "2 cups diced (1/4 inch) cantaloupe (from a 2 1/4-lb piece)", 
            "1/4 cup diced (1/4 inch) sweet onion (such as Vidalia) or red onion", 
            "2 tablespoons chopped fresh basil or cilantro", 
            "1 (2-inch-long) fresh hot red or green chile (skip the seeds if you want to dim the heat), minced", 
            "2 tablespoons fresh lime juice", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/cantaloupe-salsa.jpg?w=752", 
        "tags": [
            "Cantaloupe", 
            "Fruit", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2009/07/cantaloupe-salsa/", 
        "title": "cantaloupe salsa", 
        "directions": [
            "Mix everything and eat immediately. "
        ], 
        "date": "2009-07-28T21:42:29+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups chopped or balled melon (from about 1 cantaloupe or honeydew, or 1/4 a large watermelon)", 
            "Juice of half a lime, divided, plus more to taste", 
            "Coarse salt, to taste", 
            "1/2 to 1 teaspoon chili powder", 
            "3 tablespoons crumbled cotija cheese", 
            "1 tablespoon toasted pepitas (I like the salty ones)", 
            "1 tablespoon chopped fresh cilantro, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_4945.jpg?w=750", 
        "tags": [
            "Cantaloupe", 
            "Honeydew", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Tex-Mex", 
            "Vegetarian", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2016/08/chile-lime-melon-salad/", 
        "title": "chile-lime melon salad", 
        "directions": [
            "Place melon in a wide bowl or on a platter. Squeeze half lime juice over, adding second half to taste, then sprinkle with salt and chili powder. Scatter with cheese, pepitas and cilantro and dig in.", 
            "Do ahead: I’d expected this salad not to keep at all but we found it just fine (with no watery run-off) after 2 hours in the fridge. I wouldn’t keep it assembled too much longer, though. You don’t want the salt to draw the juices out of the fruit before you eat it, and it’s quick enough to put together at the last minute.\n"
        ], 
        "date": "2016-08-09T11:39:50+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (4-pound*) cantaloupe or honeydew melon, seeded and cut into 1-inch cubes (about 8 cups)", 
            "1 1/2 cups water", 
            "1 to 2 tablespoons fresh lime juice", 
            "1 tablespoon sugar (optional, I skipped this)", 
            "1/4 teaspoons salt", 
            "1 quart chilled club soda or seltzer"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/melon-agua-fresca1.jpg?w=500", 
        "tags": [
            "Cantaloupe", 
            "Drinks", 
            "Honeydew", 
            "Photo", 
            "Picnics"
        ], 
        "url": "https://smittenkitchen.com/2009/08/melon-agua-fresca/", 
        "title": "melon agua fresca", 
        "directions": [
            "Garnish: lime wedges or melon slices", 
            "Purée melon in batches with water in a blender or food processor, however, if you use the latter be extra careful as the food processor does not excel in handling large amounts of liquid.", 
            "Transfer to a colander lined with a kitchen towel (not terry cloth) or fine cheesecloth set over a deep bowl and let drain about one hour. Gather ends of towel and very gently squeeze any remaining juice from melon, then discard solids. Stir in lime juice, sugar, and 1/4 tsp salt and chill for another hour.", 
            "Divide among 8 (10-ounces) glasses and top off with club soda. Or vodka. Look, I know some of you are going to anyway; just don’t forget to share.", 
            "Do ahead: Drinks, without club soda, can be made 4 days ahead and chilled. Add soda just before serving.", 
            "* My cantaloupe weighed 2 pounds, my honeydew weighed 7 1/2. I suppose that perfect four-pound melon specimens exist, just certainly not where I shop!"
        ], 
        "date": "2009-08-20T11:48:06+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (6 ounces or 170 grams) unsalted butter, plus additional for greasing pan", 
            "1 1/2 cups (6 3/4 ounces or 190 grams) all purpose flour", 
            "2 teaspoons (9 grams) baking powder", 
            "3/4 teaspoon (4 grams) salt", 
            "Pinch of allspice", 
            "1 cup (7 ounces or 200 grams) sugar", 
            "2 large eggs", 
            "2/3 cup whole milk or buttermilk", 
            "1 1/2 pounds nectarines, halved, pitted and cut into 1/2-inch thick wedges (about 4 cups)", 
            "1 tablespoon lemon juice", 
            "Streusel", 
            "Reserved butter from cake (above)", 
            "1/2 cup (3 1/2 ounces or 100 grams) sugar", 
            "1/2 cup (2 1/4 ounces or 64 grams) all purpose flour", 
            "1/4 teaspoon cinnamon", 
            "Pinch of salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/4833941545_0c7c5409a1_o-1.jpg?w=751", 
        "tags": [
            "Brown Butter", 
            "Cake", 
            "Cookbooks", 
            "Everyday Cakes", 
            "Nectarine", 
            "Photo", 
            "Picnics", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/07/nectarine-brown-butter-buckle/", 
        "title": "nectarine brown butter buckle", 
        "directions": [
            "Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns. Set aside and let cool (the fridge will hasten this along).", 
            "Prepare you pan: Preheat oven to 350°F. Line the bottom of a 10-inch round cake pan, springform or cast iron skillet with parchment paper and butter the paper and rest of the pan generously; set aside.", 
            "Make the cake: Whisk flour, baking powder, salt and allspice in medium bowl to blend. In a large bowl, whisk together 1/2 cup cooled browned butter (set aside remaining 1/4 cup for topping), sugar and then eggs, one at  a time. Stir in milk or buttermilk. Stir dry ingredients into this wet mixture; mix until just combined and spread batter in prepared pan. Toss nectarine wedges with lemon juice and arrange them in a single layer on top of the batter.", 
            "Make the streusel and bake the cake: Stir remaining brown butter, sugar, flour, cinnamon and salt together until large crumbs form. Sprinkle the nectarine-topped batter with crumbs. Bake until top is golden brown and tester inserted into center comes out with moist crumbs, about 40 to 45 minutes. Let cool in pan for 5 minutes before flipping out onto a cooling rack."
        ], 
        "date": "2010-07-28T10:13:53+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup unbleached all-purpose flour", 
            "1/2 teaspoons sugar", 
            "1/8 teaspoon salt", 
            "6 tablespoons (3/4 stick or 3 ounces) unsalted butter, chilled, cut into 1/2–inch pieces", 
            "Filling", 
            "1 tablespoon ground almonds", 
            "1 tablespoon flour", 
            "1/4 cup plus 3 tablespoons sugar", 
            "1 tablespoon amaretti, pulverized — or — 1 extra tablespoon ground almonds plus an extra teaspoon sugar", 
            "10 ounces galette dough, rolled into a 14-inch circle and chilled", 
            "1 and 1/2 pounds ripe nectarines (about 4 large)", 
            "1 tablespoon unsalted butter, melted", 
            "1/4 cup sliced almonds (optional)", 
            "Peach or nectarine jam (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/nectarine-galette1.jpg?w=500", 
        "tags": [
            "Fruit", 
            "Nectarine", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2009/08/nectarine-galette/", 
        "title": "nectarine galette", 
        "directions": [
            "Make the crust: Combine the flour, sugar, and salt in a large, wide mixing bowl. Cut in six tablespoons of the butter with a pastry blender or two knives, mixing until the dough resembles coarse cornmeal. Dribble four tablespoons ice water over the mixture, using a rubber spatula to pull the mixture together. Gather the dough into a mound (either in the bowl or on a counter) and gently knead it together, for just a few seconds. If it’s not coming together, add ice water, a tablespoon at a time, until it does. Wrap dough in a flat disc in plastic and refrigerate for at least 30 minutes before rolling out.", 
            "When you are ready to roll out the dough, take one disk and let it soften slightly so that it is malleable but still cold. On a lightly floured surface, roll out the disk into a 14-inch circle about 1/8 inch thick. Transfer the dough to a parchment-lined baking sheet and refrigerate at least 1/2 hour before using.", 
            "Make the galette: Preheat the oven to 400 degrees. Place a pizza stone, if you have one, on a lower rack. Toss the ground almonds, flour, one tablespoon of the sugar, and pulverized amaretti (or mix of extra ground almonds and sugar) together.", 
            "Remove the prerolled dough from the refrigerator or freezer and sprinkle the almond mixture evenly over the pastry, leaving a 1 1/2 to 2-inch border uncoated. Cut nectarines in half, removing pits, then each half into thirds (you’ll get six wedges per nectarine). Arrange the fruit, skin-side-down, in concentric circles on the dough, making a single layer of snugly touching pieces, leaving the border bare. Sprinkle 1/4 cup of the sugar evenly over the fruit.", 
            "While rotating the tart, fold the border of exposed dough up and over itself at regular intervals, crimping and pushing it up against the fruit. Pinch or trim off any excess dough. (Make sure there are no breaks that will let juices leak.) Brush the border with melted butter, and sprinkle it with two tablespoons sugar.", 
            "Bake in the lower third of the oven (preferably on a pizza stone) for about 45 to 50 minutes, until the crust is well browned and its edges are slightly caramelized. If you wish, sprinkle sliced almonds over the galette 15 minutes before the baking time ends, so they get toasty and extra-crisp. As soon as the galette is out of the oven, use a large metal spatula to slide it onto a cooling rack, to keep it from getting soggy. Let cool for 20 minutes. If you want to glaze the tart, brush the fruit lightly with a little warmed peach (or nectarine, if you have it) jam. Serve warm, with vanilla ice cream or with plain yogurt.", 
            "Do ahead: This galette keeps at room temperature for at least two days, and even longer in the fridge. The unbaked dough, wrapped in plastic, will keep in the freezer for a few weeks, the fridge for a day or more. Rolled-out dough may be frozen and used the next day."
        ], 
        "date": "2009-08-30T12:35:26+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "37 gingersnap cookies, coarsely broken (about 9 ounces; about 3 1/4 cups plus 2 tablespoons of pieces)", 
            "6 tablespoons unsalted butter, melted", 
            "Filling", 
            "1 8-ounce container mascarpone cheese", 
            "6 ounces cream cheese, room temperature", 
            "1/4 cup sour cream", 
            "1/4 cup sugar", 
            "1 teaspoon grated lemon peel", 
            "1/4 teaspoon vanilla extract", 
            "1 tablespoon finely chopped crystallized ginger (optional)", 
            "Topping", 
            "4 to 5 small nectarines, halved, pitted, cut into thin slices", 
            "1/4 cup peach jam, warmed", 
            "2 tablespoons finely chopped crystallized ginger (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2691000910_676f814784_o.jpg?w=750", 
        "tags": [
            "Fruit", 
            "Nectarine", 
            "Photo", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/07/nectarine-mascarpone-and-gingersnap-tart/", 
        "title": "nectarine, mascarpone and gingersnap tart", 
        "directions": [
            "For crust: Preheat oven to 350°F. Finely grind gingersnaps in processor. Add butter and blend until crumbs are evenly moistened. Press mixture over bottom and up sides of 9-inch-diameter tart pan with removable bottom. (I like to use a cold metal measuring cup to get a nice, clear demarcation between the base and sides.) Bake crust until color darkens, pressing sides with back of spoon if beginning to slide, about 8 minutes. Cool completely.", 
            "For filling: Beat first 6 ingredients in medium bowl until smooth. Beat in crystallized ginger if you’re using it. Spread filling in prepared crust. Cover loosely and refrigerate at least 2 hours and up to 1 day.", 
            "For topping: Overlap nectarine slices atop filling in concentric circles. Brush with jam. Sprinkle with chopped crystallized ginger if you’re using it. (Mint makes an excellent garnish, if you’re skipping the ginger.) Serve, or refrigerate up to 6 hours."
        ], 
        "date": "2008-07-22T09:47:07+00:00"
    }
]