{
  "date": "2011-04-09T11:48:38+00:00",
  "directions": [
    "Melt the butter and oil together in the bottom of a 4- to 5-quart saucepan or Dutch oven over moderately low heat. Add the onions, toss to coat them in oil and cover the pot. Reduce the heat to real low and let them slowly steep for 15 minutes. They don’t need your attention; you can even go check your email.",
    "After 15 minutes, uncover the pot, raise the heat slightly and stir in the salt and sugar. Cook onions, stirring frequently, for 30 to 40 minutes until they have turned an even, deep golden brown. Don’t skimp on this step, as it will build the complex and intense flavor base that will carry the rest of the soup. Plus, from here on out, it will be a cinch.",
    "After the onions are fully caramelized, sprinkle them with flour and cook, stirring, for 3 minutes. Add the wine in full, then stock, a little at a time, stirring between additions. Season to taste with salt and pepper. Bring to a simmer and simmer partially covered for 30 to 40 more minutes, skimming if needed. Correct seasonings if needed but go easy on the salt as the cheese will add a bit more saltiness and I often accidentally overdo it. Stir in the cognac, if using. I think you should.",
    "Set aside until needed. I find that homemade onion soup is so deeply fragrant and flavor-rich that it can stand alone, but that doesn’t mean we don’t enjoy the graitinéed top once in a while. Here’s how to pull it off:",
    "Preheat oven to 325. Arrange six ovenproof soup bowls or crocks on a large, foil-lined baking sheet. Bring the soup back to a boil and divide among six bowls. To each bowl, add 1/2 teaspoon grated raw onion and a tablespoon of grated cheese. Stir to combine. Dab your croutons with a tiny bit of butter and float a few on top of your soup bowls, attempting to cover it. Mound grated cheese on top of it; how much you use will be up to you. [Julia Child, in another era, felt that 1/2 cup of grated cheese could be divided among 6 bowls. I can assure you that if you’d like your gooey bubbling cheese lid to be anything like what you get at your local French restaurant, you are looking to use more, such as a generous 1/4 cup.]",
    "Bake soups on tray for 20 minutes, then preheat broiler. Finish for a minute or two under the broiler to brown the top lightly. Grab pot holders, and serve immediately.",
    "*  Porcini or mushroom stock are a robust vegetarian substitution."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/04/french-onion-soup.jpg?w=750",
  "ingredient_list": [
    "1 1/2 pounds (680 grams or 24 ounces or about 5 cups) thinly sliced yellow onions",
    "3 tablespoons (42 grams or 1 1/2 ounces) unsalted butter",
    "1 tablespoon (15 ml) olive oil",
    "1 teaspoon (5 grams) table salt, plus additional to taste",
    "1/4 teaspoon (1 gram) granulated sugar (helps the onions to brown)",
    "3 tablespoons (24 grams or 7/8 ounce) all-purpose flour",
    "2 quarts (8 cups or 1.9 liters) beef or other brown stock*",
    "1/2 cup (118 ml) dry white wine or dry white vermouth",
    "Freshly ground black pepper",
    "3 tablespoons (45 ml) cognac or brandy (optional)",
    "To finish [Gratinée] (Optional)",
    "1 tablespoon grated raw onion",
    "1 to 2 cups (to taste) grated Swiss (I often use Gruyere) or a mixture of Swiss and Parmesan cheese",
    "1 tablespoon butter, melted",
    "12 to 16 1-inch thick rounds French bread, toasted until hard"
  ],
  "tags": [
    "Budget",
    "French",
    "Onions",
    "Photo",
    "Soup"
  ],
  "title": "french onion soup",
  "url": "https://smittenkitchen.com/2011/04/french-onion-soup/"
}