{
  "date": "2010-04-30T12:00:17+00:00",
  "directions": [
    "Place a medium sauté pan over medium-high heat, drain excess water from leeks, and add to pan. Season with salt, and sauté until leeks begin to soften, about 5 minutes, then reduce heat to medium-low. Stir in butter. Cover and cook, stirring occasionally, until leeks are very soft, about 20 minutes. Adjust salt and pepper to taste.",
    "Preheat oven to 350 degrees. While leeks are cooking, spread bread cubes on a baking sheet and bake until dry and pale gold, about 15 to 20 minutes (my already-stale brioche took less time to brown), turning pan about halfway through. Transfer to a large bowl, leaving the oven on.",
    "Add leeks, chives and thyme to the bowl of bread; toss well. In another large bowl, lightly whisk the egg and egg yolks, then whisk in milk or cream, a generous pinch of salt, pepper to taste and a pinch of nutmeg.",
    "Sprinkle 2 tablespoons shredded cheese in bottom of a buttered 9-by-5-inch loaf pan. Spread 1/2 of bread mixture in pan, and sprinkle with another 2 tablespoons cheese. Spread remaining bread mixture in pan, and sprinkle with another 1/4 cup cheese. Pour in enough milk mixture to cover bread, and gently press on bread so milk soaks in. Let rest 15 minutes.",
    "Add remaining milk mixture, letting some bread cubes protrude. Sprinkle with salt. Bake until pudding is set and top is brown and bubbling, about 55 to 65 minutes. Serve hot or cold (because I’m weird and enjoy bread pudding cold)."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/leek-bread-pudding1.jpg?w=640",
  "ingredient_list": [
    "1 cup leeks in 1/2-inch thick slices, white and light green parts only, cleaned and rinsed",
    "Kosher or coarse salt",
    "2 tablespoons (1 ounce) unsalted butter",
    "Freshly ground black pepper",
    "6 cups 1-inch-cubed crustless brioche or Pullman loaf (I used a little less than one loaf)",
    "2 teaspoons finely chopped chives (I forgot to buy these; it made me sad)",
    "1/2 teaspoons fresh thyme leaves",
    "1 large egg",
    "1 large egg yolk",
    "3 cups whole milk, heavy cream or half-and-half or a combination thereof",
    "Freshly grated nutmeg",
    "1/2 cup shredded Comté, Emmanthaler or Swiss cheese"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Easter",
    "Eggs",
    "Leeks",
    "Photo",
    "Side Dish",
    "Spring",
    "Vegetarian"
  ],
  "title": "leek bread pudding",
  "url": "https://smittenkitchen.com/2010/04/leek-bread-pudding/"
}