{
  "date": "2016-04-27T11:32:21+00:00",
  "directions": [
    "Prepare the asparagus: No need to snap off the tough ends of your asparagus. Lay a single stalk on its side on a cutting board. Holding onto the tough end, use a vegetable peeler to peel ribbons away from the tough end (and your hand) right through the soft tip. Discard the tough ends once you’re done peeling. ",
    "[As you get to the bottom of your stalk, you might find that the raised edge of your peeler is keeping the blade from shaving the asparagus as thin as you’d like. For this, I move the asparagus to the edge of the cutting board with the peeler blade half-off so you can get closer. Just be careful not to shave your cutting board. :) ]",
    "Crisp the proscuitto: If you’re using the proscuitto, heat the 12-inch ovenproof skillet you’ll use for the final frittata over medium heat. Lay slices in a single layer (will need to do this in two batches) and cook them until lightly brown underneath and curling. Flip them for another 20 to 30 seconds then transfer them to paper towels to blot off the extra oil and cool. Repeat with remaining proscuitto. You’ll use the pan again in a minute.",
    "Heat your broiler.",
    "Vigorously beat your eggs with the milk or cream, plus salt and pepper until well-combined. Stir in scallions and crumble in crisp proscuitto, if using. Gently add asparagus peels, just swishing the egg mixture over them. ",
    "Heat your skillet over medium heat and add 2 tablespoons olive oil. Let it heat fully, then swish it around so it goes up the sides of the pan. Pour in asparagus and egg mixture, nudging the asparagus around so it mostly stays level with the eggs. Crumble goat cheese over, to taste. Cook gently (lowering the heat to medium-low if needed) for about 5 minutes, until the edges are set and brown but it’s still loose and eggy on top. Transfer skillet to the broiler and cook for another 1 to 3 minutes, keeping a close eye on it, until eggs are set on top. ",
    "Let cool for 5 minutes before cutting into wedges, or longer if you’d like to eat it at room temperature."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/shaved-asparagus-frittata1.jpg?w=640",
  "ingredient_list": [
    "1/2 pound asparagus, cleaned, not trimmed",
    "2 ounces thinly sliced proscuitto (optional, see Note up top)",
    "8 large eggs",
    "2 tablespoons milk or cream",
    "1/2 teaspoon kosher salt, plus more to taste",
    "Freshly ground black pepper",
    "2 scallions, thinly sliced on the diagonal",
    "2 tablespoons olive oil",
    "2 to 4 ounces soft goat cheese, crumbled (to taste)"
  ],
  "tags": [
    "Asparagus",
    "Breakfast",
    "Brunch",
    "Eggs",
    "Gluten-Free",
    "Photo",
    "Spring",
    "Weeknight Favorite"
  ],
  "title": "shaved asparagus frittata",
  "url": "https://smittenkitchen.com/2016/04/shaved-asparagus-frittata/"
}