[
    {
        "ingredient_list": [
            "1 pound tart, firm apples such as Granny Smiths (2 large or 3 medium)", 
            "1 tablespoon lemon juice", 
            "6 tablespoons all-purpose flour", 
            "1 tablespoon granulated sugar", 
            "1/4 teaspoon cinnamon", 
            "1 teaspoon baking powder", 
            "2 large eggs", 
            "Butter (I used about 2 tablespoons)", 
            "Rich plain yogurt, sour cream or crème fraîche for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/11/apple-latkes.jpg?w=750", 
        "tags": [
            "Apple", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/11/apple-latkes/", 
        "title": "apple latkes", 
        "directions": [
            "In a small saucepan, simmer the apple juice until it is reduced by half. Add the sugar and continue to cook it until it becomes a golden brown/amber color. Add the butter and once it melts, the heavy cream and salt. Simmer for one minute and serve, with or without apple latkes."
        ], 
        "date": "2010-11-30T17:17:28+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/3 cups (290 grams) all-purpose flour", 
            "3/4 teaspoon (5 grams) table or fine sea salt", 
            "2 teaspoons (10 grams) baking powder (I prefer aluminum-free)", 
            "1 1/4 teaspoon ground cinnamon", 
            "1/4 teaspoon ground or a bunch of gratings of whole nutmeg", 
            "1/8 teaspoon ground cloves", 
            "1/2 cup (120 ml) olive oil", 
            "3/4 cup (145 grams) dark brown sugar", 
            "2 large eggs", 
            "1 cup cider (235 ml, see buying suggestions below)", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 1/2 cups packed coarsely grated carrots from about 9 ounces (2 to 2 1/2 meaty/large or 4 to 5 slim; about 255 grams) whole carrots", 
            "Olive oil or nonstick cooking spray for baking pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/carrot-cake-with-cider-and-olive-oil1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Carrots", 
            "Dairy-Free", 
            "Everyday Cakes", 
            "Muffin/Quick Bread", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/10/carrot-cake-with-cider-and-olive-oil/", 
        "title": "carrot cake with cider and olive oil", 
        "directions": [
            "Heat oven to 350 degrees. Coat a 9×5-inch loaf pan* with olive oil or a nonstick cooking spray. If yours is old and you’re nervous about the cake sticking, it cannot hurt to line yours with a fitted rectangle of parchment paper.", 
            "In a large bowl, whisk together flour, salt, baking powder, cinnamon, nutmeg and cloves. In a medium bowl, whisk together olive oil, brown sugar, eggs, cider and vanilla. Stir grated carrots into wet ingredients until evenly coated, then stir wet ingredients into dry just until no floury bits remain. ", 
            "Pour into prepared pan and bake for 60 to 70 minutes, until a skewer inserted into the center comes out batter-free. Let cool in loaf pan for 20 to 30 minutes, then remove from pan and cool the rest of the way on a rack. Loaf should keep at room temperature for a few days, and longer in the fridge. It’s even more moist on the second day.", 
            "Whatever you do, definitely avoid making a cream cheese frosting-like spread whipped together from 4 ounces of softened cream cheese, 2 tablespoons softened unsalted butter, 1/2 teaspoon vanilla extra and 6 tablespoons powdered sugar, some of which can be replaced with honey or maple syrup but will make for a softer spread. It will unquestionably compromise this cake’s dairy-free status. It might be dangerously good.", 
            "Notes: "
        ], 
        "date": "2014-10-16T11:58:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/4 cups (100 grams) rolled oats (be sure that they’re labeled gluten-free if needed; I prefer old-fashioned but any will work)", 
            "1/4 cup (20 grams) rolled oats, finely ground, or 1/4 cup oat flour", 
            "3/4 cup (60 grams) dried unsweetened shredded coconut (I used a medium grind)", 
            "1/3 cup (65 grams) uncooked millet (see alternatives up top)", 
            "1/2 teaspoon fine sea salt", 
            "1/4 teaspoon ground cinnamon (optional)", 
            "1 cup (about 140 grams) chopped dried fruit", 
            "1 cup (170 grams) chopped dark chocolate or chocolate chips", 
            "1/4 cup (65 grams) sunflower seed butter", 
            "1/4 cup olive oil or coconut oil, warmed until liquefied", 
            "1/4 cup (about 85 grams) maple syrup, honey or golden syrup"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/chocolate-chunk-granola-bars1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Dairy-Free", 
            "Freezer Friendly", 
            "Gluten-Free", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2015/06/chocolate-chunk-granola-bars/", 
        "title": "chocolate chunk granola bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Line an 8-by-8 inch square pan with two sheets of parchment paper, extending each up two sides, forming a “sling” for your bars to make them easy to remove.", 
            "In a large bowl, combine oats, oat flour or ground oats, coconut, millet, salt, cinnamon (if using), dried fruit and chocolate. In a separate, small bowl, whisk together sunflower seed butter, oil and sweetener of choice until smooth. Pour wet mixture into dry and stir until combined. Transfer to prepared pan, spreading until flat, then use an addition square of parchment paper to protect your hand as you press, press, press the ingredients tightly into all corners of the pan, until they can be pressed no flatter.", 
            "Bake for 25 to 30 minutes, until the tops are golden and the edges are light brown. Let cool completely before cutting; they’ll be even easier to cut without crumbling if you chill them in the fridge first, so feel free to cool them there. Once cool, use the parchment “sling” to lift bars from pan and transfer to cutting board. Use a sharp, serrated knife in a very gentle sawing motion to cut bars into desired sizes (I usually go for 16 2×2-inch squares). ", 
            "Bars will keep at room temperature for up to a week in an airtight container, but I prefer to freeze them, individually wrapped, until needed. They only need to be out of the freezer for about an hour to fully defrost. "
        ], 
        "date": "2015-06-25T11:25:21+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (120 ml) maple syrup, honey or half of each", 
            "1/2 cup (75 grams) coconut or brown sugar", 
            "1/4 cup (60 ml) water", 
            "1 teaspoon vanilla extract", 
            "1/4 teaspoon fine sea salt", 
            "1 1/2 teaspoons ground cinnamon (but I skipped this)", 
            "3 cups (300 grams) rolled oats (not quick-cooking)", 
            "1 1/4 cups (175 grams) almonds, chopped", 
            "1 1/4 cups (60 grams) unsweetened shredded coconut", 
            "1/2 cup (80 grams) flax seeds or chia seeds, whole or ground", 
            "1/4 cup (35 grams) sesame seeds", 
            "1/2 cup (60 grams) almond or hazelnut flour", 
            "1/3 cup (80 ml) olive, vegetable or coconut oil, or melted butter", 
            "1 large egg white, whisked until frothy"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/04/granola-bark1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Coconut", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2017/04/granola-bark/", 
        "title": "granola bark", 
        "directions": [
            "\nCombine maple syrup, sugar, water, vanilla and salt in a small saucepan and bring to a boil, stirring to dissolve the sugar and salt. Remove from heat and let cool to lukewarm.\nMeanwhile combine cinnamon (if using), oats, almonds, coconut, seeds, almond or hazelnut flour in a large bowl.\nHeat oven to 325 degrees. Line a rimmed half-sheet (13×18-inch) pan with parchment paper or a silicone mat.\nOnce liquid mixture is back to room temperature, whisk in olive oil, which will cool it further, then egg white. Pour over dry ingredients and mix well.", 
            "Spread mixture evenly across the prepared baking sheet. Press down firmly to compact it before baking, using another same-size baking sheet or the bottom of a pot. Bake for 40 to 50 minutes, until dark golden brown, rotating the sheet every 15 minutes to promote even browning. While it bakes, open the oven door a few times to release steam.\nSet on a cooling rack until surface of granola is crisp. Leave oven on. If surface is still tacky to the touch once it has cooled — although I didn’t find this at all — return the pan to the oven and continue baking for another 10 to 15 minutes, checking every 5 minutes. Don’t let it get too dark or it tastes bitter.\nOnce totally cool, break into pieces in store in an airtight container at room temperature for up to 2 weeks, or in the fridge up to 1 month.\n"
        ], 
        "date": "2017-04-17T12:05:11+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 teaspoons (1 7-gram or 1/4-ounce packet) active dry yeast", 
            "1/4 cup (50 grams) granulated sugar", 
            "3/4 cup (180 ml) lukewarm (not hot) milk", 
            "2 large egg yolks", 
            "Few gratings of orange or lemon zest, 1 teaspoon vanilla or 1/2 teaspoon almond extract", 
            "2 tablespoons (1 ounce or 30 grams) butter softened", 
            "2 1/3 cups (290 grams) all-purpose flour", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 egg white, whisked until frothy (for peskier filling method)", 
            "Vegetable oil for deep-frying, and coating bowl", 
            "1/2 to 2/3 cup jam or preserves of your choice", 
            "Powdered sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/jelly-doughnuts1.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Doughnut", 
            "Hanukah", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/12/jelly-doughnuts/", 
        "title": "jelly doughnuts", 
        "directions": [
            "Make the dough: In the bottom of a large mixing bowl, combine the yeast, sugar and milk. Let stand for 5 minutes; it should become a little foamy. Whisk in yolks, any zest or extracts you’d like to use, then butter. Don’t worry if the butter doesn’t fully combine. ", 
            "— By hand: Add half of flour and stir with a spoon until combined. Add second half of flour and salt and stir as best as you can with a spoon, then use your hands to knead the dough until it forms a smooth, elastic round, about 5 minutes. Try, if you can, to resist adding extra flour, even if it’s sticky. Extra flour always makes for tougher/dryer doughnuts and breads. Sticky hands and counters are always washable!", 
            "— With a stand mixer: Add half the flour and let the dough hook mix it in slowly, on a low speed. Add second half of flour and salt and let the dough hook bring it together into a rough dough. Run machine for 3 to 4 minutes, letting it knead the dough into a smooth, cohesive mass.", 
            "Both methods: If the dough is already in the bowl, remove it just long enough to lightly oil the bowl. Return dough to bowl, cover with plastic wrap and let rest at room temperature for 1 hour, or in the fridge overnight.", 
            "There are two ways to fill doughnuts: In the easiest method, you fill them after they’re cooked with a piping bag. The filling is usually a little imperfect, off-center or slightly messy, but it takes the least effort by far. With the peskier method, you pre-fill the doughnuts, sealing the edges; the centers will be picture-perfect and neat, but it does take longer to assemble. Both will make you a hero to anyone you make these for, promise.", 
            "— Easiest method: On a lightly floured counter, roll dough to a 1/2-inch thickness. Cut into 2-inch rounds; no need to re-roll scraps unless you wish; I like to keep the odd shapes for getting the hang of frying before cooking the final doughnuts. Or, if you’re vehemently against scraps and re-rolling, you can make small square doughnuts, which are surprisingly cute. Let cut dough rise for another 30 minutes at room temperature, loosely covered with a towel at room temperature, or in the fridge overnight, on an oiled tray, covered loosely with oiled plastic wrap (use this longer rise only if did the 1-hour rise the first time; two overnights is too much for this dough). ", 
            "— Peskier method:  On a lightly floured counter, roll dough to a 1/4-inch thickness. Cut into 2-inch rounds; no need to re-roll scraps unless you wish; I like to keep the odd shapes for getting the hang of frying before cooking the final doughnuts. Or, if you’re vehemently against scraps and re-rolling, you can make small square doughnuts, which are surprisingly cute. Brush the edges of half the cut-outs with egg white, and in the center of each, add a tiny dollop (much less than you think you’ll need) of jam. Use the remaining cut-outs to form lids. Pinch every speck of the edges together tightly, almost as if you were making ravioli; you’ll want to seal these spectacularly well. Let filled doughnuts rise for another 30 minutes at room temperature, loosely covered with a towel at room temperature, or in the fridge overnight, on an oiled tray, covered loosely with oiled plastic wrap (use this longer rise only if did the 1-hour rise the first time; two overnights is too much for this dough). ", 
            "Both methods, fry the doughnuts: Heat 2 inches of oil to 350°F (175°C) in a cast-iron frying pan (I like using one because it so delightfully re-seasons them) or heavy pot. Use your dough scraps to practice and get an idea of how quickly the doughnuts will cook. Then add about 4 doughnuts at a time to the oil, cooking on the first side until golden brown underneath, about 1 to 2 minutes, but often less so keep a close eye on them. Flip doughnuts and cook on the other side, until it, too, is golden brown underneath, about another minute. Drain doughnuts, then spread them on a paper towel-lined plate to absorb extra oil. Repeat with remaining doughnuts.", 
            "– If you haven’t filled your doughnuts yet, i.e. you’re using the easier method: When doughnuts are cool enough to handle, place jelly or jam in a piping bag with a round tip with a 1/4- to 1/2-inch opening. You can fill doughnuts from the tops or sides; I did half with each. Press the tip of the jam bag halfway into the doughnut, and squeeze in the jam until it dollops out a little from the hole. Repeat with remaining doughnuts. ", 
            "Finish doughnuts: Either generously shower doughnuts with powdered sugar on either side, shaken from a fine-mesh strainer, or roll the doughnuts gently in a bowl of powdered sugar.", 
            "Eat at once. Don’t forget to share. If eating these on the first day, leave any remaining doughnuts uncovered on a plate. These are best on the first day, but my son did not (shockingly) say no to one that had been in an airtight container at room temperature overnight for breakfast this morning, so I guess they’re not inedible on the second day. They will need to be re-powdered, however, as it absorbs into the doughnuts when they’re in a covered container. ", 
            "To make these dairy-free: You can use warm water, soy, almond or coconut milk instead of the dairy milk, and coconut oil, shortening or margarine for the butter. I made a version with both coconut milk and coconut oil, orange zest and a bit of almond extract that were a big hit."
        ], 
        "date": "2014-12-11T11:59:16+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound medium zucchini", 
            "1 large baking potato (3/4 pound), peeled", 
            "1 small onion (4 ounces), peeled", 
            "1/2 cup matzo meal", 
            "1 large egg, lightly beaten", 
            "1 teaspoon fresh lemon juice", 
            "1 1/2 teaspoons salt", 
            "1/2 teaspoon freshly ground pepper", 
            "Vegetable oil, for frying "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/latke-minus-vodka1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Photo", 
            "Summer", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2006/12/latke-minus-vodka/", 
        "title": "zucchini latkes", 
        "directions": [
            "Halve the zucchini crosswise. Cut the zucchini flesh off the seedy center and coarsely grate it in a food processor. Or grate it on a box grater until you reach the seedy center. Discard the center. In a food processor or on a box grater, coarsely grate the potato and onion. Transfer the grated zucchini, potato and onion to a colander and squeeze dry. Let stand for 2 minutes, then squeeze again. Transfer the vegetable mixture to a large bowl. Add the matzo meal, egg, lemon juice, salt and pepper and stir to combine.", 
            "In a medium skillet, heat 2 tablespoons of vegetable oil until shimmering. Drop packed teaspoons of the zucchini mixture into the skillet and flatten them with the back of a spoon. Cook the latkes over moderately high heat until the edges are golden, about 1 1/2 minutes; flip and cook until golden on the bottom, about 1 minute. Drain on paper towels. Repeat with the remaining zucchini mixture, adding more oil to the skillet as needed.", 
            "Do ahead: The fried latkes can be kept at room temperature for up to 4 hours. Reheat them on a dark baking sheet in a 375°F oven for about 5 minutes, or until warmed through and crisp."
        ], 
        "date": "2006-12-16T11:45:59+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/latke-redux1.jpg?w=500", 
        "tags": [
            "Hanukah", 
            "Jewish", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2007/12/latke-redux/", 
        "title": "latke redux", 
        "directions": [], 
        "date": "2007-12-04T17:43:13+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 to 1 pound seedless cucumber, washed and chopped into chunks", 
            "2 thin or 1 regular scallions, thinly sliced", 
            "1 large avocado, pitted and diced", 
            "2 tablespoons mayonaise", 
            "Juice of half a lime, plus more to taste", 
            "Salt and hot sauce (we used Sriracha) to taste", 
            "Chopped cilantro or flat-leaf parsley to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/17041084926_d38d46dae0_k.jpg?w=750", 
        "tags": [
            "Avocado", 
            "Cucumber", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/04/obsessively-good-avocado-cucumber-salad/", 
        "title": "obsessively good avocado cucumber salad", 
        "directions": [
            "Combine cucumber, scallions and avocado in a bowl. Whisk together mayo, lime and seasonings, adjusting levels to taste. Drizzle salad with dressing and garnish with cilantro or parsley. Repeat again tomorrow. "
        ], 
        "date": "2015-04-07T12:00:46+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1/2 pound (about 1 large) Russet potato", 
            "1 tablespoon fresh lemon juice", 
            "1 pound parsnips (about 2 large or 4 medium)", 
            "1/4 cup all-purpose flour", 
            "1 teaspoon baking powder", 
            "2 large eggs, lightly beaten", 
            "2 tablespoons chopped fresh dill", 
            "1 teaspoon table salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "Olive oil (or a mix of olive and vegetable or peanut oil) for frying", 
            "Sauce", 
            "1 cup sour cream", 
            "1 tablespoon lemon juice", 
            "1/2 teaspoon table salt", 
            "1 tablespoon freshly grated or prepared horseradish", 
            "1 tablespoon chopped dill"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/parsnip-latkes-with-horseradish-and-dill.jpg?w=749", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Parsnips", 
            "Photo", 
            "Potatoes", 
            "Snack", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/12/parsnip-latkes-with-horseradish-and-dill/", 
        "title": "parsnip latkes with horseradish and dill", 
        "directions": [
            "Preheat: Oven to 250 degrees. Line one large or two smaller baking sheets with foil and leave them in the oven until needed.", 
            "Prepare vegetables: Peel vegetables and grate them on the large holes of a box grater or (my preferred method) using the shredding blade of a food processor. If using the food processor, I like to lay the vegetables sideways in the chute, in an attempt to get the longest strands of vegetables. This creates latkes that look like little piles of mops, which is my goal.", 
            "Transfer shredded vegetables to a lint-free dishtowel or square of cheesecloth, and wring out as much liquid as possible. Let stand for two minutes, then wring again. Wetness is the enemy of crisp, light latkes, so we want to get rid of as much as possible.", 
            "Make batter: Transfer wrung-out vegetables to a large bowl. Add lemon juice. In a tiny dish, stir together the flour, baking powder, salt, pepper and any herbs or additional seasonings and toss with vegetables, evenly coating the strands. In the same tiny dish, whisk your egg(s) and then stir this into the vegetable-flour mixture, evenly coating the strands.", 
            "Prepare pan: Heat a large, heavy skillet, preferably cast iron, over medium heat. Once skillet is hot, add 3 tablespoons oil and heat oil until shimmering. If you’re unsure, you can flick a droplet of water onto the oil; if it hisses and sputters, you’re good to go.", 
            "Cook: Using a fork or your fingertips (letting the eggy batter drain off a little is good), gather spoonful-sized mounds of battered vegetables and drop them onto the heated skillet. When golden underneath, 3 to 4 minutes later, flip pancakes. [If you’re using a gas range, you’ll likely have to rotate your pancakes 180 degrees halfway through the cooking time so that they color evenly underneath.] Cook on the other side until nicely bronzed underneath, another 2 to 3 minutes, and transfer to paper towels briefly to drain pancakes, before transferring them again to tray(s) in warm oven. If latkes cook too quickly or slowly on the stove, adjust the heat accordingly.", 
            "Add more oil if needed (you want to keep the pan at that 3 tablespoon level), being sure it is heated before adding more pancakes to the skillet. Repeat with remaining batter.  I like to keep the latkes in the oven for at least 10 minutes to ensure they’ve cooked through before serving them. This gives you time to…", 
            "Make sauce: Mix sauce ingredients in a small dish. Adjust seasonings to taste.", 
            "Serve: Warm with a dollop of the sauce."
        ], 
        "date": "2011-12-22T13:13:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large or 2 small yellow onions", 
            "3 pounds or about 5 large baking — Russet or Idaho — potatoes, peeled", 
            "1/3 cup potato starch*", 
            "2 teaspoons kosher salt", 
            "Lots of freshly ground black pepper", 
            "3 large eggs", 
            "5 tablespoons olive oil, schmaltz or another oil of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/23422902976_b1b17d03a6_k.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Gluten-Free", 
            "Hanukah", 
            "Jewish", 
            "Onions", 
            "Passover", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/12/potato-kugel/", 
        "title": "potato kugel", 
        "directions": [
            "Heat oven to 350°F.", 
            "By hand: Chop onions very finely and coarsely grate potatoes.", 
            "With a food processor: Blend onions in food processor with regular blade until finely ground. Switch to grating blade and grate potatoes — I like to do this one their sides, for the longest strands.", 
            "Both methods: Place onions and potatoes in a large bowl. Sprinkle salt, pepper and starch evenly over potatoes and toss together with two forks or, as I do it, your very clean hands, evenly coating strands. Break eggs right on top and again use forks or your fingers to work them into the strands, evenly coating the mixture. ", 
            "Heat a 1/4 cup oil or fat in a 10-inch cast-iron skillet** over high heat until very hot. Pour potato-egg mixture into pan carefully (it’s going to splatter) and spread evenly in pan. I like to twist and tousle the top strands a little for a pretty final texture on top. Drizzle with last tablespoon of oil. Bake in heated oven for 75 to 80 minutes, until browned on top and tender in the middle. If top browns too quickly, before center is baked, cover with foil for all but the last two minutes of baking time, though this has never been necessary in my oven.", 
            "Serve in squares, either right from the skillet or unmolded onto a platter. Kugel reheats exceptionally well in a warm oven. It keeps in the fridge for up to 4 days, and much longer (months, even) in the freezer. I like to defrost it in the fridge before rewarming it in an oven. ", 
            "* Cornstarch works too. As does flour. Matzo meal is traditional. I like potato starch because it’s the least distracting and lightest. I buy mine from Bob’s Red Mill; usually in a section with other BRM products at just about any store these days (hooray).", 
            "** Without a cast-iron — Use a casserole baking dish. Just heat the oil first so it’s hot when the potato mixture lands in it. (You can do this in the oven, but it will take a good 5 minutes to get very hot. Might as well do it in 60 seconds on the stove.)"
        ], 
        "date": "2015-12-01T12:05:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large baking potato (1 pound), peeled", 
            "1 small onion (4 ounces), peeled", 
            "1/4 cup all-purpose flour", 
            "1 large egg, lightly beaten", 
            "1 teaspoon salt", 
            "1/4 teaspoon freshly ground pepper", 
            "Peanut oil, for frying"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/potato-latkes1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Photo", 
            "Potatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/12/potato-pancakes-even-better/", 
        "title": "potato pancakes, even better", 
        "directions": [
            "In a food processor or on a box grater, coarsely shred the potato and onion. For longer strands, lay the potato sideways in the chute of your food processor. Transfer to a colander or wrap in a cheesecloth sling, and squeeze as dry as possible. Let stand for 2 minutes, then squeeze dry again.", 
            "In a large bowl, whisk the flour, egg, salt and pepper together. Stir in the potato onion mixture until all pieces are evenly coated.", 
            "In a medium skillet, heat 2 tablespoons of vegetable oil until shimmering. Drop packed tablespoons of the potato mixture into the skillet and flatten them with the back of a spoon. Cook the latkes over moderately high heat until the edges are golden, about 1 1/2 minutes; flip and cook until golden on the bottom, about 1 minute. Drain on paper towels. Repeat with the remaining potato mixture, adding more oil to the skillet as needed.", 
            "Do ahead: Latkes are a do-ahead-er’s dream. You can also keep latkes warm in the oven for an hour or more, if you’re waiting for stragglers to arrive. Cooked, they keep well in the fridge for a day or two, or in the freezer, well wrapped, for up to two weeks. Reheat them in a single layer on a cookie sheet in a 400 degree oven until they’re crisp again. Bonus: If you undercooked them a bit or didn’t get the browning on them you’d hoped for, you can compensate for this in the oven. "
        ], 
        "date": "2008-12-21T20:54:03+00:00"
    }, 
    {
        "ingredient_list": [
            "4 teaspoons fine sea or table salt", 
            "6 to 8 (1 kilo) small to medium Yukon Gold potatoes, peeled", 
            "1 medium yellow onion, diced", 
            "1/2 teaspoon freshly ground black pepper", 
            "4 to 5 tablespoons olive oil", 
            "About 1 tablespoon fresh rosemary leaves", 
            "2 cups minus 1 tablespoon (250 grams) all-purpose or bread flour", 
            "1 1/4 teaspoons (5 grams) instant or active dry yeast", 
            "A heaped 1/4 teaspoon fine sea or table salt", 
            "A heaped 1/4 teaspoon granulated sugar", 
            "2/3 cups (150 grams) room temperature water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/potato-pizza-pizza-con-potate1.jpg?w=640", 
        "tags": [
            "Dairy-Free", 
            "Photo", 
            "Pizza", 
            "Potatoes", 
            "Vegan", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/04/potato-pizza-even-better/", 
        "title": "potato pizza, even better", 
        "directions": [
            "In a medium bowl, stir together the flour, yeast, salt, and sugar. Add the water and, using a wooden spoon or your hand, mix until well blended, about 30 seconds. Cover the bowl and let sit at room temperature until the dough has more than doubled in volume, about 2 hours. Continue using instructions above."
        ], 
        "date": "2016-04-04T12:04:43+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "2 cups (260 grams) all-purpose flour", 
            "1/2 teaspoon fine sea or table salt", 
            "1/2 pound (225 grams) unsalted butter", 
            "1/2 pound (1 8-ounce or 225-gram package) cream cheese", 
            "Filling", 
            "2/3 cup (135 grams) granulated sugar", 
            "1 1/2 tablespoons ground cinnamon", 
            "1/3 cup miniature chocolate chips or finely chopped bitter- or semi-sweet chocolate", 
            "1/3 cup toasted nuts, chopped small (I used walnuts)", 
            "1/3 cup dried fruit, chopped small; (I used tiny dried currants, no chopping needed)", 
            "1/2 to 3/4 cup jam (I used seedless raspberry, apricot is more traditional)", 
            "Finish", 
            "1 egg beaten with 1 teaspoon water or milk", 
            "Remaining cinnamon-sugar from above"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/pull-apart-rugelach-e14492472877211.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Hanukah", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/12/pull-apart-rugelach/", 
        "title": "pull-apart rugelach", 
        "directions": [
            "Make the dough:", 
            "In a food processor: Place flour and salt in work bowl fitted with standard blade. Pulse to combine. Add cream cheese, chopped into large chunks, and run machine until it’s fully dispersed into the flour. Add butter in large chunks and run machine until dough starts to clump. Dump out onto a large piece of plastic wrap and form into a flattish disc. ", 
            "With a mixer: Let butter and cream cheese soften at room temperature. Beat both together until light and fluffy. Beat in salt. Add flour, beating until it disappears. Scrape dough onto a large piece of plastic wrap and form into a flattish disc.", 
            "Both methods: Chill dough until totally firm — about 2 hours in the fridge you can hasten this along in the freezer for about 30 minutes. (Dough keeps in fridge for up to a week, and in freezer much longer.)", 
            "Form the pastries: ", 
            "Heat oven to 350 degrees F and line a couple baking sheets with parchment paper or nonstick baking mats.", 
            "Stir cinnamon and sugar together in a small dish. Combine coarse mixture of chocolate, nuts and dried fruit in a second dish. ", 
            "Divide dough into quarters and roll first quarter out on a floured counter into a rectangle about 12 inches wide and 7 to 8 inches long, with the wider side to you. Thinly spread dough to all but the furthest 1/4 inch from you — which seals better once rolled if bare — with about 2 to 3 tablespoons jam. (I find that with seedless raspberry, 2T covers nicely but with thicker jam, you’ll need 3T to coat it thinly. If your jam is difficult to spread, you can warm it gently in the microwave for a few seconds first.) Sprinkle with 2 tablespoons cinnamon-sugar mixture, then 4 tablespoons coarse fruit and nut mixture.", 
            "Roll dough from the 12-inch side in front of you into as tight as a log as you can, using your fingers to lightly seal the ends onto the log. Repeat with remaining logs. ", 
            "Now, choose your final shape:", 
            "To make classic, easy sliced cookies: Place log of filled dough in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. Trim ends from log so they have a clean shape. Cut log into 10 to 12 even slices. Arrange on prepared baking sheets a couple inches apart from each other. ", 
            "To make a ring of spirals: Place log of filled dough in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. Trim ends from log so they have a clean shape. Cut log into 10 to 12 even slices. Arrange them in a ring formation on prepared baking sheets so that each link touches. Do note: This will be the hardest to lift in one piece from the baking sheet once cool.", 
            "To make a pull-apart wreath: Form log into a ring, connecting the ends and smoothing the dough to seal the shape. Place ring in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. On prepared baking sheet, cut 10 to 12 evenly spaced apart notches in ring, cutting through all but the last 1/4-inch of log so it stays connected. ", 
            "To make a pull-apart log: Place log of filled dough in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. Trim ends from log so they have a clean shape. On prepared baking sheet, cut 10 to 12 evenly spaced apart notches in log, alternating sides that you cut from, cutting through all but the last 1/4-inch of log so it stays connected.", 
            "To make a split log twisted together like a babka: Don’t. It was a flopped-open mess. We couldn’t even eat it. [biggest lie, ever]", 
            "For all shapes: Brush top(s) lightly with egg wash and sprinkle with a total of 1 teaspoon of the remaining cinnamon-sugar mixture. Bake for 20 to 25 minutes, until golden brown on top. Individual cookies need to cool only a few minutes on baking sheet before they can be transferred to a cooling rack but larger rings, wreaths and logs do best if they cool at least 3/4 of the way to solidify more before attempting to carefully transfer them. ", 
            "Cooled cookies keep in a container at room temperature for a week, and in the freezer for a month. Just not around here.", 
            "More do-ahead tips: Your filled log of rugelach is also easy to freeze until needed (I did this with the two I had left). Wrap well, and you can slice it into cookies straight from the freezer, baking them while still frozen — you’ll just new a few extra minutes in the oven. "
        ], 
        "date": "2015-12-04T11:44:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups (335 grams) packed light brown sugar", 
            "2 large eggs, at room temperature", 
            "1/2 teaspoon vanilla extract", 
            "1 3/4 cups (450 grams) smooth peanut butter (see note at end)", 
            "Coarse-grained sea salt, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/salted-peanut-butter-cookies1.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Peanut Butter", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2015/10/salted-peanut-butter-cookies/", 
        "title": "salted peanut butter cookies", 
        "directions": [
            "Preheat the oven to 350°F. Line a rimmed baking sheet with parchment paper.", 
            "In a medium bowl, whisk together the light brown sugar and eggs until smooth. Whisk in the vanilla extract, then the peanut butter until smooth and completely incorporated; you shouldn’t be able to see any ribbons of peanut butter. Ovenly says you know the dough is ready when it has the consistency of Play-Doh, but I can tell you as the mom of a Play-Doh fanatic that mine was thinner, softer.", 
            "If you’d like to get those pretty striations across the top of the cookies, chill the dough by freezing it in its bowl for 15 minutes, stirring it once (so the edges don’t freeze first), before scooping it. If you’re not obsessed with these markings, you can scoop it right away. Scoop or spoon the dough into balls — Ovenly uses about a 1/4-cup scoop (probably #16); I use a 1 2/3 tablespoons or #40 scoop. Place on prepared pan. For the tallest final shape, place the tray in the freezer for 15 minutes before baking.", 
            "Sprinkle the dough balls lightly with coarse-grained sea salt just before baking. Bake smaller cookies for 14 to 15 minutes and larger for 18 to 20. When finished, cookies should be golden at edges. They’ll need to set on the sheet for a minute or two before they can be lifted intact to a cooling sheet. Trust me, you should let these cool completely before eating so the different textures (crisp outside, soft inside) can set up.", 
            "Do ahead: You can definitely make the dough in advance and either refrigerate it for a couple days or freeze it longer. However, if I were going to freeze it, I’d probably go ahead and scoop it first. You can bake them right from the freezer.", 
            "About chilling the dough: The Ovenly recipe says you can scoop and bake the cookies right away, but they keep their shape better if you chill them in the freezer for 15 minutes first. I tried it with and without and did find a better dome and final shape with the 15 minutes after. However, I was incredibly charmed by the striated marks from the cookie scoop on top of the cookie I bought last weekend, as well as in the photo in their book, and I realized that I couldn’t get it at home with just-mixed dough; you’ll get more of a blob shape from your scoop. So, I also chilled the dough for 15 minutes before scooping it and was then satisfied with the shape. It’s not necessary unless you’re as taken with top pattern as I am.", 
            "Two questions I suspect someone will ask very soon: Can you make this with all-natural peanut butter and can you make this with almond or a nut butter? The answer to both is yes, however, the authors themselves warn that you’ll get the best final shape and texture from a smooth, thick processed peanut butter like Skippy (their recommendation; updated to note, thanks to a commenter suggestion, that the 16.3-ounce jar of Skippy is estimated to contain 1 3/4 cups, saving you some measuring). I suspect an almond or cashew butter will have a similar effect as natural peanut butter. "
        ], 
        "date": "2015-10-15T11:56:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups hazelnuts", 
            "1 cup granulated sugar, divided", 
            "1/4 teaspoon fine sea or table salt", 
            "4 large egg whites", 
            "2 teaspoons instant espresso powder (optional)", 
            "8 ounces (about 1 1/3 cups) miniature chocolate chips or bittersweet chocolate, chopped small"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/ugly-but-good-brutti-ma-buoni-cookies1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Italian", 
            "Passover", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2016/01/ugly-but-good-cookies/", 
        "title": "ugly but good cookies", 
        "directions": [
            "Heat oven to 350 degrees F. Place hazelnuts on a baking sheet and toast in oven for 10 minutes, rolling around once to ensure they cook evenly. Check the color; I believe that they taste best when toasted to a real golden color. Put them back in for 2 minutes at a time and check again if they’re not there yet. Let cool completely. (Putting the tray outside in winter for all of 5 minutes does the trick.) Place nuts in a dishtowel and roll them around so that the skins largely come off. Reduce heat to 300 degrees F.", 
            "Transfer toasted, peeled hazelnuts to a food processor and add 1/4 cup sugar and the salt. Grind until they reach your desired consistency; I went for well-chopped but not fully powdery. ", 
            "In a large bowl, beat egg whites with an electric mixer until very foamy. Slowly pour in remaining 3/4 cup sugar, beating the whole time. Beat until stiff peaks form; when you lift the beater, they should flop over slightly after forming a peak. Fold in nuts, espresso powder (if using) and chocolate.", 
            "Line two large baking sheets with parchment paper or a nonstick baking mat. Scoop batter into about 1 1/2 tablespoon mounds with about an inch of space between them. Bake for 25 minutes, until very faintly golden. Let cool on baking sheet for 5 to 10 minutes, after which they’ll be easier to remove with a thin spatula. Let finish cooling on racks. ", 
            "Cookies keep at room temperature in an airtight container for a week, but only if you don’t tell anyone they’re there."
        ], 
        "date": "2016-01-07T12:11:22+00:00"
    }
]