{
  "date": "2015-12-04T11:44:06+00:00",
  "directions": [
    "Make the dough:",
    "In a food processor: Place flour and salt in work bowl fitted with standard blade. Pulse to combine. Add cream cheese, chopped into large chunks, and run machine until it’s fully dispersed into the flour. Add butter in large chunks and run machine until dough starts to clump. Dump out onto a large piece of plastic wrap and form into a flattish disc. ",
    "With a mixer: Let butter and cream cheese soften at room temperature. Beat both together until light and fluffy. Beat in salt. Add flour, beating until it disappears. Scrape dough onto a large piece of plastic wrap and form into a flattish disc.",
    "Both methods: Chill dough until totally firm — about 2 hours in the fridge you can hasten this along in the freezer for about 30 minutes. (Dough keeps in fridge for up to a week, and in freezer much longer.)",
    "Form the pastries: ",
    "Heat oven to 350 degrees F and line a couple baking sheets with parchment paper or nonstick baking mats.",
    "Stir cinnamon and sugar together in a small dish. Combine coarse mixture of chocolate, nuts and dried fruit in a second dish. ",
    "Divide dough into quarters and roll first quarter out on a floured counter into a rectangle about 12 inches wide and 7 to 8 inches long, with the wider side to you. Thinly spread dough to all but the furthest 1/4 inch from you — which seals better once rolled if bare — with about 2 to 3 tablespoons jam. (I find that with seedless raspberry, 2T covers nicely but with thicker jam, you’ll need 3T to coat it thinly. If your jam is difficult to spread, you can warm it gently in the microwave for a few seconds first.) Sprinkle with 2 tablespoons cinnamon-sugar mixture, then 4 tablespoons coarse fruit and nut mixture.",
    "Roll dough from the 12-inch side in front of you into as tight as a log as you can, using your fingers to lightly seal the ends onto the log. Repeat with remaining logs. ",
    "Now, choose your final shape:",
    "To make classic, easy sliced cookies: Place log of filled dough in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. Trim ends from log so they have a clean shape. Cut log into 10 to 12 even slices. Arrange on prepared baking sheets a couple inches apart from each other. ",
    "To make a ring of spirals: Place log of filled dough in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. Trim ends from log so they have a clean shape. Cut log into 10 to 12 even slices. Arrange them in a ring formation on prepared baking sheets so that each link touches. Do note: This will be the hardest to lift in one piece from the baking sheet once cool.",
    "To make a pull-apart wreath: Form log into a ring, connecting the ends and smoothing the dough to seal the shape. Place ring in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. On prepared baking sheet, cut 10 to 12 evenly spaced apart notches in ring, cutting through all but the last 1/4-inch of log so it stays connected. ",
    "To make a pull-apart log: Place log of filled dough in freezer for 10 to 15 minutes; it will cut more cleanly once semi-firm. Trim ends from log so they have a clean shape. On prepared baking sheet, cut 10 to 12 evenly spaced apart notches in log, alternating sides that you cut from, cutting through all but the last 1/4-inch of log so it stays connected.",
    "To make a split log twisted together like a babka: Don’t. It was a flopped-open mess. We couldn’t even eat it. [biggest lie, ever]",
    "For all shapes: Brush top(s) lightly with egg wash and sprinkle with a total of 1 teaspoon of the remaining cinnamon-sugar mixture. Bake for 20 to 25 minutes, until golden brown on top. Individual cookies need to cool only a few minutes on baking sheet before they can be transferred to a cooling rack but larger rings, wreaths and logs do best if they cool at least 3/4 of the way to solidify more before attempting to carefully transfer them. ",
    "Cooled cookies keep in a container at room temperature for a week, and in the freezer for a month. Just not around here.",
    "More do-ahead tips: Your filled log of rugelach is also easy to freeze until needed (I did this with the two I had left). Wrap well, and you can slice it into cookies straight from the freezer, baking them while still frozen — you’ll just new a few extra minutes in the oven. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/pull-apart-rugelach-e14492472877211.jpg?w=750",
  "ingredient_list": [
    "Dough",
    "2 cups (260 grams) all-purpose flour",
    "1/2 teaspoon fine sea or table salt",
    "1/2 pound (225 grams) unsalted butter",
    "1/2 pound (1 8-ounce or 225-gram package) cream cheese",
    "Filling",
    "2/3 cup (135 grams) granulated sugar",
    "1 1/2 tablespoons ground cinnamon",
    "1/3 cup miniature chocolate chips or finely chopped bitter- or semi-sweet chocolate",
    "1/3 cup toasted nuts, chopped small (I used walnuts)",
    "1/3 cup dried fruit, chopped small; (I used tiny dried currants, no chopping needed)",
    "1/2 to 3/4 cup jam (I used seedless raspberry, apricot is more traditional)",
    "Finish",
    "1 egg beaten with 1 teaspoon water or milk",
    "Remaining cinnamon-sugar from above"
  ],
  "tags": [
    "Cookie",
    "Hanukah",
    "Jewish",
    "Photo"
  ],
  "title": "pull-apart rugelach",
  "url": "https://smittenkitchen.com/2015/12/pull-apart-rugelach/"
}