{
  "date": "2016-01-07T12:11:22+00:00",
  "directions": [
    "Heat oven to 350 degrees F. Place hazelnuts on a baking sheet and toast in oven for 10 minutes, rolling around once to ensure they cook evenly. Check the color; I believe that they taste best when toasted to a real golden color. Put them back in for 2 minutes at a time and check again if they’re not there yet. Let cool completely. (Putting the tray outside in winter for all of 5 minutes does the trick.) Place nuts in a dishtowel and roll them around so that the skins largely come off. Reduce heat to 300 degrees F.",
    "Transfer toasted, peeled hazelnuts to a food processor and add 1/4 cup sugar and the salt. Grind until they reach your desired consistency; I went for well-chopped but not fully powdery. ",
    "In a large bowl, beat egg whites with an electric mixer until very foamy. Slowly pour in remaining 3/4 cup sugar, beating the whole time. Beat until stiff peaks form; when you lift the beater, they should flop over slightly after forming a peak. Fold in nuts, espresso powder (if using) and chocolate.",
    "Line two large baking sheets with parchment paper or a nonstick baking mat. Scoop batter into about 1 1/2 tablespoon mounds with about an inch of space between them. Bake for 25 minutes, until very faintly golden. Let cool on baking sheet for 5 to 10 minutes, after which they’ll be easier to remove with a thin spatula. Let finish cooling on racks. ",
    "Cookies keep at room temperature in an airtight container for a week, but only if you don’t tell anyone they’re there."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/ugly-but-good-brutti-ma-buoni-cookies1.jpg?w=640",
  "ingredient_list": [
    "1 1/2 cups hazelnuts",
    "1 cup granulated sugar, divided",
    "1/4 teaspoon fine sea or table salt",
    "4 large egg whites",
    "2 teaspoons instant espresso powder (optional)",
    "8 ounces (about 1 1/3 cups) miniature chocolate chips or bittersweet chocolate, chopped small"
  ],
  "tags": [
    "Chocolate",
    "Cookie",
    "Dairy-Free",
    "Gluten-Free",
    "Italian",
    "Passover",
    "Photo"
  ],
  "title": "ugly but good cookies",
  "url": "https://smittenkitchen.com/2016/01/ugly-but-good-cookies/"
}