{
  "date": "2008-12-02T13:03:17+00:00",
  "directions": [
    "Cut butter into four or five pieces and cook butter in a small heavy saucepan over medium heat, stirring frequently, until it has a nutty fragrance and flecks on bottom of pan turn a light brown, anywhere from 4 to 7 minutes. It helps to frequently scrape the solids off the bottom of the pan in the last couple minutes to ensure even browning. Transfer butter to a bowl and chill until just firm, about 1 hour.",
    "Beat together butter and brown sugar with an electric mixer until pale and fluffy. Beat in vanilla, then mix in flour and salt at low speed until just combined. Transfer dough to a sheet of wax paper or parchment and form into a 12-inch log, 1 1/2 inches in diameter. Chill, wrapped in wax paper, until firm, about 1 hour.",
    "Preheat oven to 350°F with rack in middle. Unwrap dough and roll it in coarse sugar, if using, and press the granules in with the paper you’d be using to wrap it. Slice dough into 1/4-inch-thick rounds, arranging 1 1/2 inches apart on an ungreased baking sheet. Bake until surface is dry and edges are slightly darker, 10 to 12 minutes. Let sit on sheet for a minute before transferring to a rack to cool. (Cookies will quite fragile at first, but will firm up as they cool.)",
    "Dough keeps, chilled, up to 1 week, or in the freezer, up to one month. Cookies keep in an airtight container at room temperature 1 week.",
    "Update 12/8/08: I am going to go ahead and put a yellow/yield light on this recipe. Although I have tested it twice, and had dreamy results both times, as have the majority of respondents, enough commenters are speaking of “spreading” or “falling apart” cookies that I want to warn you to approach this recipe more cautiously. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/brown-butter-brown-sugar-shorties1.jpg?w=500",
  "ingredient_list": [
    "1 1/2 sticks unsalted butter",
    "1/2 cup packed brown sugar (preferably dark)",
    "1 teaspoon pure vanilla extract",
    "1 1/3 cups all-purpose flour",
    "1/4 teaspoon salt (flaky salt would be great in these)",
    "Demerara sugar (Sugar in the Raw) or sanding sugar for rolling (optional)"
  ],
  "tags": [
    "Brown Butter",
    "Cookie",
    "Photo"
  ],
  "title": "brown butter brown sugar shorties",
  "url": "https://smittenkitchen.com/2008/12/brown-butter-brown-sugar-shorties/"
}