{
  "date": "2010-05-07T15:54:24+00:00",
  "directions": [
    "In a small pan, cook the butter until it browns and smells nutty (about 6 to 8 minutes). It helps to frequently scrape the solids off the bottom of the pan in the last couple minutes to ensure even browning. Strain and set aside to cool.",
    "In a food processor, pulse pecans, confectioners’ and granulated sugar until powdery. Whisk together flour, baking powder, cornmeal and salt in a large bowl and add pecan-sugar mixture to this.",
    "In a small bowl, whisk the egg whites and vanilla together, just to combine. Whisk this and the browned butter into the dry ingredients. Refrigerate batter at least three hours or overnight.",
    "Heat oven to 325 degrees. Thickly butter the sides of a 9-inch round fluted tart pan, or 9-inch springform. Line the bottom with a circle of parchment paper. Please. My gut told me to do this and I ignored it, following the recipe, and the cake stuck terribly. ",
    "Bake until golden and a tester comes out clean, about 25 minutes. Cool 10 to 15 minutes in pan, then turn out on a rack. Serve topped with berries (which you can macerate with a little sugar for a few minutes) and softly whipped cream."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pecan-cornmeal-butter-cake1.jpg?w=500",
  "ingredient_list": [
    "9 tablespoons (4.5 ounces) unsalted butter, plus extra for pans",
    "1/2 cup pecans, toasted (350°F for 10 to 13 minutes, or until browned) and cooled",
    "1 cup confectioners’ sugar",
    "2 tablespoons granulated sugar, plus extra for berries (optional)",
    "3 tablespoons all-purpose flour",
    "1 teaspoon baking powder",
    "7 tablespoons white or yellow cornmeal",
    "1/4 teaspoon kosher salt",
    "4 egg whites",
    "1 teaspoon vanilla extract",
    "Berries, for serving",
    "Ice cream or whipped cream, for serving."
  ],
  "tags": [
    "Brown Butter",
    "Cake",
    "Everyday Cakes",
    "Photo"
  ],
  "title": "pecan cornmeal butter cake",
  "url": "https://smittenkitchen.com/2010/05/pecan-cornmeal-butter-cake/"
}