{
  "date": "2011-04-23T10:38:26+00:00",
  "directions": [
    "Preheat oven to 375°F. In a small bowl, combine butter and oil. With a sharp knife or manoline, slice potatoes crosswise very thinly. Figure out what baking dish you’d like to use [see Note above]; Martha suggests a 9-inch round baking dish (a deep dish pie pan would fit this bill) though I think you could go an inch bigger, an oval 1 1/2 to 2 quart casserole dish might also be pretty. ",
    "Once you’ve picked the dish that seems the best fit for your slices, pour a tablespoon or so of the butter/oil mixture in the bottom and spread it evenly. Sprinkle the oil mixture with a few pinches of coarse salt and red pepper flakes, if using; this will allow you to season both the top and underside of the potatoes. Arrange your potato slices vertically in the dish. ",
    "Thinly slice shallots with your mandoline and slide shallot slivers between potato wedges, distributing them as evenly as possible. Brush with remaining oil/butter mixture. Generously season your dish with salt; go easier on the red pepper flakes, if using. Bake 1 1/4 hours, then arrange thyme sprigs on top and bake until potatoes are cooked through with a crisped top, about 35 minutes more. If casserole seems to brown too fast, cover it with foil to slow it down. Add any garnishes, if using, and serve immediately. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/crispy-potato-roast1.jpg?w=640",
  "ingredient_list": [
    "3 tablespoons salted or unsalted butter, melted",
    "3 tablespoons extra-virgin olive oil",
    "Coarse salt",
    "1/2 to 1 teaspoon red-pepper flakes (optional)(I used aleppo, which is milder and can therefore be used more generously)",
    "4 pounds russet potatoes, peeled (smaller diameter potatoes are great, if you can find them)",
    "4 shallots, peeled",
    "8 sprigs thyme",
    "Garnishes (optional): Bits of goat cheese, crumbles of bacon and/or bits of crisped pancetta"
  ],
  "tags": [
    "Budget",
    "Photo",
    "Potatoes",
    "Side Dish",
    "Vegetarian"
  ],
  "title": "crispy potato roast",
  "url": "https://smittenkitchen.com/2011/04/crispy-potato-roast/"
}