{
  "date": "2016-12-29T12:57:09+00:00",
  "directions": [
    "Put potatoes in a large pot, cover them with two inches of water, set them over high heat and set your time — as soon as you turn on the flame — for 25 minutes and bring to a boil. When the timer rings, the potatoes are either done or need up to 5 minutes more. If a skewer goes in them easily, they’re done. Drain and let cool until you can pick them up. Or, you can chill them for up to 2 days, until needed.\nMeanwhile, make the pimento cheese by mixing the cheddar(s), pimentos, mayo, scallions, celery salt and cayenne or hot sauce together until evenly combined. Season to taste with salt and freshly ground black pepper. Either use this right away or keep it chilled for a week, until needed.\nCover a large baking sheet with foil and lightly coat foil with nonstick spray. Heat oven to 425 degrees.\nWhen potatoes are cool enough to handle, halve lengthwise and scoop out all but the last 1/4-inch thickness of skin and potato (essentially, you want to leave a shell inside for stability). A melon baller makes easy work of this. Arrange potatoes on prepared baking sheet. Season cavities with salt and pepper. Mash the potato centers in a bowl until smooth and mix with half (3/4 cup plus 1 tablespoon) of prepared pimento cheese. Season with more salt and pepper to taste. Use a small spoon, butter knife or small offset spatula to press/pack filling back into emptied potatoes, smoothing the tops. Nestle them in the pan tightly to discourage them from toppling and spilling their contents.\nBake 15 to 20 minutes, until melty and sizzling, then run under broiler until lightly browned on top. Let cool 5 to 10 minutes before serving, garnishing with paprika and/or chives when you do.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/12/pimento-cheese-potato-bites.jpg?w=750",
  "ingredient_list": [
    "1 1/2 pounds (680 grams) baby potatoes (I used a mix of red and yellow)",
    "2 heaped cups (8 ounces or 225 grams) coarsely grated sharp cheddar cheese, ideally a mix of yellow and white",
    "1/2 cup (2.75 ounces) finely chopped drained pimentos or roasted red peppers (from 1 4-ounce jar of pimentos)",
    "1/4 cup (50 grams) mayonnaise",
    "1 to 2 scallions, finely minced",
    "1/4 teaspoon celery salt",
    "Cayenne or hot sauce, to taste",
    "Salt and freshly ground pepper",
    "Smoked hot or sweet paprika, more cayenne, chipotle powder and/or minced chives to garnish"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Photo",
    "Potatoes",
    "Side Dish",
    "Vegetarian"
  ],
  "title": "pimento cheese potato bites",
  "url": "https://smittenkitchen.com/2016/12/pimento-cheese-potato-bites/"
}