{
  "date": "2015-04-21T11:58:49+00:00",
  "directions": [
    "Clean and trim the scallions, leaving about 2 inches of green stems; I reserved the darker green tops for garnish and salad additions. Cook in boiling water until tender, about 5 minutes. Drain, wring out well, and chop finely. Place the scallions in a medium-sized bowl, add the kale, eggs, nutmeg (if using), salt, pepper, bread crumbs and potatoes and stir to combine. The batter will be loose and wet; this is just fine.",
    "Heat the oils in a large skillet over medium-high heat until very hot but not smoking. Use about 2 tablespoons batter (I used a cookie scoop that holds slightly less) per pancake, flattening them as they hit the pan. Cook until golden brown underneath, just a couple minutes, before flipping them and cooking them on the reverse side until golden and crisp as well. Drain on paper towels, but be gentle as they are still fragile. You can keep them warm in a 200 degree oven while cooking off the rest of the batter, adding more oil as needed and letting pan cool between batches if it gets too hot.",
    "Serve scattered with reserved scallion stems, if desired, topped with a crispy egg or alongside a dollop of sour cream or plain yogurt. They also make a wonderful meal with a big salad. Leftovers keep well in the fridge for a few days"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/potato-scallion-and-kale-cakes1.jpg?w=750",
  "ingredient_list": [
    "12 scallions (mine were very thin; I’d use fewer if yours are on the thick side)",
    "1 handful kale leaves, rolled in a stack and sliced into very thin ribbons",
    "2 eggs, lightly beaten",
    "1/4 teaspoon freshly ground nutmeg (I totally skipped this)",
    "1/2 teaspoon coarse or kosher salt (use less if your mashed potatoes are already seasoned)",
    "Freshly ground pepper",
    "1/3 cup fresh bread crumbs or panko (plain and lightweight)",
    "1 1/2 cups cold leftover mashed potatoes",
    "1 tablespoon olive oil",
    "2 tablespoons vegetable oil"
  ],
  "tags": [
    "Breakfast",
    "Kale",
    "Pancakes",
    "Photo",
    "Potatoes",
    "Spring",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "potato scallion and kale cakes",
  "url": "https://smittenkitchen.com/2015/04/potato-scallion-and-kale-cakes/"
}