{
  "date": "2009-11-12T17:08:23+00:00",
  "directions": [
    "Prep greens: Cook onion in 2 tablespoons butter in a wide 8-quart heavy pot over moderately low heat, stirring, until softened. Add chard stems, pinch of nutmeg, and salt and pepper to taste and cook, stirring, until vegetables are tender but not browned, about 8 minutes. Increase heat to moderately high and add chard leaves by large handfuls, stirring, until all greens are wilted. Season with salt and pepper then transfer greens to a colander to drain well and press out liquid with back of a large spoon.",
    "Make sauce: Combine cream or milk and garlic in small saucepan; bring to simmer; keep warm. Melt two tablespoons butter in a medium heavy saucepan over moderate heat and stir in flour. Cook roux, whisking, one minute, then slowly whisk in warm cream/milk and boil, whisking, one minute. Season sauce with salt and pepper.",
    "Assemble gratin: Preheat oven to 400°F. Butter deep 9×13 baking dish. Spread half of sweet potatoes in the prepared baking dish. Sprinkle with salt, pepper, a quarter of the herbs and a 1/4 cup of the cheese. Distribute half of the greens mixture over the cheese, then sprinkle salt, pepper, a quarter of the herbs and 1/4 cup of the cheese over it. Pour half of bechamel sauce over the first two layers then continue with the remaining sweet potatoes, more salt, pepper, herbs and cheese and then the remaining greens, salt, pepper and herbs. Pour the remaining sauce over the top of the gratin, pressing the vegetables slightly to ensure that they are as submerged as possible. Sprinkle with the last 1/4 cup of cheese.",
    "Bake gratin for about 1 hour until golden and bubbly, and most of the liquid is absorbed. Let stand 10 minutes before serving. ",
    "Do ahead: You can make the entire gratin but not bake it up to a day in advance and keep it in the fridge. You can also make and bake the gratin and reheat it. Gratins reheat well, but they take almost as much time to gently heat through as they do to bake in the first place, especially deep ones like this. As for reheating, already baked and frozen, I will find out very soon! But I am near-positive it will be fine."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/swiss-chard-and-sweet-potato-gratin.jpg?w=753",
  "ingredient_list": [
    "1/4 cup (1/2 stick or 2 ounces) butter",
    "1 small onion, finely chopped",
    "3 pounds Swiss chard, leaves and stems separated and both cut into 1-inch pieces",
    "Pinch of freshly grated nutmeg",
    "2 cups heavy cream or whole milk",
    "2 garlic cloves, minced",
    "2 tablespoons flour",
    "2 pounds medium red-skinned sweet potatoes (yams), peeled and cut into 1/8-inch thick rounds",
    "1 tablespoon minced fresh Italian parsley",
    "1 tablespoon minced fresh thyme",
    "Fine sea salt",
    "Freshly ground black pepper",
    "1 1/4 cups (about 5 ounces) coarsely grated Gruyére cheese"
  ],
  "tags": [
    "Casserole",
    "Fall",
    "Freezer Friendly",
    "Photo",
    "Potatoes",
    "Side Dish",
    "Swiss Chard",
    "Thanksgiving",
    "Vegetarian"
  ],
  "title": "swiss chard and sweet potato gratin",
  "url": "https://smittenkitchen.com/2009/11/swiss-chard-and-sweet-potato-gratin/"
}