{
  "date": "2010-12-20T19:50:17+00:00",
  "directions": [
    "Clean your mussels. There are a zillion ways to do this, this is mine: I put them in a big bowl of very cold water for about 10 minutes. This encourages them to expel their sand. Scoop them out (not dump, if you dump the sandy water over them, it defeats the purpose) one by one and scrub them under running water. Most cultivated mussels have the bissus (beard) removed but if one lingers, yank it toward the hinge (if you do it away from the hinge, it can kill the mussel prematurely) or cut it with a knife. Discard any mussels with chipped shells or that are not completely shut; they are more than likely dead and it’s not worth finding out if it may or may not make you sick, right?",
    "Boil your wine in a medium pot. Add the mussels, cover and steam them open over high heat until they open. You can start checking at 3 minutes, but it can take up to 6. I like to use the lid and potholders and shake them around a little from time to time, to make sure they’re getting equal access to the wine and heat.",
    "Once open, let the mussels cool. Twist off and discard one of the shells from each mussels (discard any that didn’t open), making sure that the remaining shell contains the mussel. Reserve the mussel broth for another use. Mash butter, parsley, garlic, pimenton and salt to taste in a small bowl and slather each mussel with the compound butter. Arrange them in a broiler-safe tray and chill them in the fridge until the butter is hard. [This is a great do-ahead interval, if you’d like to prepare these for when you entertain.]",
    "Preheat the broiler (or your oven to 500, if you don’t have a broiler). Broil the mussels until the butter is bubbling hot, about 2 minutes (or up to 4 in an oven). Serve immediately, with crusty bread or my favorite, baked pommes frites."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/broiled-mussels1.jpg?w=500",
  "ingredient_list": [
    "2 pounds mussels",
    "1 cup white wine (they suggest 1/2 cup but I need more to steam that volume)",
    "4 tablespoons butter, softened",
    "1 handful fresh flat-leaf parsley leaves, minced",
    "1 small clove garlic, minced",
    "4 pinches smoked paprika (pimenton)"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Photo",
    "Seafood"
  ],
  "title": "broiled mussels",
  "url": "https://smittenkitchen.com/2010/12/broiled-mussels/"
}