{
  "date": "2009-10-22T12:18:23+00:00",
  "directions": [
    "1. Preheat oven to 350 degrees. Cut cauliflower from top to bottom in 1-inch slices. Place a large ovenproof skillet over low heat and add one tablespoon butter. When it has melted, add bread crumbs and toss until toasted and golden brown, about 3 minutes. Transfer crumbs to a plate and wipe out pan.",
    "2. Return pan to medium heat and add one teaspoon olive oil. Add almonds and toss until lightly browned, 2 to 3 minutes. Season lightly with salt and pepper to taste. Transfer almonds to a plate, let cool, and cut each almond into three pieces*; set aside.",
    "3. Wipe out pan and return to medium heat. Add remaining one tablespoon olive oil and cauliflower slices. Sauté until lightly browned on both sides. Transfer pan to oven and roast until tender, about 12 minutes. (I had to brown my cauliflower in batches, not having enough surface area in my pan, but tossed everything back in to roast it.) Meanwhile, in a small saucepan over low heat, melt remaining 1/2 tablespoon butter and add raisins, vinegar and 1 tablespoon water. Simmer until raisins are plump and soft, about 5 minutes; drain and set aside. In a small bowl, combine almonds, capers, raisins, parsley, tarragon and chives. Season with salt and pepper and toss to mix.",
    "4. Arrange roasted cauliflower on a serving platter. Spoon almond-herb mixture evenly on top and sprinkle with toasted bread crumbs. Serve immediately.",
    "* I read this step and laughed and laughed. Yes, SURE. Let’s all cut our almonds into thirds! Anyone have a scalpel and some tweezers? Impossible! And then the strangest thing happened: I stopped rolling my eyes — “chef recipes!” — long enough to try it and it turns out with a sharp knife one can absolutely cut almonds into thirds. This isn’t to say that you must, unless you’re feeling fancy. You are more than welcome to cut yours into halves or fifths or even roughly chop them and I won’t tell a soul. It can be our little secret."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cauliflower-with-almonds-raisins-and-capers1.jpg?w=500",
  "ingredient_list": [
    "1 head cauliflower, trimmed of leaves",
    "1 1/2 tablespoons butter or olive oil",
    "3 tablespoons fresh soft bread crumbs",
    "1 tablespoon plus 1 teaspoon extra virgin olive oil",
    "3 tablespoons whole almonds",
    "Salt and freshly ground black pepper",
    "2 tablespoons golden raisins (I had only dark ones on hand, nobody complained)",
    "1 tablespoon white wine vinegar",
    "1 tablespoon capers, rinsed and drained",
    "1 teaspoon finely chopped parsley",
    "1 teaspoon finely chopped tarragon",
    "1 teaspoon finely sliced chives."
  ],
  "tags": [
    "Cauliflower",
    "Photo",
    "Side Dish",
    "Vegan",
    "Vegetarian"
  ],
  "title": "cauliflower with almonds, raisins and capers",
  "url": "https://smittenkitchen.com/2009/10/cauliflower-with-almonds-raisins-and-capers/"
}