{
  "date": "2015-12-29T12:01:15+00:00",
  "directions": [
    "Make the filling: Blend ingredients in a food processor until finely chopped and spreadable. Mixture will be thick. You can thin it with more olive oil if needed, but no need to make this thin like a sauce. Adjust seasonings to taste. Set aside.",
    "Heat oven to 350 degrees. ",
    "Assemble the tart: Roll first package puffed pastry flat on a large piece of parchment paper or reusable baking mat into a 12-inch circle; use a 12-inch round plate or bowl to mark the size for a clean cut. Repeat with second dough, setting one aside in the fridge until needed. ",
    "Place first round on a parchment- or nonstick mat-lined baking sheet. Spread with filling to all but 1-inch from edge. Dab edges with water and place second round on top. Set a small glass upside down in the middle. Being careful not to cut through parchment paper or baking mat, cut away from glass (i.e. not through center) in quarters, or at the 3-, 6-, 9- and 12 o’clock marks. Cut through each quarter again, making 8 strips, and again, making 16 strips, and one last time so that you have 32  “rays” of pastry emanating from the center. If at any point in the cutting the pastry feels annoyingly soft and hard to cut, just pop the tray in the freezer for a few minutes to firm it back up.",
    "Remove glass. Place finger near center of each ray (where it is most likely to break off prematurely) and gently twist each strand a few times. Beat egg yolk with 1 teaspoon water; brush it over pastry and sprinkle with seeds, if desired. ",
    "Bake for 30 to 35 minutes, until golden brown all over. ",
    "Meanwhile, make whipped feta dip: Blend all filling ingredients in a blender or food processor until smooth. Adjust seasonings to taste. Place in bowl for dipping.",
    "Remove tart from oven, let cool on baking sheet for 10 minutes then transfer to a serving platter. Tear off rays of sun, dip in whipped feta; repeat as needed."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/feta-tapenade-tarte-soleil1.jpg?w=640",
  "ingredient_list": [
    "Filling",
    "1/2 cup sundried tomatoes in oil, drained",
    "1/3 cup pitted kalamata olives",
    "1 teaspoon dried oregano or 2 teaspoons chopped fresh oregano leaves; thyme and rosemary would work too",
    "1 large garlic clove, peeled",
    "1 tablespoon olive oil or reserved oil from tomatoes, plus more to loosen if needed",
    "Salt and freshly ground black pepper or red pepper flakes to taste",
    "Assembly",
    "2 packages puffed pastry (leave in fridge overnight to thaw)",
    "1 egg yolk beaten with 1 teaspoon water (for egg wash)",
    "1 tablespoon sesame or poppy seeds to sprinkle (optional)",
    "Dip",
    "6 ounces feta, crumbled",
    "2 ounces cream cheese, cold is fine",
    "1/3 cup olive oil",
    "2 tablespoons lemon juice",
    "Coarse or kosher salt, to taste (changed from 1/2 teaspoon, which could be overkill if your feta is very salty)",
    "Freshly ground black pepper"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "French",
    "Tarts/Quiche"
  ],
  "title": "feta tapenade tarte soleil",
  "url": "https://smittenkitchen.com/2015/12/feta-tapenade-tarte-soleil/"
}