{
  "date": "2011-06-18T09:48:36+00:00",
  "directions": [
    "Pour the milk, cream and salt into a 3-quart nonreactive saucepan. Attach a candy or deep-fry thermometer. Heat the milk to 190°F, stirring it occasionally to keep it from scorching on the bottom. Turn off the heat [Updated] Remove from heat and add the lemon juice, then stir it once or twice, gently and slowly. Let the pot sit undisturbed for 5 minutes.",
    "Line a colander with a few layers of cheesecloth and place it over a large bowl (to catch the whey). Pour the curds and whey into the colander and let the curds strain for at least an hour. At an hour, you’ll have a tender, spreadable ricotta. At two hours, it will be spreadable but a bit firmer, almost like cream cheese. (It will firm as it cools, so do not judge its final texture by what you have in your cheesecloth.) Discard the whey, or, if you’re one of those crafty people who use it for other things, of course, save it. Eat the ricotta right away or transfer it to an airtight container and refrigerate until ready to use.",
    "Serve: On 1/2-inch slices of baguette that have been run under the broiler until lightly bronzed. Serve it simply [as shown in the top photo, left to right] with honey and a pinch of flaky sea salt, a couple grinds of black pepper, pinch of salt and drizzle of olive oil, and/or a few droplets of an aged balsamic. Or with zucchini ribbons [as shown in the last photo], I started with about half a pound of miniature zucchini my mother-in-law had found at Trader Joes. Larger ones will work just fine, but you might want to first cut a big one in half lengthwise. Peel them into ribbons and toss them with 1/4 teaspoon of salt and let them drain in a colander for a while (this wilts them), about 20 minutes. Rinse and pat them dry. Toss with lemon juice, olive oil, salt and black pepper to taste. Arrange in piles on ricotta crostini.",
    "Do ahead: I keep mine only 3 to 4 days; the really fresh milk I used doesn’t last long. However, Salvatore also uses really fresh milk, and theirs appears to keep closer to two weeks. In conclusion? Shelf lives will vary. Use your nose to judge freshness. Or your partner’s nose, because who doesn’t like hearing “Hey honey, sniff this for me?”"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/06/rich-homemade-ricotta.jpg?w=750",
  "ingredient_list": [
    "3 cups whole milk",
    "1 cup heavy cream (see Note above about using less)",
    "1/2 teaspoon coarse sea salt",
    "3 tablespoons freshly squeezed lemon juice"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Cheese",
    "Photo"
  ],
  "title": "rich homemade ricotta",
  "url": "https://smittenkitchen.com/2011/06/rich-homemade-ricotta/"
}