[
    {
        "ingredient_list": [
            "3 whole boneless chicken breasts with skin (about 2 1/2 pounds), halved (see Note)", 
            "1 1/2 tablespoons olive oil", 
            "3 1/2 tablespoons unsalted butter", 
            "1 onion, halved and sliced thin", 
            "3/4 pound mushrooms, sliced thin, any variety you like", 
            "1/2 cup dry Marsala", 
            "1 cup chicken broth", 
            "2 tablespoons minced fresh parsley leaves (optional, for garnish)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/03/alexs-chicken-and-mushroom-marsala.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Date Night", 
            "Gluten-Free", 
            "Mushrooms", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/03/alexs-chicken-and-mushroom-marsala/", 
        "title": "alex’s chicken and mushroom marsala", 
        "directions": [
            "Pat chicken dry and season with salt and pepper. In a large heavy skillet heat oil and 1 1/2 tablespoons butter over moderately high heat until hot but not smoking and brown chicken in 2 batches, transferring with tongs to a large plate as browned.", 
            "Discard all but 1 tablespoon fat from skillet and sauté onion and mushrooms, stirring occasionally, until liquid mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until Marsala is almost evaporated. Add broth and chicken with any juices that have accumulated on plate and simmer, turning chicken once, until cooked through, about 15 minutes. Transfer chicken with tongs to a platter.", 
            "Simmer mushroom sauce until liquid is reduced to about 1/2 cup. Remove skillet from heat and stir in remaining 2 tablespoons butter and salt and pepper to taste, stirring until butter is just incorporated. Spoon mushroom sauce around chicken and sprinkle with parsley. ", 
            "New note, 11/21/13: Tonight, I made this with boneless, skinless chicken thighs and it was fantastic — and quick, with refreshingly few ingredients. This takes well under an hour to cook, and deserves to be placed back in the weeknight rotation. "
        ], 
        "date": "2008-03-03T12:44:14+00:00"
    }, 
    {
        "ingredient_list": [
            "3 slices Italian bread, torn into small bits (1 cup)", 
            "1/3 cup milk", 
            "3 ounces sliced pancetta, finely chopped (you can swap in Canadian Bacon if you can’t find pancetta)", 
            "1 small onion, finely chopped", 
            "1 small garlic clove, minced", 
            "2 tablespoons extra-virgin olive oil, divided", 
            "1 large egg", 
            "1 pound ground chicken", 
            "2 tablespoons tomato paste, divided*", 
            "3 tablespoons finely chopped flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/baked-chicken-meatballs.jpg?w=753", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Chicken", 
            "Freezer Friendly", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2009/10/baked-chicken-meatballs/", 
        "title": "baked chicken meatballs", 
        "directions": [
            "Preheat oven to 400°F with a rack in the upper third of the oven. Soak bread in milk in a small bowl until softened, about four minutes.", 
            "Cook pancetta, onion, and garlic in one tablespoon oil with 1/2 teaspoon each of salt and pepper in a large skillet over medium heat until onion is softened, about 6 minutes. (Alternately, as in “I thought of this after the fact”, I’d bet you could render the pancetta for a couple minutes and cook the onions and garlic in that fat, rather than olive oil.) Cool slightly.", 
            "Squeeze bread to remove excess milk, then discard milk. Lightly beat egg in a large bowl, then combine with chicken, 1 tablespoon tomato paste, pancetta mixture, bread, and parsley. Form 12 meatballs and arrange in another 4-sided sheet pan (I used a 9×13 roasting dish).", 
            "Stir together remaining tablespoons of tomato paste and oil and brush over meatballs (the paste/oil does not mix in any cohesive manner, but just smoosh it on and run with it) , then bake in upper third of oven until meatballs are just cooked through, 15 to 20 minutes (though mine took a good 5 minutes longer).", 
            "* I accidentally added a heaping tablespoon of the tomato paste into the meatball mixture the first time I made it, and ended up liking it better than without it. I’d use the tomato paste on top too. It’s good both places."
        ], 
        "date": "2009-10-29T20:38:06+00:00"
    }, 
    {
        "ingredient_list": [
            "Lid", 
            "2 cups (250 grams) all- purpose flour", 
            "1/2 teaspoon fine sea or table salt", 
            "13 tablespoons (185 grams or 6 1/2 ounces) cold unsalted butter, diced", 
            "6 tablespoons (90 grams) sour cream or Greek-style yogurt", 
            "1 tablespoon (15 ml) cider vinegar", 
            "1/4 cup (60 ml) very cold water", 
            "1 egg, beaten with 1 teaspoon water, for egg wash", 
            "Filling", 
            "Salt and freshly ground black pepper", 
            "3 1/2 to 4 pounds bone-in, skin-on chicken parts (breasts, thighs and drumsticks are ideal)", 
            "1 to 2 glugs olive oil", 
            "2 medium leeks, white and light green parts only, cut in half lengthwise and then into 1/2-inch slices", 
            "1 large onion, diced small", 
            "1/4 cup dry sherry (optional)", 
            "3 cups low-sodium chicken broth", 
            "1/4 cup milk or heavy cream", 
            "1 bay leaf", 
            "1 teaspoon minced fresh thyme", 
            "3 tablespoons unsalted butter, at room temperature", 
            "4 1/2 tablespoons all-purpose flour", 
            "1 cup fresh or frozen green peas (no need to defrost)", 
            "2 large carrots, diced small (about 1 cup carrots)", 
            "2 tablespoons chopped flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/img_92401.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Fall", 
            "Photo", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/10/better-chicken-pot-pies/", 
        "title": "better chicken pot pies", 
        "directions": [
            "Make pastry lids: In a large, wide bowl (preferably one that you can get your hands into), combine the flour and salt. Add the butter and, using a pastry blender or your fingertips, cut them up and into the flour mixture until it resembles little pebbles. Keep breaking up the bits of butter until the texture is closer to uncooked couscous. In a small dish, whisk together the sour cream, vinegar, and water, and combine it with the butter-flour mixture. Using a flexible spatula, stir the wet and the dry together until a craggy dough forms. If needed, get your hands into the bowl to knead it a few times into one big ball. Pat it into a flattish ball, wrap it in plastic wrap, and chill it in the fridge for 1 hour or up to 2 days. Meanwhile…", 
            "Make filling: Generously season all sides of the chicken parts with salt and freshly ground black pepper. If your chicken breasts are particularly large, I find that halving them can ensure they cook at the same pace at the other parts. Heat first glug of olive oil over medium-high  heat in the bottom of a large Dutch oven (minimum of 4 quarts; mine is 5). Brown chicken in two parts, cooking until golden on both sides. Transfer to a plate and repeat with second half of chicken. Set aside. ", 
            "Heat second glug of olive oil in the same pot. Add onions and leeks, season with salt and pepper, and saute them until softened, about 7 minutes. If using, pour in sherry and use it to scrape up any bits stuck to the bottom of the pan. Simmer until mostly cooked off. Add milk or cream, chicken broth, thyme and bay leaf and bring to a simmer. Nestle the browned chicken and any accumulated juices into the pot. Cover and gently simmer to 30 minutes, after which the chicken should be fully cooked and tender.", 
            "Transfer the chicken to a cutting board to cool slightly. Discard the bay leaves. Allow the sauce to settle for a few minutes, then skim the fat from the surface using a wide spoon; reserve it for another use, or this:", 
            "In a medium bowl, mash butter (feel free to replace any part of it with skimmed chicken fat from the previous step, thanks to a commenter below for the suggestion) and flour together with a fork until a paste forms and no flour is still visibly dry. Pour one ladleful of filling over it, and whisk until smooth. Add a second ladleful, whisking again. Return this butter-flour-filling mixture to the larger pot, stir to combine, and bring mixture back to a simmer for 10 minutes. The brothy base should thicken to a gravy-like consistency. Adjust seasonings, if needed.", 
            "Add carrots and peas to stew and simmer for 3 minutes, until firm-tender. Shred or dice the chicken, discarding the bones and skin or saving it for another use. Return chicken to stew and re-simmer for 1 minute. Stir in parsley. ", 
            "Assemble and bake pies: Heat your oven to 375 degrees F.", 
            "Divide chilled dough into quarters. Roll each quarter out into rounds that will cover 4 2-cup ovenproof bowls or baking dishes with a 1-inch overhang. Cut vents into rounds. Ladle filling into four bowls, filling only to 1 to 1 1/2 inches below the rim to leave room for simmering. Whisk egg with water to make an egg wash. Brush edges of bowls with egg wash, or if you like lids that easily lift off your bowls and are willing to risk that they may slip slightly into the bowl when baking, you can skip this. Place a lid over each bowl, pressing gently to adhere it to the outer sides of the bowl. Brush the lids with egg wash. Bake until crust is bronzed (more than mine, please, if nobody in your family is having a hangry meltdown) and filling is bubbling, 30 to 35 minutes.", 
            "Do ahead: The dough for the lids can be made up to 3 days in advance and chilled. The filling can be made up to a day in advance and re-warmed before assembling and baking the pot pies. "
        ], 
        "date": "2014-10-06T12:15:46+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick, 4 ounces or 113 grams) butter, melted", 
            "1 cup (218 grams or 7 3/4 ounces for light; 238 grams or 8 3/8 ounces for dark) brown sugar", 
            "1 large egg", 
            "1 teaspoon vanilla or 1/2 teaspoon almond extract", 
            "Pinch salt", 
            "1 cup (4 3/8 ounces or 125 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/blondies.jpg?w=749", 
        "tags": [
            "Bourbon", 
            "Brown Butter", 
            "Brownies/Blondies", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/blondies/", 
        "title": "blondies, infinitely adaptable", 
        "directions": [
            "Further additions, use one or a combination of: ", 
            "New favorite combination of late (added 5/24/14): We’ve gotten on a kick making these again, but I’ve really wanted to increase the toasty butterscotch flavor and have done so by: browning the butter, using dark brown sugar but only 3/4 cup (I prefer these less sweet these days), increasing the vanilla to 1 1/2 teaspoons and the salt to 1/4 teaspoon fleur de sel or flaky sea salt, plus a few flakes crumbled on top. I use 1 cup chopped bittersweet chocolate and 1/2 cup chopped walnuts or pecans as the mix-ins. Hope this provides some inspiration!"
        ], 
        "date": "2006-11-25T19:37:39+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/08/2804182114_6d9ebd8506_b.jpg?w=753", 
        "tags": [
            "Bourbon", 
            "Fruit", 
            "Peach", 
            "Photo", 
            "Picnics", 
            "Summer", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/08/bourbon-peach-hand-pies/", 
        "title": "bourbon peach hand pies", 
        "directions": [
            "1. To make the pastry, in a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour. If preparing ahead of time, the dough can be stored at this point for up to one month in the freezer.", 
            "2. Divide the refrigerated dough in half. On a lightly floured work surface, roll out one half of the dough to 1/8-inch thickness. Using a 4 1/2-inch-round biscuit cutter, cut seven circles out of the rolled dough. Transfer the circles to a parchment-lined baking sheet, and place in the refrigerator to chill for about 30 minutes. Repeat the rolling, cutting, and chilling process with the remaining half of dough. (I used a 4-inch cutter–if you can call a “cutter” the tin edge of the container that holds my smaller round cutters–and managed to get 12 from each dough half, after rerolling the scraps.)", 
            "3. Make the filling: Peel and chop the peaches into small bits (approx. 1/2-inch dice), much smaller than you’d use for a regular-sized pie. Mix them with the flour, sugar and pinch of salt, and add the bourbon and vanilla, if you wish.", 
            "4. Remove the chilled dough from the refrigerator, and let stand at room temperature until just pliable, 2 to 3 minutes. Spoon about 1 to 2 tablespoons filling (use the smaller amount for a 4-inch circle) onto one half of each circle of dough. Quickly brush a little cold water around the circumference of the dough, and fold it in half so the other side comes down over the filling, creating a semicircle. Seal the hand pie, and make a decorative edge by pressing the edges of the dough together with the back of a fork. Repeat process with remaining dough. Place the hand pies back on the parchment-lined baking sheet, and return to the refrigerator to chill for another 30 minutes.", 
            "5. Heat oven to 375 degrees. Remove the chilled hand pies from the refrigerator, cut a small slit in each and lightly brush with the egg yolk wash. Sprinkle sanding sugar generously over the pies, and place pies in the oven to bake. Bake until the hand pies are golden brown and just slightly cracked, about 20 minutes. Remove the pies from the oven, and let stand to cool slightly before serving."
        ], 
        "date": "2008-08-28T16:12:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup water", 
            "2 tea bags (whatever you like for iced tea)", 
            "1 cup bourbon", 
            "1/4 cup granulated sugar", 
            "1 1/2 cups orange juice (about 3 well-squeezed oranges)", 
            "6 tablespoons lemon juice (about 2 lemons)", 
            "16 to 17 ounces (about 5 cups of small pieces of ice) ice cubes", 
            "Mint sprigs or lemon slices, for garnish "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/bourbon-slush-punch1.jpg?w=640", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Lemon", 
            "Orange", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/07/bourbon-slush-punch/", 
        "title": "bourbon slush punch", 
        "directions": [
            "Boil 1 cup water for tea. Add the tea bags and let steep until cool. Discard the tea bags and set aside. Pour tea into a pitcher. Add bourbon, sugar, orange juice and lemon juice and refrigerate until needed. Don’t worry about stirring the sugar so that it dissolves; after 30 minutes in the fridge, it will have. ", 
            "To serve: Shake or stir punch base to ensure ingredients are evenly distributed. To make two liters of punch, add base and full amount of ice cubes to your blender, blending until the ice is crushed and slushy. For each individual glass of punch, place 1/2 cup punch base and slightly heaped 1/2 cup small pieces of ice (mine were chipped off an ice block; don’t ask) and blend until slushy. Add an extra whole ice cube or two to glasses if desired. Garnish glass with a sprig of mint or slice of lemon."
        ], 
        "date": "2014-07-24T12:01:28+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups buttermilk", 
            "5 garlic cloves, peeled and smashed", 
            "1 tablespoon table salt", 
            "1 tablespoon granulated sugar", 
            "1 1/2 teaspoons paprika, plus extra for sprinkling (I used Hungarian, a smoked one would also be delicious)", 
            "Lots of freshly ground black pepper", 
            "2 1/2 to 3 pounds chicken parts (we used all legs)", 
            "Drizzle of olive oil", 
            "Flaked or coarse sea salt, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/01/buttermilk-roast-chicken.jpg?w=750", 
        "tags": [
            "Budget", 
            "Chicken", 
            "Gluten-Free", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2012/01/buttermilk-roast-chicken/", 
        "title": "buttermilk roast chicken", 
        "directions": [
            "Whisk buttermilk with garlic, table salt, sugar, paprika and lots of freshly ground black pepper in a bowl. Place chicken parts in a gallon-sized freezer bag (or lidded container) and pour buttermilk brine over them, then swish it around so that all parts are covered. Refrigerate for at least 2 but preferably 24 and up to 48 hours.", 
            "When ready to roast, preheat oven to 425 degrees. Line a baking dish with foil (not absolutely necessary, but Nigella suggested it and I never minded having dish that cleaned up easily). Remove chicken from buttermilk brine and arrange in dish. Drizzle lightly with olive oil, then sprinkle with additional paprika and sea salt to taste. Roast for 30 minutes (for legs; approximately 35 to 40 for breasts), until brown and a bit scorched in spots. Serve immediately. We enjoyed it with wild rice and green beans one night; roasted potatoes and, uh, more green beans another. (Yes, I have a habit.)"
        ], 
        "date": "2012-01-24T14:54:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup firmly packed brown sugar", 
            "2 tablespoons butter", 
            "1 tablespoon vanilla", 
            "2 teaspoons bourbon (optional)", 
            "1 1/2 cups whipping cream", 
            "2 cups half-and-half (light cream)", 
            "6 large egg yolks (hint: if you make a hazelnut brown butter cake, you should have these in your fridge already!)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/butterscotch-ice-cream1.jpg?w=500", 
        "tags": [
            "Bourbon", 
            "Ice Cream/Sorbet", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/03/butterscotch-ice-cream/", 
        "title": "butterscotch ice cream", 
        "directions": [
            "1. In a 1- to 2-quart pan over medium heat, stir brown sugar and butter until butter is melted, sugar is dissolved, and mixture is bubbly, 3 to 4 minutes. Whisk in 1/2 cup whipping cream until smooth; remove butterscotch mixture from heat. Add vanilla and bourbon, if using.", 
            "2. In a 3- to 4-quart pan over medium-high heat, combine remaining 1 cup whipping cream and the half-and-half; bring to a simmer.", 
            "3. Meanwhile, in a bowl, beat egg yolks to blend. Whisk 1/2 cup of the warm cream mixture into egg yolks, then pour egg yolk mixture into pan with cream. Stir constantly over low heat just until mixture is slightly thickened, 2 to 4 minutes. Immediately remove from heat.", 
            "4. Pour through a fine strainer into a clean bowl and whisk in butterscotch mixture. Chill until cold, stirring occasionally, about 2 hours; or cover and chill up to 1 day.", 
            "5. Freeze mixture in an ice cream maker according to manufacturer’s instructions. Serve softly frozen, or transfer ice cream to an airtight container and freeze until firm, at least 6 hours or up to 1 week.", 
            "Note: If you serve with espresso-chocolate shortbread cookies, your friends might never leave. Proceed with caution."
        ], 
        "date": "2008-03-14T18:56:02+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/bourbon-pumpkin-cheesecake.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Cake", 
            "Celebration Cakes", 
            "Photo", 
            "Pumpkin", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2006/11/candy-corn-for-really-lucky-grown-ups/", 
        "title": "bourbon pumpkin cheesecake", 
        "directions": [
            "Garnish: pecan halves ", 
            "Make crust: Invert bottom of a 9-inch springform pan (to create flat bottom, which will make it easier to remove cake from pan), then lock on side and butter pan.", 
            "Stir together crumbs, pecans, sugars, and butter in a bowl until combined well. Press crumb mixture evenly onto bottom and 1/2 inch up side of pan, then chill crust, 1 hour.", 
            "Make filling and bake cheesecake: Put oven rack in middle position and Preheat oven to 350°F.", 
            "Whisk together pumpkin, eggs, brown sugar, cream, vanilla, and liqueur (if using) in a bowl until combined.", 
            "Stir together granulated sugar, cornstarch, cinnamon, nutmeg, ginger, and salt in large bowl. ", 
            "Add cream cheese and beat with an electric mixer at high speed until creamy and smooth, about 3 minutes. Reduce speed to medium, then add pumpkin mixture and beat until smooth.", 
            "Pour filling into crust, smoothing top, then put springform pan in a shallow baking pan (in case springform leaks). Bake until center is just set, 50 to 60 minutes. Transfer to rack and cool 5 minutes. (Leave oven on.)", 
            "Make topping: Whisk together sour cream, sugar, and liqueur (if using) in a bowl, then spread on top of cheesecake and bake 5 additional minutes.", 
            "Cool cheesecake completely in pan on rack, about 3 hours.", 
            "Chill, covered, until cold, at least 4 hours. Remove side of pan and bring to room temperature before serving.", 
            "Do ahead: Baked cheesecake can be chilled, covered, up to 2 days."
        ], 
        "date": "2006-11-22T14:12:19+00:00"
    }, 
    {
        "ingredient_list": [
            "Stew", 
            "5 pounds bone-in, skin-on chicken thighs", 
            "Table salt and ground black pepper", 
            "4 teaspoons vegetable oil", 
            "4 tablespoons unsalted butter (1/2 stick)", 
            "2 medium leeks , white and llight green parts only, cut in half lengthwise and then into 1-inch pieces", 
            "1 large onion, minced", 
            "6 tablespoons unbleached all-purpose flour", 
            "1/4 cup dry sherry", 
            "4 1/2 cups low-sodium chicken broth", 
            "1/4\tcup whole milk", 
            "1 teaspoon minced fresh thyme leaves", 
            "2 bay leaves", 
            "1 cup frozen green peas", 
            "3 tablespoons minced fresh tarragon leaves  ", 
            "Dumplings", 
            "2 cups unbleached all-purpose flour", 
            "1 tablespoon baking powder", 
            "1 teaspoon table salt", 
            "1 cup whole milk", 
            "3 tablespoons reserved chicken fat (or unsalted butter) "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/12/chicken-and-dumplings.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/12/chicken-and-dumplings/", 
        "title": "chicken and dumplings", 
        "directions": [
            "1. For the stew: Pat the chicken dry with paper towels, then season with salt and pepper. Heat 2 teaspoons of the oil in a large Dutch oven over medium-high heat until just smoking. Add half of the chicken and cook until golden on both sides, about 10 minutes. Transfer the chicken to a plate and remove the browned skin. Pour off the chicken fat and reserve. Return the pot to medium-high heat and repeat with the remaining 2 teaspoons oil and the remaining chicken. Pour off and reserve any chicken fat.", 
            "2. Add the butter to the Dutch oven and melt over medium-high heat. Add the leeks, onion, and 1/4 teaspoon salt and cook until softened, about 7 minutes. Stir in the flour. Whisk in the sherry, scraping up any browned bits. Stir in the broth, milk, thyme, and bay leaves. Nestle the chicken, with any accumulated juices, into the pot. Cover and simmer until the chicken is fully cooked and tender, about 1 hour.", 
            "3. Transfer the chicken to a cutting board. Discard the bay leaves. Allow the sauce to settle for a few minutes, then skim the fat from the surface using a wide spoon. Shred the chicken, discarding the bones, then return it to the stew.", 
            "4. For the dumplings: Stir the flour, baking powder, and salt together. Microwave the milk and fat in a microwave-safe bowl on high until just warm (do not over-heat), about 1 minute. Stir the warmed milk mixture into the flour mixture with a wooden spoon until incorporated and smooth.", 
            "5. Return the stew to a simmer, stir in the peas and tarragon, and season with salt and pepper. Following the steps below, drop golf-ball-sized dumplings over the top of the stew, about 1/4 inch apart (you should have about 18 dumplings). Reduce the heat to low, cover, and cook until the dumplings have doubled in size, 15 to 18 minutes. Serve.", 
            "To make the dumplings:  Gather a golf-ball-sized portion of the dumpling batter onto a soup spoon, then push the dumpling onto the stew using a second spoon.\t Cover the stew with the dumplings, leaving about 1/4 inch between each. When fully cooked, the dumplings will have doubled in size.\t"
        ], 
        "date": "2007-12-11T18:18:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            "Zest and juice of 1 lemon", 
            "3 cloves garlic, minced", 
            "1 1/2 teaspoon kosher salt", 
            "3/4 teaspoon paprika", 
            "1/4 teaspoon hot smoked paprika, plus more to taste", 
            "1 1/2 teaspoons dried oregano, crumbled", 
            "Freshly ground black pepper", 
            "10 boneless, skinless chicken thighs (about 3 pounds)", 
            "2 cups (554 grams) plain, unsweetened Greek yogurt", 
            "1 hothouse, English or seedless cucumber, unpeeled (about 1 pound)", 
            "2 tablespoons freshly squeezed lemon juice", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon minced fresh dill", 
            "2 medium cloves garlic, minced", 
            "1 1/2 teaspoons kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "1 head romaine lettuce, chopped", 
            "1 red onion, thinly sliced", 
            "About 1 pound small-medium tomatoes, chopped", 
            "1 hothouse, English or seedless cucumber, chopped", 
            "4 large pitas (intending 1/2 per person) or more as needed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/chicken-gyro-salad1.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Cucumber", 
            "Greek", 
            "Greens", 
            "Grilling", 
            "Onions", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/05/chicken-gyro-salad/", 
        "title": "chicken gyro salad", 
        "directions": [
            "Prepare the chicken: Combine all ingredients in a large freezer bag. Rub all around, coating chicken as evenly as possible. Let marinate for 20 minutes or up to 24 hours, whatever time you have.\nMake tzatziki: Place the yogurt in a medium bowl. Quarter your cucumber lengthwise and cut out the seeded area. Coarsely grate your cucumber onto a clean dishcloth and wring it out as well as you can. All of that liquid makes for a soggy sauce. Add wrung-out cucumber to yogurt bowl along with lemon, vinegar, dill, garlic, salt and pepper and stir to combine. Taste and adjust seasonings. Chill until needed.\nPrepare salad components: Arrange lettuce, onion, tomatoes and cucumbers on a platter. If desired, toss onion with a squeeze of lemon and/or dash or two of vinegar and salt so that it mellows/lightly pickles while it rests.\nCook chicken: Heat your grill to high heat or a grill pan to medium-high. Remove chicken from marinade and grill on first side until dark lines appear, about 5 minutes, then flip and grill for 3 minutes more on second side. Cooking times will vastly range by the thickness and coldness of your chicken, as well as variations between grills. Transfer cooked chicken to a cutting board, let rest for a couple minutes while you quickly heat/toast your pitas on the grill.\nCut chicken into thin strips. Cut pitas into wedges. Add to platter with vegetables and let everyone dig in. Repeat all summer."
        ], 
        "date": "2016-05-31T12:01:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup gold tequila", 
            "1 cup freshly squeezed lime juice (5 to 6 limes)", 
            "1/2 cup freshly squeezed orange juice (2 oranges)", 
            "1 tablespoon chili powder", 
            "1 tablespoon minced fresh jalapeno pepper (1 pepper seeded)", 
            "1 tablespoon minced fresh garlic (3 cloves)", 
            "2 teaspoons kosher salt", 
            "1 teaspoon freshly ground black pepper", 
            "3 whole (6 split) boneless chicken breasts, skin on*", 
            "Combine the tequila, lime juice, orange juice, chili powder, jalapeno pepper, garlic, salt, and pepper in a large bowl. Add the chicken breasts. Refrigerate overnight. ", 
            "1 cup green onions, coarsely chopped", 
            "1/4 cup red wine vinegar", 
            "2 serrano chiles", 
            "2 tablespoons mayonnaise", 
            "Salt and pepper", 
            "1/2 cup pure olive oil", 
            "1 head purple cabbage, finely shredded", 
            "1 small red onion, halved and thinly sliced", 
            "1/4 cup chopped cilantro leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chicken-jealousy1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Chicken", 
            "Citrus", 
            "Photo", 
            "Salad", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2007/04/chicken-jealousy/", 
        "title": "tequila lime chicken + green onion slaw", 
        "directions": [
            "Blend green onions, vinegar, chiles, mayonnaise, salt, pepper and oil in a blender until emulsified. Place cabbage and red onions in a bowl, add the dressing and stir until combined. Fold in the cilantro and season with salt and pepper to taste.  "
        ], 
        "date": "2007-04-26T16:21:34+00:00"
    }, 
    {
        "ingredient_list": [
            "For the Pickled Onions: ", 
            "1/2 cup red wine vinegar (I swapped half with white vinegar; I was feeling stingy with my fancy red wine stuff)", 
            "1/2 cup cold water", 
            "2 tablespoons kosher salt (updated: 1 heaped tablespoon is a better amount here)", 
            "1 tablespoon sugar", 
            "2 to 3 really good shots hot sauce", 
            "1 red onion, sliced into very thin rings", 
            "For the Chicken Milanese: ", 
            "1 cup all-purpose flour", 
            "2 eggs, beaten with 1 tablespoon of water", 
            "1 1/2 cups panko bread crumbs", 
            "1/2 cup grated pamesan", 
            "4 small boneless, skinless chicken breasts, butterflied and lightly pounded/flattened (no need to tenderize; a good organic chicken breast will already be tender, says Burrell) to 1/4-inch thick*", 
            "Kosher salt and pepper", 
            "Extra-virgin olive oil, for frying", 
            "For the Escarole Salad:", 
            "1/2 cup grated pecorino romano", 
            "1/2 cup toasted hazelnuts", 
            "2 tablespoons freshly chopped parsley leaves", 
            "1 head escarole, washed, spun dry, cut into bite size pieces", 
            "High-quality extra-virgin olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/chicken-milanese-and-a-escarole-salad.jpg?w=753", 
        "tags": [
            "Chicken", 
            "Escarole", 
            "Greens", 
            "Italian", 
            "Photo", 
            "Pickled", 
            "Salad", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2009/01/chicken-milanese-an-escarole-salad/", 
        "title": "chicken milanese + an escarole salad", 
        "directions": [
            "Make the pickled red onions: In a small bowl, combine red wine vinegar with 1/2 cup of cold tap water. Stir in salt, the sugar and the hot sauce. Add the sliced onions and let sit for at least one hour. [Do ahead: We made these the night before to save time; they were even better pickled overnight.]", 
            "Make the chicken milanese: Set up a standard breading procedure in three wide deep plates. Fill one with flour, one with the beaten eggs, and one with the panko and grated cheese. Season the chicken breasts with salt and pepper. Using one hand for dry things and one hand for wet things, take each piece of chicken through the breading procedure: dredge lightly in the flour, then the egg wash and then through the bread crumbs. Lay the breaded chicken on a sheet tray and refrigerate for at least one hour. [Do ahead: You could even prep these the night before, to save time. Cover them loosely with plastic wrap in the fridge.]", 
            "Pour olive oil into a large saute pan until it reaches a thickness of about a half an inch – better a little more rather than a little less. Bring to a medium-high heat. Test the oil by flicking flour or bread crumbs into the oil. If it doesn’t sizzle, wait! When the oil is hot, test it again by dipping the edge of a piece of chicken into the oil, the oil should gently sizzle. Cook the chicken in the oil in batches on both sides until it is a lovely golden brown color and is crispy, about four to five minutes on the first side and three to four minutes on the second. Do not crowd the pan or the chicken will become very greasy and soggy. When the chicken comes out of the oil lay it on paper towels to drain off the excess oil and sprinkle with salt. [Do ahead: You can keep the chicken in a low oven to keep it warm while the rest of the chicken is cooking. I did this to hold it until we were ready to eat.]", 
            "Make the escarole salad: Combine the romano, hazelnuts and parsley in the food processor and pulse until they are coarsely chopped. Toss together the escarole, hazelnut mixture and some of the pickled red onions and dress with some of the pickling liquid and olive oil. Season with salt and pepper.", 
            "Place chicken on each serving plate and top with the escarole salad.", 
            "* Tiny kitchen tip! My makeshift setup since I don’t have one of those mallet things was to lay the breasts out on a cutting board, cover them with plastic and thwack away at them with a small, heavy saucepan. It worked great! And I had one less gadget to buy."
        ], 
        "date": "2009-01-24T19:16:33+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon vegetable oil", 
            "1 large onion, chopped", 
            "3-pound chicken, in parts or 3 pounds chicken pieces of your choice", 
            "8 cups water", 
            "1 bay leaf", 
            "2 teaspoons table salt", 
            "Freshly ground black pepper", 
            "1 large carrot, diced (1/3-inch)", 
            "1 medium parsnip, diced (1/3-inch) (optional)", 
            "1 large celery stalk, diced (1/3-inch)", 
            "3 ounces dried egg noodles, I prefer wide ones", 
            "1 tablespoon chopped fresh dill or flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/chicken-noodle-soup1.jpg?w=640", 
        "tags": [
            "Chicken", 
            "Fall", 
            "Pasta", 
            "Photo", 
            "Soup", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2012/10/chicken-noodle-soup/", 
        "title": "chicken noodle soup", 
        "directions": [
            "Prepare broth: In a large (5-quart) heavy pot over medium-high heat, heat the vegetable oil. Add the onion and saute it for 3 to 4 minutes, until beginning to take on color at edges. Add the chicken pieces (if too crowded, can do this in two batches), making little wells in the onions so that the parts can touch the bottom of the pan directly. Cook chicken parts until lightly browned, about 10 minutes. ", 
            "Add water, bay leaf, table salt and some freshly ground black pepper and bring the mixture to a boil. Reduce the heat to a simmer and skim any (sorry for lack of better term) scum that appears at the surface of the pot. Simmer pot gently, partially covered, for 20 minutes. ", 
            "Transfer chicken parts to a plate to cool a bit before handling. Set a fine-mesh strainer over a bowl (ideally, with a spout) and pour soup through it. ", 
            "If your pot looks grimy and you’re fanatical about having a clear soup, you can give it a quick wash before returning the broth to the pot. You can remove a bit of fat at this point, if it looks necessary. Bring the broth back to a simmer. ", 
            "You may be tempted at this point to taste it and add more salt. I know this because I do it every single time, adding another teaspoon, and every. single. time. I regret this as it is too salty in the end. So, proceed with any re-seasoning with caution.", 
            "To finish and serve: Add diced vegetables and simmer them until they’re firm-tender, about 5 minutes. Add dried noodles and cook them according to package directions, usually 6 to 9 minutes. While these simmer, remove the skin and chop the flesh from a couple pieces of chicken, only what you’re going to use. You won’t need all of it in the soup. I usually use the breasts first because they’re my least favorite and benefit the most from the extra moisture of the soup. The remaining parts can be slipped into an airtight bag in the fridge (I recommend leaving the skin on for retained moisture until needed) and used for chicken salad or the like over the next few days.", 
            "Once noodles have cooked, add chicken pieces just until they have rewarmed through (30 seconds) and ladle into serving bowls. Garnish with dill or parsley, dig in and let it fix everything that went wrong with your day.", 
            "Do ahead: If planning ahead, the point where you strain your chicken broth is a great place to pause. Refrigerate the chicken broth until the next day. Before heating it and finishing the recipe, you can easily remove any solidified fat from the surface for a virtually fat-free soup. Then, you can cook the vegetables and noodles to order, adding the chicken only so that it can rewarm (and not overcook!). If making the broth more than a day in advance, you might as well freeze it. I recommend freezer bags with as much air as possible pressed out. Freezing the bags flat will make it easier to stack and store with other frozen soups, and the bag will only require a short soak in warm water to defrost."
        ], 
        "date": "2012-10-10T11:26:11+00:00"
    }, 
    {
        "ingredient_list": [
            "Broth", 
            "2 unpeeled yellow onions, quartered", 
            "Three 1/2-inch-thick slices of unpeeled fresh ginger, smashed", 
            "4 quarts cold water", 
            "3 pounds chicken bones or chicken wings", 
            "One fresh 3 1/2-pound chicken, quartered", 
            "1 tablespoon kosher salt", 
            "2 teaspoons sugar", 
            "Additional spices (optional): Cinnamon, star anise, black cardamoms, coriander seeds, fennel seeds or cloves", 
            "1/4 cup Asian fish sauce", 
            "1 pound dried rice noodles, a linguine shape (bánh phở) if you can find them", 
            "Garnishes", 
            "1 large scallion, thinly sliced", 
            "1 pound mung bean sprouts", 
            "1/2 cup torn basil leaves, Thai basil if you can find it", 
            "1/2 cup cilantro leaves", 
            "2 limes, cut into wedges", 
            "2 jalapeños, thinly sliced", 
            "Asian chili-garlic sauce", 
            "Hoisin sauce", 
            "Crispy shallots, recipe follows", 
            "2 cups thinly sliced shallots (about 4 large shallots)", 
            "2 cups canola oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/chicken-pho1.jpg?w=640", 
        "tags": [
            "Chicken", 
            "Gluten-Free", 
            "Photo", 
            "Soup", 
            "Vietnamese"
        ], 
        "url": "https://smittenkitchen.com/2014/01/chicken-pho/", 
        "title": "chicken phở", 
        "directions": [
            "In a small saucepan or large heavy skillet, heat the oil over medium-high until it registers 275°F on a deep-fry or candy thermometer. Add the shallots and cook, stirring frequently as they’ll want to cook unevenly, until light golden brown, about 4 to 8 minutes, depending on their thickness. Transfer to a paper towel-lined plate to drain.", 
            "Increase the heat to high and place a fine-mesh sieve over a heatproof bowl. When the oil registers 375°F on the deep-fry or candy thermometer, add return the fried shallots to the oil and cook just until they are crispy and well-browned, about 5 seconds, watching carefully so the shallots don’t burn.", 
            "Pour the oil and shallots through the sieve to immediately stop the cooking, then transfer to shallots to a paper towel-lined plate to drain. Sprinkle with salt to season. Reserve the oil for another use. The shallots will keep, stored in an airtight container, for 1 day, but they’re best the day they are made."
        ], 
        "date": "2014-01-13T12:34:34+00:00"
    }, 
    {
        "ingredient_list": [
            "3 whole (6 split) chicken breasts, bone-in, skin-on (we used 2 whole/4 split large ones; worked fine)", 
            "3 tablespoons olive oil", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "5 cups chicken stock, preferably homemade", 
            "2 chicken bouillon cubes (if you, like us, use Better than Bouillon, the exchange is 4 teaspoons)", 
            "12 tablespoons (1 1/2 sticks) unsalted butter", 
            "2 cups yellow onions, chopped (2 onions)", 
            "3/4 cup all-purpose flour", 
            "1/4 cup heavy cream", 
            "2 cups medium-diced carrots, blanched for 2 minutes", 
            "1 (10-ounce) package frozen peas (2 cups)", 
            "1 1/2 cups frozen small whole onions (apparently, Birds Eye sells these; I’ve never found them and peeled fresh ones), blanched for 2 minutes (can do this with the carrots)", 
            "Glug of sherry (optional)", 
            "1/2 cup minced fresh parsley leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chicken-pot-pie1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/11/chicken-pot-pie/", 
        "title": "chicken pot pie", 
        "directions": [
            "Preheat the oven to 350 degrees F.", 
            "Place the chicken breasts on a baking sheet and rub them with olive oil. Sprinkle generously with salt and pepper. Roast for 35 to 40 minutes, or until cooked through. Set aside until cool enough to handle, then remove the meat from the bones and discard the skin. Cut the chicken into large dice. You will have 4 to 6 cups of cubed chicken. (We did this a day in advance.)", 
            "In a small saucepan, heat the chicken stock and dissolve the bouillon cubes in the stock. In a large pot or Dutch oven, melt the butter and saute the onions over medium-low heat for 10 to 15 minutes, until translucent. Add the flour and cook over low heat, stirring constantly, for 2 minutes. Add the hot chicken stock to the sauce. Simmer over low heat for 1 more minute, stirring, until thick. Add 2 teaspoons 1 teaspoon salt, 1/2 teaspoon pepper, and heavy cream. Add the cubed chicken, carrots, peas, onions, parsley and a glug of sherry, if you’re using it. Mix well. Adjust seasonings to taste.", 
            "For the pastry, mix the flour, salt, and baking powder in the bowl of a food processor fitted with a metal blade. Add the butter and mix quickly with your fingers until each piece is coated with flour. Pulse 10 times, or until the fat is the size of peas. With the motor running, add the ice water; process only enough to moisten the dough and have it just come together. Dump the dough out onto a floured board and knead quickly into a ball. Wrap the dough in plastic and allow it to rest in the refrigerator for 30 minutes. (This can also be made a day or more in advance.)", 
            "Preheat the oven to 375 degrees F.", 
            "Divide the filling equally among 4 ovenproof bowls. Divide the dough into quarters and roll each piece into an 8-inch circle. Brush the outside edges of each bowl with the egg wash, then place the dough on top. Trim the circle to 1/2-inch larger than the top of the bowl. Crimp the dough to fold over the side, pressing it to make it stick. Brush the dough with egg wash and make 3 slits in the top. Sprinkle with sea salt and cracked pepper. Place on a baking sheet and bake for 1 hour, or until the top is golden brown and the filling is bubbling hot."
        ], 
        "date": "2008-11-12T23:48:15+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/04/chicken-empanada-with-chorizo.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Freezer Friendly", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/04/chicken-revisited-and-enlightened/", 
        "title": "chicken empanada with chorizo and olives", 
        "directions": [
            "Make Dough: Sift flour with salt into a large bowl and blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal with some (roughly pea-size) butter lumps. Beat together egg, water, and vinegar in a small bowl with a fork. Add to flour mixture, stirring with fork until just incorporated. (Mixture will look shaggy.) Turn out mixture onto a lightly floured surface and gather together, then knead gently with heel of your hand once or twice, just enough to bring dough together. (Deb note: If you use a large-ish bowl, you can do this step in-bowl.) Form dough into two flat rectangles and chill them, each wrapped in plastic wrap, at least 1 hour. Dough can be chilled up to 6 hours total. ", 
            "Make Filling: Pat chicken dry and sprinkle with salt and pepper. Heat 2 tablespoons oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown chicken, turning over once, about 6 minutes total, and transfer to a plate. Sauté onions, garlic, and bay leaves in fat remaining in skillet, stirring frequently, until onions are softened, 4 to 5 minutes. ", 
            "Add chorizo and paprika and cook, stirring, 1 minute. Add olives, wine, and broth and bring to a boil, stirring and scraping up any brown bits. Return chicken to skillet along with any juices accumulated on plate, then reduce heat to moderately low and simmer chicken, covered, turning over once, until tender, 25 to 30 minutes total.", 
            "Transfer chicken to a clean plate. (Sauce in skillet should be the consistency of heavy cream; if it’s not, briskly simmer until slightly thickened, about 5 minutes.) When chicken is cool enough to handle, discard skin and bones and coarsely chop meat. Stir chicken into sauce and discard bay leaves. Season with salt and pepper, then cool filling, uncovered, about 30 minutes.", 
            "Form Empanadas: Put oven racks in upper and lower thirds of oven and preheat oven to 400°F. Divide first dough and half of second dough into 18 equal pieces and form each into a disk. (The remaining dough can be stored in the freezer for future use.) Keeping remaining pieces covered, roll out 1 piece on a lightly floured surface with a lightly floured rolling pin into a 5-inch round (about 1/8 inch thick).", 
            "Spoon about 2 tablespoons filling onto center and fold dough in half, enclosing filling. Press edges together to seal, then crimp decoratively with your fingers or tines of a fork. Transfer empanada to a baking sheet. Make 17 more empanadas in same manner, arranging on 2 parchment-lined baking sheets.", 
            "Lightly brush empanadas with some of egg wash and bake in upper and lower thirds of oven, switching position of sheets halfway through baking, until golden, about 25 minutes. Transfer empanadas to a rack to cool at least 5 minutes. Serve warm or at room temperature. ", 
            "* Not wanting to engage you all in egg-splitting, this empanada dough recipe technically makes enough for 24 pockets. The extra can be stored in the freezer for future use."
        ], 
        "date": "2007-04-30T15:29:40+00:00"
    }, 
    {
        "ingredient_list": [
            "6 tablespoons olive oil", 
            "1/2 cup blanched almonds (preferably Marcona)", 
            "1/2 cup country bread, torn into small pieces", 
            "4 cloves garlic, chopped", 
            "Small pinch saffron", 
            "1 tablespoon chopped parsley", 
            "4 chicken thighs and 4 chicken drumsticks Sea salt", 
            "Flour, for dusting", 
            "1 dried red chili", 
            "1 Spanish onion, sliced", 
            "1/2 cup white wine", 
            "1 cup chicken broth", 
            "1/2 cup pitted green olives."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chicken-with-almonds-and-green-olives1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/03/chicken-with-almonds-and-green-olives/", 
        "title": "chicken with almonds and green olives", 
        "directions": [
            "1. Heat 2 tablespoons of oil in a large braising pan. Add the almonds, bread and garlic. Cook over medium heat so the garlic softens and the bread toasts but nothing burns. Scrape into a food processor and let cool for 5 minutes. Add the saffron and parsley and pulse to a coarse paste.", 
            "2. Preheat oven to 300 degrees. Season the chicken with salt and dust with flour. Add 2 tablespoons oil to the braiser and place over medium-high heat. Add chicken and brown all sides, then remove to a plate. Wipe out the pan. Add remaining oil, the chili and onions and cook until softened. Discard the chili. Nestle chicken in the pan, pour in the wine and reduce by half.", 
            "3. Add the almond mixture and the broth, bring to a simmer, cover the pan and braise in the oven until the chicken is almost tender, about 40 minutes. Stir in the olives and cook until the chicken is very tender, 10 minutes more. Serve from the pan. Serves 4."
        ], 
        "date": "2008-03-25T08:34:21+00:00"
    }, 
    {
        "ingredient_list": [
            "1 chicken (3 1/2 pounds), cut into 8 pieces, skin on", 
            "Salt and freshly ground black pepper", 
            "2 medium onions, cut into 1/8-inch-thick slices", 
            "2 cloves garlic, peeled and slightly crushed", 
            "40 sprigs fresh thyme, 3 to 4 bunches", 
            "2 dried bay leaves", 
            "2 sprigs fresh rosemary", 
            "2 cups Riesling wine", 
            "1 1/2 cups Homemade Chicken Stock, or low-sodium canned chicken broth, skimmed of fat", 
            "3 tablespoons unsalted butter", 
            "5 ounces red pearl onions, peeled and halved (about 1 cup)", 
            "1/2 pound fresh wild mushrooms, such as chanterelle, cleaned, trimmed, and cut into 1-inch pieces", 
            "1/4 cup Madeira wine", 
            "5 teaspoons grainy mustard", 
            "10 strips best-quality bacon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chicken-with-chanterelles-and-pearl-onions1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/chicken-with-chanterelles-and-pearl-onions/", 
        "title": "chicken with chanterelles and pearl onions", 
        "directions": [
            "Heat oven to 300 degrees. Sprinkle chicken pieces with salt and pepper. ", 
            "Spread a third of the onion slices and all the garlic in the bottom of a 7-quart ovenproof casserole or Dutch oven. Scatter 5 sprigs thyme, 1 bay leaf, and 1 rosemary sprig over the onion layer. Lay half the chicken pieces on top of the herb layer. Repeat with another third of the onion slices, the same amounts of each of the herbs as before, and the remaining chicken pieces; finish with a layer of all the remaining onion slices. Pour Riesling and chicken stock over onions and chicken. Cover casserole, and place in the oven to cook until chicken is tender, about 1 hour and 15 minutes. ", 
            "Remove chicken pieces from casserole, and let sit until cool enough to handle. Remove skin from chicken; cut each breast piece in half. Spread each chicken piece with 1/2 teaspoon mustard, season with salt and pepper, and top with sprigs of thyme. Set aside. With a ladle, remove about 1 cup of the chicken cooking liquid from casserole, straining it into a shallow bowl or fat separator; set aside to separate. ", 
            "Melt butter in a large skillet over medium heat. Add pearl onions, and season with salt and pepper. Cook, shaking skillet often, until mushrooms soften and turn golden brown, 3 to 4 minutes. Add mushrooms, and season again with salt and pepper. Cook, shaking skillet often, until mushrooms soften and release their juice, 3 to 5 minutes. Cook until juice has evaporated, about 2 minutes. Add 2 tablespoons Madeira to skillet, and cook until evaporated, about 1 minute. Transfer mixture to a bowl, and set aside. ", 
            "Return skillet to medium heat. Arrange 5 bacon strips in a single layer in skillet. Cook until bacon renders most of its fat and is golden brown. Place a piece of chicken on each piece of bacon and, using tongs, wrap chicken in bacon in a more or less haphazard way. Do not worry if chicken unwraps; it can be easily rewrapped before serving. Remove chicken from skillet, place on a platter, and cover with foil to keep warm. Drain fat from skillet. Repeat with remaining bacon and chicken. ", 
            "Add reserved cooked mushrooms and onions and all the chicken to skillet. Add remaining 2 tablespoons Madeira and the reserved chicken cooking liquid, skimmed of fat. Cook until chicken and vegetables are hot. Serve. "
        ], 
        "date": "2007-11-09T23:59:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3- to 4-pound chicken, cut into 8 pieces, at room temperature", 
            "Salt and freshly ground black pepper", 
            "2 tablespoons extra virgin olive oil", 
            "1 tablespoon unsalted butter", 
            "About 40 large garlic cloves", 
            "1/2 cup dry white wine", 
            "1/2 cup chicken stock or canned broth."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chicken-with-forty-cloves-of-garlic1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/chicken-with-forty-cloves-of-garlic/", 
        "title": "chicken with forty cloves of garlic", 
        "directions": [
            "1. Season chicken liberally with salt and pepper. Place a deep, nonreactive skillet or Dutch oven over high heat, and add oil and butter. When fats are hot but not smoking, add chicken pieces skin side down and cook until skin turns an even, golden brown, about 5 minutes. Work in batches, if necessary, and carefully regulate heat to avoid scorching skin. Turn pieces and brown them on other side for an additional 5 minutes.", 
            "2. Reduce heat to medium. Bury garlic cloves under chicken to make sure they settle in one layer at bottom of skillet. Saute, shaking or stirring pan frequently, until garlic is lightly browned on all sides, about 10 minutes. Add wine and stock, scraping bottom of pan. ", 
            "3. Cover and continue cooking until juices run clear when a thigh is pricked, 10 to 15 minutes more. Serve chicken with garlic and pan juices and, if desired, rice or sauteed potatoes. "
        ], 
        "date": "2007-11-01T21:10:14+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 pound ground chicken", 
            "1 teaspoon soy sauce", 
            "3/4 teaspoon kosher salt", 
            "1 1/2 teaspoons toasted sesame oil", 
            "1 1/2 teaspoons grated fresh ginger", 
            "3 tablespoons minced garlic chives, regular chives or scallions", 
            "Ground white pepper, to taste", 
            "50 wonton wrappers (about 12 ounces), thawed if frozen, thinnest ones you can find", 
            "Cornstarch, to prevent sticking", 
            null, 
            "A 3-inch piece of ginger, peeled and sliced", 
            "2 large garlic cloves, crushed", 
            "1 bundle scallions, to be used here and to finish", 
            "Soy sauce or salt, to taste", 
            "3 ounces baby spinach leaves (a few handfuls)", 
            "Toasted sesame oil and soy sauce, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/01/chicken-wonton-soup.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Chinese", 
            "Photo", 
            "Soup", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2017/01/chicken-wonton-soup/", 
        "title": "chicken wonton soup", 
        "directions": [
            "Make your filling: Combine chicken, soy sauce, salt, sesame oil, ginger, chives and pepper in a bowl with a fork. If you’d like to test for seasoning, put a tiny dab in a microwave-safe bowl or plate and cook for 10 very splattery seconds. Adjust flavors as desired.\nForm your wontons: Place a few wontons wrappers on your counter. Cover the remaining ones with a piece of plastic wrap. Place 1 heaped teaspoon (from a measuring spoon set) in the center. Use your fingers dipped in water to dampen the edges. Fold one corner diagonally across to the other, pressing air out as you seal it shut. Then, bring the two corners on the wide side of the triangle down below it and use a dab of water to seal them shut. You’re not trying to pull the corners across the belly, but pointing downward. Lightly sprinkle a big plate with cornstarch and place form wontons on it. Repeat with remaining wontons. I found that after I’d made a couple and got the hang of it, I could lay out 6 at a time and get each batch of 6 done in 2 minutes, meaning that this process took me about 20 minutes total.\nFix up your stock (optional): While you’re forming wontons, should you want to enhance your stock (see note up top first), chop the white and light green parts of your scallions into 1/2- to 1-inch segments. Cut dark green tops into thin slivers and save for garnish later. Place stock in 3 to 4-quart pot with sliced ginger, the white and light green scallions you’ve just chopped, garlic and soy sauce or salt, as needed, to season. Simmer them together for 20 minutes while you make the wontons, then strain out the ginger, scallions and garlic.", 
            "Cook the wontons: Once your wontons are formed, you can cook them right in the simmering broth or you can do so in simmering water — the latter is better so that the cornstarch on the wrappers doesn’t make the soup cloudy. Boil wontons for 3 minutes to cook them inside; this is really all it takes, but if you’re nervous, cut one in half to make sure.\nTo finish soup: Add spinach to simmering broth and let cook for one minute, until softened. Add cooked wontons to broth and let them warm through again for 30 seconds. Ladle wontons and soup into bowls. I used about 1 1/4 cups broth and 6 wontons per serving. Drizzle each dish with a little toasted sesame oil, a bit of soy sauce (if desired) and scatter with reserved dark green scallion tops. Dig in.\nDo ahead: Wontons can be formed and refrigerated for a day, or frozen for a month or longer."
        ], 
        "date": "2017-01-06T13:17:38+00:00"
    }, 
    {
        "ingredient_list": [
            "Dipping sauce", 
            "6 tablespoons Asian fish sauce", 
            "6 tablespoons brown sugar", 
            "12 tablespoons lime juice", 
            "2 garlic cloves, finely grated or minced", 
            "Small Thai or Serrano chiles, thinly sliced, to taste ", 
            "Peanut dressing", 
            "3 tablespoons Asian fish sauce", 
            "3 tablespoons rice vinegar", 
            "9 tablespoons lime juice", 
            "3 tablespoons soy sauce", 
            "1 one-and-a-half inch chunk ginger, peeled and sliced", 
            "6 tablespoons natural unsalted peanut butter", 
            "1 tablespoon toasted sesame oil", 
            "Pinch of cayenne ", 
            "Chicken and noodle salad", 
            "1 1/4 pounds boneless skinless chicken thighs (about 6)", 
            "8 ounces dried rice vermicelli or other rice noodles", 
            "2 small cucumbers, cut in 1/4-inch half moons", 
            "2 medium carrots, cut in thin julienne", 
            "Additional vegetables, as suggested above", 
            "Small handful basil or mint or cilantro sprigs, or your favorite of the three (torn or roughly chopped)", 
            "4 or more scallions, slivered", 
            "1/4 cup crushed or chopped roasted peanuts", 
            "Lime wedges (to serve)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/06/cold-rice-noodles-with-peanut-lime-chicken.jpg?w=751", 
        "tags": [
            "Carrots", 
            "Chicken", 
            "Citrus", 
            "Cucumber", 
            "Pasta", 
            "Photo", 
            "Summer", 
            "Thai", 
            "Vietnamese"
        ], 
        "url": "https://smittenkitchen.com/2012/06/cold-rice-noodles-with-peanut-lime-chicken/", 
        "title": "cold rice noodles with peanut-lime chicken", 
        "directions": [
            "Make the dipping sauce: Whisk ingredients in a small serving bowl, making sure to dissolve the sugar. Leave to ripen for 15 minutes. Refrigerate any extra and use within a few days. ", 
            "Make the peanut dressing: In a blender or small food processor, puree all ingredients to a smooth sauce, about the thickness of heavy cream. Pour into a serving bowl. ", 
            "Marinate the chicken: Stir together 1/2 the dipping sauce and 1/3 the peanut dressing (you can eyeball this) in the bottom of a low-sided bowl or dish. Add the chicken to the mixture and toss to coat. Let marinate at least 15 minutes.", 
            "Cook the noodles: Bring a large pot of water to the boil, then turn off the heat. Add the rice vermicelli and soak for 7 to 8 minutes. (Package directions may vary; check for doneness by tasting.) Drain when noodles are al dente, and cool under running water. Fluff and leave in strainer to drain well.", 
            "Cook the chicken: Grill the chicken on an outdoor grill, a stove-top grill pan, or run under the broiler until nicely browned, about 3 to 4 minutes a side. Let cool slightly, then chop roughly into 3/4-inch pieces. ", 
            "To serve: At this point, you can place everything on a large serving platter, with piles or small bowls for noodles, vegetables, chicken, the dressing and marinade and toppings (peanuts, herbs) and let your family and friends put it together in their own bowls as they wish. Or, you can assemble it for everyone as suggested:", 
            "Toss vegetables with 1 tablespoon dipping sauce in a small bowl. Divide the cooked noodles among 4 to 6 bowls. Top each bowl equally with vegetable mixture and chopped chicken. Toss each bowl with 2 teaspoons of each the dipping sauce and dressing, or more to taste (we wanted more). Add the herbs, peanuts and scallions to each bowl and serve with additional dressing and dipping sauce on the side. "
        ], 
        "date": "2012-06-22T11:02:12+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups cubed (1/2 inch) cooked chicken (about 1 3/4 lb) (I like to brine mine first, then poach it in water for 15 to 20 minutes because I am completely neurotic about chicken getting dried out in any way.)", 
            "1 cup walnuts, toasted and chopped", 
            "1 celery rib, diced into small bits (1 cup)", 
            "2 or more tablespoons finely chopped shallot", 
            "1 cup dried cranberries", 
            "2/3 to 3/4 cup mayonnaise", 
            "3 tablespoons tarragon vinegar, if you have it, or champagne or white wine vinegar works well, too", 
            "2 tablespoons finely chopped fresh tarragon or herb or your choice", 
            "1/2 teaspoon salt", 
            "1/2 teaspoon black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/10/cranberry-walnut-chicken-salad.jpg?w=753", 
        "tags": [
            "Chicken", 
            "Lunch", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/10/cranberry-walnut-chicken-salad/", 
        "title": "cranberry-walnut chicken salad", 
        "directions": [
            "Really complicated directions: Toss together all ingredients in a large bowl until combined well.", 
            "I like to eat mine on top of chopped Romaine lettuce, or with toasted pocketless pita wedges.", 
            "Variations: Are almost endless, but this is particularly good with leftover Thanksgiving turkey and chopped pecans."
        ], 
        "date": "2008-10-15T01:00:41+00:00"
    }, 
    {
        "ingredient_list": [
            "12 chicken thighs, trimmed of excess skin and fat", 
            "1 cup thinly sliced onion", 
            "3 tablespoons plus 1 teaspoon thyme leaves", 
            "2 chiles de arbol, thinly sliced on the diagonal", 
            "2 fresh bay leaves, thinly sliced, or 2 dried leaves, crumbled", 
            "3/4 cup dry vermouth", 
            "2 cups fresh breadcrumbs", 
            "5 tablespoons unsalted butter", 
            "2 tablespoons chopped flat-leaf parsley", 
            "1/2 cup finely diced shallots", 
            "1/2 cup dijon mustard", 
            "1 extra-large egg", 
            "2 teaspoons chopped tarragon", 
            "2 tablespoons extra-virgin olive oil", 
            "3/4 cup chicken stock", 
            "Braised leeks (recipe below)", 
            "kosher salt and freshly ground black pepper", 
            "6 large leeks", 
            "About 3/4 cup extra-virgin olive oil (though I always skimp and use less)", 
            "1 cup sliced shallots", 
            "1 tablespoon thyme leaves", 
            "1/2 cup dry white wine", 
            "1 1/2 to 2 cups chicken or vegetable stock or water", 
            "kosher salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/devils-chicken-thighs-braised-leeks1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Leeks", 
            "Photo", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2009/02/devils-chicken-thighs-braised-leeks/", 
        "title": "devil’s chicken thighs + braised leeks", 
        "directions": [
            "Preheat the oven to 400°F.", 
            "Remove any bruised outer layers from the leeks. Trim off to the roots, leaving the root end intact. Trim the tops of the leeks on the diagonal, leaving 2 inches of the green part attached. Cut the leeks in half lengthwise, and submerge in a large bowl of cold water to clean them. Shake the leeks well to dislodge the dirt stuck inside. Let them sit a few minutes, to allow any grit inside the layers to fall to the bottom of the bowl. Repeat the process until the water is clean. Place the leeks, cut side down, on a towel and pat dry completely.", 
            "Turn the leeks over so their cut sides are facing up, and season with 2 teaspoons salt and a few grindings of black pepper.", 
            "Heat a large saute pan over medium-high heat for 2 minutes. Pour in 1/4 cup olive oil, and wait 1 minute. Place the leeks in the pan, cut side down, being careful not to crowd them. (you will probably need to saute them in batches or in two pans. Add more olive oil to the pan as needed, for each batch.) Sear them 4 to 5 minutes, until they are golden brown. Season the backs of the leeks with salt and pepper, and turn them over to cook another 3 to 4 minutes. Transfer them to a large gratin dish, lining them up, cut sides facing up. (Choose a baking dish or gratin dish that can go from oven to table and that will accommodate all the leeks and chick thighs, or use two smaller dishes.)", 
            "Pour 1/4 cup olive oil into the pan and heat over medium heat. Add the shallots, thyme, 1/4 teaspoon salt, and a pinch of pepper. Cook about 5 minutes, until the shallots are just beginning to color. Add the white wine and reduce by half. Add 1 1/2 cups stock, and bring to a boil over high heat.", 
            "Pour the liquid over the leeks. The stock should not quite cover them; add more stock if necessary.", 
            "Braise in the oven 30 minutes, until the leeks are tender when pierced. (This always takes longer in my oven, but is less to be concerned about if you’re going to top them with the chicken, in which case they’ll have plenty of additional baking time.)"
        ], 
        "date": "2009-02-12T19:48:12+00:00"
    }, 
    {
        "ingredient_list": [
            "Winter Warmth Syrup", 
            "1 1/2 cups water", 
            "1 cup raw, demerara or turbinado sugar (granulated will do just fine if you do not have them)", 
            "1/2 apple, peeled, cored, and diced", 
            "1/2 pear, peeled, cored, and diced", 
            "12 walnut halves", 
            "3 cinnamon sticks, broken up", 
            "6 whole cloves", 
            "1 whole nutmeg", 
            "For Each Cocktail", 
            "1 piece of orange peel (about 1 by 2 inches)", 
            "3/4 ounce Winter Warmth Syrup (recipe above)", 
            "2 dashes of bitters (Fee Brothers black walnut bitters are recommended, I used orange bitters)", 
            "2 ounces bourbon, rye or Canadian whisky"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/the-fairytale-of-new-york1.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Christmas", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/fairytale-of-new-york/", 
        "title": "fairytale of new york", 
        "directions": [
            "Make the winter warmth syrup: Combine all ingredients in a saucepan over medium heat. Bring to a simmer, stirring until the sugar dissolves, and simmer for 15 to 20 minutes. Remove from the heat and cool. Strain into a clean glass bottle, cover and refrigerate for up to 2 weeks. Makes about 2 cups.", 
            "Make a drink: Place the orange peel, syrup and bitters in a low glass and muddle. Pour in whiskey, add a large ice cube and don’t forget to share. ", 
            "Make a carafe: We brought 2 4-cup carafes of this to a party, using all of the syrup and about 5 1/2 cups bourbon. We tossed a few orange peels into each jar. Don’t forget to remind friends to pour it over ice (we forgot), so they are not asleep before, you know, Santa comes down the chimney."
        ], 
        "date": "2014-12-23T11:56:26+00:00"
    }, 
    {
        "ingredient_list": [
            "Brine", 
            "5 cups buttermilk", 
            "1 cup kosher salt", 
            "2 medium garlic heads, smashed but not peeled", 
            "1/4 cup sugar", 
            "2 tablespoons paprika", 
            "Batter", 
            "2 large eggs", 
            "2 teaspoons baking powder", 
            "1 teaspoon baking soda", 
            "2 cups buttermilk", 
            "Coating", 
            "6 cups flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/fried-chicken1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/01/fried-chicken/", 
        "title": "fried chicken", 
        "directions": [
            "Mix brine ingredients in a large bowl. Place the chicken pieces in brining solution and refrigerate for two to three hours. Remove and place on rack to air-dry.", 
            "Mix batter ingredients and place in a large bowl. Place coating in large pan to coat chicken.", 
            "Coat chicken with flour, then place in batter. Drain excess batter off chicken and place in flour again and cover. Use tongs for transfers.", 
            "To fry, heat peanut oil to 375 degrees in a cast-iron skillet. Do not fill the pot more than half full with oil. Place five to six pieces of chicken, skin side down first, in the skillet and cook, covered for seven minutes. Turn chicken and cook, uncovered, for another seven minutes. Allow the oil to return to 375 degrees F before frying the next batch.", 
            "Remove the chicken from the oil and place each piece on a metal baking rack set on a sheet pan, keeping warm in the oven until ready to serve."
        ], 
        "date": "2008-01-18T16:40:41+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups chocolate cookie crumbs or about 260 grams chocolate cookies", 
            "1 1/2 cups pecans, toasted and cooled", 
            "1/2 cup bourbon", 
            "1 cup powdered sugar", 
            "3 tablespoons unsweetened cocoa powder", 
            "1 1/2 tablespoons honey or molasses", 
            "Sprinkles, sanding or coarse sugar, additional chopped nuts, extra cookie crumbs or coconut to roll balls in"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/fudgy-bourbon-balls1.jpg?w=640", 
        "tags": [
            "Bourbon", 
            "Candy", 
            "Chocolate", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/12/fudgy-bourbon-balls/", 
        "title": "fudgy bourbon balls", 
        "directions": [
            "In the bowl of a food processor, pulse together the cookies, whole or already in crumbs, and pecans until the nuts are finely ground. In small dish, whisk together the bourbon, powdered sugar, cocoa and honey until smooth. Add to the food processor bowl and pulse until just combined. ", 
            "Set aside at room temperature, uncovered, for 30 minutes to 1 hour, or up to 4 hours, to give the crumbs a chance to absorb the liquid and become more fudgy and easier to roll.", 
            "Scoop dough into about 1-inch or 1 tablespoon-sized balls and roll them in toppings of your choice. The balls can be stored at room temperature or in the fridge. If at room temperature, you can leave them covered for more moisture or uncovered if you like them with more of a crust. Balls will keep for as long as you can hide them from people. ", 
            "Notes: I’m going to do a little Q&A with the comment section that lives in my head. :) "
        ], 
        "date": "2015-12-31T11:25:56+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 ripe bananas, smashed", 
            "1/3 cup (75 grams) melted salted butter", 
            "3/4 to 1 cup (145 to 190 grams) light brown sugar (depending on the level of sweetness you prefer, I always use the smaller amount)", 
            "1 egg, beaten", 
            "1 teaspoon (5 ml) vanilla", 
            "1 tablespoon (15 ml) bourbon (optional)", 
            "1 teaspoon (5 grams) baking soda", 
            "Pinch of salt", 
            "1 teaspoon (3 grams) cinnamon", 
            "Up to 1/2 teaspoon (1) nutmeg", 
            "Pinch of ground cloves", 
            "1 1/2 cups (190 grams) flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/jacked-up-banana-bread.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Bourbon", 
            "Cake", 
            "Everyday Cakes", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/jacked-up-banana-bread/", 
        "title": "jacked-up banana bread", 
        "directions": [
            "Preheat the oven to 350°F. With a wooden spoon, mix butter into the mashed bananas in a large mixing bowl. Mix in the sugar, egg, vanilla and bourbon, then the spices. Sprinkle the baking soda and salt over the mixture and mix in. Add the flour last, mix. Pour mixture into a buttered 4×8 inch loaf pan. Bake for 50 minutes to one hour, or until a tester comes out clean. Cool on a rack. Remove from pan and slice to serve.", 
            "Note: Due to my unhealthy obsession with tiny things, I split this into two mini-loaf pans. It took 45 minutes to bake two perfect halves, but of course, may run longer or shorter in your oven."
        ], 
        "date": "2006-11-16T18:00:50+00:00"
    }, 
    {
        "ingredient_list": [
            "5 cups of a mixture of whole milk and half-and-half (4:1 is suggested, but I might go more like 3:2 next time)", 
            "1 1/2 cups bourbon, another whiskey or brandy", 
            "1 cup powdered sugar, sifted", 
            "1 tablespoon vanilla extract", 
            "Freshly grated nutmeg, for garnish."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/12/milk-punch.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2010/12/milk-punch/", 
        "title": "milk punch", 
        "directions": [
            "In a pitcher, whisk together milk, half-and-half, bourbon, sugar and vanilla. Freeze until slushy, which will take 3 to 4 hours, but you can leave it in there up to a day. Stir before serving it in chilled glasses, finished with a few gratings of fresh nutmeg."
        ], 
        "date": "2010-12-31T17:52:35+00:00"
    }, 
    {
        "ingredient_list": [
            "Broth", 
            "2 medium-large yellow onions, unpeeled, halved or 1 large onion plus 1 large leek, cleaned and cut lengthwise", 
            "2 garlic cloves, peeled and smashed a little", 
            "1 large carrot", 
            "1 large parnsip (optional)", 
            "1 celery rib", 
            "4 quarts water", 
            "4 pounds chicken bones (from about two carcasses leftover from a roast or rotisserie) or a combination of fresh chicken wings (my first choice), backs, necks or feet", 
            "1 tablespoon kosher salt", 
            "1/2 teaspoon dried thyme or 2 teaspoons chopped fresh", 
            "1/8 teaspoon red pepper flakes", 
            "1 tablespoon tomato paste", 
            "1 bay leaf", 
            "To Finish", 
            "3 bone-in skin-on chicken breast halves", 
            "2 large carrots, peeled and diced or 1 large carrot and 1 large parsnip, diced", 
            "1 large leek, trimmed and sliced into 1/2-inch segments", 
            "1 to 2 celery ribs, chopped or diced", 
            "9 ounces thin egg noodles or soup noodles of your choice", 
            "2 tablespoons finely-chopped flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/my-ultimate-chicken-noodle-soup1.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Photo", 
            "Soup", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/01/my-ultimate-chicken-noodle-soup/", 
        "title": "my ultimate chicken noodle soup", 
        "directions": [
            "Make the broth: ", 
            "[On the stove] Combine all ingredients in a large (6 to 8 quart) stock pot over high heat and bring to a boil. Once boiling, reduce to a gentle simmer, skim any unpleasant looking foam (“skim the scum” is kitchen parlance for this step, but I’m trying to be polite) and cover with a lid. Simmer for 2 1/2 hours. ", 
            "[In a slow-cooker] Combine all ingredients in a large (6 quart or larger) slow-cooker. Cook on LOW for 10 hours or HIGH for 5. Strain into a large pot (5.5 quarts or more) and let rest in the fridge until needed, or, if you’re finishing the soup right away, bring to a simmer on the stove. ", 
            "Cook the chicken:", 
            "[Both methods] Add whole chicken breasts to simmering broth. Simmer for 20 minutes, until they’re cooked through, then strain broth [for stovetop method] or simply remove cooked chicken breasts [from the slow-cooker method] and set them aside. Taste broth, and adjust seasoning if needed. ", 
            "Finish the soup:", 
            "Add diced vegetables to simmering broth on stove and cook for 5 minutes, until firm-tender. Add soup noodles and cook according to package instructions, usually 6 to 10 minutes. Meanwhile, once chicken breasts are cool enough to handle, remove skin and bones and shred or chop into small chunks. Return chicken to soup and simmer for 2 minutes, until heated through. Finish with parsley and serve to some very lucky people. ", 
            "To de-fat the broth: Once the broth portion is complete and the soup has settled a little, you can skim any fat that’s accumulated at the surface with a soup skimmer or spoon, to taste. If you’re going to chill the broth before finishing the soup another day, it’s easiest to take the fat off right before you use it; it will have solidified at the surface. P.S. Don’t toss it, please! It makes for wonderful matzo balls and fried latkes. "
        ], 
        "date": "2015-01-05T11:56:19+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 cup (125 grams) all-purpose flour", 
            "1/4 teaspoon fine sea or table salt", 
            "1/4 cup granulated (50 grams) or powdered (30 grams) sugar", 
            "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", 
            "Filling", 
            "6 tablespoons (85 grams) unsalted butter", 
            "1/3 cup dark brown sugar", 
            "1/3 cup granulated sugar", 
            "1 large egg", 
            "1 large egg yolk", 
            "1/4 teaspoon coarse or kosher salt", 
            "1 tablespoon bourbon (optional)", 
            "1 teaspoon vanilla extract", 
            "6 tablespoons all-purpose flour", 
            "3/4 cup (4 1/2 ounces or 130 grams) chocolate chips or chopped chocolate", 
            "3/4 cup toasted (always) and coarsely chopped walnuts or pecans", 
            "Flaky sea salt on top, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/not-derby-pie-bars1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Bourbon", 
            "Chocolate", 
            "Photo", 
            "Picnics", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2015/04/not-derby-pie-bars/", 
        "title": "not derby pie bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. A little nonstick spray underneath helps keep the strips in place. (If you have an 8-inch square springform, you can skip this and just butter it lightly.)", 
            "Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take another 30 seconds for it to come together, but it will. Transfer the dough clumps to prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. Meanwhile, prepare the filling.", 
            "Make the filling: Melt your butter and, if desired, brown it too, by continuing to cook the butter in a small saucepan over medium heat, stirring frequently, until golden brown bits form at the bottom, about 5 minutes. Transfer butter to a large bowl and let it cool; you can hasten this along by setting it in the freezer for a couple minutes or stirring it over an ice water bath.", 
            "Whisk sugars into butter until smooth, then egg, (edited to add) yolk, salt, bourbon (if using) and vanilla. Stir in flour until just combined, then mix in chocolate and nuts. Pour over par-baked crust, spreading evenly. Sprinkle lightly with sea salt before baking, if desired. ", 
            "Bake bars: For 20 to 25 minutes, until top is firm and golden. Bars are much easier to cut if you let them cool almost completely, but I suspect there’s little fun in that. Once they’re cool, however, you can easily transfer them from the pan to a cutting board with the parchment paper sling you created. Serve plain, with whipped cream or a tiny scoop of vanilla ice cream. Can dust with powdered sugar for extra pretties. ", 
            "Store at room temperature for up to 3 days, or in the fridge for longer."
        ], 
        "date": "2015-04-30T12:00:22+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds uncooked chicken wings", 
            "3 quarts water", 
            "1 large onion, chopped", 
            "1 garlic clove, smashed", 
            "1 teaspoon table salt, or more to taste*"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/perfect-uncluttered-chicken-stock1.jpg?w=640", 
        "tags": [
            "Chicken", 
            "Photo", 
            "Slow Cooker", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2013/11/perfect-uncluttered-chicken-stock/", 
        "title": "perfect, uncluttered chicken stock", 
        "directions": [
            "How should I use this? You can use this as stock or broth in any soup. You can use it to cook grains or beans. But most importantly, the flavor is so wonderful that you can have it straight. It particularly excels in broth-y soups, like Chicken Noodle, Matzo Ball and Italian Wedding-style soups, where you directly taste the stock. Here, I show you how I simmered in some vegetables (and later, chicken chunks) to make a chicken noodle soup. Next, I’d love to talk about soup noodles, but at 1,500-plus words here, I think I’ve done run out of space, eh?", 
            "How should I store this? If I’m not using it immediately, I divide it into 1 quart freezer bags and freeze them flat. This is a great old trick from Real Simple magazine, as the flat bags can easily be dipped in hot water for quick defrosting. 1 quart of stock in gallon bags will freeze even thinner and flatter. They also stack well in the freezer. I won’t lie; I felt like a SuperDuperDomesticDiva when I can heat up one of these with some simple vegetables and noodles when one of us is getting sick. Then I remember I don’t want to set the table and hate doing dishes and go back to being myself. Anyway, it can also be frozen in ice cube trays for tiny amounts (great to add flavor to cooked grains or beans) and CI recommends nonstick standard muffin pans for 1/2-cup servings.", 
            "Why chicken wings? In Cook’s Illustrated’s chicken broth tests, they found that both chicken legs along and necks and backs lent a “livery” taste to the broth. In my own experiments, saving the backs of chickens that I take apart in the freezer to later make broth with, I reluctantly agree (i.e. I wish it were some other way). Chicken wings, with their high bone-to-flesh ratio, made most refined and full-flavored broth and it took me a single sip of this stock to be fully converted.", 
            "Do I have to toss the cooked wings when I’m done? Yes and no. I find them overcooked, but not really inedible, so it’s a matter of preference. One thing I love about this recipe is that wings have so little usable flesh, it feels less wasteful than making chicken with larger parts can be (especially because they usually get overcooked and tough, thus, at least I do want to eat them).", 
            "* What’s the difference between stock and broth? In most grocery store aisles, they’re used interchangeably but technically, there are small small differences. Stock is often heavier in bones and things that will add body, as this recipe is, though it doesn’t have to be. However, it is unseasoned, which means to make this a true stock, you would skip the salt. Stock is often used in restaurants to make reductions (it is really the backbone of restaurant cooking), and if you reduce something already salty, obviously, you will have an oversalted mess. So, salt is added when needed for final dishes.", 
            "Why did this take you two years to tell us about it, Deb?! I was reluctant at first to share this recipe (despite being unable to stop myself from gushing about it to anyone who asked and a great many people who did not) because it felt excessively lush to me. I mean, three pounds of wings just to throw them away? Given, it’s quite easy to buy wings inexpensively in bulk (sometimes as disturbingly cheap as $1/pound), but if you prefers to buy local/cage-free/etc.-type chicken, it’s not exactly the cheapest way to approach what’s supposed to be the most economical kitchen ingredient, designed to use up scraps. But, when I actually ran the numbers, using wings on the priciest end of the spectrum (here, organic/antibiotic-free $3.99/pound and each pound of parts yields 1 quart of stock) the equivalent stuff from the box (the organic, free-range broth I’d buy is $4.50/quart, boasted such lovely ingredients as “yeast extract” and “chicken flavor), I realized that even if the taste didn’t speak for itself (it will), I’d been wrong about the cost. ", 
            "When are you going to make a life-changing vegetable broth, for the rest of us? Soon. But it’s far more complicated because I don’t think that there is one magical combination of vegetables that will yield the ideal vegetable stock, it’s more about what flavors you enjoy lingering in the background your soups. Boy, I’m glad we had this talk because the kind of vegetable stock I’d like to make just totally hit me. ", 
            "[New additions to the list, based on comments below]", 
            "Why is my stock so thick? I’m sorry I didn’t mention this sooner, but if you’ve never made stock before, it might have been a surprise to find that it became like Jell-o in the fridge over night. This is a good thing; this is excellent! It actually became exactly like Jell-o because stocks cooked for a long time with bones release the natural collagen in them. Stocks that jiggle when cool are the ones with the best and deepest flavors. Once warmed (even a little), it will immediately re-liquefy — do not fret. ", 
            "I had expected more flavor. If this stock ended up not having the flavor you were hoping for, there are a couple directions you could go in:", 
            "* Edited again to add: However, upon further consideration, my first choice would be #2, to cook it longer. With this many bones and that little water, I’m more and more convinced that any lack of flavor just means that it’s possible your slow-cooker is more gentle on heat than others (I do know that mine is on the robust/running-hot side), and that it would benefit from more cooking time. The flavor is there, in the bones, it’s just a matter of whether the stock has been cooked enough to access it. "
        ], 
        "date": "2013-11-07T11:55:29+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cloves garlic, peeled", 
            "1/2 a large or 1 small shallot, peeled, roughly chopped", 
            "1/2 medium red bell pepper, seeded, roughly chopped", 
            "1 piri piri, bird’s eye or other small red chili pepper, chopped, plus more to taste", 
            "1/4 cup fresh parsley or cilantro leaves, plus more for garnish", 
            "1 teaspoon paprika (I used smoked, regular is fine)", 
            "1/2 teaspoon dried oregano", 
            "Most of the finely grated zest and all of the juice of 1 lemon", 
            "2 teaspoons red wine vinegar", 
            "1 tablespoon olive oil, plus more for grill grates", 
            "1 teaspoon kosher salt", 
            "1 3 1/2 pound chicken or 3 1/4 pounds bone-in, skin-on chicken parts"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/piri-piri-chicken.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Grilling", 
            "Photo", 
            "Portuguese"
        ], 
        "url": "https://smittenkitchen.com/2016/09/piri-piri-chicken/", 
        "title": "piri piri chicken", 
        "directions": [
            "\nIn a food processor or blender, combine garlic, shallot, bell pepper, chili, 1/4 cup parsley, paprika, oregano, lemon zest and juice, red wine vinegar, olive oil and salt and blend until as smooth as possible.\nTo spatchcock (remove the backbone from) your chicken: Place on a cutting board and use kitchen shears to cut along each side of the backbone, removing it and saving it for a future post of soup. [Here’s the shortest video I could find demonstrating this.] Open the chicken like a book, flattening it out. Place in a large dish.", 
            "Pour about 1/3 marinade over inside of chicken, the flip and pour another 1/3 over the outside. Set aside the last 1/3 for serving. Let the chicken marinate for as long as you have to spare; 20 minutes at room temperature or a few hours (or even a day) in the fridge.\nIf using chicken pieces, marinate them as well in a big dish with 2/3 of the sauce.\nHeat a grill over medium high. Oil the grill grates. Place spatchcocked chicken skin side down on grill, spoon on some marinade that landed in the pan, cook for about 15 minutes, until it is nicely charred underneath. Use large tongs to flip it, pour or spoon any extra marinade over the skin and cook for another 15 to 25 minutes, until a thermometer inserted into thicker parts of the bird reads 165°F. Let rest for 5 minutes before cutting into pieces.\nFor chicken pieces, you’ll only need about 10 minutes per side, depending on size.\nNo grill? In the oven, I usually roast spatchcocked chickens at 450°F for 35 to 45 minutes, or until a thermometer inserted into thicker parts of the bird reads 165°F. Chicken pieces are usually done in 30 to 35.\nGarnish with extra herbs and serve with remaining sauce on the side.\n"
        ], 
        "date": "2016-09-07T12:01:54+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds chicken parts (thighs, drumsticks, and/or breasts), with skin and bones", 
            "1 tablespoon vegetable oil", 
            "2 small shallots, thinly sliced", 
            "3/4 cup dry white wine", 
            "3/4 cup reduced-sodium or sodium-free chicken broth", 
            "1/4 cup heavy cream", 
            "2 tablespoons smooth Dijon mustard", 
            "1 tablespoon finely chopped chives or the green parts of scallions"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/01/roast-chicken-with-dijon-sauce.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2011/01/roast-chicken-with-dijon-sauce/", 
        "title": "roast chicken with dijon sauce", 
        "directions": [
            "Preheat oven to 450°F with a rack in middle. Pat chicken dry and season generously with salt and freshly ground black pepper. Heat oil in an ovenproof 12-inch heavy skillet (if you’ve got a cast iron skillet, it is great here) over medium-high heat until it shimmers. Working in 2 batches, brown chicken, skin side down first and turning once, about 5 minutes per batch. I like to take a lot of care in this step, not moving the chicken until the skin releases itself and has a nice bronze on it, which will provide the best flavor. ", 
            "Return all chicken, skin side up, to skillet and roast in oven until just cooked through, 15 to 20 minutes. Transfer chicken to a platter, then add shallots, wine, and broth to pan juices in skillet and boil, scraping up any brown bits, until reduced by half, 2 to 3 minutes. Add cream and boil until slightly thickened, about 1 minute. To thicken the sauce further, turn the heat to high and boil it until it reduces to a consistency you prefer.", 
            "Strain sauce through a sieve into a bowl, if you’re feeling fancy (I never am, but if you don’t, you might find some chicken bits scraped up from the pan in your sauce. We don’t mind.) Whisk in mustard, chives, and salt and pepper to taste. Serve chicken with sauce. "
        ], 
        "date": "2011-01-27T08:40:35+00:00"
    }, 
    {
        "ingredient_list": [
            "For the chicken", 
            "1 3/4-inch piece of ginger, peeled and minced (see Note up top)", 
            "4 cloves of garlic, minced or pressed", 
            "1 fresh green chili (I used a jalapeno), seeded and minced", 
            "1/2 cup whole-milk yogurt", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon chili powder or cayenne, or adjusted to taste (I used 1/4 teaspoon)", 
            "1/2 teaspoon ground turmeric", 
            "1/2 teaspoon ground cumin", 
            "3/4 teaspoon granulated sugar", 
            "1 teaspoon paprika", 
            "1 teaspoon garam masala", 
            "2 pounds chicken thighs, drumsticks or halved chicken breasts (all skin-on, bone-in)", 
            "For the vegetables", 
            "3 tablespoons olive oil", 
            "1 1/4 pounds (about 4 medium) Yukon Gold potatoes, peeled if desired, cut into 3/4-inch chunks", 
            "1 3/4 pounds (1 small or half a very large head) cauliflower, cut into 3/4-inch-wide florets", 
            "1/2 teaspoon kosher salt", 
            "1/2 teaspoon cumin seeds", 
            "To finish, if desired", 
            "A few thin slices of red onion", 
            "Lemon wedges", 
            "Salt", 
            "Dollops of yogurt", 
            "A few tablespoons roughly chopped cilantro, parsley or mint, or a mix therof"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/sheet-pan-chicken-tikka1.jpg?w=640", 
        "tags": [
            "Cauliflower", 
            "Chicken", 
            "Gluten-Free", 
            "Indian", 
            "Photo", 
            "Potatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/04/sheet-pan-chicken-tikka/", 
        "title": "sheet pan chicken tikka", 
        "directions": [
            "Combine ginger, garlic, fresh chili, yogurt, salt, spices and sugar in a freezer bag, bowl or container. Add chicken pieces and toss to coat evenly. Let marinate for 15 minutes or up to a day in the fridge.", 
            "When you’re ready to cook the dish, heat your oven to 425°F. Line a half-sheet (13×18-inch) with foil and coat it with 1 tablespoon of the olive oil. Add potatoes, cauliflower, salt, cumin and remaining 2 tablespoons olive oil and toss together with you hands until evenly coated.", 
            "Remove chicken from marinade and leave excess behind. Make spaces in the vegetables for chicken parts throughout the pan. Roast in oven for 20 minutes, then toss the potato and cauliflower to ensure they’re cooking evenly, and return the pan to the oven for 10 to 20 minutes more (i.e. 30 to 40 minutes total roasting time), until chicken and vegetables are cooked through. ", 
            "While it roasts, if you’d like to use the lightly pickled onion rings that we did on top, which added a nice tangy fresh zip to the dish, separate the rings and toss them in a small bowl with a squeeze of lemon juice and a pinch of salt. Set aside until needed.", 
            "When chicken and vegetables are cooked, top with garnishes of your choice — we used dollops of yogurt, herbs and scattered the above onion rings all over. Serve right in the pan."
        ], 
        "date": "2016-04-12T11:59:44+00:00"
    }, 
    {
        "ingredient_list": [
            "For the chicken", 
            "1 1/2 pounds boneless, skinless chicken thighs (though, frankly, a little more or less will be fine here)", 
            "2 tablespoons lime juice (half a juicy lime)", 
            "1 1/2 teaspoons kosher salt", 
            "1 1/2 teaspoons dried oregano", 
            "2 teaspoons ground cumin", 
            "1 teaspoon chili powder", 
            "1/2 teaspoon smoked paprika", 
            "1 garlic clove, minced or pressed", 
            "Few dashes hot sauce, optional", 
            "To assemble", 
            "8 (6-inch) flour or corn tortillas", 
            "Olive oil", 
            "2 large bell peppers, cut into thin strips (I use a mix of green, red and other colors, if I can find them)", 
            "1 large yellow or sweet onion, halved and sliced thin", 
            "Coarse salt", 
            "Fixings (pick your favorites)", 
            "1 1/2 cup cooked black beans (1 15-ounce can, drained and rinsed)", 
            "Salsa or pico de gallo", 
            "Sliced avocado or guacamole", 
            "Shredded cheese or sour cream", 
            "Minced white onion or pickled red onions", 
            "Chopped cilantro, pickled jalalpenos, hot sauce and lime wedges"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/sizzling-chicken-fajitas1.jpg?w=640", 
        "tags": [
            "Chicken", 
            "Photo", 
            "Tex-Mex", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/03/sizzling-chicken-fajitas/", 
        "title": "sizzling chicken fajitas", 
        "directions": [
            "Slacker Pico de Gallo: Diced tomatoes + minced white onion + 1 minced jalapeno + squeeze of lime juice + splash of olive oil + salt + cilantro, if that’s your thing.", 
            "Pickled Red Onions: Mix 1/4 cup red wine vinegar + 1/4 cup cold water + 1 1/2 teaspoons granulated sugar + 1 tablespoon Diamond Kosher salt or generous 1/2 tablespoon Morton or another brand of kosher salt until sugar and salt have dissolved. Add thinly sliced red onion. Let marinate for 30 minutes (for very light pickling) or up to a week in the fridge. Put on everything."
        ], 
        "date": "2014-03-20T12:08:04+00:00"
    }, 
    {
        "ingredient_list": [
            "Brine", 
            "4 cups water", 
            "1/3 cup Kosher salt", 
            "1/3 cup white or brown sugar", 
            "1/3 cup white vinegar", 
            "Dry Rub", 
            "6 tablespoons packed dark brown sugar", 
            "4 tablespoons sweet or smoked paprika", 
            "3 tablespoons chili powder", 
            "Up to 1 tablespoon ground red pepper (if you like things quite hot) or to taste (I used 1/2 teaspoon)", 
            "2 teaspoons garlic powder", 
            "1 teaspoon ground cumin", 
            "1/2 teaspoon ground nutmeg", 
            "2 tablespoons Kosher salt", 
            "Up to 1 tablespoon coarsely ground black pepper", 
            "Chicken", 
            "5 1/2 to 6 pounds mixed bone-in skin-on chicken parts (we used 2 small chickens, each in 8 parts)", 
            "Sauce", 
            "A generous squeeze of honey", 
            "1 teaspoon cider vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/slow-and-low-dry-rub-oven-chicken.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Grilling", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/07/slow-and-low-dry-rub-oven-chicken/", 
        "title": "slow-and-low dry rub oven chicken", 
        "directions": [
            "Brine the chicken: In a large plastic container, mix water, salt, sugar and vinegar. Add chicken parts and cover with a lid or plastic wrap in the fridge, for at least 1 hour and up to 6. ", 
            "Make the rub: Mix ingredients.", 
            "Prepare chicken: Heat oven to 300 degrees. Remove chicken parts from brine and pat dry. Place pieces of chicken on two very large pieces of foil, large enough to fold over chicken and form packets. Pat chicken pieces generously on all sides with rub; do not be shy about using more than seems… seemly. Turn the chicken pieces so their meatier sides are down, and tightly fold the foil around them to make two large packets.", 
            "Place two cooling racks (which will act as baking racks) on two baking sheets (one on each). Place a chicken packet on each and place one sheet on an upper oven rack and one on a lower. Bake chicken for 1 hour, then rotate baking sheets. Bake for another 30 to 60 minutes, until the internal temperature of the thickest part of each chicken reads 155 degrees. (Chicken is done at 160. This leaves you a little heat window for the next step, without leading to overcooking. If you’d like to skip this, just cook the chicken in foil until it reaches 160.)", 
            "Finish the chicken: Heat broiler. Carefully open each packet of chicken and pour accumulated juices into a saucepan (to make a sauce in a minute). Arrange chicken pieces on open foil packets and run each tray under the broiler until lightly crisped at edges and cooked through. Place on serving platter.", 
            "Make a sauce* from the juices: Boil your accumulated juices in the saucepan over high heat for anywhere from 5 to 10 minutes, until it makes a syrupy sauce that coats a spoon. I like to add a squeeze of honey for flavor while it reduces. Once syrupy, add 1 teaspoon apple cider vinegar. Serve with chicken. ", 
            "* I wanted to warn that I love making sauce this way, but it always ends up a bit too salty from all of that reduction. You could use less or simply skip this step, using instead another barbecue sauce of your choosing (this one says “Remember me?!”, should you desire sauce with your chicken."
        ], 
        "date": "2013-07-08T12:17:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large skin-on, bone-in chicken breast (about 12 to 14 ounces)", 
            "About 2 1/2 tablespoons olive oil", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "Salt and freshly ground black pepper", 
            "1 tablespoon white wine vinegar", 
            "1/2 small cucumber, such as a Persian variety, halved, thinly sliced", 
            "1 small celery rib, sliced thin", 
            "3 radishes, quartered lengthwise, sliced thin", 
            "1 scallion, sliced thin", 
            "1 tablespoon chopped dill, chives or parsley, or a mix, for garnish", 
            "3 tablespoons creme fraiche", 
            "1 1/2 teaspoons prepared horseradish, liquid drained off a little, plus more to taste", 
            "2 to 3 thin slices rye, pumpernickel or another dense health bread, toasted "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/spring-chicken-salad-toasts1.jpg?w=750", 
        "tags": [
            "Celery", 
            "Chicken", 
            "Cucumber", 
            "Photo", 
            "Radishes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2016/03/spring-chicken-salad-toasts/", 
        "title": "spring chicken salad toasts", 
        "directions": [
            "Heat oven to 425°. Place chicken on a small rimmed baking sheet and rub with 1 tablespoon olive oil. Season with salt and pepper and roast until golden brown and cooked through, about 25 to 30 minutes. Let cool, then remove skin and bones and shred meat into bite-sized pieces. ", 
            "Place shredded chicken in a medium bowl and toss with 1 1/2 tablespoons olive oil, 1 tablespoon vinegar, 1/2 teaspoon kosher salt and freshly ground black pepper until evenly coated. Add cucumber, celery, radishes and scallion to salad and toss to combine. Adjust salt, pepper and vinegar to taste.", 
            "If you need horseradish crème fraîche\tin your life — I know I always do — combine crème fraîche, horseradish and a couple pinches salt in a small dish and stir to combine. ", 
            "Heap salad on 2 to 3 toasts (i.e. more on 2 or less on 3). Dollop with horseradish creme fraiche, if using, and garnish with herbs.", 
            "Do Ahead: Chicken can be cooked 2 days ahead; cover and chill. Shred just before using."
        ], 
        "date": "2016-03-28T12:00:20+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds chicken wingettes or chicken wings (see note up top)", 
            "1 large garlic clove, minced", 
            "1 teaspoon coarse or kosher salt, plus more to taste", 
            "2 tablespoons soy sauce", 
            "2 tablespoons hoisin sauce", 
            "2 tablespoons mild honey (I often halved this)", 
            "1 teaspoon Asian sesame oil", 
            "Pinch of cayenne or dash of Sriracha", 
            "1 1/2 tablespoons sesame seeds, lightly toasted", 
            "1 scallion, finely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/sticky-sesame-chicken-wings1.jpg?w=640", 
        "tags": [
            "Chicken", 
            "Chinese", 
            "Photo", 
            "Quick", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/07/sticky-sesame-chicken-wings/", 
        "title": "sticky sesame chicken wings", 
        "directions": [
            "Heat oven to 425°F. Line a large shallow baking pan with foil and lightly oil it. ", 
            "Stir wings together with garlic, salt, soy, hoisin, honey, sesame oil and cayenne or Sriracha until coated. Spread wings and any sauce that fell to the bottom of the bowl out on the prepared baking pan in one layer. Roast, turning over once, until cooked through, about 35 minutes. Transfer wingettes to a large serving bowl* and toss with sesame seeds and scallion.", 
            "* If you end up with a puddle of sauce in the bottom of your baking pan (I did the one time they were more tightly packed in a dish), after removing the wings, you can pour the extra sauce into a saucepan and reduced it until thick, then stir it over the roasted wings before adding the sesame seeds and scallion."
        ], 
        "date": "2014-07-07T11:39:36+00:00"
    }, 
    {
        "ingredient_list": [
            "5 garlic cloves, coarsely chopped", 
            "1/4 cup chopped cilantro (or flat-leaf parsley if you are cilantro-averse)", 
            "1/4 cup Asian fish sauce*", 
            "1/4 cup vegetable oil", 
            "2 tablespoons hoisin sauce (I accidentally doubled this and can only advise you do the same)", 
            "1 1/2 teaspoons ground coriander", 
            "1 teaspoon kosher salt", 
            "1 teaspoon freshly ground black or white pepper", 
            "8 whole chicken legs, split, or 8 drumsticks and 8 thighs (about 5 pounds total)", 
            "Thai sweet chili sauce, for serving "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/thai-style-chicken-legs1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Grilling", 
            "Photo", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2010/07/thai-style-chicken-legs/", 
        "title": "thai-style chicken legs", 
        "directions": [
            "Combine the garlic, cilantro, fish sauce, vegetable oil, hoisin sauce, coriander, kosher salt and pepper in a blender until smooth. Arrange the pieces of chicken in a large, shallow glass or ceramic dish. Pour the marinade over the chicken and turn to coat the pieces thoroughly. Cover and refrigerate for several hours, or overnight.", 
            "To roast the chicken: Preheat oven to 450 degrees. Cover baking dish with a lid or foil and roast chicken for about 25 minutes. If the sauce begins to char, sprinkle a few tablespoons water into the dish. Remove the lid or foil and bake for an additional 5 to 10 minutes, until the skin is crisp and the meat is cooked through.**", 
            "To grill the chicken: [Lacking a grill, I did not test this method but I will be happy to if you invite me over tonight, okay?] Light a grill. If using a gas grill, turn off the center burners; if using a charcoal grill, once the coals are covered with a light ash, push them to opposite sides, forming a well in the middle. Set a disposable drip pan in the center. Cook chicken on the hot grate above, skin side down, with the cover down for about 40 minutes. The skin should be crisp and the meat should be cooked through.**", 
            "Both methods: Once cooked, transfer to plates and serve with Thai chili sauce.", 
            "Do ahead: The marinade can be refrigerated overnight. I like it so much, I am tempted to make a larger batch of it to keep in the freezer until needed.", 
            "* Don’t like fish sauce? Don’t want to eat it? Neither did I before about five minutes ago. Anyway, I often see low-sodium soy sauce suggested as an alternative but I’m not convinced it’s a fair swap. There’s something more caramelized and fermented in the fish sauce that you’d miss. If you feel like playing around, I might whisk some additional hoisin or even miso into that soy sauce for a more complex flavor.", 
            "** To ensure your chicken is “cooked through”: Lacking x-ray vision and decades of chicken-cooking practice, I’m a big fan of using a thermometer to ensure that my meat is properly cooked. A thermometer inserted into the thigh/leg joint should register 180 to 185 degrees if you’re following Proper Chicken Cooking Protocol, or 170 to 175 degrees, if you’re me, and have very specific chicken-cooking preferences despite what food safety experts advise. I like to live on the edge, obviously. Another classic, though less precise way, to see if chicken is cooked through is to pierce it with a knife. If the juices that run out are clear, your chicken should be just right."
        ], 
        "date": "2010-07-12T11:30:28+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/the-perfect-manhattan1.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Drinks", 
            "Fall", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2015/09/the-perfect-manhattan/", 
        "title": "the perfect manhattan", 
        "directions": [
            "Add rye, vermouths and bitters to a cocktail shaker with ice and stir (if you want to be uber-traditional about it) or shake them together. Strain ice as you pour into a rocks or martini glass, or pour ice and drink into a tumbler. Garnish and enjoy slowly because this is bonkers potent.", 
            "Rye vs. bourbon and other whiskeys from a non-expert, i.e. corrections welcome: American rye whiskey must be distilled from at least 51% rye, but rye does not, by definition, have to be made in America. Canada produces a lot of rye whiskey, but by their own regulations. Bourbon must be distilled from at least 51% corn. It must be made in America and is most often made in Kentucky. Tennessee whiskey, basically bourbon whiskey from Tennessee, uses something called the Lincoln County Process in which whiskey, after it is distilled, is filtered through sugar-maple charcoal, making it amazing. American rye tends to be more dry and spicy than bourbon, which is fuller in body with a vanilla/caramel vibe. Rye is more traditional in the Manhattan cocktail, largely because Manhattan was a rye town when the drink was hatched in the late 1800s. How did I do? ", 
            "Angostura vs. peychauds vs. orange bitters: Angostura, traditional for the Manhattan, is made from a secret recipe, and is quite aromatic. Peychauds, slightly spicier and more sweet, is a great second choice (and what I used instead). Orange bitters are not traditional, but I think taste great in an Manhattan, although giving it more of an old-fashioned vibe."
        ], 
        "date": "2015-09-25T11:26:17+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds boneless chicken thighs", 
            "1 large white onion, peeled and quartered", 
            "5 cloves garlic, peeled and lightly crushed", 
            "2 bay leaves", 
            "1 tablespoon ground cumin", 
            "1 ancho or other mild dried chili, optional", 
            "Salt and pepper to taste.", 
            "2 large fresh ripe tomatoes, chopped", 
            "1/2 large white onion, peeled and minced", 
            "1/4 teaspoon minced raw garlic, or to taste", 
            "1 habanero or jalapeño pepper, stemmed, seeded and minced, or to taste", 
            "1/4 cup chopped cilantro leaves", 
            "1 tablespoon fresh lime juice or 1 teaspoon red-wine vinegar", 
            "Salt and freshly ground pepper."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-taco-joint-on-my-shirt1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Photo", 
            "Tex-Mex", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2006/08/the-taco-joint-on-my-shirt/", 
        "title": "chicken tacos + salsa fresca", 
        "directions": [], 
        "date": "2006-08-01T09:11:50+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup freshly squeezed lemon juice (with an efficient squeezer, you should get this plus up to 1/3 cup extra from 2 pounds of 8 lemons)", 
            "2 1/2 cups cold water, plus additional if needed", 
            "1/4 to 1/2 cup maple syrup", 
            "Bourbon", 
            "Lots of ice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/05/5719436567_ffb51c3a26_b.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Citrus", 
            "Drinks", 
            "Lemon", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2011/05/vermontucky-lemonade/", 
        "title": "vermontucky lemonade", 
        "directions": [
            "Mix lemon juice with 2 1/2 cups water and 1/4 cup maple syrup. Taste for sweetness. If you like your lemonade sweeter, add remaining 1/4 cup maple syrup. If you found the sweetness just right, add an additional 1/4 cup cold water instead. Stir to mix. This will yield 1 quart of maple lemonade.", 
            "Fill a glass with ice. We have a fiery debate at my house about whether this drink needs 1 or 1 1/2 shots of bourbon; my husband prefers more, but I like this drink a bit weaker. I’ll let you choose. Pour your desired amount of bourbon over the ice, fill the glass the rest of the way with maple lemonade and let the force of summer be with you."
        ], 
        "date": "2011-05-14T18:17:20+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/zuni-cafe-roast-chicken-bread-salad1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Date Night", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/12/zuni-cafe-roast-chicken-bread-salad/", 
        "title": "zuni cafe’s roasted chicken + bread salad", 
        "directions": [
            "Preheat the broiler. Carve off all of the bottom and most of the top and side crusts from your bread (you can reserve these to use as croutons for soup or another salad). Tear bread into irregular 2- to 3-inch chunks, wads, bite-sized bits and fat crumbs. You should get about 4 cups.", 
            "Toss them with just a tablespoon or two of olive oil, lightly coating them, and broil them very briefly, just to lightly color the edges. If you’d like to toast the pine nuts (recommended) you can put them on your broiler tray as well, but watch them very carefully — they cook quickly!", 
            "Combine about 1/4 cup of the olive oil with the Champagne or white wine vinegar and salt and pepper to taste. Toss about 1/4 cup of this tart vinaigrette with the torn bread in a wide salad bowl; the bread will be unevenly dressed. Taste one of the more saturated pieces. If it is bland, add a little salt and pepper and toss again.", 
            "Heat a spoonful of the olive oil in a small skillet, add the garlic and scallions, and cook over medium-low heat, stirring constantly, until softened. Don’t let them color. Scrape into the bread and fold to combine. Drain the plumped currants and fold them in, along with the pine nuts, if they were not already mixed with the bread scraps from the broiling step. Dribble the chicken stock or lightly salted water over the salad and fold again.", 
            "Taste a few pieces of bread — a fairly saturated one and a dryish one. If it is bland, add salt, pepper, and/or a few drops of vinegar, then toss well.", 
            "If you’re going to serve the salad under the roast chicken (recipe above), you can pile the bread salad on the serving dish you want to use and tent it with foil. If you want to serve it separately, do the same, but in a 1-quart shallow baking dish. Hang onto the bowl you mixed it in — you’ll use it again.", 
            "Place the salad in the oven after you flip the chicken the final time, for about 5 to 10 minutes.", 
            "Tip the bread salad back into the salad bowl. It will be steamy-hot, a mixture of soft, moist wads, crispy-on-the-outside-but-moist-in-the-middle-wads, and a few downright crispy ones. Drizzle and toss with a spoonful of the pan juices. Add the greens, a drizzle of vinaigrette, and fold well. Taste again."
        ], 
        "date": "2008-12-10T14:30:48+00:00"
    }
]