[
    {
        "ingredient_list": [
            "1 1/2 cups (190 grams) all-purpose flour", 
            "2 teaspoons baking powder", 
            "1/2 teaspoon kosher salt", 
            "1 cup (230 grams) plain whole-milk yogurt", 
            "1 cup (200 grams) plus 1 tablespoon (13 grams) sugar", 
            "3 extra-large eggs", 
            "1 tablespoon grated grapefruit zest (approximately one large grapefruit)", 
            "1/2 teaspoon pure vanilla extract", 
            "1/2 cup (120 ml) vegetable oil", 
            "1/3 cup (80 ml) freshly squeezed grapefruit juice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/01/grapefruit-yogurt-cake.jpg?w=750", 
        "tags": [
            "Cake", 
            "Citrus", 
            "Everyday Cakes", 
            "Fruit", 
            "Grapefruit", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2007/01/cake-paradisi/", 
        "title": "grapefruit yogurt cake", 
        "directions": [
            "Preheat the oven to 350°F. Grease an 8 1/2 by 4 1/4 by 2 1/2-inch loaf pan. Line the bottom with parchment paper. Grease and flour the pan.", 
            "Sift together the flour, baking powder, and salt into 1 bowl. In another bowl, whisk together the yogurt, 1 cup sugar, the eggs, grapefruit zest, and vanilla. Slowly whisk the dry ingredients into the wet ingredients. With a rubber spatula, fold the vegetable oil into the batter, making sure it’s all incorporated. Pour the batter into the prepared pan and bake for about 50 minutes, or until a cake tester placed in the center of the loaf comes out clean.", 
            "Meanwhile, cook the 1/3 cup grapefruit juice and remaining 1 tablespoon sugar in a small pan until the sugar dissolves and the mixture is clear. Set aside.", 
            "When the cake is done, allow it to cool in the pan for 10 minutes. Carefully place on a baking rack over a sheet pan. While the cake is still warm, pour the grapefruit-sugar mixture over the cake and allow it to soak in. Cool.", 
            "For the glaze, combine the confectioners’ sugar and grapefruit juice and pour over the cake."
        ], 
        "date": "2007-01-19T12:53:44+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/candied-grapefruit-peels1.jpg?w=500", 
        "tags": [
            "Candy", 
            "Citrus", 
            "Disasters", 
            "Fruit", 
            "Grapefruit", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/01/candied-grapefruit-peels/", 
        "title": "candied grapefruit peels", 
        "directions": [], 
        "date": "2008-01-31T09:11:16+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup walnut pieces", 
            "1 cup dried Turkish or Calimyrna figs, quartered", 
            "3/4 stick (6 tablespoons or 3 ounces) unsalted butter, softened", 
            "1/4  cup granulated sugar, plus more for sprinkling", 
            "6 tablespoons dark brown sugar, packed", 
            "2 eggs", 
            "1 teaspoon pure vanilla extract", 
            "Grated zest of 1/2 a large orange (I used a clementine)", 
            "1 3/4 cup plus 2 tablespoons (or 2 cups minus 2 tablespoons)  unbleached, all-purpose flour", 
            "1 teaspoon baking powder", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon kosher salt", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon. ground nutmeg", 
            "1/8 teaspoon ground cloves", 
            "1 egg white, lightly beaten"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/fig-and-walnut-biscotti.jpg?w=753", 
        "tags": [
            "Cookie", 
            "Figs", 
            "Italian", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/01/fig-and-walnut-biscotti/", 
        "title": "fig and walnut biscotti", 
        "directions": [
            "1. Preheat the oven to 325 degrees.  Spread the walnuts on a baking sheet and toast for 5 to 7 minutes, or until golden brown and fragrant. Allow the walnuts to cool completely", 
            "2. Place the walnuts and dried figs in a food processor and process until they are finely chopped.", 
            "3. In the bowl of an electric mixer, cream together the butter and sugars until light and fluffy. Add the eggs, one at a time, and beat until incorporated, scraping down the sides of the bowl with a spatula occasionally. Beat in the vanilla and the orange zest.", 
            "4. In a medium bowl, stir together the flour, baking powder, baking soda, salt and spices. Beat the dry ingredients into the butter mixture to form a somewhat firm dough. Add the walnuts and figs and beat until thoroughly combined. Wrap the dough tightly in plastic and chill 35 to 40 minutes or until completely firm.", 
            "5. When the dough has chilled, lightly grease a baking sheet. On a floured board, use your palms to roll the piece of dough into a log the length of the baking sheet. Place the log on the baking sheet.", 
            "6. In a small bowl, beat the egg white with a fork until frothy. With a pastry brush, glaze the log with some egg white and sprinkle it with granulated sugar. Bake for 15 to 20 minutes (this took longer in my oven, but everything seems to these days), or until the log is lightly golden brown, firm to the touch and just beginning to crack slightly.", 
            "7. Allow the log to cool on the cookie sheet until cool to the touch, about 40 minutes.  With a serrated knife, slice the biscotti, slightly on the bias, into 1/2-inch slices. Lay the slices on the cookie sheet in single layer (I always end up needing a second baking sheet in this step, as they have a lot more surface area); Return the biscotti to the oven and cook for 20 more minutes, or until the biscotti are toasted and crisp. ", 
            "Store the biscotti in an airtight container. They will keep up to about 2 weeks."
        ], 
        "date": "2009-01-05T16:49:24+00:00"
    }, 
    {
        "ingredient_list": [
            "Bread", 
            "2 1/4 teaspoons (1 packet — 1/4 ounce or 7 grams) active dry yeast", 
            "1/4 cup (85 grams) plus 1 teaspoon honey", 
            "2/3 cup warm water (110 to 116 degrees F)", 
            "1/3 cup (80 ml) olive oil, plus more for the bowl", 
            "2 large eggs", 
            "2 teaspoons flaky sea salt, such as Maldon, or 1 1/2 teaspoons table salt", 
            "4 cups (500 grams) all-purpose flour", 
            "Fig Filling", 
            "1 cup (5 1/2 ounces or 155 grams) stemmed and roughly chopped dried figs", 
            "1/8 teaspoon freshly grated orange zest, or more as desired", 
            "1/2 cup (120 ml) water", 
            "1/4 cup (60 ml) orange juice", 
            "1/8 teaspoon sea salt", 
            "Few grinds black pepper", 
            "Egg wash", 
            "1 large egg", 
            "Coarse or flaky sea salt, for sprinkling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/09/fig-olive-oil-and-sea-salt-challah.jpg?w=750", 
        "tags": [
            "Announcements", 
            "Bread", 
            "Cookbooks", 
            "Figs", 
            "Jewish", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2012/09/fig-olive-oil-and-sea-salt-challah-book-tour/", 
        "title": "fig, olive oil and sea salt challah + book tour!", 
        "directions": [
            "To make dough with a stand mixer: Whisk the yeast and 1 teaspoon honey into warm water, and let it stand for a few minutes, until foamy. In a large mixer bowl, combine the yeast mixture with remaining honey, 1/3 cup olive oil, and eggs. Add the salt and flour, and mix until dough begins to hold together. Switch to a dough hook, and run at low speed for 5 to 8 minutes. Transfer the dough to an olive-oil coated bowl (or rest the dough briefly on the counter and oil your mixer bowl to use for rising, so that you’ll use fewer dishes), cover with plastic wrap, and set aside for 1 hour, or until almost doubled in size.", 
            "To make the dough by hand: Proof the yeast as directed above. Mix the wet ingredients with a whisk, then add the salt and flour. Mix everything together with a wooden spoon until the dough starts to come together. Turn the mixture out onto a floured counter, and knead for 5 to 10 minutes, until a smooth and elastic dough is formed. Let rise as directed above.", 
            "Meanwhile, make fig paste: In a small saucepan, combine the figs, zest, water, juice, salt, and a few grinds of black peper. Bring to a simmer over medium heat, and cook, stirring occasionally, until the figs are soft and tender, about 10 minutes. Season with salt and pepper to taste. Remove from heat, and let cool to lukewarm. PRocess fig mixture in a food processor until it resembles a fine paste, scraping down the sides of the bowl as necessary. Set aside to cool.", 
            "Insert figs: After your dough has risen, turn it out onto a floured counter and divide it in half. Roll the first half of the dough into a wide and totally imperfect rectangle (really, the shape doesn’t matter). Spread half the fig filling evenly over the dough, stopping short of the edge. Roll the dough into a long, tight log, trapping the filling within. Then gently stretch the log as wide as feels comfortable (I take mine to my max counter width, a pathetic three feet), and divide it in half. Repeat with remaining dough and fig filling.", 
            "Weave your challah: Arrange two ropes in each direction, perpendicular to each other, like a tight tic-tac-toe board. Weave them so that one side is over, and the other is under, where they meet. So, now you’ve got an eight-legged woven-headed octopus. Take the four legs that come from underneath the center and move the leg to their right — i.e., jumping it. Take the legs that were on the right and, again, jump each over the leg before, this time to the left. If you have extra length in your ropes, you can repeat these left-right jumps until you run out of rope. Tuck the corners or odd bumps under the dough with the sides of your hands to form a round.", 
            "Transfer the dough to a parchment-cover heavy baking sheet, or, if you’ll be using a bread stone, a baker’s peel. Beat egg until smooth, and brush over challah.  Let challah rise for another hour, but 45 minutes into this rise, preheat your oven to 375°F.", 
            "Bake your loaf: Before baking, brush loaf one more time with egg wash and sprinkle with sea salt. Bake in middle of oven for 35 to 40 minutes. It should be beautifully bronzed; if yours starts getting too dark too quickly, cover it with foil for the remainder of the baking time. The very best way to check for doneness is with an instant-read thermometer — the center of the loaf should be 195 degrees. ", 
            "Cool loaf on a rack before serving. Or, well, good luck with that."
        ], 
        "date": "2012-09-11T11:26:27+00:00"
    }, 
    {
        "ingredient_list": [
            "3 to 4 tablespoons red onion, cut into tiny bits", 
            "4 pieces of citrus, preferably a mix of grapefruits and oranges but use what you can get, and what you like to eat (spoiled by the spread at the store, I used 1 pink grapefruit, 1 cara cara and 1 blood orange, and 1 mineola)", 
            "1 tablespoon red wine vinegar or lemon juice", 
            "1 teaspoon smooth Dijon mustard", 
            "1 tablespoon olive oil", 
            "Salt and freshly ground pepper, to taste", 
            "3 to 4 tablespoons (1.5 ounces) feta cheese, chopped or crumbled", 
            "1 tablespoon fresh mint, chopped or cut into tiny slivers"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mixed-citrus-salad-with-feta-and-mint1.jpg?w=500", 
        "tags": [
            "Fruit", 
            "Grapefruit", 
            "Herbs", 
            "Orange", 
            "Photo", 
            "Salad", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2010/01/mixed-citrus-salad-with-feta-and-mint/", 
        "title": "mixed citrus salad with feta and mint", 
        "directions": [
            "Place your red onion in the bottom of a medium bowl. Nest a strainer over the bowl.", 
            "Prepare your citrus fruits by beveling the stem end of one, cutting enough off that you reveal the pith-free flesh of the fruit. Repeat on the other end. Rest your fruit on one of its now-flat surface and begin cutting the peel and pith off in large, vertical pieces. You want the fruit’s exterior to be “white”-free.", 
            "Turn the fruit back on its side and cut it into 1/4-inch thick wheels, removing any seeds and thick white stem as you do. Place the wheels and any collected juices from the cutting board in the strainer over the bowl with onion. Repeat with remaining citrus fruits. (As the extra juices drip over the bowl, it will soften the raw onion bite.)", 
            "Spread the fruit slices out on a platter. Scoop out the onion bits (a slotted spoon or fork does the trick) and sprinkle them over, leaving the juice in the bowl. Whisk one tablespoon of juice (this is all I had accumulated) with red wine vinegar or lemon juice, Dijon and olive oil. Season with salt and freshly cracked black pepper. Drizzle the dressing over the citrus, sprinkle with feta and mint, adjust salt and pepper to taste, serve immediately and daydream of warmer places."
        ], 
        "date": "2010-01-22T15:44:57+00:00"
    }, 
    {
        "ingredient_list": [
            "2 thin slices or small wedges grapefruit", 
            "Kosher salt for rim, if desired", 
            "2 tablespoons grapefruit juice", 
            "2 tablespoons pomegranate juice", 
            "1 teaspoon honey, sugar or agave", 
            "1/4 cup white tequila", 
            "About 3 medium-sized ice cubes", 
            "1/4 cup club soda or seltzer", 
            "A few pomegranate arils (for garnish)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/pomegranate-grapefruit-paloma.jpg?w=750", 
        "tags": [
            "Drinks", 
            "Grapefruit", 
            "Photo", 
            "Pomegranate", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2017/02/pomegranate-grapefruit-paloma/", 
        "title": "pomegranate grapefruit paloma", 
        "directions": [
            "If you'd like to salt the rim of you glass, put a little kosher salt on a small plate. Swipe the rim of your glass with a wedge of grapefruit (or a wedge from the emptied grapefruit you've just juiced) and place the damp rim in the salt, twisting to coat it.\nPlace both juices and honey or sugar in the bottom of your glass and use a long spoon to stir it until combined, and/or until the sugar has dissolved. Add tequila, stir to combine. Add ice then club soda or seltzer. Garnish with additional grapefruit slices and pomegranate arils.  Repeat as needed."
        ], 
        "date": "2017-02-24T13:03:41+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup sugar", 
            "3 star anise", 
            "1/2 of plump vanilla bean, split in half lengthwise", 
            "8 dried Turkish apricots, cut in half", 
            "4 dried figs, quartered", 
            "4 2-inch long pieces lemon zest (peeled with a vegetable peeler) from a Meyer lemon if you can find one", 
            "Juice of the zest lemon", 
            "3 firm Bosc pears", 
            "1 firm tart apple", 
            "Seeds from half a pomegranate"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/winter-fruit-salad1.jpg?w=500", 
        "tags": [
            "Figs", 
            "Fruit", 
            "Pear", 
            "Photo", 
            "Pomegranate", 
            "Salad", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/11/winter-fruit-salad/", 
        "title": "winter fruit salad", 
        "directions": [
            "1. Fill a medium saucepan with 4 cups water. Add the sugar, star anise, vanilla bean and lemon zest. Bring to a boil, and cook until all the sugar is dissolved. Let it cool for just a few minutes (it should still be hot) and then stir in the dried figs and apricots. Let it cool completely.", 
            "2. Meanwhile, peel and core pears and apple. Slice thinly lengthwise and place in a large bowl, and toss with the lemon juice.", 
            "3. Once the syrup with dried fruit has cooled, pour it over the apples and pears.  Cover the bowl with plastic wrap and chill it overnight in the refrigerator.", 
            "4. The next morning, using a slotted spoon, ladle the fruit into a serving bowl, sprinkle with the pomegranate seeds and serve. Remove the vanilla beans (you can rinse and save what is left of them for another use) and lemon peels if you wish, or leave them in for decoration.", 
            "Do ahead Syrup can be made in advance and kept in the fridge for a day or two. Hot syrup can be poured over the dried fruit and kept in the fridge for a day or so. Prepared salad keeps in the fridge for a day or two, but is best fresh."
        ], 
        "date": "2008-11-16T22:12:16+00:00"
    }
]