{
  "date": "2011-05-11T09:43:39+00:00",
  "directions": [
    "Fill a large bowl with cold water. Add leeks and use your hands to pump them up and down in the water a bit, separating the rings and letting the dirt and grit fall to the bottom. Transfer to a dish or plate for a minute; no need to dry them.",
    "Meanwhile, heat a large, heavy skillet over medium. Once hot, add butter and olive oil and once they’re fully melted and a bit sizzly, add the leek slices, still wet. Sprinkle with 1/2 teaspoon coarse salt and a few grinds of black pepper. Reduce heat to low, cover with a lid and cook leeks for 25 minutes, stirring them occasionally. Adjust seasoning to taste.",
    "While leeks cook, brush bread slices with olive oil and sprinkle with coarse salt. Run under broiler until lightly toasted. You may either spread the cheese you’re using on now, while the toasts are hot, or sprinkle it on at the end. Divide leeks among toasts. Sprinkle with cheese, if you haven’t spread it underneath. Add a few drops of lemon juice, if desired. Eat at once or gently rewarm a bit later."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/leeks-toasts-with-blue-cheese1.jpg?w=500",
  "ingredient_list": [
    "1 1/2 pounds leeks (about 3 big leeks), lengthwise and white and pale green parts sliced 1/4-inch thick (about 3 generous cups of slices)",
    "2 tablespoons unsalted butter",
    "1 tablespoon olive oil, plus extra for brushing toasts",
    "Coarse salt",
    "Freshly ground black pepper",
    "6 medium-sized or 12 baguette-sized 1/2-inch slices of bread of your choice (I used a light sourdough)",
    "2 ounces blue cheese, crumbled (a soft or crumbly goat cheese would also work)",
    "Few drops of lemon juice (optional)"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Leeks",
    "Photo",
    "Spring",
    "Vegetarian"
  ],
  "title": "leek toasts with blue cheese",
  "url": "https://smittenkitchen.com/2011/05/leeks-toasts-with-blue-cheese/"
}