{
  "date": "2012-07-17T14:28:15+00:00",
  "directions": [
    "Toss bacon into a large skillet over medium heat, no need to heat the pan first. Let rest for a few minutes until it starts sizzling, then move the bits around so that they begin to brown evenly. Again, wait a couple minutes before shuffling the pieces around; you’re looking for them to get evenly golden and crisp. This should take about 10 minutes. Remove the bacon bits with a slotted spoon, leaving the drippings in the pan and transferring the bacon to paper towels to drain.",
    "If your bacon is like mine, you’ll be left with a spectacular amount of fat behind. You’ll be tempted to drain it off. May I ask you not to? The potatoes that cook in this will be gorgeous and you will have a chance to remove this extra in a bit. It will mostly stay in the pan.",
    "Heat the pan to medium/medium-high, making sure the bacon fat is nicely sizzly, then add your potatoes all at once in a single layer. Sprinkle them with 1/2 teaspoon table salt and several grinds of black pepper. Let them cook for a few minutes in one place and get a bit golden underneath before turning them over and moving them around. Repeat this process until the potatoes are browned on all sides; this takes about 20 minutes.",
    "At this point, you can push aside the potatoes and pour or spoon off all but a small amount of the fat. I won’t tell you how much I was able to remove but it rhymes with shmoo to shmee shmablespoons. If you save it, you can use it to fry an egg in a bit.",
    "Bump up the heat a little and add the corn to the skillet. Saute the potatoes and corn together until the corn gets a bit brown but stays fairly crisp, about 4 to 5 minutes. Add the drained bacon, and stir the mixture together until it’s evenly warm, about 1 more minute. Remove the skillet from the burner and sprinkle the scallions (reserving a couple spoonfuls if you’d like to use them as fried egg garnish) over the hash. In two minutes, they should be warm and mellowed. Season with more salt or pepper to taste, if needed.",
    "Add a fried egg to it: Heat a small skillet over medium-high heat and swirl in one to two teaspoons bacon fat or butter. Crack one egg into the skillet and reduce heat to medium. I like to cover the skillet with a small lid at this point, as it seems to help the egg cook faster and more evenly. In one minute, you should have a perfect sunny-side-up egg. Season with salt and pepper, serve on top of a pile of bacon corn hash. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/bacon-corn-hash.jpg?w=750",
  "ingredient_list": [
    "1/2 pound thick-cut bacon, cut into small dice",
    "1 pound red potatoes, scrubbed clean and diced into 1/4- to 1/2-inch cubes (about 3 to 3 1/4 cups)",
    "Salt and freshly ground black pepper",
    "4 medium-large ears corn, kernels cut from the cob (2 1/2 to 3 cups)",
    "1 bundle scallions, thinly sliced"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Budget",
    "Corn",
    "Gluten-Free",
    "Meat",
    "Photo",
    "Potatoes",
    "Put An Egg On It",
    "Summer",
    "Weeknight Favorite"
  ],
  "title": "bacon corn hash",
  "url": "https://smittenkitchen.com/2012/07/bacon-corn-hash/"
}