{
  "date": "2011-06-28T13:10:21+00:00",
  "directions": [
    "Melt half of butter. Remove from heat and stir in second tablespoon of butter until melted. This keeps your butter from being too hot when you next want to add it to the wet ingredients.",
    "Whisk egg and yogurt together in the bottom of a medium/large bowl. If you’re using a thin yogurt, no need to add any milk. If you’re using regular yogurt, stir in 2 tablespoons milk. If you’re using a thick/strained or Greek-style yogurt, add 3 to 4 tablespoons milk. Whisk in melted butter, zest and vanilla extract. In a separate, small bowl, combine flours, sugar, baking powder and salt. Stir dry ingredients into wet only until dry ingredients are moistened. A few remaining lumps is fine.",
    "Preheat your oven to 200°F and have a baking sheet ready (to keep pancakes warm). Heat your skillet or saute pan to medium. If you’ve got a cast-iron skillet, this is my favorite for pancakes. Melt a pat of butter in the bottom and ladle a scant 1/4 cup (about 3 tablespoons) batter at a time, leaving at space between each pancake. Press a few berries into the top of each pancake. The batter is on the thick side, so you will want to use your spoon or spatula to gently nudge it flat, or you may find that pressing down on the berries does enough to spread the batter.  When the pancakes are dry around the edges and you can see bubbles forming on the top, about 3 to 4 minutes, flip them and cook for another 3 minutes, until golden underneath. (If you listen closely, after a minute you’ll hear you blueberries pop and sizzle deliciously against the pan.) If pancakes begin cooking too quickly, lower the heat. Transfer pancakes to warm oven as they are done cooking, where you can leave them there until you’re ready to serve them.",
    "Serve in a big stack, with fixings of your choice. Do not anticipate leftovers."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/06/blueberry-yogurt-multigrain-pancakes.jpg?w=750",
  "ingredient_list": [
    "2 large eggs",
    "1 cup plain, full-fat yogurt",
    "2 to 4 tablespoons milk",
    "3 tablespoons butter, plus extra for buttering skillet",
    "1/2 teaspoon lemon zest",
    "1/2 teaspoon vanilla extract",
    "1/2 cup (62 grams) whole wheat flour",
    "1/2 cup (68 grams) all-purpose flour",
    "1/4 cup (32 grams) barley or rye flour",
    "2 tablespoons sugar",
    "1 tablespoons plus 1 teaspoons baking powder",
    "1/2 teaspoon table salt",
    "1 cup blueberries, rinsed and dried"
  ],
  "tags": [
    "Blueberries",
    "Breakfast",
    "Brunch",
    "Pancakes",
    "Photo",
    "Summer"
  ],
  "title": "blueberry yogurt multigrain pancakes",
  "url": "https://smittenkitchen.com/2011/06/blueberry-yogurt-multigrain-pancakes/"
}