{
  "date": "2014-01-13T12:34:34+00:00",
  "directions": [
    "In a small saucepan or large heavy skillet, heat the oil over medium-high until it registers 275°F on a deep-fry or candy thermometer. Add the shallots and cook, stirring frequently as they’ll want to cook unevenly, until light golden brown, about 4 to 8 minutes, depending on their thickness. Transfer to a paper towel-lined plate to drain.",
    "Increase the heat to high and place a fine-mesh sieve over a heatproof bowl. When the oil registers 375°F on the deep-fry or candy thermometer, add return the fried shallots to the oil and cook just until they are crispy and well-browned, about 5 seconds, watching carefully so the shallots don’t burn.",
    "Pour the oil and shallots through the sieve to immediately stop the cooking, then transfer to shallots to a paper towel-lined plate to drain. Sprinkle with salt to season. Reserve the oil for another use. The shallots will keep, stored in an airtight container, for 1 day, but they’re best the day they are made."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/chicken-pho1.jpg?w=640",
  "ingredient_list": [
    "Broth",
    "2 unpeeled yellow onions, quartered",
    "Three 1/2-inch-thick slices of unpeeled fresh ginger, smashed",
    "4 quarts cold water",
    "3 pounds chicken bones or chicken wings",
    "One fresh 3 1/2-pound chicken, quartered",
    "1 tablespoon kosher salt",
    "2 teaspoons sugar",
    "Additional spices (optional): Cinnamon, star anise, black cardamoms, coriander seeds, fennel seeds or cloves",
    "1/4 cup Asian fish sauce",
    "1 pound dried rice noodles, a linguine shape (bánh phở) if you can find them",
    "Garnishes",
    "1 large scallion, thinly sliced",
    "1 pound mung bean sprouts",
    "1/2 cup torn basil leaves, Thai basil if you can find it",
    "1/2 cup cilantro leaves",
    "2 limes, cut into wedges",
    "2 jalapeños, thinly sliced",
    "Asian chili-garlic sauce",
    "Hoisin sauce",
    "Crispy shallots, recipe follows",
    "2 cups thinly sliced shallots (about 4 large shallots)",
    "2 cups canola oil"
  ],
  "tags": [
    "Chicken",
    "Gluten-Free",
    "Photo",
    "Soup",
    "Vietnamese"
  ],
  "title": "chicken phở",
  "url": "https://smittenkitchen.com/2014/01/chicken-pho/"
}