{
  "date": "2015-08-27T11:34:27+00:00",
  "directions": [
    "Heat oven to 350°F (175°C). Line a rimmed baking sheet with foil, to catch drips, or regret it later. ",
    "Prepare the peaches: Place the peaches in a 9×13-inch baking pan and in roughly an even layer. Using a zester or a Microplane, finely zest the lemon evenly over the peaches and then squeeze the lemon juice evenly over the peaches, too, catching any seeds before they fall in.",
    "Make the batter: With an electric mixer, beat butter and 3/4 of the sugar (1 1/2 cups if you use the full amount; 1 cup plus 2 tablespoons if you reduce it as I did) with sugar until sandy, about 1 minutes. Add the flour, baking powder and salt and beat until combined, about 30 seconds, then lower the speed and slowly mix in milk. Continue beating at a medium speed for 2 minutes more, until light and fluffy-ish. ",
    "Assemble cobbler: Plop the batter in a large blobs over the peaches. Using my favorite $3.20 kitchen tool, a small offset spatula, or if you don’t have one, a butter knife, carefully spread the batter evenly over the fruit so that it’s no more than 1/2-inch thick in any place. Sprinkle with remaining sugar and drizzle the hot water evenly over the sugar. ",
    "Bake cobbler: Place the baking dish on the foil-lined baking sheet and bake for 60 to 70 minutes, until the top is cracked and golden brown, and a toothpick inserted into the topping comes out batter-free. (It’s best to start checking it at 60 minutes.) ",
    "Be patient: Let the cobbler sit in the baking dish on a wire rack for at least 30 minutes before serving, which will feel (and smell) like torture, but gives the peach juices a chance to slightly thicken up. To serve, scoop into bowls and drizzle with heavy cream."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/08/crispy-peach-cobbler1.jpg?w=640",
  "ingredient_list": [
    "4 1/2 pounds (about 10 large or 2 kg) peaches, unpeeled, cut into 1-inch chunks or slices (I cut mine each into 8 wedges)",
    "Zest and juice of 1 lemon",
    "4 ounces (115 grams) unsalted butter, softened",
    "2 cups (400 grams) granulated sugar, divided (I reduced this to 1 1/2 cups, and recommend the same)",
    "1 1/2 cups (190 grams) all-purpose flour",
    "2 teaspoons baking powder",
    "1 teaspoon coarse or kosher salt",
    "3/4 cup milk (whole is ideal; almond will work too)",
    "1/2 cup hot water",
    "Heavy cream, cold, for drizzling"
  ],
  "tags": [
    "Crumbles/Crisps",
    "Peach",
    "Photo",
    "Summer"
  ],
  "title": "crispy peach cobbler",
  "url": "https://smittenkitchen.com/2015/08/crispy-peach-cobbler/"
}