{
  "date": "2016-06-21T11:32:24+00:00",
  "directions": [
    "\nIn a large bowl, whisk eggs with sugar, milk, water and vanilla. Sprinkle salt and baking powder over the batter, then flour, and whisk it until batter is smooth.\nYou can use a funnel, pitcher, squeeze bottle or plastic bag with the corner snipped off to pour your batter into the oil in a thin stream.Are you going to use a funnel? If so, check to make sure your batter is the right consistency to fall through by holding it over your bowl and ladling a little in. I was using one with a 1/2-inch opening and my batter was a tad thick. If yours is, whisk in extra water, 1 tablespoon at a time, until it’s right. You might need 2 or 3.Are you going to use a plastic bag with the corner snipped off? Don’t worry about it then, you can always cut the hole a little bigger if the batter doesn’t fall through easily.\nHeat 1-inch of oil in a heavy skillet that’s the size you want your cakes to be to between 350 and 375 degrees F. With your finger over the opening so it doesn’t fall out, ladle batter into your funnel or a plastic bag. I like to put in only as much batter as I’ll need for each cake (1/2 cup for the 8-inch round size) so I can put the funnel down without having to stop it up somehow between uses.\nLet batter squiggle and scribble all over oil. Fry for 1 to 2 minutes on first side, until golden underneath. Flip with tongs and fry on the second side for about 1 minute, until golden all over. Remove from oil and blot briefly on paper towels. Ensure that the oil temperature is still correct, then fry remaining cakes. Transfer each to a double layer of paper plates and blizzard on the powdered sugar. Eat with your fingers."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/06/funnel-cake1.jpg?w=750",
  "ingredient_list": [
    "2 large eggs",
    "3 tablespoons granulated sugar",
    "1 cup milk (non-dairy milks could easily be subbed here)",
    "1 cup water",
    "1/2 teaspoon vanilla extract or a small scraping of fresh vanilla bean seeds",
    "3 cups all-purpose flour",
    "1 tablespoon baking powder",
    "1/2 teaspoon coarse or kosher salt",
    "Oil for deep-fat frying (I needed about 1 1/2 cups for an 9-inch skillet)",
    "Confectioners’ sugar to finish"
  ],
  "tags": [
    "Doughnut",
    "Photo",
    "Summer"
  ],
  "title": "funnel cake",
  "url": "https://smittenkitchen.com/2016/06/funnel-cake/"
}