{
  "date": "2013-07-18T11:29:46+00:00",
  "directions": [
    "Part 1 Instructions",
    "Prepare chocolate cream: Warm 1 cup of the cream with the cocoa powder in a medium saucepan, whisking to thoroughly blend the cocoa. Bring to a boil, then reduce the heat and simmer at a very low boil for 30 seconds, whisking constantly. Remove from the heat and add the chopped chocolate, stirring until smooth. Then stir in the remaining 1 cup cream. ",
    "Prepare vanilla cream: Heat 1 cup cream to a simmer. Scrape the seeds from the vanilla bean into the cream with a paring knife, then add the bean pod to the cream. Cover, remove from heat, and infuse for one hour. After one hour, remove bean pod and stir in remaining 1 cup cream.",
    "Make custard for both ice creams: Warm the milk, sugar, and salt in a saucepan, then transfer to a spouted liquid measuring cup. Whisk together egg yolks, medium bowl. Slowly pour in warm milk/sugar/salt mixture, whisking constantly. Then mix yolk/milk mixture back into saucepan. Cook mixture over medium-low heat, stirring constantly and scraping the bottom with a heat-resistant spatula, until the custard thickens enough to coat the spatula. Pour the custard through the strainer and …",
    "For chocolate: Stir half of custard into chocolate cream until smooth, then stir in 1/2 teaspoon vanilla.",
    "For vanilla: Stir the other half of the custard into vanilla cream, then stir in 1 teaspoon vanilla extract.",
    "Chill both mixtures in fridge overnight: You want them fully chilled before they go in an ice cream machine. You can hasten this along by stirring them over an ice bath but it should feel like ice water in coldness to the touch before you put it in your ice cream machine.",
    "Meanwhile, make or prepare you chocolate cookie crumbs. You will want them ready to form a cake base before you churn your ice cream.",
    "Part 2 Instructions",
    "Make cookies: Heat oven to 375 degrees. Line two baking sheets with parchment paper. Blend flour, cocoa, baking soda, baking powder, salt and sugar in a food processor until combined. Add butter chunks and blend until the mixture is powdery. Add egg and run machine until dough starts to clump and ball, about 30 seconds. Scoop cookies out onto baking sheets, giving them space as they will spread a lot (not that merged cookies will matter once you grind them up). Bake for 9 to 10 minutes. Cookies will absolutely look underbaked, but don’t fret. Transfer baking sheets onto cooling racks and within two minutes, they will be firm enough to transfer to cooling racks. Let cool completely. Repeat with remaining cookie dough. ",
    "Grind about half of your cookies in a food processor or blender until they’re just crumbs. You will want a total of 2 3/4 cups of them.",
    "Make chocolate cookie crust: Mix 1 1/3 cups chocolate cookie crumbs (from about 6 ounces whole cookies, or about 12 of the homemade cookies) and melted butter together in a bowl and press evenly into the bottom of a 9-inch springform pan with 2 3/4 to 3-inch sides. Freeze until firm, about 10 minutes.",
    "Churn chocolate ice cream, i.e. first cake layer: According to manufacturers directions. In most cases, ice cream is churned for 30 minutes then transferred to a container to finish in freezer. Instead, once it has been churned to the point of soft-serve ice cream, spread it over the chocolate crumb crust in the freezer. Spread as evenly as possible, but don’t overly fret about a smooth top. This can be “perfected” after the ice cream has hardened.",
    "Chill chocolate ice cream layer: In freezer for 1 to 2 hours, until firm. Once firm, you can use an offset spatula to make it as smooth and even as possible. ",
    "Add cookie crumb filling: Wipe off any ice cream smudges that have climbed the springoforms walls; this will keep the vanilla layer looking “clean.” Spread 1 1/4 cups chocolate cookie crumbs (from a little shy of 6 ounces whole cookies, or 11 to 12 of homemade cookies) evenly over the firm chocolate ice cream layer. You can press these in a bit with a round of parchment or waxed paper, so they merge a little bit with the ice cream below.",
    "Churn vanilla ice cream, i.e. second cake layer: According to manufacturers directions. Again, once it has been churned to the point of soft-serve ice cream, spread it over the chocolate crumb filling in the freezer. Try to spread it in as few motions as possible, pressing the ice cream to the edges with an offset spatula rather than pulling it back (i.e. and dragging the chocolate cookie crumbs from below into the pale ice cream). Again, don’t overly fret about a smooth top. This can be “perfected” after the ice cream has hardened/set in place.",
    "Chill vanilla ice cream layer: In freezer for 1 to 2 hours, until firm. Once firm, you can use an offset spatula to make it as smooth and even as possible. Meanwhile, this is a great time to make the hot fudge sauce. If you’re taking a longer pause (i.e., you’ll do Part 3 tomorrow), press a circle of waxed or parchment paper against the vanilla ice cream overnight, so it doesn’t dry out or grow icy fuzz.",
    "Part 3 Instructions",
    "Make hot fudge sauce: In a 1 1/2 to 2-quart heavy saucepan, bring cream, syrup, sugar, cocoa, salt (if you’d like the salt to remain slightly textured, add it with the butter and extract at the end) and half the chocolate to a boil. Reduce to a low simmer and cook for 5 minutes, stirring occasionally. Remove from heat and stir in remaining chocolate, butter and extract and stir until smooth. Cool the sauce to lukewarm before serving it so that it can thicken up. ",
    "Part 4 Instructions",
    "“Pre-fudge” the cake: Once vanilla ice cream layer has firmed up in the freezer, with the springform sides still one, pour a puddle of lukewarm hot fudge sauce over the top and return the cake to the freezer for 30 minutes. This will help keep the final application of hot fudge from melting the top off the cake. ",
    "Meanwhile, make the whipped cream: Beat cream and sugar in a bowl with electric mixer until it forms soft-to-firm peaks. Scoop into piping bag with star tip. Keep in fridge until needed.",
    "Finish and serving the cake: Once the hot fudge has firmed up, remove the cake from the freezer. Carefully cut around the pan to loosen the cake from the springform sides before removing them. Transfer cake to serving platter. Pour more lukewarm (can be briefly rewarmed — but not too hot — in a microwave or on the stove if it has gotten too firm) around edges of cake, letting it dribble down a little.",
    "Quickly decorate cake: Form 12 or so dollops of whipped cream around crown of cake. Top each with a cherry. Scatter quickly with sprinkles. ",
    "Serve! With extra hot fudge sauce. Keep leftovers, should any cake survive, in the freezer in an airtight container."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/9307196151_3dd34a3f0d_o.jpg?w=750",
  "ingredient_list": [
    "4 cups heavy cream, divided",
    "1 split vanilla bean (for vanilla batch)",
    "3 tablespoons unsweetened Dutch-process cocoa powder and 5 ounces bittersweet or semisweet chocolate, chopped (for chocolate batch)",
    "2 cups whole milk",
    "1 1/2 cups granulated sugar",
    "Pinch of salt",
    "10 egg yolks",
    "1 1/2 teaspoons vanilla extract, divided",
    "Chocolate Cookies",
    "1 1/4 cups all-purpose flour",
    "1/2 cup unsweetened Dutch process cocoa",
    "1 teaspoon baking soda",
    "1/4 teaspoon baking powder",
    "1/4 teaspoon salt",
    "1 1/2 cups sugar",
    "1/2 cup plus 2 tablespoons (1 1/4 sticks), cold unsalted butter, cut into small chunks",
    "1 large egg",
    "For Crumb Crust",
    "3 tablespoons unsalted butter, melted",
    "2/3 cup heavy or whipping cream",
    "1/2 cup light corn syrup or golden syrup (honey should work as well, but I didn’t test it this time)",
    "1/3 cup packed dark brown sugar",
    "1/4 cup unsweetened cocoa powder, ideally Dutch-processed",
    "Heaping 1/4 teaspoon fine sea salt or level 1/4 teaspoon table salt",
    "6 ounces bittersweet chocolate, chopped (or, about 1 cup bittersweet chocolate chips), divided",
    "2 tablespoons unsalted butter",
    "1/2 teaspoon vanilla extract",
    "1 cup heavy or whipping cream",
    "2 tablespoons sugar",
    "Maraschino cherries",
    "Colored sprinkles"
  ],
  "tags": [
    "Celebration Cakes",
    "Ice Cream/Sorbet",
    "Photo",
    "Summer"
  ],
  "title": "hot fudge sundae cake",
  "url": "https://smittenkitchen.com/2013/07/hot-fudge-sundae-cake/"
}