{
  "date": "2013-02-18T14:48:57+00:00",
  "directions": [
    "Prepare cabbage: Bring a large pot of salted water to boil. Discard any messy or broken outer cabbage leaves and carefully peel 12 nice, large leaves. (I think the cabbage can tell if you’re in a rush, and will tear more easily. Work carefully. That said, a torn leaf will hardly ruin the dish.) Blanch leaves for about 30 seconds to 1 minute (you can do a few at at time), until wilted, and spread out on towels so that they dry and cool.",
    "Make filling: Place bread scraps in bottom of large bowl and pour milk over. Let sit for a few minutes, then mash it gently with a spoon until something close to a paste forms. Mix with sausage meat, herbs, parmesan and a pinch or two of salt and black pepper; I find this easiest with a fork or bare hands. ",
    "Make the cabbage rolls: Lay your first cabbage leaf on the counter. If it doesn’t want to lay flat, pare away some of the thickest stalk (with a paring knife or vegetable peeler) to make it easier. Form some of the filling mixture into a golf ball-sized round. Wrap cabbage leaf around it (see Note about shape up top) and pin at the top with a toothpick. Repeat with remaining leaves and mixture.",
    "Make the sauce: To prepare your tomatoes, either break them up with your hands (for bigger chunks), run them through a food mill or roughly chop them right in their can with scissors (what I did here). In a heavy saute pan with a lid or a medium (5 to 6-quart) Dutch oven, heat olive oil over medium heat. Add the garlic and saute for about 30 seconds (just until golden, not a moment longer) then add the tomatoes, bringing the sauce to a gently boil. Season with salt if needed. Add cabbage packages, arranging them carefully in the pan so they all fit, cover the pot and gently simmer them for 25 minutes. Remove the toothpicks and carefully turn the rolls over, cooking them for another 25. Remove the lid and simmer for another 10 minutes to cook off some of the wetness. They’re all cooked now, but if you can rest them for another 15 minutes before eating them, the flavors settle and they become even better.",
    "Okay, now you can dig in. Repeat frequently, yes?"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/02/italian-stuffed-cabbage.jpg?w=750",
  "ingredient_list": [
    "1 large savoy cabbage",
    "7-ounce (200-gram) hunk of bread (see above), crusts cut away, torn into small scraps (you’ll have about 3 loose cups of scraps)",
    "2/3 cup (approximately 150 ml) whole milk",
    "14 ounces (400 grams) or approximately 4 plain pork sausages (I used sweet — i.e. non-spicy — Italian), casings removed",
    "1 small sprig of sage, finely chopped",
    "1 small sprig of rosemary, finely chopped",
    "2 tablespoons grated parmesan",
    "Salt and freshly ground black pepper, to taste",
    "1 28-ounce can peeled plum tomatoes",
    "2 tablespoons (30 ml) olive oil",
    "1 clove garlic, peeled and minced"
  ],
  "tags": [
    "Budget",
    "Cabbage",
    "Italian",
    "Meat",
    "Photo",
    "Winter"
  ],
  "title": "italian stuffed cabbage",
  "url": "https://smittenkitchen.com/2013/02/italian-stuffed-cabbage/"
}