{
  "date": "2011-06-23T09:58:31+00:00",
  "directions": [
    "If you’re completely maniacal about your peas getting overcooked (I am!), prepare an ice bath, a large bowl filled with ice water. Bring a small saucepan of lightly salted water to a boil. Add peas and cook for 2 minutes (this leaves them with a bit of structure). Drain peas then add them to the ice bath (if using) and drain again. If you haven’t used an ice bath, let your peas cool to lukewarm before making the pesto.",
    "Set aside 1/2 cup of your cooked peas. Whirl the remaining cup of peas in the work bowl of a food processor with garlic, pine nuts, 1/3 cup parmesan and salt until smooth, about 2 to 3 minutes, scraping down the bowl as necessary. With the machine running, drizzle in olive oil. You can stop right here, toast some baguette slices and make some fine, fine crostini. Or, you can continue…",
    "Cook your linguine until al dente. Reserve about two cups pasta cooking water (yes, this is a lot, the pea pesto will be surprisingly thick) then drain linguine and return it to pot. Over moderate heat, toss pasta with pesto, reserved peas and as much reserved pasta water as needed to smooth and distribute pesto; let cook for one minute so that the pesto adheres. Adjust salt to taste, add freshly ground black pepper if desired. Serve immediately, garnished with fresh herbs, if using, and remaining parmesan for passing."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/06/linguine-with-pea-pesto.jpg?w=750",
  "ingredient_list": [
    "1 1/2 cups (from approximately 1 1/2 pounds peas in pods) fresh pea or a 10-ounce package frozen peas, defrosted",
    "1 small garlic clove, minced",
    "2 tablespoons pine nuts, toasted and cooled",
    "1/2 cup  (1 1/8 ounces) finely grated parmesan cheese",
    "1/4 teaspoon table salt, plus more for pasta water",
    "1/3 cup olive oil",
    "12 ounces dried linguine",
    "Garnish (optional): thinly slivered basil or mint leaves"
  ],
  "tags": [
    "Pasta",
    "Peas",
    "Photo",
    "Savory Sauces and Condiments",
    "Summer",
    "Vegetarian"
  ],
  "title": "linguine with pea pesto",
  "url": "https://smittenkitchen.com/2011/06/linguine-with-pea-pesto/"
}