{
  "date": "2011-08-31T10:25:34+00:00",
  "directions": [
    "Bring a large pot of water to boil. Cut a small X at the bottom of each tomato. Blanch the tomatoes in the boiling water for 10 to 30 seconds, then either rinse under cold water or shock in an ice water bath. Peeling the tomatoes should now be a cinch. Discard the skins. Keep the pot full of hot water — you can use it to cook your spaghetti in a bit.",
    "Cut each of your tomatoes in half lengthwise and scoop out the seeds with your fingertips into a small strainer set over a bowl. Ditch the seeds, reserve the juices.",
    "Add tomatoes and salt to a large saucepan (you’ll be adding the pasta to this later, so err on the big side) and turn the heat to medium-high. There are several ways to break the tomatoes down (with your hands, chopping, an immersion blender that I don’t think Italian Grandmothers would approve of but don’t worry, they’re not in the kitchen with you anyway) but I loved Conant’s suggestion of a potato masher, as it gives you the maximum control over how chunky, smooth you want your sauce.",
    "Once the sauce has begun to boil, turn your heat down to medium-low and gently simmer your tomatoes for 35 to 45 minutes, mashing them more if needed. If they begin to look a little dry, add your strained and reserved tomato juices.",
    "While the tomato sauce cooks, combine garlic, a few whole basil leaves, a pinch of red pepper flakes and 1/4 cup olive oil in a small saucepan. Heat them slowly, over the lowest heat so that they take a long time to come to a simmer. Once it does, immediately remove it from the heat and strain the oil into a small dish. You’ll need it shortly.",
    "When the tomato sauce has been simmering for about 25 minutes, bring your tomato-blanching pot of water back to a boil with a healthy helping of salt. Once boiling rapidly, cook your spaghetti until it is al dente, i.e. it could use another minute of cooking time. Reserve a half-cup of pasta cooking water and drain the rest.",
    "Once your sauce is cooked to the consistency you like, stir in the reserved olive oil and adjust seasonings to taste. Add drained spaghetti and half the reserved pasta water to the simmering tomato sauce and cook them together for another minute or two. Add remaining pasta water if needed to loosen the sauce. Stir in the butter, if using, and serve immediately with slivered basil for garnish. We found that sauce this good, this simple and rich, needs no grated cheese."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/naked-tomato-sauce1.jpg?w=750",
  "ingredient_list": [
    "3 pound plum tomatoes",
    "3/4 teaspoon coarse salt",
    "1 large clove garlic, thinly sliced",
    "Pinch of red pepper flakes",
    "Small handful basil leaves, most left whole, a few slivered for garnish",
    "1/4 cup olive oil",
    "12 ounces (3/4 pound) dried spaghetti",
    "1 tablespoon unsalted butter, or maybe two if nobody is looking"
  ],
  "tags": [
    "Italian",
    "Pasta",
    "Photo",
    "Savory Sauces and Condiments",
    "Summer",
    "Tomatoes",
    "Weeknight Favorite"
  ],
  "title": "naked tomato sauce",
  "url": "https://smittenkitchen.com/2011/08/naked-tomato-sauce/"
}