{
  "date": "2015-05-27T11:58:05+00:00",
  "directions": [
    "Roast tomatoes: Heat oven to 300°F (150°C). Cover 1 to 2 baking sheets with parchment paper or a nonstick baking mat. Cut each small tomato in half lengthwise and arrange cut side up in a single layer on prepared sheets. Drizzle lightly with olive oil and sprinkle with salt. Bake in oven for approximately 90 minutes, until somewhat shriveled and dry to the touch, but not fully dehydrated. Set aside until needed, letting them cool. [Note, if you pine nuts are not yet toasted, you can place them in the oven for the last 10 minutes, shaking them once or twice for even coloring. Let cool as well before using.]",
    "Make dressing: Roughly chop the garlic on a cutting board, then add oregano, salt and a few grinds of black pepper. Mince the mixture with your knife until it’s a grainy herb paste. Transfer to a small bowl, whisk in lemon juice and vinegar, then slowly drizzle in oil, whisking the whole time. Taste and adjust as needed; you might need more salt or vinegar. You want a strongly flavored dressing that won’t get lost in that big bowl of ingredients.",
    "Assemble salad: In a giant bowl, place drained pasta, roasted tomatoes, cheese, pine nuts and olives and toss gently to combine. Add dressing to taste, along with any extra salt and pepper needed. Finish with basil. Salad can be eaten right away, but will keep in the fridge up to 3 days. This is also perfect for picnics and potlucks, as it can handle being out in the sun without going south."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pasta-salad-with-roasted-tomatoes1.jpg?w=640",
  "ingredient_list": [
    "Roasted tomatoes",
    "4 cups (about 680 grams) grape tomatoes",
    "Olive oil",
    "Salt",
    "Oregano dressing",
    "1 big clove or 2 small cloves garlic",
    "1 1/2 tablespoons dried oregano (if you can find it, Sicilian is my favorite)",
    "1 1/4 teaspoons kosher salt, plus more to taste",
    "Freshly ground black pepper",
    "3 tablespoons lemon juice",
    "3 tablespoons red or white wine vinegar",
    "1/3 cup olive oil",
    "Assembly",
    "1 pound (455 grams) dried pasta, a bite-sized shape of your choosing (I used reginetti), cooked until 1 to 2 minutes before doneness and drained",
    "6 ounces (170 grams) crumbled salty cheese, such as ricotta salata, feta, queso fresco (I used this posh, delicious stuff)",
    "1/2 cup (70 grams) pine nuts, well-toasted and cooled",
    "1/2 cup (70 grams) pitted and rough-chopped olives of your choice (I used gaeta here, but like them even more when oil-cured)",
    "Salt and pepper",
    "Handful fresh basil leaves, roughly chopped"
  ],
  "tags": [
    "Pasta",
    "Photo",
    "Picnics",
    "Salad",
    "Summer",
    "Tomatoes",
    "Vegetarian"
  ],
  "title": "pasta salad with roasted tomatoes",
  "url": "https://smittenkitchen.com/2015/05/pasta-salad-with-roasted-tomatoes/"
}