{
  "date": "2011-09-02T13:48:38+00:00",
  "directions": [
    "Without a food mill: Cut a small “x” in the bottom of each peach. Dip each into a pot of boiling water for 30 seconds, and then into a bowl of cold water for a minute. The peels should slide right off.  [If you have a food mill, skip the peeling step and I’ll tell you where to use it in a moment.] ",
    "Halve your peaches and remove the pits, then cut each half into quarters (i.e. 8 chunks from each peach). Place peach chunks and water in a large pot and bring to a boil. Simmer until peaches are tender, about 15 to 20 minutes, stirring occasionally to ensure they cook evenly. If you have a food mill, run them through it to puree them and remove the skins. If you don’t have a food mill — i.e. you already peeled your peaches — you can puree in a food processor, blender or with an immersion blender. I like my peach butter very smooth, but feel free to leave any amount of texture you prefer.",
    "Return the peaches to the large pot, add the sugar and lemon juice and bring the mixture to a good strong simmer/gentle boil, cooking them at this level for 30 to 40 minutes, stirring occasionally in the beginning and more often near the end, as it thickens up and the fruit masses risk scorching on the bottom of the pot. ",
    "There are several methods to test for doneness: You can drizzle a ribbon of sauce across the surface; when that ribbon holds its shape before dissolve into the pot, it is done. Some people use cold or frozen plates; dollop a spoonful in the middle of one and if no water forms a ring around it in a couple minutes, it is done. Others use a spoon; if the butter remains rounded on a spoon for two minutes, it is done. You can also check the pot itself; the butter is usually done when a wooden spoon leaves a clear trail when scraped across the bottom.",
    "Let peach butter cool (unless you’re canning it, in which, follow the directions below). If you’re not canning it, keep it in an airtight container in the fridge. It should be good for at least two weeks.",
    "To can your peach butter: First, sterilize your jars, either by boiling them in a large, deep pot of water (which should cover the jars completely) for 10 minutes or washing them in lots of hot soapy water, rinsing and drying the parts well and then place the jars only in a 200 degree oven for 20 minutes. Then, divide your hot piping hot peach butter between your jars, leaving a little room at the top. Wipe the rims clean with a dry towel and cover the jars with their lids. Submerge the jars in a large, deep pot of boiling water for 10 minutes, either in a removable basket or using tongs to dip and remove them. Let cool completely on towels, a process that can take overnight. If canned properly, the peach butter should last indefinitely at room temperature. ",
    "I did not have canning jars around when I made this, but am so so so in love with it that I will be buying some and making more before the last peaches are gone. I am a woman converted."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peach-butter1.jpg?w=500",
  "ingredient_list": [
    "4 pounds (1.8 kilograms) peaches",
    "1 cup (237 ml) water",
    "2 cups (400 grams) granulated sugar",
    "Juice of one lemon"
  ],
  "tags": [
    "Peach",
    "Photo",
    "Summer",
    "Travel"
  ],
  "title": "peach butter",
  "url": "https://smittenkitchen.com/2011/09/peach-butter/"
}