{
  "date": "2013-07-01T11:11:51+00:00",
  "directions": [
    "Make topping: Heat oven to 350 degrees F. Spread the nuts out in one layer on a baking sheet and bake them, stirring occasionally, until they are well browned, 10 to 13 minutes (they will smell toasted and nutty but keep an eye on them towards the end so yours do not burn). Transfer the pan to a wire rack to cool.",
    "In a food processor, coarsely chop 1/4 cup of cooled pecans, then set them aside in a small dish. Put remaining pecans (3/4 cup) in food processor along with about one-quarter of your flour (you can eyeballs this) and grind the nuts until they’re as powdery as possible. Add the remaining flour, powdered sugar, coarse sugar, salt, baking powder and pulse the machine two or three times, just to combine. Transfer dry mixture a bowl and add melted butter and vanilla. Stir this together until small and large clumps form, then stir in coarsely chopped pecans. Refrigerate until needed.",
    "Make filling: Heat oven to 375 degrees F. Halve and pit your peaches, then cut them into chunks, smaller if they’re firm, large ones if the peaches are already soft. In the bottom of 3- to 4-quart (a 9×13, such as a deep lasagna pan, works here) works fine here) ovenproof baking dish, toss the peach chunks with sugar, cornstarch, lemon juice, cinnamon, nutmeg and salt. ",
    "Remove topping from refrigerator and cover fruit thickly and evenly with topping. Bake until crumble topping is golden brown in places and fruit is bubbling and begins to creep up over the topping a little, about 40 to 50 minutes. If your topping browns too much before this happens (this doesn’t happen in my oven, but just in case) you can cover the top with foil until it is done baking.",
    "Let cool slightly before serving, ideally with vanilla ice cream."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/9175837136_29363bbdec_k.jpg?w=750",
  "ingredient_list": [
    "Pecan sandy topping",
    "1 cup raw pecans",
    "1 3/4 cups all-purpose flour",
    "1/2 cup powdered sugar",
    "2 tablespoons coarse sugar, such as Turbinado or Sugar in the Raw; use granulated if you have neither",
    "3/4 teaspoon table salt",
    "1/2 teaspoon baking powder",
    "3/4 cup unsalted butter, melted",
    "1 1/2 teaspoons vanilla extract (or you can use bourbon; I’ll never tell)",
    "Filling",
    "3 1/2 to 4 pounds peaches",
    "2 tablespoons lemon juice",
    "1/2 cup granulated sugar",
    "3 tablespoons cornstarch",
    "1/4 teaspoon freshly grated nutmeg",
    "1/4 teaspoon ground cinnamon",
    "A couple pinches of salt"
  ],
  "tags": [
    "Crumbles/Crisps",
    "Peach",
    "Photo",
    "Summer"
  ],
  "title": "peach and pecan sandy crumble",
  "url": "https://smittenkitchen.com/2013/07/peach-and-pecan-sandy-crumble/"
}