{
  "date": "2016-09-07T12:01:54+00:00",
  "directions": [
    "\nIn a food processor or blender, combine garlic, shallot, bell pepper, chili, 1/4 cup parsley, paprika, oregano, lemon zest and juice, red wine vinegar, olive oil and salt and blend until as smooth as possible.\nTo spatchcock (remove the backbone from) your chicken: Place on a cutting board and use kitchen shears to cut along each side of the backbone, removing it and saving it for a future post of soup. [Here’s the shortest video I could find demonstrating this.] Open the chicken like a book, flattening it out. Place in a large dish.",
    "Pour about 1/3 marinade over inside of chicken, the flip and pour another 1/3 over the outside. Set aside the last 1/3 for serving. Let the chicken marinate for as long as you have to spare; 20 minutes at room temperature or a few hours (or even a day) in the fridge.\nIf using chicken pieces, marinate them as well in a big dish with 2/3 of the sauce.\nHeat a grill over medium high. Oil the grill grates. Place spatchcocked chicken skin side down on grill, spoon on some marinade that landed in the pan, cook for about 15 minutes, until it is nicely charred underneath. Use large tongs to flip it, pour or spoon any extra marinade over the skin and cook for another 15 to 25 minutes, until a thermometer inserted into thicker parts of the bird reads 165°F. Let rest for 5 minutes before cutting into pieces.\nFor chicken pieces, you’ll only need about 10 minutes per side, depending on size.\nNo grill? In the oven, I usually roast spatchcocked chickens at 450°F for 35 to 45 minutes, or until a thermometer inserted into thicker parts of the bird reads 165°F. Chicken pieces are usually done in 30 to 35.\nGarnish with extra herbs and serve with remaining sauce on the side.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/piri-piri-chicken.jpg?w=750",
  "ingredient_list": [
    "3 cloves garlic, peeled",
    "1/2 a large or 1 small shallot, peeled, roughly chopped",
    "1/2 medium red bell pepper, seeded, roughly chopped",
    "1 piri piri, bird’s eye or other small red chili pepper, chopped, plus more to taste",
    "1/4 cup fresh parsley or cilantro leaves, plus more for garnish",
    "1 teaspoon paprika (I used smoked, regular is fine)",
    "1/2 teaspoon dried oregano",
    "Most of the finely grated zest and all of the juice of 1 lemon",
    "2 teaspoons red wine vinegar",
    "1 tablespoon olive oil, plus more for grill grates",
    "1 teaspoon kosher salt",
    "1 3 1/2 pound chicken or 3 1/4 pounds bone-in, skin-on chicken parts"
  ],
  "tags": [
    "Chicken",
    "Grilling",
    "Photo",
    "Portuguese"
  ],
  "title": "piri piri chicken",
  "url": "https://smittenkitchen.com/2016/09/piri-piri-chicken/"
}