{
  "date": "2007-08-24T13:47:03+00:00",
  "directions": [
    "1. Preheat oven to 300 degrees. Cut a small slice from the bottom of a rond de Nice squash so that it sits flat. Cut the top, about 2-inches from the stem end, leaving a nice wide hole. Using a spoon, scoop out the insides, leaving a 1/4-inch thick wall of squash on all sides. Trim the top of the squash. Set the squash flesh aside. Repeat with the remaining squash. Season the inside of each squash with salt and turn upside down onto a plate. (The salt will draw out the moisture.)",
    "2. In a large saucepan, heat 1 tablespoon of the olive oil over low heat. Add the onion, garlic (optional) and a pinch of salt and cook until tender. Add the sausage, raise the heat to medium, and cook, stirring often to break up the sausage, until it is no longer pink.",
    "3. Finely chop the reserved squash flesh and add it to the onion-sausage mixture with some salt. Cook uncovered, stirring occasionally, until the squash is tender, about 5 minutes. Add the tomato paste, if using, and cook for one minute longer.",
    "4. Using a slotted spoon, transfer the mixture to a mixing bowl, leaving the excess liquid in the pot. Stir in the breadcrumbs and parsley and season to taste with salt and black pepper.",
    "5. Turn the squash right-side up and stuff them with the squash-sausage filling. If poaching in olive oil, place in a pot fitted with a lid and just large enough to hold them snug. Pour the 2 to 3 1/2 cups olive oil into the pan around the squash, enough to rise just to the top. Add the rosemary, thyme, peppercorns and garlic and cover. If baking without olive oil, spread a teaspoon or two of olive oil at the bottom of a baking dish big enough to hold the squash snug, place them inside, and cover the dish. For both, cook in the oven until the squash is tender when pierced with a knife, about 45 to 60 minutes. ",
    "The squash can be served immediately or cooled, in or out of the oil, and reheated later. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/rtfr1.jpg?w=500",
  "ingredient_list": [
    "2 1/2 pounds rond de Nice squash (about 6), (large zucchini, either cut in half lengthwise or cut into pieces 2-inches tall and scooped out, may be substituted for rond de Nice.)",
    "Salt",
    "1 tablespoon, olive oil",
    "1 onion, minced",
    "1 clove of garlic, minced (optional)",
    "1/3 pound loose mild Italian sausage",
    "2 to 3 tablespoons tomato paste (optional)",
    "1/2 cup breadcrumbs",
    "2 tablespoons chopped parsley",
    "Freshly ground black pepper",
    "1 tablespoon chopped fresh thyme (optional)"
  ],
  "tags": [
    "Photo",
    "Summer",
    "Summer Squash"
  ],
  "title": "stuffed rond de nice squash",
  "url": "https://smittenkitchen.com/2007/08/rtfr/"
}