{
  "date": "2014-05-22T11:42:07+00:00",
  "directions": [
    "Make dough: In a mixing bowl (or the bowl of a stand mixer), stir together syrup or sugar, lard or butter, yeast, water and half the flour. Add kosher salt and remaining flour and stir just until mixture comes together in a shaggy mass. Turn out onto counter (or attach dough hook to mixer) and knead for 8 to 10 minutes, until smooth and supple. Cut into desired number of pieces (see Yield above) and let rest 5 minutes before shaping. ",
    "To form hamburger buns or sandwich rolls, form each piece into a ball and stretch and tuck the sides under, forming a neat round. To form hot dog buns, form each piece into a 7-inch log. To form pretzel knots, roll each piece into a rope (traditionally, the ends are skinny and the center is fat). Lift the ends, twist them around each other once and bend the twist back, pressing the ends onto the ‘belly’ at about 4 and 8 o’clock. Stretch the “shoulders” of the pretzels out as much as desired. ",
    "Transfer formed pretzel buns and knots onto baking sheets lined with parchment paper (for easiest removal), giving each room to grow. Let rest at room temperature for 30 minutes (no need to cover them, but I could not resist lightly covering them with plastic to protect from drafts), then in the fridge for 1 hour or overnight. ",
    "If using concentrated baking soda bath, you’ll want to begin prep now. Heat oven to 250 to 300 degrees F. Spread 1 cup baking soda on a foil-lined baking sheet. Bake baking soda for one hour. You’ll have about 2/3 cup when you’re done; you’ll use it in a minute. Because of its concentration, it’s best to use latex gloves when touching it.",
    "Heat oven to 425 degrees F.",
    "Dip your pretzels:",
    "Bake pretzels: If using either baking soda method, beat egg with a teaspoon of water and brush it over poached pretzels for improved glossiness. If desired, make slashes in buns (I like a criss-cross on round buns and three diagonal ones on hot dog buns; slash deeper than you think necessary or the lines will disappear, as mine did in this batch). Sprinkle pretzels with coarse or pretzel salt and bake for 12 to 15 minutes, rotating tray once to get an even, dark color. Transfer to rack. Serve warm. ",
    "Do ahead: Soft pretzels are always best warm from the oven. They will not keep well overnight; in a container or bag, the salt will dissolve and the tops will become wet — it’s very unpleasant. I find it easiest to form them the night before and just dip and bake them before taking them where we will eat them. Once baked, they’ll be good to eat for up to 6, but will be best in the first hour or two.",
    "***",
    "Rye pretzel variation: You can swap up to 1 cup of the flour for a dark rye flavor for a more complex flavor. ",
    "Yeast exchange: If you only have active dry yeast and want to use it here in a 1:1 exchange, you can do so by stirring it into the lukewarm water (not over 115 degrees F) and letting it sit for 5 minutes (it should dissolve and look a little foamy) before adding it when you’d add the water to the dough. The rising time should be approximately the same, but I’d still suggest that the first time you make it, you keep an eye on it in case it takes more or less time.",
    "Where to buy pretzel salt: I just use a coarse sea salt (often La Baleine brand, but this time, something from a bulk bin) Amazon, King Arthur Flour, from Morton brand and many other places online. ",
    "Where to buy food-grade lye: You can order it from Amazon or Modernist Pantry, but if you’re in NYC, as of Tuesday morning, the Williamsburg location of Brooklyn Kitchen sold it in small and large bottles and had at least 18 (yes, I counted) bottles in stock, inexpensively."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/soft-pretzel-buns-and-knots1.jpg?w=640",
  "ingredient_list": [
    "For dough",
    "1 tablespoon barley malt syrup or dark brown sugar",
    "2 tablespoons lard or softened or melted and cooled unsalted butter",
    "2 tablespoons instant or rapid-rise yeast",
    "2 cups lukewarm water",
    "6 cups (about 30 ounces) all-purpose or bread flour",
    "1 tablespoon plus 1/2 teaspoon kosher salt ",
    "For dipping (pick one)",
    "1/4 cup baking soda (for standard baking soda bath), 1 cup baking soda (for concentrated baking soda bath) or 1/4 cup food-grade lye (for darkest, most authentic finish and flavor)",
    "Water",
    "To finish",
    "1 large egg (for baking soda methods only)",
    "Coarse sea salt or pretzel salt"
  ],
  "tags": [
    "Bread",
    "German",
    "Grilling",
    "Photo",
    "Summer"
  ],
  "title": "soft pretzel buns and knots",
  "url": "https://smittenkitchen.com/2014/05/soft-pretzel-buns-and-knots/"
}