{
  "date": "2017-05-19T12:23:58+00:00",
  "directions": [
    "Make grahams in a food processor: Combine flour, salt, baking powder, spices and sugars in the work bowl of a food processor, running until mixed. The brown sugar will want to clump; just break it up with a spoon or spatula and keep running the machine until it gives up. Add butter and run machine until it is powdery. Add egg and honey and run machine until the dough begins to clump/ball together.\nMake grahams without a food processor: Beat softened butter with sugars until combined. Add egg and honey, beat until smooth. Sprinkle mixture with spices, baking powder, and cinnamon and beat until very well combined. Add flour and mix only until it disappears. You’ll want to cool this dough slightly if it’s very soft before rolling it out; you absolutely don’t want it as cold and firm as a regular roll-out cooke dough but if it’s, say, as soft as frosting, it will be too mushy to roll easily.\nBoth methods: Heat oven to 350 degrees F. Get out 4 sheets of parchment paper and locate a bowl or plate with a 7-inch diameter. Divide dough into 6 balls. Roll out first ball between two sheets of parchment paper until it is slightly larger than the 7-inch rim. Do not trim. Remove the top sheet carefully (if it gives you any guff/sticking, just slide this dough sheet into the freezer for 2 to 3 minutes to firm up before trying again; I didn’t find this at all necessary).",
    "Bake grahams: Slide graham round and the paper it is on onto a baking sheet and bake for 8 minutes, until it’s a shade darker on top and browned at the edges; don’t be afraid of a medium-brown color in places; it provides crisp.\nThe moment it comes out of the oven, place the 7-inch plate or bowl right on top of the hot cooking and use a sharp knife or pastry wheel to cut the cookie into a circle. Remove the bowl or plate, leave edges attached to cookie; they’ll remove easily once it has cooled for a minute or two. Slide parchment sheet with cookie on it onto cooling rack. In a couple minutes, it will be cool enough to remove the parchment sheet. Reuse it for other cookies.\nMeanwhile, use additional sheets of parchment to create an assembly line so that as soon as the first cookie round is baked, you can slide the next one in. (Or, if your oven is bigger, bake two at a time, lucky you.) Reuse all parchment rounds. Don’t forget to trim the cookies while they’re hot, it’s much easier this way. Once cookies are cool, you can stack them to save space.\nTo finish and assemble cake, ideally a few hours before you want to serve it: (No need to rest this overnight, as you would with other icebox cakes; it softens much faster.) Slice your strawberries paper thin with your sharpest knife. Set aside.\nPlace sugar in the bottom of a large bowl and sprinkle zest over it; rub zest into sugar with your fingertips so that it releases the most flavor. Add cream cheese and beat until combined, light, and fluffy. Add vanilla and salt and beat again. Add heavy or whipping cream just a spoonful at a time at first. You want to stretch the whipped cream cheese very slowly or it will take on a lumpy appearance. Once enough cream has been added that the mixture is liquid, add the rest. Beat cream and cream cheese together until it holds soft peaks.",
    "Assemble cake: Place a small dab of whipped cream on the center of serving plate and place first cookie on top; in a few minutes, it will soften it enough that it doesn’t slide around so much. Scoop 1/6 of cream onto first cookie layer and spread it almost completely to edges. Arrange strawberry slices in a single layer, not so close that they touch, but so the top is as well-pebbled as you see in these pictures. Repeat 5 more times. Rest cake in fridge for 3 to 4 hours before serving.",
    "Do ahead: Baked, cooled cookies keep for a week, if not longer, at room temperature in a tin or loosely wrapped. Cake with fresh berries, once assembled, is best in its first 24 to 36 hours. See suggestions up top for alternatives that might hold up longer."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/strawberry-graham-icebox-cake.jpg?w=750",
  "ingredient_list": [
    "1 3/4 cups plus 2 tablespoons (230 grams) all-purpose flour",
    "1/2 teaspoon fine sea or table salt",
    "1/2 teaspoon baking powder",
    "1/4 teaspoon ground cinnamon",
    "Pinch of ground cloves",
    "1/3 cup (65 grams) granulated sugar",
    "2/3 cup (125 grams) dark brown sugar",
    "1 tablespoon (15 ml) honey",
    "1/2 cup (115 grams) unsalted butter, cold is fine if using a food processor, softened otherwise",
    "1 large egg",
    "6 tablespoons (75 grams) granulated sugar",
    "Finely grated zest of half a lemon",
    "8 ounces cream cheese, very soft",
    "1 teaspoon (5 ml) vanilla",
    "1/8 teaspoon fine salt",
    "1 1/2 cups (355 ml) heavy or whipping cream",
    "3 1/2 to 4 cups (to be safe) fresh strawberries, hulled"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Photo",
    "Strawberries",
    "Summer"
  ],
  "title": "strawberry graham icebox cake",
  "url": "https://smittenkitchen.com/2017/05/strawberry-graham-icebox-cake/"
}