{
  "date": "2010-06-07T13:44:09+00:00",
  "directions": [
    "Make grahams: In a bowl, whisk both flours with the cinnamon, salt and cloves. Beat the butter, light brown sugar and 2 tablespoons of the granulated sugar at medium speed on an electric mixer until fluffy, about 1 minute. Beat in the honey and molasses, about 30 seconds. Scrape down the side of the bowl and beat in the flour mixture at low speed, just until incorporated. Pat the dough into a disk, cover with plastic and refrigerate until firm, about 1 hour.",
    "Preheat the oven to 350°F. Line 2 large baking sheets with parchment paper. On a lightly floured work surface, roll out the dough 1/8 inch thick. Using a 3 1/2-inch oval cookie cutter (recommendation of original recipe), a 3 1/2-inch round cutter (what I had, and used) or a smaller cutter of your choice (I might go with 3 inches next time, as I like petite desserts), stamp out your bases. (About 16 with a 3 1/2-inch oval, 10 with a 3 1/2-inch round or more with a smaller cutter.) Reroll the dough scraps if necessary. Transfer the grahams to the baking sheets and bake for about 12 minutes, rotating the pans halfway through, until lightly golden around the edges. Let cool on the pans for 5 minutes, then transfer the grahams to racks to cool completely.",
    "Make toppings: In a bowl, toss the strawberries with the remaining 3 tablespoons of sugar and the lemon juice. Let stand until syrupy, 20 minutes. In a medium bowl, mix the ricotta, confectioners’ sugar and lemon zest.",
    "Assemble tartlets: Spread about 1 tablespoon of the ricotta mixture on each graham. Arrange the strawberries over the ricotta, drizzle with the syrup and serve.",
    "Do ahead: Grahams will keep in an airtight container for up to two weeks. They will keep longer, unbaked, in the freezer. Ricotta mixture, if your ricotta is fresh, will keep for a day or two and up to a week if from packaged ricotta. Strawberry mixture should, in theory, keep for a few days but will not because it is delicious enough to spoon over every yogurt, oatmeal or ice cream scoop you can find. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/strawberry-ricotta-graham-tartlets1.jpg?w=500",
  "ingredient_list": [
    "1 cup plus 2 tablespoons all-purpose flour, plus more for dusting",
    "1/4 cup whole wheat flour, or graham flour if you can get it",
    "3/4 teaspoon cinnamon",
    "1/2 teaspoon salt",
    "Pinch of ground cloves",
    "1 stick unsalted butter, softened",
    "2 tablespoons light brown sugar",
    "3 tablespoons plus 2 tablespoons granulated sugar",
    "2 tablespoons honey",
    "1 1/2 teaspoons molasses (you can swap this with additional honey, if desired)",
    "3/4 pound strawberries, thinly sliced",
    "1 1/2 tablespoons fresh lemon juice",
    "1 1/4 cups ricotta (10 ounces), fresh if you can find it, a full-fat store bought if you cannot",
    "2 tablespoons confectioners’ sugar",
    "1 teaspoon finely grated lemon zest"
  ],
  "tags": [
    "Cookie",
    "Photo",
    "Strawberries",
    "Summer",
    "Tarts/Pies"
  ],
  "title": "strawberry-ricotta graham tartlets",
  "url": "https://smittenkitchen.com/2010/06/strawberry-ricotta-graham-tartlets/"
}