{
  "date": "2009-06-18T11:42:45+00:00",
  "directions": [
    "Accompaniment:  Heavy cream",
    "Stir together strawberries, sugar and lemon in a 4-quart heavy saucepan and let stand, stirring occasionally, until juicy, about 15 minutes. Bring to a simmer over medium heat, stirring occasionally.",
    "Stir the flour, baking powder, and salt together. Heat the milk and butter together just until the butter melts. Stir this warmed milk mixture into the flour mixture with a wooden spoon until incorporated and smooth. Gather a golf-ball-sized portion of the dumpling batter onto a small spoon, then push the dumpling onto the stew using a second spoon. (I used a small cookie scoop for this — a #70. It made 16 dumplings. Yes, I counted because someone always asks these things!) Cover the fruit with the dumplings, leaving about 1/4 inch between each. ",
    "Tightly cover saucepan and reduce heat to low. Cook, undisturbed, until dumpling looks dry on top, 15 to 18 minutes; the dumplings will have doubled in size. Let stand off heat, uncovered, five minutes, then drizzle with heavy cream right before serving. ",
    "This dish definitely tastes best freshly made, as the dumplings do dry out a bit by the second. But then it starts to taste like a cobbler, and really, who is going to complain about that?"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/strawberries-and-dumplings1.jpg?w=500",
  "ingredient_list": [
    "1 quart (about 2 pints or 4 cups or 1.25 pounds or just shy of 600 grams) strawberries, trimmed and thickly sliced (about 4 cups)",
    "1/4 cup sugar (though I might try this with brown sugar next time, just to up the cozy quotient)",
    "Juice of half a lemon",
    "1 cup unbleached all-purpose flour",
    "1 1/2 teaspoons baking powder",
    "Pinch of salt",
    "1/2 cup whole milk",
    "2 tablespoons unsalted butter"
  ],
  "tags": [
    "Crumbles/Crisps",
    "Fruit",
    "Photo",
    "Strawberries",
    "Summer"
  ],
  "title": "strawberries and dumplings",
  "url": "https://smittenkitchen.com/2009/06/strawberries-and-dumplings/"
}