{
  "date": "2015-07-09T12:04:23+00:00",
  "directions": [
    "Heat oven to 400°F (205°C). Line a large baking sheet with parchment paper. ",
    "In a large bowl, combine flours, zest, sugar, baking powder and salt. Add cold butter and work into the flour mixture until the biggest pieces are the size of small peas with either your fingertips or a pastry blender. Stir in blueberries, then milk, mixing only until large clumps form. Use your hands to reach inside the bowl and gently (so gently) knead the mixture into one mass. The more you knead, the wetter the dough will get as the blueberries break up, so work quickly and knead only a few times, if you can get away with it.",
    "Transfer dough to a well-floured counter and pat into a roughly 1-inch tall disc. Cut into 8 to 10 wedges, do not fret if the blueberries are now making a mess of the dough; it will all work out in the oven. Transfer wedges to prepared baking sheet, spacing them apart. Brush the tops of each with egg, then sprinkle with coarse sugar.",
    "Bake for 15 to 17 minutes, until scones are golden brown on top. Serve warm. I find most scones to be best the first day, but these were not bad at all on day two, gently rewarmed in the oven before eating. ",
    "If freezing: I like to freeze scones unbaked and usually hold any egg wash until I’m ready to bake them. Simply spread the wedges on a baking sheet and chill until frozen solid and will no longer stick to each other, and pack tightly into a freezer bag. You can bake them right from the freezer; you’ll only need 2 to 4 minutes extra baking time."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/07/very-blueberry-scones1.jpg?w=640",
  "ingredient_list": [
    "1 cup (125 grams) all-purpose flour",
    "1 cup (120 grams) whole wheat flour",
    "Zest of 1 lemon, finely grated",
    "3 tablespoons raw (turbinado) or light brown sugar",
    "2 teaspoons baking powder",
    "1/2 teaspoon coarse or kosher salt",
    "5 tablespoons cold unsalted butter, cut into small bits",
    "1 cup fresh blueberries",
    "2/3 cup (150 ml) milk, whole is best here",
    "1 large egg, beaten",
    "1 tablespoon raw (tubinado) or other coarse sugar for finishing"
  ],
  "tags": [
    "Blueberries",
    "Breakfast",
    "Brunch",
    "Freezer Friendly",
    "Photo",
    "Scones/Biscuits",
    "Summer"
  ],
  "title": "very blueberry scones",
  "url": "https://smittenkitchen.com/2015/07/very-blueberry-scones/"
}