{
  "date": "2016-09-23T11:47:23+00:00",
  "directions": [
    "Make/mold the ice cream center:Coat a 1.5-quart bowl (6 cup; rim should be about 9 inches in diameter) lightly with nonstick spray. Line with two pieces (because you’ll want a lot of overhang) of plastic wrap, overlapping them in the center.",
    "Scoop ice cream into bowl in any pattern or non-pattern you wish. Use the overhang to cover exposed ice cream and press it mostly flat. Place this ice cream bowl in the freezer for 3 to 6 hours, or overnight, until fully firm again.\nMake the brownie base: Heat oven to 350°F. Line a round baking pan slightly larger than the diameter of your ice cream bowl (i.e. 8 to 9 inches) with parchment paper and butter the parchment and sides of the pan.",
    "In a medium heatproof bowl over gently simmering water, melt chocolate and butter together until only a couple unmelted bits remain. Off the heat, stir until smooth and fully melted. You can also do this in the microwave in 30-second bursts, stirring between each. Whisk in sugar, then eggs, one at a time, then vanilla and salt. Stir in flour with a spoon or flexible spatula and scrape batter into prepared pan, spread until even. Bake for 25 to 30 minutes, or until a toothpick inserted into the center comes out batter-free.\nLet cool in pan on a rack for 15 minutes then run a knife around the brownie to loosen it and flip out of pan onto the cooling rack. You might need to bang it around a little but it will come out best while it is still warm. (Read: The first time I wait until it was totally cold and nope. Put the cooling rack with the brownie right into the freezer to fully cool and firm up, about 30 minutes.",
    "Place brownie on cake serving plate. Use the outline of the ice cream bowl to mark the size you want to trim the brownie to, and then cut away — don’t forget to share the scraps (or not). Use the plastic covering the bowl/mold as handles to yank the firm ice cream out of the bowl and onto the brownie. Trim the brownie further if needed. Return the ice cream-topped brownie cake to the freezer to firm again, 1 to 2 hours.\nMake the meringue:  Beat the egg whites with a pinch of cream of tartar in an electric mixer until satiny peaks form and then beat in the sugar a spoonful at a time — I do spoonful, pause, spoonful, pause until all of the sugar has been added and then keep running the mixer until the meringue is stiff and shiny. Beat in the salt and vanilla.\nFrost the cake Spread the meringue in big, messy swirls over the ice cream and brownie base. Return the cake to the freezer for as long as needed — you can use it right away, but it’s best to let it re-firm freeze for another hour. You can also leave it in for a full day.\nToast the meringue: You can do this one of two ways.",
    "Oven method: Preheat the oven to 500 degrees. Bake the cake until the meringue peaks are golden, about 4 minutes.",
    "Blowtorch method: Torch the cake until toasted all over.",
    "Both methods: If you’re not going to need the cake right now, return it to the freezer until needed. Take out 5 minutes before serving.\nFlambé finish (optional): [Please note: I have done this twice, ever. It works but I’m hardly an expert and if there are more helpful tips offered in the comments, I’ll be happy to point you to them.] Fill a mug halfway with very hot water. Place alcohol in a shot glass and set it inside the hot water (not letting the water spill in) until the alcohol is very warm to the touch, about 5 minutes. Remove the now-warm cup of alcohol from the water; discard the water.\nTake a deep breath. Hold the hot cup of alcohol in a oven mitt-ed hand. Light a match with the other. With the cake below you, begin to tip the alcohol as slowly as possible to the edge of the cup. Light the alcohol with the match — it’s going to be a low, blueish kitten of a flame, promise. Drizzle this burning alcohol over the cake. You can let it flame out or it can be blown out. (Ours lasted 15 to 30 seconds.)",
    "To serve: Serve cake in thin wedges, cutting with a very sharp or serrated knife as frozen brownie is quite dense, chewy and all the more rewarding because of it. Cake keeps in the freezer for easily a week (and probably longer); the meringue holds up surprisingly well."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/baked-alaska.jpg?w=750",
  "ingredient_list": [
    "Nonstick spray oil, to coat the bowl",
    "6 cups (from 3 pints) ice cream, one flavor or a mix of flavors you like",
    "3 ounces (85 grams) unsweetened chocolate, roughly chopped",
    "1 stick (4 ounces or 115 grams) unsalted butter, plus extra for pan",
    "1 1/3 cups (265 grams) granulated sugar",
    "2 large eggs",
    "1 teaspoon (5 ml) vanilla extract",
    "1/2 teaspoon flaky sea salt or 1/4 teaspoon table salt (about 2 grams)",
    "2/3 cup (85 grams) all-purpose flour",
    "3 large egg whites",
    "Pinch of cream of tartar",
    "2/3 cup granulated sugar",
    "1 teaspoon vanilla extract",
    "Pinch or two of salt",
    "1 ounce (2 tablespoons) brandy or kirsch"
  ],
  "tags": [
    "Announcements",
    "Cake",
    "Celebration Cakes",
    "Ice Cream/Sorbet",
    "Photo"
  ],
  "title": "baked alaska + smitten kitchen turns 10!",
  "url": "https://smittenkitchen.com/2016/09/baked-alaska-smitten-kitchen-turns-10/"
}