{
  "date": "2013-04-17T11:40:10+00:00",
  "directions": [
    "Make the cake: Combine all of the cake ingredients in a medium-sized mixing bowl, stirring till the mixture becomes cohesive, then stirring for two minutes more. In a stand mixer, you can mix this with the paddle attachment (no dough hook needed; batter is thin) at low-medium speed for 2 to 3 minutes. Scrape down sides, cover with plastic wrap and let rise in a draft-free place for 60 minutes, till it’s a little puffy. (It won’t fully double; this is fine.)",
    "Butter a 9-inch round cake pan. Stir the batter a few times to deflate it slightly, then scrape it into the prepared pan and nudge it until it fills the bottom. Cover again with plastic wrap (don’t let it drape in and touch the top) and set aside for another 30 minutes. ",
    "Meanwhile, make the honey-almond-crunch topping: In a small or medium saucepan over medium heat, heat the butter, sugar, honey, cream and salt until the butter is melted. Bring to a simmer and let it boil for 3 to 5 minutes, until the mixture becomes a shade darker (it should go from a yellowish tone to a light beige), stirring frequently. Stir in the almonds. You will probably panic because this mixture is going to get very thick — but don’t. Set it aside to cool slightly. ",
    "Heat your oven to 350 degrees.",
    "Once the cake has finished its second rise (again, it’s not going to rise a lot; don’t sweat it) use a small spoon to scoop out small amounts of the almond topping and distribute it over the top of the cake. It’s going to be a little pesky because it is firm, but I promise (see above: multiple photos of this process to ease your worry), even if it’s not perfectly evenly distributed, it will all smooth out gorgeously in the oven.",
    "Bake cake on a foil-lined tray to catch any caramel drips, for 20 to 25 minutes, until top is bronzed and toothpick inserted into the center comes out batter-free. (Caramel on it is fine, and should be tasted.) Transfer to a cooling rack and let it sit in the pan for 10 minutes. After 10 minutes, run a knife along the outside of the cake, making sure no places are stuck and invert the cake onto the cooling rack. If you’re like me, you’ll be positive that all of the almonds will fall off, but shockingly, in five rounds, I only lost one or two. Reverse it back onto another rack to finish cooling, replacing any almonds that fell off right back on top. They’ll merge back with the caramel as it cools; nobody will know. ",
    "Make pastry cream: Warm milk and vanilla bean scrapings (if using; if using an extract, don’t add yet) in a medium saucepan. Pour into a small bowl or cup, ideally with a spout. Set aside. Rinse saucepan with cool water, to rinse and cool; wipe to dry. Off the heat, whisk the yolks and sugar vigorously together for a minute, until pale and ribbony. Whisk in flour and salt until smooth. Drizzle in warm milk mixture, a spoonful at a time, whisking the whole time. Once you’ve add half of it, you can add the rest in a more steady stream, again whisking the whole time. Return the saucepan to the stove and cook on medium-high heat until it bubble, then simmer for one to two minutes, more whisking the whole time. Off the heat, whisk in the butter and any extracts you may be using. Cool custard completely before using, a process that can be sped up in the fridge or whisking it over a bowl over ice water. ",
    "Finally, assemble the cake: Once both the cake and pastry cream are fully cooled, place the cake on a serving platter and divide it horizontally into two layers with a long serrated knife. Spread pastry cream over bottom half. Place top half on pastry cream. Serve in wedges; watch out for bees. Refrigerate any leftovers."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/bee-sting-cake.jpg?w=750",
  "ingredient_list": [
    "Cake",
    "2 1/4 teaspoons (or 1 1/4-ounce package) instant yeast (not active dry) (also sold as rapid rise or bread machine yeast)",
    "3/4 cup whole milk, ideally at room temperature",
    "1/4 cup granulated sugar",
    "2 cups all-purpose flour",
    "3/4 teaspoon table salt",
    "2 large eggs, ideally at room temperature",
    "4 tablespoons unsalted butter, at room temperature",
    "Honey-Almond-Crunch Topping",
    "6 tablespoons unsalted butter, cold is fine",
    "1/3 cup granulated sugar",
    "3 tablespoons honey",
    "2 tablespoons heavy cream",
    "1 1/2 cups (4 3/4 ounces) sliced almonds",
    "Two pinches of sea salt",
    "Pastry Cream Filling",
    "1 cup whole milk",
    "Seeds from 1/4 to 1/2 vanilla bean, 1 teaspoon pure vanilla extract or 1/4 teaspoon almond extract",
    "3 large egg yolks",
    "1/4 cup granulated sugar",
    "3 tablespoons all-purpose flour or cornstarch [updated]",
    "2 pinches sea salt",
    "2 tablespoons unsalted butter, cold is fine "
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Everyday Cakes",
    "German",
    "Photo"
  ],
  "title": "bee sting cake",
  "url": "https://smittenkitchen.com/2013/04/bee-sting-cake/"
}