{
  "date": "2009-11-28T13:19:00+00:00",
  "directions": [
    "A handful of chocolate covered espresso beans (optional)",
    "Make crust: Finely grind cookies, chopped chocolate, brown sugar, and nutmeg in processor. Add butter and process until crumbs begin to stick together, scraping down bowl occasionally, about 1 minute. Transfer crumbs to 9-inch-diameter springform pan with 3-inch-high sides. Wrap plastic wrap around fingers and press crumb mixture firmly up sides to within 1/2 inch of top edge, then over bottom of pan.",
    "Make ganache: Bring cream to simmer in large saucepan. Remove from heat; add chocolate and Kahlúa. Whisk until chocolate is melted and ganache is smooth. Pour 2 cups ganache over bottom of crust. Freeze until ganache layer is firm, about 30 minutes. Reserve remaining ganache; cover and let stand at room temperature to use later for decorating.",
    "Make filling: Position rack in middle of oven and preheat to 350°F. Using electric mixer, beat cream cheese and sugar in large bowl until blended. Scrape down bowl, making sure you get to the bottom, where little pockets of unmixed cream cheese love to hide. Beat in flour. Stir rum, espresso powder, ground coffee, vanilla, and molasses in small bowl until instant coffee dissolves; beat into cream cheese mixture. Beat in eggs one at a time, scraping down sides of bowl between each addition.",
    "Pour filling over cold ganache in crust — it will go nearly all of the way to the top, don’t panic. Place cheesecake on rimmed baking sheet. Bake until top is brown, puffed and cracked at edges, and the center two inches moves only slightly when pan is gently shaken, about one hour. Transfer cheesecake to rack. Cool 15 minutes while preparing topping (top of cheesecake will fall slightly, making room for topping). Maintain oven temperature.",
    "Make topping: Whisk sour cream, sugar, and vanilla in medium bowl to blend. Pour topping over hot cheesecake, spreading to cover filling completely. Bake until topping is set, about 10 to 15 minutes. Transfer cheesecake to rack. Refrigerate hot cheesecake on rack until cool, about three hours.",
    "Run small sharp knife between crust and pan sides to loosen cake; release pan sides. Transfer cheesecake to platter. Spoon reserved ganache into pastry bag fitted with small star tip. If you’d like to make an approximation (perhaps less rushed?) of the above decoration, pipe 6 diagonal lines atop cheesecake, spacing 1 inch apart. Repeat in opposite direction, making lattice. Pipe rosettes (or, uh, stars if you realize you do not have the energy nor inclination to practice rosette piping at that hour) of ganache around top edge of cake. Otherwise, have fun decorating freely. Espress(o) — ow — yourself!",
    "Garnish with chocolate-covered espresso beans, if desired. Chill until lattice is firm, at least 6 hours.",
    "Do ahead: Cake is best made a day ahead, so the flavors have time to settle. The cake also takes enough time to make that it’s best not to rush through it the day you want to serve it. It can be made up to four days ahead. Wrap loosely in foil, forming dome over lattice; keep chilled. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cappuccino-fudge-cheesecake1.jpg?w=500",
  "ingredient_list": [
    "Crust",
    "1 9-ounce box chocolate wafer cookies or 9 ounces of homemade chocolate wafers",
    "6 ounces bittersweet or semisweet chocolate, coarsely chopped",
    "1/2 cup (packed) dark brown sugar",
    "1/8 teaspoon ground nutmeg",
    "7 tablespoons hot melted unsalted butter",
    "Ganache",
    "1 1/2 cups heavy or whipping cream",
    "20 ounces bittersweet or semisweet chocolate, chopped",
    "1/4 cup Kahlúa or other coffee-flavored liqueur",
    "Filling",
    "3 8-ounce packages cream cheese, room temperature",
    "1 cup sugar",
    "1 1/2 tablespoons all purpose flour",
    "1 1/2 tablespoons dark rum",
    "1 1/2 tablespoons instant espresso powder or coffee crystals",
    "1 1/2 tablespoons ground whole espresso coffee beans (medium-coarse grind) (I skipped this, increased the espresso powder instead)",
    "2 teaspoons vanilla extract",
    "1 1/2 teaspoons mild-flavored (light) molasses",
    "3 large eggs",
    "Topping",
    "1 1/2 cups sour cream",
    "1/3 cup sugar",
    "2 teaspoons vanilla extract"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Chocolate",
    "Photo"
  ],
  "title": "cappuccino fudge cheesecake",
  "url": "https://smittenkitchen.com/2009/11/cappuccino-fudge-cheesecake/"
}