{
  "date": "2009-01-30T12:07:20+00:00",
  "directions": [
    "Special equipment: 1-inch round cookie cutter or an apple corer and a piping bag (though a plastic bag with the corner snipped off will also work)",
    "Make the cupcakes: Preheat oven to 350°F. Line 24 cupcake cups with liners. Bring 1 cup stout and 1 cup butter to simmer in heavy large saucepan over medium heat. Add cocoa powder and whisk until mixture is smooth. Cool slightly.",
    "Whisk flour, sugar, baking soda, and 3/4 teaspoon salt in large bowl to blend. Using electric mixer, beat eggs and sour cream in another large bowl to blend. Add stout-chocolate mixture to egg mixture and beat just to combine. Add flour mixture and beat briefly on slow speed. Using rubber spatula, fold batter until completely combined. Divide batter among cupcake liners, filling them 2/3 to 3/4 of the way. Bake cake until tester inserted into center comes out clean, rotating them once front to back if your oven bakes unevenly, about 17 minutes. Cool cupcakes on a rack completely.",
    "Make the filling:  Chop the chocolate and transfer it to a heatproof bowl. Heat the cream until simmering and pour it over the chocolate. Let it sit for one minute and then stir until smooth. (If this has not sufficiently melted the chocolate, you can return it to a double-boiler to gently melt what remains. 20 seconds in the microwave, watching carefully, will also work.) Add the butter and whiskey (if you’re using it) and stir until combined.",
    "Fill the cupcakes: Let the ganache cool until thick but still soft enough to be piped (the fridge will speed this along but you must stir it every 10 minutes). Meanwhile, using your 1-inch round cookie cutter or an apple corer, cut the centers out of the cooled cupcakes. You want to go most of the way down the cupcake but not cut through the bottom — aim for 2/3 of the way. A slim spoon or grapefruit knife will help you get the center out. Those are your “tasters”. Put the ganache into a piping bag with a wide tip and fill the holes in each cupcake to the top.",
    "Make the frosting: Whip the butter in the bowl of an electric mixer, or with a hand mixer, for several minutes. You want to get it very light and fluffy. Slowly add the powdered sugar, a few tablespoons at a time.",
    "[This is a fantastic trick I picked up while working on the cupcakes article for Martha Stewart Living; the test kitchen chefs had found that when they added the sugar slowly, quick buttercream frostings got less grainy, and tended to require less sugar to thicken them up.]",
    "When the frosting looks thick enough to spread, drizzle in the Baileys (or milk) and whip it until combined. If this has made the frosting too thin (it shouldn’t, but just in case) beat in another spoonful or two of powdered sugar.",
    "Ice and decorate the cupcakes. [I used a star tip and made little “poofs” everywhere and sprinkled it with various colors of sanding sugar to keep it looking festive for New Years. I bet shaved dark and white chocolates would look gorgeous as well.]",
    "Do ahead: You can bake the cupcakes a week or two in advance and store them, well wrapped, in the freezer. You can also fill them before you freeze them. They also keep filled — or filled and frosted — in the fridge for a day. (Longer, they will start to get stale.)"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/car-bomb-cupcakes.jpg?w=752",
  "ingredient_list": [
    "1 cup stout (such as Guinness)",
    "1 cup (2 sticks) unsalted butter",
    "3/4 cup unsweetened cocoa powder (preferably Dutch-process)",
    "2 cups all purpose flour",
    "2 cups sugar",
    "1 1/2 teaspoons baking soda",
    "3/4 teaspoon salt",
    "2 large eggs",
    "2/3 cup sour cream",
    "Ganache Filling (Updated to double it, based on many commenters suggestions — thanks!)",
    "8 ounces bittersweet chocolate",
    "2/3 cup heavy cream",
    "2 tablespoons butter, room temperature",
    "1 to 2 teaspoons Irish whiskey (optional)",
    "Baileys Frosting (see Recipe Notes)",
    "3 to 4 cups confections sugar",
    "1 stick (1/2 cup or 4 ounces) unsalted butter, at room temperatue",
    "3 to 4 tablespoons Baileys (or milk, or heavy cream, or a combination thereof)"
  ],
  "tags": [
    "Cake",
    "Chocolate",
    "Photo"
  ],
  "title": "chocolate whiskey and beer cupcakes",
  "url": "https://smittenkitchen.com/2009/01/chocolate-whiskey-and-beer-cupcakes/"
}