{
  "date": "2008-12-25T13:37:45+00:00",
  "directions": [
    "Accompaniment: Unsweetened whipped cream",
    "Preheat oven to 350°F. Generously butter bundt pan and dust with flour, knocking out excess. (She is not kidding about this. I used a nonstick pan with a butter/flour spray and still lost a chunk of cake. I will be more generous next time.)",
    "Bring stout and molasses to a boil in a large saucepan and remove from heat. Whisk in baking soda, then cool to room temperature.",
    "Sift together flour, baking powder, and spices in a large bowl. Whisk together eggs and sugars. Whisk in oil, then molasses mixture. Add to flour mixture and whisk until just combined.",
    "Pour batter into bundt pan and rap pan sharply on counter to eliminate air bubbles. Bake in middle of oven until a tester comes out with just a few moist crumbs adhering, about 50 minutes. Cool cake in pan on a rack 5 minutes. Turn out onto rack and cool completely.",
    "Serve cake, dusted with confectioners sugar, with whipped cream.",
    "Do ahead: This gingerbread is better if made a day ahead. It will keep 3 days, covered, at room temperature. I am sure it will keep well-wrapped in the freezer even longer."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/gramercy-taverns-gingerbread1.jpg?w=640",
  "ingredient_list": [
    "1 cup oatmeal stout or Guinness Stout",
    "1 cup dark molasses (not blackstrap)",
    "1/2 teaspoon baking soda",
    "2 cups all-purpose flour",
    "1 1/2 teaspoons baking powder",
    "2 tablespoons ground ginger",
    "1 teaspoon ground cinnamon",
    "1/4 teaspoon ground cloves",
    "1/4 teaspoon freshly grated nutmeg",
    "Pinch of ground cardamom",
    "3 large eggs",
    "1 cup packed dark brown sugar",
    "1 cup granulated sugar",
    "3/4 cup vegetable oil",
    "Confectioners sugar for dusting"
  ],
  "tags": [
    "Cake",
    "Christmas",
    "Photo",
    "Winter"
  ],
  "title": "gramercy tavern’s gingerbread",
  "url": "https://smittenkitchen.com/2008/12/gramercy-taverns-gingerbread/"
}