{
  "date": "2010-04-06T12:58:45+00:00",
  "directions": [
    "Make crumb crust: Stir together crust ingredients and press onto bottom and up the sides, stopping one inch shy of the top rim**, of a buttered 9 1/2-inch (or 24 cm) springform pan. You can fill it right away but I like to pop my into the freezer so it quickly sets while I prepare the filling.",
    "Make very tall cheesecake filling: Preheat oven to 550 F degrees***. Beat together cream cheese, sugar, flour and zest with an electric mixer until smooth. Add vanilla, then eggs and yolks, one at a time, beating on low speed until each ingredient is incorporated. Scrape bowl down between additions; I cannot stress this enough as if you do not, you’ll end up with unmixed stripes of cream cheese. I always find at least one, despite my best efforts.",
    "Put springform pan with crust in a shallow baking pan (to catch drips). Pour filling into crust (springform pan will be completely full) and baking in baking pan in the middle of the oven for 12 minutes or until puffed. Please watch your cake because some ovens will top-brown very quickly and if yours does too fast, turn the oven down as soon as you catch it. Reduce the temperature to 200 degrees (see Note below about my baking drama) and continue baking until cake is mostly firm (center will still be slightly wobbly when pan is gently shaken), about one hour more.",
    "Run a knife around the top edge of the cake to loosen it and cool the cake completely in springform on a rack, then chill it, loosely covered, at least 6 hours.",
    "Make cherry topping (optional): Place all ingredients together in a medium saucepan. Bring to a boil. Once it is boiling, cook it for an additional one to two minutes then remove from heat. Cool completely.",
    "Remove side of pan and transfer cake to a plate. If you had any wonky baking issues (see my Note below), you might need to trim the cake flat. I promise not to tell anyone what happened to those scraps, okay?",
    "Spread topping (if using) over chilled cheesecake. The original recipe says to bring this to room temperature before serving, but I never have!",
    "Do ahead: Cheesecake keeps, covered and chilled, 2 weeks.",
    "Baking drama: As some of the pictures might suggest, I really borked (an actual word, thank you) the baking of this cake. First, I was convinced that 550 degrees would singe my cake so I did the first step at 400, to see if you can get away with it. Yes, I am guilty of not following a recipe from time to time too. It turns out, 550 would have been just fine. Then, although I turned my oven down to 200, I didn’t check the thermometer inside my junky oven, and had I, I’d have realized that what my oven calls 200 is more like 150. And an hour later, was almost completely raw. Then I upped it to 300, which my oven told me was actually 250, where it still took another hour to bake and gained many cracks. I blame the fact that the oven didn’t start hot enough, as many others have made this recipe crack-free. What’s the point of me sharing this? To give you a heads up that oven wonkiness may ensue. What matters is that, in the end, you do not take the cake out before it is ready. An accurate oven helps too. I’m going to get right on that.",
    "* You might dial this up by up to another 1/4 cup if you’re using sour cherries. However, if you’re using sour cherries I’m going to assume it is because you like them, and the more tart taste they impart, thus you probably will enjoy this sauce just as much with only 1/4 cup sugar. Look at me, psychologizing!",
    "** This is updated based on responses from commenters. Thank you, intrepid home bakers!",
    "*** Yes, this is correct, but updated to note 9/12/10 that please, if you are using a Teflon-coated pan, note it’s temperature limit, often around 475, and only start your baking temperature there."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/4483663963_3070fd49b9_b.jpg?w=753",
  "ingredient_list": [
    "Crumb crust",
    "8 ounces (15 4 3/4 x 2 1/2-inch sheets of graham cracker; yes, I am crazy enough to both count and measure) finely ground graham crackers or cookies such as chocolate or vanilla wafers",
    "8 tablespoons (1 stick or 4 ounces or 113 grams) unsalted butter, melted",
    "1/2 cup sugar",
    "1/4 teaspoon salt",
    "Very tall cheesecake filling:",
    "5 (8-ounce) packages cream cheese, softened (Philadelphia is recommended for cheesecakes but if you’ve had success with other brands, feel free to use them again)",
    "1 3/4 cups sugar",
    "3 tablespoons all-purpose flour",
    "1 teaspoon finely grated lemon zest",
    "1 teaspoon finely grated orange zest",
    "5 large eggs",
    "2 large egg yolks",
    "1/2 teaspoon vanilla",
    "Cherry topping",
    "10 ounces sweet or sour cherries, pitted (they’re not in season here so I used frozen; worked just fine)",
    "2 tablespoons lemon juice",
    "1/4 cup sugar*",
    "1 tablespoon cornstarch",
    "1/2 cup water"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Cherries",
    "Photo"
  ],
  "title": "new york cheesecake",
  "url": "https://smittenkitchen.com/2010/04/new-york-cheesecake/"
}