{
  "date": "2012-05-29T12:28:00+00:00",
  "directions": [
    "Make the cake: Preheat your oven to 350°F. Coat the bottom and sides of a 9×13-inch baking pan with butter or a nonstick cooking spray, then line the bottom with parchment paper, extending the lengths up two sides. (It will look like a sling). Stir together rhubarb, lemon juice and 2/3 cup sugar and set aside. Beat butter, remaining sugar and lemon zest with an electric mixer until light and fluffy. Add eggs, one at at time, scraping down the sides after each addition. Whisk together flour, baking powder, 3/4 teaspoon table salt and ground ginger together in a small bowl. Add one-third of this mixture to the batter, mixing until just combined. Continue, adding half the sour cream, the second third of the flour mixture, the remaining sour cream, and then the remaining flour mixture, mixing between each addition until just combined. ",
    "Dollop batter over prepared pan, then use a spatula — offset, if you have one, makes this easiest — to spread the cake into an even, thin layer. Pour the rhubarb mixture over the cake, spreading it into an even layer (most pieces should fit in a tight, single layer). ",
    "Stir together the crumb mixture, first whisking the flour, brown sugar, table salt and cinnamon together, then stirring in the melted butter with a spoon or fork. Scatter evenly over rhubarb layer. Bake cake in preheated oven for 50 to 60 minutes. The cake is done when a tester comes out free of the wet cake batter below. It will be golden on top. Cool completely in the pan on a rack. ",
    "Cut the two exposed sides of the cake free of the pan, if needed, then use the parchment “sling” to remove the cake from the pan. Cut into 2-inch squares and go ahead and eat the first one standing up. (If it’s written into the recipe, it’s not “sneaking” a piece but, in fact, following orders, right?) Share the rest with friends. Cake keeps at room temperature for a few days, but I didn’t mind it at all from the fridge, where I kept it covered tightly. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/rhubarb-snacking-cake.jpg?w=750",
  "ingredient_list": [
    "Cake",
    "1 1/4 pound (565 grams) rhubarb, trimmed and cut into 1/2-inch lengths on the diagonal",
    "1 1/3 cup (265 grams) granulated sugar, divided",
    "1 tablespoon lemon juice (psst, skip ahead and zest it for the cake before you cut it)",
    "1/2 cup (1 stick, 4 ounces or 115 grams) unsalted butter, softened",
    "1/2 teaspoon finely grated lemon zest",
    "2 large eggs",
    "1 1/3 cups (165 grams) all-purpose flour",
    "1 teaspoon baking powder",
    "3/4 teaspoon table salt",
    "1/4 teaspoon ground ginger",
    "1/3 cup (80 grams) sour cream",
    "Crumb",
    "1 cup (125 grams) all-purpose flour",
    "1/4 cup (50 grams) light brown sugar",
    "1/8 teaspoon table salt",
    "1/4 teaspoon ground cinnamon",
    "4 tablespoons (1/2 stick, 2 ounces, or 55 grams) unsalted butter, melted"
  ],
  "tags": [
    "Cake",
    "Everyday Cakes",
    "Photo",
    "Picnics",
    "Rhubarb",
    "Spring",
    "Summer"
  ],
  "title": "rhubarb snacking cake",
  "url": "https://smittenkitchen.com/2012/05/rhubarb-snacking-cake/"
}