{
  "date": "2007-03-18T22:25:46+00:00",
  "directions": [
    "Make cake layers: Preheat oven to 350°F. Grease four 9-inch circular cake pans and line bottoms of circles with a piece of parchment paper. ",
    "Melt chocolate with water in a small heavy saucepan over very low heat, stirring. Cool to lukewarm.",
    "Beat yolks, 2/3 cup sugar, and salt in a large bowl with an electric mixer until thick and pale, about 5 minutes in a standing mixer or about 8 minutes with a hand-held mixer. Fold in melted chocolate until blended. Beat whites with cleaned beaters until they just hold soft peaks (you will need an enormous bowl for 12 egg whites). ",
    "Gradually add remaining 2/3 cup sugar and beat until whites just hold stiff peaks. Fold one third of whites into melted-chocolate mixture to lighten, then fold in remaining whites gently but thoroughly.",
    "Spread batter evenly over four baking pans and bake until puffed and top is dry to the touch, 15 to 18 minutes, rotating cakes between racks to ensure they bake evenly. Transfer pans to cooling racks and if necessary, loosen edges with a knife. ",
    "Sift cocoa powder over top of cake layers and place a piece of waxed paper over the top of the pans. Place a baking sheet over paper and invert cake onto it, gently peeling off wax paper lining. Place layers in the freezer for about an hour, until they are firm enough to be carefully lifted without breaking.",
    "Make filling: Beat cream with powdered sugar and Grand Marnier with cleaned beaters until it just holds stiff peaks. ",
    "Fill and stck cake: Bring first cake layer out of the freezer and arrange on platter, cocoa side down. Spread one-quarter of filling evenly over the cake. Bring the next cake layer out of the freezer, placing it gently over the filling, again cocoa side down. Repeat this process until all layers and whipped cream are used. ",
    "Keep cake in the refrigerator until you are ready to serve it. Two hours should be more than enough to assure that the layers are no longer frozen.",
    "Dark chocolate grated into curls with a vegetable peeler makes for an excellent garnish.",
    "* You can substitute the following for Grand Marnier: 4 tablespoons Cognac and 1 teaspoon vanilla; 4 tablespoons cocoa and 1 teaspoon vanilla; or 4 teaspoons instant-espresso powder or instant-coffee granules dissolved in 4 teaspoons water plus 1 teaspoon vanilla.",
    "To Make a Chocolate Cake Roll This section has a new home: Heavenly Chocolate Cake Roll."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-best-chocolate-cake-expletive-free1.jpg?w=500",
  "ingredient_list": [
    "To make four cake layers:",
    "12 oz fine-quality bittersweet chocolate (not unsweetened), chopped",
    "6 tablespoons water",
    "12 large eggs, separated, at room temperature",
    "1 1/3 cup sugar",
    "1/2 teaspoon salt",
    "2 tablespoons Dutch-process unsweetened cocoa powder",
    "For filling: ",
    "2 cups heavy cream",
    "6 tablespoons confectioners sugar, sifted",
    "4 tablespoons Grand Marnier*"
  ],
  "tags": [
    "Cake",
    "Celebration Cakes",
    "Chocolate",
    "Passover",
    "Photo"
  ],
  "title": "lighter-than-air chocolate cake",
  "url": "https://smittenkitchen.com/2007/03/the-best-chocolate-cake-expletive-free/"
}