{
  "date": "2006-09-24T09:10:34+00:00",
  "directions": [
    "1. Preheat the oven to 350°F (175°C). Grease and flour a 10-inch Bundt pan.",
    "2. Cream the butter and sugar in the bowl of an electric mixer fitted with the paddle attachment for about 5 minutes, or until light and fluffy. Add the eggs, one at a time, then the orange zest.",
    "3. Sift together 3 cups flour, the baking powder, baking soda, and salt in a large bowl. In another bowl, combine the orange juice, buttermilk, and vanilla. Add the flour and buttermilk mixtures alternately to the creamed butter, beginning and ending with the flour. Toss the chocolate chunks with 2 tablespoons flour and add to the batter. Pour into the pan, smooth the top, and bake for 45 minutes to 1 hour, until a cake tester comes out clean. Let the cake cool in the pan on a wire rack for 10 minutes.",
    "4. Meanwhile, make the syrup. In a small saucepan over medium-low heat, cook the sugar with the orange juice until the sugar dissolves. Remove the cake from the pan, set it on a rack over a tray, and spoon the orange syrup over the cake. Allow the cake to cool completely.",
    "5. For the ganache, melt the chocolate, heavy cream, and coffee in the top of a double boiler over simmering water until smooth and warm, stirring occasionally. Drizzle over the top of the cake."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/this-cake-has-a-hole-in-it1.jpg?w=500",
  "ingredient_list": [
    "1/2 pound (8 ounces or 225 grams) unsalted butter at room temperature",
    "2 cups (400 grams) granulated sugar",
    "4 extra-large eggs at room temperature",
    "1/4 cup grated orange zest (from 4 large oranges)",
    "3 cups (390 grams) all-purpose flour plus 2 tablespoons (15 grams)",
    "1/2 teaspoon baking powder",
    "1/2 teaspoon baking soda",
    "1 teaspoon kosher salt",
    "1/4 cup (60 ml) freshly squeezed orange juice",
    "3/4 cup (175 ml) buttermilk, at room temperature",
    "1 teaspoon (5 ml) vanilla extract",
    "2 cups (12 ounces or 340 grams) semisweet chocolate chunks",
    "Syrup:",
    "1/4 cup (50 grams) granulated sugar",
    "1/4 cup (60 ml) freshly squeezed orange juice",
    "Ganache:",
    "8 ounces (225 grams) semisweet chocolate chips or chopped semisweet chocolate",
    "1/2 cup (120 ml) heavy cream",
    "1 teaspoon instant coffee granules"
  ],
  "tags": [
    "Cake",
    "Chocolate",
    "Citrus",
    "Fruit",
    "Orange",
    "Photo"
  ],
  "title": "orange chocolate chunk cake",
  "url": "https://smittenkitchen.com/2006/09/this-cake-has-a-hole-in-it/"
}