{
  "date": "2007-07-31T00:03:56+00:00",
  "directions": [
    "Peach preserves, heated",
    "Roll out dough on lightly floured sheet of parchment paper to 12-inch round, turning dough occasionally to prevent sticking. Slide rimless baking sheet under parchment. Transfer dough on parchment to refrigerator. Chill until dough firms slightly, about 30 minutes.",
    "Make filling: Stir sugar and cornstarch in medium bowl to blend. Mix in fruit and vanilla. Let stand until juices are released, stirring fruit occasionally, about 30 minutes.",
    "Preheat oven to 375°F. Transfer baking sheet with dough to work surface. Let stand 8 minutes to allow dough to soften slightly if too firm to fold. Spoon fruit and juices into center of dough. ",
    "Arrange fruit in even 9-inch-diameter layer in center. Brush 2-inch border of dough with egg glaze. Lift about 2 inches of dough border and pinch to form vertical seam. Continue around tart, pinching seam every 2 inches to form standing border. Fold border down over fruit (center 6 inches of fruit remain uncovered). Brush folded border with egg glaze; sprinkle with raw sugar.",
    "Place baking sheet with tart in oven. Bake until crust is golden brown and fruit filling is bubbling at edges, about 55 minutes. Remove from oven; slide large metal spatula under tart to loosen from parchment. Brush fruit with preserves. Slide tart onto rack. Cool 45 minutes. Serve warm or at room temperature with ice cream."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/unbendy-brisee1.jpg?w=500",
  "ingredient_list": [
    "2 1/2 cups all-purpose flour",
    "1/4 teaspoon salt",
    "1 tablespoon sugar",
    "1 cup (2 sticks) unsalted butter, chilled and cut into small pieces",
    "1/4 to 1/2 cup ice water",
    "3 cups strawberries, hulled and cut in half or quarters, depending on size",
    "1/4 cup granulated sugar",
    "2 tablespoons cornstarch",
    "All-purpose flour, for work surface",
    "1 recipe pâte brisée (above)",
    "1 large egg, lightly beaten",
    "Sanding or demara sugar, for sprinkling",
    "1/4 cup sugar",
    "1 1/2 teaspoons cornstarch",
    "3 medium nectarines, each pitted and cut into 16 slices",
    "1/2 -pint basket blackberries",
    "1/4 teaspoon vanilla extract (optional, still not sure if I liked it in there)",
    "1 egg, beaten to blend (for glaze)",
    "Raw or coarse sugar crystals"
  ],
  "tags": [
    "Cake",
    "Fruit",
    "Photo",
    "Tarts/Pies"
  ],
  "title": "pate brisee, galette and hand pies",
  "url": "https://smittenkitchen.com/2007/07/unbendy-brisee/"
}