{
  "date": "2014-06-16T12:19:13+00:00",
  "directions": [
    "Heat oven to 350 degrees. Butter a 9-inch round cake pan. Line the bottom of the baking pan with a round of parchment paper.  ",
    "Melt butter in a large saucepan, 3 quarts is a good size. Once melted, remove from heat and stir in chocolate until melted. Once melted, stir in 2 tablespoons water, then baking powder, flour and cocoa until just combined.",
    "In a medium bowl, whisk egg yolks with sugar, 1 tablespoon water and vanilla, if using, until pale and no longer lumpy. Stir into chocolate mixture until just combined.",
    "In a larger, very clean bowl, beat egg whites and salt until stiff. Gently fold into chocolate mixture until most of the white streaks disappear. Be careful not to deflated cake.",
    "Bake for 25 to 30 minutes, until a toothpick inserted into the center of the cake comes out batter-free. Remove from oven and rest on rack for 5 minutes. Run knife along outside cake to make sure it isn’t sticking anywhere, then invert onto another rack, then back onto a cake plate. Eat warm or cold.",
    "Cake keeps for several days at room temperature, lightly wrapped. ",
    "To make a layer cake, as pictured: Several hours and up to a full day before you will fill the cake, make chocolate whipped cream. I used Alice Medrich’s recipe as a base. Heat 1 cup heavy or whipping cream to a simmer in a saucepan. Remove from heat, whisk in 6 ounces chopped semisweet chocolate until fully melted and smooth. Stir in a second cup of cold heavy or whipping cream. Cover dish with plastic and let chill in the fridge for at least four hours and preferably overnight, or up to 24 hours. ",
    "To make the layer cake, make twice the recipe above, but divide it into 3 9-inch cake pans. Each layer will bake for approximately 15 to 20 minutes. Let cool completely. I find popping cake layers into the freezer for 20 to 30 minutes stiffens them enough that they are easily lifted and stacked and highly recommend it.",
    "Using electric beaters, whip fully chilled chocolate cream into whipped cream. It will whip very quickly; don’t let it overwhip (it will become rough-looking). If it does, a splash of still-liquid heavy cream whisked in will loosen the mixture a bit again. Set a spoonful of the chocolate whipped cream aside if you’d like to write on the top of the cake. Spread half of the chocolate whipped cream on the first cake layer, then top with the second. Spread second half of chocolate whipped cream on second cake layer, then top with the third. If writing on the cake, place chocolate whipped cream set aside in a sandwich bag with the corner snipped off, or in a piping bag with a small round tip and scribble away. ",
    "Keep cake in fridge until needed.  "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/valeries-french-chocolate-cake1.jpg?w=640",
  "ingredient_list": [
    "9 tablespoons (125 grams) unsalted butter",
    "7 ounces (200 grams) bittersweet (70/72 percent) chocolate, chopped",
    "3 tablespoons water",
    "3/4 teaspoon baking powder",
    "1/3 cup (40 grams) all-purpose flour",
    "1/3 cup (about 30 grams) dark cocoa powder, sifted if lumpy (Dutched or natural will work here; I use Dutched)",
    "4 large eggs, separated",
    "1 cup (200 grams) granulated sugar",
    "1/2 teaspoon vanilla extract (optional)",
    "Two pinches sea salt"
  ],
  "tags": [
    "Cake",
    "Chocolate",
    "French",
    "Photo"
  ],
  "title": "valerie’s french chocolate cake",
  "url": "https://smittenkitchen.com/2014/06/valeries-french-chocolate-cake/"
}