{
  "date": "2009-06-10T08:43:24+00:00",
  "directions": [
    "Preheat oven to 375°F. Melt butter in a small saucepan, then cool. Cover phyllo stack with 2 overlapping sheets of plastic wrap and then a dampened kitchen towel. [I won’t lie, as I got more confident with the phyllo I sorta skipped this part, opting instead to work quickly. Proceed at your own risk, however!]",
    "Take one phyllo sheet from stack and arrange on a work surface with a long side nearest you (keeping remaining sheets covered) and brush with some butter. Top with another phyllo sheet and brush with more butter. Cut buttered phyllo stack crosswise into 6 (roughly 12- by 2 3/4-inch) strips.",
    "Put a heaping teaspoon of filling near one corner of a strip on end nearest you, then fold corner of phyllo over to enclose filling and form a triangle. Continue folding strip (like a flag), maintaining triangle shape. Put triangle, seam side down, on a large baking sheet and brush top with butter. Make more triangles in same manner, using all of phyllo.",
    "Bake triangles in middle of oven until golden brown, 20 to 25 minutes, then transfer to a rack to cool slightly.",
    "Do ahead: Pastry triangles can be formed, but not baked, three days ahead. Arrange in one layer in heavy-duty sealed plastic bags, then freeze. Bake frozen pastries (do not thaw) in same manner as above."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/spanikopita-triangles.jpg?w=750",
  "ingredient_list": [
    "1 tablespoon unsalted butter",
    "1/2 cup sliced green onions",
    "1 clove garlic, minced",
    "1 pound fresh spinach (coarse stems removed if ‘grown-up’ spinach; baby spinach can be used in full)",
    "3/4 pound feta, crumbled",
    "1 tablespoon lemon juice",
    "Salt and pepper to taste",
    "1/4 ounce dried wild mushrooms, such as chanterelles, porcini or shiitakes",
    "1 cup boiling water",
    "2 tablespoons unsalted butter",
    "3/4 cup sliced green onions",
    "1 garlic clove, minced",
    "1/2 teaspoon chopped fresh rosemary",
    "1/2 teaspoon chopped fresh thyme",
    "1/2 pound assorted fresh wild mushrooms, such as chanterelles, porcini and shiitakes, brushed clean and chopped small",
    "1/2 pound fresh button mushrooms, brushed clean and chopped small",
    "5 ounces blue cheese crumbles",
    "Salt and pepper to taste",
    "3 tablespoons olive oil",
    "1 teaspoon fennel seeds",
    "2 large yellow onions, chopped small",
    "1 teaspoon salt",
    "1/2 teaspoon black pepper",
    "1 heaping tablespoon Dijon mustard",
    "4 ounces goat cheese, at room temperature"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Mushrooms",
    "Photo",
    "Spinach",
    "Vegetarian"
  ],
  "title": "spanakopita triangles + then some",
  "url": "https://smittenkitchen.com/2009/06/spanakopita-triangles-then-some/"
}