{
  "date": "2016-01-14T12:05:43+00:00",
  "directions": [
    "Heat oven to 300 degrees F. Butter a 9-inch round cake pan and line the bottom with a round of parchment paper. ",
    "Stir brown sugar and water together so they form a thick slurry. Pour into prepared cake pan and spread thin. Set aside.",
    "Whip egg whites in a medium bowl with an electric mixer until they hold thick peaks. Set aside.",
    "Place granulated sugar in a large mixing bowl. Finely zest both oranges over it. ",
    "Cut both oranges in half. Cut one of the halves into paper-thin slices and arrange slices over brown sugar base in cake pan. Juice other three halves (I had about 1/3 cup juice) and set juice aside.",
    "Add butter to zest and granulated sugar in large mixing bowl and beat with an electric mixer (you can use same beaters you just did for egg whites) until light and fluffy. Add egg yolks, one at a time, and beat to combine. Add juice and ricotta; mix until smooth. Sprinkle salt over batter, then add almond flour and cornmeal and mix until just combined. Gently fold in egg whites. ",
    "Scoop batter in large dollops over prepared cake pan base. Gently spread batter flat, trying not to disturb orange slices underneath. Bake in heated oven for 35 to 40 minutes [updated to warn that this took longer for many people, but remains accurate for my oven– better to check early than late], or until a toothpick inserted into the center comes out clean and then (my preference) for 5 more minutes. The final cake is so moist, almost damp, I found the extra baking time beneficial. ",
    "Cool cake in pan on rack for 5 minutes, and then run a knife around the side and invert onto a cake plate. If any orange slices don’t come out easily, just gently arrange them on the top of the cake. If desired, heat jam until loose and brush over cake top for a glossier finish. Let cool and cut into slices. This would be delicious served with an extra dollop of ricotta, creme fraiche or barely sweetened whipped cream. The cake keeps at room temperature, but we prefer it from the fridge."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/blood-orange-almond-and-ricotta-cake1.jpg?w=640",
  "ingredient_list": [
    "1/2 cup brown sugar",
    "1 tablespoon water",
    "3 large eggs, separated",
    "2/3 cup (135 grams) granulated sugar",
    "2 blood oranges, or another orange of your choice",
    "1/2 cup (4 ounces or 115 grams) unsalted butter, softened",
    "2/3 cup (165 grams) ricotta",
    "1/3 cup (45 grams) cornmeal",
    "1 cup (135 grams) firm-packed almond flour or meal",
    "1/2 teaspoon fine sea salt",
    "1/4 cup apple, quince or apricot jam (optional, for glossy finish)"
  ],
  "tags": [
    "Cake",
    "Citrus",
    "Everyday Cakes",
    "Gluten-Free",
    "Italian",
    "Orange",
    "Passover",
    "Photo",
    "Winter"
  ],
  "title": "blood orange, almond and ricotta cake",
  "url": "https://smittenkitchen.com/2016/01/blood-orange-almond-and-ricotta-cake/"
}