{
  "date": "2007-12-11T18:18:39+00:00",
  "directions": [
    "1. For the stew: Pat the chicken dry with paper towels, then season with salt and pepper. Heat 2 teaspoons of the oil in a large Dutch oven over medium-high heat until just smoking. Add half of the chicken and cook until golden on both sides, about 10 minutes. Transfer the chicken to a plate and remove the browned skin. Pour off the chicken fat and reserve. Return the pot to medium-high heat and repeat with the remaining 2 teaspoons oil and the remaining chicken. Pour off and reserve any chicken fat.",
    "2. Add the butter to the Dutch oven and melt over medium-high heat. Add the leeks, onion, and 1/4 teaspoon salt and cook until softened, about 7 minutes. Stir in the flour. Whisk in the sherry, scraping up any browned bits. Stir in the broth, milk, thyme, and bay leaves. Nestle the chicken, with any accumulated juices, into the pot. Cover and simmer until the chicken is fully cooked and tender, about 1 hour.",
    "3. Transfer the chicken to a cutting board. Discard the bay leaves. Allow the sauce to settle for a few minutes, then skim the fat from the surface using a wide spoon. Shred the chicken, discarding the bones, then return it to the stew.",
    "4. For the dumplings: Stir the flour, baking powder, and salt together. Microwave the milk and fat in a microwave-safe bowl on high until just warm (do not over-heat), about 1 minute. Stir the warmed milk mixture into the flour mixture with a wooden spoon until incorporated and smooth.",
    "5. Return the stew to a simmer, stir in the peas and tarragon, and season with salt and pepper. Following the steps below, drop golf-ball-sized dumplings over the top of the stew, about 1/4 inch apart (you should have about 18 dumplings). Reduce the heat to low, cover, and cook until the dumplings have doubled in size, 15 to 18 minutes. Serve.",
    "To make the dumplings:  Gather a golf-ball-sized portion of the dumpling batter onto a soup spoon, then push the dumpling onto the stew using a second spoon.\t Cover the stew with the dumplings, leaving about 1/4 inch between each. When fully cooked, the dumplings will have doubled in size.\t"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/12/chicken-and-dumplings.jpg?w=750",
  "ingredient_list": [
    "Stew",
    "5 pounds bone-in, skin-on chicken thighs",
    "Table salt and ground black pepper",
    "4 teaspoons vegetable oil",
    "4 tablespoons unsalted butter (1/2 stick)",
    "2 medium leeks , white and llight green parts only, cut in half lengthwise and then into 1-inch pieces",
    "1 large onion, minced",
    "6 tablespoons unbleached all-purpose flour",
    "1/4 cup dry sherry",
    "4 1/2 cups low-sodium chicken broth",
    "1/4\tcup whole milk",
    "1 teaspoon minced fresh thyme leaves",
    "2 bay leaves",
    "1 cup frozen green peas",
    "3 tablespoons minced fresh tarragon leaves  ",
    "Dumplings",
    "2 cups unbleached all-purpose flour",
    "1 tablespoon baking powder",
    "1 teaspoon table salt",
    "1 cup whole milk",
    "3 tablespoons reserved chicken fat (or unsalted butter) "
  ],
  "tags": [
    "Chicken",
    "Photo"
  ],
  "title": "chicken and dumplings",
  "url": "https://smittenkitchen.com/2007/12/chicken-and-dumplings/"
}