{
  "date": "2007-06-15T11:08:39+00:00",
  "directions": [
    "Heat a dry cast iron skillet (or ungreased skillet) over medium-low heat until a drop of water sizzles on contact. Place the tomato and jalapeno in the pan and cook turning frequently, until the skins are blistered all over, about 15 minutes. Remove the tomato into a mixing bowl to catch the juices. Place the chile in a paper bag and let rest for 10 minutes. ",
    "Meanwhile, prepare the fava beans. Remove them from their large outer pods, and blanche them in boiling salted water for one to two minutes. Drop them in an ice bath, then remove their light-colored skins, revealing the edible fava bean within. Set aside. ",
    "When the chile is cool enough to handle, peel of the charred skin and halve it, reserving the other half for another use. Place the tomato, onion, garlic, cilantro, and half chile in a blender, or food processor, and process until smooth, about 1 minute, set aside. ",
    "Pour the oil into a dutch oven or medium saucepan over medium-high heat until it ripples, add the pasta and cook, stirring constantly, until golden. Remove all but 2 tablespoons of oil, add the pureed tomato and chile mixture, and cook for 2 minutes, stirring continually. Add the chicken stock and bring to a simmer. Cover and cook for 10 to 12 minutes, ensuring there is a bit of liquid left in the pot. Add the prepared favas, olives and red peppers, stirring them in and replace the lid for another few minutes cooking time, or until the liquid is absorbed. Serve with shredded cheese, giving it a good stir to make sure it has melted and merged with the ingredients.",
    "* Could someone explain to me how I can add a whole jalapeno to a salad or pico de gallo, and the bite is mild at best, but somehow this whole one that’s cooked for a significant amount of time (isn’t that supposed to dull it’s knife-like effect?), it’s fiercely inedible? Because I’d sure like to figure this one out."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/fiddle-me-this1.jpg?w=500",
  "ingredient_list": [
    "1 large tomato",
    "1 large jalapeno",
    "1 small onion, coarsely chopped",
    "1 clove garlic",
    "6 sprigs cilantro",
    "Large handful of fresh beans, in their pods",
    "1/4 cup canola oil",
    "7 ounces short angel hair noodles, or longer strands broken into one to two-inch pieces",
    "2 cups chicken stock",
    "2 red bell peppers, cut into matchsticks",
    "1/2 to 2/3 cup pitted black olives, coarsely chopped",
    "Cotija or queso blanco, shredded"
  ],
  "tags": [
    "Beans",
    "Pasta",
    "Peppers",
    "Photo",
    "Spanish"
  ],
  "title": "fideos with favas and red peppers",
  "url": "https://smittenkitchen.com/2007/06/fiddle-me-this/"
}