{
  "date": "2014-10-20T12:27:06+00:00",
  "directions": [
    "Roast your red pepper: You can do so in a 350°F oven, turning it every 15 minutes for a total of 45 to 60, until it’s deeply roasted on all sides. Some people prefer to do this over a gas flame, but be sure you cook it long enough that’s it truly soft inside, so it will blend well. Set aside to cool — you can do this in a bowl with foil or plastic over it, but I find it’s just as easy to peel a well-roasted pepper even if it’s cooled right on the tray, without the added steam. Once cool enough to handle, peel and seed the pepper.",
    "Meanwhile, place dried chiles and sundried tomato in a bowl and cover with boiling water. Let sit for 30 minutes, until well-softened. Drain and with gloved hands, if you don’t like living on the edge, remove the seeds and stems from the chiles. The sundried tomatoes can be used as-is.",
    "Place roasted red pepper, rehydrated chiles, tomatoes, garlic, salt and spices in a blender or food processor with 1 tablespoon olive oil and blend until it becomes a thick paste; a little water may be necessary to help this along. Store in the fridge, topped with a thin layer of olive oil. Use on everything."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/homemade-harissa1.jpg?w=640",
  "ingredient_list": [
    "1 large red bell pepper",
    "4 ounces dried chiles (see suggestions above)",
    "3 sun-dried tomatoes, dry-packed",
    "2 clove garlic, peeled",
    "1 teaspoon coarse or kosher salt",
    "3/4 teaspoon ground coriander (1 1/2 teaspoons seeds, toasted and ground)",
    "1/2 teaspoon ground caraway (or 1 teaspoon seeds, toasted and ground)",
    "1/2 teaspoon ground cumin (or 1 teaspoon seeds, toasted and ground)",
    "1 tablespoon olive oil, plus extra for storage"
  ],
  "tags": [
    "North African",
    "Peppers",
    "Photo",
    "Savory Sauces and Condiments",
    "Vegan",
    "Vegetarian"
  ],
  "title": "homemade harissa",
  "url": "https://smittenkitchen.com/2014/10/homemade-harissa/"
}