[
    {
        "ingredient_list": [
            "2 tablespoons olive oil", 
            "3 1/4 cup sliced onions", 
            "3 large cloves garlic, crushed", 
            "1/4 cup dry white wine", 
            "12 large red bell peppers, cut into 1-inch pieces", 
            "2 cups chicken or vegetable stock or broth", 
            "2 tablespoons chopped fresh thyme", 
            "1/4 to 1/2 teaspoon hot red pepper flakes", 
            "Salt and white or black pepper", 
            "Crème fraîche for garnish", 
            "Thyme sprigs for garnish. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/at-last-this-soup1.jpg?w=500", 
        "tags": [
            "Peppers", 
            "Photo", 
            "Soup", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/07/at-last-this-soup/", 
        "title": "red pepper soup", 
        "directions": [
            "Put oil in large pot. Add onion when oil is hot. Cook onions until they begin to soften and take on color. Add garlic and cook another minute. Add wine and cook down quickly and on high heat, until only one tablespoon is left. Add peppers, stock, thyme and red pepper flakes. Season to taste with salt and pepper. Cover and simmer until peppers are tender, about 30 minutes. In food processor or with an immersion blender, puree mixture in until smooth (if a food processor, in batches). Adjust seasonings to taste.", 
            "Soup can be served warm or chilled. Serve in demitasse cups or soup bowls, topped with a dab of crème fraîche and a tiny sprig of thyme.", 
            "Do ahead: Cover and chill overnight or for as long as 2 days or freeze (whisk well before serving if thawed). "
        ], 
        "date": "2007-07-19T00:07:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            "2 medium-size red onions, chopped", 
            "1 medium-size red bell pepper, chopped", 
            "1 medium-size green bell pepper, chopped", 
            "4 garlic cloves, minced", 
            "4 teaspoons ground cumin", 
            "1 16-ounce package dried black beans", 
            "1 tablespoon chopped chipotle chiles from a can (this gives it a solid kick, dial back if you are wary)", 
            "7 cups water", 
            "2 tablespoons fresh lime juice", 
            "2 teaspoons coarse kosher salt", 
            "1/4 teaspoon ground black pepper", 
            "1 tablespoon whole cumin seeds", 
            null, 
            "Salt and freshly ground pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/black-bean-soup1.jpg?w=750", 
        "tags": [
            "Beans", 
            "Budget", 
            "Gluten-Free", 
            "Peppers", 
            "Photo", 
            "Slow Cooker", 
            "Soup", 
            "Tex-Mex", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/01/black-bean-soup-toasted-cumin-seed-crema/", 
        "title": "black bean soup + toasted cumin seed crema", 
        "directions": [
            "Make the soup on the stove: Heat olive oil in the bottom of a 5-quart or larger Dutch oven or stock pot over medium-high heat. Add onions and both bell peppers and sauté until beginning to brown, about eight minutes. Add garlic and cumin; stir one minute. Add beans and chipotles, then 7 cups water. Bring to a full boil, boil for 1 minute, then reduce heat to a gentle simmer, partially cover pot, and cook until beans have softened, about 2 to 3 hours. (These times can vary a lot depending on the age of the beans and kind of water.)\nMake the soup in a slow-cooker: Heat olive oil in large skillet over medium-high heat. Add onions and both bell peppers and sauté until beginning to brown, about eight minutes. Add garlic and cumin; stir one minute. Transfer mixture to 6-quart slow cooker. Add beans and chipotles, then 7 cups hot water. Cover and cook on high until beans are very tender, about 6 hours. [But see note up top because mine finish sooner, although most others have not.]\nMake the soup in an InstantPot or electric pressure cooker: Heat olive oil in the bottom of your pressure cooker on the sauté function. Add onions and both bell peppers and sauté until beginning to brown, about eight minutes. Add garlic and cumin; stir one minute. Add beans and chipotles, then 7 cups hot water. Cover, locking lid and closing steam valve. Cook at high pressure on the manual setting for 30 minutes. If you have time, let the pressure release naturally. I didn’t have a lot of time, and let it release naturally for 10 to 15 minutes, then manually the rest of the way.\nWhile it cooks, make the topping: Place the cumin in a small sauté pan over medium heat. Toast until lightly golden brown. Place in spice grinder or mortar and pestle and grind until coarse. Stir it into the cream and season with salt and pepper, to taste.\nAll cooking methods: Transfer two cups bean mixture to blender; puree until smooth, then return the puree to remaining soup in slow cooker. Or, you can use an immersion blender to partially blend the soup right where you’ve cooked it. Stir in lime juice, salt, and pepper. Adjust seasonings to taste; we found we needed more salt. Ladle soup into bowls. Spoon dollop of toasted cumin seed cream (below) over each bowl and serve.", 
            "Do ahead: This soup keeps great in the fridge, and even thickens a bit. In a good way!\n"
        ], 
        "date": "2010-01-12T14:00:01+00:00"
    }, 
    {
        "ingredient_list": [
            "2 small or 1 large fresh poblano chiles", 
            "1 small head cauliflower, cored and cut into rough 1-inch chunks", 
            "Salt and freshly ground black pepper to taste", 
            "3 tablespoons olive oil, plus more for cooking quesadillas", 
            "3 scallions, thinly sliced", 
            "1 tablespoon lime juice", 
            "2 cups (about 8 ounces) coarsely grated monterey jack cheese", 
            "12 small (7-inch) flour tortillas", 
            "1/2 cup sour cream or Mexican crema", 
            "A few gratings fresh lime zest", 
            "1 tablespoon freshly squeezed lime juice", 
            "1/2 teaspoon ground cumin", 
            "Pinch of salt", 
            "1 bag coleslaw mix or (as used here) 3 cups finely shredded red cabbage and 1 coarsely grated carrot", 
            "Coarse salt", 
            "Juice of half a lime", 
            "2 scallions, sliced thin", 
            "A dollop of mayonnaise, sour cream or plain yogurt", 
            "A dash of hot sauce (optional)", 
            "1/4 cup roughly chopped cilantro or flat-leaf parsley leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/charred-cauliflower-quesadillas1.jpg?w=751", 
        "tags": [
            "Cauliflower", 
            "Peppers", 
            "Photo", 
            "Sandwich", 
            "Tex-Mex", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/02/charred-cauliflower-quesadillas/", 
        "title": "charred cauliflower quesadillas", 
        "directions": [
            "Toss cabbage mix, salt and lime together in a large bowl; set aside for 5 minutes. It will shrink down a bit. Stir in scallions, then mayo and hot sauce. Adjust seasonings/ingredients to taste, then stir in cilantro leaves. Serve alongside quesadillas or any of your favorite tortilla-clad meals. "
        ], 
        "date": "2015-02-02T11:54:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 red bell pepper, small was suggested, I used a large and didn’t regret it", 
            "2/3 cup canned or fresh tomato purée", 
            "1/4 cup orange juice", 
            "2 tablespoons Worcestershire sauce", 
            "2 tablespoons olive oil", 
            "1 tablespoon balsamic vinegar", 
            "1 tablespoon molasses", 
            "3/4 teaspoon table salt or more to taste", 
            "1 teaspoon ground mustard", 
            "1/2 teaspoon ground ginger", 
            "1/4 teaspoon freshly ground black pepper", 
            "1/4 teaspoon onion powder", 
            "1/8 teaspoon ground allspice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/charred-pepper-steak-sauce1.jpg?w=500", 
        "tags": [
            "Meat", 
            "Peppers", 
            "Photo", 
            "Quick", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/08/charred-pepper-steak-sauce/", 
        "title": "charred pepper steak sauce", 
        "directions": [
            "Preheat your broiler. Place your pepper on a baking sheet and cook it under the broiler until all sides are charred, turning with with tongs as needed. Don’t skimp on the charring as this skin will add a fantastic flavor dimension. Mine took about 15 minutes, but I have a terrible broiler. Yours might only take 5 to 8 minutes. Transfer pepper to a mesh sieve set over a blender jar or food processor work bowl to cool until you’re able to handle it, about 15 minutes.", 
            "Tear open the pepper and remove the seeds and membranes with your fingers or a paring knife. Add the pepper (with its skin) to the blender along with the remaining ingredients. Puree mixture until as smooth as possible. Transfer mixture to a small saucepan. Simmer it gently over low heat for 15 minutes, stirring from time to time. It will yield a fairly smooth that can be used as is, but if you’d like a smoother consistency, you have two options: running it back through the blender or food processor again (I got a smoother blender after the fibers had cooked down more on the stove) or pressing it through that fine-mesh sieve (I started doing this, then decided it wasn’t worth the trouble). ", 
            "Store in an airtight jar in the fridge for one week, though I suspect it will keep for two."
        ], 
        "date": "2012-08-07T16:43:21+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large red peppers, roasted and skinned (great directions over here, if you’re new to this)", 
            "3 cups of cooked chickpeas, rinsed if canned (about 2 15-ounce cans)", 
            "1/4 cup of parsley, chopped", 
            "2 tablespoons of chopped mint", 
            "3 tablespoons of capers, rinsed", 
            "2 tablespoons of fresh lemon juice or red wine or sherry vinegar", 
            "1/4  teaspoon of salt", 
            "2 cloves of garlic, minced", 
            "4 tablespoons of extra virgin olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chickpea-salad-with-roasted-red-peppers1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/11/chickpea-salad-with-roasted-red-peppers/", 
        "title": "chickpea salad with roasted red peppers", 
        "directions": [
            "Cut the peppers into half-inch wide strips and put them in a large bowl together with the chickpeas, herbs and the capers. In a smaller bowl, whisk together the lemon juice, salt, garlic and oil. Pour over the chickpea mixture and combine.Serve immediately, or refrigerate it for a day to get the flavors to mingle fantastically.", 
            "This is a great make-ahead dish for weekday lunches. It would also be wonderful on a pile of torn lettuce, served with toasted pita wedges."
        ], 
        "date": "2008-11-14T23:57:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound Campari or plum tomatoes, diced, drained", 
            "1 1/2 cups diced seeded watermelon", 
            "1 large green bell pepper, seeded, cut into 1/3-inch cubes", 
            "1/2 large English hothouse cucumber, seeded, cut into 1/3-inch cubes", 
            "1/2 cup very thinly sliced radishes", 
            "3 tablespoons olive oil, divided", 
            "10 ounces feta cheese, cut into small cubes (about 2 1/2 cups),", 
            "2 divided green onions, chopped, divided", 
            "1/4 cup thinly sliced fresh mint leaves, divided", 
            "1/2 cup plain Greek-style yogurt", 
            "1 teaspoon dried oregano"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2653761539_5d0fcda7de_b.jpg?w=750", 
        "tags": [
            "Fruit", 
            "Peppers", 
            "Photo", 
            "Radishes", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2008/07/chopped-vegetable-watermelon-and-feta-salad/", 
        "title": "chopped vegetable, watermelon and feta salad", 
        "directions": [
            "Toss first five ingredients and two tablespoons oil in large bowl. Add half each of cheese, green onions, and mint. Mix remaining cheese, green onions, mint, and oil in processor; add yogurt and oregano. Process just to blend (do not over-mix or dressing will get thin). Season dressing with salt and pepper; mix into salad."
        ], 
        "date": "2008-07-10T12:36:51+00:00"
    }, 
    {
        "ingredient_list": [
            "2 ears corn, husked", 
            "1 15-ounce can black beans, drained and rinsed", 
            "1 large poblano", 
            "Nonstick spray or 2 teaspoons oil", 
            "2 generous cups (about 8 ounces) coarsely grated monterey jack cheese", 
            "2 generous cups (about 8 ounces) coarsely grated cheddar cheese", 
            "1 12-ounce bag tortilla chips, the thicker the better", 
            "Thinly sliced jalapeno (1 used 1/2 a big one)", 
            "Thinly sliced radishes (I used 2 medium)", 
            "1/2 a white onion, minced (you can toss it with a little lime juice and salt to lightly pickle it, if desired)", 
            "Handful fresh cilantro, roughly chopped", 
            "Diced tomatoes", 
            "Shredded lettuce", 
            "Sliced avocado", 
            "Lime wedges", 
            "Hot sauce"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/06/corn-and-black-bean-weeknight-nachos1.jpg?w=750", 
        "tags": [
            "Corn", 
            "Peppers", 
            "Photo", 
            "Summer", 
            "Tex-Mex", 
            "Travel", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/06/corn-and-black-bean-weeknight-nachos/", 
        "title": "corn and black bean weeknight nachos", 
        "directions": [
            "\nOver a gas flame or on a grill over high heat, char corn all over until at least half the kernels are blistered, and poblano until skin is blackened. Let both cool slightly then cut the corn kernels from the cob. Remove the skin and seeds from the poblano and cut it into very thin ribbons. (For a large one, you might only use half.)\nHeat oven to 400 degrees. Coat your largest baking sheet with foil (which I did not, and wish I had) and lightly coat it with oil. Arrange 1/3 of chips on tray and sprinkle 1/3 of corn, black beans, poblano strips and cheese over it. Repeat twice. Bake for 15 to 20 minutes, until the cheese has melted and blistered all over. Use this time to prep your toppings.\nWhen nachos are cooked, you can sprinkle a few toppings over (I used the jalapeños, radishes, tomatoes, onion, cilantro and avocado) or just bring everything to the table and let everyone fix their own.\n"
        ], 
        "date": "2016-06-17T10:29:35+00:00"
    }, 
    {
        "ingredient_list": [
            "4 thick slices of bacon (4 ounces), cut crosswise 1/2 inch thick", 
            "1 pound Yukon gold potatoes, peeled and cut into 1/2-inch dice", 
            "2 red bell peppers, cut into 1/2-inch dice, although I made mine smaller", 
            "6 large or 8 medium ears of corn, kernels removed (I used 8 large and it was a massive salad)", 
            "1 medium red onion, thinly sliced", 
            "1/4 cup cider vinegar", 
            "Salt and crushed red pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/08/corn-chowder-salad1.jpg?w=640", 
        "tags": [
            "Corn", 
            "Peppers", 
            "Photo", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/08/corn-chowder-salad/", 
        "title": "corn chowder salad", 
        "directions": [
            "Cook bacon: In a large frying pan, cook the bacon over moderately low heat, stirring a few times, until it is crisp, about 5 to 10 minutes. Using a slotted spoon, transfer the bacon to paper towels and let drain.", 
            "Fry potatoes, peppers and corn: Pour off all but 3 tablespoons of the bacon fat in the skillet. Add the potatoes and cook over moderately high heat until they start to brown, about about 3 to 6 minutes. Stir and cook for about 2 minutes longer, until almost tender; they’ll finish cooking with the other vegetables. Add the diced red peppers and cook, stirring occasionally, until the potatoes and peppers are tender, about 5 minutes. Add the corn kernels and cook, stirring, until heated through but still crisp, about 3 minutes.", 
            "Assemble and serve: Transfer the vegetables to a large bowl and stir in the onion, cider vinegar and bacon. Season with red pepper and salt to taste. Serve warm, or at room temperature."
        ], 
        "date": "2015-08-31T11:23:49+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/couscous-and-feta-stuffed-peppers1.jpg?w=500", 
        "tags": [
            "Peppers", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/09/couscous-and-feta-stuffed-peppers/", 
        "title": "couscous and feta-stuffed peppers", 
        "directions": [
            "Preheat oven to 350°F. Coat a small baking dish with cooking spray. Bring the broth to a boil in a saucepan, add the couscous, cover the pan and remove it from the heat. Cut the stems and top half inch off the bell peppers and scoop out the seeds and membranes. Place peppers upright in a baking dish and roast them for 15 minutes or so, until they soften, then remove them from the oven until the filling is ready. Heat oil in a nonstick skillet. Add onion, zucchini, yellow squash, fennel seeds, oregano, and salt. Cook, stirring frequently, for 5 minutes or until vegetables are softened. Remove from heat and stir in the tomatoes, chickpeas and tomato paste. Using a fork, scrape the couscous into the skillet and toss with the vegetables. Stir in the crumbled feta. Fill peppers with the couscous mixture. Bake 15 minutes. Serve immediately."
        ], 
        "date": "2007-09-26T09:37:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large tomato", 
            "1 large jalapeno", 
            "1 small onion, coarsely chopped", 
            "1 clove garlic", 
            "6 sprigs cilantro", 
            "Large handful of fresh beans, in their pods", 
            "1/4 cup canola oil", 
            "7 ounces short angel hair noodles, or longer strands broken into one to two-inch pieces", 
            "2 cups chicken stock", 
            "2 red bell peppers, cut into matchsticks", 
            "1/2 to 2/3 cup pitted black olives, coarsely chopped", 
            "Cotija or queso blanco, shredded"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/fiddle-me-this1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Pasta", 
            "Peppers", 
            "Photo", 
            "Spanish"
        ], 
        "url": "https://smittenkitchen.com/2007/06/fiddle-me-this/", 
        "title": "fideos with favas and red peppers", 
        "directions": [
            "Heat a dry cast iron skillet (or ungreased skillet) over medium-low heat until a drop of water sizzles on contact. Place the tomato and jalapeno in the pan and cook turning frequently, until the skins are blistered all over, about 15 minutes. Remove the tomato into a mixing bowl to catch the juices. Place the chile in a paper bag and let rest for 10 minutes. ", 
            "Meanwhile, prepare the fava beans. Remove them from their large outer pods, and blanche them in boiling salted water for one to two minutes. Drop them in an ice bath, then remove their light-colored skins, revealing the edible fava bean within. Set aside. ", 
            "When the chile is cool enough to handle, peel of the charred skin and halve it, reserving the other half for another use. Place the tomato, onion, garlic, cilantro, and half chile in a blender, or food processor, and process until smooth, about 1 minute, set aside. ", 
            "Pour the oil into a dutch oven or medium saucepan over medium-high heat until it ripples, add the pasta and cook, stirring constantly, until golden. Remove all but 2 tablespoons of oil, add the pureed tomato and chile mixture, and cook for 2 minutes, stirring continually. Add the chicken stock and bring to a simmer. Cover and cook for 10 to 12 minutes, ensuring there is a bit of liquid left in the pot. Add the prepared favas, olives and red peppers, stirring them in and replace the lid for another few minutes cooking time, or until the liquid is absorbed. Serve with shredded cheese, giving it a good stir to make sure it has melted and merged with the ingredients.", 
            "* Could someone explain to me how I can add a whole jalapeno to a salad or pico de gallo, and the bite is mild at best, but somehow this whole one that’s cooked for a significant amount of time (isn’t that supposed to dull it’s knife-like effect?), it’s fiercely inedible? Because I’d sure like to figure this one out."
        ], 
        "date": "2007-06-15T11:08:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 a large, seedless English cucumber (about 6 to 7 ounces), chopped", 
            "1/2 a green bell pepper, chopped", 
            "1 cup (about 6 ounces) cherry or grape tomatoes, halved", 
            "1/4 cup kalamata olives (you can also serve these alongside)", 
            "1/4 small red onion, thinly sliced", 
            "1 lemon, halved", 
            "2 to 3 ounces feta (Bulgarian or French, if you can find them, are my favorites), in thick slices", 
            "2 tablespoons olive oil, or more to taste", 
            "Salt and freshly ground black pepper", 
            "1 sprig oregano, leaves minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/greek-salad-with-lemon-and-oregano.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Greek", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/05/greek-salad-with-lemon-and-oregano/", 
        "title": "greek salad with lemon and oregano", 
        "directions": [
            "Toss cucumbers, pepper, tomatoes, olives (if using) and onion in a shallow bowl or deep plate. Squeeze half a lemon over it. Arrange feta slices on top. Drizzle with olive oil, sprinkle with salt, pepper and oregano. Serve with a slice of feta on top of each serving, and the second half of the lemon for those that like their salads punchier.", 
            "* If you’re concerned about the pungency of the raw onion, you can squeeze the lemon juice on top of it and let it sit for a while in a dish before adding both to the salad. It will mellow and soften it.   "
        ], 
        "date": "2013-05-21T13:27:21+00:00"
    }, 
    {
        "ingredient_list": [
            "4 1-inch slices bread, country-style", 
            "3 large red bell peppers, halved, seeds removed", 
            "1 medium red onion, peeled and cut into 1/2-inch wedges", 
            "3 tablespoons olive oil", 
            "Kosher salt and freshly ground black pepper", 
            "2 tablespoons sherry vinegar", 
            "1 garlic clove, minced", 
            "1/2 teaspoon sugar", 
            "1 tablespoon olive oil", 
            "1 tablespoons capers, drained (rinsed if salted)", 
            "4 ounces mozzarella, torn into bite-sized pieces, or 4 ounces bocconcini", 
            "Fresh herbs — snipped chives, basil, or parsley or a mix thereof — to finish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/grilled-pepper-and-torn-mozzarella-panzanella.jpg?w=750", 
        "tags": [
            "Grilling", 
            "Peppers", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/06/grilled-pepper-and-torn-mozzarella-panzanella/", 
        "title": "grilled pepper and torn mozzarella panzanella", 
        "directions": [
            "Prepare vegetables: Place bread, pepper halves, and onion wedges in a large bowl and drizzle with 3 tablespoons olive oil, then sprinkle 1 teaspoon kosher salt and many grinds (or about 1/4 teaspoon) black pepper. Use your hands to toss everything together until oil coats everything.\nTo grill: Heat your grill to medium-high, or if yours is small and dinky like mine, high heat. Spread peppers and onions across grill grates and grill, lid down, flipping as needed, until onions are charred in spots (they’ll be done first) and peppers are blistered and blackened in many spots and beginning to soften. Transfer onions to a plate as they’re done; transfer peppers to a bowl. Use bread in bowl to swipe up any excess salt, pepper, and/or oil in it and place slices on grill. Grill until toasted on both sides. Transfer to plate with onions.\nNo grill? You can do all of the above under your broiler, or in your oven at 450 degrees F. Broilers vary wildly in how robust their heat is, so keep an eye on it. Vegetables tend to take longer in the oven, up to 40 minutes, but check in at 20 to be safe. In both cases, turn vegetables and bread as needed to get an even color.\nMarinate peppers: Place foil or a lid over peppers in bowl to trap heat. Once they’re cool enough to handle, remove as much of the skin as you can. This is unquestionably the most annoying part so do only as much as would bother you to have to eat. (For me, this is almost every speck but you’re probably less crazy.) Cut peppers into 1/2- to 1-inch wide strips.\nIn the bottom of a large bowl, whisk together sherry vinegar, remaining 1 tablespoon olive oil, sugar, about 1/4 teaspoon kosher salt (and more to taste), and garlic. Add capers. Add peppers to bowl and let them marinate for as little as 5 minutes or up to a day, even. The longer they souse, the more pickled they’ll taste. After 5 minutes, however, they still have plenty of flavor.\nTo assemble and serve: Shortly before you’re ready to eat the salad, add onions to the bowl with the peppers. Tear bread into chunks and add to bowl, along with mozzarella. Mix gently, making sure the dressing coats the bread. Taste and add more seasoning if needed. Finish with herbs and serve in big heaps."
        ], 
        "date": "2017-06-01T11:59:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large red bell pepper", 
            "4 ounces dried chiles (see suggestions above)", 
            "3 sun-dried tomatoes, dry-packed", 
            "2 clove garlic, peeled", 
            "1 teaspoon coarse or kosher salt", 
            "3/4 teaspoon ground coriander (1 1/2 teaspoons seeds, toasted and ground)", 
            "1/2 teaspoon ground caraway (or 1 teaspoon seeds, toasted and ground)", 
            "1/2 teaspoon ground cumin (or 1 teaspoon seeds, toasted and ground)", 
            "1 tablespoon olive oil, plus extra for storage"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/homemade-harissa1.jpg?w=640", 
        "tags": [
            "North African", 
            "Peppers", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/10/homemade-harissa/", 
        "title": "homemade harissa", 
        "directions": [
            "Roast your red pepper: You can do so in a 350°F oven, turning it every 15 minutes for a total of 45 to 60, until it’s deeply roasted on all sides. Some people prefer to do this over a gas flame, but be sure you cook it long enough that’s it truly soft inside, so it will blend well. Set aside to cool — you can do this in a bowl with foil or plastic over it, but I find it’s just as easy to peel a well-roasted pepper even if it’s cooled right on the tray, without the added steam. Once cool enough to handle, peel and seed the pepper.", 
            "Meanwhile, place dried chiles and sundried tomato in a bowl and cover with boiling water. Let sit for 30 minutes, until well-softened. Drain and with gloved hands, if you don’t like living on the edge, remove the seeds and stems from the chiles. The sundried tomatoes can be used as-is.", 
            "Place roasted red pepper, rehydrated chiles, tomatoes, garlic, salt and spices in a blender or food processor with 1 tablespoon olive oil and blend until it becomes a thick paste; a little water may be necessary to help this along. Store in the fridge, topped with a thin layer of olive oil. Use on everything."
        ], 
        "date": "2014-10-20T12:27:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups all-purpose flour", 
            "1 tablespoon baking powder", 
            "1 teaspoon salt", 
            "8 tablespoons (1 stick or 4 ounces) cold butter, diced", 
            "1/2 cup heavy cream", 
            "3 eggs, divided", 
            "1/4 pound sharp Cheddar cheese, diced", 
            "2 small jalapeños pepper, minced (I wimped out and used only one only to find my scones entirely heat-free)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/jalapeno-cheddar-scones.jpg?w=753", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Cheese", 
            "Peppers", 
            "Photo", 
            "Scones/Biscuits"
        ], 
        "url": "https://smittenkitchen.com/2009/10/jalapeo-cheddar-scones/", 
        "title": "jalapeño-cheddar scones", 
        "directions": [
            "Preheat oven to 400°F. In a small skillet, melt 1/2 tablespoon of butter and sauté the jalapeños in it until soft, about two minutes. Let them cool, then place them in a small bowl with the cheddar cheese and coat them with one tablespoon of the flour. Combine the remaining flour with the baking powder and salt. Cut in the remaining butter with a pastry blender, fork or two knives, until the butter bits are pea sized.", 
            "Lightly whip two of the eggs and cream and add to the flour-butter mixture. Using a wooden spoon, fold mixture until it begins to come together. Add the cheddar-jalapeño mixture to the dough and mix until everything is incorporated.", 
            "Turn out the dough onto a well-floured surface and knead gently for less than one minute. Pat dough out to a 3/4- to 1-inch thickness and either cut into 8 triangles or the shape of your choice with a biscuit cutter. Make an egg wash by beating the remaining egg with a teaspoon of water. Brush the scones with egg wash and place on a parchment-lined (or well-oiled) baking sheet. Bake for 25 minutes or until golden brown.", 
            "Scones are always best the first day.", 
            "Want to flash-freeze yours, as I did? Brief directions, here."
        ], 
        "date": "2009-10-15T13:41:15+00:00"
    }, 
    {
        "ingredient_list": [
            "2 mangoes, peeled, pitted and julienned", 
            "1 to 1 1/4 pounds Napa cabbage, halved and sliced very thinly", 
            "1 red pepper, julienned", 
            "1/2 red onion, thinly sliced", 
            "6 tablespoons of fresh lime juice, from about two limes", 
            "1/4 cup rice vinegar", 
            "2 tablespoons oil of your choice", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon red pepper flakes, or to taste (or omit this and whisk in a chile paste to taste)", 
            "1/4 cup thinly sliced fresh mint leaves", 
            "1/4 cup toasted cashews, coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/07/mango-slaw-with-cashews-and-mint.jpg?w=750", 
        "tags": [
            "Cabbage", 
            "Mango", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2010/07/mango-slaw-with-cashews-and-mint/", 
        "title": "mango slaw with cashews and mint", 
        "directions": [
            "Toss mangoes, cabbage, pepper and onion in a large bowl. Whisk lime juice, vinegar, oil, salt and red pepper in a smaller bowl and pour over slaw. You can either serve this immediately or leave the flavors to muddle for an hour in the fridge. Before serving, toss with mint leaves and sprinkle with cashews.", 
            "About your mango: This salad will work with almost any variety or ripeness of mango, whether sour or sweet. Use the one you can get, or that you enjoy the most. In general, a firmish not overly ripe mango (unlike the very ripe, sweet one I used) holds up best but all will be delicious in this salad."
        ], 
        "date": "2010-07-08T12:58:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup red wine vinegar", 
            "1/4 cup cold water", 
            "1 tablespoon kosher salt", 
            "2 teaspoons sugar", 
            "1/2 a red onion, cut into a 1/2-inch dice (use less if your onion is huge)", 
            "3 bell peppers, your choice of colors (I used one red, orange and yellow)", 
            "1 kirby cucumber,", 
            "1/4-pound firm feta cheese", 
            "1/4 to 1/2 cup pitted kalmata olives", 
            "1/4 cup olive oil", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/mediterranean-pepper-salad.jpg?w=753", 
        "tags": [
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2009/06/mediterranean-pepper-salad/", 
        "title": "mediterranean pepper salad", 
        "directions": [
            "Swish together the red wine vinegar, water, kosher salt and sugar in a small bowl until the salt and sugar are dissolved. Add the red onion and set it aside.", 
            "Meanwhile, time to practice your knife skills. Core and seed your bell peppers and chop them into 1/2-inch pieces. Chop the cucumber and feta into similarly-sized chunks. Put your peppers, cucumber, feta and olives in a large bowl.", 
            "By now, your onions will have lightly pickled, both sweetening and softening their blow. Drain them and add them to the other vegetables in the large bowl, but reserve the vinegar mixture. Pour a quarter cup of the vinegar mixture over the salad, then drizzle with olive oil. Season generously with salt and freshly ground black pepper, or to taste. Toss evenly and serve at once, or let the flavors muddle together in the fridge for a few hours.", 
            "Forgetful, who me? People, I just realized I forgot to add the cup of grape tomatoes that are usually in this salad, and that I’d purchased specifically to add to it. Like grape tomatoes? Add them! Don’t like them? Turns out you might not know they were missing."
        ], 
        "date": "2009-06-25T16:09:49+00:00"
    }, 
    {
        "ingredient_list": [
            "2 medium red bell peppers", 
            "3 medium mixed bell peppers (orange, yellow, green)", 
            "3/4 teaspoon kosher salt", 
            "1/2 teaspoon ground black pepper", 
            "3 tablespoons butter", 
            "1 onion, finely chopped", 
            "2 cloves garlic, minced", 
            "1 medium zucchini, cut into 1/4-inch dice", 
            "1 medium yellow squash, cut into 1/4-inch dice", 
            "2 cups fresh or frozen corn kernels (from 3 to 4 ears of corn; for extra flavor, once you’ve cut the kernels off, use the dull side of your knife blade to scrape the remaining corn and juices, or “milk” from the cob)", 
            "1 medium tomato, seeded and cut into 1/4-inch dice", 
            "2 tablespoons chopped fresh herbs (such as parley, oregano, basil or a mix)", 
            "1/4 cup plain dried breadcrumbs", 
            "Oil for coating grill grate", 
            "2 tablespoons grates Parmesan cheese (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/08/smoke-roasted-stuffed-bell-peppers.jpg?w=753", 
        "tags": [
            "Grilling", 
            "Peppers", 
            "Photo", 
            "Tips", 
            "Travel", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/08/napa-wrapper/", 
        "title": "smoke-roasted stuffed bell peppers", 
        "directions": [
            "If using a gas grill: Use indirect heat on medium (325° to 350°F), a 2- to 4-burner grill-middle burner(s) off, or a 2-burner grill with 1 side off and a clean, oiled grate.", 
            "If using a charcoal grill: Indirect heat, medium ash, split charcoal bed (about 2 dozen coals per side) with a clean, oiled grate on medium setting", 
            "1.\tHeat the grill as directed. Soak 2 cups of apple or oak wood chips or chunks in water for one hour. ", 
            "2.\tSeed, core and cut one of the red bell peppers into 1/4-inch dice. Cut the remaining bell peppers in half lengthwise right through the stem, leaving a bit of stem attached to each half. Cut out the cores, seeds, and ribs from the interiors of the peppers, leaving the stem intact. Sprinkle the insides of the peppers with 1/4 teaspoon of the salt and 1/4 teaspoon of the pepper. ", 
            "3.\tMelt the butter in a large skillet over medium heat. Add the onion and saute until almost tender, about 4 minutes. Add the garlic, chopped bell pepper, zucchini and yellow squash. Saute the vegetables until crisp-tender, about 4 minutes. Stir in the corn and tomato and cook until heated through, 1 to 2 minutes. Stir in herbs, breadcrumbs, and the remaining 1/2 teaspoon salt and 1/4 teaspoon pepper. Cook and stir until the breadcrumbs soak up most of the liquid in the pan. Remove from the heat and spoon the filling equally into the pepper cavities. ", 
            "4.\tWhen the grill is hot, put the soaked wood chips or chunks over the coal on both sides of the grill. If using gas, put the wood chips in a smoker box or in a perforated foil packet directly over one of the heated burners. ", 
            "5.\tBrush the grill grate and coat it with oil. Put the stuffed peppers over the unheated part of the grill, cover, and cook until just tender 20 to 30 minutes. If your grill has a temperature gauge, it should stay around 350ÂºF. ", 
            "6.\tRemove the peppers to a large serving platter. Sprinkle with the Parmesan (if using) and serve. "
        ], 
        "date": "2007-08-23T00:09:03+00:00"
    }, 
    {
        "ingredient_list": [
            "3 bell peppers–1 red, 1 orange and 1 yellow (or less, see Recipe Notes)", 
            "1/2 small red onion", 
            "1/4 cup parsley leaves", 
            "1/4 cup basil leaves", 
            "3 tablespoons olive oil", 
            "1 teaspoon red wine vinegar", 
            "Salt and pepper", 
            "2 ounces mozzarella cheese", 
            "1 clove garlic"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pizza-with-red-and-yellow-peppers1.jpg?w=500", 
        "tags": [
            "Peppers", 
            "Photo", 
            "Pizza", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2008/06/pizza-with-red-and-yellow-peppers/", 
        "title": "pizza with red and yellow peppers", 
        "directions": [
            "Pizza dough for one pizza [a simple recipe, a wine and honey version]", 
            "Preheat the oven–with a pizza stone in it–to 450 to 500 °F. [If you don’t have a pizza stone, you can bake this on the back of a baking sheet, sprinkled with cornmeal.]", 
            "Slice thin the peppers and onion, and roughly chop the parsley and basil. Toss in a bowl with 2 tablespoons of the olive oil and the vinegar, and season to taste with salt and pepper.", 
            "Coarsely grate the cheese. Chop the garlic fine and mix it with the remaining tablespoon of olive oil.", 
            "Roll out a disk of pizza dough 12 to 14 inches in diameter and place it on the back of a lightly floured sheet pan or pizza peel. Using a pastry brush or your fingers, brush the garlic and oil mixture on the dough, leaving a 1/2-inch border. Sprinkle the grated cheese on top of the oiled dough. Spread the pepper mixture on top of the cheese. Slide the pizza directly onto the pizza brick and bake for 4 to 6 minutes, or until the dough is crispy and thoroughly cooked. Slice and serve immediately.", 
            "Makes one 12-inch pizza."
        ], 
        "date": "2008-06-18T14:51:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 onion, finely chopped", 
            "2 garlic cloves, very thinly sliced", 
            "1 cup tomato puree (such as Pomi)", 
            "2 tablespoons olive oil, divided", 
            "1 small eggplant (my store sells these “Italian Eggplant” that are less than half the size of regular ones; it worked perfectly)", 
            "1 smallish zucchini", 
            "1 smallish yellow squash", 
            "1 longish red bell pepper", 
            "Few sprigs fresh thyme", 
            "Salt and pepper", 
            "Few tablespoons soft goat cheese, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/758095178_8643a61f2b_o.jpg?w=749", 
        "tags": [
            "Eggplant", 
            "Peppers", 
            "Photo", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2007/07/rat-a-too-ee-for-you-ee/", 
        "title": "ratatouille’s ratatouille", 
        "directions": [
            "Preheat oven to 375 degrees F.", 
            "Pour tomato puree into bottom of an oval baking dish, approximately 10 inches across the long way. Drop the sliced garlic cloves and chopped onion into the sauce, stir in one tablespoon of the olive oil and season the sauce generously with salt and pepper. ", 
            "Trim the ends off the eggplant, zucchini and yellow squash. As carefully as you can, trim the ends off the red pepper and remove the core, leaving the edges intact, like a tube. ", 
            "On a mandoline, adjustable-blade slicer or with a very sharp knife, cut the eggplant, zucchini, yellow squash and red pepper into very thin slices, approximately 1/16-inch thick.", 
            "Atop the tomato sauce, arrange slices of prepared vegetables concentrically from the outer edge to the inside of the baking dish, overlapping so just a smidgen of each flat surface is visible, alternating vegetables. You may have a handful leftover that do not fit. ", 
            "Drizzle the remaining tablespoon olive oil over the vegetables and season them generously with salt and pepper. Remove the leaves from the thyme sprigs with your fingertips, running them down the stem. Sprinkle the fresh thyme over the dish.", 
            "Cover dish with a piece of parchment paper cut to fit inside. (Tricky, I know, but the hardest thing about this.) ", 
            "Bake for approximately 45 to 55 minutes, until vegetables have released their liquid and are clearly cooked, but with some structure left so they are not totally limp. They should not be brown at the edges, and you should see that the tomato sauce is bubbling up around them.", 
            "Serve with a dab of soft goat cheese on top, alone, or with some crusty French bread, atop polenta, couscous, or your choice of grain. "
        ], 
        "date": "2007-07-09T17:37:07+00:00"
    }, 
    {
        "ingredient_list": [
            "14 ounces frozen puff pastry, defrosted in the fridge overnight*", 
            "1 Asian eggplant", 
            "1 smallish zucchini", 
            "1 smallish yellow squash", 
            "1 longish red bell pepper", 
            "1/3 cup tomato puree (such as Pomi) or canned plain tomato sauce", 
            "2 tablespoons olive oil", 
            "Salt and pepper", 
            "Few sprigs fresh thyme", 
            "1 cup crumbled feta "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/ratatouille-tart1.jpg?w=500", 
        "tags": [
            "Eggplant", 
            "Peppers", 
            "Photo", 
            "Summer", 
            "Summer Squash", 
            "Tarts/Quiche", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2007/12/ratatouille-tart/", 
        "title": "ratatouille tart", 
        "directions": [
            "Heat the oven to 375°F. Lightly flour a work surface, lay the sheet of pastry out, and gently roll until it measures about 11 x 15 inches. Slide the pastry onto a baking sheet lined with parchment paper. Prick the pastry all over with a fork, at about 1-inch intervals. ", 
            "Spread the tomato puree or sauce evenly over the pastry, leaving a one-inch border around the edges. ", 
            "Trim the ends off the eggplant, zucchini and yellow squash. As carefully as you can, trim the ends off the red pepper and remove the core, leaving the edges intact, like a tube. ", 
            "On a mandoline, adjustable-blade slicer or with a very sharp knife, cut the eggplant, zucchini, yellow squash and red pepper into very thin slices, approximately 1/16-inch thick.", 
            "Arrange slightly overlapped slices of vegetables concentrically or in rows over the tomato puree or sauce, alternative vegetables. You’ll probably have a few leftover.", 
            "Drizzle vegetables with olive oil, season with salt and pepper and sprinkle de-stemmed thyme leaves over the vegetables.  ", 
            "Bake in the heated oven until the pastry is puffed and browned (including on the bottom), 25 to 30 min and the vegetables look softened. Slide onto a cutting board, sprinkle with the feta, and cut into squares or strips. (A pizza wheel worked surprisingly well for this.) Serve warm or at room temperature.", 
            "* I don’t know how widely distributed it is, but those of you in NYC should look for a locally made (like, it’s practically closer for me to walk over to the factory) puff pastry from brand called DuFour that –once you get past the steep price tag–will blow your mind. Prior to trying it, I thought puff pastry was flaky, messy, dry and unsubstantial, pretty for sure but not fun to eat. Once I tried Dufour, I was immediately besmitten. "
        ], 
        "date": "2007-12-02T23:04:55+00:00"
    }, 
    {
        "ingredient_list": [
            "6 bell peppers (if you can get a mix of colors, go for it)", 
            "1/4 cup red wine vinegar", 
            "1 clove garlic, minced", 
            "Salt, to taste", 
            "Freshly ground black pepper, to taste", 
            "2 tablespoons extra-virgin olive oil", 
            "2 tablespoons capers, drained", 
            "2 tablespoons flat-leaf parsley, chopped (optional)", 
            "1/2 pound ball of mozzarella, sliced (this is a great place to use the really fresh stuff, if you can get it)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-peppers-with-capers-and-mozzarella1.jpg?w=500", 
        "tags": [
            "Italian", 
            "Peppers", 
            "Photo", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/06/roasted-peppers-with-capers-and-mozzarella/", 
        "title": "roasted peppers with capers and mozzarella", 
        "directions": [
            "Roast the peppers: Preheat the oven to 400 degrees. Line peppers on a large baking sheet and roast them for 45 minutes to 1 hour, using tongs to rotate them 1/4 of the way, rotisserie-style, every 15 minutes. It’s safer to extend the cooking time than shorten it, as the skins will only come off easily if they’re fully cooked.", 
            "Once they’re fully roasted, cover the pepper tray with another piece of foil and let the peppers cool. When they’re cool enough to handle, remove the skins. Remove seeds and slice sections of pepper into 1/4-inch wide strips.", 
            "Toss peppers with red wine vinegar, garlic and a few pinches of salt. Cover and let marinate for an hour or overnight (and up to 4 days) in the fridge. ", 
            "To serve, arrange peppers on a plate. Adjust seasonings, adding salt, freshly ground black pepper or additional vinegar, to taste. Drizzle with olive oil, sprinkle with capers and parsley and arrange mozzarella over salad.", 
            "Eat with some crusty bread and a glass of wine, preferably al fresco."
        ], 
        "date": "2011-06-08T11:09:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound of small pasta (I used shells because I imagined the peas would nest in there and gah, such cuteness)", 
            "1/4 pound snow pea pods, ends trimmed", 
            "1/2 pound fresh summer peas, which yielded about 1 cup once shelled", 
            "3/4 to 1 cup Roasted Red Pepper Vinaigrette (recipe below)", 
            "1 red bell pepper, roasted, skinned and seeded or the equivalent from a jar, drained", 
            "1/4 cup olive oil", 
            "2 tablespoons red wine vinegar (and up to 2 tablespoons more if you, like us, like that extra bite in your dressing)", 
            "1 tablespoon chopped shallot (about 1 small)", 
            "1/2 teaspoon salt", 
            "Several grinds of black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/summer-pea-and-roasted-red-pepper-pasta-salad1.jpg?w=500", 
        "tags": [
            "Pasta", 
            "Peas", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/08/summer-pea-and-roasted-red-pepper-pasta-salad/", 
        "title": "summer pea and roasted red pepper pasta salad", 
        "directions": [
            "Puree the red bell pepper in a food processor or blender as much as possible, then add the remaining ingredients and running the machine until the dressing is silky smooth. Adjust the vinegar level and seasonings to taste."
        ], 
        "date": "2009-08-08T08:35:26+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons good olive oil", 
            "1 small French bread or boule, cut into 1-inch cubes (6 cups)", 
            "1 teaspoon kosher salt", 
            "2 large ripe tomatoes, cut into 1-inch cubes", 
            "1 hothouse cucumber, unpeeled, seeded, and sliced 1/2 inch thick", 
            "2 bell peppers, seeded and cut into 1-inch cubes (I like to use a combination of purple or yellow or orange, to nicely colorize the dish)", 
            "1/2 red onion, cut in half and thinly sliced", 
            "20 large basil leaves, coarsely chopped", 
            "3 tablespoons capers, drained", 
            "For the vinaigrette", 
            "1 teaspoon finely minced garlic", 
            "1/2 teaspoon Dijon mustard", 
            "3 tablespoons champagne vinegar", 
            "1/3 cup good olive oil", 
            "1/2 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/09/summers-last-hurrah-panzanella-e1472056230782.jpg?w=753", 
        "tags": [
            "Cucumber", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2008/09/summers-last-hurrah-panzanella/", 
        "title": "summer’s last hurrah panzanella", 
        "directions": [
            "Heat the oil in a large saute pan. Add the bread and salt; cook over low to medium heat, tossing frequently, for 10 minutes, or until nicely browned. Add more oil as needed.", 
            "For the vinaigrette, whisk together the ingredients.", 
            "In a large bowl, mix the tomatoes, cucumber, red pepper, yellow pepper, red onion, basil, and capers. Add the bread cubes and toss with the vinaigrette. Season liberally with salt and pepper.", 
            "Serve immediately, or allow the salad to sit for about half an hour for the flavors to blend."
        ], 
        "date": "2008-09-21T12:05:24+00:00"
    }, 
    {
        "ingredient_list": [
            "2 15-ounce cans black beans, drained and well-rinsed", 
            "4 bell peppers, a mix of colors, chopped into a small dice", 
            "1/2 super-large or 1 medium white onion, chopped into a small dice", 
            "Juice of one lime", 
            "3 tablespoons olive oil", 
            "1 teaspoon ground cumin", 
            "3/4 teaspoon salt", 
            "1 fresh chile, very thinly sliced or finely chopped or hot sauce, to taste", 
            "Optional: If you’re the kind of person who loves cilantro, it’s a great match for this salad. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/black-bean-confetti-salad1.jpg?w=640", 
        "tags": [
            "Beans", 
            "Gluten-Free", 
            "Peppers", 
            "Photo", 
            "Salad", 
            "Tex-Mex", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2007/04/tabula-beana/", 
        "title": "black bean confetti salad", 
        "directions": [
            "Mix beans, bell peppers and white onion in a large bowl. In a separate, smaller bowl, whisk remaining ingredients into a vinaigrette. Ideally, you’ll have a 1/2 cup of dressing. Pour it over the bean mixture, toss it well and adjust seasonings to taste.  "
        ], 
        "date": "2007-04-23T00:22:59+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups distilled white vinegar", 
            "3 cups water", 
            "2/3 to 3/4 cup sugar", 
            "5 tablespoons kosher salt or 1/4 cup table salt*", 
            "10 bell peppers, all red or a mix of red, orange and yellow (the sweet varieties)", 
            "4 large cloves of garlic, coarsely chopped**"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-road-to-pickle-proficiency1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Peppers", 
            "Photo", 
            "Pickled", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2007/05/the-road-to-pickle-proficiency/", 
        "title": "pickled garlicky red peppers", 
        "directions": [], 
        "date": "2007-05-09T13:31:50+00:00"
    }
]