{
  "date": "2012-10-31T09:43:22+00:00",
  "directions": [
    "Boil the apple cider in a 3- to- 4- quart saucepan over high heat until it is reduced to a dark, thick syrup, between 1/3 and 1/2 cup in volume. This takes about 35 to 40 minutes on my stove. Stir occasionally.",
    "Meanwhile, get your other ingredients in order, because you won’t have time to spare once the candy is cooking. Line the bottom and sides of an 8- inch straight- sided square metal baking pan with 2 long sheets of crisscrossed parchment. Set it aside. Stir the cinnamon and flaky salt together in a small dish.",
    "Once you are finished reducing the apple cider, remove it from the heat and stir in the butter, sugars, and heavy cream. Return the pot to medium- high heat with a candy thermometer attached to the side, and let it boil until the thermometer reads 252 degrees, only about 5 minutes. Keep a close eye on it.",
    "(Don’t have a candy or deep- fry thermometer? Have a bowl of very cold water ready, and cook the caramel until a tiny spoonful dropped into the water becomes firm, chewy, and able to be plied into a ball.)",
    "Immediately remove caramel from heat, add the cinnamon- salt mixture, and give the caramel several stirs to distribute it evenly. Pour caramel into the prepared pan. Let it sit until cool and firm—about 2 hours, though it goes faster in the fridge. Once caramel is firm, use your parchment paper sling to transfer the block to a cutting board. Use a well- oiled knife, oiling it after each cut (trust me!), to cut the caramel into 1-by-1-inch squares. Wrap each one in a 4-inch square of waxed paper, twisting the sides to close. Caramels will be somewhat on the soft side at room temperature, and chewy/firm from the fridge.",
    "Do ahead: Caramels keep, in an airtight container at room temperature, for two weeks, but really, good luck with that."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-cider-caramels-the-book-is-here1.jpg?w=640",
  "ingredient_list": [
    "4 cups (945 ml) apple cider",
    "1/2 teaspoon ground cinnamon",
    "2 teaspoons flaky sea salt, such as Maldon, or less of a finer one",
    "8 tablespoons (115 grams or 1 stick) unsalted butter, cut into chunks",
    "1 cup (200 grams) granulated sugar",
    "1/2 cup (110 grams) packed light brown sugar",
    "1/3 cup (80 ml) heavy cream",
    "Neutral oil for the knife"
  ],
  "tags": [
    "Announcements",
    "Candy",
    "Cookbooks",
    "Fall",
    "Photo"
  ],
  "title": "apple cider caramels + the book is here!",
  "url": "https://smittenkitchen.com/2012/10/apple-cider-caramels-the-book-is-here/"
}