{
  "date": "2009-12-01T10:05:05+00:00",
  "directions": [
    "Heat oven to 350 degrees. In a bowl, mix bread crumbs and thyme with a couple glugs of olive oil, and spread on a cookie sheet. Toast, tossing frequently, until golden brown, 10 to 12 minutes.",
    "Heat butter and remaining olive oil in a large skillet over medium-high heat until foamy. Add brussels sprouts, sprinkle with salt and pepper, and sauté, tossing frequently, until lightly browned, about 7 to 10 minutes. Add diced pancetta, and sauté, tossing frequently, until sprouts are well browned and softened slightly, and pancetta is crisp, about 10 to 15 minutes more. Reduce heat, add shallots and garlic, and sauté until fragrant, 2 minutes.",
    "Increase heat to high, add balsamic vinegar and stock, and cook, tossing frequently, until sprouts are glazed and tender, about 20 minutes; add more stock if needed. Taste, adjusting seasoning if necessary, and sprinkle with chopped parsley. Transfer to a warm serving bowl and scatter bread crumbs on top."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/balsamic-braised-brussels-sprouts-with-pancetta1.jpg?w=640",
  "ingredient_list": [
    "1 1/2 cups fresh bread crumbs (though I found I needed far less)",
    "2 teaspoons thyme leaves",
    "2 tablespoons extra virgin olive oil plus an extra glug or two for drizzling",
    "4 tablespoons unsalted butter",
    "2 pounds medium-sized brussels sprouts, washed and trimmed",
    "Salt and pepper",
    "6 ounces pancetta in small dice (1 1/2 cups)",
    "3 tablespoons minced shallots",
    "1 tablespoon minced garlic",
    "1/2 cup balsamic vinegar",
    "1 1/2 cups veal stock, rich chicken or vegetable broth, more if needed",
    "2 tablespoons chopped parsley"
  ],
  "tags": [
    "Brussels Sprouts",
    "Fall",
    "Photo",
    "Side Dish",
    "Thanksgiving"
  ],
  "title": "balsamic braised brussels with pancetta",
  "url": "https://smittenkitchen.com/2009/12/balsamic-braised-brussels-with-pancetta/"
}