{
  "date": "2010-10-20T12:57:42+00:00",
  "directions": [
    "Preheat oven to 350°F (180°C) degrees. Break cauliflower into medium florets (this will cause less mess than chopping it). Place floret in a pot with a teaspoon of salt, cover them with water and simmer for 15 to 20 minutes, until quite soft. Strain and let drip in the colander for a few minutes so they dry and cool.",
    "Meanwhile, prepare the batter. Halve your red onion and cut a few thin rings off the end of one side; set them aside. Coarsely chop the remainder of your onion. Heat all of your olive oil in a saucepan (I won’t tell if you use the one where you cooked your cauliflower) and saute the chopped red onion and rosemary together until soft, about 8 minutes. Remove from heat and allow to cool.",
    "Whisk eggs and olive oil and onion mixture together. Stir in basil. Whisk flour, baking powder, turmeric, cheese, 1 1/2 teaspoons salt (use 1 teaspoon if you are nervous about this amount) and many, many grinds of black pepper together in a separate bowl and add to egg mixture, whisking to remove lumps. Stir in cauliflower gently, so most pieces remain intact.",
    "Line the bottom of a 9-inch (24cm) round springform pan with parchment paper. Butter the sides generously. Put the sesame seeds in the pan and toss them around so that they stick to the sides. Pour in the cauliflower batter, arrange the reserved onion rings on top and bake cake in the center of the oven for 45 minutes, until golden brown and set.",
    "Serve warm or at room temperature. Before you serve the cake, be sure to run a knife around the pan. This was probably the first time in my life I forgot, and several parts of the seed-crusted sides tore off!"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cauliflower-and-parmesan-cake1.jpg?w=500",
  "ingredient_list": [
    "1 medium cauliflower (1 1/2 pounds, 23 to 24 ounces or 650 to 700grams)",
    "1 large red onion, peeled",
    "7 1/2 tablespoons (100 grams or 3.5 ounces) olive oil (I used 5 tablespoons, see Note up top)",
    "1/2 teaspoon finely chopped rosemary",
    "10 medium or 8 large eggs",
    "Handful (3/4 ounce or 20 grams) basil, chopped",
    "Scant 1 1/2 cups (180 grams or 6.3 ounces) all-purpose flour",
    "2 1/2 teaspoons baking powder",
    "1/2 teaspoon ground turmeric",
    "2 cups finely grated parmesan cheese (200 grams or 7 3/4 ounces, see Note up top) or about 1 generous cup of grated Romano cheese",
    "Salt and black pepper",
    "Butter, for greasing pan",
    "2 tablespoons black sesame seeds"
  ],
  "tags": [
    "Cauliflower",
    "Eggs",
    "Fall",
    "Photo",
    "Vegetarian"
  ],
  "title": "cauliflower and parmesan cake",
  "url": "https://smittenkitchen.com/2010/10/cauliflower-and-parmesan-cake/"
}