{
  "date": "2017-01-13T12:58:52+00:00",
  "directions": [
    "Cook farro: Rinse and drain farro. There are many, many ways to cook farro and any of them work here. You can follow the package directions on any farro you buy for best results.",
    "On the stove: If you plan to cook this on the stove and want to save time, you can presoak the grains overnight in their 3 cups of liquid and they should then cook in only 10 minutes of simmering. Otherwise, simmer the farro in water or broth for about 30 minutes, until quite tender. Drain any excess liquid. Transfer farro to large bowl.\nIn a rice-cooker: I cook mine on the quick setting and have been very happy with the results. Drain any excess liquid once the farro is tender. Transfer farro to large bowl.\nMeanwhile, parcook cauliflower:\nIn the oven: Heat oven to 425 degrees. Brush a large baking sheet with 2 tablespoons olive oil. Spread florets in one layer, drizzle with 1 more tablespoon olive oil and sprinkle with salt and freshly ground black pepper. Roast for 20 minutes until lightly browned and crisp-tender (they will finish baking with the farro). Reduce heat to 400 degrees.",
    "One the stove: Heat 2 tablespoons olive oil in a large saute pan over medium-high heat. Add half the cauliflower and cook, tossing occasionally, until lightly browned and tender, about 6 to 7 minutes. Add to bowl with farro. Repeat with more olive oil and second half of cauliflower, then add to bowl. Heat oven to 400 degrees.\nAssemble casserole: Add the sage, capers, garlic, lemon zest, red pepper flakes, 1 teaspoon salt and 1/2 teaspoon black pepper to cauliflower and farro and stir to combine. Stir in fontina. Transfer half of the mixture to an oiled 10-inch ovenproof frying pan or equivalent baking dish. Dollop rounded tablespoons of ricotta all over. Sprinkle remaining cauliflower and farro over the ricotta, leaving the pockets of it undisturbed.",
    "In a small dish, combine panko with pecorino, parlsey and 1 tablespoon olive oil until evenly mixed. Sprinkle over cauliflower and farro.",
    "Bake casserole: For 20 minutes, until browned and crusty on top. Dig in.\nDo ahead: Farro can be cooked up to 3 days in advance, kept in an airtight container in fridge. Cauliflower can be cooked 2 days in advance. Casserole can be assembled and baked a day later, easily, although the crumbs might lose their crisp from absorbing the moisture below if not added right before baking. Casserole keeps for several days in fridge and longer in freezer."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/01/crusty-baked-cauliflower-and-farro.jpg?w=750",
  "ingredient_list": [
    "1 cup (210 grams) dried farro",
    "3 cups water or broth",
    "Kosher salt",
    "Freshly ground black pepper",
    "Olive oil",
    "2 1/4 to 2 1/2 pound (1 to 1 1/8 kgs) head of cauliflower, cut into small florets",
    "2 tablespoons finely chopped fresh sage leaves",
    "2 tablespoons capers (brine-packed), drained",
    "2 large or 3 regular cloves garlic, minced",
    "1/2 teaspoon finely grated lemon zest",
    "Crushed red pepper flakes, to taste",
    "2 cups (6 ounces or 170 grams) coarsely grated, lightly packed Italian Fontina (Val d’Aosta variety, if you can find it) (buy about 8 ounces with rind)",
    "1/2 cup (125 grams) ricotta cheese",
    "1/2 cup (25 grams) panko (plain Japanese-style breadcrumbs)",
    "1/3 cup (30 grams) finely grated pecorino romano cheese",
    "2 tablespoons finely chopped fresh parsley leaves"
  ],
  "tags": [
    "Casserole",
    "Cauliflower",
    "Freezer Friendly",
    "Grain/Rice",
    "Photo",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "crusty baked cauliflower and farro",
  "url": "https://smittenkitchen.com/2017/01/crusty-baked-cauliflower-and-farro/"
}