{
  "date": "2015-09-21T12:24:24+00:00",
  "directions": [
    "Make bread dough: In the bottom of large mixing bowl, combine water, milk and sugar or honey, then stir in yeast. Add egg and oil and whisk until combined. Add flour, oats and salt and if mixing with a machine, combine with paddle attachment at the lowest speed for 1 minute. If mixing by hand, use a large spoon and stir for 1 minute. The dough will be wet and coarse; do not fret. Let it rest for 5 minutes.",
    "If using a mixer, switch to the dough hook and mix the dough on medium-low for 2 more minutes. By hand, do the same with your spoon. The dough will seem firm and more smooth, ideally supple and sticky, but if it’s still very wet, add a bit more flour, a spoonful at a time. If it seems excessively stiff, add a little more water, a spoonful at a time. Continue to mix with dough hook or by hand for 4 minutes.",
    "Scrape dough out onto lightly floured counter. Knead a few times, then form the dough into a ball. Oil your empty mixing bowl and return dough to it. Cover with plastic wrap and let proof at room temperature for 60 to 70 minutes, or until doubled in buik or transfer to the fridge and let it ferment overnight or up to 5 days. If proofing in the fridge, remove the dough before the fridge about 3 hours before you plan to bake it.",
    "Form loaves: [Edited to add:] Lightly coat two standard loaf pans with oil, butter or a nonstick spray. Turn dough onto a floured counter and divide it into two equal pieces. Press each gently into a rough rectangle-ish shape. Fold in sides so that the first dough is roughly the width of your prepared bread loaf pan (about 9 inches). Roll from bottom to top and then put this log into your bread loaf pan, seam side down. Repeat with remaining dough. Let proof at room temperature for about an hour, or until the dough has crowned 1 inch above the rim of the baking pan. Halfway through, heat oven to 350 degrees F.",
    "Bake bread: For 35 to 40 minutes, rotating pans once for even color. A cooked loaf of bread will sound a bit hollow when tapped and the internal temperature should read 190 degrees F. Remove loaves from tins and let cool on a rack. If you’re planning to freeze bread, I like to let it cool completely before slicing it, then sliding the sliced loaf into freezer bags. You can mark them with a date, but they rarely last long enough to be forgotten."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/oat-and-wheat-sandwich-bread1.jpg?w=750",
  "ingredient_list": [
    "5 cups (635 grams) whole-wheat flour",
    "2 cups (160 grams) rolled oats (I used quick-cooking for the least noticable texture)",
    "1 tablespoon kosher or coarse salt",
    "3 tablespoons raw or brown sugar, honey or agave nectar",
    "1 large egg",
    "1/4 cup (55 grams grams) vegetable or olive oil, plus a little more to coat bowl",
    "1 1/4 cups lukewarm water",
    "1 1/4 cups lukewarm milk, any kind",
    "1 1/2 tablespoons (about 14 grams) instant yeast"
  ],
  "tags": [
    "Bread",
    "Freezer Friendly",
    "Photo",
    "Sandwich",
    "Vegetarian"
  ],
  "title": "oat and wheat sandwich bread",
  "url": "https://smittenkitchen.com/2015/09/oat-and-wheat-sandwich-bread/"
}