{
  "date": "2011-10-26T09:47:57+00:00",
  "directions": [
    "Preheat the oven to 350°F.",
    "Stir together the flour, granulated sugar, brown sugar, gingersnap crumbs, ginger and salt. Stir in the melted butter until large crumbs form.",
    "In a 1 1/2 to 2 quart baking dish, mix the pears, cranberries, lemon juice, lemon zest and vanilla. In a small bowl, whisk the sugar and cornstarch together then toss it with the fruit mixture in the pan. Sure, you could do this in a bowl but then you’d also have to wash that bowl and hooray for fewer dishes.",
    "Sprinkle the gingersnap crumble over the fruit. Set the crumble on a foil-lined baking sheet (in a 2 quart dish, mine didn’t come close to bubbling over but I see no reason to risk it) and bake it for about 45 minutes, until the crumble is a shade darker and you see juices bubbling through the crumbs. See how long you can wait before digging in."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/10/pear-cranberry-and-gingersnap-crumble.jpg?w=750",
  "ingredient_list": [
    "Crumble",
    "1 cup (125 grams) all-purpose flour",
    "1/4 cup (50 grams) granulated sugar",
    "3 tablespoons (37 grams) packed dark or light brown sugar",
    "1 cup gingersnap crumbs (4 ounces or 113 grams or about 16 storebought cookies)",
    "1/8 teaspoon ground ginger",
    "1/8 teaspoon table salt",
    "Pinch of white pepper, especially if your gingersnaps aren’t particularly snappish",
    "1/2 cup (4 ounces or 113 grams or 1 stick) unsalted butter, melted and cooled",
    "Filling",
    "2 pounds (about 4 to 5) large ripe pears (I used Anjou, suggested in the original recipe) peeled, halved, cored and sliced 1/4 inch thick",
    "1 1/2 cups (6 ounces or 170 grams) fresh cranberries",
    "1 tablespoon (15 ml) lemon juice",
    "1/2 teaspoon finely grated lemon zest",
    "1/2 teaspoon vanilla extract",
    "1/2 cup (100 grams) granulated sugar",
    "2 tablespoons (14 grams) cornstarch"
  ],
  "tags": [
    "Cranberries",
    "Crumbles/Crisps",
    "Fall",
    "Pear",
    "Photo",
    "Tarts/Pies",
    "Thanksgiving",
    "Winter"
  ],
  "title": "pear cranberry and gingersnap crumble",
  "url": "https://smittenkitchen.com/2011/10/pear-cranberry-and-gingersnap-crumble/"
}