{
  "date": "2016-11-10T13:09:08+00:00",
  "directions": [
    "Heat your oven to 350°F. Butter a 13×9-inch deep baking dish.\nHeat 2 tablespoons olive oil in a large deep (ideally 12-inch) saute pan over medium heat and add the onions and fennel. Cooking, tossing occasionally, until lightly browned and tender, about 10 minutes. Add the garlic and cook for one minute more.\nMeanwhile, in the largest bowl you own, combine the onion mixture with remaining vegetables, cream, stock, cheese, thyme, 1 tablespoon kosher salt and 1 1/2 teaspoons black pepper. Pour mixture into prepared dish and spread until even. Mix breadcrumbs and butter until evenly coated and distribute evenly over top of dish.\nBake 1 1/2 hours uncovered, or until vegetables are very tender when tested with a small knife and the top is browned and bubbly. Allow to set for 15 minutes at room temperature and serve hot."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/root-vegetable-gratin.jpg?w=750",
  "ingredient_list": [
    "Olive oil",
    "1 large onion, sliced (1 1/2 cups)",
    "2 cups (1/4-inch-sliced) fennel, top and core, if thick, removed",
    "3 cloves garlic, minced (1 tablespoon)",
    "1 pound sweet potatoes, peeled and sliced 1/4-inch thick",
    "1 pound celery root, peeled and sliced 1/4-inch thick",
    "1 pound yukon gold, peeled and sliced 1/4-inch thick",
    "1 cup heavy cream (see Note up top)",
    "2 cups chicken or vegetable stock or brother",
    "2 cups grated gruyere cheese (6 ounces with rind)",
    "2 teaspoons minced fresh thyme leaves",
    "Kosher salt and freshly ground black pepper",
    "2 1/2 cups coarse fresh breadcrumbs or panko (what I used)",
    "2 to 3 tablespoons melted butter"
  ],
  "tags": [
    "Casserole",
    "Fall",
    "Fennel",
    "Freezer Friendly",
    "Onions",
    "Photo",
    "Potatoes",
    "Side Dish",
    "Thanksgiving",
    "Vegetarian",
    "Winter"
  ],
  "title": "root vegetable gratin",
  "url": "https://smittenkitchen.com/2016/11/root-vegetable-gratin/"
}