{
  "date": "2010-01-02T00:23:01+00:00",
  "directions": [
    "Season the beef generously with salt and pepper, to taste. Heat a large, heavy skillet over medium-high heat. Add the oil and heat just until beginning to smoke. Add the meat and cook, turning once, until browned on both sides, about 10 minutes total. Transfer the meat to the slow cooker; leave the skillet on the heat.",
    "Add garlic, onion, chili powder, coriander, and cumin to drippings in the skillet and stir until fragrant, about one minute. Add vinegar and boil until it’s almost gone (and seriously, get your head out of the way of the steam; inhaling vinegar is no fun!), scraping the bottom of the pan with a wooden spoon. Stir in water and pour the mixture over the brisket. Crush the tomatoes through your fingers into the slow cooker; add the tomato juices, chipotles, bay leaves, and molasses. Cover the cooker, set it on LOW, and cook the brisket until it pulls apart easily with a fork, about 8 to 10 hours. (The original recipe suggests 8 hours, but my mother-in-law, who makes wonderful brisket, says she cooks hers for 10. So I went with 10 and it was lovely, but feel free to check in on yours at 8 hours to determine if it needs more tenderizing.)",
    "To serve, you’ve got two options: Leave the meat in the slow cooker and use two forks to pull it apart and stir it evenly into the sauce; season with salt and pepper, to taste. Remove and discard bay leaves. This is obviously the simplest route.",
    "Your second option is to do as I did, just a little more work. I strained the sauce (to remove the cooked-until-dead vegetables and bay leaves), chilled it so the fat would be easy to remove, then reheated and reseasoned it well, simmering it down (to about 2/3 the volume) to thicken it a bit. We poured it back over the brisket as we pulled it, and then, when we got where we were going, reheated the whole pan on low.   (You could also thicken the sauce without skimming the excess fat — there was actually not as much as I’d anticipated.) ",
    "Either way, I suspect you will be making this again sooner that you’d anticipated.",
    "Don’t have a slow cooker? Fear not. Mr. Pearson kindly informed me that he has made this recipe in a Dutch oven in the oven at 350°F for 3 hours. I have not tested it this way but it sounds more than all right by me."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/southwestern-pulled-brisket1.jpg?w=500",
  "ingredient_list": [
    "3 pounds beef brisket",
    "Kosher salt",
    "Freshly ground black pepper",
    "2 tablespoons vegetable oil",
    "5 cloves garlic, peeled and smashed",
    "1 Spanish onion, halved and thinly sliced",
    "1 tablespoon chili powder",
    "2 teaspoons ground coriander",
    "2 teaspoons ground cumin",
    "1/4 cup apple cider vinegar",
    "1 1/2 cups water",
    "1 (14 1/2-ounce) can whole peeled tomatoes, with their juices",
    "1 to 2 whole canned chipotle chiles en adobo [Read: 1 or 2 from a can, not one or two cans, m’kay? Many misread this amount!] (I used one pepper; two will give it a real kick)",
    "2 bay leaves",
    "1/4 cup molasses"
  ],
  "tags": [
    "Freezer Friendly",
    "Meat",
    "Photo",
    "Slow Cooker",
    "Tex-Mex"
  ],
  "title": "southwestern pulled brisket",
  "url": "https://smittenkitchen.com/2010/01/southwestern-pulled-brisket/"
}