{
  "date": "2010-10-25T11:48:25+00:00",
  "directions": [
    "Preheat oven to 350°F with rack in middle. Butter an 8- or 9-inch square cake pan. I had no trouble getting my cake out of a nonstick pan by just buttering it, but if you don’t have a nonstick cake pan or are a little nervous, line the bottom with parchment paper and butter that too.",
    "Make cake: Whisk together flour, baking powder, baking soda, salt, and spices. Beat butter, brown sugar, and vanilla with an electric mixer at high speed until pale and fluffy, 2 to 3 minutes. Add eggs one at a time, beating well after each addition, then beat in applesauce. At low speed, mix in flour mixture until just combined, then stir in walnuts (if using). The batter will look a little curdly and uneven but don’t worry, it will all bake up perfectly in the end.",
    "Spread batter evenly in pan and bake until golden-brown and a wooden pick inserted into center comes out clean, about 35 to 40 minutes. Cool in pan 15 minutes. Run a knife around edge of cake to loosen, then invert onto a plate. Reinvert cake onto a rack to cool completely. You can speed this up, as I always do, in the fridge.",
    "Make frosting: Beat cream cheese, butter, and vanilla with an electric mixer at high speed until fluffy. Sift confectioners sugar and cinnamon over cream cheese mixture, then beat at medium speed until incorporated. Spread frosting over top of cooled cake.",
    "Do ahead: We were impressed with how well this cake kept for three days but were unable to “research” if it lasted longer. Keep frosted cake in the fridge. If you’d like to bake the cake further in advance, I’d wrap it well and freeze it until the day you need it. Leave it out on the counter to defrost and frost it up to a day in advance."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/spiced-applesauce-cake.jpg?w=749",
  "ingredient_list": [
    "For cake",
    "2 cups (8 3/4 ounces or 250 grams) all-purpose flour",
    "2 teaspoons (10 grams) baking powder",
    "1/2 teaspoon (3 grams) baking soda",
    "1/2 teaspoon (3 grams) salt",
    "3/4 teaspoon (2 grams) cinnamon",
    "1/2 teaspoon (1 gram) ground ginger",
    "1/8 teaspoon ground cloves",
    "1 stick (4 ounces or 113 grams) unsalted butter, softened",
    "1 cup (6 7/8 ounces or 195 grams) packed light brown sugar (updated weight)",
    "1 teaspoon (5 ml) pure vanilla extract",
    "2 large eggs",
    "1 1/2 cups (about 13 ounces or 365 grams) unsweetened applesauce",
    "1/2 cup (about 1 3/4 ounces or 50 grams) walnuts (optional), toasted, cooled, and chopped",
    "For frosting",
    "5 ounces (142 grams) cream cheese, softened",
    "3 tablespoons (1 1/2 ounces or 42 grams) unsalted butter, softened",
    "1/4 teaspoon pure vanilla extract",
    "1 cup (4 ounces or 120 grams) confectioners sugar",
    "1/2 (1 teaspoon) teaspoon cinnamon"
  ],
  "tags": [
    "Apple",
    "Cake",
    "Everyday Cakes",
    "Fall",
    "Photo"
  ],
  "title": "spiced applesauce cake",
  "url": "https://smittenkitchen.com/2010/10/spiced-applesauce-cake/"
}