{
  "date": "2009-01-17T12:19:42+00:00",
  "directions": [
    "Glaze: 1 egg yolk whisked with 1 teaspoon milk",
    "Toppings: Pearl sugar [see places to buy them at the end] and/or miniature chocolate chips",
    "Preheat the oven to 425°F (220°C). Line a cookie sheet with a reusable nonstick baking mat or parchment paper.",
    "Heat the water, salt, sugar, and butter in a meduim saucepan, stirring, until the butter is melted. Remove the pot from the heat heat and dump all the flour in at once. Mix vigorously with a wooden spoon until the mixture forms a smooth ball and pulls away from the sides of the pan.",
    "Let the dough cool for five minutes, then briskly beat in the eggs, one at a time, until the dough is smooth and shiny. [At this point you can cover the pot and chill it in the fridge for up to a day.]",
    "Using two spoons, a piping bag fitted with a wide tip, a zip-lock bag with a one-inch corner cut off or a spring-loaded large cookie scoop, pipe or scoop the dough into walnut-sized mounds spaced evenly on the baking sheet.",
    "(If you find your dough to be a bit thin at this point, as you can see mine was in the photos, do not fret. They still puff just fine. And if they don’t, David says he sees bakeries all over Paris selling flat ones, so perhaps you’re just being trendy!)",
    "Brush the top of each mound with some of the egg glaze then press coarse sugar crystals or miniature chocolate chips over the top and sides of each mound. You want to be generous because the puffs will expand a lot, and you’ll want that area to be covered.",
    "Bake the cream puffs for 20 to 35 minutes, or until puffed and well-bronzed. (Yes, this is a rather long range in baking time but I know that in choux recipes especially, baking times can greatly vary depending on the heat of an oven and how fast it browns the top of items. Watch for that nicely bronzed color rather than a precise cooking time.)",
    "Do ahead: Sugar puffs are best the day that they’re made. I find if they’re stored overnight in an airtight container, they get damp on top and the sugar and chips will slide off, though you can easily re-crisp them in the oven If you can deal with them being a bit dryer on day two you can leave them out unwrapped. Chouquettes can also be frozen in a freezer bag for up to a month, and re-crisped in the oven once defrosted.In addition, you can store the unpiped/scooped dough in the fridge for up to a day.",
    "Places to buy sucre perlé or coarse white sugar: The Baker’s Catalogue, L’Epicerie, Ikea (!), Amazon and if you’re in New York City, the Cake and Baking Supply store on 22nd Street.",
    "I bought mine at G. Detou in Paris in October, tra-la-la, along with a vial of the fattest vanilla beans ever, more Dijon mustard than normal people would go through in a decade yet regrettably not the 3-kilo super low-priced box of Valrhona cocoa, because I had no room left in my suitcase. And yes, I am still kicking myself."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sugar-puffs1.jpg?w=500",
  "ingredient_list": [
    "1 cup (250 ml) water",
    "1/2 teaspoon salt",
    "1 tablespoon sugar",
    "6 tablespoons (90 grams) unsalted butter, cut into small chunks",
    "1 cup (135 gram) flour",
    "4 large eggs, at room temperature"
  ],
  "tags": [
    "Cookie",
    "French",
    "Photo"
  ],
  "title": "sugar puffs",
  "url": "https://smittenkitchen.com/2009/01/sugar-puffs/"
}