{
  "date": "2010-02-21T22:08:26+00:00",
  "directions": [
    "Preheat the oven to 350&#176F. Line an 8″ x 8″ x 2″ pan in one direction with parchment paper, allowing it to go up the opposing sides. Lightly grease the parchment paper and the exposed pan, or coat with a non-stick spray. ",
    "Stir together all the dry ingredients, including the fruit and nuts. In a separate bowl, whisk together the vanilla, melted butter or oil, liquid sweeteners and water. Toss the wet ingredients with the dry (and peanut butter, if you’re using it) until the mixture is evenly crumbly. Spread in the prepared pan, pressing them in firmly to ensure they are molded to the shape of the pan. (A piece of plastic wrap can help with this, as you press down on the back of it.)",
    "Bake the bars for 30 to 40 minutes, until they’re brown around the edges — don’t be afraid to get a little color on the tops too. They’ll still seem soft and almost underbaked when you press into the center of the pan but do not worry, they’ll set completely once completely cool.",
    "Cool the bars in their pan completely on a cooling rack. (Alternately, after about 20 minutes you can use your parchment “sling” to lift and remove the bars, and place them in their paper on the rack to cool the rest of the way. This can speed the process up.)",
    "Once cool, a serrated knife (or bench knife) to cut the bars into squares. [Updating to note, as many had crumbling issues:] If bars seem crumbly, chill the pan of them further in the fridge for 30 minutes which will fully set the “glue”, then cut them cold. To store, wrap the bars individually in plastic or stack them in an airtight container. In humid weather, it’s best to store bars in the refrigerator. They also freeze well.",
    "*Suggestions: Dried cranberries, apricots, pecans, sunflower seeds, coconut, walnuts, sesame seeds, pepitas, dried pples or even chocolate chips. My mix: 1/2 cup wheat germ, 1 cup dried cherries, 1 cup walnuts, 1/2 cup pecans and 1/2 cup dried unsweetened coconut flakes. Because my pieces were all pretty coarse, I pulsed them in the food processor a few times to break it up a little, though this isn’t necessary if you don’t mind yours chunkier."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/02/thick-chew-granola-bars.jpg?w=753",
  "ingredient_list": [
    "1 2/3 cups quick rolled oats (if gluten-free, be sure to use gluten-free oats)",
    "1/2 to 3/4 cup granulated sugar (use more for a sweetness akin to most purchased bars; use less for a mildly sweet bar)",
    "1/3 cup oat flour (or 1/3 cup oats, processed till finely ground in a food processor or blender)",
    "1/2 teaspoon salt",
    "1/4 teaspoon ground cinnamon",
    "2 to 3 cups dried fruits and nuts (total of 10 to 15 ounces)*",
    "1/3 cup peanut butter or another nut butter (I used almond butter) (optional)",
    "1 teaspoon vanilla extract (optional, namely because I was not convinced that the flavor came through)",
    "6 tablespoons melted butter",
    "1/4 cup honey, maple syrup or corn syrup",
    "2 tablespoons light corn syrup (see Note above)",
    "1 tablespoon water"
  ],
  "tags": [
    "Breakfast",
    "Coconut",
    "Freezer Friendly",
    "Gluten-Free",
    "Photo"
  ],
  "title": "thick, chewy granola bars",
  "url": "https://smittenkitchen.com/2010/02/thick-chewy-granola-bars/"
}