{
  "date": "2009-07-18T13:17:07+00:00",
  "directions": [
    "Prepare pie dough: Roll out pie dough (look!: a tutorial) to about 1/8-inch thick and fit into a regular (not deep dish) pie plate, 9 1/2 to 10 inches in diameter. Trim edge to 1/2 inch; fold under and crimp as desired. Pierce bottom of dough all over with a fork. Transfer to freezer for 30 minutes. Preheat oven to 400°F right before you take it out.",
    "Make streusel: Stir confectioners’ sugar, baking powder, salt and three tablespoons flour together in a small bowl. Add bits of cold butter, and either using a fork, pastry blender or your fingertips, work them into the flour mixture until it resembles coarse crumbs. Add additional flour as needed; I needed to almost double it to get the mixture crumbly, but my kitchen is excessively warm and the butter wanted to melt. Set aside.",
    "Par-bake crust: Tightly press a piece of aluminum foil against frozen pie crust. From here, you ought to fill the shell with pie weights or dried beans, or you can wing it like certainly lazy people we know, hoping the foil will be enough to keep the crust shape in place. Bake for 10 minutes, then remove carefully remove foil and any weights you have used, press any bubbled-up spots in with the back of a spoon, and return the crust to the oven for another 5 to 8 minutes, or until it is lightly golden brown. Transfer to a wire rack to cool slightly. Reduce oven temperature to 375°F. ",
    "[P.S. If you’re not overly-concerned about “soggy bottoms” (in the words of Julia Child) you can save time by skipping the par-baking step. Given the light nature of the filling, odds are good that it would not become excessively damp even without the parbake.]",
    "Make the filling: Sprinkle quartered peaches with sugar (two tablespoons will make a just-barely-sweeteened pie; add the other two for a still not overly-sweet but sweeter pie) and salt. Let sit for 10 minutes. Spread two tablespoons crème fraîche in bottom of par-baked pie shell, sprinkle with one-third of the streusel and fan the peach quarters decoratively on top. Dot the remaining three tablespoons of crème fraîche on the peaches and sprinkle with remaining streusel.",
    "Bake the pie: Until the crème fraîche is bubble and the streusel is golden brown, about 50 minutes. Cover edge of crust with a strip of foil if it browns too quickly. Let cool on a wire rack at least 15 minutes before serving.",
    "I stored this in the fridge, due to the crème fraîche, and found that I liked it even better cold, with the flavors better married.",
    "* Make your own crème fraîche: It’s true! You can make a version of it at home, using these instructions."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/peach-and-creme-fraiche-pie.jpg?w=753",
  "ingredient_list": [
    "Streusel",
    "1/4 cup confectioners’ sugar",
    "1/4 teaspoon baking powder",
    "Pinch of salt",
    "3 to 6 tablespoons all-purpose flour (I needed the latter amount to get this into a crumble)",
    "1/4 cup cold (1/2 stick) unsalted butter, cut into pieces",
    "Filling",
    "1 1/2 pounds ripe (4 to 5 medium) yellow peaches, pitted and quartered",
    "2 to 4 tablespoons granulated sugar",
    "Pinch of salt",
    "5 tablespoons crème fraîche*"
  ],
  "tags": [
    "Fruit",
    "Peach",
    "Photo",
    "Summer",
    "Tarts/Pies"
  ],
  "title": "peach and crème fraîche pie",
  "url": "https://smittenkitchen.com/2009/07/peach-and-creme-fraiche-pie/"
}