{
  "date": "2008-06-04T22:21:42+00:00",
  "directions": [
    "1. Combine flour, 1/2 teaspoon salt, sugar, and yeast in the bowl of an electric mixer, and slowly add 1 cup cold water. Mix on low speed until ingredients begin to combine. Switch to a dough hook and continue to mix for about 10 minutes until the dough is smooth and elastic and cleanly pulls away from the sides of the mixing bowl.",
    "2. Place dough in an oiled bowl, and allow to rest for 2 to 4 hours until it has doubled in size. Split the dough into halves, and form each into a log. Place each log on a generously floured surface, and allow it to rest until the formed dough doubles in size again, at least 1 hour.",
    "3. While the dough rises for the second time, repare the potato topping. Slice potatoes very thin using a knife or a mandoline. Then soak them in several changes of ice water to remove excess starch and prevent discoloration. Drain slices in a colander, toss with 1/2 teaspoon salt, and set aside for 10 minutes. Drain any accumulated water. In a medium bowl, combine potatoes, onions, and 1 tablespoon olive oil, and set aside.",
    "4. Preheat oven to 450 degrees. Prepare two rimmed baking sheets with vegetable oil. Divide dough in half. Place each piece on its own baking sheet. Using the palms of your hands, flatten dough out to the edges of the pan. Evenly spread potatoes over the surface of the dough up to the very edge, or about 1 inch from the edge if you desire a crust on your pizza. Season with remaining 1/2 teaspoon salt and remaining 3 tablespoons olive oil. Sprinkle with rosemary if using.",
    "5. Bake potato pizza until it has shrunk away from the edges of a pan and the bottom is golden brown, about 20 minutes. Remove from oven, and allow to cool slightly; slice into pieces, and serve. Potato pizza is also delicious served at room temperature."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/jim-laheys-potato-pizza1.jpg?w=500",
  "ingredient_list": [
    "3 cups all-purpose flour",
    "1 1/2 teaspoons salt",
    "3/4 teaspoon sugar",
    "1 cup cold water",
    "Olive oil, for bowl and pans",
    "1 teaspoon instant dry yeast",
    "2 potatoes, thinly sliced (about 2 cups) [I used Yukon Golds, and I believe this is what Lahey uses as well]",
    "1/2 onion, diced into 1/4- to 1/2-inch pieces",
    "4 tablespoons extra-virgin olive oil",
    "Fresh rosemary (optional)"
  ],
  "tags": [
    "Photo",
    "Pizza",
    "Potatoes"
  ],
  "title": "jim lahey’s potato pizza",
  "url": "https://smittenkitchen.com/2008/06/jim-laheys-potato-pizza/"
}