{
  "date": "2008-05-19T11:27:37+00:00",
  "directions": [
    "Preheat the oven to 400°F (200°C). Line a baking sheet with parchment paper. Clear a large work surface for this, big enough for two full sheets of phllyo, your egg wash, parmesan and filling–trust me, you’ll need it.",
    "Make the filling: Make sure the mushrooms are dust- and sand-free, wash if necessary, and trim if need be. Cook the onion in the butter and, when soft, add the mushrooms with the nutmeg. Saute for 5 to 7 minutes, until liquid has been released and has partially evaporated. Add the sherry and evaporate the alcohol by cooking over low heat for 2 to 3 minutes. Stir in the flour, herbs, and some salt and pepper, and let cool. The mixture will be moist.",
    "To make small, triangular strudel: Take one sheet of phyllo at a time from their package; cover the remaining sheets with plastic and then a damp towel, ensuring they are completely covered. Brush one half of the sheet lengthwise with butter. Fold the unbuttered side over the buttered side, carefully, smoothing out any wrinkles and bubbles but not worrying if you can’t get them all. Again, brush one half of this lengthwise (a few inch-wide column) with butter, and fold the unbuttered side over it again. You’ll end up with one long column.",
    "Dollop a spoonful of the mushroom filling near the end and sprinkle a teaspoon of parmesan over it. Begin folding one bottom corner of the phyllo strip over the filling until it meets the opposite edge, forming a triangle, as if you were folding a flag. Place the triangle seam side down on the baking sheet, brush lightly with egg wash and sprinkle with parmesan.",
    "Bake in the preheated oven for 15 minutes. Serve warm.",
    "To make four larger strudel: Take 3 sheets of phyllo at a time from their package; cover the remaining sheets with plastic and then a damp towel, ensuring they are completely covered. Brush 1 sheet on both sides with melted butter, then place it on top of another sheet, and cover with a third. Repeat 3 times, to make 4 stacks of triple-layer phyllo.",
    "Lay one of the 4 stacks of phyllo on the parchment-lined baking sheet. Brush the edges with beaten egg. Put one-fourth of the mushroom mixture on the center of the phyllo and add 1 tablespoon Parmesan. Fold in the sides, then fold over and over into a neat parcel. Brush with beaten egg, turn over very carefully so that the seam is on the bottom, and brush with egg again. Repeat to make 3 more strudels.",
    "Bake in the preheated oven for 15 minutes. Serve warm."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-streudels1.jpg?w=500",
  "ingredient_list": [
    "12 to 18 sheets phyllo pastry (12 to make four large strudel, 18 to make smaller triangles)",
    "1/4 to 1/2 cup butter, melted (1/4 cup to make large strudel, 1/2 cup to make smaller triangles; alternately, you could use olive oil for a different flavor profile)",
    "1 egg, beaten (for large strudel; I did not see the need to seal the small ones)",
    "1 pound mixed, fresh, wild and cultivated mushrooms (we used only creminis, and ended up with plenty of flavor. If you omit the stems, start with 1.5 pounds)",
    "1 medium onion, minced",
    "3 tablespoons butter",
    "Freshly grated nutmeg (optional, we skipped it)",
    "1 tablespoon dry sherry",
    "1 tablespoon all-purpose flour",
    "Leaves from 1 sprig marjoram or thyme",
    "4 to 6 tablespoons freshly grated Parmesan, plus extra for sprinkling, if you wish (the latter amount for the minis)",
    "Salt and pepper to taste"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Mushrooms",
    "Photo",
    "Tarts/Quiche",
    "Vegetarian"
  ],
  "title": "mushroom strudel",
  "url": "https://smittenkitchen.com/2008/05/mushroom-streudels/"
}