{
  "date": "2014-01-06T12:15:51+00:00",
  "directions": [
    "Beans: I used cannelini beans for this the first time, but I spied some of Rancho Gordo’s Yellow-Eye beans in my cabinet (which are a great swap for white beans, wherever you use them) and had to use them instead, as it was just a day or two after New Years and I hadn’t gotten my black-eyed pea fix. The only downside of using a non-white bean such as this is that if you want to add the bean broth to your soup, it will change the color to something even less pretty.",
    "How to cook dried beans: I promise, a separate post is coming on this. In the meanwhile, if you have time to soak your beans (cover them with way more water in a bigger bowl than you think you’ll need and leave them to soak for 8 hours or up to 24), do it, I find that it cuts stovetop time in half, or at least down by 1 hour. I dump it, soaking liquid and all, into a heavy pot, add more water (plus any aromatics you’d want, herbs, bay leaves, spice, onions, or garlic, but hold off on the salt for now) and bring the pot to a full boil. Boil it for one full minute, skimming any foam or, ahem, “scum” that floats, then reduce the heat to the lowest simmer possible, checking it from time to time and adding more liquid if needed. Your beans, depending on variety/age/if you soaked them, will take 1 to 3 hours to cook from here. My soaked-overnight white beans took just 1 hour. Once they are mostly softened, you can add salt to taste. Store them in their cooking liquid, which you should seriously consider adding to any/all soups as extra broth. Don’t dump all the flavor down the drain. I’ve also cooked beans many times, usually without bothering to soak, in a slow-cooker, for anywhere from 2 1/2 to 5 hours on HIGH (or longer on LOW). Yes, it takes longer, but the beauty of the slow-cooker is that it’s hands-off, while a stovetop needs to be somewhat monitored.",
    "Not technically vegetarian: Strict vegetarians do not eat Parmesan as calf rennet is used in production. (More here.)"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/parmesan-broth-with-kale-and-white-beans1.jpg?w=500",
  "ingredient_list": [
    "Broth",
    "8 ounces cheese rinds, any paper at the ends removed",
    "6 cups water",
    "1 large onion, peeled and quartered",
    "3 cloves garlic, peeled and smashed",
    "1/2 teaspoon whole peppercorns",
    "Handful of flat-leaf parsley",
    "Salt, to taste",
    "To serve",
    "2 to 3 ounces tuscan kale (also known as black or lacinato kale; this is the thinner, flatter leaf variety), washed and patted dry (updated measurement)",
    "1 1/4 cups cooked white beans (from about 1/4 pound dried), with their cooking liquid if fresh (usually about 1 1/2 cups) (updated measurement)",
    "Thin slices of baguette, toasted",
    "Olive oil and parmesan for serving"
  ],
  "tags": [
    "Announcements",
    "Appetizers + Party Snacks",
    "Beans",
    "Italian",
    "Kale",
    "Photo",
    "Soup"
  ],
  "title": "parmesan broth with kale and white beans",
  "url": "https://smittenkitchen.com/2014/01/parmesan-broth-with-kale-and-white-beans/"
}