{
  "date": "2010-03-17T11:26:41+00:00",
  "directions": [
    "Place a large saucepan over medium heat and add half the olive oil. When it is hot, add the spinach with a pinch of salt (in batches, if necessary) and stir well. Remove when the leaves are just tender, drain in a colander and set aside.",
    "Heat 2 more tablespoons olive oil in a frying pan over medium heat. Fry the bread for about 5 minutes or until golden brown all over, then the remaining tablespoon of oil and the garlic, cumin and pepper. Cook for 1 minute more or until the garlic is nutty brown.",
    "Transfer to a food processor, blender or mortar and pestle along with the vinegar, and mash to a paste. Return the mixture to the pan and add the drained chickpeas and tomato sauce. Stir until the chickpeas have absorbed the flavors and are hot. Season with salt and pepper.",
    "If the consistency is a little thick, add some water. Add the spinach and cook until it is hot. Check for seasoning and serve with paprika on top, or on fried bread toasts (as the Spanish do).",
    "* I make all of my dried beans in the slow-cooker these days. They are perfect every time, and the flavor of fresh beans — even the sad-looking ones from grocery store bins I used — is incomparable. No presoaking, just cover them 2 to 3 inches of water and cook them 3 hours on high. (I have learned that cooking time can vary widely in slow-cookers so allot more time than you might need. I often make mine in the day or days before and let them cool in their cooking water, which is then by then very flavorful.)",
    "** This might be my favorite ingredient on earth — it’s amazing on eggs and potatoes, too. If you can’t find it locally, Amazon and Penzeys are among a bunch of places that sell it online."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/03/spinach-and-chickpeas.jpg?w=752",
  "ingredient_list": [
    "1/2 pound (230 grams) dried chickpeas, cooked until soft and tender* or two 15-ounce cans of chickpeas, drained and rinsed",
    "6 tablespoon olive oil",
    "1 pound (450 grams) spinach, washed",
    "A hefty 1-inch slice from a country loaf or about 2 slices from sandwich loaf bread (2.5 ounces or 75 grams), crusts removed and cut inset small cubes",
    "1/2 cup (4 ounces) tomato sauce (I used canned stuff I keep around)",
    "3 garlic cloves, thinly sliced",
    "1/2 teaspoon ground cumin",
    "Pinch of red pepper flakes",
    "1 1/2 tablespoons red wine vinegar",
    "1/2 teaspoon smoked paprika**",
    "Salt and freshly ground black pepper",
    "Lemon juice, to taste"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Beans",
    "Photo",
    "Put An Egg On It",
    "Spanish",
    "Spinach",
    "Vegan",
    "Vegetarian"
  ],
  "title": "spinach and chickpeas",
  "url": "https://smittenkitchen.com/2010/03/spinach-and-chickpeas/"
}