{
  "date": "2012-08-30T22:06:46+00:00",
  "directions": [
    "In a small saucepan, combine your milk and vanilla bean flecks (if using extract instead, don’t add it yet). Heat the mixture until it is warm, then set aside. You can also do this in a microwave. If your saucepan or microwave dish has a small spout, even better.",
    "In the bottom of a small saucepan, off the heat, beat or whisk your egg yolks and 1/4 cup sugar together vigorously, until it pales in color and a ribbon of batter falls off your whisk when you lift it from the bowl; this will take a few minutes by hand, and likely just one minute with an electric mixer. Whisk in the flour until fully incorporated.",
    "Whisking the whole time, drizzle the warm vanilla-milk mixture into the egg yolk mixture, just a tiny bit at a time at first. Once you’ve added about 1/4 of the milk, you can add the rest in a thin stream, whisking constantly. ",
    "Bring the saucepan to your stove and heat it over medium-high heat, whisking constantly, until it begins to bubble. Once bubbling, whisk it for 1 to 2 more minutes, then remove it from the heat. Immediately stir in vanilla extract (if using) and butter until combined. [Updated to add] As a final step for a perfectly smooth and silky custard, you can press the mixture through a fine-mesh strainer. You can also skip this step if you’re not terribly concerned about an imperfect custard.",
    "To cool your custard quickly, place the saucepan in a larger bowl of ice water that will go halfway up the sides of the saucepan (i.e. water should not spill in) and stir the custard until lukewarm, then divide among serving dishes or ramekins. You can also pour it into serving dishes or ramekins still hot, but you should then press a film of plastic wrap against each custard in the fridge so it doesn’t form a pudding skin. Custards keep in fridge for up to 4 days.",
    "To serve: Preheat oven to 450°F. Place blueberries in a heatproof, shallow roasting dish and sprinkle with 1 1/2 teaspoons sugar. Roast in oven for 12 to 15 minutes, rolling around once or twice during cooking time to ensure they roast evenly. The goal is not to let the blueberries fully slump or turn to sauce; you just want a little trickle of juices puddled across in the bottom. Squeeze a bit of lemon juice over berries the second they come out of the oven and roll them back and forth to evenly incorporate it. Spoon hot roasted blueberries and some of their juices over each custard. Eat immediately, passing any extra roasted blueberries alongside."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2012/08/vanilla-custards-with-roasted-blueberries.jpg?w=750",
  "ingredient_list": [
    "Custards",
    "1 cup whole milk",
    "Seeds from 1/4 to 1/2 vanilla bean (see Note) or 1 teaspoon pure vanilla extract",
    "3 large egg yolks",
    "1/4 cup granulated sugar",
    "3 tablespoons all-purpose flour",
    "1 to 2 tablespoons (see Note) unsalted butter",
    "Berries",
    "1 cup blueberries",
    "1 1/2 teaspoons granulated sugar",
    "Juice from a wedge lemon, or to taste"
  ],
  "tags": [
    "Blueberries",
    "Photo",
    "Pudding",
    "Summer"
  ],
  "title": "vanilla custards with roasted blueberries",
  "url": "https://smittenkitchen.com/2012/08/vanilla-custards-with-roasted-blueberries/"
}