{
  "date": "2016-11-28T13:12:54+00:00",
  "directions": [
    "Make crust: In a food processor, blend flour and salt together. Add butter and pulse machine until butter is reduced to a fine meal, or couscous-sized bits. While running machine, drizzle in water; stop when dough has balled, a few seconds later.\nWrap dough in plastic or waxed paper and set in freezer to quick-chill until firm but not rock-hard, about 15 to 20 minutes. You can also chill it in the fridge for 2 hours or up to 1 week until needed.\nLightly coat a 9×13-inch (quarter-sheet) pan with oil. Line bottom with parchment paper.\nTo roll out crust (trickier, but go for it if you’re up for the challenge): Flour your counter well. Remove crust from freezer or fridge, unwrap and flour the top of it. Even if it’s very hard, begin rolling it very gently, in light motions, so it doesn’t crack too much as you stretch it out, to about a 12×16-inch rectangle. Keep flouring top and counter underneath dough as it is prone to sticking. Work as quickly as possible because this dough softens even more than regular pie dough as it warms.\nTransfer dough to prepared pan. Lift overhang to let dough slack/droop into corners so you’re not stretching it a lot to shape it to the pan. Trim overhang to 1/2- to 1-inch, then fold overhang onto sides of dough, pressing all around and letting the dough extend slightly over the edge of the pan.\nTo press in crust (less tricky, and what I always wish I’d done): Press dough in an even layer across bottom of pan; leave it thicker as it goes up the sides; pressing all around and letting the dough extend slightly over the edge of the pan.\nBoth methods: Freeze shaped dough until solid, about 20 minutes. Save your scraps! You can use them to patch any holes or cracks formed when baking.\nMeanwhile, heat oven to 425 degrees F. Coat a large sheet of foil lightly with spray oil. Once crust is solid, prick it all over with a fork and press foil, oiled side down, tightly against dough. Fill foiled crust to the top with pie weights, dried beans or rice (that you don’t plan to eat at any time) or even pennies. Bake for 20 minutes then gently, carefully remove foil and weights and bake for 5 more minutes, unfilled.\nWhile crust par-bakes, make filling: Use an electric mixer or your best whisking skills to beat cream cheese in the bottom of a large bowl until smooth and fluffy. Gradually drizzle in half-and-half, whisking the whole time so that the mixture incorporates smoothly. Whisk in eggs, two at a time, until combined. Squeeze out spinach in handfuls, removing as much extra moisture as possible. Stir in spinach, cheddar, parmesan, scallions, salt and pepper.\nWhen crust has finished parbaking, leave oven on. Inspect crust for cracks or holes and use reserved dough to patch them if necessary. Pour in filling just to the top of the crust. You will probably have about 3/4 cup more filling than you can fit in the crust (not an issue if going crust-less or if you didn’t parbake the crust); you can bake this off in a separate oiled dish for an excellent breakfast on toast tomorrow.\nBake quiche until crust is golden brown and filling is set, about 25 minutes. Cool at least 10 minutes before serving. Quiche keeps in fridge for 4 to 5 days."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/spinach-sheet-pan-quiche.jpg?w=750",
  "ingredient_list": [
    "1 2/3 cups (215 grams) all-purpose flour",
    "3/4 teaspoon kosher salt",
    "12 tablespoons (170 grams) cold unsalted butter, diced",
    "3 tablespoons (45 grams) very cold water",
    "Nonstick spray oil, for coating pan",
    "3/4 cup (176 grams, 6 ounces, or 3/4 of an 8-ounce brick) cream cheese, soft at room temperature",
    "2/3 cup (155 ml) half-and-half or 1/3 cup each whole milk and heavy cream",
    "6 large eggs",
    "2 10-ounce (283-gram) packages frozen chopped spinach, thawed",
    "1 cup (115 grams or 4 ounces) grated cheddar or gruyere",
    "1/2 cup (50 grams) finely grated Parmesan",
    "1 small bundle (2 to 3 ounces or about 8 thin green onions) thinly sliced",
    "1 teaspoon kosher salt",
    "1/2 teaspoon freshly ground black pepper"
  ],
  "tags": [
    "Breakfast",
    "Casserole",
    "Lunch",
    "Photo",
    "Picnics",
    "Spinach",
    "Tarts/Quiche",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "spinach sheet pan quiche",
  "url": "https://smittenkitchen.com/2016/11/spinach-sheet-pan-quiche/"
}