{
  "date": "2010-10-30T10:17:59+00:00",
  "directions": [
    "Make the filling: In the bowl of an electric mixer, beat the cream cheese and peanut butter together until combined. Add the graham cracker crumbs and beat for 10 seconds. Add the sugar and butter, and mix on the lowest speed until it stops floating off everywhere, then increase the speed until the ingredients are combined. Scrape down the whole bowl well, then mix again. The mixture will be quite sturdy and a little dry — perfect for shaping. Set it aside while you prepare the coating.",
    "Make the coating: Melt the chocolate either over a double boiler, stirring until it is completely smooth or in a microwave in 30 then 10 second increments, stirring before you start it again until it is completely smooth. Let it cool to tepid (about 100 degrees, though I’d go a little cooler next time for a thicker coating; I had a few ounces of chocolate leftover) while you shape the peanut butter centers. [Alternately, you can temper the chocolate (fairly simply instructions here) for a perfect showy finish.]",
    "Assemble the candies: Line a sheet pan with parchment paper. Scoop out slightly more than one tablespoon’s worth of filling (their suggestion; I used a scoop that made them a little smaller) and use your hands to form it into a ball. Place the ball on the prepared sheet and repeat the process until all of the candies have been shaped. They can sit close to each other but make sure they are not touching.",
    "Using a fork or large skewer, dip each ball into the chocolate and roll it about so that almost the entire candy is coating, leaving a small circle uncoated. Play around with a few practice pieces; I found it easiest to stick the skewer in the side, angle the bowl I was using towards it and make sure it became submerged as I rolled the candy around. But don’t fuss too much; even the “ugly” ones won’t go to waste.",
    "Chill the buckeyes until they are set, about 30 minutes.",
    "Do ahead: Buckeyes will keep in the fridge for what the book says is 3 days, but I’d say at least a week, should you keep them in a lockbox and hide the key."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/buckeyes.jpg?w=749",
  "ingredient_list": [
    "1/4 cup (2 ounces or 55 grams) cream cheese, softened",
    "1 1/2 cups (190 grams) peanut butter (I use smooth, but you can use chunky if you are looking for more texture) (previous weight was 145 grams, which is too low)",
    "1 cup (about 130 grams) graham cracker crumbs (from about 14 graham crackers)",
    "Salt (optional, see note up top)",
    "3 cups (360 grams) confectioners’ (powdered) sugar",
    "10 tablespoons (5 ounces or 140 grams) unsalted butter, melted and cooled",
    "12 ounces (340 grams) dark chocolate (60 to 72%), coarsely chopped"
  ],
  "tags": [
    "Candy",
    "Chocolate",
    "Peanut Butter",
    "Photo"
  ],
  "title": "buckeyes",
  "url": "https://smittenkitchen.com/2010/10/buckeyes/"
}