{
  "date": "2015-06-11T11:32:08+00:00",
  "directions": [
    "In a large bowl, combine flour, cornmeal, sugar, baking powder, baking soda and salt with a whisk. Melt 3 tablespoons butter in the bottom of a medium bowl, then whisk in buttermilk, followed by the eggs, one at a time. Stir in strawberries. Pour strawberry-buttermilk mixture into dry ingredients and stir until just combined.",
    "In a large skillet (cast-iron is my favorite for pancakes), melt butter over medium/medium-low heat. Pour a scant 1/4 cup batter into skillet for each pancake. Cook until bottoms are golden and bubbles appear all over top, about 1 to 2 minutes. Flip pancakes and cook until second side is golden, another minute. If batter slipped out the sides of the pancake when you first flipped it, return it to the first side for another 30 seconds to ensure the leaked batter cooks. Repeat with remaining batter, adding more butter as needed. If pan gets too hot — the butter turns brown as soon as it melts, the pancakes are done on the outside before the inside — reduce the heat to low.",
    "If you’re not going to eat these right away, you can spread them on a baking sheet and keep them warm until needed in a 200 degree oven.",
    "Serve with fixings of your choice, be it a pat of butter, powdered sugar, syrup and/or additional fresh strawberries."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/strawberry-cornmeal-griddle-cakes1.jpg?w=640",
  "ingredient_list": [
    "3/4 cup (95 grams) all-purpose flour",
    "3/4 cup (105 grams) yellow cornmeal",
    "2 tablespoons (25 grams) granulated sugar",
    "1/2 teaspoon baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon fine sea or table salt",
    "3 tablespoons (45 grams) unsalted butter, plus more for buttering skillet",
    "1 cup (235 ml) buttermilk, well-shaken, or 2/3 cup plain yogurt thinned with 1/3 cup milk",
    "2 large eggs",
    "1 cup (about 140 grams or 5 ounces) roughly chopped strawberries"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Pancakes",
    "Photo",
    "Strawberries",
    "Summer"
  ],
  "title": "strawberry cornmeal griddle cakes",
  "url": "https://smittenkitchen.com/2015/06/strawberry-cornmeal-griddle-cakes/"
}