{
  "date": "2017-05-11T12:06:42+00:00",
  "directions": [
    "Heat oven to 225 degrees F and place a large baking sheet inside.\nMelt butter halfway in the bottom of a large bowl then whisk in sugar. This should leave the mixture lukewarm, not piping hot, but if it still is, let it cool slightly before adding the egg. Whisk in egg and vanilla, then 1/2 cup plus 2 tablespoons of the buttermilk. Whisk in salt and baking soda until fully combined, scrape down bowl, then stir in flour until it just disappears. You’re looking for a thick mixture, more like a very soft cookie dough than a pourable batter, but if it’s very stiff, add 1 to 2 more tablespoons of the remaining buttermilk and stir until combined.\nHeat griddle or frying pan over medium. Once hot, add a good pat of butter (please don’t skimp; butter makes crispy edges) and dollop in small mounds of pancake batter — I find a #40 or 1.5 tablespoon scoop to make this even easier and neater. Try to resist the urge to press the mounds into flat puddles; a little nudge is okay but we’d much rather keep the height here. Once bubbles form on top, lift a corner of each pancake and check for it to be lightly browned before flipping it.",
    "At this point, I like to reduce the heat to medium-low for the remainder of the cooking time. I’d rather the pancakes take a minute longer than singe dark as soon as they hit the pan, but your stove will vary.\nOnce pancakes are golden brown on the second side, and do not worry if the tall sides look raw, this is completely expected, just transfer them to heated oven. Repeat with remaining batter. Tall, thick pancakes like this almost always hide pockets of uncooked batter; 5 minutes in the oven will fix this. You can leave them in the oven for much longer, however, if you now wish to rinse berries and make coffee (which of course you do)."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/tall-fluffy-buttermilk-pancakes.jpg?w=750",
  "ingredient_list": [
    "2 tablespoons (30 grams) unsalted butter, plus more for pan",
    "2 tablespoons (25 grams) granulated sugar",
    "1 large egg",
    "1/4 teaspoon vanilla extract",
    "1/2 cup plus 2 to 4 tablespoons buttermilk",
    "1/4 teaspoon fine sea or table salt",
    "1/2 teaspoon baking soda",
    "1 cup (130 grams) all-purpose flour"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Pancakes",
    "Photo",
    "Quick"
  ],
  "title": "tall, fluffy buttermilk pancakes",
  "url": "https://smittenkitchen.com/2017/05/tall-fluffy-buttermilk-pancakes/"
}