[
    {
        "ingredient_list": [
            "6 cups torn chunks French, sourdough or country loaf, torn into bits (I use 2 7-ounce demi-baguettes)", 
            "5 tablespoons unsalted butter", 
            "1 large Spanish or sweet onion, chopped small", 
            "1 large or 2 small stalks celery, diced small", 
            "1 teaspoon chopped fresh thyme leaves", 
            "1/2 teaspoon table salt, plus more to taste", 
            "Freshly ground black pepper", 
            "1 large or 2 small firm, tart tart apples, such as Granny Smith, peeled, cored and diced small", 
            "1/4 cup roughly chopped flat-leaf parsley", 
            "3 sage leaves, minced", 
            "1/2 to 1 cup cup turkey, chicken or vegetable stock or broth", 
            "1 large egg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/apple-herb-stuffing-for-all-seasons1.jpg?w=640", 
        "tags": [
            "Apple", 
            "Bread", 
            "Celery", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2013/11/apple-and-herb-stuffing-for-all-seasons/", 
        "title": "apple-herb stuffing for all seasons", 
        "directions": [
            "Position rack in center of oven and preheat to 350°F. Spread bread cubes in single layer on large rimmed baking sheet. Bake until pale golden, stirring occasionally, 10 to 15 minutes. Let cool in pan while you prepare the other ingredients. ", 
            "Generously butter a 2-quart baking dish (a 9×5-inch loaf, 8- or 9-inch square dish, etc.) with 1 tablespoon butter. Melt remaining 4 tablespoons butter in large skillet over medium heat. Add onion, thyme, salt and lots of freshly ground black pepper and cook for 2 minutes, until becoming translucent. Add celery and cook for 2 more minutes. Add apple and saute until a bit tender, 3 to 4 minutes more. ", 
            "Place bread in large mixing bowl. Scrape contents of skillet on top. Whisk egg and 1/2 cup broth or stock together and pour over. Stir in parsley and sage. Spoon into prepared pan. If mixture looks a little dry, pour remaining 1/2 cup broth over it. [This is a good place to pause, if needed. Nothing bad comes of the stuffing absorbing the liquids for longer.] Bake for 30 to 40 minutes, until brown on top and no liquid appears if you insert a knife vertically into the center of the stuffing pan and turn it slightly. Serve immediately, or reheat as needed.", 
            "* On a technical note, I insist upon calling stuffing what is actually dressing, even though I know it is wrong. Although they use the same recipes, stuffing goes inside the bird, dressing is baked outside, and I insist that it is better outside the bird. When making stuffing to, uh, stuff, uh, places, one must cook the bird to a higher-than-normal temperature to ensure that the stuffing inside is free from undercooked poultry drippings. Seeing as most turkey is dry enough, I see no point in helping it along. ", 
            "Variations:"
        ], 
        "date": "2013-11-19T12:04:08+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/caponata1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Celery", 
            "Eggplant", 
            "Italian", 
            "Photo", 
            "Put An Egg On It", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/09/caponata/", 
        "title": "caponata", 
        "directions": [
            "In a large skillet (12 inches is ideal), heat oil over medium-high heat. Once very hot, working in batches, fry eggplant cubes in one layer at a time, stirring and turning occasionally until golden brown, about 3 to 5 minutes. Use a slotted spoon to drain eggplant over skillet, then transfer to a paper towel-lined plate and immediately season with salt. Repeat with remaining eggplant. Transfer drained and mostly cooled eggplant to a large bowl.", 
            "Pour off all but 3 tablespoons olive oil, and reserve the rest for another use. Cook onions and and celery with salt and pepper over medium-high heat until beginning to brown, about 10 minutes. Reduce heat to medium, add tomato paste and water and cook, stirring, until caramelized and almost evaporated, 2 minutes. Reduce heat to medium and add crushed tomatoes; cook for 10 minutes. Stir in olives, vinegar, raisins, capers, and sugar and cook, stirring occasionally, until thickened, about 15 minutes more. Transfer to bowl with eggplant, along with basil and pine nuts, and stir to combine. Season with salt and pepper to taste, and let cool to room temperature before serving. ", 
            "Do ahead: If you have time to spare, covering your cooling bowl of caponata with plastic and letting it sit for at least 2 hours gives an even more developed flavor. It’s even better on the second day. Keep it in the fridge and bring it out an hour before you plan to eat it to take the chill off. Caponata keeps for one week in the fridge."
        ], 
        "date": "2015-09-08T12:00:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup white wine vinegar", 
            "1/4 cup water", 
            "2 teaspoons Kosher salt (you can go up to 1 tablespoon if using the lighter weight Diamond brand; here’s why)", 
            "1 1/2 teaspoons granulated sugar", 
            "2 stalks celery, trimmed, diced tiny", 
            "4 large eggs", 
            "1 heaped teaspoon whole-grain Dijon", 
            "2 teaspoons minced shallot or red onion (or more to taste)", 
            "2 tablespoons mayonnaise or full-fat plain yogurt", 
            "Salt and freshly ground pepper to taste", 
            "Chopped flat-leaf parsley or fresh dill (to garnish, optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/02/egg-salad-with-pickled-celery-and-coarse-dijon.jpg?w=750", 
        "tags": [
            "Celery", 
            "Eggs", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/02/egg-salad-with-pickled-celery-and-coarse-dijon/", 
        "title": "egg salad with pickled celery and coarse dijon", 
        "directions": [
            "Pickle your celery: Combine vinegar, water, Kosher salt and sugar in a jar and shake it until the salt and sugar dissolve. Add diced celery to jar, cover it and place in the fridge for at least 30 minutes, ideally one hour and up to one week.", 
            "Cook your eggs: Place eggs in a saucepan and cover with an inch of cold water. Bring to a boil over high heat, and once boiling, reduce the heat to medium and set your timer for 10 minutes (for perfectly cooked through eggs), or 9 minutes (if you like them just-barely-set in the center, like mine above). Once the timer rings, drain eggs and rinse under cold water to stop cooking. To quickly chill them so you can use them right away, cover them in ice water for 10 to 15 minutes.", 
            "Make your salad: Peel your eggs and chop them, placing them in a medium bowl. Add 1 heaped tablespoon of pickled celery (more to taste), Dijon, shallot, mayo, salt and pepper and mix. Season to taste with salt and pepper. Serve on toasted whole grain bread, garnished with fresh herbs. "
        ], 
        "date": "2013-02-05T11:35:43+00:00"
    }, 
    {
        "ingredient_list": [
            "2 teaspoons fennel seeds, toasted", 
            "1/4 cup olive oil", 
            "3 tablespoons fresh lemon juice", 
            "3 tablespoons finely chopped shallot (1 large)", 
            "1 teaspoon salt", 
            "1/2 teaspoon sugar", 
            "1/2 pound frisée (French curly endive), torn into bite-size pieces (10 cups) [we swapped butter lettuce]", 
            "3 Belgian endives, cut crosswise into 1/2-inch-wide slices [we swapped regular green endives]", 
            "1 bunch of celery ribs, thinly sliced crosswise (1 to 2 cups, depending on the size of your bundle)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/endive-and-celery-salad-with-fennel-vinaigrette1.jpg?w=500", 
        "tags": [
            "Celery", 
            "Endive", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2009/05/endive-and-celery-salad-with-fennel-vinaigrette/", 
        "title": "endive and celery salad with fennel vinaigrette", 
        "directions": [
            "In addition: Either an electric coffee/spice grinder or exceptional skill crushing spices in a mortar and pestle", 
            "Grind fennel seeds in grinder until ground but not powdery. Transfer to a small bowl or cup, then stir in oil until combined. Let stand 15 minutes.", 
            "Whisk together lemon juice, shallot, salt, and sugar in another small bowl or cup until salt and sugar are dissolved. Stir fennel oil, then add to shallot mixture in a slow stream, whisking until combined.", 
            "Toss lettuces and celery in a large bowl with just enough vinaigrette to coat. Season with black pepper to taste.", 
            "Pairing: I think this salad would be fantastic with maybe some shards of your favorite hard cheese and a poached egg on top, should those of you out there not be at a point in your lives when runny yolks are verboten. (Sniffle.)"
        ], 
        "date": "2009-05-06T15:58:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large skin-on, bone-in chicken breast (about 12 to 14 ounces)", 
            "About 2 1/2 tablespoons olive oil", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "Salt and freshly ground black pepper", 
            "1 tablespoon white wine vinegar", 
            "1/2 small cucumber, such as a Persian variety, halved, thinly sliced", 
            "1 small celery rib, sliced thin", 
            "3 radishes, quartered lengthwise, sliced thin", 
            "1 scallion, sliced thin", 
            "1 tablespoon chopped dill, chives or parsley, or a mix, for garnish", 
            "3 tablespoons creme fraiche", 
            "1 1/2 teaspoons prepared horseradish, liquid drained off a little, plus more to taste", 
            "2 to 3 thin slices rye, pumpernickel or another dense health bread, toasted "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/spring-chicken-salad-toasts1.jpg?w=750", 
        "tags": [
            "Celery", 
            "Chicken", 
            "Cucumber", 
            "Photo", 
            "Radishes", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2016/03/spring-chicken-salad-toasts/", 
        "title": "spring chicken salad toasts", 
        "directions": [
            "Heat oven to 425°. Place chicken on a small rimmed baking sheet and rub with 1 tablespoon olive oil. Season with salt and pepper and roast until golden brown and cooked through, about 25 to 30 minutes. Let cool, then remove skin and bones and shred meat into bite-sized pieces. ", 
            "Place shredded chicken in a medium bowl and toss with 1 1/2 tablespoons olive oil, 1 tablespoon vinegar, 1/2 teaspoon kosher salt and freshly ground black pepper until evenly coated. Add cucumber, celery, radishes and scallion to salad and toss to combine. Adjust salt, pepper and vinegar to taste.", 
            "If you need horseradish crème fraîche\tin your life — I know I always do — combine crème fraîche, horseradish and a couple pinches salt in a small dish and stir to combine. ", 
            "Heap salad on 2 to 3 toasts (i.e. more on 2 or less on 3). Dollop with horseradish creme fraiche, if using, and garnish with herbs.", 
            "Do Ahead: Chicken can be cooked 2 days ahead; cover and chill. Shred just before using."
        ], 
        "date": "2016-03-28T12:00:20+00:00"
    }
]