{
  "date": "2008-10-26T20:17:15+00:00",
  "directions": [
    "1. Make pastry: In a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour.",
    "2. Prepare the filling: Heat the butter in a large skillet over medium heat. Add the onion, mushrooms, and herbs and cook until softened, about 10 minutes. Add the cabbage, 1 teaspoon salt, and 1/2 cup water. Cover and cook slowly until the cabbage is tender, 15 to 20 minutes, turning it occasionally. Add more liquid. When tender, uncover and raise the heat to evaporate any excess moisture. The mixture should be fairly dry. Stir in the parsley, egg, and sour cream. Season with vinegar and taste for salt and pepper.",
    "3. Assemble galette: Preheat the oven to 400» F. Roll the dough into a large thin circle and set it on the back of a sheet pan or cookie sheet. The edges will hang over the sides. Add the filling, making a mound 7 to 8 inches across, then fold the edges over and brush with the melted butter. Pour any extra butter into the vegetables. Bake until browned, 25 to 30 minutes. While it is baking, mix the horseradish and cream to form a sauce, and season to taste. When galette is done, carefully slide it onto a serving plate. Serve with the horseradish sauce on the side."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-and-mushroom-galette1.jpg?w=500",
  "ingredient_list": [
    "For the pastry",
    "1 1/4 cups all-purpose flour",
    "1/4 teaspoon salt",
    "8 tablespoons (1 stick) unsalted butter, cut into",
    "pieces",
    "1/4 cup sour cream",
    "2 teaspoons fresh lemon juice",
    "1/4 cup ice water",
    "For the filling",
    "2 tablespoons butter",
    "1 large onion, finely diced",
    "4 ounces fresh shiitake mushrooms, stems discarded, caps thinly diced",
    "1 teaspoon chopped thyme or 1/2 teaspoon dried",
    "1 teaspoon chopped tarragon or 1/2 teaspoon dried",
    "1 tablespoon chopped dill or 1 teaspoon dried",
    "6 cups thinly sliced cabbage, preferably Savoy, or 4 cups cabbage plus 2 cups other greens, such as beet, chard, or kale",
    "salt and freshly milled pepper",
    "1/4 cup chopped parsley",
    "1 hard-cooked egg, chopped",
    "1/4 cup sour cream or yogurt",
    "1 teaspoon tarragon vinegar",
    "2 tablespoons melted butter",
    "For the horseradish sauce",
    "1/4 cup prepared horseradish",
    "1 cup yogurt or sour cream"
  ],
  "tags": [
    "Cabbage",
    "Mushrooms",
    "Photo",
    "Tarts/Quiche",
    "Vegetarian"
  ],
  "title": "cabbage and mushroom galette",
  "url": "https://smittenkitchen.com/2008/10/cabbage-and-mushroom-galette/"
}