{
  "date": "2007-11-09T23:59:55+00:00",
  "directions": [
    "Heat oven to 300 degrees. Sprinkle chicken pieces with salt and pepper. ",
    "Spread a third of the onion slices and all the garlic in the bottom of a 7-quart ovenproof casserole or Dutch oven. Scatter 5 sprigs thyme, 1 bay leaf, and 1 rosemary sprig over the onion layer. Lay half the chicken pieces on top of the herb layer. Repeat with another third of the onion slices, the same amounts of each of the herbs as before, and the remaining chicken pieces; finish with a layer of all the remaining onion slices. Pour Riesling and chicken stock over onions and chicken. Cover casserole, and place in the oven to cook until chicken is tender, about 1 hour and 15 minutes. ",
    "Remove chicken pieces from casserole, and let sit until cool enough to handle. Remove skin from chicken; cut each breast piece in half. Spread each chicken piece with 1/2 teaspoon mustard, season with salt and pepper, and top with sprigs of thyme. Set aside. With a ladle, remove about 1 cup of the chicken cooking liquid from casserole, straining it into a shallow bowl or fat separator; set aside to separate. ",
    "Melt butter in a large skillet over medium heat. Add pearl onions, and season with salt and pepper. Cook, shaking skillet often, until mushrooms soften and turn golden brown, 3 to 4 minutes. Add mushrooms, and season again with salt and pepper. Cook, shaking skillet often, until mushrooms soften and release their juice, 3 to 5 minutes. Cook until juice has evaporated, about 2 minutes. Add 2 tablespoons Madeira to skillet, and cook until evaporated, about 1 minute. Transfer mixture to a bowl, and set aside. ",
    "Return skillet to medium heat. Arrange 5 bacon strips in a single layer in skillet. Cook until bacon renders most of its fat and is golden brown. Place a piece of chicken on each piece of bacon and, using tongs, wrap chicken in bacon in a more or less haphazard way. Do not worry if chicken unwraps; it can be easily rewrapped before serving. Remove chicken from skillet, place on a platter, and cover with foil to keep warm. Drain fat from skillet. Repeat with remaining bacon and chicken. ",
    "Add reserved cooked mushrooms and onions and all the chicken to skillet. Add remaining 2 tablespoons Madeira and the reserved chicken cooking liquid, skimmed of fat. Cook until chicken and vegetables are hot. Serve. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chicken-with-chanterelles-and-pearl-onions1.jpg?w=500",
  "ingredient_list": [
    "1 chicken (3 1/2 pounds), cut into 8 pieces, skin on",
    "Salt and freshly ground black pepper",
    "2 medium onions, cut into 1/8-inch-thick slices",
    "2 cloves garlic, peeled and slightly crushed",
    "40 sprigs fresh thyme, 3 to 4 bunches",
    "2 dried bay leaves",
    "2 sprigs fresh rosemary",
    "2 cups Riesling wine",
    "1 1/2 cups Homemade Chicken Stock, or low-sodium canned chicken broth, skimmed of fat",
    "3 tablespoons unsalted butter",
    "5 ounces red pearl onions, peeled and halved (about 1 cup)",
    "1/2 pound fresh wild mushrooms, such as chanterelle, cleaned, trimmed, and cut into 1-inch pieces",
    "1/4 cup Madeira wine",
    "5 teaspoons grainy mustard",
    "10 strips best-quality bacon"
  ],
  "tags": [
    "Chicken",
    "Mushrooms",
    "Photo"
  ],
  "title": "chicken with chanterelles and pearl onions",
  "url": "https://smittenkitchen.com/2007/11/chicken-with-chanterelles-and-pearl-onions/"
}