[
    {
        "ingredient_list": [
            "2 ounces dried porcini", 
            "5 tablespoons extra virgin olive oil", 
            "1 1/2 ounces pancetta, finely diced", 
            "2 cloves garlic, sliced", 
            "Salt and freshly ground black pepper", 
            "1 pound fresh fettuccine", 
            "4 eggs at room temperature, beaten", 
            "1 1/2 tablespoons minced flat-leaf parsley leaves", 
            "Grated Parmigiano-Reggiano for serving. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/a-cure-for-those-ales1.jpg?w=500", 
        "tags": [
            "Mushrooms", 
            "Pasta", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/a-cure-for-those-ales/", 
        "title": "fettucine with porcini", 
        "directions": [
            "1. Place porcini in a bowl, cover with about 1 cup warm water, and soak 30 minutes. Drain well, straining liquid into large measuring cup. Place porcini on several thicknesses of paper towel, cover with paper towel and press to remove moisture. Cut very large pieces in half. ", 
            "2. Meanwhile, heat 3 tablespoons oil in a skillet large enough to hold pasta for 4 servings. Add pancetta and sauté until barely beginning to brown. Add garlic and sauté another minute or so. ", 
            "3. Add porcini and cook until heated through and beginning to brown. Remove from heat. Season with salt and pepper. Warm 4 plates. ", 
            "4. Bring a pot of salted water to a boil for pasta. Cook pasta about 3 minutes and drain well. Transfer to skillet, add remaining oil, and cook over low heat to incorporate and heat ingredients. Gradually add 3/4 cup porcini liquid. When some has been absorbed, remove pan from heat. Add eggs and fold together quickly, to warm eggs without scrambling them. Add a little more liquid if needed. Immediately divide among plates and garnish with parsley. Serve at once with cheese alongside. "
        ], 
        "date": "2006-11-26T23:27:34+00:00"
    }, 
    {
        "ingredient_list": [
            "3 whole boneless chicken breasts with skin (about 2 1/2 pounds), halved (see Note)", 
            "1 1/2 tablespoons olive oil", 
            "3 1/2 tablespoons unsalted butter", 
            "1 onion, halved and sliced thin", 
            "3/4 pound mushrooms, sliced thin, any variety you like", 
            "1/2 cup dry Marsala", 
            "1 cup chicken broth", 
            "2 tablespoons minced fresh parsley leaves (optional, for garnish)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/03/alexs-chicken-and-mushroom-marsala.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Date Night", 
            "Gluten-Free", 
            "Mushrooms", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/03/alexs-chicken-and-mushroom-marsala/", 
        "title": "alex’s chicken and mushroom marsala", 
        "directions": [
            "Pat chicken dry and season with salt and pepper. In a large heavy skillet heat oil and 1 1/2 tablespoons butter over moderately high heat until hot but not smoking and brown chicken in 2 batches, transferring with tongs to a large plate as browned.", 
            "Discard all but 1 tablespoon fat from skillet and sauté onion and mushrooms, stirring occasionally, until liquid mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until Marsala is almost evaporated. Add broth and chicken with any juices that have accumulated on plate and simmer, turning chicken once, until cooked through, about 15 minutes. Transfer chicken with tongs to a platter.", 
            "Simmer mushroom sauce until liquid is reduced to about 1/2 cup. Remove skillet from heat and stir in remaining 2 tablespoons butter and salt and pepper to taste, stirring until butter is just incorporated. Spoon mushroom sauce around chicken and sprinkle with parsley. ", 
            "New note, 11/21/13: Tonight, I made this with boneless, skinless chicken thighs and it was fantastic — and quick, with refreshingly few ingredients. This takes well under an hour to cook, and deserves to be placed back in the weeknight rotation. "
        ], 
        "date": "2008-03-03T12:44:14+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds (32 ounces) ounces fresh baby spinach or regular spinach leaves", 
            "1 small yellow onion, finely chopped", 
            "3 small garlic cloves, minced", 
            "4 tablespoons unsalted butter", 
            "1 pound mushrooms, thinly sliced (I use creminis)", 
            "1 cup heavy cream", 
            "3/4 teaspoon table salt", 
            "Freshly ground black pepper", 
            "1/4 teaspoon freshly grated nutmeg (optional; I skip this)", 
            "12 large eggs", 
            "6 tablespoons finely grated Parmesan cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/baked-eggs-with-spinach-and-mushrooms.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Casserole", 
            "Easter", 
            "Eggs", 
            "Gluten-Free", 
            "Mushrooms", 
            "Spinach", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/04/baked-eggs-with-spinach-and-mushrooms/", 
        "title": "baked eggs with spinach and mushrooms", 
        "directions": [
            "If you’ve just washed your spinach, no need to dry it before wilting it in the pan. If it’s already dry, bring 1/2 inch water to a boil in a very large ovenproof heavy skillet, then add half of spinach and cook, turning with tongs, until wilted, about 30 seconds. Add remaining spinach and wilt in same manner, then cook, covered, over moderately high heat until spinach is tender, about 1 to 2 minutes. Drain in a colander and cool under cold running water. Gently squeeze handfuls of spinach to remove as much liquid as possible, then coarsely chop. You will have about 2 cups fairly tightly packed cooked spinach.", 
            "Wipe skillet dry, then melt butter over medium-low heat. Cook onion and garlic until softened, 2 to 3 minutes. Add mushrooms and increase heat to medium-high, then cook, stirring, until mushrooms have softened, exuded liquid and that liquid has cooked off, about 5 minutes. Stir in cream, salt, pepper, nutmeg (if using), and chopped spinach and bring back a simmer. Remove skillet from heat.", 
            "If baking eggs in this skillet, make 12 large indentations in mixture, each large enough to fit an egg. Otherwise, you can transfer this mixture to a 9×13-inch baking dish and do the same there. I like to use 2 teaspoons to make the wells; I press the backs of them together to “pinch” up the spinach mixture to form taller walls so that the eggs will not merge together. ", 
            "Do ahead: You can then set this aside for a few hours or up to one day in the fridge, covered.", 
            "When you’re ready to bake the dish, or about 30 minutes before serving, put oven rack in upper third of oven and heat oven to 450°F. Crack an egg into each well. Bake until whites are firm and yolks are still runny. You can check this by inserting a toothpick into various parts of the eggs and seeing whether they’re runny or set, which takes anywhere from 15 to 30 minutes. The range is long due to different ovens and baking vessels. It’s better to have to check more often than to let them overcook.", 
            "[Cooking note: It is nearly impossible to get all 12 eggs to cook evenly. The ones in the center will be more runny; at the edges, they’ll be more firm. But don’t fret. I’ve found that almost all people have an egg preference (more runny vs. more firm) and each egg manages to find the right home. Just ask people their preference as you serve them.]", 
            "Remove dish from oven, sprinkle with additional salt and pepper, plus grated Parmesan. Serve immediately."
        ], 
        "date": "2014-04-16T12:31:29+00:00"
    }, 
    {
        "ingredient_list": [
            "4 baking potatoes (about 2 pounds)", 
            "3 tablespoons olive oil, divided", 
            "3 tablespoons butter, divided", 
            "1 small white onion, finely chopped", 
            "2 garlic cloves minced", 
            "1 1/2 pounds mixed mushrooms, wild are wonderful, but sliced cremini or white mushrooms will also work", 
            "Salt and freshly ground pepper", 
            "1/2 cup white wine or vermouth, or 1/4 cup sherry or marsala (optional)", 
            "1/2 cup vegetable or beef broth, plus a splash or two extra if needed", 
            "1/2 teaspoon chopped thyme", 
            "4 ounce-log soft goat cheese", 
            "1 tablespoon minced fresh chives or flat-leaf parsley, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/baked-potatoes-with-wild-mushroom-ragu1.jpg?w=750", 
        "tags": [
            "Fall", 
            "Mushrooms", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/10/baked-potatoes-with-wild-mushroom-ragu/", 
        "title": "baked potatoes with wild mushroom ragù", 
        "directions": [
            "Heat oven to 425°F. Pierce potatoes all over with a fork and rub with 1 tablespoon olive oil. Place on rack and bake for 1 hour, or until tender in center when pierce with a skewer.", 
            "Meanwhile, in a large, deep skillet, melt the 2 tablespoons butter with 2 tablespoons olive oil over medium heat. Add the onion and garlic and sauté until softened, about 8 minutes. Turn heat to high, add mushrooms, salt and pepper and cook until the mushrooms brown, then release their juices and cook them off, about 10 minutes. Add wine, if using, scrape up any bits stuck to pan. Cook until evaporated. Add broth and thyme and bring to a simmer. Stir in final tablespoon of butter until melted. Adjust seasonings to taste.", 
            "Slit the potatoes and fluff the insides with a fork. Sprinkle with a little salt and pepper, a few goat cheese crumbles, a ladleful of the mushrooms and chives. Serve with extra mushrooms and goat cheese on the side."
        ], 
        "date": "2015-10-19T12:07:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour plus additional for kneading and rolling", 
            "3/4 cup cake flour (not self-rising)", 
            "2 large eggs", 
            "3/4 teaspoon salt", 
            "1/4 cup water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/best-things-in-small-packages1.jpg?w=500", 
        "tags": [
            "Dumplings", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/best-things-in-small-packages/", 
        "title": "wild mushroom pirogies", 
        "directions": [
            "Stir together flours in a bowl. Make a well in flour and add eggs, salt, and water, then stir together with a fork without touching flour. Continue stirring, gradually incorporating flour into well until a soft dough forms. Transfer dough to a lightly floured work surface and knead, adding only as much additional flour as needed to keep dough from sticking, until smooth and elastic, about 8 minutes. (Dough will be soft.) Cover with plastic wrap and let rest at room temperature at least 30 minutes.", 
            "Do ahead: Dough may be made 2 hours ahead, wrapped well in plastic wrap and chilled. Bring to room temperature before using."
        ], 
        "date": "2006-11-22T00:38:47+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry", 
            "1 1/4 cups all-purpose flour", 
            "1/4 teaspoon salt", 
            "8 tablespoons (1 stick) unsalted butter, cut into", 
            "pieces", 
            "1/4 cup sour cream", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup ice water", 
            "For the filling", 
            "2 tablespoons butter", 
            "1 large onion, finely diced", 
            "4 ounces fresh shiitake mushrooms, stems discarded, caps thinly diced", 
            "1 teaspoon chopped thyme or 1/2 teaspoon dried", 
            "1 teaspoon chopped tarragon or 1/2 teaspoon dried", 
            "1 tablespoon chopped dill or 1 teaspoon dried", 
            "6 cups thinly sliced cabbage, preferably Savoy, or 4 cups cabbage plus 2 cups other greens, such as beet, chard, or kale", 
            "salt and freshly milled pepper", 
            "1/4 cup chopped parsley", 
            "1 hard-cooked egg, chopped", 
            "1/4 cup sour cream or yogurt", 
            "1 teaspoon tarragon vinegar", 
            "2 tablespoons melted butter", 
            "For the horseradish sauce", 
            "1/4 cup prepared horseradish", 
            "1 cup yogurt or sour cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cabbage-and-mushroom-galette1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Mushrooms", 
            "Photo", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/10/cabbage-and-mushroom-galette/", 
        "title": "cabbage and mushroom galette", 
        "directions": [
            "1. Make pastry: In a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour.", 
            "2. Prepare the filling: Heat the butter in a large skillet over medium heat. Add the onion, mushrooms, and herbs and cook until softened, about 10 minutes. Add the cabbage, 1 teaspoon salt, and 1/2 cup water. Cover and cook slowly until the cabbage is tender, 15 to 20 minutes, turning it occasionally. Add more liquid. When tender, uncover and raise the heat to evaporate any excess moisture. The mixture should be fairly dry. Stir in the parsley, egg, and sour cream. Season with vinegar and taste for salt and pepper.", 
            "3. Assemble galette: Preheat the oven to 400» F. Roll the dough into a large thin circle and set it on the back of a sheet pan or cookie sheet. The edges will hang over the sides. Add the filling, making a mound 7 to 8 inches across, then fold the edges over and brush with the melted butter. Pour any extra butter into the vegetables. Bake until browned, 25 to 30 minutes. While it is baking, mix the horseradish and cream to form a sauce, and season to taste. When galette is done, carefully slide it onto a serving plate. Serve with the horseradish sauce on the side."
        ], 
        "date": "2008-10-26T20:17:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 chicken (3 1/2 pounds), cut into 8 pieces, skin on", 
            "Salt and freshly ground black pepper", 
            "2 medium onions, cut into 1/8-inch-thick slices", 
            "2 cloves garlic, peeled and slightly crushed", 
            "40 sprigs fresh thyme, 3 to 4 bunches", 
            "2 dried bay leaves", 
            "2 sprigs fresh rosemary", 
            "2 cups Riesling wine", 
            "1 1/2 cups Homemade Chicken Stock, or low-sodium canned chicken broth, skimmed of fat", 
            "3 tablespoons unsalted butter", 
            "5 ounces red pearl onions, peeled and halved (about 1 cup)", 
            "1/2 pound fresh wild mushrooms, such as chanterelle, cleaned, trimmed, and cut into 1-inch pieces", 
            "1/4 cup Madeira wine", 
            "5 teaspoons grainy mustard", 
            "10 strips best-quality bacon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chicken-with-chanterelles-and-pearl-onions1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/chicken-with-chanterelles-and-pearl-onions/", 
        "title": "chicken with chanterelles and pearl onions", 
        "directions": [
            "Heat oven to 300 degrees. Sprinkle chicken pieces with salt and pepper. ", 
            "Spread a third of the onion slices and all the garlic in the bottom of a 7-quart ovenproof casserole or Dutch oven. Scatter 5 sprigs thyme, 1 bay leaf, and 1 rosemary sprig over the onion layer. Lay half the chicken pieces on top of the herb layer. Repeat with another third of the onion slices, the same amounts of each of the herbs as before, and the remaining chicken pieces; finish with a layer of all the remaining onion slices. Pour Riesling and chicken stock over onions and chicken. Cover casserole, and place in the oven to cook until chicken is tender, about 1 hour and 15 minutes. ", 
            "Remove chicken pieces from casserole, and let sit until cool enough to handle. Remove skin from chicken; cut each breast piece in half. Spread each chicken piece with 1/2 teaspoon mustard, season with salt and pepper, and top with sprigs of thyme. Set aside. With a ladle, remove about 1 cup of the chicken cooking liquid from casserole, straining it into a shallow bowl or fat separator; set aside to separate. ", 
            "Melt butter in a large skillet over medium heat. Add pearl onions, and season with salt and pepper. Cook, shaking skillet often, until mushrooms soften and turn golden brown, 3 to 4 minutes. Add mushrooms, and season again with salt and pepper. Cook, shaking skillet often, until mushrooms soften and release their juice, 3 to 5 minutes. Cook until juice has evaporated, about 2 minutes. Add 2 tablespoons Madeira to skillet, and cook until evaporated, about 1 minute. Transfer mixture to a bowl, and set aside. ", 
            "Return skillet to medium heat. Arrange 5 bacon strips in a single layer in skillet. Cook until bacon renders most of its fat and is golden brown. Place a piece of chicken on each piece of bacon and, using tongs, wrap chicken in bacon in a more or less haphazard way. Do not worry if chicken unwraps; it can be easily rewrapped before serving. Remove chicken from skillet, place on a platter, and cover with foil to keep warm. Drain fat from skillet. Repeat with remaining bacon and chicken. ", 
            "Add reserved cooked mushrooms and onions and all the chicken to skillet. Add remaining 2 tablespoons Madeira and the reserved chicken cooking liquid, skimmed of fat. Cook until chicken and vegetables are hot. Serve. "
        ], 
        "date": "2007-11-09T23:59:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound cremini mushrooms, or a mix of wild mushrooms such as morels, shiitakes, oysters or chanterellas", 
            "2 tablespoons unsalted butter, more for toast", 
            "1 large or 2 small shallots, chopped", 
            "2 tablespoons dry white wine or white vermouth", 
            "1/4 cup heavy cream", 
            "Kosher salt and freshly ground black pepper", 
            "Slices brioche or good white bread, crusts cut off if desired", 
            "1 tablespoon fresh chopped chives", 
            "Coarse sea salt such as fleur de sel or Maldon, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/12/creamed-mushrooms-on-butter-chive-toast.jpg?w=753", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Herbs", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/12/creamed-mushrooms-on-chive-butter-toast/", 
        "title": "creamed mushrooms on chive butter toast", 
        "directions": [
            "Clean excess dirt from mushrooms. Slice mushrooms in half lengthwise and brush away any grit; chop into 1/4-inch pieces.", 
            "Melt butter in a large skillet over medium-high heat. Add shallots and sauté until very limp, about three minutes. Add mushrooms and cook, stirring, for about five minutes. Add wine, reduce heat to medium, cover, and cook for about five minutes more. (There are a lot of “abouts” on the cooking times because I found that mine took less time at each step; however, I also may have chopped my mushrooms and shallots smaller than the recommended size.)", 
            "Uncover pot and continue cooking, stirring occasionally, until most of the liquid has evaporated, about two minutes. Stir in cream; simmer until slightly thickened, two minutes longer. Season with salt and pepper to taste. ", 
            "Toast bread and spread with butter. (Clark recommended four slices of brioche, to make eight toasts, but I had enough mushrooms for almost triple that.) Cut each slice in half diagonally and sprinkle lightly with chives. Top each toast triangle with some mushroom mixture. Sprinkle with additional chives, garnish with sea salt, and serve.", 
            "Other uses for these mushrooms: I’d imagine they’d make a wonderful simple pasta sauce or, of course, something delicious to prop a poached egg upon, toast and all.", 
            "[Update: Thanks to the six (!) people who have noted that the theory that mushrooms absorb too much water to be washed has been rejected over time. They do absorb water, but not enough that they should throw off a dish. Wash away!]"
        ], 
        "date": "2009-12-13T10:39:57+00:00"
    }, 
    {
        "ingredient_list": [
            "For polenta", 
            "4 1/2 cups water", 
            "1 cup coarse stone-ground white grits (preferably organic)", 
            "1/4 cup heavy cream", 
            "2 tablespoons finely grated Parmigiano-Reggiano", 
            "1 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "For mushrooms", 
            "1 pound assorted fresh exotic mushrooms such as porcini, oyster, chanterelle, lobster, and hedgehog", 
            "3 tablespoons extra-virgin olive oil", 
            "1 garlic clove, smashed", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "1/4 cup water", 
            "3 tablespoons cold unsalted butter", 
            "1 1/2 tablespoons fresh lemon juice", 
            "1 tablespoon chopped fresh flat-leaf parsley (we used chives)", 
            "For serving", 
            "1/2 cup mascarpone (though we used crème fraîche, and just a tad)", 
            "2 tablespoons finely grated Parmigiano-Reggiano "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creamy-white-polenta-with-mushrooms1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/creamy-white-polenta-with-mushrooms/", 
        "title": "creamy white polenta with mushrooms", 
        "directions": [
            "Make polenta: Bring water to a simmer in a 3- to 4-quart heavy saucepan. Add grits in a slow stream, whisking until incorporated. Simmer, stirring occasionally with a long-handled whisk or wooden spoon, until liquid is absorbed and polenta is thick and soft, about 30 minutes. (Grits will have a loose, risotto-like consistency.) Remove from heat and stir in cream, cheese, salt, and pepper. Keep warm, covered.", 
            "Saute mushrooms while polenta simmers: If using porcini, halve if large, then slice lengthwise into 1/4-inch thick slices. If using oysters, trim spongy base if necessary and slice caps into 1/2-inch-wide strips. If using chanterelles, leave small mushrooms whole, halve if medium, and quarter if large. If using lobsters, cut into 1/2-inch pieces. If using hedgehogs, trim base of stems and halve caps if large.", 
            "Heat oil in a 10-inch heavy skillet over moderately high heat until hot but not smoking, then saute mushrooms, garlic, salt, and pepper, stirring occasionally, until mushrooms are golden and any liquid they give off is evaporated, 6 to 8 minutes.", 
            "Add water, butter, lemon juice, and parsley and heat, swirling skillet, until butter melts and liquid forms a sauce.", 
            "To serve: Top each serving of polenta with mushrooms and mascarpone. Serve immediately (polenta stiffens as it cools), sprinkled with Parmigiano-Reggiano.", 
            "Note: Mushroom sauce can be made 1 hour ahead and kept, covered, at room temperature. Reheat before using. "
        ], 
        "date": "2007-11-12T23:50:32+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound mushrooms such as cremini or white, halved lengthwise if large", 
            "2 tablespoons capers, rinsed and chopped", 
            "3 large garlic cloves, minced", 
            "2 tablespoons vegetable oil", 
            "3 tablespoons unsalted butter, cut into pieces", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup chopped flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/12/garlic-butter-roasted-mushrooms.jpg?w=749", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/12/garlic-butter-roasted-mushrooms/", 
        "title": "garlic butter roasted mushrooms", 
        "directions": [
            "Preheat oven to 450°F with rack in middle. Toss mushrooms with capers, garlic, oil, 1/8 teaspoon salt and several grinds of pepper in a 1 1/2- to 2-qt shallow baking dish. Top with butter and roast, stirring occasionally, until mushrooms are tender and golden and bubbly garlic sauce forms below, 15 to 20 minutes. Stir in lemon juice and parsley. Serve immediately, with crusty bread on the side for swiping up the juices."
        ], 
        "date": "2010-12-12T14:34:51+00:00"
    }, 
    {
        "ingredient_list": [
            "Crispy Onions", 
            "2 medium yellow onions, halved and thinly sliced", 
            "1/4 cup all-purpose flour", 
            "2 tablespoons panko or plain breadcrumbs", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "Canola, safflower, peanut or other high-heat oil, for deep-frying", 
            "Mushroom Sauce", 
            "3 tablespoons butter", 
            "12 ounces mushrooms, thinly sliced or coarsely chopped", 
            "Few gratings fresh nutmeg (optional)", 
            "Freshly ground black pepper", 
            "3/4 teaspoon table salt", 
            "2 garlic cloves, minced", 
            "3 tablespoons all-purpose flour", 
            "1 1/2 cups vegetable or chicken broth", 
            "1/2 cup heavy cream", 
            "Assembly", 
            "1 to 1 1/2 pounds green beans, trimmed and halved (see note about volume)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/green-bean-casserole-with-crispy-onions1.jpg?w=640", 
        "tags": [
            "Fall", 
            "Green Beans", 
            "Mushrooms", 
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/green-bean-casserole-with-crispy-onions/", 
        "title": "green bean casserole with crispy onions", 
        "directions": [
            "Make the crispy onions: Toss onion with flour, breadcrumbs, salt and pepper. Heat a 1/2-inch or so of oil in a 12-inch cast iron skillet until a drop of water flicked into it will hiss and sputter. Add onions, just a handful at a time in something close to a single layer, and fry until a light golden brown (they’ll get more color in the oven; I overcooked mine a bit, forgetting this). Remove with a spider or large slotted spoon, let oil drip off a little, back into the skillet, then spread onions out on paper towels to drain. Repeat with remaining onions. Set aside until needed; this makes a lot.", 
            "Heat oven to 400 degrees F.", 
            "Prepare the beans: Bring a large pot of salted water to boil and boil greens for 5 minutes (for standard green beans) or 2 to 3 minutes (for haricot vert, or skinny ones). Drain beans, then plunge them into ice water to full stop them from cooking. Drain again, and set aside. (If you are adamant about only using one pot, you can boil them in your 12-inch cast iron skillet that you use for the other steps. But a saucepan can be easier.)", 
            "Make the mushroom sauce: Over medium-high heat, melt butter in the bottom of a 12-inch cast iron skillet. Add the mushrooms, salt and pepper and saute them until they start releasing their liquid, anywhere from 3 to 5 minutes, depending on how they were chopped. Add the garlic and saute one minute more. Add the flour and stir it until it fully coats the mushrooms. Add the broth, 1/4 cup at a time, stirring the whole time. Simmer mixture for 1 minute, then add cream and bring back to a simmer, cooking until the sauce thickens a bit, about 5 to 6 minutes, stirring frequently. ", 
            "Assemble and bake: Add cooked greens beans to sauce and stir until they are coated. Sprinkle crispy onions over the top. Bake for 15 minutes, or until sauce is bubbling and onions are a shade darker. Eat at once.", 
            "Do ahead, a few ways: Onions can be made long in advance (up to a day) and keep at room temperature, loosely wrapped (they’d get soggy in an airtight container). Green beans can be cooked and kept in fridge until needed, at least one day. Green beans can also be combined with mushroom sauce and kept refrigerated for up to a day. Add onions and bake shortly before serving. Finally, it’s less ideal, but the entire dish can be cooked, loosely wrapped (so the crispy top doesn’t get soggy) and then rewarmed in a low oven before serving. Just keep an eye on the topping so it doesn’t get too brown while reheating.", 
            "A few notes: "
        ], 
        "date": "2013-11-18T11:56:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 ounce dried tomatoes (about 5, not packed in oil)", 
            "2 tablespoons olive oil", 
            "18 white mushrooms, stems pulled out and chopped fine and caps reserved", 
            "1/2 cup finely chopped shallots", 
            "2 garlic cloves, minced", 
            "1/3 cup fine dry bread crumbs", 
            "1 large egg yolk, beaten lightly", 
            "1/4 cup fresh parsley leaves, washed well, spun dry, and minced", 
            "1/2 teaspoon dried basil, crumbled", 
            "2 tablespoons freshly grated Parmesan "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/sundried-tomato-stuffed-mushrooms.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2006/11/grievances-aired-caps-stuffed/", 
        "title": "sundried tomato stuffed mushrooms", 
        "directions": [
            "Preheat oven to 400°F.", 
            "In a small bowl soak tomatoes in hot water to cover 5 minutes. Reserving 1 tablespoon soaking liquid, drain tomatoes well and chop fine.* ", 
            "Lay mushroom caps, stems removed, face down on baking sheet either lightly sprayed with cooking spray or parchment paper. Bake them approximately 10 minutes, or until their liquid puddles underneath. Remove from the oven. Carefully pour off liquid that has gathered in the bottom of the pan, and then again, carefully, turn mushroom caps over so they are ready to be filled.", 
            "In a small skillet heat oil over moderate heat until hot but not smoking and cook chopped mushrooms stems, shallots and garlic, stirring until shallots are softened. In a bowl stir together mushrooms mixture, bread crumbs, tomatoes, reserved soaking liquid, yolk, parsley, basil, and salt and pepper to taste. Mound stuffing in reserved mushroom caps and arrange caps in a lightly greased shallow baking dish, or the same parchment-lined pan you’ve roasted your mushrooms in. Sprinkle mushrooms with Parmesan and bake in middle of oven 15 minutes.", 
            "Makes 18 hors d’oeuvres.", 
            "* Can skip this step if using oil-packed tomatoes, as I did."
        ], 
        "date": "2006-11-15T18:12:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1 ounce (1/2 cup) dried wood ear mushrooms or 5 fresh button or shiitake mushrooms, wiped clean and thinly sliced", 
            "2 tablespoons canola oil or other neutral cooking oil", 
            "1/2 pound lean pork shoulder, sliced 1/8 inch thick and cut into 1-by-1/4-inch strips, or 1/2 pound ground pork", 
            "1 tablespoon finely chopped garlic", 
            "1 tablespoon finely chopped peeled fresh ginger", 
            "1/2 cup chopped scallions, plus more for garnish, if desired", 
            "4 cups chicken stock or low-sodium broth", 
            "1/3 cup (about 2 ounces) bamboo shoots, drained", 
            "1/2 pound soft tofu, cut into 1/2-inch dice", 
            "1/3 cup unseasoned rice vinegar, plus more for serving", 
            "3 tablespoons soy sauce", 
            "1 teaspoon sugar (I skipped this)", 
            "1 teaspoon black or white pepper", 
            "1 teaspoon toasted sesame oil", 
            "1 tablespoon Sriracha, plus more for serving", 
            "Kosher salt", 
            "2 large eggs, beaten"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/hot-and-sour-soup11.jpg?w=640", 
        "tags": [
            "Chinese", 
            "Gluten-Free", 
            "Meat", 
            "Mushrooms", 
            "Photo", 
            "Quick", 
            "Soup", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/02/hot-and-sour-soup/", 
        "title": "hot and sour soup", 
        "directions": [
            "If using dried mushrooms: Cover the mushrooms with boiling water in a small bowl, and let stand until softened, about 30 minutes. Drain and coarsely chop the mushrooms.", 
            "In a large saucepan, heat the canola oil.  Add the pork, garlic, ginger and 1/2 cup scallions and cook over moderately high heat, stirring occasionally, until the pork is golden brown, about 3 minutes. Stir in the stock and add the bamboo shoots (if using), tofu, 1/3 cup of vinegar, the soy sauce, sugar, pepper, sesame oil, mushrooms and 1 tablespoon Sriracha. Bring the soup to a simmer and season with salt. While stirring constantly, drizzle in the eggs and cook until strands form, about 1 minute. Serve hot, garnished with extra scallions if desired, passing rice vinegar and Sriracha at the table."
        ], 
        "date": "2016-02-08T11:55:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup milk", 
            "4 tablespoons unsalted butter (1/2 stick)", 
            "1/4 teaspoon salt", 
            "Dash cayenne pepper", 
            "1 cup all-purpose flour", 
            "3 large eggs", 
            "1/2 teaspoon paprika", 
            "1/2 cup grated Parmesan cheese", 
            "1 1/2 cups grated Swiss cheese (Emmenthaler or Gruyere)", 
            "Coarse salt (fleur de sel or kosher salt) to sprinkle on top ", 
            "8 ounces bacon slices", 
            "1 cup chopped onion", 
            "1 10-ounce package chopped frozen spinach, thawed, squeezed dry", 
            "4 ounces feta cheese, crumbled (about 3/4 cup)", 
            "4 ounces cream cheese, room temperature", 
            "1/4 teaspoon dried crushed red pepper", 
            "2 3/4 pounds button mushrooms (about 48; each about 1 1/2 inches in diameter), stemmed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/just-a-few-bites1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/12/just-a-few-bites/", 
        "title": "gougères + stuffed mushrooms", 
        "directions": [
            "Preheat oven to 375°F. Cook bacon in heavy large skillet until crisp, about 8 minutes. Transfer bacon to paper towels to drain. Coarsely crumble bacon. Discard all but 1/4 cup plus 2 teaspoons bacon fat (adding olive oil if necessary to equal that amount).", 
            "Heat 2 teaspoons reserved bacon fat in heavy medium skillet over medium heat. Add chopped onion and saute until tender, about 5 minutes. Transfer to medium bowl and cool; mix in bacon, spinach, feta, cream cheese, and crushed red pepper. Season filling to taste with salt and pepper.", 
            "Line 2 large rimmed baking sheets with foil. Toss mushrooms and reserved 1/4 cup bacon fat in large bowl to coat. Sprinkle mushrooms with salt and pepper. Place mushrooms, rounded side down, in single layer on prepared baking sheets. Bake mushrooms until centers fill with liquid, about 25 minutes. Turn mushrooms over. Bake mushrooms until brown and liquid evaporates, about 20 minutes longer. Turn mushrooms over again. Spoon 1 heaping teaspoon filling into each mushroom cavity. (Filled mushrooms can be prepared 1 day ahead. Cover and refrigerate.)", 
            "Preheat oven to 375°F. Bake mushrooms until heated through, about 10 minutes. Transfer mushrooms to platter and serve warm."
        ], 
        "date": "2006-12-26T13:39:32+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup pearl barley or farro", 
            "3 cups water", 
            "1 tablespoon unsalted butter", 
            "1 tablespoon olive oil", 
            "2 garlic cloves, minced", 
            "9 scallions, finely chopped (1 1/3 cups), divided", 
            "1 pound cremini mushrooms, sliced", 
            "1/4 cup dry Madeira (preferably Verdelho or Sercial)", 
            "1 cup whole-milk ricotta", 
            "1 (1-pound) package frozen all-butter puff pastry, thawed (if you can get DuFour, it will be worth every extra penny–promise)", 
            "1 egg yolk, beaten with 1 teaspoon water and a pinch of salt", 
            "Make filling:", 
            "If using farro, cover it with cold water in a bowl and soak 30 minutes, then drain in a colander, discarding soaking water. Bring farro, water (3 cups), and 1/4 teaspoon salt to a boil in a medium saucepan, then reduce heat and simmer, uncovered, until tender, 15 to 20 minutes. Drain.", 
            "Roll out pastry while filling cools:", 
            "If pastry is in 1 piece, cut into 2 equal pieces. Roll out each piece on a lightly floured surface into an 11-inch square. Stack squares on a parchment-paper-lined baking sheet with a second sheet of parchment between them, then cover with plastic wrap and chill at least 30 minutes.", 
            "Assemble and bake pie: ", 
            "Put a large baking sheet on rack in middle of oven and preheat oven to 400°F."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-and-barley-pie1.jpg?w=500", 
        "tags": [
            "Grain/Rice", 
            "Mushrooms", 
            "Photo", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/11/mushroom-and-barley-pie/", 
        "title": "mushroom and barley pie", 
        "directions": [
            "Set aside top square of pastry on parchment. Spread cooled filling evenly over pastry on baking sheet, leaving a 1-inch border. Brush border with some of egg wash, and, using parchment, invert second square on top, lightly pressing to seal border. Brush top with remaining egg wash, then crimp border with a fork and trim with a pizza wheel or sharp knife.", 
            "Cut a few small steam vents in top of pie and decoratively score pastry. Slide pie on parchment onto preheated baking sheet in oven and bake until puffed and deep golden brown, about 45 minutes.", 
            "Do ahead: The filling can be made and pastry rolled out 1 day ahead and chilled. Or, you can assemble the pie up to three hours ahead of time and chill it uncovered until you’re ready to bake it."
        ], 
        "date": "2008-11-17T22:52:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup dried mushrooms like porcini", 
            "2 tablespoons oil", 
            "1 medium onion, diced", 
            "1 medium carrot, diced", 
            "2 cloves garlic, minced", 
            "1 pound mushrooms (you’ll prepare them shortly)", 
            "1/2 cup farro, pearled barley, or spelt, rinsed", 
            "6 cups low sodium or salt-free beef broth or stock (vegetable, mushroom or chicken stock can be swapped)", 
            "1/4 cup dry sherry", 
            "1 tablespoon tomato paste", 
            "Salt and pepper to taste", 
            "1 tablespoon sherry vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/01/mushroom-and-farro-soup-1.jpg?w=750", 
        "tags": [
            "Grain/Rice", 
            "Mushrooms", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2011/01/mushroom-and-farro-soup/", 
        "title": "mushroom and farro soup", 
        "directions": [
            "Cover dried mushrooms with 1 cup boiling water, and set aside for 20 minutes, or while you prepare the rest of the soup. ", 
            "Trim and slice fresh mushrooms, then give them a rough chop to your desired texture.", 
            "Heat oil in heavy-bottomed deep pot. Sauté onions and carrots over medium heat until onions begin to color, about 10 to 15 minutes. Add garlic, and sauté for 30 seconds. Add fresh mushrooms, and cook until they begin to release liquid, about 5 to 10 minutes. Raise heat and add barley; sauté until it begins to color (this didn’t really happen for me, because the mushroom liquid was still sloshing about). Add broth, sherry and tomato paste. Scoop the porcinis out of their soaking liquid (hang onto the liquid) and finely chop them. Strain the soaking liquid to remove any grit and add both this liquid and the chopped porcinis to pot. Season with salt and pepper, and simmer for about 40 minutes, until grains area tender. Stir in sherry vinegar; adjust seasonings and serve."
        ], 
        "date": "2011-01-31T17:00:23+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive oil", 
            "2 tablespoons butter, softened", 
            "2 pounds portobello mushrooms, in 1/4-inch slices (save the stems for another use) (you can use cremini instead, as well)", 
            "1/2 carrot, finely diced", 
            "1 small yellow onion, finely diced", 
            "2 cloves garlic, minced", 
            "1 cup full-bodied red wine", 
            "2 cups beef or vegetable broth (beef broth is traditional but vegetable to make it vegetarian; it works with either)", 
            "2 tablespoons tomato paste", 
            "1 teaspoon fresh thyme leaves (1/2 teaspoon dried)", 
            "1 1/2 tablespoons all-purpose flour", 
            "1 cup pearl onions, peeled (thawed if frozen)", 
            "Egg noodles, for serving", 
            "Sour cream and chopped chives or parsley, for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/mushroom-bourguignon-e1477582482731.jpg?w=625", 
        "tags": [
            "Date Night", 
            "Elsewhere", 
            "Freezer Friendly", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2009/01/mushroom-bourguignon/", 
        "title": "mushroom bourguignon", 
        "directions": [
            "Heat the one tablespoon of the olive oil and one tablespoon of butter in a medium Dutch oven or heavy sauce pan over high heat. Sear the mushrooms until they begin to darken, but not yet release any liquid — about three or four minutes. Remove them from pan.", 
            "Lower the flame to medium and add the second tablespoon of olive oil. Toss the carrots, onions, thyme, a few good pinches of salt and a several grinds of black pepper into the pan and cook for 10, stirring occasionally, until the onions are lightly browned. Add the garlic and cook for just one more minute. ", 
            "Add the wine to the pot, scraping any stuck bits off the bottom, then turn the heat all the way up and reduce it by half. Stir in the tomato paste and the broth. Add back the mushrooms with any juices that have collected and once the liquid has boiled, reduce the temperature so it simmers for 20 minutes, or until mushrooms are very tender. Add the pearl onions and simmer for five minutes more.", 
            "Combine remaining butter and the flour with a fork until combined; stir it into the stew. Lower the heat and simmer for 10  more minutes. If the sauce is too thin, boil it down to reduce to the right consistency. Season to taste.", 
            "To serve, spoon the stew over a bowl of egg noodles, dollop with sour cream (optional) and sprinkle with chives or parsley."
        ], 
        "date": "2009-01-15T15:48:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup yellow onion, diced", 
            "3 tablespoons butter", 
            "1 pound cremini mushrooms, thinly sliced", 
            "1/2 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground pepper", 
            "1 teaspoon flour", 
            "1/2 cup (4 ounces) milk", 
            "1/2 cup mild white cheese, mozzarella or provolone, shredded", 
            "Savory crêpes, recipe follows", 
            "2 tablespoons chives, thinly sliced (I skipped this, didn’t have them on hand)", 
            "1/4 cup Parmesan, shredded", 
            "2 large eggs", 
            "3/4 cup milk", 
            "1/2 cup water", 
            "1 cup flour", 
            "3 tablespoons butter, melted", 
            "1/2 teaspoon salt", 
            "Butter, for coating the pan"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-crepe-cake1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/05/mushroom-crepe-cake/", 
        "title": "mushroom crêpe cake", 
        "directions": [
            "In a blender combine all of the ingredients (excepting the butter for coating the pan) and pulse for 10 seconds. (Too lazy to bust out a blender, I mixed the flour and salt and slowly whisked in a mixture of the eggs, milk, water and butter.) Place the crepe batter in the refrigerator for one hour, or up to 48 hours.", 
            "Heat a small non-stick pan. Add butter to coat. Pour a couple tablespoons of batter into the center of the pan and swirl to spread evenly. Cook for 30 seconds and flip. Cook for another 10 seconds and throw the crepe in the garbage; seriously, the first one is always cursed. Sometimes the second too. By the time you get to the third one, go ahead and keep what you made, even if it’s not perfect. Lay the crêpe flat on a large cutting board to the cutting board to cool; continue cooking until all of the batter is gone.", 
            "Do ahead: Crêpe batter can be made up to two days in advance, stored in the fridge. Cooked, cooled and well-wrapped, crêpes can be stored for several days in the fridge or up to two months in the freezer. Frozen crêpes can be thawed on a rack; gently peel them as you need. Filling can be made a day in advance; reheat slowly, over a low flame. I made my crêpes in advance, and the filling in the morning; it doesn’t take much time (and even less if you clean and slice your mushrooms the night before)."
        ], 
        "date": "2010-05-11T11:04:07+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/10/mushroom-lasagna.jpg?w=750", 
        "tags": [
            "Freezer Friendly", 
            "Italian", 
            "Mushrooms", 
            "Pasta", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/10/mushroom-lasagna/", 
        "title": "mushroom lasagna", 
        "directions": [
            "Preheat your oven to 375°F. Bring a large, wide (if you use a wide one, you can save a dish later and saute your mushrooms in the bottom of it) of water to boil with salt and a splash of oil, that will help keep your noodles from sticking together as they drain. Add the lasagna noodles and cook for 10 minutes. Drain and set aside.", 
            "Make béchamel: Bring the milk and garlic to simmer in a saucepan, or heat it in your microwave, and set it aside. Melt 1/2 cup (8 tablespoons or 1 stick) butter in a large saucepan. If your name is Deb, you will probably brown this butter, too. Add the flour and cook for one minute over low heat, stirring constantly with a whisk or wooden spoon. Pour in the hot milk, a little at a time at first and stirring until combined. Once you’ve added half of it, you can add the second half all at once, along with 1 1/2 teaspoons table salt, the pepper, and nutmeg. Cook over medium-low heat, stirring or whisking frequently, for 3 to 5 minutes, or until thick. Set aside.", 
            "Prepare mushrooms: Discard portobello mushroom stems and/or trim the ends of the cremini stems. Slice mushrooms 1/4-inch thick. Heat 2 tablespoons olive oil and 2 tablespoons butter over medium in the bottom of the large, wide pot you used to cook the noodles earlier, or in a large sauté pan. Cook half the mushrooms with a couple pinches of salt for about 5 minutes, or until they are tender and release some of their juices, tossing to make sure they cook evenly. Repeat with additional oil and butter, and remaining mushrooms.", 
            "Assemble lasagna: Spread some of the sauce in the bottom of an 8 x 12 or 9 x 13 baking dish. (Ina recommends the former, I only had the latter; if you’d like to freeze or give this dish as a gift, remember to use a foil pan). Arrange a layer of noodles on top*, then more sauce (about 1/4 of what remains), 1/3 of the mushrooms and 1/4 cup grated parmesan. Repeat two more times then top with a final layer of noodles, your remaning sauce and last 1/4 cup of parmesan.", 
            "Bake for 45 minutes, or until top is browned and the sauce is bubbly. Let sit at room temperature for 15 minutes before serving. To freeze for future use, allow it to cool completely and wrap two to three times in plastic wrap before freezing.", 
            "* Burning question: Do you overlap your lasagna noodles on each layer? I think that’s the way it is usually done, but it has been so long since I made lasagna, I couldn’t remember. I decided to line mine up, and ended up with three neat rows down my 9 x 13 pan (I trimmed the ends of the noodles, because I can occasionally be a neat freak) and found it exceptionally neat and pretty to serve, as each piece could have two ruffly edges. This meant I only used 12 noodles total, or about 2/3 of a one-pound box. "
        ], 
        "date": "2010-10-06T13:00:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound (8 ounces or 225 grams) pasta of you choice, such as a ziti or twisty shape", 
            "1 tablespoon (15 ml) olive oil", 
            "3/4 pounds (340 grams) fresh mushroom, sliced (I used pre-sliced cremini, my new favorite thing)", 
            "1 small-to-medium yellow onion, halved and sliced thin", 
            "Salt and freshly ground black pepper to taste", 
            "1/4 cup (60 ml) dry marsala wine (see notes at end for more information)", 
            "3 tablespoons (45 grams) unsalted butter", 
            "3 tablespoons (25 grams) all-purpose flour", 
            "1 1/2 cups (355 ml) stock or broth (chicken, vegetable or mushroom)", 
            "1/2 cup (50 grams) finely grated parmesan cheese", 
            "4 ounces (115 grams) mozzarella, cut into small cubes", 
            "3 tablespoons chopped fresh flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/mushroom-marsala-pasta-bake1.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Date Night", 
            "Freezer Friendly", 
            "Mushrooms", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/01/mushroom-marsala-pasta-bake/", 
        "title": "mushroom marsala pasta bake", 
        "directions": [
            "A tip: If we play our cards right here, this can be made entirely in one dish. I used a 4-quart Staub braiser (Happy Hanukah to me!) but any 3-to-4 quart stovetop-to-oven type dish will work.", 
            "Cook the pasta: Bring a pot of well-salted water to a boil. Add pasta and cook until al dente, about 1 to 2 minutes before perfect doneness. Drain and set aside.", 
            "Heat oven: To 400 degrees.", 
            "Make the sauce: Reheat your empty pasta pot over high heat. Add oil and once it is hot, add mushrooms and cook until they’ve begun to brown and glisten, but have not yet released their liquid. Reduce heat to medium-high, add onions, salt and pepper and saute together until the liquid the mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until it has almost or fully evaporated (depending on your preference). Add butter, stir until melted. Add flour, and stir until all has been dampened and absorbed. Add stock, a very small splash at a time, stirring the whole time with a spoon. Make sure each splash has been fully mixed into the butter/flour/mushroom mixture, scraping from the bottom of the pan and all around, before adding the next splash. Repeat until all stock has been added. Let mixture simmer together for 2 minutes, stirring frequently; the sauce will thicken. Remove pan from heat.", 
            "Assemble and bake dish: If you’re cooking in an ovensafe dish, add cooked pasta and stir until combined. (If you’re not cooking in an ovensafe dish, transfer this mixture to a 2-quart baking dish.) Stir in half the parmesan, all of the mozzarella and two tablespoons of the parsley until evenly mixed. Sprinkle the top with remaining parmesan. Bake for 25 to 30 minutes, until edges of pasta are golden brown and irresistible. Sprinkle with reserved parsley and serve hot. Reheat as needed.", 
            "A bunch of notes: "
        ], 
        "date": "2015-01-12T12:03:33+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons olive oil", 
            "1 small onion, finely chopped", 
            "1 pound mushrooms, trimmed, cleaned and chopped into small bits (I used creminis)", 
            "1 teaspoon kosher salt, plus 1 tablespoon for pasta water", 
            "1 cup dry Marsala wine", 
            "1 pound pasta, Giada recommends thimble-shaped pasta, ditalini, but I think I used snail-shaped or chiocciole", 
            "1/2 pound frozen artichoke hearts, thawed", 
            "3/4 cup grated Parmesan", 
            "1/2 cup cream", 
            "1/2 cup chopped fresh flat-leaf parsley", 
            "1 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-marsala-pasta-with-artichokes1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Italian", 
            "Mushrooms", 
            "Pasta", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/12/mushroom-marsala-pasta-with-artichokes/", 
        "title": "mushroom marsala pasta with artichokes", 
        "directions": [
            "Place the olive oil in a large, heavy skillet over medium-high heat. Add the onions and cook for one minute. Add the mushrooms and one teaspoon of the salt. Sauté, stirring occasionally, until all the moisture has evaporated and the mushrooms have cooked down, about 10 minutes (though this took me much less time). Add the Marsala and continue cooking until almost all the wine has evaporated, about 5 minutes.", 
            "Meanwhile, bring a large pot of water to a boil over high heat. Stir in remaining salt. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, about 8 to 10 minutes. Drain pasta and add it into the mushrooms, Marsala and onions Add the artichoke hearts, Parmesan and cream and cook until the artichokes are heated through, about 5 minutes. Stir in the parsley and pepper, then adjust seasonings to taste. Transfer to a serving bowl and serve. ", 
            "Update 12/30/13: I hadn’t made this and years and dusted it off tonight. Conclusion: I think I’d actually like this better with twice as many mushroom and no artichokes. I mentioned above that I thought it needed some lemon or acidity — actually, artichokes do. Mushrooms and marsala sauce are perfect together, after all. I’d rather save the artichokes for a more lemony pasta sauce."
        ], 
        "date": "2009-12-19T10:16:51+00:00"
    }, 
    {
        "ingredient_list": [
            "12 to 18 sheets phyllo pastry (12 to make four large strudel, 18 to make smaller triangles)", 
            "1/4 to 1/2 cup butter, melted (1/4 cup to make large strudel, 1/2 cup to make smaller triangles; alternately, you could use olive oil for a different flavor profile)", 
            "1 egg, beaten (for large strudel; I did not see the need to seal the small ones)", 
            "1 pound mixed, fresh, wild and cultivated mushrooms (we used only creminis, and ended up with plenty of flavor. If you omit the stems, start with 1.5 pounds)", 
            "1 medium onion, minced", 
            "3 tablespoons butter", 
            "Freshly grated nutmeg (optional, we skipped it)", 
            "1 tablespoon dry sherry", 
            "1 tablespoon all-purpose flour", 
            "Leaves from 1 sprig marjoram or thyme", 
            "4 to 6 tablespoons freshly grated Parmesan, plus extra for sprinkling, if you wish (the latter amount for the minis)", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-streudels1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/05/mushroom-streudels/", 
        "title": "mushroom strudel", 
        "directions": [
            "Preheat the oven to 400°F (200°C). Line a baking sheet with parchment paper. Clear a large work surface for this, big enough for two full sheets of phllyo, your egg wash, parmesan and filling–trust me, you’ll need it.", 
            "Make the filling: Make sure the mushrooms are dust- and sand-free, wash if necessary, and trim if need be. Cook the onion in the butter and, when soft, add the mushrooms with the nutmeg. Saute for 5 to 7 minutes, until liquid has been released and has partially evaporated. Add the sherry and evaporate the alcohol by cooking over low heat for 2 to 3 minutes. Stir in the flour, herbs, and some salt and pepper, and let cool. The mixture will be moist.", 
            "To make small, triangular strudel: Take one sheet of phyllo at a time from their package; cover the remaining sheets with plastic and then a damp towel, ensuring they are completely covered. Brush one half of the sheet lengthwise with butter. Fold the unbuttered side over the buttered side, carefully, smoothing out any wrinkles and bubbles but not worrying if you can’t get them all. Again, brush one half of this lengthwise (a few inch-wide column) with butter, and fold the unbuttered side over it again. You’ll end up with one long column.", 
            "Dollop a spoonful of the mushroom filling near the end and sprinkle a teaspoon of parmesan over it. Begin folding one bottom corner of the phyllo strip over the filling until it meets the opposite edge, forming a triangle, as if you were folding a flag. Place the triangle seam side down on the baking sheet, brush lightly with egg wash and sprinkle with parmesan.", 
            "Bake in the preheated oven for 15 minutes. Serve warm.", 
            "To make four larger strudel: Take 3 sheets of phyllo at a time from their package; cover the remaining sheets with plastic and then a damp towel, ensuring they are completely covered. Brush 1 sheet on both sides with melted butter, then place it on top of another sheet, and cover with a third. Repeat 3 times, to make 4 stacks of triple-layer phyllo.", 
            "Lay one of the 4 stacks of phyllo on the parchment-lined baking sheet. Brush the edges with beaten egg. Put one-fourth of the mushroom mixture on the center of the phyllo and add 1 tablespoon Parmesan. Fold in the sides, then fold over and over into a neat parcel. Brush with beaten egg, turn over very carefully so that the seam is on the bottom, and brush with egg again. Repeat to make 3 more strudels.", 
            "Bake in the preheated oven for 15 minutes. Serve warm."
        ], 
        "date": "2008-05-19T11:27:37+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons (30 grams) unsalted butter", 
            "2 tablespoons (15 grams) all-purpose flour", 
            "3/4 cup (175 ml) milk, ideally whole but lowfat should work", 
            "A few gratings fresh nutmeg", 
            "Salt and black pepper to taste", 
            "1 tablespoon (15 grams) smooth Dijon mustard", 
            "1 1/2 pounds (680 grams) fresh mushrooms (cremini, white or a mix of wild all work), thinly sliced", 
            "Olive oil and butter as needed", 
            "2 teaspoons minced mixed fresh herbs such as rosemary, thyme and sage", 
            "Salt and black pepper to taste", 
            "1 pound loaf of a hearty white or whole wheat sourdough bread, in 3/4-inch slices", 
            "8 ounces (225 grams) coarsely grated gruyere or comte", 
            "Chopped fresh flat-leaf parsley, to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/mushroom-tartines.jpg?w=750", 
        "tags": [
            "Cheese", 
            "Mushrooms", 
            "Photo", 
            "Put An Egg On It", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/03/mushroom-tartines/", 
        "title": "mushroom tartines", 
        "directions": [
            "Make the sauce: In a large skillet (so you can use it again for the mushrooms), melt butter over medium heat and then stir in flour until a paste forms. Very slowly drizzle in milk, whisking the whole time to keep the mixture smooth. Add nutmeg, salt and pepper and cook, stirring, until mixture has simmered for a couple minutes. It will be thick and get thicker as it cools; this makes for a better spread. Scrape into a bowl and stir in Dijon. Adjust seasonings if needed. Set aside.\nHeat oven: To 425 degrees F. Line your largest baking sheet with foil.\n\nCook the mushrooms: Wipe out skillet and heat over medium-high. Add a glug of olive oil or a mix of olive oil and butter. Once it is very hot, add 1/3 to 1/2 of mushrooms, 1/3 to 1/2 of herbs and let sear in pan until brown underneath, about 2 to 3 minutes, before stirring and continuing to cook until tender and any liquid in the pan has cooked off, about 5 minutes. Season well with salt and pepper. Repeat with remaining mushrooms.", 
            "Assemble and bake: Spread bread in one layer on prepared baking sheet. Schmear each all the way to the edges with sauce; you should have exactly enough for a thin coat on each. Heap each slice with mushrooms; use them all. Sprinkle cheese over and since the mushrooms are heaped so high, you’ll probably have to press it in a bit with your hand. You’ll be glad you got all the cheese on there.", 
            "Bake for 10 minutes, until cheese is melted all over, then transfer to the broiler and cook until tops are browned, a few minutes more (but keep an eye on it because broilers vary wildly and mine is rather weak).", 
            "To serve: Scatter with parsley and eat with a knife and fork, preferably with a big green salad on the side."
        ], 
        "date": "2017-03-29T12:21:56+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons unsalted butter, divided", 
            "1 tablespoon olive oil", 
            "1 1/2 pounds mixed mushrooms, cleaned, trimmed and torn into bite size pieces (see suggestions above)", 
            "2 thick slices bread from a large, crusty loaf (I’d use 4 from a smaller loaf)", 
            "2 cloves garlic or 1 shallot, minced", 
            "1 tablespoon white wine vinegar, or more to taste (I used 2)", 
            "1 fresh red chile, stemmed, seeded and minced or red pepper flakes, to taste", 
            "Coarse salt and freshly ground black pepper", 
            "6 ounces chopped fresh greens (see suggestions above)", 
            "8 ounces of a good melting cheese, thickly sliced (suggestions above)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroooms-and-greens-with-toast1.jpg?w=640", 
        "tags": [
            "Casserole", 
            "Greens", 
            "Kale", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/05/mushrooms-and-greens-with-toast/", 
        "title": "mushrooms and greens with toast", 
        "directions": [
            "Melt 2 tablespoons butter and olive oil together in a large, heavy skillet over medium-high heat. One fully hot, add mushrooms to pan and cook, stirring regularly, until they’ve released their water and started to turn golden brown, about 8 minutes. ", 
            "Meanwhile, grill or toast your bread.", 
            "One the mushrooms have a nice color on them, add the garlic or shallots and cook, stirring constantly, for 1 minute. Drizzle with vinegar, most of the chile or chile flakes, salt and pepper and stir to combine. Add the greens; pretty much any kind aside from baby spinach will benefit from about 5 to 8 minutes cooking time, just until collapsed. If you’re me, you’ll add 1 more tablespoon vinegar for brightness at this point. Stir in remaining tablespoon butter and adjust seasonings to taste. Rip bread into irregular croutons and push them into the sauteed vegetables. Lay pieces of cheese atop everything. Turn the heat down to medium low, place a lid on the pan and let the cheese melt, which will take 5 to 10 minutes, depending on the pan and the kind of cheese you used. ", 
            "Sprinkle with remaining chile, “hand out forks, then bring the the pan to the table.” "
        ], 
        "date": "2015-05-12T12:04:17+00:00"
    }, 
    {
        "ingredient_list": [
            "5 ounces tomato juice", 
            "1 1/2 ounces vodka", 
            "Juice of 2 lime wedges", 
            "1/2 teaspoon finely grated", 
            "fresh horseradish", 
            "2 or 3 dashes of Worcestershire sauce", 
            "3 or 4 drops of Tabasco sauce", 
            "Pinch of salt", 
            "Pinch of celery salt", 
            "Small pinch of cayenne pepper", 
            "Ice ", 
            "10 oz baby spinach leaves", 
            "1/4 cup finely chopped onion", 
            "1 garlic clove, finely chopped", 
            "2 tablespoons unsalted butter", 
            "5 oz mushrooms, thinly sliced (2 cups)", 
            "1/3 cup heavy cream", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "1/8 teaspoon freshly grated nutmeg", 
            "4 large eggs", 
            "2 tablespoons finely grated parmesan", 
            "3 cups all purpose flour", 
            "1 teaspoon sugar (originally recipe calls for 2 tablespoons)", 
            "4 teaspoons baking powder", 
            "1 teaspoon salt", 
            "1 teaspoon baking soda", 
            "3/4 cup (1 1/2sticks) chilled unsalted butter, cut into 1/4-inch pieces", 
            "1/4 cup minced fresh chives", 
            "1 cup buttermilk "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/my-bacon-is-always-crisp1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Drinks", 
            "Eggs", 
            "Mushrooms", 
            "Photo", 
            "Scones/Biscuits", 
            "Spinach"
        ], 
        "url": "https://smittenkitchen.com/2007/05/my-bacon-is-always-crisp/", 
        "title": "baked eggs + chive biscuits + bloody marys", 
        "directions": [
            "Preheat oven to 425°F. Whisk flour, sugar, baking powder, salt and baking soda in large bowl to blend. Using fingertips, rub 3/4 cup chilled butter into dry ingredients until mixture resembles coarse meal. Stir in chives. Add buttermilk and stir until evenly moistened. Using 1/4 cup dough for each biscuit, drop biscuits onto baking sheet, spacing 2 inches apart.* Bake until biscuits are golden brown on top, about 15 minutes. Cool slightly. Serve warm. ", 
            "* I’m a sucker for the round, bumpy-edged biscuit shape so I rolled it out on well-floured counter and cut them with a 3″ biscuit-cutter. Take care to handle the dough as little as humanly possible, so not to warm or soften it too much. "
        ], 
        "date": "2007-05-13T20:49:56+00:00"
    }, 
    {
        "ingredient_list": [
            "Buttery Pastry Shell", 
            "2 cups (250 grams) all-purpose flour, plus more for dusting", 
            "1 teaspoon kosher salt", 
            "1 cup (2 sicks or 225 grams) very cold unsalted butter, cut into a small dice", 
            "1/4 cup (60 ml) water, ice cold", 
            "Neutral oil, for brushing springform", 
            "Filling", 
            "1 tablespoon (15 ml) olive or vegetable oil", 
            "2 pounds (905 grams) mushrooms (see Note up top for suggestions)", 
            "Salt and freshly ground black pepper", 
            "1 tablespoon (15 grams) unsalted butter", 
            "2 shallots, minced (I used 4 small because I’m a rebel)", 
            "1 tablespoon fresh thyme, minced (use 1 teaspoon only if dried/jarred)", 
            "3/4 cup (2 1/2 ounces or 70 grams) Comte, Emmantel or Gruyere, grated", 
            "2 cups (475 ml) milk", 
            "2 cup (475 ml) heavy cream", 
            "6 large eggs, lightly beaten", 
            "Freshly grated nutmeg (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/over-the-top-mushroom-quiche1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Easter", 
            "Mushrooms", 
            "Photo", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/04/over-the-top-mushroom-quiche/", 
        "title": "over-the-top mushroom quiche", 
        "directions": [
            "Make buttery shell: In a stand mixer fitted with the paddle attachment, mix 1 cup of the flour with all of the salt. Then, with the machine on low speed, add the bits of butter, a handful at a time, until the butter is completely incorperated. Add the remaining flour until just blended, then the cold water until thoroughly incorporated. Dump dough onto a piece of plastic wrap and form it into a flat, round disc. Wrap it with the plastic and chill it for at least one hour, preferably overnight, and up to two days.", 
            "Prepare shell: Set the ring of a 9-inch springform pan, leaving the hinge open, on a rimmed baking sheet lined with parchment paper. Brush the inside of the ring with lightly with oil and set aside.", 
            "Generously flour your counter, then place the chilled, unwrapped dough on the flour and flour the top of the dough. Roll you dough into a 16-inch round. The dough is going to be very hard at first, but keep at it, pressing your rolling pin gently from the center; it will get easier as it stretches out, and it’s best to start when its very cold as it will remain the coolest/most firm longer. Re-flour your surface as needed, continually lifting and rotating your dough to make sure no parts are sticking. If at any point the dough becomes sticky, soft and, frankly, annoying, just slide it onto a floured baking sheet and pop it into the freezer for two minutes for it to cool down again. If it tears, just overlap the sides of the tear and roll them back together. Don’t fret tiny holes; there will be time to patch later.", 
            "You can transfer your dough to the prepared pastry ring in one of two ways. Keller’s method is to roll it up on your rolling pin, then unroll it in the ring. I like to gently fold mine into quarters, without creases, and unfold it in the ring. Gently lift the edges so that the slack of the dough drapes in. Press the dough into the corners and up the sides of the ring. Trim the overhang to 1-inch and please, save your scraps. (I did not. The ring your see pictured is round two. I don’t want to talk about it.) Chill the pastry shell (and the scraps, so they don’t get mushy) in the fridge for 20 minutes (if par-baking) or until needed (if not par-baking).", 
            "Preheat oven to 325°F.", 
            "Decide if you want to par-bake your buttery pastry shell: Read the Note up top first.", 
            "To par-bake your pastry shell: Line your chilled buttery pastry shell with a 14-inch round of parchment paper, or, if your parchment paper isn’t that wide, two sheets in opposite directions. Fill completely (or whichever wall parts aren’t filled will collapse a little) with pie weights/dried beans/uncooked rice/loose change and bake in your preheated oven for 30 to 40 minutes, or until lightly golden at edges. Carefully remove weights and parchment paper and return shell to oven, baking another 10 to 15 minutes longer, until “richly brown” (as per Keller) on bottom. Set aside to cool while you make your filling. Leave the oven on.", 
            "Prepare filling: In a very large skillet, heat the oil. Add the mushrooms, season with salt and pepper and cook over high heat, stirring, until starting to soften, about 5 minutes. Reduce the heat to moderate. Add the butter, shallots and thyme and cook, stirring often, until the mushrooms are tender, about 12 minutes longer. Season with salt and pepper and let cool.", 
            "Assemble quiche: Whether or not your par-baked your buttery pastry shell, check it for holes or cracks that would cause leakage. If you see any, seal them with the trimmed scraps from the dough. Scatter 1/4 cup (one-third of) cheese and half the mushrooms in the bottom of the pastry shell. Either in a blender (Keller’s recommendation) or with a hand whisk (what I did), mix half the milk, cream and eggs with 1 1/2 teaspoons kosher salt (this seemed like a lot, I used less, wish I’d used the full amount), several grinds of black pepper and a pinch of nutmeg (if using) until frothy. Pour into the pastry shell. Top with another 1/4 cup of the cheese and remaining mushrooms. Make the custard again with the remaining eggs/milk/cream and same seasonings and pour it into the shell. Sprinkle remaining 1/4 cup cheese on top.", 
            "Bake quiche: For 1 1/2 hours, until nicely bronzed on top and the custard is just set. (My tester came out damp but not eggy; i.e. clean.) Let cool in pan until warm.", 
            "Serve quiche: Using a serrated knife, trim the pastry shell flush with the top of the pan. Run your knife around the outside of the quiche, inside the ring to make sure it’s not stuck anywhere. Take a deep breath. Lift the springform pan ring off the quiche. Applaud. You can trim your crust further if there’s a big gap between the top and the top of your crust but you might want to do so more neatly than I did. Cut the quiche into wedges and serve warm, with a delicate greens salad."
        ], 
        "date": "2012-04-06T13:33:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/4 cups all-purpose flour", 
            "1/2 teaspoon salt", 
            "1/4 teaspoon sugar", 
            "1/2 cup (1 stick) unsalted butter, chilled and cut into small pieces", 
            "2 to 3 tablespoons ice water", 
            "3 to 4 leeks, white part only, sliced", 
            "1/2 cup water", 
            "Salt", 
            "3 tablespoons butter", 
            "5 to 6 large white mushrooms, sliced", 
            "1 tablespoon port", 
            "3 eggs", 
            "1 1/2 cups whipping cream (Deb: I use whole milk)", 
            "An 8-inch partially-cooked pastry shell on a baking sheet", 
            "1/4 cup grated Swiss cheese", 
            "1 tablespoon butter cut into pea-sized dots"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/quiche-me-deadly1.jpg?w=500", 
        "tags": [
            "Leeks", 
            "Mushrooms", 
            "Photo", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/01/quiche-me-deadly/", 
        "title": "leek and mushroom quiche", 
        "directions": [
            "1. Preheat oven to 375°F.", 
            "2. Boil the leeks over moderately high heat in a heavy-bottomed, covered saucepan with 1/2 cup water, two tablespoons butter and a teaspoon of salt until it the liquid has almost evaporated. Lower heat and stew gently for 20 to 30 minutes until leeks are very tender. Put them aside in a bowl.", 
            "3. Add a tablespoon of butter to the pan along with the sliced mushrooms, 1/4 teaspoon of salt and port. Cover pan and cook over moderately low heat for 8 minutes. Uncover. Raise heat and boil for several minutes until liquid is completely evaporated and mushrooms are beginning to saute in their butter. Stir cooked mushrooms into leek mixture.", 
            "3. Beat the eggs, cream or milk and seasoning in a large  mixing bowl to blend. Gradually stir in the leek and mushroom mixture. Check seasoning. Pour into pastry shell. Spread on the cheese and distribute to the butter over it (Deb note: I’m not sure if it’s because I accidentally took it out a minute or two early, but I found the butter to leave a slight greasiness on top, getting in the way of a cheesy crust, and might skip it next time). Bake in upper third of pre-heated oven for 25 to 30 minutes until puffed and browned. "
        ], 
        "date": "2007-01-14T12:23:51+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/so-good-soba1.jpg?w=500", 
        "tags": [
            "Elsewhere", 
            "Mushrooms", 
            "Pasta", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/08/so-good-soba/", 
        "title": "spicy soba noodles with shiitakes", 
        "directions": [
            "Stir together all sauce ingredients until brown sugar is dissolved, then set aside.", 
            "Toast sesame seeds in a dry 12-inch heavy skillet (not nonstick) over medium heat, stirring, until pale golden, then transfer to a small bowl. ", 
            "Heat oil in skillet over medium-high heat until it shimmers, then saute ginger and garlic, stirring, until fragrant, about 30 seconds. Add shiitakes and saute, stirring frequently, until tender and starting to brown, about 6 minutes. Reduce heat to medium, then add cabbage and most of scallions (reserve about a tablespoon for garnish) and cook, stirring occasionally, until cabbage is crisp-tender, about 6 minutes. Add sauce and simmer 2 minutes.", 
            "While cabbage is cooking, cook soba and edamame together in a pasta pot of boiling salted water (2 tablespoons salt for 6 quarts water) until noodles are just tender, about 6 minutes. Drain in a colander and rinse under cool water to stop cooking and remove excess starch, then drain well again. Transfer to a large bowl and toss with sesame seeds and vegetable mixture. Serve sprinkled with reserved scallions.", 
            "Epicurious’ note: If you aren’t able to find Korean hot-pepper paste, substitute 3/4 teaspoon Chinese chile paste and reduce the amount of soy sauce to 1/4 cup. "
        ], 
        "date": "2007-08-30T14:44:15+00:00"
    }, 
    {
        "ingredient_list": [
            "5 cups chicken broth (40 fl ounces)", 
            "1 cup water", 
            "1 pound thin to medium asparagus, trimmed and cut into 1/4 inch thick slices, leaving tips 1 1/2 inches long", 
            "1 tablespoon olive oil", 
            "1/2 stick (1/4 cup) unsalted butter", 
            "3/4 pound fresh shiitake mushrooms, stems discarded and caps cut into 1/4 inch thick slices", 
            "2 large fresh artichoke hearts, cut into 1/4 inch thick slices, prepared*", 
            "2 shallots, finely chopped", 
            "1 1/2 cups Arborio rice (10 ounces)", 
            "1/2 cup dry white wine", 
            "2 ounces finely grated Parmigiano-Reggiano (1 cup, though I used half) "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/someday-my-spring-will-come1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Asparagus", 
            "Easter", 
            "Grain/Rice", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/01/someday-my-spring-will-come/", 
        "title": "asparagus, artichoke and shiitake risotto", 
        "directions": [
            "Bring broth and water to a boil in a 4-quart pot. Add asparagus and cook, uncovered, until crisp-tender, 3 to 4 minutes. Transfer asparagus with a slotted spoon to a large bowl of ice and cold water to stop cooking, then drain and pat dry. Keep broth at a bare simmer, covered. ", 
            "Heat oil with 1 tablespoon butter in a 4-quart heavy saucepan over moderately high heat until foam subsides, then saute mushrooms, stirring occasionally, until browned, about 4 minutes. Season with salt and pepper, then transfer to a bowl. ", 
            "Cook onion in 2 tablespoons butter in saucepan over moderate heat, stirring, until softened, about 3 minutes. Add shallots and cook until softened, about 2 to 3 minutes, then add rice and cook, stirring, 1 minute. Add wine and cook, stirring, until absorbed, about 1 minute. ", 
            "Ladle in 1 cup simmering broth and cook at a strong simmer, stirring, until absorbed, about 2 minutes. Continue simmering and adding broth, about 1/2 cup at a time, stirring frequently and letting each addition be absorbed before adding next, until rice is just tender and looks creamy, 18 to 20 minutes. (Save leftover broth for thinning.) ", 
            "Remove from heat and stir in 1/2 cup cheese, remaining tablespoon butter, and salt and pepper to taste. Gently stir in asparagus, artichokes and mushrooms, then cover pan and let stand 1 minute. If desired, thin risotto with some of remaining broth. Serve immediately with remaining cheese on the side.", 
            "* My absolutely favorite artichoke heart preparation is to remove all the outer leaves, choke and stem of a whole artichoke, leaving just the heart. Cut the heart into 1/4 inch slices and toss it immediately in a bowl filled with the juice of one lemon. Make sure each and every edge, angle and side of the hearts gets coated in lemon juice, or they will brown very quickly. In a small pot, boil water with a good glug or two of white wine, a splash of white vinegar and if you’re feeling fancy, a smashed garlic clove and/or a bay leaf. Drop in the artichoke hearts with all of their lemon juice, and simmer them for about 10 minutes, or longer if needed for them to become tender. Drain and set them aside. "
        ], 
        "date": "2007-01-29T22:36:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon unsalted butter", 
            "1/2 cup sliced green onions", 
            "1 clove garlic, minced", 
            "1 pound fresh spinach (coarse stems removed if ‘grown-up’ spinach; baby spinach can be used in full)", 
            "3/4 pound feta, crumbled", 
            "1 tablespoon lemon juice", 
            "Salt and pepper to taste", 
            "1/4 ounce dried wild mushrooms, such as chanterelles, porcini or shiitakes", 
            "1 cup boiling water", 
            "2 tablespoons unsalted butter", 
            "3/4 cup sliced green onions", 
            "1 garlic clove, minced", 
            "1/2 teaspoon chopped fresh rosemary", 
            "1/2 teaspoon chopped fresh thyme", 
            "1/2 pound assorted fresh wild mushrooms, such as chanterelles, porcini and shiitakes, brushed clean and chopped small", 
            "1/2 pound fresh button mushrooms, brushed clean and chopped small", 
            "5 ounces blue cheese crumbles", 
            "Salt and pepper to taste", 
            "3 tablespoons olive oil", 
            "1 teaspoon fennel seeds", 
            "2 large yellow onions, chopped small", 
            "1 teaspoon salt", 
            "1/2 teaspoon black pepper", 
            "1 heaping tablespoon Dijon mustard", 
            "4 ounces goat cheese, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/06/spanikopita-triangles.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Spinach", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/06/spanakopita-triangles-then-some/", 
        "title": "spanakopita triangles + then some", 
        "directions": [
            "Preheat oven to 375°F. Melt butter in a small saucepan, then cool. Cover phyllo stack with 2 overlapping sheets of plastic wrap and then a dampened kitchen towel. [I won’t lie, as I got more confident with the phyllo I sorta skipped this part, opting instead to work quickly. Proceed at your own risk, however!]", 
            "Take one phyllo sheet from stack and arrange on a work surface with a long side nearest you (keeping remaining sheets covered) and brush with some butter. Top with another phyllo sheet and brush with more butter. Cut buttered phyllo stack crosswise into 6 (roughly 12- by 2 3/4-inch) strips.", 
            "Put a heaping teaspoon of filling near one corner of a strip on end nearest you, then fold corner of phyllo over to enclose filling and form a triangle. Continue folding strip (like a flag), maintaining triangle shape. Put triangle, seam side down, on a large baking sheet and brush top with butter. Make more triangles in same manner, using all of phyllo.", 
            "Bake triangles in middle of oven until golden brown, 20 to 25 minutes, then transfer to a rack to cool slightly.", 
            "Do ahead: Pastry triangles can be formed, but not baked, three days ahead. Arrange in one layer in heavy-duty sealed plastic bags, then freeze. Bake frozen pastries (do not thaw) in same manner as above."
        ], 
        "date": "2009-06-10T08:43:24+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces baby spinach", 
            "2 large white mushrooms, thinly sliced", 
            "1/4 small or medium red onion, very thinly sliced", 
            "1 large egg, hard-boiled (see above), chilled, peeled and thinly sliced", 
            "4 pieces thick-sliced bacon (about 4 ounces), finely diced", 
            "2 tablespoons red wine vinegar", 
            "1/2 teaspoon honey or sugar", 
            "1/2 teaspoon smooth Dijon mustard", 
            "Coarse salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/spinach-salad-with-warm-bacon-vinaigrette1.jpg?w=750", 
        "tags": [
            "Mushrooms", 
            "Photo", 
            "Salad", 
            "Spinach"
        ], 
        "url": "https://smittenkitchen.com/2012/11/spinach-salad-with-warm-bacon-vinaigrette/", 
        "title": "spinach salad with warm bacon vinaigrette", 
        "directions": [
            "Place spinach in a large, wide salad serving bowl. Scatter with mushrooms, red onion (see above for a different, mellower way to add the onions) and coins of hard-boiled egg. In a large skillet, fry bacon bits over medium-high heat until they’re brown and crisp and have rendered their fat. Use a slotted spoon to scoop them out of the skillet and spread them on a piece of paper towel briefly before sprinkling them over the salad. Pour out all but two tablespoons of hot bacon fat from the skillet. Reheat over medium and quickly whisk in the red wine vinegar, honey and Dijon. Pour over entire salad and season salt and pepper. Toss gently and serve hot. Repeat tomorrow night."
        ], 
        "date": "2012-11-23T13:27:45+00:00"
    }, 
    {
        "ingredient_list": [
            "1 ounce dried mushrooms (porcini, morels, or shitakes)", 
            "1/2 cup olive oil", 
            "2 sprigs of rosemary", 
            "4 sprigs of sage", 
            "1 large yellow onion, peeled and thinly sliced", 
            "3 garlic cloves, peeled and thinly sliced", 
            "1 1/2 teaspoons salt", 
            "1/4 tsp freshly ground white pepper", 
            "1 pound white button mushrooms, cleaned and thinly sliced", 
            "1 pound shitake mushrooms stemmed, cleaned and thinly sliced", 
            "6 cups chicken stock or water", 
            "1 cup heavy cream", 
            "2 tablespoons unsalted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/01/balthazars-cream-of-mushroom-soup.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Gluten-Free", 
            "Mushrooms", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2007/01/superlatively-souper/", 
        "title": "balthazar’s cream of mushroom soup", 
        "directions": [
            "1.\tSoak the dry mushrooms in 1 cup of warm water for 20 to 30 minutes, until plump.", 
            "2.\tStrain the soaking liquid through a coffee filter to remove grit and reserve, along with the reconstituted mushrooms, until needed.", 
            "3.\tHeat the olive oil in a large pot over a medium flame. Bundle the rosemary and sage together and tie with kitchen twine.  When the oil is hot, add the herb bundle and sizzle for a few minutes on both sides to infuse the oil.", 
            "4.\tAdd the onion, garlic, salt and pepper and cook for 5 minutes, until the onion is soft and translucent but not brown.", 
            "5.\tTurn the flame to high and add the white mushrooms and shitakes.", 
            "6.\tCook for 10 minutes, during which the mushrooms will give off their liquid (which should evaporate quickly due to the high heat) and deflate significantly. Stir occasionally.", 
            "7.\tAdd the chicken stock and the dried mushrooms along with the soaking water.", 
            "8.\tSimmer for 30 minutes. Remove the herbs, then add the cream and butter. Working in batches, puree the soup in a blender until smooth. Return to the pot and keep at a very low simmer until ready to serve.", 
            "Deb adjustments: I used far less olive oil, replaced some of the chicken stock with beef, as I had it on hand and love mixing that flavor with mushrooms; half as much cream, preferring a more potent soup and thyme instead of rosemary, also due to personal preference."
        ], 
        "date": "2007-01-04T14:38:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup hazelnuts", 
            "2 tablespoons finely diced shallots", 
            "3 tablespoons sherry or a white wine vinegar", 
            "9 tablespoons extra-virgin olive oil", 
            "2 pounds mushrooms (cremini or a mix of wild mushrooms), cleaned and sliced", 
            "2 tablespoons unsalted butter", 
            "6 ounces salad greens such as frisé, arugula or a mix of your choice", 
            "A 1 cup mix of fresh herbs (optional) such as chives, tarragon", 
            "1 teaspoon fresh thyme or a couple pinches of dried", 
            "1/4 cup sliced shallots", 
            "1/4 pound pecorino (Goin loves di Grotta, and we did too, but Romano would also work) or Parmesan-Reggiano or another hard, sharp cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/03/warm-mushroom-salad-with-hazelnuts.jpg?w=753", 
        "tags": [
            "Mushrooms", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2010/03/warm-mushroom-salad-with-hazelnuts/", 
        "title": "warm mushroom salad with hazelnuts", 
        "directions": [
            "Preheat the oven to 375°F. Toast the hazelnuts on a baking sheet for 8 to 10 minutes, rolling them around once or twice to make sure they toast evenly. Rub nuts in a dish towel to remove skins then let cool. Chop the hazelnuts coarsely.", 
            "Whisk the shallots, vinegar, 1/2 teaspoon salt together in a bowl and let sit for five minutes (this will soften and almost pickle the shallots), before whisking in 5 tablespoons olive oil.", 
            "Heat a large sauté pan over medium-high heat. Add 2 tablespoons olive oil and 1 tablespoon butter until the butter foams. Add half the mushrooms, half the thyme and season with salt and pepper. Sauté the mushrooms for about 5 minutes, until they’re softened but not limp (your cooking time will depend on the type of mushrooms you used).", 
            "Transfer mushrooms to a plate then repeat with the second half. When they are cooked, return the first half of the mushrooms to the pan then toss in sliced shallots, cooking for an additional 2 minutes.", 
            "Spread salad greens on a plate. Sprinkle fresh herbs on top, if using. Spoon hot mushrooms over the salad greens. Pour three-quarters of the vinaigrette in the sauté pan and swirl it in the pan until heated. Season it with 1/4 teaspoon salt and freshly ground black pepper. Pour over salad and toss carefully. Adjust to taste — you may need more salt, pepper, vinaigrette or even more sherry vinegar.", 
            "Use a vegetable peeler to shave cheese over the salad. Sprinkle with hazelnuts. Serve immediately."
        ], 
        "date": "2010-03-04T22:23:24+00:00"
    }, 
    {
        "ingredient_list": [
            "For the pastry:", 
            "1 1/4 cups all-purpose flour", 
            "1/4 teaspoon salt", 
            "8 tablespoons (1 stick) unsalted butter, cut into pieces", 
            "1/4 cup sour cream", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup ice water", 
            "For the filling:", 
            "1/4 ounce dried wild mushrooms, such as chanterelles, porcini or shiitakes", 
            "1 cup boiling water", 
            "2 tablespoons unsalted butter", 
            "3/4 cup sliced green onions", 
            "1 garlic clove, minced", 
            "1/2 teaspoon chopped fresh rosemary", 
            "1/2 teaspoon chopped fresh thyme", 
            "1/2 lb. assorted fresh wild mushrooms, such as", 
            "chanterelles, porcini and shiitakes, brushed", 
            "clean and large mushrooms thinly sliced", 
            "1/2 lb. fresh button mushrooms, brushed clean", 
            "and thinly sliced", 
            "5 ounces Stilton or other good-quality blue cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/when-the-funk-hits-the-fan1.jpg?w=500", 
        "tags": [
            "Mushrooms", 
            "Photo", 
            "Tarts/Quiche", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2006/10/when-the-funk-hits-the-fan/", 
        "title": "wild mushroom and stilton galette", 
        "directions": [
            "1.\tTo make the pastry, in a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour.", 
            "2.\tMeanwhile, make the filling: Place the dried mushrooms in a small bowl and add the boiling water. Let stand for 30 minutes until softened. Drain the mushrooms and mince finely.", 
            "3.\tPreheat an oven to 400°F.", 
            "4.\tIn a large fry pan over medium heat, melt the butter. Add the green onions and saute, stirring occasionally, until soft, about 5 minutes. Add the garlic, rosemary and thyme and continue to cook, stirring, for 1 minute more. Increase the heat to high, add the fresh and rehydrated mushrooms, and saute until the mushrooms are tender and the liquid they released has completely evaporated, 8 to 10 minutes. Transfer to a plate and let cool. ", 
            "5.\tOn a floured work surface, roll out the dough into a 12-inch round. Transfer to an ungreased baking sheet. Crumble the blue cheese into a bowl, add the cooled mushrooms and stir well. Spread the mixture over the dough, leaving a 1 1/2-inch border. Fold the border over the mushrooms and cheese, pleating the edge to make it fit. The center will be open.", 
            "6.\tBake until golden brown, 30 to 40 minutes. Remove from the oven, let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature. Serves 6. "
        ], 
        "date": "2006-10-19T19:22:00+00:00"
    }, 
    {
        "ingredient_list": [
            "Pâté", 
            "1 ounce dried porcini or cepe mushrooms", 
            "1 cup boiling water", 
            "1/4 cup olive oil", 
            "3 tablespoons butter, divided", 
            "1 1/2 cups diced yellow onion or a combination of chopped onions and shallots (I used 1 cup onion, 1/2 cup shallots)", 
            "Coarse salt and freshly ground black pepper to taste", 
            "1 1/2 pounds mixed fresh mushrooms, any tough stems discarded and roughly chopped", 
            "1 teaspoon fresh thyme leaves (use half if dry)", 
            "1/4 cup Madeira, Marsala or sherry, or 1/2 cup white wine", 
            "To serve", 
            "Crackers or matzo, sieved hard-boiled egg, chopped flat-leaf parsley and/or chives, small pickles or cornichons, additional caramelized onions or pickled shallots or red onions (recipe below) "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/wild-mushroom-pc3a2tc3a91.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Passover", 
            "Photo", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/03/wild-mushroom-pate/", 
        "title": "wild mushroom pâté", 
        "directions": [
            "Combine dried mushrooms and boiling water in a small bowl and let soak for 30 minutes. Remove mushrooms, finely chop and set aside. Strain soaking liquid through a paper towel or coffee filter to remove any grit and set it aside.", 
            "Heat olive oil and 2 tablespoons butter over medium-high heat. Add onions and shallots, if using, and cook for 7 to 8 minutes, until they brown at the edges. Raise heat to high and add fresh mushrooms, thyme, salt and pepper. Cook, sauteeing, until mushrooms brown further and release their liquid. Cook until all of the liquid has evaporated, then add Madeira, Marsala, sherry or wine and do the same. Add rehydrated mushrooms and their soaking liquid, and cook this almost completely off. No liquid should run into the center if you drag your spoon through the mushrooms, clearing a path. Adjust seasonings to taste — seasoning is everything here — then stir in last tablespoon of butter. ", 
            "Let mixture cool to lukewarm, then blend in a food processor or blender until desired consistency — I like mine almost but not completely smooth, although pâté is traditionally very smooth. Let chill in fridge for a few hours before serving, giving the flavors a chance to settle. Pâté keep in fridge for 5 days, in an airtight container.", 
            "Serve with crackers and garnishes of your choice. To make an egg “mimosa”, peel a fully cooled hard-boiled egg. I like to cut mine into quarters and press each quarter, yolk side down, through a fine-mesh sieve until the flecks of egg fall decoratively on top. To pickle red onions or shallots, combine 1/4 cup red wine vinegar, 1/4 cup cold water, 1 tablespoon kosher salt and 1 tablespoon granulated sugar in a jar. Add thinly sliced onion or shallot and cover with lid; let pickle in fridge ideally for at least an hour. Pickled onions will keep for two weeks in the fridge."
        ], 
        "date": "2015-03-31T12:02:01+00:00"
    }
]