{
  "date": "2017-03-29T12:21:56+00:00",
  "directions": [
    "Make the sauce: In a large skillet (so you can use it again for the mushrooms), melt butter over medium heat and then stir in flour until a paste forms. Very slowly drizzle in milk, whisking the whole time to keep the mixture smooth. Add nutmeg, salt and pepper and cook, stirring, until mixture has simmered for a couple minutes. It will be thick and get thicker as it cools; this makes for a better spread. Scrape into a bowl and stir in Dijon. Adjust seasonings if needed. Set aside.\nHeat oven: To 425 degrees F. Line your largest baking sheet with foil.\n\nCook the mushrooms: Wipe out skillet and heat over medium-high. Add a glug of olive oil or a mix of olive oil and butter. Once it is very hot, add 1/3 to 1/2 of mushrooms, 1/3 to 1/2 of herbs and let sear in pan until brown underneath, about 2 to 3 minutes, before stirring and continuing to cook until tender and any liquid in the pan has cooked off, about 5 minutes. Season well with salt and pepper. Repeat with remaining mushrooms.",
    "Assemble and bake: Spread bread in one layer on prepared baking sheet. Schmear each all the way to the edges with sauce; you should have exactly enough for a thin coat on each. Heap each slice with mushrooms; use them all. Sprinkle cheese over and since the mushrooms are heaped so high, you’ll probably have to press it in a bit with your hand. You’ll be glad you got all the cheese on there.",
    "Bake for 10 minutes, until cheese is melted all over, then transfer to the broiler and cook until tops are browned, a few minutes more (but keep an eye on it because broilers vary wildly and mine is rather weak).",
    "To serve: Scatter with parsley and eat with a knife and fork, preferably with a big green salad on the side."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/mushroom-tartines.jpg?w=750",
  "ingredient_list": [
    "2 tablespoons (30 grams) unsalted butter",
    "2 tablespoons (15 grams) all-purpose flour",
    "3/4 cup (175 ml) milk, ideally whole but lowfat should work",
    "A few gratings fresh nutmeg",
    "Salt and black pepper to taste",
    "1 tablespoon (15 grams) smooth Dijon mustard",
    "1 1/2 pounds (680 grams) fresh mushrooms (cremini, white or a mix of wild all work), thinly sliced",
    "Olive oil and butter as needed",
    "2 teaspoons minced mixed fresh herbs such as rosemary, thyme and sage",
    "Salt and black pepper to taste",
    "1 pound loaf of a hearty white or whole wheat sourdough bread, in 3/4-inch slices",
    "8 ounces (225 grams) coarsely grated gruyere or comte",
    "Chopped fresh flat-leaf parsley, to garnish"
  ],
  "tags": [
    "Cheese",
    "Mushrooms",
    "Photo",
    "Put An Egg On It",
    "Vegetarian"
  ],
  "title": "mushroom tartines",
  "url": "https://smittenkitchen.com/2017/03/mushroom-tartines/"
}