{
  "date": "2007-01-14T12:23:51+00:00",
  "directions": [
    "1. Preheat oven to 375°F.",
    "2. Boil the leeks over moderately high heat in a heavy-bottomed, covered saucepan with 1/2 cup water, two tablespoons butter and a teaspoon of salt until it the liquid has almost evaporated. Lower heat and stew gently for 20 to 30 minutes until leeks are very tender. Put them aside in a bowl.",
    "3. Add a tablespoon of butter to the pan along with the sliced mushrooms, 1/4 teaspoon of salt and port. Cover pan and cook over moderately low heat for 8 minutes. Uncover. Raise heat and boil for several minutes until liquid is completely evaporated and mushrooms are beginning to saute in their butter. Stir cooked mushrooms into leek mixture.",
    "3. Beat the eggs, cream or milk and seasoning in a large  mixing bowl to blend. Gradually stir in the leek and mushroom mixture. Check seasoning. Pour into pastry shell. Spread on the cheese and distribute to the butter over it (Deb note: I’m not sure if it’s because I accidentally took it out a minute or two early, but I found the butter to leave a slight greasiness on top, getting in the way of a cheesy crust, and might skip it next time). Bake in upper third of pre-heated oven for 25 to 30 minutes until puffed and browned. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/quiche-me-deadly1.jpg?w=500",
  "ingredient_list": [
    "1 1/4 cups all-purpose flour",
    "1/2 teaspoon salt",
    "1/4 teaspoon sugar",
    "1/2 cup (1 stick) unsalted butter, chilled and cut into small pieces",
    "2 to 3 tablespoons ice water",
    "3 to 4 leeks, white part only, sliced",
    "1/2 cup water",
    "Salt",
    "3 tablespoons butter",
    "5 to 6 large white mushrooms, sliced",
    "1 tablespoon port",
    "3 eggs",
    "1 1/2 cups whipping cream (Deb: I use whole milk)",
    "An 8-inch partially-cooked pastry shell on a baking sheet",
    "1/4 cup grated Swiss cheese",
    "1 tablespoon butter cut into pea-sized dots"
  ],
  "tags": [
    "Leeks",
    "Mushrooms",
    "Photo",
    "Tarts/Quiche",
    "Vegetarian"
  ],
  "title": "leek and mushroom quiche",
  "url": "https://smittenkitchen.com/2007/01/quiche-me-deadly/"
}