{
  "date": "2006-10-19T19:22:00+00:00",
  "directions": [
    "1.\tTo make the pastry, in a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour.",
    "2.\tMeanwhile, make the filling: Place the dried mushrooms in a small bowl and add the boiling water. Let stand for 30 minutes until softened. Drain the mushrooms and mince finely.",
    "3.\tPreheat an oven to 400°F.",
    "4.\tIn a large fry pan over medium heat, melt the butter. Add the green onions and saute, stirring occasionally, until soft, about 5 minutes. Add the garlic, rosemary and thyme and continue to cook, stirring, for 1 minute more. Increase the heat to high, add the fresh and rehydrated mushrooms, and saute until the mushrooms are tender and the liquid they released has completely evaporated, 8 to 10 minutes. Transfer to a plate and let cool. ",
    "5.\tOn a floured work surface, roll out the dough into a 12-inch round. Transfer to an ungreased baking sheet. Crumble the blue cheese into a bowl, add the cooled mushrooms and stir well. Spread the mixture over the dough, leaving a 1 1/2-inch border. Fold the border over the mushrooms and cheese, pleating the edge to make it fit. The center will be open.",
    "6.\tBake until golden brown, 30 to 40 minutes. Remove from the oven, let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature. Serves 6. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/when-the-funk-hits-the-fan1.jpg?w=500",
  "ingredient_list": [
    "For the pastry:",
    "1 1/4 cups all-purpose flour",
    "1/4 teaspoon salt",
    "8 tablespoons (1 stick) unsalted butter, cut into pieces",
    "1/4 cup sour cream",
    "2 teaspoons fresh lemon juice",
    "1/4 cup ice water",
    "For the filling:",
    "1/4 ounce dried wild mushrooms, such as chanterelles, porcini or shiitakes",
    "1 cup boiling water",
    "2 tablespoons unsalted butter",
    "3/4 cup sliced green onions",
    "1 garlic clove, minced",
    "1/2 teaspoon chopped fresh rosemary",
    "1/2 teaspoon chopped fresh thyme",
    "1/2 lb. assorted fresh wild mushrooms, such as",
    "chanterelles, porcini and shiitakes, brushed",
    "clean and large mushrooms thinly sliced",
    "1/2 lb. fresh button mushrooms, brushed clean",
    "and thinly sliced",
    "5 ounces Stilton or other good-quality blue cheese"
  ],
  "tags": [
    "Mushrooms",
    "Photo",
    "Tarts/Quiche",
    "Vegetarian"
  ],
  "title": "wild mushroom and stilton galette",
  "url": "https://smittenkitchen.com/2006/10/when-the-funk-hits-the-fan/"
}