{
  "date": "2013-08-28T08:53:38+00:00",
  "directions": [
    "Combine the cream, brown sugar and butter in the bottom of a medium, heavy saucepan over medium-high heat. Bring the mixture to a boil, then reduce the heat and let it simmer for 10 minutes, stirring occasionally in the beginning and more frequently as it reduces and thickens. You’ll know it’s done when it becomes a bit darker, more syrupy, and smells toasty. ",
    "Add cornstarch and slowly whisk in milk. Raise heat to medium. Cook mixture, stirring frequently, until it thickens slightly, anywhere from 5 to 10 minutes. Remove from heat and add vanilla and sea salt. Taste mixture and adjust salt, if needed.",
    "Cool mixture to lukewarm before pouring into popsicle molds. You can hasten this along by setting the pot or bowl with the butterscotch pudding batter in a larger bowl partially filled with ice water, and stirring it for a few minutes.",
    "Pour into popsicle molds and freeze as manufacturer directs. If using makeshift molds, let popsicles freeze about halfway (30 to 60 minutes, depending on size) before inserting popsicle sticks, then freeze the rest of the way.",
    "Popsicle molds: I use these guys. I have the metal version, which was all that was available when I bought them a couple years ago, but the metal parts are not dishwasher safe and don’t hold the popsicle sticks in place as well as I understand the plastic ones do, so if I were buying them again, I’d opt for plastic."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/butterscotch-pudding-popsicles.jpg?w=750",
  "ingredient_list": [
    "3/4 cup heavy whipping cream",
    "3/4 cup packed dark brown sugar",
    "2 tablespoons unsalted butter, at room temperature",
    "3/4 teaspoon vanilla extract",
    "1/4 teaspoon flaky sea salt, or to taste (use less of a fine sea salt)",
    "1 tablespoon cornstarch",
    "1 1/2 cups whole milk"
  ],
  "tags": [
    "Photo",
    "Popsicles",
    "Summer"
  ],
  "title": "butterscotch pudding popsicles",
  "url": "https://smittenkitchen.com/2013/08/butterscotch-pudding-popsicles/"
}