[
    {
        "ingredient_list": [
            "1/3 cup shelled roasted salted pistachios", 
            "4  large bananas, ripe but not mushy", 
            "A scant 1/2 cup Nutella or another chocolate-hazelnut (gianduja) spread", 
            "Flavorings (see Note up top), if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/banana-nutella-and-salted-pistachio-popsicles1.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Photo", 
            "Popsicles", 
            "Quick", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/07/banana-nutella-and-salted-pistachio-popsicles/", 
        "title": "banana, nutella and salted pistachio popsicles", 
        "directions": [
            "Grind pistachios to a powder. Set aside.", 
            "Peel bananas and break them into chunks. Puree them with any flavorings you might want to add. You should have about 2 cups puree.", 
            "Scoop Nutella into a small plastic bag and snip off the corner. (Trust me, fake-piping it into the narry molds is easier than trying to spoon it in.) Pour a little banana into each mold, then squiggle in a little Nutella. Repeat a couple times, trying to make sure that every bite or two will have Nutella in it, using about 1 tablespoon of Nutella in each popsicle. Fill molds to about 1/4-inch before the top, to leave room for expansion when freeze.", 
            "If using molds that contain sticks or hold wooden ones in place, snap on lids and freeze until solid, about 5 hours. If using glasses or open cup molds, freeze until beginning to set (about 1 1/2 to 2 hours), then insert the sticks until freeze until fully solid. If using instant popsicle makers, I’m jealous, just follow the manufacturer’s instructions.", 
            "Once frozen, spread pistachios out on a cold plate. Unmold popsicles and roll them all or partially in the nuts. Go outside to eat them so you don’t sticky up the kitchen floor.", 
            "Popsicle molds: I use these guys. I have the metal version, which was all that was available when I bought them a couple years ago, but the metal parts are not dishwasher safe and don’t hold the popsicle sticks in place as well as I understand the plastic ones do, so if I were buying them again, I’d opt for plastic."
        ], 
        "date": "2013-07-26T11:38:56+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup heavy whipping cream", 
            "3/4 cup packed dark brown sugar", 
            "2 tablespoons unsalted butter, at room temperature", 
            "3/4 teaspoon vanilla extract", 
            "1/4 teaspoon flaky sea salt, or to taste (use less of a fine sea salt)", 
            "1 tablespoon cornstarch", 
            "1 1/2 cups whole milk"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/butterscotch-pudding-popsicles.jpg?w=750", 
        "tags": [
            "Photo", 
            "Popsicles", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/08/butterscotch-pudding-popsicles/", 
        "title": "butterscotch pudding popsicles", 
        "directions": [
            "Combine the cream, brown sugar and butter in the bottom of a medium, heavy saucepan over medium-high heat. Bring the mixture to a boil, then reduce the heat and let it simmer for 10 minutes, stirring occasionally in the beginning and more frequently as it reduces and thickens. You’ll know it’s done when it becomes a bit darker, more syrupy, and smells toasty. ", 
            "Add cornstarch and slowly whisk in milk. Raise heat to medium. Cook mixture, stirring frequently, until it thickens slightly, anywhere from 5 to 10 minutes. Remove from heat and add vanilla and sea salt. Taste mixture and adjust salt, if needed.", 
            "Cool mixture to lukewarm before pouring into popsicle molds. You can hasten this along by setting the pot or bowl with the butterscotch pudding batter in a larger bowl partially filled with ice water, and stirring it for a few minutes.", 
            "Pour into popsicle molds and freeze as manufacturer directs. If using makeshift molds, let popsicles freeze about halfway (30 to 60 minutes, depending on size) before inserting popsicle sticks, then freeze the rest of the way.", 
            "Popsicle molds: I use these guys. I have the metal version, which was all that was available when I bought them a couple years ago, but the metal parts are not dishwasher safe and don’t hold the popsicle sticks in place as well as I understand the plastic ones do, so if I were buying them again, I’d opt for plastic."
        ], 
        "date": "2013-08-28T08:53:38+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons (21 grams or 3/4 ounce) semisweet chocolate chips or chopped semisweet chocolate", 
            "1/3 cup (67 grams or 2 1/3 ounce) sugar", 
            "1 tablespoon (7 grams or 1/4 ounce) cornstarch", 
            "1 1/2 tablespoons (8 grams or 1/4 ounce) unsweetened cocoa powder", 
            "1 1/4 cups (300 ml) whole milk", 
            "Pinch of salt", 
            "1/2 teaspoon (3 ml) vanilla extract", 
            "1/2 tablespoon (7 grams or 1/4 ounce) unsalted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/06/fudge-popsicles.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Photo", 
            "Popsicles", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2011/06/fudge-popsicles/", 
        "title": "fudge popsicles", 
        "directions": [
            "In the bottom of a medium saucepan over very low heat, gently melt the chocolate chips, stirring constantly until smooth. Stir in sugar, cornstarch, cocoa powder, milk and salt and raise heat to medium. Cook mixture, stirring frequently until it thickens, anywhere between 5 minutes (for me) and 10 (suggested in the book). Remove from heat, add vanilla and butter and stir until combined.", 
            "Set aside to cool slightly then pour into popsicle molds. Freeze 30 minutes, then insert popsicle sticks. Freeze the rest of the way before serving.", 
            "* I’ll jump ahead of the question someone usually asks and tell you that I bought popsicle molds intended for feeding babies. I liked that they were tiny as I was pretty sure my one year-old doesn’t need to be eating an adult-sized popsicle this summer. Nor do I need to be washing it out of his clothes. :) The popsicle maker works just fine, but because it’s in one piece, it’s best to unmold them all together (dipping the base in warm water). From there, you can spread them out on a tray in the freezer until they firm up again, then store them in a freezer bag for the long term. I didn’t use the sticks they provide; I remember from my own childhood that they get all chewed up and easily lost when you are sent outside with your drippy sticky treat. I instead bought disposable popsicle sticks, though I’m sure they’re even cheaper from a crafts store."
        ], 
        "date": "2011-06-02T13:26:35+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/9591713189_12ac7b9e56_h.jpg?w=750", 
        "tags": [
            "Citrus", 
            "Lime", 
            "Photo", 
            "Popsicles", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/08/key-lime-pie-popsicles/", 
        "title": "key lime pie popsicles", 
        "directions": [
            "Zest however many of the limes needed until you have 2 teaspoons total in the bottom of a medium bowl. Juice limes until you have 3/4 cup fresh lime juice. Add juice, condensed milk, half-and-half and salt to zest and whisk together until thoroughly combined. Pour into popsicle molds. Freeze for about 5 hours, or until completely frozen. ", 
            "Dip in lukewarm water for 10 seconds to unmold each popsicle and press each side into crushed cookie crumbs, coating completely. "
        ], 
        "date": "2013-08-26T09:14:29+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup water", 
            "1/2 cup sugar", 
            "1 cup whole raspberries", 
            "2 cups peeled chopped peaches in small/medium chunks", 
            "1/8 teaspoon almond extract (optional)", 
            "1 1/2 cups vanilla ice cream, frozen yogurt or non-dairy vanilla ice cream of your choice, slightly softened (think: soft-serve consistency)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_4528.jpg?w=750", 
        "tags": [
            "Ice Cream/Sorbet", 
            "Peach", 
            "Photo", 
            "Popsicles", 
            "Raspberries", 
            "Recipes", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/08/peach-melba-popsicles/", 
        "title": "peach melba popsicles", 
        "directions": [
            "Combine sugar and water in a small-medium saucepan (intentionally larger than it requires) and bring to a simmer; stir until sugar dissolves. Pour 1/4 cup syrup (just eyeball it — it’s 1/3 of mixture) over raspberries in a bowl. Add peach chunks to remaining syrup in saucepan and bring back to a simmer, cook for 1 to 2 minute, until they soften. Let both raspberries and peaches cool in syrup. The raspberries will quickly but you can hasten the peaches along by setting them in a larger bowl of ice water for 10 to 15 minutes. In a blender or food processor, puree peaches and their syrup first, then scrape into a measuring cup with a spout and stir in almond extract, if using, then puree raspberries and place in a smaller spouted cup. (The raspberry color would muddle the peach puree much more than vice-versa, hence blending peaches first.)\nPour a tiny splash of raspberry (you’ll only want to use half of your total sauce) in the bottom of each popsicle mold or small glass that you’re using as a mold (I like champagne flutes, for this and really everything), following by a larger splash of peaches (again, using about half the puree) and dolloping in a little softened ice cream. Repeat with remaining raspberry, peaches and ice cream. Use a skewer to lightly marble the mixtures together — I get the best swirls by swiping the skewer right along the inside of each mold. Freeze popsicles according to manufacturer’s instructions."
        ], 
        "date": "2016-08-04T11:44:04+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup granulated sugar", 
            "1 3/4 cups water (1 cup can be very cold)", 
            "1 cup (about 5 ounces or 140 grams) fresh or frozen raspberries", 
            "1 cup lemon juice (from approximately 7 to 8 lemons)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/9625541640_9753729a31_o.jpg?w=750", 
        "tags": [
            "Citrus", 
            "Lemon", 
            "Photo", 
            "Popsicles", 
            "Raspberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/08/pink-lemonade-popsicles/", 
        "title": "pink lemonade popsicles", 
        "directions": [
            "No popsicle molds? You could any kind of tiny cup to mold them instead, but my favorite is a champagne flute for shape; you could even use those disposable plastic ones. When the mixture is halfway frozen, insert a popsicle stick and now no retro popsicle mold needs to come between you and Popsicle Week.", 
            "To unmold: To unmold popsicles, dip the frozen molds in a warm bowl of water. I give them a tug every couple seconds to see if they’re loose yet because I don’t want to soften them any more thn absolutely necessary. If the stick comes out before the popsicle (boo!), they just weren’t frozen enough. You’ll want to freeze most popsicles for 5 to 6 hours, just to be certain they’re hard enough to unmold.", 
            "To store popsicles: Here’s how I do it: I put a tray in the freezer and cover it with waxed or parchment paper, just long enough for it to get cold. I unmold all of the popsicles and place them on the tray, and refreeze them for 10 minutes out of their molds before putting them in a freezer bag. This extra step ensures that any melting/softening that happens when you unmold them doesn’t mess up their shapes or cause them to stick to one another. You can also separate them in their freezer bags by extra strips of waxed or parchment paper. Then you can wash the molds and use them again for everything you may have missed this week."
        ], 
        "date": "2013-08-30T08:47:00+00:00"
    }, 
    {
        "ingredient_list": [
            "4 slightly heaped cups (about 20 ounces) fresh, ripe strawberries, hulled and quartered", 
            "2/3 to 3/4 cup granulated sugar (we used the latter but use less if you’re sensitive to sugar)", 
            "1/2 cup water", 
            "Juice of 2 limes", 
            "1/4 to 1/2 teaspoon freshly ground black pepper (use less for a barely detectable bite, more if you’d like it more present)", 
            "Pinch of sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/9460534513_208e0df831_k.jpg?w=750", 
        "tags": [
            "Lime", 
            "Photo", 
            "Popsicles", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/08/strawberry-lime-and-black-pepper-popsicles/", 
        "title": "strawberry, lime and black pepper popsicles", 
        "directions": [
            "Combine the strawberries and sugar in a bowl; let them sit for 15 minutes if they’re really fresh, longer if they’re firm or off-season berries. Transfer mixture to a saucepan and add the water. Bring to a boil then reduce to a simmer, and cook for 5 minutes. Let cool to room temperature. You can hasten this along by transferring them back to their macerating bowl and setting that in a bowl of ice water. ", 
            "Once cooled, transfer to a blender or food processor, add the lime juice, pepper and salt and blend until mostly smooth (I find some leftover bits lovely in here). Divide between popsicle molds. ", 
            "[You’ll have about 3 1/4 cups of the mixture, which divides evenly among 10 1/3-cup molds, with 1/4-inch space on top to make room for expansion in freezing.]", 
            "Freeze for about 5 hours, or until completely frozen. Dip in lukewarm water for 10 seconds to unmold each popsicle.", 
            "If After-Bedtime Dipping: Put a shot of white tequila in a glass wide enough to dip popsicle. Yes, you can double-dip."
        ], 
        "date": "2013-08-08T11:14:37+00:00"
    }, 
    {
        "ingredient_list": [
            "2 level cups fresh blackberries, or the berry of your choice", 
            "2 tablespoons (40 grams) honey", 
            "1/2 lemon or 1 small lime", 
            "1/2 cup (120 grams) water", 
            "1/2 cup (100 grams) granulated sugar", 
            "1 1/2 cups (340 grams) plain unsweetened Greek-style yogurt (1 cup fage = 227 grams)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/swirled-berry-yogurt-popsicles1.jpg?w=640", 
        "tags": [
            "Blackberries", 
            "Breakfast", 
            "Photo", 
            "Popsicles", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2015/05/swirled-berry-yogurt-popsicles/", 
        "title": "swirled berry yogurt popsicles", 
        "directions": [
            "If your berries are large, especially blackberries, cut them in half. Place berries in non-reactive (i.e. not aluminum or tin, which I suspect you weren’t using anyhow) bowl and squeeze 1 tablespoon lemon juice over it (save the peel; you’re about to use it). Add honey, stir to combine. Set aside.", 
            "Place lemon peel, water and sugar in a saucepan. Cook, stirring, until it comes to a boil and sugar has dissolved. Gently simmer for 5 minutes more. Strain out peel and chill syrup completely. You can do this in the fridge, but I find it much quicker to set the bowl of syrup in a larger bowl of ice water. Within 15 minutes, it should be quite cold to the touch.", 
            "Whisk yogurt and chilled syrup together. ", 
            "Place the berry mixture and any juices that have accumulated in a blender and whirl until desired texture. (I left a few tiny chunks throughout.) If you loathe the seeds from raspberries or blackberries, puree fully and press through a fine-mesh strainer to remove seeds. Assemble popsicles by alternating pouring a little of the yogurt mixture, then a little of the berry mixture into each popsicle mold, repeating as desired until you reach 1/4-inch from the tops (to leave room for expansion as they freeze). Use a skewer to lightly swirl the mixtures together.", 
            "If using conventional molds, snap on the lid and freeze until solid, 3 to 4 hours. If using glasses or other unconventional molds, freeze until the pops are beginning to set (45 minutes to 1 hour), then insert the sticks and freeze until solid, 3 to 4 hours. If using an instant ice pop maker, follow the manufacturer’s instructions.", 
            "My popsicle molds: Can be found here."
        ], 
        "date": "2015-05-20T12:05:56+00:00"
    }
]