{
  "date": "2016-08-04T11:44:04+00:00",
  "directions": [
    "Combine sugar and water in a small-medium saucepan (intentionally larger than it requires) and bring to a simmer; stir until sugar dissolves. Pour 1/4 cup syrup (just eyeball it — it’s 1/3 of mixture) over raspberries in a bowl. Add peach chunks to remaining syrup in saucepan and bring back to a simmer, cook for 1 to 2 minute, until they soften. Let both raspberries and peaches cool in syrup. The raspberries will quickly but you can hasten the peaches along by setting them in a larger bowl of ice water for 10 to 15 minutes. In a blender or food processor, puree peaches and their syrup first, then scrape into a measuring cup with a spout and stir in almond extract, if using, then puree raspberries and place in a smaller spouted cup. (The raspberry color would muddle the peach puree much more than vice-versa, hence blending peaches first.)\nPour a tiny splash of raspberry (you’ll only want to use half of your total sauce) in the bottom of each popsicle mold or small glass that you’re using as a mold (I like champagne flutes, for this and really everything), following by a larger splash of peaches (again, using about half the puree) and dolloping in a little softened ice cream. Repeat with remaining raspberry, peaches and ice cream. Use a skewer to lightly marble the mixtures together — I get the best swirls by swiping the skewer right along the inside of each mold. Freeze popsicles according to manufacturer’s instructions."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_4528.jpg?w=750",
  "ingredient_list": [
    "1/2 cup water",
    "1/2 cup sugar",
    "1 cup whole raspberries",
    "2 cups peeled chopped peaches in small/medium chunks",
    "1/8 teaspoon almond extract (optional)",
    "1 1/2 cups vanilla ice cream, frozen yogurt or non-dairy vanilla ice cream of your choice, slightly softened (think: soft-serve consistency)"
  ],
  "tags": [
    "Ice Cream/Sorbet",
    "Peach",
    "Photo",
    "Popsicles",
    "Raspberries",
    "Recipes",
    "Summer"
  ],
  "title": "peach melba popsicles",
  "url": "https://smittenkitchen.com/2016/08/peach-melba-popsicles/"
}