{
  "date": "2012-08-07T16:43:21+00:00",
  "directions": [
    "Preheat your broiler. Place your pepper on a baking sheet and cook it under the broiler until all sides are charred, turning with with tongs as needed. Don’t skimp on the charring as this skin will add a fantastic flavor dimension. Mine took about 15 minutes, but I have a terrible broiler. Yours might only take 5 to 8 minutes. Transfer pepper to a mesh sieve set over a blender jar or food processor work bowl to cool until you’re able to handle it, about 15 minutes.",
    "Tear open the pepper and remove the seeds and membranes with your fingers or a paring knife. Add the pepper (with its skin) to the blender along with the remaining ingredients. Puree mixture until as smooth as possible. Transfer mixture to a small saucepan. Simmer it gently over low heat for 15 minutes, stirring from time to time. It will yield a fairly smooth that can be used as is, but if you’d like a smoother consistency, you have two options: running it back through the blender or food processor again (I got a smoother blender after the fibers had cooked down more on the stove) or pressing it through that fine-mesh sieve (I started doing this, then decided it wasn’t worth the trouble). ",
    "Store in an airtight jar in the fridge for one week, though I suspect it will keep for two."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/charred-pepper-steak-sauce1.jpg?w=500",
  "ingredient_list": [
    "1 red bell pepper, small was suggested, I used a large and didn’t regret it",
    "2/3 cup canned or fresh tomato purée",
    "1/4 cup orange juice",
    "2 tablespoons Worcestershire sauce",
    "2 tablespoons olive oil",
    "1 tablespoon balsamic vinegar",
    "1 tablespoon molasses",
    "3/4 teaspoon table salt or more to taste",
    "1 teaspoon ground mustard",
    "1/2 teaspoon ground ginger",
    "1/4 teaspoon freshly ground black pepper",
    "1/4 teaspoon onion powder",
    "1/8 teaspoon ground allspice"
  ],
  "tags": [
    "Meat",
    "Peppers",
    "Photo",
    "Quick",
    "Summer"
  ],
  "title": "charred pepper steak sauce",
  "url": "https://smittenkitchen.com/2012/08/charred-pepper-steak-sauce/"
}