{
  "date": "2007-12-02T23:04:55+00:00",
  "directions": [
    "Heat the oven to 375°F. Lightly flour a work surface, lay the sheet of pastry out, and gently roll until it measures about 11 x 15 inches. Slide the pastry onto a baking sheet lined with parchment paper. Prick the pastry all over with a fork, at about 1-inch intervals. ",
    "Spread the tomato puree or sauce evenly over the pastry, leaving a one-inch border around the edges. ",
    "Trim the ends off the eggplant, zucchini and yellow squash. As carefully as you can, trim the ends off the red pepper and remove the core, leaving the edges intact, like a tube. ",
    "On a mandoline, adjustable-blade slicer or with a very sharp knife, cut the eggplant, zucchini, yellow squash and red pepper into very thin slices, approximately 1/16-inch thick.",
    "Arrange slightly overlapped slices of vegetables concentrically or in rows over the tomato puree or sauce, alternative vegetables. You’ll probably have a few leftover.",
    "Drizzle vegetables with olive oil, season with salt and pepper and sprinkle de-stemmed thyme leaves over the vegetables.  ",
    "Bake in the heated oven until the pastry is puffed and browned (including on the bottom), 25 to 30 min and the vegetables look softened. Slide onto a cutting board, sprinkle with the feta, and cut into squares or strips. (A pizza wheel worked surprisingly well for this.) Serve warm or at room temperature.",
    "* I don’t know how widely distributed it is, but those of you in NYC should look for a locally made (like, it’s practically closer for me to walk over to the factory) puff pastry from brand called DuFour that –once you get past the steep price tag–will blow your mind. Prior to trying it, I thought puff pastry was flaky, messy, dry and unsubstantial, pretty for sure but not fun to eat. Once I tried Dufour, I was immediately besmitten. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/ratatouille-tart1.jpg?w=500",
  "ingredient_list": [
    "14 ounces frozen puff pastry, defrosted in the fridge overnight*",
    "1 Asian eggplant",
    "1 smallish zucchini",
    "1 smallish yellow squash",
    "1 longish red bell pepper",
    "1/3 cup tomato puree (such as Pomi) or canned plain tomato sauce",
    "2 tablespoons olive oil",
    "Salt and pepper",
    "Few sprigs fresh thyme",
    "1 cup crumbled feta "
  ],
  "tags": [
    "Eggplant",
    "Peppers",
    "Photo",
    "Summer",
    "Summer Squash",
    "Tarts/Quiche",
    "Vegetarian",
    "Zucchini"
  ],
  "title": "ratatouille tart",
  "url": "https://smittenkitchen.com/2007/12/ratatouille-tart/"
}