{
  "date": "2008-10-17T12:00:57+00:00",
  "directions": [
    "1. Preheat oven to 350 degrees. Butter a 9-inch square baking pan or dish.  Cut a length of parchment that will cover the bottom and two sides (makes it much easier to remove), and line the pan with it. Butter the lining as well. (Deb note: I used an 8-inch square, because it was what I had. It works, too, but the brownies are crazy thick and take much longer to bake, just to give you a heads-up.)",
    "2. Melt chocolate and butter in a heatproof bowl set over a pan of simmering water, stirring occasionally until smooth.",
    "3. Whisk together flour, baking powder, cayenne, and salt in a large bowl; set aside. Put sugar, eggs, and vanilla in the bowl of an electric mixer fitted with the paddle attachment; beat until fluffy and well combined, 3 to 5 minutes. Beat in flour mixture.",
    "4. Pour half of batter (about two cups) into a separate bowl and stir chocolate mixture into it. If you find that it is a little thick (as mine was) add a little more batter (a few tablespoons or so) until it is more pourable. This is important because mine was quite thick, and the pumpkin half was quite thin, so I had trouble swirling the two together. ",
    "5. In other bowl, stir in the pumpkin, oil, cinnamon, and nutmeg. Transfer half of chocolate batter to prepared pan smoothing top with a rubber spatula. Top with half of pumpkin batter. Repeat to make one more chocolate layer and one more pumpkin layer. Work quickly so batters don’t set.",
    "6. With a small spatula or a table knife, gently swirl the two batters to create a marbled effect. Be sure to get your knife all the way to the bottom of the pan–I didn’t, and ended up with a chocolate base, not that it is such a bad thing. Sprinkle with nuts, if using.",
    "7. Bake until set, 40 to 45 minutes. Let cool in pan on a wire rack. Cut into 16 squares. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pumpkin-swirl-brownies1.jpg?w=500",
  "ingredient_list": [
    "8 tablespoons (1 stick) unsalted butter, plus more for pan",
    "6 ounces bittersweet chocolate, chopped",
    "2 cups all-purpose flour",
    "1 teaspoon baking powder",
    "1/8 teaspoon cayenne pepper",
    "1/2 teaspoon salt",
    "1 1/2 to 3/4 cups sugar (the original recipe calls for the larger amount; I think it could be dialed down a bit)",
    "4 large eggs",
    "1 tablespoon pure vanilla extract",
    "1 1/4 cups solid-pack pumpkin",
    "1/4 cup vegetable oil",
    "1 teaspoon ground cinnamon",
    "1/4 teaspoon ground nutmeg",
    "1/2 cup chopped hazelnuts or other nuts (optional)"
  ],
  "tags": [
    "Brownies/Blondies",
    "Chocolate",
    "Fall",
    "Photo",
    "Pumpkin"
  ],
  "title": "pumpkin swirl brownies",
  "url": "https://smittenkitchen.com/2008/10/pumpkin-swirl-brownies/"
}