[
    {
        "ingredient_list": [
            "7 ounces (198 grams) almond paste", 
            "1/4 cup (50 grams) granulated sugar", 
            "1 large egg white", 
            "Two pinches of sea salt", 
            "1 1/4 cup (130 grams) sliced almonds, blanched are more traditional", 
            "6 ounces semi- or bittersweet chocolate, chopped or in chips (about 1 cup)", 
            "Colored sprinkles (optional, but not really)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/04/almond-horns-mandelhoernchen.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Cookie", 
            "Gluten-Free", 
            "Passover", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2017/04/almond-horn-cookies/", 
        "title": "almond horn cookies", 
        "directions": [
            "Heat oven to 350 degrees F. Line a large baking sheet with parchment paper.\nMake cookie dough: Cut, tear or grate paste and place in bowl with the paddle attachment of a stand mixer. (Mine was quite soft, so I just dropped it in in hand-torn chunks.) Add sugar and beat, covering lip of bowl with dishtowel to get bits from flying out, until almond paste cannot be broken up any further, approximately 3 to 5 minutes at a medium-high speed. Add egg white and salt and beat until uniform and creamy. Place sliced almonds in a wide-shallow bowl or plate. Have another bowl with water to get your hands wet.", 
            "Form cookies: Wet hands and scoop 1 tablespoon of dough (can use a measuring spoon, a little overfilled is fine) into your palms. It’s going to be very soft and you’re going to think something has gone very wrong; it it has not. Just keep your hands wet and roll it into a 4-ish inch log (I just stretched it across my hand, as you can see in the photo above) and drop it into the bowl of almonds. Wipe your hands dry on a towel (or the almonds stick to your hands, pulling them off the cookie) and roll log through it. Again, it’s quite soft and will seem weird at first but do you best and transfer the soft almond-covered log to the prepared tray and arc it into a horn shape. Press any loose almonds back on. Repeat with remaining dough. ", 
            "Bake cookies: For 15 minutes, or until almonds on cookies are gently toasted and horns are puffed. Let cool completely.\nTo finish: Melt chocolate in a small bowl and dip ends of cookies into it, then return to parchment-lined tray to set. Add sprinkles (optional, but of course you want to).\nDo ahead: Once chocolate is set, these keep in a tin for a week.\n"
        ], 
        "date": "2017-04-07T11:54:53+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds fresh, best-quality tomatoes (results are uneven with less fresh ones)", 
            "1 small garlic clove, minced", 
            "2 tablespoons fresh lemon juice or red wine vinegar", 
            "1 teaspoon coarse salt, plus more to taste (I used 2 teaspoons total Diamond kosher salt)", 
            "1 teaspoon sugar (optional, I found this unnecessary)", 
            "1/2 teaspoon freshly ground black pepper", 
            "1 poud dried capellini or angel-hair spaghetti", 
            "1/2 cup chopped fresh basil", 
            "To serve: grated ricotta salata (my choice) or Parmigiano-Reggiano and a drizzle of your favorite olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/08/angel-hair-pasta-with-fresh-tomato-sauce1.jpg?w=640", 
        "tags": [
            "Italian", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/08/angel-hair-pasta-with-raw-tomato-sauce/", 
        "title": "angel hair pasta with raw tomato sauce", 
        "directions": [
            "Halve the first pound of tomatoes crosswise, then rub the cut sides against the large holes of a box grater set in a large bowl, discarding the skin. Core (see note up top) and chop the last two pounds of tomatoes and add to the grated tomato bowl. Add garlic, lemon juice or vinegar, salt, sugar (if using) and pepper and let marinate at room temperature until ready to use, at least 10 minutes but also up to 2 hours if you’re planning ahead. After it has steeped for a while, taste and adjust seasonings as needed.", 
            "Cook pasta in salted boiling water as package time recommends. Drain then toss with fresh sauce and basil. Serve lukewarm (as it is now) or at room temperature with a drizzle of olive oil and freshly grated cheese on top."
        ], 
        "date": "2015-08-24T11:56:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound spiral-shaped pasta", 
            "1 pound slender asparagus spears, trimmed, cut into 1- to 1 1/2-inch pieces", 
            "1/4 cup olive oil", 
            "1 tablespoon finely grated lemon peel", 
            "2 teaspoons chopped fresh tarragon plus more for garnish", 
            "1 5- to 5 1/2-ounce log soft fresh goat cheese (the pre-crumbled stuff will not melt as well)", 
            "Fresh lemon juice to taste (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/asparagus-goat-cheese-and-lemon-pasta1.jpg?w=500", 
        "tags": [
            "Asparagus", 
            "Budget", 
            "Lemon", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2009/05/asparagus-goat-cheese-and-lemon-pasta/", 
        "title": "asparagus, goat cheese and lemon pasta", 
        "directions": [
            "Cook your pasta in a large pot of well-salted water until it is almost tender, or about three minutes shy of what the package suggests. Add asparagus and cook until firm-tender, another two to three minutes. Drain both pasta and asparagus together, reserving one cup of pasta water.", 
            "Meanwhile, combine olive oil, lemon peel, tarragon and cheese in a large bowl, breaking up the goat cheese as you put it in. Add hot pasta and asparagus to bowl, along with a couple slashes of the pasta water. Toss until smoothly combined, adding more pasta water if needed. Season generously with salt and pepper, and lemon juice if you feel it needs a little extra kick. (We did.)"
        ], 
        "date": "2009-05-17T17:50:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound large, thick, firm asparagus, lower third of the stalks peeled with a vegetable peeler or snapped off", 
            "1/4 cup good olive oil", 
            "4 ounces Spanish chorizo (but Portuguese chouriço will work as well), cut into 3/4-inch pieces", 
            "1 1/2 cups 3/4-inch bread cubes (croutons), preferably from a baguette or country bread loaf", 
            "1/4 cup whole almonds", 
            "1 cup cooked beans (optional; I used 3/4 pound fresh cranberry beans, shelled then boiled for 20 minutes in lightly salted water)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/asparagus-with-chorizo-and-croutons.jpg?w=753", 
        "tags": [
            "Asparagus", 
            "Meat", 
            "Photo", 
            "Quick", 
            "Spanish", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2009/07/asparagus-with-chorizo-and-croutons/", 
        "title": "asparagus with chorizo and croutons", 
        "directions": [
            "Make this right as you are ready to eat. Cut each asparagus stalk into 3 or 4 pieces. Heat the oil in a large skillet until very hot. Add all the ingredients except the beans, if using, and salt and pepper. Cover and sauté over high heat for 5 to 6 minutes (thinner asparagus might be done sooner), tossing or stirring the mixture a few times, so it browns and cooks on all sides. Add the beans, if using, and salt and pepper, toss again, and serve."
        ], 
        "date": "2009-07-21T21:04:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup black beans, cooked, drained (about 2/3 of a 15-ounce can)", 
            "1 large bell pepper, finely diced (I used a mix of colors because we keep them around for the kid)", 
            "1/4 cup finely diced white or red onion", 
            "1 small jalapeno, seeded and minced", 
            "1/4 cup olive oil", 
            "2 tablespoons freshly squeezed lime juice (from about 1 lime)", 
            "1/4 teaspoon coarse salt, plus more to taste", 
            "1/2 teaspoon ground cumin", 
            "Dashes of hot sauce or pinches of cayenne, to taste", 
            "Chopped cilantro for garnish", 
            "4 ripe avocados", 
            "1 cup finely diced cucumber (from about half a long English or 2 small Persian cukes), seeds removed", 
            "1 cup finely diced radishes (from about 4 large red ones)", 
            "2 scallions, finely chopped", 
            "4 tablespoons toasted sesame oil", 
            "2 teaspoons white miso (shiromiso, which is more mild/less salty)", 
            "2 tablespoons rice vinegar", 
            "1/2 teaspoon finely grated or minced fresh ginger root (or more to taste)", 
            "1 teaspoon white sesame seeds, toasted", 
            "1 teaspoon black sesame seeds", 
            "4 ripe avocados"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/avocado-cup-salads-two-ways1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Avocado", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/04/avocado-cup-salads-two-ways/", 
        "title": "avocado cup salads, two ways", 
        "directions": [
            "Mix cucumber, radishes and scallions in a medium bowl. In a small dish, whisk sesame oil, miso, rice vinegar and ginger. Add dressing flavor and seasonings to taste. Halve avocados and remove pits. Score avocado halves with a knife, cutting lines in both directions to form a grid, but being careful not to through the skin. ", 
            "If you’re serving all four avocados right away, go ahead and mix the dressing and salad ingredients together, then heap each avocado half with salad and dressing and garnish with mix of sesame seeds. If you’d like to stretch this over several days of lunches or the like, keep the mixed salad ingredients and dressing in separate dishes. When you’re ready to eat, cut and score your avocado, dot a little dressing directly on each half, heap with salad filling and drizzle with more dressing. Garnish with mix of seeds. ", 
            "Eat with a spoon. "
        ], 
        "date": "2014-04-23T12:13:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup shelled roasted salted pistachios", 
            "4  large bananas, ripe but not mushy", 
            "A scant 1/2 cup Nutella or another chocolate-hazelnut (gianduja) spread", 
            "Flavorings (see Note up top), if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/banana-nutella-and-salted-pistachio-popsicles1.jpg?w=750", 
        "tags": [
            "Bananas", 
            "Photo", 
            "Popsicles", 
            "Quick", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/07/banana-nutella-and-salted-pistachio-popsicles/", 
        "title": "banana, nutella and salted pistachio popsicles", 
        "directions": [
            "Grind pistachios to a powder. Set aside.", 
            "Peel bananas and break them into chunks. Puree them with any flavorings you might want to add. You should have about 2 cups puree.", 
            "Scoop Nutella into a small plastic bag and snip off the corner. (Trust me, fake-piping it into the narry molds is easier than trying to spoon it in.) Pour a little banana into each mold, then squiggle in a little Nutella. Repeat a couple times, trying to make sure that every bite or two will have Nutella in it, using about 1 tablespoon of Nutella in each popsicle. Fill molds to about 1/4-inch before the top, to leave room for expansion when freeze.", 
            "If using molds that contain sticks or hold wooden ones in place, snap on lids and freeze until solid, about 5 hours. If using glasses or open cup molds, freeze until beginning to set (about 1 1/2 to 2 hours), then insert the sticks until freeze until fully solid. If using instant popsicle makers, I’m jealous, just follow the manufacturer’s instructions.", 
            "Once frozen, spread pistachios out on a cold plate. Unmold popsicles and roll them all or partially in the nuts. Go outside to eat them so you don’t sticky up the kitchen floor.", 
            "Popsicle molds: I use these guys. I have the metal version, which was all that was available when I bought them a couple years ago, but the metal parts are not dishwasher safe and don’t hold the popsicle sticks in place as well as I understand the plastic ones do, so if I were buying them again, I’d opt for plastic."
        ], 
        "date": "2013-07-26T11:38:56+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoon (30 grams) unsalted butter", 
            "2/3 cup (155 ml) heavy or whipping cream", 
            "1/2 cup (170 grams) light corn syrup, golden syrup, or honey", 
            "1/4 cup (50 grams) packed dark-brown sugar", 
            "1/4 cup (20 grams) cocoa powder", 
            "1/4 teaspoon fine or table sea salt", 
            "6 ounces (170 grams) semi- or bittersweet chocolate, chopped, or 1 cup semi- or bittersweet chocolate chips", 
            "1/2 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/best-hot-fudge-sauce.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Ice Cream/Sorbet", 
            "Quick", 
            "Recipes", 
            "Sweet Sauces and Condiments"
        ], 
        "url": "https://smittenkitchen.com/2017/06/best-hot-fudge-sauce/", 
        "title": "best hot fudge sauce", 
        "directions": [
            "Combine the butter, cream, sweeteners, cocoa, and salt in a small saucepan over medium heat and bring to a simmer. Simmer on low, stirring, for 3 to 5 more minutes after everything has melted, then remove from heat and stir in chopped chocolate or chocolate chips. Stir in vanilla.", 
            "It’s now ready to ladle over ice cream, although it thickens more as it begins to cool, so you could also wait for 15 to 20 minutes before doing so, if it’s not too unbearable. Pour leftovers into a jar or jars and refrigerate. Hot fudge sauce keeps chilled in the fridge at least a month and often two, although it’s rare it lasts that long."
        ], 
        "date": "2017-06-27T11:54:25+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups buttermilk", 
            "5 garlic cloves, peeled and smashed", 
            "1 tablespoon table salt", 
            "1 tablespoon granulated sugar", 
            "1 1/2 teaspoons paprika, plus extra for sprinkling (I used Hungarian, a smoked one would also be delicious)", 
            "Lots of freshly ground black pepper", 
            "2 1/2 to 3 pounds chicken parts (we used all legs)", 
            "Drizzle of olive oil", 
            "Flaked or coarse sea salt, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/01/buttermilk-roast-chicken.jpg?w=750", 
        "tags": [
            "Budget", 
            "Chicken", 
            "Gluten-Free", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2012/01/buttermilk-roast-chicken/", 
        "title": "buttermilk roast chicken", 
        "directions": [
            "Whisk buttermilk with garlic, table salt, sugar, paprika and lots of freshly ground black pepper in a bowl. Place chicken parts in a gallon-sized freezer bag (or lidded container) and pour buttermilk brine over them, then swish it around so that all parts are covered. Refrigerate for at least 2 but preferably 24 and up to 48 hours.", 
            "When ready to roast, preheat oven to 425 degrees. Line a baking dish with foil (not absolutely necessary, but Nigella suggested it and I never minded having dish that cleaned up easily). Remove chicken from buttermilk brine and arrange in dish. Drizzle lightly with olive oil, then sprinkle with additional paprika and sea salt to taste. Roast for 30 minutes (for legs; approximately 35 to 40 for breasts), until brown and a bit scorched in spots. Serve immediately. We enjoyed it with wild rice and green beans one night; roasted potatoes and, uh, more green beans another. (Yes, I have a habit.)"
        ], 
        "date": "2012-01-24T14:54:10+00:00"
    }, 
    {
        "ingredient_list": [
            "Soup", 
            "2 tablespoons olive oil", 
            "2 pounds carrots, peeled, thinly sliced", 
            "1 large onion, finely chopped", 
            "4 regular or 6 small garlic cloves, peeled and smashed", 
            "1 tablespoon finely chopped or grated ginger, or more to taste (it could easily be doubled)", 
            "4 cups vegetable broth", 
            "1/4 cup white miso paste, or more to taste", 
            "To finish", 
            "Drizzle of toasted sesame oil", 
            "2 scallions, very thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/carrot-soup-with-miso-and-sesame1.jpg?w=500", 
        "tags": [
            "Carrots", 
            "Gluten-Free", 
            "Photo", 
            "Quick", 
            "Soup", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/01/carrot-soup-with-miso-and-sesame/", 
        "title": "carrot soup with miso and sesame", 
        "directions": [
            "Heat oil in heavy large saucepan over medium heat. Add carrots, onion and garlic sauté until onion is translucent, about 10 minutes. Add broth and ginger. Cover and simmer until carrots are tender when pierced, stirring occasionally, about 30 minutes. ", 
            "Puree soup in batches in blender, or all at once with an immersion blender. In a small bowl, whisk together the miso an a half-cup of the soup. Stir the mixture back into the pot of soup. Taste the soup and season with salt, pepper or additional miso to taste.", 
            "Ladle into bowls and garnish each with a drizzle of sesame oil and small mound of scallions.", 
            "Pickled scallions? I didn’t do this in the end, but was tempted to lightly pickled the scallions by letting them hang out in a mixture of 6 tablespoons rice vinegar, 2 tablespoons water, 1 tablespoon of Kosher salt (I use Diamond brand, use less if you’re using Morton or another, which are more dense) and 1 1/2 teaspoons sugar for a while before using them as garnish. "
        ], 
        "date": "2012-01-03T10:41:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 red bell pepper, small was suggested, I used a large and didn’t regret it", 
            "2/3 cup canned or fresh tomato purée", 
            "1/4 cup orange juice", 
            "2 tablespoons Worcestershire sauce", 
            "2 tablespoons olive oil", 
            "1 tablespoon balsamic vinegar", 
            "1 tablespoon molasses", 
            "3/4 teaspoon table salt or more to taste", 
            "1 teaspoon ground mustard", 
            "1/2 teaspoon ground ginger", 
            "1/4 teaspoon freshly ground black pepper", 
            "1/4 teaspoon onion powder", 
            "1/8 teaspoon ground allspice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/charred-pepper-steak-sauce1.jpg?w=500", 
        "tags": [
            "Meat", 
            "Peppers", 
            "Photo", 
            "Quick", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2012/08/charred-pepper-steak-sauce/", 
        "title": "charred pepper steak sauce", 
        "directions": [
            "Preheat your broiler. Place your pepper on a baking sheet and cook it under the broiler until all sides are charred, turning with with tongs as needed. Don’t skimp on the charring as this skin will add a fantastic flavor dimension. Mine took about 15 minutes, but I have a terrible broiler. Yours might only take 5 to 8 minutes. Transfer pepper to a mesh sieve set over a blender jar or food processor work bowl to cool until you’re able to handle it, about 15 minutes.", 
            "Tear open the pepper and remove the seeds and membranes with your fingers or a paring knife. Add the pepper (with its skin) to the blender along with the remaining ingredients. Puree mixture until as smooth as possible. Transfer mixture to a small saucepan. Simmer it gently over low heat for 15 minutes, stirring from time to time. It will yield a fairly smooth that can be used as is, but if you’d like a smoother consistency, you have two options: running it back through the blender or food processor again (I got a smoother blender after the fibers had cooked down more on the stove) or pressing it through that fine-mesh sieve (I started doing this, then decided it wasn’t worth the trouble). ", 
            "Store in an airtight jar in the fridge for one week, though I suspect it will keep for two."
        ], 
        "date": "2012-08-07T16:43:21+00:00"
    }, 
    {
        "ingredient_list": [
            "4 cups chopped or balled melon (from about 1 cantaloupe or honeydew, or 1/4 a large watermelon)", 
            "Juice of half a lime, divided, plus more to taste", 
            "Coarse salt, to taste", 
            "1/2 to 1 teaspoon chili powder", 
            "3 tablespoons crumbled cotija cheese", 
            "1 tablespoon toasted pepitas (I like the salty ones)", 
            "1 tablespoon chopped fresh cilantro, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/img_4945.jpg?w=750", 
        "tags": [
            "Cantaloupe", 
            "Honeydew", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Tex-Mex", 
            "Vegetarian", 
            "Watermelon"
        ], 
        "url": "https://smittenkitchen.com/2016/08/chile-lime-melon-salad/", 
        "title": "chile-lime melon salad", 
        "directions": [
            "Place melon in a wide bowl or on a platter. Squeeze half lime juice over, adding second half to taste, then sprinkle with salt and chili powder. Scatter with cheese, pepitas and cilantro and dig in.", 
            "Do ahead: I’d expected this salad not to keep at all but we found it just fine (with no watery run-off) after 2 hours in the fridge. I wouldn’t keep it assembled too much longer, though. You don’t want the salt to draw the juices out of the fruit before you eat it, and it’s quick enough to put together at the last minute.\n"
        ], 
        "date": "2016-08-09T11:39:50+00:00"
    }, 
    {
        "ingredient_list": [
            "4 large eggs", 
            "2 tablespoons (25 grams) sugar", 
            "1/4 teaspoon coarse or kosher salt", 
            "6 tablespoons (50 grams) all-purpose flour", 
            "3 tablespoons (15 grams) unsweetened cocoa powder, any variety, sifted if lumpy", 
            "1/2 cup (120 ml) milk (I use whole)", 
            "4 tablespoons (60 grams) unsalted butter", 
            "Shaved dark chocolate and powdered sugar (to finish)", 
            "Fresh berries and syrup (to serve, if desired)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/01/chocolate-dutch-baby.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Chocolate", 
            "Pancakes", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2017/01/chocolate-dutch-baby/", 
        "title": "chocolate dutch baby", 
        "directions": [
            "Heat oven to 425 degrees F.", 
            "Whisk eggs, sugar and salt in the bottom of a medium bowl. Add flour and cocoa, whisking until mostly smooth (some tiny lumps are okay, but whisk out what you can). Drizzle in milk, whisking the whole time.\nHeat a 12-inch ovenproof skillet on the stove over high heat. Add butter and melt, tipping the pan around so it butters the sides too. Turn heat off and scrape batter into pan. Transfer skillet to oven and bake for 16 to 18 minutes, until pancake is billowy.\nRemove from oven and grate chocolate over, to taste. Dust generously with powdered sugar. Cut in halves or quarters and eat with berries and syrup, if desired."
        ], 
        "date": "2017-01-19T13:04:45+00:00"
    }, 
    {
        "ingredient_list": [
            "Topping", 
            "1/3 cup (40 grams or 1 1/2 ounces) chopped dark chocolate", 
            "1/2 cup (50 grams) rolled oats", 
            "1/4 cup maple syrup", 
            "Pinch of salt", 
            "Filling", 
            "3 tablespoons (40 grams) butter", 
            "3 tablespoons (40 grams) sugar", 
            "2 pears, peeled, halved, cored and diced into small chunks (I used firm D’Anjous; cooking times for other varieties will vary)", 
            "1 cup (115 grams or 4 ounces) raspberries "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/chocolate-oat-crumble1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Crumbles/Crisps", 
            "Fruit", 
            "Gluten-Free", 
            "Pear", 
            "Photo", 
            "Quick", 
            "Raspberries"
        ], 
        "url": "https://smittenkitchen.com/2015/02/chocolate-oat-crumble/", 
        "title": "chocolate oat crumble", 
        "directions": [
            "Heat oven to 350°F(180°C). ", 
            "In a small dish, combine chocolate, oats, maple syrup and salt and set aside. In a small/medium ovenproof skillet (mine was 8-inch/1-quart), melt butter over medium heat. Add sugar and cook together, stirring, until it becomes golden at the edges. Add pear chunks and cook in this caramel-y syrup for 5 to 8 minutes, until slightly softened or half-cooked. (Bosc pears always take longer for me; ripe Bartletts, less.) Scatter raspberries over top. Sprinkle with chocolate-oat mixture. Bake for 20 to 25 minutes, until fruit is soft and the oats crisp."
        ], 
        "date": "2015-02-06T11:48:14+00:00"
    }, 
    {
        "ingredient_list": [
            "3 cups chopped, crunchy vegetables", 
            "1/2 cup (2 ounces) crumbled feta, queso fresco or ricotta salata", 
            "2 scallions, thinly sliced", 
            "1/3 cup well-toasted sunflower seeds, salted or unsalted", 
            "2 tablespoons fresh lime juice", 
            "2 tablespoons olive oil", 
            "1/4 teaspoon coarse or Kosher salt, plus more to taste", 
            "1/4 teaspoon chile powder or 1/8 teaspoon each your choice combination of chile powder, cumin, cayenne or sumac", 
            "Freshly ground black pepper, to taste", 
            "1 to 2 tablespoons thinly sliced fresh mint leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/06/7463002884_41ea1ca04d_o.jpg?w=750", 
        "tags": [
            "Beans", 
            "Citrus", 
            "Cucumber", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Radishes", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/06/chopped-salad-with-feta-lime-and-mint/", 
        "title": "chopped salad with feta, lime and mint", 
        "directions": [
            "Mix the vegetables, feta, scallions, seeds and mint in a medium bowl. Whisk lime juice, olive oil, salt, spice and black pepper in a small dish and pour over vegetables, tossing to evenly coat. Adjust with more salt or pepper as needed. Garnish with mint and crunch-crunch-crunch away!"
        ], 
        "date": "2012-06-29T07:38:56+00:00"
    }, 
    {
        "ingredient_list": [
            null, 
            "1/4 pound bacon, ideally thick-cut, diced", 
            "2 ears corn, shucked and kernels cut from cob", 
            "Salt and freshly ground black pepper or red pepper flakes", 
            "3 scallions, thinly sliced", 
            "1/3 cup finely grated parmesan", 
            "Fistful of fresh basil and chives, chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/07/img_3799.jpg?w=750", 
        "tags": [
            "Corn", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Recipes", 
            "Summer", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/07/corn-bacon-and-parmesan-pasta/", 
        "title": "corn, bacon and parmesan pasta", 
        "directions": [
            "\n"
        ], 
        "date": "2016-07-19T12:05:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 15-ounce can black beans, drained", 
            "1 teaspoon ground cumin", 
            "5 teaspoons olive oil, divided", 
            "2 tablespoons (or more) fresh lime juice", 
            "2 cups coleslaw mix or shredded cabbage", 
            "2 green onions, thinly sliced", 
            "1/3 cup chopped fresh cilantro", 
            "4 white or yellow corn tortillas", 
            "1/3 cup crumbled feta cheese", 
            "Hot sauce"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/02/crisp-black-bean-tacos.jpg?w=753", 
        "tags": [
            "Beans", 
            "Budget", 
            "Cabbage", 
            "Photo", 
            "Quick", 
            "Tex-Mex", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2009/02/crispy-black-bean-tacos-with-feta-and-slaw/", 
        "title": "crisp black bean tacos with feta and slaw", 
        "directions": [
            "Place beans and cumin in small bowl; partially mash. Season to taste with salt and pepper. Mix 2 teaspoons olive oil and lime juice in medium bowl; add coleslaw, green onions, and cilantro and toss to coat. Season slaw to taste with salt and pepper.", 
            "Heat 1 tablespoon olive oil in large nonstick or cast iron skillet over medium-high heat. Add tortillas in single layer. Spoon 1/4 of bean mixture onto half of each tortilla; cook 1 minute. Fold tacos in half. Cook until golden brown, about 1 minute per side. Fill tacos with feta and slaw. Pass hot sauce alongside, or if your name is Alex, drown your taco in a puddle of it."
        ], 
        "date": "2009-02-02T18:24:23+00:00"
    }, 
    {
        "ingredient_list": [
            "3 thin slices prosciutto (optional)", 
            "1 to 2 tablespoons olive oil", 
            "1 13-14 ounce package frozen cheese tortellini (about 3 cups)", 
            "1/2 cup frozen peas, no need to defrost", 
            "1/3 cup water", 
            "3 tablespoons crème fraîche or mascarpone", 
            "Juice of half a lemon, more or less to taste", 
            "Salt and freshly ground black pepper", 
            "A few fresh mint leaves, cut into thin slivers", 
            "Grated parmesan (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/crispy-tortellini-with-peas-and-prosciutto1.jpg?w=750", 
        "tags": [
            "Pasta", 
            "Peas", 
            "Photo", 
            "Quick", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/05/crispy-tortellini-with-peas-and-prosciutto/", 
        "title": "crispy tortellini with peas and prosciutto", 
        "directions": [
            "Heat a large, deep skillet with a lid** over medium-high heat. If using, add prosciutto in a single layer and cook until curling and browned underneath, about 2 minutes. Flip over and let cook until browned on the other side. Transfer a paper towel to blot oil and cool.\nAdd oil to same skillet and heat it for a minute. Add frozen tortellini in a single layer and cook for 2 to 4 minutes, until they’re browned underneath. Sprinkle with frozen peas and add water to pan. Be careful; it’s going to ROARHISS wildly. Put the lid on, and let them steam for about 5 minutes but don’t go too far because if the water cooks off too quickly, you’ll want to add a splash more. At 5 minutes, all water should have cooked off. Scoops pasta and peas into bowl. If you find any pasta has stuck, just add a splash more water over high heat to “deglaze” them off — loosen them with a thin spatula and toss them around until they’re crisp again.\nImmediately dollop on crème fraîche so it melts over the pasta. Squeeze lemon juice over, then sprinkle with salt, pepper, crumble prosciutto over (if using), then slivers of mint and parmesan, if desired. Dig in. Give your freezer a pat on its back.I use this one."
        ], 
        "date": "2016-05-09T11:52:01+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive oil, divided", 
            "1 large head cauliflower (mine was 1 3/4 pounds)", 
            "1 teaspoon whole cumin seeds", 
            "1/2 teaspoon kosher salt, plus additional", 
            "1/2 teaspoon freshly ground black pepper", 
            "Plain yogurt (I used whole milk yogurt, Greek style)", 
            "1/4 cup crumbled feta (optional)", 
            "Chopped fresh mint leaves, for serving", 
            "Pomegranate seeds, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cumin-seed-roasted-cauliflower-with-yogurt1.jpg?w=500", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Photo", 
            "Pomegranate", 
            "Quick", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/10/cumin-seed-roasted-cauliflower-with-yogurt/", 
        "title": "cumin seed roasted cauliflower with yogurt", 
        "directions": [
            "Preheat oven to 425°F. Brush a large baking sheet or roasting pan with 1 tablespoon of the olive oil.", 
            "Cut your cauliflower into bite-size florets but no need to make them all evenly sized. The smaller ones get more blistery, the bigger ones retain more texture and they’ll all be happy mingled together.  Toss florets with remaining olive oil, cumin seeds, salt and pepper and spread out on prepared tray. Roast for 20 to 30 minutes, until cauliflower is tender and its edges are toasty.", 
            "Either whisk a pinch of salt into your yogurt or to make feta-yogurt sauce blend 3/4 cup yogurt with feta in a food processor until smooth. Dollop on cauliflower then sprinkle dish with mint and pomegranate seeds. Eat immediately and vow to seriously make more effort in the lunch department if it can be this easy."
        ], 
        "date": "2011-10-20T14:48:04+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "3/4 pound (12 ounces, 340 grams or about 2 1/4 cups) dried dates", 
            "2 1/4 cups (530 ml) boiling water", 
            "1 1/2 teaspoons baking soda", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "3/4 cup (150 grams) granulated sugar", 
            "2 tablespoons (25 grams) light or dark brown sugar", 
            "2 large eggs", 
            "1/4 teaspoon fine sea or table salt", 
            "1 2/3 cups (210 grams) all-purpose flour", 
            "Sauce", 
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, melted", 
            "1 cup (235 ml) heavy or whipping cream", 
            "1 cup plus 2 tablespoons (215 grams) brown sugar (light is called for, but I’d like to use dark next time)", 
            "2 teaspoons vanilla extract", 
            "To serve", 
            "Unsweetened whipped cream (optional, but please don’t skip it)", 
            "A few flakes of sea salt", 
            "Fresh mint leaves (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/date-cake-with-toffee-sauce-31.jpg?w=640", 
        "tags": [
            "Cake", 
            "Christmas", 
            "Dates", 
            "English", 
            "Everyday Cakes", 
            "Photo", 
            "Thanksgiving", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/11/date-cake-with-toffee-sauce/", 
        "title": "sticky toffee pudding", 
        "directions": [
            "Make the cake: Pit and roughly chop dates and place them in a heatproof bowl. Pour boiling water over them and stir in the baking soda. Cover the bowl and set it aside for 30 minutes.", 
            "Meanwhile, heat oven to 350°F (175°C). Butter a 9×13-inch baking pan. As an extra precaution, if you’re nervous about sticking (although this cake should not), you can line the bottom with a fitted rectangle of parchment paper.", 
            "Blend date-water mixture in a blender or food processor until smooth. In a large bowl, combine the melted butter and sugars. Whisk in eggs, then salt. Stir in the flour, then date puree. Pour the batter into the prepared pan and bake for 25 to 30 minutes, until a toothpick inserted into the center comes out clean. ", 
            "To serve it rustic-style, as we did, let it cool in the pan on a cooling rack. If you’d like to transfer it later to a serving plate, let cool in the pan for 20 minutes, then flip it out onto a cooling rack, removing the parchment paper if you used it.", 
            "Make the sauce: Combine butter, cream, sugar and vanilla in a larger saucepan than you think you’ll need (I vote for 2 1/2 to 3 quarts) over medium heat and bring to a simmer. Whisk for about 10 minutes, until the mixture thickens slightly. ", 
            "To serve: Cut the cake into squares (still warm is just fine). Drizzle each slice with toffee sauce, a pinch of sea salt, and top with a dollop of whipped cream, if desired. If your mint plant has survived the fall better than mine has, a leaf or two would be lovely here, too."
        ], 
        "date": "2014-11-06T12:06:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour", 
            "3/4 teaspoon ground cinnamon", 
            "1 tablespoon ground ginger", 
            "1/8 teaspoon ground cloves", 
            "1/8 teaspoon freshly grated nutmeg", 
            "1 1/2 teaspoons baking powder", 
            "1/2 teaspoon baking soda", 
            "1/4 teaspoon fine sea or table salt", 
            "1/2 cup buttermilk, yogurt thinned with a little milk, fresh apple cider or even stout beer", 
            "1/2 cup molasses", 
            "1/2 cup dark brown sugar, packed", 
            "1/4 cup granulated sugar", 
            "1 large egg", 
            "3 tablespoons butter, melted, plus extra for brushing waffle iron", 
            "Powdered sugar for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/deep-dark-gingerbread-waffles11.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Christmas", 
            "Photo", 
            "Waffles", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/deep-dark-gingerbread-waffles/", 
        "title": "deep dark gingerbread waffles", 
        "directions": [
            "In a large bowl, whisk together the flour, cinnamon, ginger, cloves, nutmeg, baking powder, baking soda and salt. In a medium bowl, whisk together the buttermilk, molasses, sugars, egg and butter until combined. The butter will likely firm up and make little white splotches throughout; this is a-okay. Pour the wet into the dry ingredients and stir until just combined. ", 
            "Heat waffle iron to a middle heat. Either brush waffle iron with melted butter or spray it lightly with a nonstick cooking spray. Ladle gingerbread batter into waffle iron until they’re about 3/4 filled out. Cook according to manufacturer’s directions. In my waffle iron, I like to cook them 1 to 2 minutes more.", 
            "To remove waffles: Open waffle iron. Wait about 30 seconds, giving them a chance to steam off a little. With tongs in one hand and a small spatula in the other, gently, carefully lift corners of each waffle section enough to slide the spatula underneath, then lift and slide some more until you can get the section out. Curse Deb, because these waffles are very sticky and eager to tear. Trust Deb, that they will be worth it. Spread them on a tray in a single layer to let cool slightly; within 1 minute, they should be crisp to the touch and easier to lift. Repeat with remaining batter. Try not to stack waffles — even though they’re firm, they will stick.", 
            "Serve immediately, dusted with powdered sugar and, if you’re feeling fancy, a dollop of barely or unsweetened whipped cream or crème fraîche."
        ], 
        "date": "2014-12-18T11:54:57+00:00"
    }, 
    {
        "ingredient_list": [
            "8 larger or to 10 smaller firm, fresh Kirby (pickling) cucumbers", 
            "3 teaspoons kosher, coarse or pickling salt (if using a featherweight brand such as Diamond, use a little more)", 
            "1 to 2 tablespoons chopped fresh dill", 
            "1/2 cup white vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/easiest-fridge-dill-pickles1.jpg?w=640", 
        "tags": [
            "Cucumber", 
            "Photo", 
            "Pickled", 
            "Quick", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/07/easiest-fridge-dill-pickles/", 
        "title": "easiest fridge dill pickles", 
        "directions": [
            "Slice your cucumbers very thin — I used 1/8-inch slices here but usually go even thinner on a mandoline. Place them in a 1-liter or equivalent lidded jar. Add 3 teaspoons salt and dill, then pour in white vinegar. Close the jar and give it a few shakes to begin distributing the ingredients. ", 
            "You’re going to find the liquid level in the jar worrisomely low as it is well below the pickle pile line, but don’t fret. Within an hour or two, the salt will draw the moisture from the cucumbers and wilt them, while the liquid becomes a perfectly balanced pickle brine.", 
            "Place jar in the refrigerator near the front, which should remind you to shake it once or twice more over the new few hours. (Or whenever you’re back at the fridge.) You can eat them as little as 1 to 2 hours later, but they become ideal at 6 to 8 hours. They’ll keep in the fridge, submerged in their brine, for 3 weeks, though never around here.", 
            "Just a little NYC sourcing shout-out: There are several local farms that bring kirby cucumbers to the Greenmarkets, but by far, my favorites to seek out come from Kernan Farms, where they have them for over a month each summer and they’re always incredibly crisp. During the growing season, they’re at St. Marks Church Tuesdays, Union Square Wednesdays, Borough Hall Thursdays, 97th Street Fridays, Grand Army Plaza and Abington Square Saturdays and Bensonhurst Sundays. "
        ], 
        "date": "2014-07-14T11:09:53+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/4 cups (295 grams) all-purpose flour", 
            "2 1/4 teaspoons baking powder", 
            "3/4 teaspoon baking soda", 
            "3 tablespoons (40 grams) granulated sugar", 
            "1/4 teaspoon fine sea or table salt", 
            "6 tablespoons (85 grams or 3 ounces) unsalted butter, cold, cut into chunks", 
            "2 large egg yolks", 
            "3/4 cup plus 2 tablespoons (205 ml) heavy cream", 
            "3 tablespoons (35 grams) raw or turbinado sugar", 
            "1 pound (455 grams) strawberries or mixed berries, hulled and halved if large", 
            "2 tablespoons (25 grams) granulated sugar, or more to taste", 
            "1 tablespoon (15 ml) fresh lemon juice (optional)", 
            "1 cup (235 ml) heavy or whipping cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/easy-drop-berry-shortcakes-1.jpg?w=750", 
        "tags": [
            "Blackberries", 
            "Blueberries", 
            "Everyday Cakes", 
            "Photo", 
            "Quick", 
            "Raspberries", 
            "Scones/Biscuits", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2017/06/easy-drop-berry-shortcakes/", 
        "title": "easy drop berry shortcakes", 
        "directions": [
            "Make shortcakes: Heat oven to 400 degrees F. Line a large baking sheet with parchment paper.\nIn a large bowl, whisk together flour, baking powder, baking soda, granulated sugar, and salt until thoroughly combined. Add butter and using your fingertips or a pastry blender, break it into small bits, the largest should be no bigger than a small pea. In a small bowl, whisk yolks with a splash of cream, then pour rest of cream in and whisk to combine. Pour into butter-flour mixture and use a rubber spatula to mix and mash it together into one cohesive dough.", 
            "Divide dough into 6 (for large, 3 1/2 to 3 3/4-inch wide and up to 2-inch tall) shortcakes or 8 smaller ones. I do this by pressing the dough somewhat flat into the bottom of the bowl (to form a circle) and using a knife to divide it into pie-like wedges. Place raw or turbinado sugar in a small bowl. Roll each wedge of shortcake into a ball in your hands and roll it through the raw/turbinado sugar, coating it in all but a small area that you should leave bare. (I found that the sugar underneath the shortcakes would burn, so better to leave it off.)\nPlace it, bare spot down, on the prepared baking sheet. Repeat with remaining wedges of dough. Bake for 15 minutes, until lightly golden all over. Let cool completely on tray or on a cooling rack.\nWhile cooling, prepare fruit and cream:  Mix berries, 2 tablespoons sugar (more or less to taste), and lemon juice, if desired, in a bowl and let macerate so that the juices run out.\nIn a larger bowl, beat cream until soft peaks form. Add sugar to taste, or leave unsweetened, if that’s your preference.\nTo serve: Carefully split each cooled shortcake with a serrated knife. Spoon berries and their juices over bottom half. Heap generously with whipped cream. Place shortcake “lid” on top. Eat immediately and don’t forget to share.\nDo ahead: Shortcakes keep well for a day at room temperature. I prefer to keep them uncovered. I found on the second day, they were a little more firm but not half-bad, but they’re definitely “best” on day one.\n"
        ], 
        "date": "2017-06-13T11:56:56+00:00"
    }, 
    {
        "ingredient_list": [
            "Pecan florentines", 
            "1/4 cup plus 2 tablespoons (6 tablespoons or 45 grams) all-purpose flour", 
            "1/2 cup (about 55 grams) pecan halves", 
            "1/4 teaspoon ground cinnamon (I halved this, found it to be just-enough)", 
            "1/8 teaspoon kosher salt (I recommend doubling this)", 
            "1/2 cup (115 grams) unsalted butter, cold is fine", 
            "2/3 cup (65, oops, sorry, it is 130 grams) granulated sugar (I would drop this by a tablespoon or two next time)", 
            "2 tablespoons heavy cream", 
            "1 tablespoon corn syrup, honey, or golden syrup", 
            "1/4 teaspoon vanilla extract", 
            "Eggnog filling", 
            "4 large eggs, hard-boiled", 
            "4 tablespoons (55 grams) unsalted butter, at room temperature", 
            "2 1/2 cups (300 grams) confectioners’ sugar", 
            "1 tablespoon whole milk", 
            "1/2 teaspoon vanilla extract", 
            "3/4 teaspoon freshly grated nutmeg (I halved this because I’m a spice wimp)", 
            "1/4 teaspoon ground cloves (I halved this too)", 
            "1/8 teaspoon kosher salt", 
            "2 tablespoons dark rum (can be skipped or reduced)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/eggnog-florentines1.jpg?w=640", 
        "tags": [
            "Christmas", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/12/eggnog-florentines/", 
        "title": "eggnog florentines", 
        "directions": [
            "Make the florentines: Heat oven to 350°F. In a food processor, combine the flour, pecans, cinnamon and salt and pulse until the nuts are very finely chopped, about 1 minute. Turn the nut mixture out into a large bowl. ", 
            "In a small-medium saucepan set over high heat, combine the butter, sugar, heavy cream and syrup and bring it to a boil. Boil the mixture for one full minute, then turn off the heat and add the vanilla. Pour this caramel mixture over the nut mixture and stir to combine them. Set aside for at least 30 minutes, until it has cooled. Mixture will firm up and seem worrisome, but you should not be worried.", 
            "Line baking sheets with parchment paper. Using a 1/2 or 1 teaspoon measure (the original recipe recommends a 1/2 teaspoon measure to scoop the cookies but I misread this and used a full teaspoon scoop — mine became 2 1/2 inches in diameter on average, which felt like a good size), scoop the dough into small balls and place them 3 inches apart on prepared baking sheets. Bake until the cookies are thin and golden brown, 7 to 9 minutes. They will not crisp until they are cool, so don’t worry if they’re soft.", 
            "Let cool on baking sheets for 5 or so minutes (so they’ll set up a little) before using a thin metal spatula to carefully transfer the cookies to paper towels to blot excess oil for a couple minutes. After they’ve been blotted, transfer cookies to a cooling rack, though they should be pretty cool by now. If any butter is left puddled on the parchment, wipe that off too before repeating the process with the remaining cookie dough.", 
            "Make the eggnog filling: Peel the eggs and separate the yolks from the whites. Save the whites for another use. Press the egg yolks through a fine-mesh strainer so that they become mashed and powdery. Place in a large bowl with butter, confectioners’ sugar, milk, vanilla, nutmeg, cloves and salt. Beat together until smooth, then raise mixer speed and beat until mixture is thick and frosting-like, about three minutes. Stir in the rum by hand, if using.", 
            "Spread a dollop of eggnog filling on one cookie, then gently press a second one on top of it. Repeat with remaining cookies and filling. Place them in the fridge for 10 minutes before serving, to firm up the filling.", 
            "Do ahead: The dough and the icing can be refrigerated in an airtight container or up to 3 days before baking. The baked, unfilled florentines can be stored in a loosely covered container at room temperature for up to two (though I had them longer) before filling them. Humidity is their enemy, makes them stick together. The original recipe says that once filled, the florentines need to be eaten immediately but our held up crisp in the fridge in a loosely covered container (not airtight) for a couple days. "
        ], 
        "date": "2013-12-11T12:30:07+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/eggs-in-purgatory-puttanesca-style1.jpg?w=640", 
        "tags": [
            "Brunch", 
            "Budget", 
            "Eggs", 
            "Italian", 
            "Photo", 
            "Quick", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/03/eggs-in-purgatory-puttanesca-style/", 
        "title": "eggs in purgatory, puttanesca-style", 
        "directions": [
            "On a cutting board, pile garlic, 1/4 cup parsley, olives, capers, anchovies (if using), oregano and pepper and run a knife through them again and again until they’re chopped into a tiny rubble. Heat a small-medium skillet over medium heat. Once hot, swirl in a glug of olive oil and let it warm. Add garlic-parsley heap to pan and cook, stirring, 2 minutes. Add tomatoes carefully because they’re going to splatter like crazy, nd stir to combine. Lower heat to medium-low and simmer sauce for 5 minutes. Taste and add salt or more pepper flakes if needed.", 
            "Make a small indentation in the sauce for each egg you’re using, and crack them in. Sprinkle the eggs and sauce with parmesan and cover pan pan partially with a lid. [This is when you should toast your bread; I like to brush mine with olive oil and run it under the broiler.] Let the eggs cook for 5 minutes, after which the whites are usually set and the yolks still loose, but when I use more than 1 to 2 eggs in the pan, this can take longer. Cook another minute or two if needed, but keep a close watch so you don’t accidentally hard cook them.", 
            "Drizzle pan with a little extra olive oil, then finish with more pepper, cheese and parsley. Eat with toasted bread."
        ], 
        "date": "2016-03-22T11:50:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 can (14 ounces) tomato puree", 
            "1 tablespoon olive oil", 
            "1 clove garlic, minced", 
            "Big pinch of sugar", 
            "Pinch of crushed red pepper flakes", 
            "Coarse salt and freshly ground pepper", 
            "Glug of red wine (optional)", 
            "4 large eggs", 
            "4 slices toasted country bread, for serving", 
            "Freshly grated Parmesan cheese, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/eggs-in-tomato-sauce-contest-winners1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Budget", 
            "Eggs", 
            "Photo", 
            "Quick", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/09/eggs-in-tomato-sauce-contest-winners/", 
        "title": "eggs in tomato sauce", 
        "directions": [
            "In a small skillet, heat olive oil over medium-high heat. Add garlic and crushed red pepper; cook, stirring, until lightly browned, about 1 minute. Add tomato sauce and bring to a boil; season with sugar, salt and pepper. Reduce heat to a simmer and cook for 10 to 20 minutes minutes. A few minutes before it’s done, I like to add a glug of red wine and let it simmer for a moment.", 
            "Gently crack eggs into tomato mixture, cover, and let cook 5 minutes. Remove skillet from heat, uncover, and let stand 2 to 3 minutes.", 
            "Transfer each egg to a piece of toast. Spoon over sauce, garnish with cheese, and season with salt and pepper; serve immediately."
        ], 
        "date": "2008-09-12T17:12:19+00:00"
    }, 
    {
        "ingredient_list": [
            "Winter Warmth Syrup", 
            "1 1/2 cups water", 
            "1 cup raw, demerara or turbinado sugar (granulated will do just fine if you do not have them)", 
            "1/2 apple, peeled, cored, and diced", 
            "1/2 pear, peeled, cored, and diced", 
            "12 walnut halves", 
            "3 cinnamon sticks, broken up", 
            "6 whole cloves", 
            "1 whole nutmeg", 
            "For Each Cocktail", 
            "1 piece of orange peel (about 1 by 2 inches)", 
            "3/4 ounce Winter Warmth Syrup (recipe above)", 
            "2 dashes of bitters (Fee Brothers black walnut bitters are recommended, I used orange bitters)", 
            "2 ounces bourbon, rye or Canadian whisky"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/the-fairytale-of-new-york1.jpg?w=750", 
        "tags": [
            "Bourbon", 
            "Christmas", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/fairytale-of-new-york/", 
        "title": "fairytale of new york", 
        "directions": [
            "Make the winter warmth syrup: Combine all ingredients in a saucepan over medium heat. Bring to a simmer, stirring until the sugar dissolves, and simmer for 15 to 20 minutes. Remove from the heat and cool. Strain into a clean glass bottle, cover and refrigerate for up to 2 weeks. Makes about 2 cups.", 
            "Make a drink: Place the orange peel, syrup and bitters in a low glass and muddle. Pour in whiskey, add a large ice cube and don’t forget to share. ", 
            "Make a carafe: We brought 2 4-cup carafes of this to a party, using all of the syrup and about 5 1/2 cups bourbon. We tossed a few orange peels into each jar. Don’t forget to remind friends to pour it over ice (we forgot), so they are not asleep before, you know, Santa comes down the chimney."
        ], 
        "date": "2014-12-23T11:56:26+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups (7 3/4 ounces or 220 grams) all-purpose flour", 
            "1 teaspoon baking powder", 
            "3/4 teaspoon table salt", 
            "1/2 cup (118 ml) water", 
            "1/3 cup (79 ml) olive oil", 
            "2/3 to 3/4 cup (about 3 ounces or 85 grams) grated Mahon cheese (see above for replacements)", 
            "1/3 to 1/2 cup (79 to 118 ml) honey", 
            "1 tablespoon fresh thyme", 
            "Flaky sea salt such as Maldon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/flatbreads-with-honey-thyme-and-sea-salt1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Bread", 
            "Quick", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2011/07/flatbreads-with-honey-thyme-and-sea-salt/", 
        "title": "flatbreads with honey, thyme and sea salt", 
        "directions": [
            "Preheat oven to 450°F with a heavy baking sheet or pizza stone on a middle rack.", 
            "Whisk together flour, baking powder, and salt in a medium bowl. Make a well in center, then add water and oil and gradually stir into flour with a wooden spoon until a dough forms. Knead dough gently on a work surface 4 or 5 times. It will feel quite oily (but just think of how great your hands will look later!). ", 
            "Divide dough into 4 pieces and roll out 1 piece at on a sheet of parchment paper into a longish irregular rustic shape; mine were about 12″x6″. The dough should be rolled thin and it be crazy oily and you’ll think I’ve lost my mind suggesting that it will make anything but a mess, but you’ll see in a few minutes how perfectly ungreasy it bakes up, promise.", 
            "Slide rolled out dough and parchment paper together onto the preheated baking sheet or stone, and bake about 5 minutes, until lightly golden. Leaving the oven on, remove tray from oven and quickly sprinkle with 1/4 of grated cheese. Bake an additional 3 to 4 minutes, until browned at edges and in thinner spots. Remove flatbreads from oven a final time, quickly drizzle each with honey (1 used about a tablespoon per flatbread, but the restaurant used more; they were truly flooded with honey and it was delicious), sprinkle with sea salt and garnish with thyme leaves. Cut each cracker width-wise into 4 sections (about 3″x6″ each) with a sharp knife. Repeat with remaining pieces of dough. Serve warm.", 
            "Do ahead: Should you want to prepare these ahead of time for a party, I’d bake them including the cheese about 1 minute less than needed. Shortly before you’re ready to serve them, re-toast them in the oven and then drizzle on the honey/thyme/sea salt. "
        ], 
        "date": "2011-07-10T18:39:42+00:00"
    }, 
    {
        "ingredient_list": [
            "2 slices bread of your choice", 
            "2 teaspoons butter, salted or unsalted", 
            "1/2 cup (2 ounces) coarsely grated cheddar "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/frico-grilled-cheese-sandwiches1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Quick", 
            "Sandwich", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/10/frico-grilled-cheese-sandwiches/", 
        "title": "frico grilled cheese sandwiches", 
        "directions": [
            "Spread butter on one side of each slice of bread, the one that will be on the outside of the sandwich. Scatter all but 2 tablespoons cheese unbuttered side of one slice. Top with second slice, so that the buttered side faces out. Heat skillet over low-to-moderate heat. (I like to use a well-seasoned cast iron frying pan here.) Sprinkle 1 tablespoon cheese roughly in center of skillet. Place sandwich on top. Cook sandwich until golden underneath and cheese browns and crisps, about 2 to 4 minutes. Carefully lift melted (frico-ed) cheese and bread onto spatula, sprinkle remaining spoonful of cheese back in skillet, then flip sandwich over on top of it. Cook on second side until golden and crisp as well, pressing down on it with the spatula to encourage it to all come together. ", 
            "Transfer to a plate, cut in half if desired, and dig in.", 
            "Alternate riffs on the classic: Are you a purist or do you like to put other things on your grilled cheese? I’m a sucker for sweet and sour red onions with a baby Swiss or gruyere cheese (this recipe in the book). But when I’m using classic cheddar, I either like a thin slice of tomato inside my sandwich, or sometimes, like the day I made these, the thinnest schmear of smooth Dijon and a dash of onion powder. "
        ], 
        "date": "2013-10-03T11:19:39+00:00"
    }, 
    {
        "ingredient_list": [
            "Eggs", 
            "2 large eggs, at room temperature", 
            "Enough vegetable oil to reach a depth of 1/4-inch", 
            "Salad", 
            "1 cup lightly-packed torn green leaf lettuce (approximately 2-inch pieces)", 
            "1/4 cup thinly sliced yellow onion", 
            "1/4 cup thin or julienned carrot strips", 
            "1/4 cup coarsely chopped celery, Chinese or other, include leaves", 
            "1/4 cup lightly packed coarsely chopped cilantro, thin stems and leaves", 
            "Dressing", 
            "1 1/2 tablespoons lime juice (Key limes are recommended, but don’t fuss if you can’t find them)", 
            "1 1/2 tablespoons palm sugar simple syrup [see Note up top] or 1 tablespoon water + 1 teaspoon dark brown sugar", 
            "1 tablespoon Thai fish sauce", 
            "1 1/2 teaspoons (1 large clove) very thinly sliced garlic", 
            "2 fresh Thai chiles, preferably green, thinly sliced (more or less to taste)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/fried-egg-salad1.jpg?w=750", 
        "tags": [
            "Budget", 
            "Eggs", 
            "Gluten-Free", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Thai"
        ], 
        "url": "https://smittenkitchen.com/2015/01/fried-egg-salad/", 
        "title": "fried egg salad", 
        "directions": [
            "Fry eggs: Heat a wok or small skillet over the highest heat. Once hot, add enough oil to reach a depth of a generous 1/4-inch. Once the oil is hot enough to smoke, carefully crack the eggs into the oil — cautiously, as they will splatter a lot — and decrease the heat to medium-high. The eggs will hiss, sputter and the whites should puff and develop translucent bubbles. Once they’re very crispy and a deep golden brown underneath, 45 seconds to 1 minute, use a thin spatula to flip the eggs, trying not to break the yolks but not fretting if it happens. Cook for another minute on the second side, until the yolks are set but still slightly molten (aim to have them a little less loose than mine, shown above). Transfer eggs to paper towels; you can cook them up to 15 minutes before serving. Discard oil and wipe out wok or skillet.", 
            "Assemble salad: Place all salad ingredients in a large bowl. Quarter the eggs through the yolks and add them to the salad.", 
            "Make the dressing: Place the lime juice, palm syrup or dark brown sugar and water, fish sauce, garlic and chiles in the same wok or skillet. Set it over medium heat and heat the mixture until it just begins to sizzle at the edges, less than 30 seconds. ", 
            "Finish and serve: Pour the hot dressing over the salad and eggs. Stir gently to combine. If you’re feeling fancy, transfer the salad, liquid at all, to a plate in a low heap. Eat at once."
        ], 
        "date": "2015-01-22T12:04:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound mix leftover cheese, harder cheeses grated, softer ones cut into chunks", 
            "A couple pats of butter, if using mostly firm cheese varieties", 
            "1 small clove garlic, minced, or more to taste", 
            "1/2 to 1 cup leftover white wine", 
            "1 to 2 tablespoons finely chopped fresh herbs, such as parsley, thyme, rosemary or chives", 
            "Salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/12/fromage-fort.jpg?w=751", 
        "tags": [
            "Appetizers + Party Snacks", 
            "French", 
            "Photo", 
            "Quick", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2012/12/fromage-fort/", 
        "title": "fromage fort", 
        "directions": [
            "Blend cheese, butter (if using) and garlic in food processer until combined. Drizzle in wine with the motor running until you get your desired consistency — some like it completely smooth, others prefer chunks. Add herbs, pulsing the machine until just combined. Season to taste with salt and pepper.", 
            "Fromage fort can be used right away, or kept in the fridge until needed. In the fridge, it will thicken and age a little; the flavors will mingle and deepen."
        ], 
        "date": "2012-12-28T11:32:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds small (I used Manila) clams", 
            "2 thick slices country or sourdough bread", 
            "1/2 tablespoon olive oil to brush bread (optional)", 
            "2 tablespoons butter", 
            "2 cloves garlic, thinly sliced or minced", 
            "1 large or 2 small shallots, minced or 1/4 cup minced white onion", 
            "Salt and red pepper flakes", 
            "1/2 cup dry white wine", 
            "1 tablespoon chopped fresh herbs — parsley, cilantro, chives or a mix", 
            "1 lemon, in wedges"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/garlic-wine-and-butter-steamed-clams.jpg?w=750", 
        "tags": [
            "Budget", 
            "Date Night", 
            "Photo", 
            "Portuguese", 
            "Quick", 
            "Seafood", 
            "Summer", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/09/garlic-wine-and-butter-steamed-clams/", 
        "title": "garlic wine and butter steamed clams", 
        "directions": [
            "If you think your clams may not be clean, wash them first: Fill a large bowl with cool tap water and place the clams in it. Let them soak for 20 minutes during which they’ll expel any sand and grit.", 
            "While they’re soaking, grill or broil your bread: Dab both sides lightly with olive oil, if using, and grill or broil until well-toasted on both sides.", 
            "Lightly scrub your clams. Discard any with chipped shells.", 
            "In a large saute pan with a lid, melt butter and add garlic, shallots, salt and pepper flakes. Cook for 1 to 2 minutes over medium-high. Add wine — and as soon as it simmers, add all the clams and cover with a lid. In three minutes, almost all should be wide open; discard any that do not open. Transfer to a bowl and ladle cooking liquid over. Scatter with herbs and serve with grilled bread and lemon."
        ], 
        "date": "2016-09-20T11:58:56+00:00"
    }, 
    {
        "ingredient_list": [
            "Sugared Cranberries", 
            "1 cup (200 grams) plus 1/3 cup (65 grams) granulated sugar", 
            "1 cup water", 
            "1 cup (100 grams) fresh cranberries ", 
            "Cake layers", 
            "1 cup (235 ml) oatmeal stout or Guinness Stout", 
            "1 cup (235 ml) dark molasses (ideally, not blackstrap)", 
            "1/2 teaspoon baking soda", 
            "3 large eggs", 
            "1 cup (190 grams) packed dark brown sugar", 
            "1 cup (200 grams) granulated sugar", 
            "3/4 cup (150 grams) vegetable or another neutral oil", 
            "2 cups (260 grams) all-purpose flour", 
            "1 1/2 teaspoons baking powder", 
            "2 tablespoons ground ginger", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon ground cloves", 
            "1/4 teaspoon freshly grated nutmeg", 
            "1/2 teaspoon kosher salt", 
            "Pinch of ground cardamom", 
            "Filling", 
            "2 cups (475 ml) heavy or whipping cream", 
            "6 tablespoons (45 grams) powdered sugar", 
            "1/2 cup (115 grams) mascarpone"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/gingerbread-layer-cake1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Celebration Cakes", 
            "Christmas", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/12/gingerbread-layer-cake/", 
        "title": "gingerbread layer cake", 
        "directions": [
            "Make sugared cranberries: Bring 1 cup granulated sugar and 1 cup water to a gentle simmer (not a full boil) on the stove, stirring until sugar has dissolved. Remove from heat and add cranberries. Pour mixture into a bowl and let syrupy cranberries chill in fridge overnight, or at least 8 hours. The next morning, drain cranberries (you can reserve syrup for soda or sweetening cocktails). Place remaining 1/3 cup sugar in a bowl and roll cranberries in it. Arrange them on a tray or plate and refrigerate for another 45 minutes to an hour, so that the sugar sets. (They’ll feel mostly dry to the touch.) ", 
            "Make the cake layers: Heat oven to 350°F. Butter and flour, or use a nonstick spray to coat three 9-inch round cake pans (see note above re: if you have fewer) and line the bottom of each with a fitted round of parchment paper.", 
            "Bring stout and molasses to a boil in a large saucepan and remove from heat; whisk in baking soda carefully — it will foam up. Cool to room temperature. ", 
            "In a large bowl, whisk together sugars and oil. Whisk in eggs, then whisk in cooled stout-molasses mixture. Place dry ingredients in a fine-mesh sieve or sifter and shake over bowl. Stir until just combined. ", 
            "Divide batter into prepared cake pans; you’ll have about (updated!) a scant (bit less than) 2 cups or 515 grams of batter in each. Bake for 18 to 22 minutes, until a toothpick inserted into the center of the cake comes out batter-free. Cool in pan on rack for 5 minutes, then flip out onto cooling rack, carefully remove parchment paper (it’s sticky) and flip back right side-up, letting each layer cool completely. You can hasten this along outside (if it’s cold) or in the freezer. ", 
            "Make whipped mascarpone cream: Beat heavy cream and powdered sugar in a large bowl with a whisk or electric beaters until soft peaks form. Beat in mascarpone, one spoonful at a time, just until it disappears into the cream. ", 
            "Assemble cake: Place first cake layer on cake stand and level top with a serrated knife if it has domed. Spread with 1 cup whipped mascarpone. Repeat twice, then smooth sides. Decorate with sugared cranberries. Serve immediately, or keep refrigerated until needed."
        ], 
        "date": "2015-12-22T12:11:36+00:00"
    }, 
    {
        "ingredient_list": [
            "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, cut into chunks, plus more for pan", 
            "1 cup water", 
            "1 1/2 teaspoons baking soda", 
            "2/3 cup packed dark-brown sugar", 
            "1 cup unsulfured molasses", 
            "1 tablespoon freshly grated ginger (optional)", 
            "2 large eggs, room temperature, lightly beaten", 
            "2 1/2 cups all-purpose flour, plus more for pan", 
            "2 teaspoons ground ginger", 
            "1 1/2 teaspoons ground cinnamon", 
            "1/2 teaspoon ground cloves", 
            "1/2 teaspoon ground or freshly grated nutmeg", 
            "1/2 teaspoon salt", 
            "2 teaspoons baking powder", 
            "Confectioners’ sugar, for dusting finished cake", 
            "Lightly sweetened whipped cream, essential for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/gingerbread-snacking-cake1.jpg?w=640", 
        "tags": [
            "Christmas", 
            "Everyday Cakes", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/12/gingerbread-snacking-cake/", 
        "title": "gingerbread snacking cake", 
        "directions": [
            "Heat oven to 350 degrees. Line a 9×13-inch baking pan with parchment paper. Butter and flour parchment and sides of cake pan, or spray both with a nonstick baking spray.", 
            "Bring water to a boil in a medium saucepan (or large one, if you’d like to make the cake entirely in there) and add baking soda — it will foam up! this is fun! Let stand for 5 minutes, then stir in butter until melted. Whisk in dark brown sugar, molasses and fresh ginger, if using. Mixture is usually just lukewarm by now, but if it still feels quite hot to the touch, set it aside to 10 to 15 minutes to cool further before using.", 
            "Place flour, ground ginger, cinnamon, cloves, nutmeg, salt and baking powder in a fine-mesh strainer or sifter so that you can sift them over the wet ones in a minute. ", 
            "Transfer molasses mixture to a large mixing bowl if your saucepan isn’t large enough to make the batter in. Whisk in eggs until just combined. Sift dry ingredients over wet, then stir the wet and dry ingredients together until just combined.", 
            "Pour batter into prepared pan; bake for 30 to 35 minutes, until a toothpick inserted into the center of the cake comes out clean. Transfer cake to a wire rack and let cool completely. Once fully cool, cut around cake to make sure no parts are sticking to the side and invert cake out onto a rack, then onto a serving plate. Dust with confectioners’ sugar and cut into squares. Please, promise you’ll serve this with lightly sweetened, softly whipped cream. They’re made for each other.", 
            "Do ahead: Whipped cream needs to be stored in the fridge, of course. Cake keeps at room temperature for up to a week in an airtight container. It gets better with age, just like you, babe. "
        ], 
        "date": "2013-12-23T12:27:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup oatmeal stout or Guinness Stout", 
            "1 cup dark molasses (not blackstrap)", 
            "1/2 teaspoon baking soda", 
            "2 cups all-purpose flour", 
            "1 1/2 teaspoons baking powder", 
            "2 tablespoons ground ginger", 
            "1 teaspoon ground cinnamon", 
            "1/4 teaspoon ground cloves", 
            "1/4 teaspoon freshly grated nutmeg", 
            "Pinch of ground cardamom", 
            "3 large eggs", 
            "1 cup packed dark brown sugar", 
            "1 cup granulated sugar", 
            "3/4 cup vegetable oil", 
            "Confectioners sugar for dusting"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/gramercy-taverns-gingerbread1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Christmas", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2008/12/gramercy-taverns-gingerbread/", 
        "title": "gramercy tavern’s gingerbread", 
        "directions": [
            "Accompaniment: Unsweetened whipped cream", 
            "Preheat oven to 350°F. Generously butter bundt pan and dust with flour, knocking out excess. (She is not kidding about this. I used a nonstick pan with a butter/flour spray and still lost a chunk of cake. I will be more generous next time.)", 
            "Bring stout and molasses to a boil in a large saucepan and remove from heat. Whisk in baking soda, then cool to room temperature.", 
            "Sift together flour, baking powder, and spices in a large bowl. Whisk together eggs and sugars. Whisk in oil, then molasses mixture. Add to flour mixture and whisk until just combined.", 
            "Pour batter into bundt pan and rap pan sharply on counter to eliminate air bubbles. Bake in middle of oven until a tester comes out with just a few moist crumbs adhering, about 50 minutes. Cool cake in pan on a rack 5 minutes. Turn out onto rack and cool completely.", 
            "Serve cake, dusted with confectioners sugar, with whipped cream.", 
            "Do ahead: This gingerbread is better if made a day ahead. It will keep 3 days, covered, at room temperature. I am sure it will keep well-wrapped in the freezer even longer."
        ], 
        "date": "2008-12-25T13:37:45+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 a large, seedless English cucumber (about 6 to 7 ounces), chopped", 
            "1/2 a green bell pepper, chopped", 
            "1 cup (about 6 ounces) cherry or grape tomatoes, halved", 
            "1/4 cup kalamata olives (you can also serve these alongside)", 
            "1/4 small red onion, thinly sliced", 
            "1 lemon, halved", 
            "2 to 3 ounces feta (Bulgarian or French, if you can find them, are my favorites), in thick slices", 
            "2 tablespoons olive oil, or more to taste", 
            "Salt and freshly ground black pepper", 
            "1 sprig oregano, leaves minced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/greek-salad-with-lemon-and-oregano.jpg?w=750", 
        "tags": [
            "Cucumber", 
            "Greek", 
            "Peppers", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/05/greek-salad-with-lemon-and-oregano/", 
        "title": "greek salad with lemon and oregano", 
        "directions": [
            "Toss cucumbers, pepper, tomatoes, olives (if using) and onion in a shallow bowl or deep plate. Squeeze half a lemon over it. Arrange feta slices on top. Drizzle with olive oil, sprinkle with salt, pepper and oregano. Serve with a slice of feta on top of each serving, and the second half of the lemon for those that like their salads punchier.", 
            "* If you’re concerned about the pungency of the raw onion, you can squeeze the lemon juice on top of it and let it sit for a while in a dish before adding both to the salad. It will mellow and soften it.   "
        ], 
        "date": "2013-05-21T13:27:21+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds green beans", 
            "1 cup (5 ounces or 140 grams) almonds, toasted and cooled", 
            "1 1/4 ounces (about 1/3 cup grated) parmesan or aged pecorino cheese, but no need to grate if using a food processor", 
            "1 small garlic clove, peeled and crushed", 
            "Leaves from a sprig or two of thyme", 
            "Pinches of red pepper flakes, to taste", 
            "1/4 teaspoon coarse sea or kosher salt", 
            "2 to 3 teaspoons white wine vinegar", 
            "1/3 cup olive oil, plus extra for drizzling"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/07/green-beans-with-almond-pesto1.jpg?w=640", 
        "tags": [
            "Gluten-Free", 
            "Green Beans", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/07/green-beans-with-almond-pesto/", 
        "title": "green beans with almond pesto", 
        "directions": [
            "Bring a large pot of salted water to boil. Trim green beans — I find using kitchen shears the quickest way — and cook beans in boiling water until crisp tender, about 3 to 4 minutes for regular green beans or 2 to 3 minutes for the skinnier “haricot vert” variety. Plunge in an ice water bath to fully cool. Drain and pat dry. (If you have no patience for the precision of ice water baths, take the green beans out a full minute early as they will continue cooking as they cool.)", 
            "In food processor, grind almonds, cheese, garlic, thyme, pepper and salt to a coarse paste. Add vinegar, and pulse again. Stir in oil and adjust seasonings to taste. ", 
            "Toss cooled green beans with almond pesto. Drizzling with extra olive oil for a fresh glisten. Dig in.", 
            "Serving suggestions: a mix of cherry tomatoes, grilled bread drizzled with olive oil and rubbed with a halved garlic clove or even grilled sausages."
        ], 
        "date": "2015-07-07T10:06:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 ounce (1/2 cup) dried wood ear mushrooms or 5 fresh button or shiitake mushrooms, wiped clean and thinly sliced", 
            "2 tablespoons canola oil or other neutral cooking oil", 
            "1/2 pound lean pork shoulder, sliced 1/8 inch thick and cut into 1-by-1/4-inch strips, or 1/2 pound ground pork", 
            "1 tablespoon finely chopped garlic", 
            "1 tablespoon finely chopped peeled fresh ginger", 
            "1/2 cup chopped scallions, plus more for garnish, if desired", 
            "4 cups chicken stock or low-sodium broth", 
            "1/3 cup (about 2 ounces) bamboo shoots, drained", 
            "1/2 pound soft tofu, cut into 1/2-inch dice", 
            "1/3 cup unseasoned rice vinegar, plus more for serving", 
            "3 tablespoons soy sauce", 
            "1 teaspoon sugar (I skipped this)", 
            "1 teaspoon black or white pepper", 
            "1 teaspoon toasted sesame oil", 
            "1 tablespoon Sriracha, plus more for serving", 
            "Kosher salt", 
            "2 large eggs, beaten"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/hot-and-sour-soup11.jpg?w=640", 
        "tags": [
            "Chinese", 
            "Gluten-Free", 
            "Meat", 
            "Mushrooms", 
            "Photo", 
            "Quick", 
            "Soup", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/02/hot-and-sour-soup/", 
        "title": "hot and sour soup", 
        "directions": [
            "If using dried mushrooms: Cover the mushrooms with boiling water in a small bowl, and let stand until softened, about 30 minutes. Drain and coarsely chop the mushrooms.", 
            "In a large saucepan, heat the canola oil.  Add the pork, garlic, ginger and 1/2 cup scallions and cook over moderately high heat, stirring occasionally, until the pork is golden brown, about 3 minutes. Stir in the stock and add the bamboo shoots (if using), tofu, 1/3 cup of vinegar, the soy sauce, sugar, pepper, sesame oil, mushrooms and 1 tablespoon Sriracha. Bring the soup to a simmer and season with salt. While stirring constantly, drizzle in the eggs and cook until strands form, about 1 minute. Serve hot, garnished with extra scallions if desired, passing rice vinegar and Sriracha at the table."
        ], 
        "date": "2016-02-08T11:55:08+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/huevos-rancheros1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Budget", 
            "Eggs", 
            "Photo", 
            "Quick", 
            "Tex-Mex", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/07/huevos-rancheros/", 
        "title": "huevos rancheros", 
        "directions": [], 
        "date": "2008-07-27T21:55:42+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup pistachios, shelled and toasted", 
            "1/2 cup pitted green (what I used) or Cerignola (what Burrell recommends) olives", 
            "2 tablespoons capers", 
            "1 clove garlic, smashed", 
            "1 tablespoon freshly chopped oregano leaves (nixed because mine had gone bad)", 
            "2 tablespoons freshly chopped parsley leaves", 
            "Extra-virgin olive oil", 
            "1 lemon, zested", 
            "1 (8-rib) rack of lamb or 6 lamb chops", 
            "Salt", 
            "Freshly ground black pepper*"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/06/lamb-chops-with-pistachio-tapenade.jpg?w=749", 
        "tags": [
            "Easter", 
            "Meat", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2010/06/lamb-chops-with-pistachio-tapenade/", 
        "title": "lamb chops with pistachio tapenade", 
        "directions": [
            "To make the pistachio tapenade: In a food processor combine the pistachios, olives, capers, garlic, herbs and puree. While the machine is running, slowly drizzle in olive oil until the mixture becomes a paste. Add the zest and pulse 1 more time, drizzling in more oil if necessary. Reserve until ready to use.", 
            "If using a rack of ribs: Remove 2 rib bones from the 8 rib rack to make it a 6-rib rack. Counting from either end, remove the 2nd and 7th bones; this will create 6 even chops that are thicker than a normal lamb chop. Cut 6 even chops.", 
            "Cook your chops: Season your six lamb chops generously on either side with salt and freshly ground black pepper. Allow them to sit for 10 to 15 minutes before cooking.", 
            "Preheat oven to 425 degrees F. Coat a large saute pan generously with olive oil and bring to medium-high heat. When the oil is hot but not smoking, add the lamb chops and cook for about 2 minutes on each side to brown. If the pan begins to smoke, lower the heat. The chops should be beautifully caramelized on both sides. Remove the chops to a sheet pan and schmear generously with the pistachio tapenade. Place in preheated oven and cook another 4 to 5 minutes for medium rare. Remove chops from oven and let rest for at least 5 minutes before serving.", 
            "* My addition. Does anyone know why not a single Anne Burrell recipe calls for black pepper, only salt? I would love to hear your theories!"
        ], 
        "date": "2010-06-04T09:48:17+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 cups crushed or small ice cubes", 
            "1 cup coconut milk, well-shaken if from a can", 
            "1/3 cup lime juice (from about 3 limes)", 
            "3 tablespoons granulated or superfine sugar (more or less to taste)", 
            "Lime slices for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/frozen-coconut-limeade1.jpg?w=640", 
        "tags": [
            "Citrus", 
            "Coconut", 
            "Drinks", 
            "Lime", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2014/06/limonada-de-coco/", 
        "title": "frozen coconut limeade", 
        "directions": [
            "Blend every thing until it reaches your desired consistency — almost smooth, for a crunchier effect, or fully smooth, for a milkshake/creamier effect. Pour into glasses, garnish with lime and don’t forget to share.\n"
        ], 
        "date": "2014-06-19T11:07:52+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (85 grams) slivered almonds", 
            "1 large handful fresh basil leaves", 
            "1 to 2 large garlic cloves", 
            "Several sprinkles of sea salt", 
            "6 ripe plum tomatoes, quartered", 
            "1/2 cup (50 grams) grated Pecorino or Parmesan", 
            "1/4 to 1/3 cup (60 to 80 ml) olive oil", 
            "1 pound (455 grams) linguine"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/linguine-with-tomato-almond-pesto1.jpg?w=500", 
        "tags": [
            "Italian", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Tomatoes", 
            "Travel", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/09/linguine-with-tomato-almond-pesto/", 
        "title": "linguine with tomato-almond pesto", 
        "directions": [
            "In a large skillet, sauté the almonds in a little olive oil until toasted. Let cool, then blend them in a food processor or blender until they are in coarse pieces.  (“The size of orzo,” the original recipe suggests.) Scoop them out of the processor and set them aside.", 
            "Put the basil, garlic and a few pinches of sea salt into the food processor and chop. Add the almonds back to the food processor (keeping them separate will keep them from getting too finely chopped as you get the basil and garlic to the right texture) with the tomatoes, cheese and olive oil and whirl briefly. Season it with freshly ground black pepper.", 
            "Cook your linguine until it is al dente and could use another minute of cooking time. Reserve one cup of pasta cooking water and drain the rest. Immediately toss the hot linguine with the pesto and mix quickly so that it drinks the sauce up a bit. Add more pasta water if needed. Serve this lukewarm, or at room temperature, with a glass of wine, after you get the baby to bed."
        ], 
        "date": "2010-09-14T11:07:16+00:00"
    }, 
    {
        "ingredient_list": [
            "Base and lattice", 
            "4 1/2 cups (1 pound or 455 grams) shelled walnuts", 
            "3 cups (375 grams) all-purpose flour", 
            "2 teaspoons ground cinnamon", 
            "1/2 teaspoon ground cloves (I halved this, using only 1/4 teaspoon)", 
            "1/4 to 1/2 teaspoon table salt (Heatter says 1/4, I really prefer this with 1/2)", 
            "2 1/2 sticks (10 ounces or 285 grams) cold, unsalted butter, cut into chunks", 
            "1 2/3 cup (330 grams) granulated sugar", 
            "1 egg plus 1 egg yolk", 
            "Finely grated zest of 1 lemon", 
            "Filling", 
            "1/4 cup (about 20 to 25 grams) fine, dry breadcrumbs", 
            "2 cups (about 575 grams) seedless raspberry jam", 
            "To finish", 
            "1 egg yolk", 
            "1 teaspoon water", 
            "2/3 to 1 cup (75 to 115 grams) to slivered almonds (julienne-shaped pieces) (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/linzer-torte1.jpg?w=640", 
        "tags": [
            "Austrian", 
            "Christmas", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2013/12/linzer-torte/", 
        "title": "linzer torte", 
        "directions": [
            "Make base: Heat oven to 400 degrees. Butter two 9-inch round layer cake pans (preferably with removable bottoms if you plan to serve this in wedges, like a cake), two 8-inch square pans (what I used, then cut each into square bars, like cookies), one 9×13-inch rectangular pan (again, for bar cookies) or one 11- to 12-inch round cake pan (again ideally with a removable bottom). Line the bottom of each with a piece of parchment paper cut to fit, then butter then paper. ", 
            "In a food processor, process walnuts and 1/2 cup of the flour (reserve remaining 2 1/2 cups for next step) for 15 seconds, or until the nuts are finely ground but have not formed a paste. ", 
            "Place remaining 2 1/2 cups flour, cinnamon, cloves and salt in a large, wide-ish mixing bowl. With a pastry blender, work the butter into the dry mixture until it forms coarse crumbs. Stir in the sugar and walnut-flour mixture. In a small dish, beat the whole egg, yolk, and lemon rind utnil combined, and stir into crumb mixture. Stir the mixture in as best as you can with a spoon, then work the rest in with your hands. Knead the dough a few times inside the bowl until a cohesive mass, one that holds together, forms. ", 
            "Divide dough into quarters if making two tortes, or halves if making one.", 
            "Place one portion into the bottom of each pan, and press evenly and firmly over the bottoms and then about 1 1/4 to 1 1/2 inches up the sides with your fingers. Don’t worry about making it smooth or level on the sides; it gets filled in later.", 
            "Bake shell(s) for 15 minutes, or until it barely begins to color at the edges.", 
            "While the shell(s) bakes, roll remaining piece(s) of dough between two pieces of waxed paper, until 1/4- to 3/8-inch in thickness one inch bigger than your pan size. [I.e., for each 9-inch round torte, you’ll want a 10-inch diameter circle; for each 8-inch square torte, a 9-inch square, etc.] Transfer to freezer until the dough is well-chilled, about 20 minutes.", 
            "Remove shell(s) from oven and let cool slightly; reduce baking temperature to 350 degrees. ", 
            "Make filling: If you’re using panko or another coarse dry breadcrumb, you can pulse it in a food processor until it is fine powder. I found I needed almost double the volume in panko (7 tablespoons) to yield 1/4 cup of a fine breadcrumb powder.", 
            "Sprinkle 2 tablespoons finely ground breadcrumbs over each par-baked shell, or all 1/4 cup over your single large one. If jam is not already soft, stir it until it is, then spread 1 cup over each shell. Cut dough(s) into 1/2- to 3/4-inch wide strips, cutting through the bottom of the waxed paper at the same time. Lift each strip-and-waxed paper over the jam and reverse it onto the jam, then peel off waxed paper. Cut the ends of the dough by pressing them onto the sides of the pan. Arrange strips 1/2- to 3/4-inch apart, crisscrossing them on an angle to make a lattice top with diamond-shaped openings. [Note: I neither “wove” my lattice or ended up making “diamond-shaped” openings. Oops.] Use leftover pieces to fill in any gaps between lattice-strips and tall sides of shells. The two doughs will blend together in the oven. ", 
            "To finish: Mix egg yolks and water. Brush it all over lattice top and border. Sprinkle with almonds, if using. (I prefer to use 1/3 cup per smaller torte, instead of the 1/2 cup Heatter recommends. I only sprinkled them on one.) Bake torte(s) for 45 to 60 minutes (Heatter recommends 60, I find it perfect, but ovens and baking pans vary, check yours sooner if you’re nervous), until crust and almonds on top are well-browned. ", 
            "Remove from oven and place on racks. If you’ve baked it in a cake pan and wish to serve it as a “cake,” i.e. in wedges, Heatter recommends that you remove it from the pan while still warm by cutting around the torte carefully (the crust is very fragile) with a small, sharp knife and loosening the torte in the pan, before reversing it onto a cooling rack, and then back again onto another rack to finish cooling. If using a pan with a removable base, you should safely be able to remove it once it has fully cooled. Personally, I had no trouble letting my cool fully in the square pan but the first square did not come out cleanly. ", 
            "Once fully cool, Heatter recommends you let the tortes stand overnight (covered with foil) before serving for best flavor. You can decorate the tortes with powdered sugar before serving in wedges or squares. "
        ], 
        "date": "2013-12-13T12:34:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound small shrimp, shelled and deveined or pre-cooked and defrosted", 
            "2 firm-ripe avocados, halved, scored into a small dice", 
            "2 cups grape tomatoes, quartered or 2 cups chopped tomatoes, drained a little", 
            "1/2 small white onion, very finely chopped (use red if you can’t find white)", 
            "1 small jalapeño, seeded and finely chopped (optional)", 
            "Drizzle of olive oil", 
            "Juice of 1 to 2 limes", 
            "Salt", 
            "Handful cilantro leaves, roughly chopped", 
            "Hot sauce, on the side", 
            "Tortilla chips, to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/9349257784_815a1814b7_o.jpg?w=750", 
        "tags": [
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Seafood", 
            "Side Dish", 
            "Summer", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2013/07/mama-canales-garcias-avocado-shrimp-salsa/", 
        "title": "mama canales-garcia’s avocado-shrimp salsa", 
        "directions": [
            "To cook the shrimp: Bring salted water* to a boil and turn off heat. Add shrimp, cover pot and let stand until firm and pink, about 5 to 7 minutes. Drain shrimp, pat dry and chill. ", 
            "Make salsa: Chop shrimp into small bites and put in medium bowl. Scoop avocados into bowl. Add tomatoes, white onion, jalapeño (if using, to taste) and a drizzle of olive oil. Add the juice of one lime, and a second one, if needed. Add salt to taste, then cilantro. Serve with tortilla chips.", 
            "* If you have more time, you can first make a shrimp stock with about 3 cups water, 1 cup beer or wine, the reserved shrimp shells, additional lime juice or the peels from the lime juice you’ll use in the salad and some peppercorns or red pepper flakes. Boil these together for 20 minutes, then strain the mixture. Cook the shrimp in this stock instead."
        ], 
        "date": "2013-07-23T12:01:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup cherry tomatoes, halved", 
            "1/3 cup chopped, pitted Kalmata olives", 
            "1 clove garlic, minced", 
            "1/4 cup thinly sliced red onion (oops, I forgot this)", 
            "2 tablespoons finely-chopped fresh flat-leaf parsley, divided", 
            "1 teaspoon dried oregano", 
            "1 teaspoon olive oil", 
            "Freshly ground black pepper", 
            "1 8- to 10-ounce block feta", 
            "Crackers, flatbread*, pita chips, or crostini, for dipping "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/08/mediterranean-baked-feta-with-tomatoes.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/08/mediterranean-baked-feta-with-tomatoes/", 
        "title": "mediterranean baked feta with tomatoes", 
        "directions": [
            "In a bowl, mix the tomatoes, olives, onion, garlic, 1 tablespoon of the parsley, oregano, olive oil and a few grinds of pepper. ", 
            "On a grill: Heat your grill to medium-high. Set the feta block in the middle of a piece of foil. Pile the tomato mixture on top of the feta. Fold up the edges of the foil so that it will hold in any liquid as it cooks. Place the packet straight on a grill for 15 minutes to warm it through. Remove from grill and transfer to plate or serving dish.", 
            "In the oven: Heat oven to 400°F. Check to see that your dish is oven-proof. (I didn’t!) Place the block of feta in the middle of your dish. Pile the tomato mixture on top of the feta. Bake for 15 minutes. ", 
            "Both methods: The feta will not melt, just warm and soften. Garnish with parsley and serve with crackers; eat immediately. As it cools, the feta will firm up again. We found that the dish could be returned to the oven to soften it again. We did this with leftovers, too.", 
            "* I made these. These days, I’ve been running a pizza wheel over the rolled-out pieces to pre-cut it into rough rectangles before baking it, like so."
        ], 
        "date": "2012-08-24T15:33:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (3 1/2- to 4-pound) spaghetti squash", 
            "1/2 stick (4 tablespoons) unsalted butter, cut into pieces", 
            "2 garlic cloves, minced", 
            "1 teaspoon ground cumin", 
            "1/2 teaspoon ground coriander", 
            "1/8 teaspoon cayenne", 
            "3/4 teaspoon salt", 
            "2 tablespoons chopped fresh cilantro or flat-leaf parsley, if you’re cilantro-averse"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/moroccan-spiced-spaghetti-squash1.jpg?w=500", 
        "tags": [
            "Fall", 
            "North African", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2009/11/moroccan-spiced-spaghetti-squash/", 
        "title": "moroccan-spiced spaghetti squash", 
        "directions": [
            "To cook the squash in a microwave: Pierce squash (about an inch deep) all over with a small sharp knife to prevent bursting. Cook in an 800-watt microwave oven on high power (100 percent) for 6 to 7 minutes. Turn squash over and microwave until squash feels slightly soft when pressed, 8 to 10 minutes more. Cool squash for 5 minutes.", 
            "To roast the squash, two methods: If you’d like to roast the squash whole, pierce it all over with a small sharp knife to prevent bursting and bake it in a 375°F oven for one hour. If you are good with a big, sharp kinfe, you can save some time by cutting the squash in half lengthwise, scooping out the seeds and roasting the halves face-down in an oiled baking pan for about 40 minutes in a 375°F oven.", 
            "Meanwhile, melt the butter in a small saucepan over medium heat. Add the garlic and cook, stirring, until it is barely golden. Stir in spices and salt and remove from heat.", 
            "If you have microwaved or roasted your squash whole, carefully halve it lengthwise (it will give off a lot of steam) and remove the seeds.", 
            "Carefully halve squash lengthwise (it will give off steam) and remove and discard seeds. Working over a bowl, scrape squash flesh with a fork, loosening and separating strands as you remove it from skin. Toss with the  spiced butter and cilantro. "
        ], 
        "date": "2009-11-05T22:36:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound (8 ounces or 225 grams) pasta of you choice, such as a ziti or twisty shape", 
            "1 tablespoon (15 ml) olive oil", 
            "3/4 pounds (340 grams) fresh mushroom, sliced (I used pre-sliced cremini, my new favorite thing)", 
            "1 small-to-medium yellow onion, halved and sliced thin", 
            "Salt and freshly ground black pepper to taste", 
            "1/4 cup (60 ml) dry marsala wine (see notes at end for more information)", 
            "3 tablespoons (45 grams) unsalted butter", 
            "3 tablespoons (25 grams) all-purpose flour", 
            "1 1/2 cups (355 ml) stock or broth (chicken, vegetable or mushroom)", 
            "1/2 cup (50 grams) finely grated parmesan cheese", 
            "4 ounces (115 grams) mozzarella, cut into small cubes", 
            "3 tablespoons chopped fresh flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/mushroom-marsala-pasta-bake1.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Date Night", 
            "Freezer Friendly", 
            "Mushrooms", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/01/mushroom-marsala-pasta-bake/", 
        "title": "mushroom marsala pasta bake", 
        "directions": [
            "A tip: If we play our cards right here, this can be made entirely in one dish. I used a 4-quart Staub braiser (Happy Hanukah to me!) but any 3-to-4 quart stovetop-to-oven type dish will work.", 
            "Cook the pasta: Bring a pot of well-salted water to a boil. Add pasta and cook until al dente, about 1 to 2 minutes before perfect doneness. Drain and set aside.", 
            "Heat oven: To 400 degrees.", 
            "Make the sauce: Reheat your empty pasta pot over high heat. Add oil and once it is hot, add mushrooms and cook until they’ve begun to brown and glisten, but have not yet released their liquid. Reduce heat to medium-high, add onions, salt and pepper and saute together until the liquid the mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until it has almost or fully evaporated (depending on your preference). Add butter, stir until melted. Add flour, and stir until all has been dampened and absorbed. Add stock, a very small splash at a time, stirring the whole time with a spoon. Make sure each splash has been fully mixed into the butter/flour/mushroom mixture, scraping from the bottom of the pan and all around, before adding the next splash. Repeat until all stock has been added. Let mixture simmer together for 2 minutes, stirring frequently; the sauce will thicken. Remove pan from heat.", 
            "Assemble and bake dish: If you’re cooking in an ovensafe dish, add cooked pasta and stir until combined. (If you’re not cooking in an ovensafe dish, transfer this mixture to a 2-quart baking dish.) Stir in half the parmesan, all of the mozzarella and two tablespoons of the parsley until evenly mixed. Sprinkle the top with remaining parmesan. Bake for 25 to 30 minutes, until edges of pasta are golden brown and irresistible. Sprinkle with reserved parsley and serve hot. Reheat as needed.", 
            "A bunch of notes: "
        ], 
        "date": "2015-01-12T12:03:33+00:00"
    }, 
    {
        "ingredient_list": [
            "3 ounces (85 grams) unsweetened chocolate, roughly chopped", 
            "1 stick (4 ounces or 115 grams) unsalted butter, plus extra for pan", 
            "1 1/3 cups (265 grams) granulated sugar", 
            "2 large eggs", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1/2 teaspoon flaky sea salt or 1/4 teaspoon table salt (about 2 grams)", 
            "2/3 cup (85 grams) all-purpose flour "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/08/my-favorite-brownies.jpg?w=750", 
        "tags": [
            "Brownies/Blondies", 
            "Chocolate", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2012/08/my-favorite-brownies/", 
        "title": "my favorite brownies", 
        "directions": [
            "Heat oven to 350°F. Line an 8×8-inch square baking pan with parchment, extending it up two sides, or foil. Butter the parchment or foil or spray it with a nonstick cooking spray. ", 
            "In a medium heatproof bowl over gently simmering water, melt chocolate and butter together until only a couple unmelted bits remain. Off the heat, stir until smooth and fully melted. You can also do this in the microwave in 30-second bursts, stirring between each. Whisk in sugar, then eggs, one at a time, then vanilla and salt. Stir in flour with a spoon or flexible spatula and scrape batter into prepared pan, spread until even. Bake for 25 to 30 minutes, or until a toothpick inserted into the center comes out batter-free. ", 
            "Let cool and cut into desired size. If you’re like me, you will prefer these and all brownies, cold or even frozen. But I bet you’re normal and will just eat them hot from the pan. If desired, dust the brownies with powdered sugar before serving."
        ], 
        "date": "2012-08-20T14:31:09+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2-inch slice seven-grain sandwich bread", 
            "1/2 a large, ripe avocado", 
            "1 tablespoon olive oil", 
            "1 tablespoon lemon juice, or more to taste", 
            "Salt", 
            "An unholy amount of red pepper flakes"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/nolita-style-avocado-toast1.jpg?w=640", 
        "tags": [
            "Avocado", 
            "Budget", 
            "Photo", 
            "Quick", 
            "Sandwich", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/03/nolita-style-avocado-toast/", 
        "title": "nolita-style avocado toast", 
        "directions": [
            "Toast the bread so that it’s dark and firm. Scoop the avocado into a bowl and lightly mash/chop it, or directly onto your toast and do the same. Spread the avocado from edge to edge of the toast, leaving no bread uncovered, mounding it smoothly in the center. Drizzle olive oil over so that it rolls off onto the plate. Repeat with lemon juice. Shake or grind on some fine salt and cover with red pepper flakes. Slice toast on the diagonal and eat with a knife and fork, if before noon, with a cup of coffee or tea, if after, a petite glass of rose wine. ", 
            "On the side: If trying to stretch this into a fuller meal, you cannot go wrong with David Lebovitz’s simple carrot salad on the side, or the Moroccan-hinted harissa and feta version in the archives here."
        ], 
        "date": "2016-03-08T12:05:25+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups water", 
            "1 cup (updated) semi-pearled farro (see Note above for farro types)", 
            "1/2 large onion (I usually use a white one, for mildness)", 
            "2 cloves garlic", 
            "9 ounces grape or cherry tomatoes", 
            "1 1/4 teaspoons kosher or coarse sea salt", 
            "Up to 1/4 teaspoon red pepper flakes (to taste)", 
            "1 tablespoon olive oil, plus extra for drizzling", 
            "Few basil leaves, cut into thin ribbons", 
            "Grated parmesan cheese, for serving (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/one-pan-farro-with-tomatoes.jpg?w=750", 
        "tags": [
            "Grain/Rice", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Tomatoes", 
            "Vegan", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/07/one-pan-farro-with-tomatoes/", 
        "title": "one-pan farro with tomatoes", 
        "directions": [
            "Place water and farro in a medium saucepan to presoak (I find just 5 to 10 minutes sufficient) while you prepare the other ingredients. Adding each ingredient to the pot as you finish preparing it, cut onion in half again, and very thinly slice it into quarter-moons. Thinly slice garlic cloves as well. Halve or quarter tomatoes. Add salt, pepper flakes (to taste) and 1 tablespoon olive oil to pan, and set a timer for 30 minutes. Bring uncovered pan (no lid necessary) up to a boil, then reduce to a gentle simmer, stirring occasionally. When the timer rings, the farro should be perfectly cooked (tender but with a meaty chew), seasoned and the cooking water should be almost completely absorbed. If needed, though I’ve never found it necessary, cook it for 5 additional minutes, until farro is more tender. ", 
            "Transfer to a wide serving bowl. If there’s enough leftover cooking liquid to be bothersome, simply use a slotted spoon to leave the amount you wish to behind. Drizzle farro lightly with additional olive oil, scatter with basil and parmesan. Eat immediately. Repeat tomorrow."
        ], 
        "date": "2013-07-15T12:04:00+00:00"
    }, 
    {
        "ingredient_list": [
            "2 heads cauliflower", 
            "1 medium onion", 
            "4 cloves garlic", 
            "1 pound whole-wheat pasta", 
            "Extra-virgin olive oil", 
            "Salt and pepper", 
            "1 pinch red pepper flakes", 
            "White wine vinegar", 
            "1/2 lemon", 
            "1/2 cup toasted walnuts", 
            "4 ounces ricotta salata or feta cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pasta-with-cauliflower-walnuts-and-feta1.jpg?w=500", 
        "tags": [
            "Cauliflower", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/03/pasta-with-cauliflower-walnuts-and-feta/", 
        "title": "pasta with cauliflower, walnuts and feta", 
        "directions": [
            "Put a large pot of water on to boil. Cut the cauliflower into small flowerets. Peel the onion and slice it very thin. Peel and finely chop the garlic. Put the pasta on to cook.", 
            "Saute the cauliflower in olive oil in a large saute pan. When the cauliflower begins to soften, season with salt and pepper and add the sliced onion and red pepper flakes. Saute over medium to high heat until the vegetables are brown and tender. The cauliflower should still be slightly crunchy and should not taste steamed. Add the garlic and remove from the heat, tossing and stirring so the garlic doesn’t burn; if it starts to brown, add a splash of water. Add a few drops each of vinegar and lemon juice and the toasted walnuts. Taste and correct the seasoning. When the pasta is done, drain and add to the cauliflower, adding enough extra-virgin olive oil to coat the pasta thoroughly, toss together and serve, with the cheese crumbled over the dish."
        ], 
        "date": "2008-03-17T22:17:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound pasta, whatever shape you like (but chunky ones will match up better with the rabe)", 
            "1 pound broccoli rabe, heavy stems removed, remaining stems and leaves cut into 1- to 2-inch sections (I attempt to match my pasta in length)", 
            "1/2 cup olive oil", 
            "5 garlic cloves, peeled and minced or pressed", 
            "1/2 teaspoon red pepper flakes, or more or less to taste", 
            "About 1 heaping teaspoon Kosher salt (or more to taste)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/pasta-with-garlicky-broccoli-rabe1.jpg?w=640", 
        "tags": [
            "Broccoli Rabe", 
            "Budget", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2012/04/pasta-with-garlicky-broccoli-rabe/", 
        "title": "pasta with garlicky broccoli rabe", 
        "directions": [
            "To serve: Grated Parmesan or Romano cheese", 
            "Bring a huge pot of salted water to a boil. Add pasta and five minutes before its cooking time is up, add the broccoli rabe. It will seem like too much for the water, but with a stir or two, the rabe should wilt and cook alongside the pasta. Drain rabe and pasta together and pour into serving bowl. In the same pot or a tiny one, heat the olive oil with the garlic, pepper flakes and Kosher salt over moderate heat, stirring frequently for 3 to 4 minutes, or until the garlic becomes lightly golden. Pour mixture over pasta and toss to evenly coat. Shower with freshly grated cheese and eat at once."
        ], 
        "date": "2012-04-19T15:59:04+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust:", 
            "1 1/4 cups (155 grams) all-purpose flour", 
            "1 1/2 teaspoons (6 grams) granulated sugar", 
            "1/2 teaspoon (3 grams) fine sea or table salt", 
            "1 stick (4 ounces or 115 grams) cold unsalted butter, cut into chunks", 
            "1/4 cup (60 ml) very cold water, plus an additional tablespoon if needed", 
            "Filling", 
            "6 tablespoons unsalted butter", 
            "1 cup packed dark brown sugar", 
            "3/4 cup golden syrup (see Note up top)", 
            "A pinch or two of sea salt", 
            "2 cups (225 grams) pecan halves", 
            "1 teaspoon apple cider vinegar", 
            "1 tablespoon bourbon (optional)", 
            "2 teaspoons vanilla extract", 
            "3 large eggs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/pecan-pie1.jpg?w=750", 
        "tags": [
            "Christmas", 
            "Photo", 
            "Tarts/Pies", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2015/11/pecan-pie/", 
        "title": "pecan pie", 
        "directions": [
            "Make the pie dough: ", 
            "Form the crust: On a floured counter, roll the dough out into a 12 to 13-inch circle-ish shape. Fold dough gently in quarters without creasing and transfer to a 9-inch standard (not deep-dish) pie plate. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. If not parbaking, place in fridge until ready to fill. If parbaking, place in freezer for 20 minutes, until solid.", 
            "Par-bake the crust: [Optional, but will lead to a crispier base.] Heat oven 400°F (205°C). Line frozen crust with lightly buttered or oiled foil. Fill with pie weights, dried beans or pennies. Bake on a rimmed baking sheet for 20 minutes. Carefully remove foil and weights and let cool a little before filling. ", 
            "Heat oven: (Or reduce oven heat, if you just par-baked your crust) to 350°F (175°C).", 
            "Prepare filling: Spread pecans on a rimmed baking sheet and toast in the oven for 10 to 12 minutes, stirring once or twice so that they toast evenly. Set aside until needed. If you like smaller bits, you can chop them, or as shown here, chop half of them (although I usually leave them whole).", 
            "In medium saucepan, combine butter, brown sugar, golden syrup and pinch of salt. Bring to a simmer over medium heat and cook for 2 minutes, stirring. Remove from heat and stir in pecans, cider vinegar, vanilla and bourbon (if using). Pour into a bowl (so that it cools faster) and set the mixture aside to cool a little, about 5 to 10 minutes. Then, whisk in one egg at a time until combined. Pour mixture into prepared pie shell. ", 
            "Bake: For 40 to 45 minutes. The pie is done with the edges are set and puffed slightly and the center is slightly firm to the touch but still has some jiggle to it. Cool on a rack. Serve slightly warm or room temperature."
        ], 
        "date": "2015-11-12T12:04:09+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large (about 12 ounces), not-too-firm seeded baguette", 
            "8 tablespoons (115 grams or 4 ounces) unsalted or salted butter (if salted, skip the salt below), cut into chunks", 
            "4 medium cloves garlic, minced", 
            "Pinches of red pepper flakes, to taste", 
            "1/2 teaspoon coarse or kosher salt", 
            "1/2 teaspoon dried oregano (optional)", 
            "1/3 to 1/2 cup finely grated parmesan or aged pecorino cheese (optional)", 
            "1 tablespoon finely chopped parsley", 
            "1 tablespoon minced chives (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/04/perfect-garlic-bread1.jpg?w=640", 
        "tags": [
            "Bread", 
            "Italian", 
            "Photo", 
            "Put An Egg On It", 
            "Quick", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/04/perfect-garlic-bread/", 
        "title": "perfect garlic bread", 
        "directions": [
            "Heat your oven’s broiler. Line a large baking sheet with foil to limit the mess you make. Cut baguette lengthwise and arrange pieces cut side up in pan. Put butter, garlic, pepper flakes and salt in a small saucepan and melt over medium-high heat, stirring, until garlic is sizzling in the butter (but not browning). Remove from heat and stir in oregano, if using. Spoon evenly over bread. Sprinkle bread with parmesan, if using, and broil — keeping a close watch on it and turning it as needed for even coloring — for 2 to 3 minutes. Seriously, watch it like a hawk. Nothing’s sadder than under- or over-cooked garlic bread. ", 
            "Remove from oven, sprinkle with parsley and chives, if using, and cut into segments. We keep extras in foil in the fridge and rewarm them in the oven, but you know it’s always best on the first day."
        ], 
        "date": "2016-04-19T12:01:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1 to 2 tablespoons olive oil", 
            "2 tablespoons thinly sliced almonds", 
            "1 medium or 2 small zucchinis, cut into 1/8-inch matchsticks", 
            "Salt and freshly ground pepper", 
            "Peelings of pecorino romano or parmesan cheese, to taste (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/08/quick-zucchini-saute.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Budget", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2007/08/quick-zucchini-saute/", 
        "title": "quick zucchini sauté", 
        "directions": [
            "Heat a large skillet over medium-high and add enough oil to coat the pan well. Heat the oil until hot but not smoking, then add the almonds to the pan. Cook them, stirring, until the almonds are golden-brown, approximately a minute or two. Don’t skimp on this step; they provide a depth of flavor that carries the whole dish. Add the zucchini to the pan, tossing it with the oil and almonds until it just begins to glisten, about one minute. The idea is not to cook the zucchini so much as warm it so it begins to soften. Season well with salt and pepper, slide onto a plate, top with cheese (if using) and immediately dig in."
        ], 
        "date": "2007-08-02T16:50:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup extra virgin olive oil", 
            "1/4 cup chopped fresh ginger (I use half this; I’m tepid in the fresh ginger department)", 
            "1 medium onion, finely chopped", 
            "1 plum tomato, diced", 
            "3 cloves garlic, chopped", 
            "1 large green chili, chopped (optional)", 
            "1 teaspoon salt", 
            "1 teaspoon ground cumin", 
            "1 teaspoon ground coriander", 
            "1/2 teaspoon cumin seeds", 
            "1/2 teaspoon ground tumeric", 
            "1/4 teaspoon cayenne", 
            "8 ounce can of tomato sauce or 8 ounces of one of your choice", 
            "3 cups boiled red kidney beans or 30 ounces canned red kidney beans, undrained", 
            "1/2 cup chopped fresh cilantro (or parsley, if you’re cilantro-averse)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/02/red-kidney-bean-curry.jpg?w=753", 
        "tags": [
            "Beans", 
            "Freezer Friendly", 
            "Indian", 
            "Photo", 
            "Quick", 
            "Stew", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/02/red-kidney-bean-curry/", 
        "title": "red kidney bean curry", 
        "directions": [
            "Heat oil in a deep sauce pan over medium heat for one minute. Add ginger, garlic, onion, green chili, and let sizzle for one minute. Add the tomato sauce, salt and remaining spices and cook for an additional five minutes, stirring frequently. Add the kidney beans with water or canned red kidney beans (undrained) plus one additional cup of water, and tomatoes. Bring it to a boil, then reduce to medium heat and let cook uncovered for 10 minutes. Remove from heat. Garnish with cilantro.", 
            "Serve over rice or with naan. A dollop of plain yougurt on top is heavenly."
        ], 
        "date": "2009-02-17T19:21:06+00:00"
    }, 
    {
        "ingredient_list": [
            "Cake", 
            "6 tablespoons (85 grams) unsalted butter, at room temperature", 
            "3/4 cup (145 grams) firmly packed dark brown sugar", 
            "1/4 cup (50 grams) white granulated sugar", 
            "1 large egg + 1 large egg yolk, at room temperature", 
            "3/4 cup (177 ml) red wine, any kind you like*", 
            "1 teaspoon (5 ml) vanilla extract", 
            "1 cup + 1 tablespoon (133 grams) all-purpose flour", 
            "1/2 cup (41 grams) Dutch cocoa powder", 
            "1/8 teaspoon baking soda", 
            "1/2 teaspoon baking powder", 
            "1/4 teaspoon table salt", 
            "1/4 teaspoon ground cinnamon (this is a great place for that fancy Vietnamese stuff you stashed away)", 
            "Topping", 
            "1/2 cup mascarpone cheese", 
            "1/2 cup (118 grams) chilled heavy or whipping cream", 
            "2 tablespoons (25 grams) granulated sugar", 
            "1/4 teaspoon vanilla extract"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/09/red-wine-chocolate-cake.jpg?w=750", 
        "tags": [
            "Chocolate", 
            "Everyday Cakes", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2011/09/red-wine-chocolate-cake/", 
        "title": "red wine chocolate cake", 
        "directions": [
            "Make the cake: Preheat the oven to 325°F. Line the bottom of a 9-inch round cake pan with parchment, and either butter and lightly flour the parchment and exposed sides of the pan, or spray the interior with a nonstick spray. In a large bowl, on the medium speed of an electric mixer, cream the butter until smooth. Add the sugars and beat until fluffy, about 3 minutes. Add the egg and yolk and beat well, then the red wine and vanilla. Don’t worry if the batter looks a little uneven. Sift the flour, cocoa, baking soda, baking powder, cinnamon and salt together, right over your wet ingredients. Mix until 3/4 combined, then fold the rest together with a rubber spatula. Spread batter in prepared pan. Bake for 25 to 30 minutes, or until a cake tester inserted into the center comes out clean. The top of the cake should be shiny and smooth, like a puddle of chocolate. Cool in pan on a rack for about 10 minutes, then flip out of pan and cool the rest of the way on a cooling rack. This cake keeps well at room temperature or in the fridge. It looks pretty dusted with powdered sugar.", 
            "Make the topping: Whip mascarpone, cream, sugar and vanilla together until soft peaks form — don’t overwhip. Dollop generously on each slice of cake. It can also be covered and refrigerated for up to 4 hours.", 
            "* I used Bedell First Crush Red, one of our North Fork favorites."
        ], 
        "date": "2011-09-12T10:06:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup pine nuts or sliced almonds, toasted* and cooled", 
            "1 pound asparagus, rinsed", 
            "1 lemon, halved", 
            "Olive oil", 
            "Coarse salt", 
            "Freshly ground black pepper", 
            "1 to 2 ounces Parmesan cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/ribboned-asparagus-salad-with-lemon1.jpg?w=500", 
        "tags": [
            "Asparagus", 
            "Budget", 
            "Photo", 
            "Quick", 
            "Salad", 
            "Spring"
        ], 
        "url": "https://smittenkitchen.com/2011/05/ribboned-asparagus-salad-with-lemon/", 
        "title": "ribboned asparagus salad with lemon", 
        "directions": [
            "No need to snap off the tough ends of your asparagus. Lay a single stalk on its side on a cutting board. Holding onto the tough end, use a vegetable peeler (a Y-shaped peeler is easiest, but I’ve used a standard one successfully) to shave off thin asparagus ribbons from stalk to tip, peeling away from the tough end in your hand. [Updated] Discard the tough ends once you’re done peeling. Gently pile your ribbons on a medium-sized serving platter. Squeeze some lemon juice over the asparagus, drizzle it with a bit of olive oil and sprinkle it with salt and pepper. Toss gently and then use your peeler to shave curls of Parmesan right off the block, over the asparagus. Sprinkle with some toasted nuts. Repeat with remaining asparagus, a third of the remaining bundle at a time. Eat immediately.", 
            "* I toast mine in a single layer on a baking sheet at 350 for 5 to 10 minutes. It’s really important, especially with pine nuts, that you stay close and toss them frequently because they love to burn, but if you move them around a bit, you can get a wonderful, even coffee coffee color on them and an intensely nutty flavor. It makes even unfancy nuts taste amazing."
        ], 
        "date": "2011-05-02T14:41:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (4 tablespoons, 2 ounces or 1/2 stick) unsalted butter", 
            "1/2 cup (about 109 grams) packed dark or light brown sugar (I used dark)", 
            "1/2 cup (118 ml)  heavy cream", 
            "1/2 teaspoon (2 grams) flaky sea salt (or 1/4 teaspoon regular salt), plus more to taste", 
            "1 1/2 teaspoons (8 ml) vanilla extract, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/12/ridiculously-easy-butterscotch-sauce.jpg?w=753", 
        "tags": [
            "Candy", 
            "Ice Cream/Sorbet", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2009/12/ridiculously-easy-butterscotch-sauce/", 
        "title": "ridiculously easy butterscotch sauce", 
        "directions": [
            "Melt butter in a medium heavy-bottomed saucepan over medium heat. Add the sugar, cream and salt and whisk until well blended. [A flat whisk works great here.] Bring to a very gentle boil and cook for about five minutes, whisking occasionally.", 
            "Remove from heat and add one teaspoon of the vanilla extract, stirring to combine and this is where, despite the simplicity of the recipe, you get to feel all “chef-y”. Dip a spoon in the sauce and carefully taste the sauce (without burning your tongue!) to see if you want to add additional pinches or salt or splashes of vanilla. Tweak it to your taste, whisking well after each addition. I ended up using a full teaspoon of flaky salt and the listed amount of vanilla to get a butterscotch sauce with a very loud, impressive butterscotch flavor but the strength of your vanilla and intensity of your salt may vary.", 
            "Serve cold or warm over vanilla ice cream, roasted pears or pound cake. The sauce will thicken as it cools. It can be refrigerated in an airtight container and reheated in a microwave or small saucepan.", 
            "To do ahead: This sauce will keep at least two weeks in an airtight container in the fridge. ", 
            "To gift this up: I’d go the canning route in small jars. (You’ll want to scale the recipe a bit, as it makes less than a cup.) I am not practiced enough in canning to give advice but you should most definitely check out the awesome Food in Jars blog for tips. Whoops! A few readers have warned that butter-and-cream-type confections are not safe to can. A big thank you for keeping the Smitten Kitchen botulism-free! (You can still put these in small jars, but warn that they are, indeed, perishable and should be kept in the fridge.)"
        ], 
        "date": "2009-12-15T18:39:55+00:00"
    }, 
    {
        "ingredient_list": [
            "4 ounces (113 grams) unsalted butter, plus extra for the pan", 
            "1 10-ounce (285-gram) bag marshmallows", 
            "Heaping 1/4 teaspoon coarse sea salt", 
            "6 cups (160 grams) crispy rice cereal (about half a 12-ounce box)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/salted-brown-butter-crispy-treats.jpg?w=753", 
        "tags": [
            "Bars", 
            "Brown Butter", 
            "Candy", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2009/11/salted-brown-butter-crispy-treats/", 
        "title": "salted brown butter crispy treats", 
        "directions": [
            "Butter (or coat with non-stick spray) an 8-inch square cake pan with 2-inch sides.", 
            "In a large pot, melt butter over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as while you may be impatient for it to start browning, the period between the time the butter begins to take on color and the point where it burns is often less than a minute.", 
            "As soon as the butter takes on a nutty color, turn the heat off and stir in the marshmallows. The residual heat from the melted butter should be enough to melt them, but if it is not, turn it back on low until the marshmallows are smooth.", 
            "Remove the pot from the stove and stir in the salt and cereal together. Quickly spread into prepared pan. I liked to use a piece of waxed or parchment paper that I’ve sprayed with oil to press it firmly and evenly into the edges and corners, though a silicon spatula works almost as well.", 
            "Let cool, cut into squares and get ready to make new friends. "
        ], 
        "date": "2009-11-02T13:52:13+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups (335 grams) packed light brown sugar", 
            "2 large eggs, at room temperature", 
            "1/2 teaspoon vanilla extract", 
            "1 3/4 cups (450 grams) smooth peanut butter (see note at end)", 
            "Coarse-grained sea salt, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/salted-peanut-butter-cookies1.jpg?w=750", 
        "tags": [
            "Cookie", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Peanut Butter", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2015/10/salted-peanut-butter-cookies/", 
        "title": "salted peanut butter cookies", 
        "directions": [
            "Preheat the oven to 350°F. Line a rimmed baking sheet with parchment paper.", 
            "In a medium bowl, whisk together the light brown sugar and eggs until smooth. Whisk in the vanilla extract, then the peanut butter until smooth and completely incorporated; you shouldn’t be able to see any ribbons of peanut butter. Ovenly says you know the dough is ready when it has the consistency of Play-Doh, but I can tell you as the mom of a Play-Doh fanatic that mine was thinner, softer.", 
            "If you’d like to get those pretty striations across the top of the cookies, chill the dough by freezing it in its bowl for 15 minutes, stirring it once (so the edges don’t freeze first), before scooping it. If you’re not obsessed with these markings, you can scoop it right away. Scoop or spoon the dough into balls — Ovenly uses about a 1/4-cup scoop (probably #16); I use a 1 2/3 tablespoons or #40 scoop. Place on prepared pan. For the tallest final shape, place the tray in the freezer for 15 minutes before baking.", 
            "Sprinkle the dough balls lightly with coarse-grained sea salt just before baking. Bake smaller cookies for 14 to 15 minutes and larger for 18 to 20. When finished, cookies should be golden at edges. They’ll need to set on the sheet for a minute or two before they can be lifted intact to a cooling sheet. Trust me, you should let these cool completely before eating so the different textures (crisp outside, soft inside) can set up.", 
            "Do ahead: You can definitely make the dough in advance and either refrigerate it for a couple days or freeze it longer. However, if I were going to freeze it, I’d probably go ahead and scoop it first. You can bake them right from the freezer.", 
            "About chilling the dough: The Ovenly recipe says you can scoop and bake the cookies right away, but they keep their shape better if you chill them in the freezer for 15 minutes first. I tried it with and without and did find a better dome and final shape with the 15 minutes after. However, I was incredibly charmed by the striated marks from the cookie scoop on top of the cookie I bought last weekend, as well as in the photo in their book, and I realized that I couldn’t get it at home with just-mixed dough; you’ll get more of a blob shape from your scoop. So, I also chilled the dough for 15 minutes before scooping it and was then satisfied with the shape. It’s not necessary unless you’re as taken with top pattern as I am.", 
            "Two questions I suspect someone will ask very soon: Can you make this with all-natural peanut butter and can you make this with almond or a nut butter? The answer to both is yes, however, the authors themselves warn that you’ll get the best final shape and texture from a smooth, thick processed peanut butter like Skippy (their recommendation; updated to note, thanks to a commenter suggestion, that the 16.3-ounce jar of Skippy is estimated to contain 1 3/4 cups, saving you some measuring). I suspect an almond or cashew butter will have a similar effect as natural peanut butter. "
        ], 
        "date": "2015-10-15T11:56:41+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "2 tablespoons milk, half-and-half or cream", 
            "1/8 teaspoon salt", 
            "Few grinds black pepper", 
            "2 teaspoons butter or olive oil", 
            "A 1-inch thick piece of bread", 
            "1 tablespoon goat cheese, softened a bit (though cream cheese is a great swap here)", 
            "1 teaspoon chives or scallion greens, thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/05/scrambled-egg-toast.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Eggs", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2010/05/scrambled-egg-toast/", 
        "title": "scrambled egg toast", 
        "directions": [
            "Set your table and pour your coffee. I am an absolutely nut about eating my eggs the second they come out of the pan, and to do this, your table needs to be ready for you; your troops should be gathered. Toast your bread, then smear it with the goat cheese and sprinkle it with half the chives. Set it aside. (P.S. If you decide to butter it before adding the goat cheese, I will not tell anyone.)", 
            "Beat eggs with milk, salt and pepper in a small bowl, with a fork, until combined, with a few big bubbles. Heat a large sauté pan over medium-low heat; once hot, add butter. Once butter is melted and foamy, add eggs and pause; count to 20 if you must, but let those eggs begin to set up before you start nudging away at them. Using a wooden spoon or spatula, begin push your eggs once from the outside to the center of the pan and pause again; count to 5 if you must, before continuing with another push. Continue in this manner around the pan as if you were trying draw spokes of a wheel through your eggs with your spatula, pausing for 5 seconds after each push. Go around the pan as many times as needed, until your eggs in the center are ribbony damp pile — it should look only 75 percent cooked. Use your spoon or spatula to break up this pile into smaller chunks — to taste. Your eggs should now look almost 90 percent cooked.", 
            "Immediately remove the pan from the heat and pile the scrambled eggs bits high on your goat cheese toast. Sprinkle with an additional grind of black pepper and remaining chives. Eat immediately."
        ], 
        "date": "2010-05-24T11:18:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup olive oil", 
            "5 Anaheim chiles or 3 jalape&#241os, stemmed, seeded, and finely chopped (I was nervous and only used 2 Anaheims; I would go for 3 or 4 next time for a more moderate but still gentle kick)", 
            "1 small yellow onion, chopped", 
            "5 cloves garlic, crushed then sliced", 
            "1 teaspoon ground cumin", 
            "1 tablespoon paprika", 
            "1 28-ounce can whole peeled tomatoes, undrained", 
            "Kosher salt, to taste", 
            "6 eggs", 
            "1/2 cup feta cheese, crumbled", 
            "1 tablespoon chopped flat-leaf parsley", 
            "Warm pitas, for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/04/shakshuka.jpg?w=752", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Budget", 
            "Eggs", 
            "Israeli", 
            "North African", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/04/shakshuka/", 
        "title": "shakshuka", 
        "directions": [
            "Heat oil in a 12-inch skillet over medium-high heat. Add chiles and onions and cook, stirring occasionally, until soft and golden brown, about 6 minutes. Add garlic, cumin, and paprika, and cook, stirring frequently, until garlic is soft, about 2 more minutes.", 
            "Put tomatoes and their liquid into a medium bowl and crush with your hands. Add crushed tomatoes and their liquid to skillet along with 1/2 cup water, reduce heat to medium, and simmer, stirring occasionally, until thickened slightly, about 15 minutes. Season sauce with salt.", 
            "Crack eggs over sauce so that eggs are evenly distributed across sauce’s surface. Cover skillet and cook until yolks are just set, about 5 minutes. Using a spoon, baste the whites of the eggs with tomato mixture, being careful not to disturb the yolk. Sprinkle shakshuka with feta and parsley and serve with pitas, for dipping."
        ], 
        "date": "2010-04-08T22:24:26+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (125 grams) all-purpose flour", 
            "1 cup (145 grams) yellow cornmeal", 
            "2 tablespoon (25 grams) granulated sugar", 
            "2 teaspoons baking powder", 
            "1 teaspoon dried aleppo flakes", 
            "1/2 teaspoon table salt", 
            "1 large egg, lightly beaten", 
            "1 cup sour cream", 
            "1/3 cup buttermilk", 
            "2 tablespoons olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sour-cream-cornbread-with-aleppo1.jpg?w=500", 
        "tags": [
            "Muffin/Quick Bread", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2011/04/sour-cream-cornbread-with-aleppo/", 
        "title": "sour cream cornbread with aleppo", 
        "directions": [
            "Preheat the oven to 400 °F. Generously butter a 9×5-inch loaf pan, or coat it with a nonstick spray.", 
            "Whisk flour, cornmeal, sugar, baking powder, aleppo and salt together in a large bowl. In a smaller bowl, whisk together the egg, sour cream, buttermilk and olive oil. Stir the wet ingredients into the dry ones, mixing until just barely combined. Spread the batter in your prepared and bake for 22 to 25 minutes. A toothpick inserted into the center should come out clean.", 
            "Serve in slices, toasted with honey butter or salted and honeyed brown butter."
        ], 
        "date": "2011-04-28T09:16:13+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup olive oil", 
            "1 pound dried spaghetti", 
            "2 tablespoons butter", 
            "4 ounces Pecorino Romano cheese, finely grated", 
            "1 1/2 teaspoon finely ground black pepper", 
            "Salt (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaghetti-cacio-e-pepe1.jpg?w=500", 
        "tags": [
            "Date Night", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/02/spaghetti-cacio-e-pepe/", 
        "title": "spaghetti with cheese + black pepper", 
        "directions": [
            "Cook spaghetti in well-salted water to your al dente tastes in a large, wide-bottomed pot. (You’ll have fewer dishes to wash if you use this pot to assemble the dish as well.) Drain spaghetti, reserving 1 1/2 cups of pasta cooking water.", 
            "Dry out your pot, then heat the olive oil over high heat until almost smoking. Add drained spaghetti and 1 cup of reserved pasta water and jump back, this will splatter mightily, also known as “I made this three times, and never once learned my lesson. Do as I say, not as I do.”", 
            "Add butter, 3 ounces cheese and ground pepper and toss together with tongs. Taste, adding more pasta water, cheese, pepper or salt (which should not be neccessary, as Romano is very salty) to taste.", 
            "Serve immediately, sprinkling with reserved cheese and an extra grind or two of black pepper."
        ], 
        "date": "2010-02-12T11:09:01+00:00"
    }, 
    {
        "ingredient_list": [
            "", 
            "\t\t", 
            "\t", 
            "\t\tSeveral years ago, because we didn’t have a kid yet, didn’t know about things like school break schedules and figured midway through February was as good of a time to escape the snow as any, we decided to get away to someplace warm and winter-free during Presidents’ Day week. We found ourselves smack dab in the middle of a beach resort that had to have easily been 75% children, and the kind that were at that time my worst nightmare of what kids could be [insert yours here, then multiply it as far as you can see] and we decided to both never have kids and never ever go away on Presidents’ Week again.", 
            "", 
            "", 
            "", 
            "Flash forward seven or so years and last week we went to probably one of the most kid-centric, kid-mobbed resorts* one can go to on the most kid-centric and kid-mobbed week of the year and it was the best thing, ever. Previous to last week, I wouldn’t say we’ve exactly mastered the art of family vacations. Sure, we always have fun together but it often either feels like we’re either someplace exciting for adults but less so for little kid, or someplace awesome for a little kid but it feels more like this for the adults. This may not be for everyone, but at least for now, the resolution turned out to be a place where us grownups could lay on the beach, reading books, napping, and being total slackers for most of the day while the kid attended a day camp with everything from pony rides to water slides, trapeze school and circus training and also a pirate-themed treasure hunt for … underwear which if you’ve ever been around 4 and 5 year-olds, know was the greatest. We’d retrieve our kid, sticky with ice cream, chocolate pastries and sugar cereals from his mid-afternoon goûter and then play on the beach or in the pool for a couple hours before dinner, stories, bed and everybody won. Everyone had an awesome vacation. Thank goodness we’re not doing anything in the coming months that would upset the chances of repeating this bliss next year!", 
            "", 
            "", 
            "Alas, the fridge didn’t fill itself while we were away (technology, can you get on that?) and we pretty much had a family lazy-off yesterday, in which we tried to see how long we could go on pre-vacation remains before one of us caved and went to the store. It turned out — you know, along with some Sunday night soup dumplings — all day, if you can scrounge a few staples together. Before vacation, when I was deep in my 2nd Trimester Carb Immersion Plan, I fell in love on sight alone with a dish called Rhonda’s Spaghetti with Fried Eggs with Pangritata for One on Food52. I mean, how could I not, as it basically contained all of my trigger foods: pasta, bread and my ongoing obsession that I find as many excuses as I can to work into dishes, the crispy egg.  ", 
            "", 
            "Pangrattato translates from Italian as grated bread, referring to breadcrumbs themselves, but in dishes, it’s often known to as the poor man’s Parmesan because when you take that stale bread and lightly toast in in olive oil, herbs and seasonings — anything from just salt and pepper to garlic and anchovies, lemon zest and capers or olives — it adds remarkable texture and complex flavor to pasta without the expense of Parmesan. These crumbs it would be equally welcome to as a topping for canned fish, steamed mussels, warm vegetable salads, sautéed greens, or even on eggs without the pasta. We loved the crunch throughout our tangles of al dente lunchtime spaghetti, and the fried egg broken up on top, a nod to Rhonda’s version, adds a gorgeous richness that, well… I’ll be repeating in about one hour. ", 
            "", 
            "* as always on this site, this is not a sponsored or paid post, vacation, opinion, etc. all costs of vacation absorbed by author, with a grimace ", 
            "One year ago: Dijon and Cognac Beef Stew", 
            "Two years ago: French Onion Tart", 
            "Three years ago: Fried Egg Sandwich with Bacon and Blue Cheese", 
            "Four years ago: Spaghetti with Lemon and Olive Oil", 
            "Five years ago: Monkey Bread with Cream Cheese Glaze and Cauliflower and Caramelized Onion Tart", 
            "Six years ago: Red Kidney Bean Curry and Thick Chewy Oatmeal Raisin Cookies", 
            "Seven years ago: Pear and Almond Tart", 
            "Eight years ago: Vegetable Dumplings", 
            "And for the other side of the world:", 
            "Six Months Ago: Strawberries and Cream with Graham Crumbles", 
            "1.5 Years Ago: Almond-Crisped Peaches", 
            "2.5 Years Ago: Mediterranean Baked Feta with Tomatoes", 
            "3.5 Years Ago: Zucchini Fritters", 
            "\t", 
            "", 
            "\t", 
            " ", 
            "Spaghetti Pangrattato with Crispy Eggs", 
            "Adapted from and inspired by Rhonda’s Spaghetti with Fried Eggs with Pangritata for One on Food52", 
            "This is a big green salad and maybe a few slices of proscuitto (if you’re into such things) away from being a perfect mid-winter weeknight meal, budget-friendly, quick to make, vegetarian and, with luck, from ingredients you already have around. And if you don’t, nobody is going to know if you skip the parsley or try sage or thyme instead of rosemary. There is no one correct way to make pangrattato, only the way you like it. I couldn’t resist adding a little Pecorino here anyway, but you’d be fine without it if you’d like to keep the dish dairy-free. ", 
            "Serves 2, in generous heaps, or 3, petitely", 
            "Crumbs", 
            "2 tablespoon olive oil", 
            "1 large or 2 small garlic cloves, minced", 
            "1/2 cup fresh or stale coarse plain breadcrumbs (panko worked great here)", 
            "Salt and red pepper flakes, to taste", 
            "1 teaspoon fresh rosemary, minced", 
            "Few fine gratings fresh lemon zest ", 
            "Crispy Egg", 
            "1 glug of olive oil per egg", 
            "3 eggs", 
            "Salt and pepper", 
            "Pasta and Assembly", 
            "8 ounces dried spaghetti", 
            "1 tablespoon olive oil", 
            "2 teaspoons small capers, drained (rinsed if salted), chopped", 
            "Handful flat-leaf parsley, chopped", 
            "1/3 cup grated Pecorino Romano cheese (optional)", 
            "Make crispy crumbs (pangrattato): Heat olive oil in a medium skillet over medium heat. Once hot, add garlic and let sizzle for barely a minute, just until it begins to turn a pale golden color. Add breadcrumbs, salt, pepper, rosemary and lemon zest and reduce heat to low, cooking mixture slowly until all of the crumbs are an even golden color, about 5 minutes. Set aside. ", 
            "Cook pasta: Bring a large pot of well salted water to a generous boil and cook pasta until al dente about 1 to 2 minutes shy of package directions. Reserve 1/2 cup pasta cooking water before draining pasta. ", 
            "Meanwhile, make crispy eggs: Wipe out breadcrumbs skillet. Return to stove over high heat and add a generous glug of olive oil per egg. Once hot enough that the oil begins to smoke, add egg(s). They’re going to hiss and splatter so step back as soon as you do. Spoon some of the cooking oil over the eggs, carefully. Season with salt and pepper. In 1 to 2 minutes, the egg(s) will be brown and very crisp underneath and around the edges. Shimmy a thin spatula underneath the egg(s) (a flexible fish spatula works great here), being careful not to break the yolk. If you’re cooking for someone who shouldn’t be eating runny yolks (ahem), you can flip the egg over and cook it for another 30 seconds or so before removing it. Transfer cooked egg(s) to paper towels to drain. ", 
            "Assemble dish: Once pasta is drained, return it to the empty pot or a large skillet with 1 tablespoon olive oil and a splash or two (or all, if needed to loosen pasta) of reserved cooking water. Over high heat, toss with capers and parsley for 1 minute. Divide among bowls or plates. Sprinkle with Pecorino, if using, then 1/3 of breadcrumb (pangrattato) mixture. Place an egg over each dish, and break up with a fork. Eat immediately.", 
            "Rate this:Do More:TwitterFacebookPinterestPrintEmail\t\t\t", 
            "Crumbs", 
            "2 tablespoon olive oil", 
            "1 large or 2 small garlic cloves, minced", 
            "1/2 cup fresh or stale coarse plain breadcrumbs (panko worked great here)", 
            "Salt and red pepper flakes, to taste", 
            "1 teaspoon fresh rosemary, minced", 
            "Few fine gratings fresh lemon zest ", 
            "Crispy Egg", 
            "1 glug of olive oil per egg", 
            "3 eggs", 
            "Salt and pepper", 
            "Pasta and Assembly", 
            "8 ounces dried spaghetti", 
            "1 tablespoon olive oil", 
            "2 teaspoons small capers, drained (rinsed if salted), chopped", 
            "Handful flat-leaf parsley, chopped", 
            "1/3 cup grated Pecorino Romano cheese (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/spaghetti-pangrattato-with-fried-eggs1.jpg?w=750", 
        "tags": [
            "Budget", 
            "Eggs", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Put An Egg On It", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/02/spaghetti-pangrattato-with-fried-eggs/", 
        "title": "spaghetti pangrattato with crispy eggs", 
        "directions": [
            "Make crispy crumbs (pangrattato): Heat olive oil in a medium skillet over medium heat. Once hot, add garlic and let sizzle for barely a minute, just until it begins to turn a pale golden color. Add breadcrumbs, salt, pepper, rosemary and lemon zest and reduce heat to low, cooking mixture slowly until all of the crumbs are an even golden color, about 5 minutes. Set aside. ", 
            "Cook pasta: Bring a large pot of well salted water to a generous boil and cook pasta until al dente about 1 to 2 minutes shy of package directions. Reserve 1/2 cup pasta cooking water before draining pasta. ", 
            "Meanwhile, make crispy eggs: Wipe out breadcrumbs skillet. Return to stove over high heat and add a generous glug of olive oil per egg. Once hot enough that the oil begins to smoke, add egg(s). They’re going to hiss and splatter so step back as soon as you do. Spoon some of the cooking oil over the eggs, carefully. Season with salt and pepper. In 1 to 2 minutes, the egg(s) will be brown and very crisp underneath and around the edges. Shimmy a thin spatula underneath the egg(s) (a flexible fish spatula works great here), being careful not to break the yolk. If you’re cooking for someone who shouldn’t be eating runny yolks (ahem), you can flip the egg over and cook it for another 30 seconds or so before removing it. Transfer cooked egg(s) to paper towels to drain. ", 
            "Assemble dish: Once pasta is drained, return it to the empty pot or a large skillet with 1 tablespoon olive oil and a splash or two (or all, if needed to loosen pasta) of reserved cooking water. Over high heat, toss with capers and parsley for 1 minute. Divide among bowls or plates. Sprinkle with Pecorino, if using, then 1/3 of breadcrumb (pangrattato) mixture. Place an egg over each dish, and break up with a fork. Eat immediately."
        ], 
        "date": "2015-02-23T12:00:46+00:00"
    }, 
    {
        "ingredient_list": [
            "6 cups all-purpose flour, plus more for work surface", 
            "1 teaspoon baking soda", 
            "1/2 teaspoon baking powder", 
            "4 teaspoons ground ginger", 
            "4 teaspoons ground cinnamon", 
            "1 1/2 teaspoons ground cloves", 
            "1 teaspoon finely ground pepper", 
            "1 1/2 teaspoons coarse salt", 
            "1 cup (2 sticks or 1/2 pound) unsalted butter (at room temperature)", 
            "1 cup packed dark-brown sugar", 
            "2 large eggs", 
            "1 cup unsulfured molasses", 
            "To decorate:", 
            "Royal icing", 
            "Various fine sanding sugars and sugar decorations"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/12/spicy-gingerbread-cookies.jpg?w=753", 
        "tags": [
            "Christmas", 
            "Cookie", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2010/12/spicy-gingerbread-cookies/", 
        "title": "spicy gingerbread cookies", 
        "directions": [
            "Whisk together flour, baking soda, baking powder, spices and salt in a large bowl and set aside. Beat butter and brown sugar together in a large bowl with an electric mixer until fluffy. Mix in eggs and molasses. Add flour mixture, mixing on low until just combined. Divide dough into thirds and wrap each in plastic. Refrigerate until cold and firm, about one hour or up to two days.", 
            "Preheat oven to 350 degrees. Roll out dough on a lightly floured work surface to a 1/4-inch thick. Cut into shapes of your choice, such as snowflakes* or gingerbread men. Spread two inches apart on baking sheets lined with parchment paper, and refrigerate until the cookies firm up again, about 15 minutes.", 
            "Bake cookies until crisp but not dark, 12 to 14 minutes. Let cool on sheets on wire racks.", 
            "When cool, you can decorate the cookies with icing and sprinkles. When you pipe designs, sprinkle the icing with sanding sugar and let it sit for five minutes before tapping off the excess sugar. Then let the icing set completely at room temperature, which will take an hour or so, depending on how thick it is.", 
            "Store cookies between layers of parchment or waxed paper in an airtight container for up to a week.", 
            "* By the way, I don’t recommend my snowflake cookie cutter set as you will grow gray hairs trying to get the cookie cutter back from the dough without pulling off some icicles. Look for a set with less intricate details."
        ], 
        "date": "2010-12-23T18:47:18+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds chicken wingettes or chicken wings (see note up top)", 
            "1 large garlic clove, minced", 
            "1 teaspoon coarse or kosher salt, plus more to taste", 
            "2 tablespoons soy sauce", 
            "2 tablespoons hoisin sauce", 
            "2 tablespoons mild honey (I often halved this)", 
            "1 teaspoon Asian sesame oil", 
            "Pinch of cayenne or dash of Sriracha", 
            "1 1/2 tablespoons sesame seeds, lightly toasted", 
            "1 scallion, finely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/sticky-sesame-chicken-wings1.jpg?w=640", 
        "tags": [
            "Chicken", 
            "Chinese", 
            "Photo", 
            "Quick", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/07/sticky-sesame-chicken-wings/", 
        "title": "sticky sesame chicken wings", 
        "directions": [
            "Heat oven to 425°F. Line a large shallow baking pan with foil and lightly oil it. ", 
            "Stir wings together with garlic, salt, soy, hoisin, honey, sesame oil and cayenne or Sriracha until coated. Spread wings and any sauce that fell to the bottom of the bowl out on the prepared baking pan in one layer. Roast, turning over once, until cooked through, about 35 minutes. Transfer wingettes to a large serving bowl* and toss with sesame seeds and scallion.", 
            "* If you end up with a puddle of sauce in the bottom of your baking pan (I did the one time they were more tightly packed in a dish), after removing the wings, you can pour the extra sauce into a saucepan and reduced it until thick, then stir it over the roasted wings before adding the sesame seeds and scallion."
        ], 
        "date": "2014-07-07T11:39:36+00:00"
    }, 
    {
        "ingredient_list": [
            "Crumbles", 
            "4 tablespoons (2 ounces or 55 grams) unsalted butter, melted", 
            "2 tablespoon (25 grams) dark brown sugar", 
            "1 tablespoon (20 grams) honey", 
            "1/2 teaspoon baking powder", 
            "1/8 teaspoon ground cinnamon", 
            "Pinch of ground cloves", 
            "1/4 teaspoon table salt or twice as much coarse kosher or coarse sea salt", 
            "1/4 cup (30 grams) whole wheat or graham flour", 
            "1/2 cup plus 2 to 3 tablespoons (80 to 85 grams) all-purpose flour", 
            "Cream", 
            "1/2 cup (120 ml) heavy or whipping cream", 
            "1 tablespoon dark brown sugar", 
            "2 tablespoons (30 grams) crème fraîche or sour cream", 
            "1/4 teaspoon vanilla extract (optional)", 
            "Strawberries", 
            "1 pound, 2 pints or about 4 cups, stems removed, halved or quartered if large"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/strawberries-and-cream-with-graham-crumbles1.jpg?w=640", 
        "tags": [
            "Crumbles/Crisps", 
            "Photo", 
            "Quick", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2014/08/strawberries-and-cream-with-graham-crumbles/", 
        "title": "strawberries and cream with graham crumbles", 
        "directions": [
            "Heat oven to 350°F. Line a baking sheet with parchment paper for easy clean-up (although the crumbs should not stick if baked without it). Place melted butter in a large bowl. Stir in brown sugar and honey. Add baking powder, cinnamon, cloves and salt and stir to combine. Add whole wheat or graham flour, stir again, then add 1/2 cup plus 2 tablespoons all-purpose flour. Stir until all flour is incorporated and mixture forms large and small crumbles. If needed, add the last tablespoon all-purpose flour to achieve this.", 
            "Spread crumbs on baking sheet. Bake for 5 minutes, then stir them around so that they evenly bake. Return crumbs to oven and bake for another 2 to 3 minutes, until golden brown. Let cool in pan on rack. Crumbs will keep at room temperature in an airtight container for at least a week.", 
            "Using a clean bowl and whisk (electric or a regular large one), whip cream and brown sugar until it holds soft peaks. Whisk in crème fraîche or sour cream, and vanilla. Keep chilled until needed. This whipped cream will last days in the fridge without needing to be re-whipped.", 
            "Fill a small dish a little over halfway with strawberries, generously dollop on whipped cream and top with a couple tablespoons of graham crumbs. Repeat as needed and dig in."
        ], 
        "date": "2014-08-22T11:31:29+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (80 grams) rolled oats", 
            "3/4 cup (95 grams) plus up to 2 tablespoons (15 grams) extra all-purpose flour", 
            "1/2 cup (95 grams) light brown sugar", 
            "Heaped 1/4 teaspoon table salt", 
            "6 tablespoons (85 grams) unsalted butter, melted", 
            "1 teaspoon cornstarch (optional, but helps firm up the filling)", 
            "1 tablespoon (15 ml) lemon juice", 
            "1 tablespoon (15 grams) granulated sugar, divided", 
            "1 cup (125 grams) small-diced rhubarb (from about 1 1/2 medium stalks)", 
            "1 cup (155 grams) small-diced strawberries", 
            "Powdered sugar, for decoration, if desired"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/strawberry-rhubarb-crisp-bars1.jpg?w=640", 
        "tags": [
            "Bars", 
            "Cookie", 
            "Crumbles/Crisps", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Rhubarb", 
            "Strawberries", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2014/05/strawberry-rhubarb-crisp-bars/", 
        "title": "strawberry rhubarb crisp bars", 
        "directions": [
            "Heat oven to 375 degrees F. For easy removal, line bottom and two sides of 8-by-8-inch square baking pan with parchment paper. No need to bother (and no greasing needed) if you plan to serve them right in the pan, as I did. ", 
            "Place oats, 3/4 cup flour, brown sugar and salt in bottom of baking pan and mix. Pour melted butter over, and stir until clumps form. If the clumps feel soft or look overly damp, add the remaining 2 tablespoons flour. Set aside 1/2 cup of the crumble mixture. Press the rest of the crumb mixture evenly in the bottom of the pan.", 
            "Spread half the fruit over the crust. Sprinkle it evenly with cornstarch, then lemon juice, and 1/2 tablespoon of granulated sugar. Spread remaining fruit over this, and top with second 1/2 tablespoon sugar. Scatter reserved crumbs over fruit and bake bars for 30 to 40 minutes (firmer fruits will take longer), until fruit is bubbly and crisp portion is golden and smells toasty and amazing. ", 
            "Let cool in pan; I do this in the fridge, where they become crisp once chilled (less so at room temperature). Cut into squares and sprinkle with powdered sugar before serving. Store leftovers in fridge."
        ], 
        "date": "2014-05-09T11:20:41+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 pound dried rice noodles (see notes up top)", 
            "2 tablespoons toasted sesame oil, plus a splash to loosen noodles", 
            "2 tablespoons Chinese sesame paste or tahini (see note up top)", 
            "1 tablespoon smooth peanut butter", 
            "3 1/2 tablespoons soy sauce", 
            "2 tablespoons Chinese rice vinegar", 
            "1 tablespoon granulated or brown sugar", 
            "1 tablespoon finely grated ginger", 
            "2 teaspoons minced garlic (from 1 medium-large clove)", 
            "Chili-garlic paste, to taste", 
            "1/2 pound cucumber, very thinly sliced", 
            "1/2 cup roasted salted peanuts, roughly chopped", 
            "A handful of chopped fresh herbs, such as mint and cilantro, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/08/takeout-style-sesame-noodles-with-cucumber1.jpg?w=640", 
        "tags": [
            "Chinese", 
            "Cucumber", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Quick", 
            "Summer", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/08/takeout-style-sesame-noodles-with-cucumber/", 
        "title": "takeout-style sesame noodles with cucumber", 
        "directions": [
            "Cook noodles according to package directions and rinse with cold water to cool. Drain well. Drizzle with a tiny splash of toasted sesame oil to keep them from sticking until dressed.", 
            "Meanwhile, whisk sesame paste and peanut butter in the bottom of a small bowl, then whisk in soy sauce, rice vinegar, remaining 2 tablespoons sesame oil, sugar, ginger, garlic and chile-garlic paste to taste until smooth. Adjust flavors to taste. It might seem a bit salty from the bowl, but should be just right when tossed with noodles.", 
            "Toss sauce with cold noodles. ", 
            "Place a medium-sized knot of dressed noodles in each bowl, followed by a pile of cucumber. Garnish generously with peanuts and herbs. Serve with extra chile-garlic paste on the side. "
        ], 
        "date": "2015-08-04T11:09:20+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons (30 grams) unsalted butter, plus more for pan", 
            "2 tablespoons (25 grams) granulated sugar", 
            "1 large egg", 
            "1/4 teaspoon vanilla extract", 
            "1/2 cup plus 2 to 4 tablespoons buttermilk", 
            "1/4 teaspoon fine sea or table salt", 
            "1/2 teaspoon baking soda", 
            "1 cup (130 grams) all-purpose flour"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/05/tall-fluffy-buttermilk-pancakes.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Pancakes", 
            "Photo", 
            "Quick"
        ], 
        "url": "https://smittenkitchen.com/2017/05/tall-fluffy-buttermilk-pancakes/", 
        "title": "tall, fluffy buttermilk pancakes", 
        "directions": [
            "Heat oven to 225 degrees F and place a large baking sheet inside.\nMelt butter halfway in the bottom of a large bowl then whisk in sugar. This should leave the mixture lukewarm, not piping hot, but if it still is, let it cool slightly before adding the egg. Whisk in egg and vanilla, then 1/2 cup plus 2 tablespoons of the buttermilk. Whisk in salt and baking soda until fully combined, scrape down bowl, then stir in flour until it just disappears. You’re looking for a thick mixture, more like a very soft cookie dough than a pourable batter, but if it’s very stiff, add 1 to 2 more tablespoons of the remaining buttermilk and stir until combined.\nHeat griddle or frying pan over medium. Once hot, add a good pat of butter (please don’t skimp; butter makes crispy edges) and dollop in small mounds of pancake batter — I find a #40 or 1.5 tablespoon scoop to make this even easier and neater. Try to resist the urge to press the mounds into flat puddles; a little nudge is okay but we’d much rather keep the height here. Once bubbles form on top, lift a corner of each pancake and check for it to be lightly browned before flipping it.", 
            "At this point, I like to reduce the heat to medium-low for the remainder of the cooking time. I’d rather the pancakes take a minute longer than singe dark as soon as they hit the pan, but your stove will vary.\nOnce pancakes are golden brown on the second side, and do not worry if the tall sides look raw, this is completely expected, just transfer them to heated oven. Repeat with remaining batter. Tall, thick pancakes like this almost always hide pockets of uncooked batter; 5 minutes in the oven will fix this. You can leave them in the oven for much longer, however, if you now wish to rinse berries and make coffee (which of course you do)."
        ], 
        "date": "2017-05-11T12:06:42+00:00"
    }, 
    {
        "ingredient_list": [
            "Dry rub", 
            "2 teaspoons packed dark brown sugar", 
            "1 teaspoon paprika, ideally smoked but regular will also work", 
            "1 tablespoon chili powder", 
            "1 teaspoon onion powder", 
            "Chipotle powder or ground red pepper (cayenne) to taste", 
            "1 teaspoon coarse or kosher salt, and more to taste", 
            "Cider vinegar dip", 
            "1 tablespoon cider vinegar", 
            "1/4 teaspoon smooth dijon mustard", 
            "Pinch of salt, smoked flaky sea salt is wonderful here if you have it", 
            "Pinch of pepper flakes", 
            "Shake of smoked hot paprika or chipotle powder"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/the-broccoli-roast1.jpg?w=750", 
        "tags": [
            "Broccoli", 
            "Budget", 
            "Fall", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/10/the-broccoli-roast/", 
        "title": "the broccoli roast", 
        "directions": [
            "Heat oven to 450 degrees F. Coat a large roasting pan with a glug or two of olive oil. Combine rub ingredients in a small dish. Taste a pinch; it should be flavorful, but more salty than sweet, with a kick. Make adjustments to taste.", 
            "Prep broccoli by peeling any knobby bits and outer skin off stalks. Cut smaller heads lengthwise through stem into two “steaks;” cut larger ones a second time into four wedge-shaped “steaks,” if desired. Place cut side down in roasting pan; drizzle tops very lightly with olive oil and sprinkle with rub. Roast for 20 minutes, until deeply brown underneath. While roasting, combine cider vinegar dip ingredients. Flip, coat cut side with more rub and roast for another 10 to 15 minutes, until charred at edges. Remove from oven and immediately grate a small amount of cheese over broccoli.", 
            "Serve with cider vinegar dip and, if you’d like to be more like the restaurant, with a little pile of smoked sea salt on the side. Eat with forks and steak knives. ", 
            "P.S. Looking for a different flavor? Try these stunning broccoli steaks, also inspired by my Burnside obsession, with a red chile-sambal romesco."
        ], 
        "date": "2015-10-13T12:02:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1 glug olive oil or cooking fat of your choice", 
            "1 egg, any size", 
            "Salt, pepper, herbs, spices or hot sauce, or all of the above"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/the-crispy-egg1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Budget", 
            "Eggs", 
            "Photo", 
            "Put An Egg On It", 
            "Quick", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/10/the-crispy-egg/", 
        "title": "the crispy egg", 
        "directions": [
            "Over a high flame, heat a skillet for a full minute. Add a glug of oil and let it heat until it just begins to smoke, another 30 seconds. Add your egg, reduce the heat to medium-high, and step back; it’s going to hiss and sputter and basically be the most wildly dramatic thing to happen at breakfast in a long time. Within a minute, it should get brown at the edges but don’t touch or move it. Let it cook until the white looks fully opaque, another 30 seconds to 1 minute. Remove from the heat. Shimmy a thin metal spatula under the egg, gently loosening any stuck parts. Transfer to whatever you’re serving it on (toast, latke waffles, fried rice, home fries, a plate), shower it with seasonings, herbs and spices of your choice and waste no time digging in. Repeat as needed.", 
            "Great tip from the comments: Many have mentioned that you can spoon some of the oil in the skillet over the cooking egg to help it cook more quickly on top, plus, it makes it even more bubbly. I’d definitely recommend this, especially as an extra layer of security that the white will be fully cooked. [Updated to note that I did this a couple mornings later, and whee! The whites were even more bubbly on top.]", 
            "Egg white variation: Let’s say you have a human, small or large, in your household that doesn’t like egg yolks. It turns out, crispy egg whites are pretty cool too, cooked with the same method described above. I think I’d especially love one on a sandwich.", 
            "Crispy sandwich egg: Flip your egg over for an additional 30 seconds or so, until the yolk is almost but not fully set. Be the envy of every other breakfast sandwich.", 
            "Multiple crispy eggs: I’ve done up to two at once and it works just fine. You’ll get a higher amount of crispy edge, however, if you fry them one at a time."
        ], 
        "date": "2014-10-02T12:18:58+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound plum or roma tomatoes, stemmed and cut in half", 
            "1 or 2 jalapeños (depending on how hot you want the salsa), stemmed and cut in half", 
            "2 cloves garlic, peeled", 
            "Salt and pepper, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/three-ingredient-summertime-salsa1.jpg?w=640", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Quick", 
            "Summer", 
            "Tex-Mex", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/07/three-ingredient-summertime-salsa/", 
        "title": "three-ingredient summertime salsa", 
        "directions": [
            "Turn on your broiler and place a rack five inches away from the heating element. Line a skillet or baking sheet with foil and place the tomatoes, jalapeño halves and garlic on the skillet; season with salt. Cook under the broiler for five minutes (this, and all broiling steps, took much longer in my weak oven), or until the jalapeño and garlic have brown spots. Remove the jalapeño and garlic from the skillet and place in a blender.", 
            "Meanwhile, return the skillet to the oven and continue to broil the tomatoes for five more minutes, or until they have browned on top. Remove the tomatoes from the oven and add them to the blender, also pouring into the blender any juices that may be in the skillet. Begin to pulse on a low speed until the salsa reaches your desired texture; I usually add about 2 tablespoons water to loosen mine — you may need up to 1/4 cup, or more, for a thinner salsa. Adjust salt and pepper to taste. Eat with everything."
        ], 
        "date": "2014-07-29T11:21:58+00:00"
    }, 
    {
        "ingredient_list": [
            "4 1/2-inch thick slices your favorite sturdy bread*", 
            "4 tablespoons mayonnaise", 
            "Two to four 1/4-inch slices provolone cheese (use larger amount for smaller slices)", 
            "Olive oil2 medium-sized perfectly ripe tomatoes, sliced", 
            "Flaky salt and freshly cracked black pepper, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/07/tomato-and-fried-provolone-sandwich1.jpg?w=640", 
        "tags": [
            "Photo", 
            "Quick", 
            "Sandwich", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/07/tomato-and-fried-provolone-sandwich/", 
        "title": "tomato and fried provolone sandwich", 
        "directions": [
            "Spread each slice of bread with mayonnaise and set aside.", 
            "Heat a skillet, preferably nonstick, over medium-low heat. Add a thin layer of olive oil and let it heat until shimmering. Add first slice of provone to skillet and fry it until crusty and golden underneath. Using a very thin spatula (this “flexible fish spatula” style is my favorite, for everything) carefully flip slice. It’s probably not going to flip neatly and you’ll probably curse me and also Hess but a messy slice will taste no less delicious than a photogenic one, promise. Just do your best. Fry the slice on the other side until golden underneath, then lift this browned cheese mess out of the pan and onto your first prepared bread slice. Repeat with remaining slices of cheese, frying more than one at a time if you’re now more comfortable with the process. ", 
            "Arrange slices of tomatoes over fried provolone on bread, sprinkle with salt and pepper and eat with one hand while calming an irate newborn with the other (if you’re me) or with two hands, from a plate, sitting down with a napkin on your lap, you civilized thing (if you’re not me, clearly). ", 
            "* Forgive me if I sound like a broken record, but my favorite is the whole wheat sourdough (a.k.a. miche or pain de campagne; think: Poilâne, but not requiring a ticket to Paris) you see here and elsewhere on the site. If you live near a Le Pain Quotidien, they sell theirs in quarters from gigantic loaves. Balthazar also makes their own, which is wonderful, and also sells it in quarters, inexpensively. "
        ], 
        "date": "2015-07-29T11:11:33+00:00"
    }, 
    {
        "ingredient_list": [
            "18 ounces (3 2/3 cups) assorted unsalted nuts or 2 1/3 cups mixed nuts and 1 1/3 cups pretzel nuggets", 
            "1 tablespoon butter, melted", 
            "2 tablespoons fresh rosemary, coarsely chopped", 
            "1/4 to 1/2 teaspoon cayenne (see note up top)", 
            "2 teaspoons dark brown sugar", 
            "1 teaspoon kosher salt (see note up top)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/12/union-square-cafes-bar-nuts.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Quick", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2016/12/union-square-cafes-bar-nuts/", 
        "title": "union square cafe’s bar nuts", 
        "directions": [
            "Heat oven to 350 degrees. Spread nuts (if using pretzels, don’t add them yet) on a tray and toast for 10 to 15 minutes, until lightly golden and fragrant. While they’re toasting, whisk butter, rosemary, cayenne, sugar and salt in the bottom of a large bowl. When nuts are toasted, add them to bowl and stir to evenly coat. Add pretzels, if using, and coat again. Spread back on tray and toast for another 5 to 10 minutes. Let cool slightly, then serve warm in bowls. Nuts are also good at room temperature, and keep for weeks in airtight jars."
        ], 
        "date": "2016-12-09T13:15:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup shelled walnuts, even better if you toast and cool them first", 
            "1/4 cup grated Parmesan cheese", 
            "1 small garlic clove, peeled and crushed", 
            "3 sprigs of thyme, cleaned", 
            "Salt", 
            "Small splash of sherry vinegar (I used a generous splash and felt it dominated too much; go easy)", 
            "1/3 cup extra virgin olive oil", 
            "2 tablespoons minced sun-dried tomatoes (oil or dry-packed will both work)", 
            "1 loaf country bread, or a baguette, sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/12/walnut-pesto.jpg?w=752", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Quick", 
            "Savory Sauces and Condiments"
        ], 
        "url": "https://smittenkitchen.com/2009/12/walnut-pesto/", 
        "title": "walnut pesto", 
        "directions": [
            "In food processor, coarsely grind walnuts, cheese, garlic, thyme, salt and vinegar. Stir in oil and tomatoes.", 
            "Grill or toast bread. While hot, top each slice with a heaping teaspoon of pesto. "
        ], 
        "date": "2009-12-29T11:24:05+00:00"
    }
]