{
  "date": "2015-11-12T12:04:09+00:00",
  "directions": [
    "Make the pie dough: ",
    "Form the crust: On a floured counter, roll the dough out into a 12 to 13-inch circle-ish shape. Fold dough gently in quarters without creasing and transfer to a 9-inch standard (not deep-dish) pie plate. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. If not parbaking, place in fridge until ready to fill. If parbaking, place in freezer for 20 minutes, until solid.",
    "Par-bake the crust: [Optional, but will lead to a crispier base.] Heat oven 400°F (205°C). Line frozen crust with lightly buttered or oiled foil. Fill with pie weights, dried beans or pennies. Bake on a rimmed baking sheet for 20 minutes. Carefully remove foil and weights and let cool a little before filling. ",
    "Heat oven: (Or reduce oven heat, if you just par-baked your crust) to 350°F (175°C).",
    "Prepare filling: Spread pecans on a rimmed baking sheet and toast in the oven for 10 to 12 minutes, stirring once or twice so that they toast evenly. Set aside until needed. If you like smaller bits, you can chop them, or as shown here, chop half of them (although I usually leave them whole).",
    "In medium saucepan, combine butter, brown sugar, golden syrup and pinch of salt. Bring to a simmer over medium heat and cook for 2 minutes, stirring. Remove from heat and stir in pecans, cider vinegar, vanilla and bourbon (if using). Pour into a bowl (so that it cools faster) and set the mixture aside to cool a little, about 5 to 10 minutes. Then, whisk in one egg at a time until combined. Pour mixture into prepared pie shell. ",
    "Bake: For 40 to 45 minutes. The pie is done with the edges are set and puffed slightly and the center is slightly firm to the touch but still has some jiggle to it. Cool on a rack. Serve slightly warm or room temperature."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/pecan-pie1.jpg?w=750",
  "ingredient_list": [
    "Crust:",
    "1 1/4 cups (155 grams) all-purpose flour",
    "1 1/2 teaspoons (6 grams) granulated sugar",
    "1/2 teaspoon (3 grams) fine sea or table salt",
    "1 stick (4 ounces or 115 grams) cold unsalted butter, cut into chunks",
    "1/4 cup (60 ml) very cold water, plus an additional tablespoon if needed",
    "Filling",
    "6 tablespoons unsalted butter",
    "1 cup packed dark brown sugar",
    "3/4 cup golden syrup (see Note up top)",
    "A pinch or two of sea salt",
    "2 cups (225 grams) pecan halves",
    "1 teaspoon apple cider vinegar",
    "1 tablespoon bourbon (optional)",
    "2 teaspoons vanilla extract",
    "3 large eggs"
  ],
  "tags": [
    "Christmas",
    "Photo",
    "Tarts/Pies",
    "Thanksgiving"
  ],
  "title": "pecan pie",
  "url": "https://smittenkitchen.com/2015/11/pecan-pie/"
}