{
  "date": "2009-12-15T18:39:55+00:00",
  "directions": [
    "Melt butter in a medium heavy-bottomed saucepan over medium heat. Add the sugar, cream and salt and whisk until well blended. [A flat whisk works great here.] Bring to a very gentle boil and cook for about five minutes, whisking occasionally.",
    "Remove from heat and add one teaspoon of the vanilla extract, stirring to combine and this is where, despite the simplicity of the recipe, you get to feel all “chef-y”. Dip a spoon in the sauce and carefully taste the sauce (without burning your tongue!) to see if you want to add additional pinches or salt or splashes of vanilla. Tweak it to your taste, whisking well after each addition. I ended up using a full teaspoon of flaky salt and the listed amount of vanilla to get a butterscotch sauce with a very loud, impressive butterscotch flavor but the strength of your vanilla and intensity of your salt may vary.",
    "Serve cold or warm over vanilla ice cream, roasted pears or pound cake. The sauce will thicken as it cools. It can be refrigerated in an airtight container and reheated in a microwave or small saucepan.",
    "To do ahead: This sauce will keep at least two weeks in an airtight container in the fridge. ",
    "To gift this up: I’d go the canning route in small jars. (You’ll want to scale the recipe a bit, as it makes less than a cup.) I am not practiced enough in canning to give advice but you should most definitely check out the awesome Food in Jars blog for tips. Whoops! A few readers have warned that butter-and-cream-type confections are not safe to can. A big thank you for keeping the Smitten Kitchen botulism-free! (You can still put these in small jars, but warn that they are, indeed, perishable and should be kept in the fridge.)"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/12/ridiculously-easy-butterscotch-sauce.jpg?w=753",
  "ingredient_list": [
    "1/4 cup (4 tablespoons, 2 ounces or 1/2 stick) unsalted butter",
    "1/2 cup (about 109 grams) packed dark or light brown sugar (I used dark)",
    "1/2 cup (118 ml)  heavy cream",
    "1/2 teaspoon (2 grams) flaky sea salt (or 1/4 teaspoon regular salt), plus more to taste",
    "1 1/2 teaspoons (8 ml) vanilla extract, plus more to taste"
  ],
  "tags": [
    "Candy",
    "Ice Cream/Sorbet",
    "Photo",
    "Quick"
  ],
  "title": "ridiculously easy butterscotch sauce",
  "url": "https://smittenkitchen.com/2009/12/ridiculously-easy-butterscotch-sauce/"
}