{
  "date": "2010-12-23T18:47:18+00:00",
  "directions": [
    "Whisk together flour, baking soda, baking powder, spices and salt in a large bowl and set aside. Beat butter and brown sugar together in a large bowl with an electric mixer until fluffy. Mix in eggs and molasses. Add flour mixture, mixing on low until just combined. Divide dough into thirds and wrap each in plastic. Refrigerate until cold and firm, about one hour or up to two days.",
    "Preheat oven to 350 degrees. Roll out dough on a lightly floured work surface to a 1/4-inch thick. Cut into shapes of your choice, such as snowflakes* or gingerbread men. Spread two inches apart on baking sheets lined with parchment paper, and refrigerate until the cookies firm up again, about 15 minutes.",
    "Bake cookies until crisp but not dark, 12 to 14 minutes. Let cool on sheets on wire racks.",
    "When cool, you can decorate the cookies with icing and sprinkles. When you pipe designs, sprinkle the icing with sanding sugar and let it sit for five minutes before tapping off the excess sugar. Then let the icing set completely at room temperature, which will take an hour or so, depending on how thick it is.",
    "Store cookies between layers of parchment or waxed paper in an airtight container for up to a week.",
    "* By the way, I don’t recommend my snowflake cookie cutter set as you will grow gray hairs trying to get the cookie cutter back from the dough without pulling off some icicles. Look for a set with less intricate details."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/12/spicy-gingerbread-cookies.jpg?w=753",
  "ingredient_list": [
    "6 cups all-purpose flour, plus more for work surface",
    "1 teaspoon baking soda",
    "1/2 teaspoon baking powder",
    "4 teaspoons ground ginger",
    "4 teaspoons ground cinnamon",
    "1 1/2 teaspoons ground cloves",
    "1 teaspoon finely ground pepper",
    "1 1/2 teaspoons coarse salt",
    "1 cup (2 sticks or 1/2 pound) unsalted butter (at room temperature)",
    "1 cup packed dark-brown sugar",
    "2 large eggs",
    "1 cup unsulfured molasses",
    "To decorate:",
    "Royal icing",
    "Various fine sanding sugars and sugar decorations"
  ],
  "tags": [
    "Christmas",
    "Cookie",
    "Photo"
  ],
  "title": "spicy gingerbread cookies",
  "url": "https://smittenkitchen.com/2010/12/spicy-gingerbread-cookies/"
}