{
  "date": "2014-12-31T10:18:17+00:00",
  "directions": [
    "Heat oven to 250°F (120°C).",
    "Pop your popcorn: Place 3 tablespoons olive oil and 2 to 3 kernels in a 3-quart or larger pot and cover with a lid. Turn heat to medium-high. When you hear these first kernels pop, add the remaining kernels and replace the lid. Using potholders, shimmy the pot around to keep the kernels moving as they pop. When several seconds pass between pops, remove from heat. You should have just over 6 cups. Dump into a giant mixing bowl and add the nuts, pretzels, chips or crackers to the popcorn. ",
    "Brown your butter and make the sauce: Wipe out your empty pot and place the butter in it, set over medium heat (no lid needed). Melt the butter and keep cooking it, stirring occasionally and watching out for hisses and splatters, until the bits at the bottom of the melted butter puddle begin to turn golden and light brown. Remove from heat, and whisk in Worcestershire, sugar, spices and salt. If you ended up using pre-popped or seasoned popcorn with salt, or salted nuts or crackers, you might go easier on the salt. If you like your mix quite traditionally salty and none of your packaged ingredients were coated with salt, you might up it to a full teaspoon. ",
    "Pour butter-spice mixture over popcorn mix and toss, toss, toss, until all the ingredients are evenly coated. Spread out on your biggest baking sheet or two medium-sized ones. Bake for 45 minutes, tossing the ingredients around every 15 so that they cook evenly. Let cool completely on trays, then pack into jars and get on your way."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/popcorn-party-mix1.jpg?w=750",
  "ingredient_list": [
    "3 tablespoon olive or a neutral oil",
    "6 tablespoons (70 grams) unpopped popcorn kernels",
    "1 cup nuts (I used peanuts, which weigh 140 grams)",
    "2 cups bite-sized pretzels, or bigger ones, broken up",
    "1 cup broken-up plain bagel or pita chips, oyster crackers or melba toast",
    "6 tablespoons (85 grams) unsalted butter",
    "2 tablespoons Worcestershire sauce",
    "2 teaspoons (8 grams) dark brown sugar",
    "1/2 tablespoon smooth Dijon mustard",
    "1/2 teaspoon mustard powder",
    "3/4 teaspoon fine sea salt, adjusted to taste",
    "1 teaspoon ground smoked paprika",
    "1/4 teaspoon cayenne, or more to taste",
    "1 teaspoon garlic powder",
    "1 teaspoon onion powder"
  ],
  "tags": [
    "Photo",
    "Snack"
  ],
  "title": "popcorn party mix",
  "url": "https://smittenkitchen.com/2014/12/popcorn-party-mix/"
}