{
  "date": "2009-05-11T14:22:16+00:00",
  "directions": [
    "Trim broccoli and cut it into large chunks. From here, you can either feed it through your food processor’s slicing blade, use a mandoline to cut it into thin slices, or simply had chop it into smaller pieces. I used the stem and the flowerets, but if you have a broccoli stem aversion you can just use the tops. (P.S. My favorite way to prep the stems is to peel them — the tough skin is why most people think they don’t like broccoli stems; the broccoli underneath is juicy and crisp — then use the mandoline or a knife to cut them into thin slices.)",
    "Toss the sliced broccoli with the almonds, cranberries and red onion in a large bowl. Meanwhile, whisk the dressing ingredients in a smaller one, with a good pinch of salt and black pepper. Pour the dressing over the broccoli (if you’ve skipped the stems, you might not want it all; I otherwise found this to be the perfect amount) and toss it well. Season well with salt and pepper to taste.",
    "Should keep up to a week in the fridge, if you don’t have any pregnant women nearby.",
    "Variation: I bet this slaw would be equally good with cauliflower. I might use dried currants instead of cranberries, walnuts instead of almonds and maybe even some celery slices thrown in. Have fun with it."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/broccoli-slaw.jpg?w=753",
  "ingredient_list": [
    "2 heads of broccoli",
    "1/2 cup thinly sliced almonds, toasted",
    "1/3 cup dried cranberries",
    "1/2 small red onion, finely chopped",
    "Buttermilk Dressing (Adapted from this salad.)",
    "1/2 cup buttermilk, well-shaken",
    "1/3 cup mayonnaise (this is more than is in the original, to thicken the dressing further)",
    "2 tablespoons cider vinegar",
    "1 tablespoon sugar",
    "3 tablespoons finely chopped shallot (or, you could just use a little extra red onion to simplify it)"
  ],
  "tags": [
    "Broccoli",
    "Lunch",
    "Photo",
    "Picnics",
    "Salad",
    "Weeknight Favorite"
  ],
  "title": "broccoli slaw",
  "url": "https://smittenkitchen.com/2009/05/broccoli-slaw/"
}