{
  "date": "2013-10-11T10:50:35+00:00",
  "directions": [
    "Heat oven to 350°F. Sift or whisk together flour, baking powder and salt in a medium bowl. In a larger bowl, cream butter and 1 cup sugar together with an electric mixer until fluffy and light in color. Add the eggs, one at a time and scraping down the bowl, then the dry ingredients, mixing until just combined. ",
    "Spoon batter into an ungreased 9-inch springform pan (but if you’re worried, you can always lightly coat it first with butter or a nonstick spray) and smooth the top. Arrange the plums, skin side up, all over the batter, covering it. Sprinkle the top with lemon juice, then cinnamon, then remaining sugar. ",
    "Bake until cake is golden and a toothpick inserted into a center part of the cake comes out free of batter (but of course not plum juice), about 45 to 50 minutes. Cool on rack. ",
    "Once cool, if you can stand it, and I highly recommend trying, leave it covered at room temperature overnight as this cake is even better on the second day, when those plum juices further release into the cake around it, becoming not just “cake with plum,” but cakeplumughyum (official terminology, there). "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/purple-plum-torte11.jpg?w=640",
  "ingredient_list": [
    "1 cup (125 grams) all-purpose flour",
    "1 teaspoon (5 grams) baking powder (the aluminum-free kind, if you can find it)",
    "Large pinch of salt",
    "1 cup (200 grams) granulated sugar plus 1 to 2 tablespoon (depending on sweetness of plums)",
    "1/2 cup (115 grams or 8 tablespoons) unsalted butter, softened",
    "2 large eggs",
    "12 smallish purple Italian purple plums, halved and pitted",
    "2 teaspoons (10 ml) fresh lemon juice",
    "1 teaspoon or tablespoon ground cinnamon (see Note up top for explanation)"
  ],
  "tags": [
    "Cake",
    "Everyday Cakes",
    "Fall",
    "Photo",
    "Picnics",
    "Plum",
    "Summer"
  ],
  "title": "purple plum torte",
  "url": "https://smittenkitchen.com/2013/10/purple-plum-torte/"
}