{
  "date": "2017-02-13T13:02:17+00:00",
  "directions": [
    "In a medium bowl, beat egg whites until stiff.",
    "In a larger bowl, using same beaters, beat egg yolks and 1/3 cup sugar until thick and pale yellow, 3 to 4 minutes. Beat in mascarpone cheese until combined, and continue beating another minute for extra fluff. Beat in marsala until smooth. Gently fold in egg whites until combined, trying not to deflate the mixture. It will be a loose, soft, creamy custard.",
    "In a small bowl wide enough to dip cookies into, combine the espresso and 1 tablespoon sugar. Set aside.\nTo assemble small cups: Dip first cookie in espresso mixture until almost fully saturated but not falling apart. Break in half and place the first half in the bottom of your cup. Spoon 1 generous (I use a measuring spoon, but heaped a little) tablespoon cream over it. Repeat with second half of first biscuit and another spoonful of cream. Dust with cocoa powder. Dip second cookie in coffee and break in half. Place side-by-side over cocoa then top with 2 generous tablespoons cream mixture, which should take you nearly to the top of the cup. Dust with more cocoa. Repeat with remaining cups.\nTo assemble large cups: Dip first cookie in espresso mixture until almost fully saturated but not falling apart. Break in half and place side-by-side in the bottom of your larger cup. Spoon 2 generous tablespoons (I use a measuring spoon, but heaped a little) cream over and dust with cocoa powder. Dip two biscuits in espresso mixture and break in half. Place 3 of the halves on top of the cocoa powder, cover with another 2 generous tablespoons of cream and cocoa powder. Dip a 4th biscuit in the espresso mixture, break it in half, and place these two halves plus the leftover half from the previous layer on top of the cocoa. Dollop more cream over and repeat with remaining cups.\nIf you can bear it, let cups chill in fridge overnight to set. Before eating, you can dust them with fresh cocoa powder for a prettier look.",
    ""
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/small-batch-tiramisu.jpg?w=750",
  "ingredient_list": [
    "24 ladyfingers (savioardi) cookies (storebought or from recipe below)",
    "3 large eggs, separated",
    "1/3 cup (65 grams) plus 1 tablespoon (13 grams) granulated sugar, divided",
    "1 8.8-ounce (250 ml) package mascarpone",
    "1/3 cup (80 ml) sweet or dry marsala",
    "1 cup (235 ml) strong, warm espresso coffee",
    "A couple tablespoons of your favorite cocoa powder, for sifting over"
  ],
  "tags": [
    "Date Night",
    "Italian",
    "Photo",
    "Pudding"
  ],
  "title": "small batch tiramisu",
  "url": "https://smittenkitchen.com/2017/02/small-batch-tiramisu/"
}