{
  "date": "2014-06-05T12:17:43+00:00",
  "directions": [
    "In a medium saucepan, melt butter over medium heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as it seems to take forever (more than 5 minutes) but then turns dark very quickly. Once it is a deeply fragrant, almost nut-brown color, remove from heat and pour butter and all browned bits at the bottom into a measuring cup. Adding 2 tablespoons water should bring the butter amount back up to 1 cup. Chill browned butter in the fridge until it solidifies, about 1 to 2 hours. You can hurry this along in the freezer, but check back and stir often so it doesn’t freeze unevenly solid.",
    "Heat oven to 350 degrees. Line baking sheets with parchment paper or a nonstick baking mat.",
    "Scrape chilled browned butter and any bits into a large mixing bowl. Add both sugars and beat the mixture together until fluffy. Add egg and beat until combined, scraping down bowl as needed, then vanilla. Whisk flour, baking soda and salt together in a separate bowl. Pour half of flour mixture into butter mixture and mix until combined, then add remaining flour and mix again, scraping down bowl if needed. Add coconut chips in two parts as well.",
    "Scoop dough into 1, 2 or more (Rubin recommends a 2-inch wide scoop for bakery-sized cookies) balls and arrange a few with a lot of room for spreading on first baking sheet; use the back of a spoon or your fingers to flatten the dough slightly. Bake first tray of cookies; 1 tablespoon scoops will take 10 to 11 minutes; 2 tablespoon scoops, 12 to 14 minutes, the 2-inch scoop used at the bakery, 14 to 16 minutes; take the cookies out when they’re deeply golden all over. If cookies have not spread as much as you see above, stir 2 teaspoons more water into cookie dough, mixing thoroughly, before baking off another tray. (See note below for full explanation.) This should do the trick, but if it does not, repeat the same with your next batch. Once you’ve confirmed that you have the water level correct, bake remaining cookies.",
    "Cool cookies on baking sheet for 1 to 2 minutes before transferring to a cooling rack. Cookies keep for up to one week at room temperature. Extra dough can be stored in the fridge for several days or in the freezer for a month or more.",
    "About the water: Browned butter is one of my favorite things to eat in cookies like things and least favorite things to write cookie recipes for, because when you brown the butter, water volume is lost, but not all types of butter contain the same amount of water. I find that for most standard American grocery store butters (I was using Trader Joe’s store brand here, but the equivalent would be any non-European style butter), 1 tablespoon of water per stick (1/2 cup) of butter is a sufficient replacement. However, should you find that your first batch of cookies is too thick, a little extra water is all you’ll need to get the texture right. It sounds scary, but I promise is as simple as can be. Holler at me in the comments if this doesn’t work for you and please note the kind of butter and how much water you used. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/coconut-brown-butter-cookies1.jpg?w=640",
  "ingredient_list": [
    "1 cup (2 sticks or 225 grams) unsalted butter",
    "2 tablespoons water",
    "1/2 cup plus 2 tablespoons (125 grams) granulated sugar",
    "3/4 cup (145 grams) packed light-brown sugar",
    "1 large egg",
    "1/2 teaspoon pure vanilla extract",
    "1 1/4 cup plus 3 tablespoons (175 grams) all-purpose flour",
    "1 teaspoon baking soda",
    "Slightly heaped 1/2 teaspoon flaky sea salt or 1/4 teaspoon table salt",
    "4 cups (240 grams) dried, unsweetened coconut chips (I used these)"
  ],
  "tags": [
    "Brown Butter",
    "Coconut",
    "Cookie",
    "Photo"
  ],
  "title": "coconut brown butter cookies",
  "url": "https://smittenkitchen.com/2014/06/coconut-brown-butter-cookies/"
}