{
  "date": "2007-12-06T17:45:55+00:00",
  "directions": [
    "Equipment: 6 (8-ounce) gratin dishes or shallow ramekins",
    "Make topping: Pulse together flour, almonds, brown sugar, and salt in a food processor until nuts are finely chopped. Add butter and pulse just until blended. Coarsely crumble in a shallow baking pan and chill at least 1 hour. ",
    "Make filling and bake crisps: Preheat oven to 425°F with rack in middle.",
    "Scrape seeds from vanilla bean into a small heavy saucepan, then add pod and butter and cook over medium-low heat, swirling pan occasionally, until butter is browned and fragrant, about 4 minutes. ",
    "While butter browns, stir together sugars, flour, and a pinch of salt in a large bowl. Add pears and brandy and toss to combine.",
    "Discard vanilla pod, then toss butter with pear mixture. Spoon filling into gratin dishes and sprinkle with topping, mounding it slightly in centers. Put in a shallow baking pan and bake 30 minutes, then rotate baking sheet and bake until topping is golden brown and filling is bubbling, 10 to 15 minutes more. Cool to warm or room temperature on a rack. ",
    "Do ahead: The topping can made in advance, chilled and covered for up to two days. The crisps can be assembled (but not baked) 1 day ahead and chilled, covered. Bring them room temperature before baking. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pear-crisps-with-vanilla-brown-butter1.jpg?w=500",
  "ingredient_list": [
    "For topping ",
    "1 1/2 cups all-purpose flour",
    "1 cup whole almonds with skin",
    "1/4 cup packed light brown sugar",
    "1/4 teaspoon salt",
    "3/4 stick unsalted butter, melted and cooled",
    "For filling ",
    "1 vanilla bean, split lengthwise",
    "1/2 stick unsalted butter",
    "1/4 cup packed light brown sugar",
    "2 tablespoons granulated sugar",
    "1 tablespoon all-purpose flour",
    "3 lb firm-ripe Anjou or Bartlett pears (about 6), peeled and coarsely chopped",
    "2 tablespoons pear brandy or eau-de-vie"
  ],
  "tags": [
    "Brown Butter",
    "Crumbles/Crisps",
    "Fall",
    "Fruit",
    "Pear",
    "Photo"
  ],
  "title": "pear crisps with vanilla brown butter",
  "url": "https://smittenkitchen.com/2007/12/pear-crisps-with-vanilla-brown-butter/"
}