{
  "date": "2015-03-12T12:08:19+00:00",
  "directions": [
    "Make the pie dough: ",
    "Form the crust: On a floured counter, roll the dough out into a 12 to 13-inch circle-ish shape. Fold dough gently in quarters without creasing and transfer to a 9-inch standard (not deep-dish) pie plate. Unfold dough and trim overhang to about 1/2-inch. Fold overhang under edge of pie crust and crimp decoratively. If not parbaking, place in fridge until ready to fill. If parbaking, place in freezer for 20 minutes, until solid.",
    "Par-bake the crust: [Optional, but will lead to a crispier base.] Heat oven 400°F (205°C). Line frozen crust with lightly buttered or oiled foil. Fill with pie weights, dried beans or pennies. Bake on a rimmed baking sheet for 20 minutes. Carefully remove foil and weights and let cool completely before filling. ",
    "Heat oven: (Or reduce oven heat, if you just par-baked your crust) to 350°F (175°C).",
    "Prepare filling: Spread oats on a rimmed baking sheet and toast in the oven for 10 to 12 minutes, stirring occasionally. Set aside to cool. Reduce the oven temperature to 325°F (165°C).",
    "To make the black bottom, bring the cream just to a boil over medium heat in a small saucepan. Pour in chocolate pieces and whisk until melted and smooth. Scrape the chocolate into the bottom of the cooled pie shell and spread evenly. Place in freezer while making the filling. ",
    "To make the oatmeal layer, in a large bowl, whisk together the brown sugar, ginger, salt, and melted butter. Add the corn syrup, vanilla, and cider vinegar and whisk to combine. Add the eggs one at a time, whisking well after each addition. Stir in the cooled oats. Place chocolate-coated pie shell on a rimmed baking sheet and pour filling over. ",
    "Bake: For 55 to 70 minutes [updated: it sounds from the comments that more time than the original 55 minutes has been needed for several people], rotating 180 degrees for even color if needed halfway through. The pie is done with the edges are set and puffed slightly and the center is slightly firm to the touch but still has a little give — like gelatin. Allow to cool completely on a wire rack, 2 to 3 hours. Serve slightly warm or at room temperature.",
    "Do ahead: The pie will keep refrigerated for 3 days or at room temperature for 2 days.",
    "A few notes: "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/black-bottom-oatmeal-pie1.jpg?w=750",
  "ingredient_list": [
    "Crust:",
    "1 1/4 cups (155 grams) all-purpose flour",
    "1 1/2 teaspoons (6 grams) granulated sugar",
    "1/2 teaspoon (3 grams) fine sea or table salt",
    "1 stick (4 ounces or 115 grams) cold unsalted butter, cut into chunks",
    "1/4 cup (60 ml) very cold water, plus an additional tablespoon if needed",
    "Filling",
    "1 1/2 cups (120 grams) rolled oats",
    "1/4 cup (60 ml) heavy cream",
    "4 ounces (115 grams) bittersweet chocolate, coarsely chopped",
    "3/4 cup (145 grams) packed light brown sugar",
    "1/4 teaspoon ground ginger",
    "1/2 teaspoon kosher salt",
    "5 tablespoons (70 grams) unsalted butter, melted",
    "1 cup dark corn syrup (see Note below for replacements)",
    "1 teaspoon vanilla extract",
    "2 teaspoons apple cider vinegar",
    "4 large eggs"
  ],
  "tags": [
    "Chocolate",
    "Photo",
    "Tarts/Pies",
    "Thanksgiving",
    "Winter"
  ],
  "title": "black bottom oatmeal pie",
  "url": "https://smittenkitchen.com/2015/03/black-bottom-oatmeal-pie/"
}