{
  "date": "2007-01-22T14:37:12+00:00",
  "directions": [
    "1.\tPreheat the oven to 375 degrees.",
    "2.\tIf you are using buttermilk, milk or yogurt, ignore this step. If you want to use soured milk (a good substitute for buttermilk), warm the milk gently — one minute in the microwave is sufficient, just enough to take the chill off — and add the vinegar. Let it rest while you prepare the other ingredients.",
    "3.\tPlace the fat in a medium oven-proof skillet or in an 8-inch square baking pan over medium heat (Deb note: would you believe I lack both? I used three of my mini-loaf pans); heat until good and hot, about 2 minutes, then turn off the heat. Meanwhile, combine the dry ingredients in a bowl. Mix the egg into the buttermilk, milk or soured milk. Stir the liquid mixture into the dry ingredients, combining well; if it seems too dry, add another tablespoon or two of milk. Pour the batter into the preheated fat, smooth out the top if necessary, and place in the oven.",
    "4.\tBake about 30 minutes, or until the top is lightly brown and the sides have pulled away from the pan; a toothpick inserted into the center will come out clean. Serve hot or warm. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/hibernation-fare1.jpg?w=500",
  "ingredient_list": [
    "1 tablespoon vegetable oil",
    "1 humongous onion, diced",
    "1 15-ounce can of pinto beans, drained and rinsed",
    "1 15-ounce can of black beans, drained and rinsed",
    "1 15-ounce can of kidney beans, drained and rinsed",
    "1 28-ounce plus one 15-ounce can diced tomatoes",
    "1 cup water or stock",
    "2 tablespoons chili powder",
    "1 1/2 teaspoons cumin",
    "1 teaspoon ground coriander",
    "1 tablespoon unsweetened cocoa",
    "1 minced chipotle in adobo, from a can, or if your store is out, ahem, 1/4 teaspoon cayenne will do (the amount here will add a nice kick so tune it up or down according to your tastes; the type and brand of chili powder you use will also affect the heat)",
    "Salt and pepper, to taste",
    "Sliced green onions, for garnish",
    "1 1/4 cups buttermilk, milk or yogurt (or 1 1/4 cups milk and 1 tablespoon white vinegar — see Step 2 below) plus more as need",
    "2 tablespoons butter, olive oil, lard or bacon drippings",
    "1 1/2 cups (about 7 ounces) medium-grind cornmeal",
    "1/2 cup all-purpose flour",
    "1 1/2 teaspoon baking powder",
    "1 teaspoon salt",
    "1 tablespoon sugar, plus more if you like sweet cornbread",
    "1 eggs",
    "2 1/2 pounds Italian sweet sausages, casings removed, crumbled (Deb note: we replaced this with some sweet, and some spicy Italian chicken and turkey sausages)",
    "3 tablespoons olive oil",
    "1 1/2 pounds mushrooms, thickly sliced",
    "3 cups chopped onions",
    "1 1/2 cups chopped fresh basil",
    "1/4 cup chopped fresh oregano",
    "6 large garlic cloves, chopped",
    "1 cup dry white wine",
    "5 cups canned crushed tomatoes with added puree",
    "2 cups diced tomatoes (about 4 medium-large tomatoes)",
    "2 tablespoons (1/4 stick) butter",
    "1 1/4 pounds pappardelle or mafaldine pasta (or any wide, flat noodles)*",
    "1 1/2 cups grated pecorino Romano cheese (about 4 1/2 ounces) "
  ],
  "tags": [
    "Beans",
    "Meat",
    "Pasta",
    "Photo",
    "Vegetarian",
    "Winter"
  ],
  "title": "hibernation fare",
  "url": "https://smittenkitchen.com/2007/01/hibernation-fare/"
}