{
  "date": "2016-09-13T12:14:13+00:00",
  "directions": [
    "\nMake the herby yogurt: Mix the yogurt, finely chopped herbs and vinegar in a small bowl. Season to taste with salt and extra vinegar, if desired. Set aside until needed.\nMake the merguez: If using whole spices, toast them in a dry skillet over medium heat for a few minutes until fragrant. Grind them in a spice grinder or with a mortar and pestle.",
    "Combine lamb, spices, including paprika, harissa, garlic and 1 teaspoon (Turshen called for 1 1/2, which was very salty and we liked it but probably not for everyone) kosher salt and mix to combine. Form into 12 mounds.\n[Do ahead: You can keep the mixed meat patties and herbed yogurt in the fridge for up to 3 days.]\nHeat a large, heavy skillet over high heat. Coat with olive oil and once it is very hot, add a few sausage mounds. Once they hit the frying pan, flatten them with the back of your spatula. Cook until brown and crispy underneath, then flip and cook for another minute or two. Drain on paper towels. Repeat with remaining meat.\nServe patties warm with herby yogurt and scattered with extra herbs and shredded cabbage, if desired, plus wedges of lemon to squeeze over.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/homemade-merguez-with-herby-yogurt1.jpg?w=750",
  "ingredient_list": [
    "1/2 cup (110 grams) plain yogurt",
    "A small handful finely chopped leafy fresh herbs (parsley, cilantro, mint, chives, dill or a mix thereof) plus a few roughly chopped, to serve",
    "1 teaspoon red wine vinegar, or more to taste",
    "Kosher salt",
    "Olive oil",
    "A handful shredded red cabbage to serve (optional)",
    "Lemon wedges, to serve",
    "Kosher salt",
    "1/2 teaspoon cumin seeds or a heaped 1/2 teaspoon ground",
    "1/2 teaspoon coriander seeds or a heaped 1/2 teaspoon ground",
    "1/2 teaspoon fennel seeds or a heaped 1/2 teaspoon ground",
    "1 teaspoon sweet paprika",
    "2 garlic cloves, minced",
    "2 tablespoons harissa paste (I just used a small squeeze) or another hot sauce",
    "1 pound (455 grams) ground lamb, at room temperature"
  ],
  "tags": [
    "Lamb",
    "Middle Eastern",
    "North African",
    "Photo",
    "Weeknight Favorite"
  ],
  "title": "homemade merguez with herby yogurt",
  "url": "https://smittenkitchen.com/2016/09/homemade-merguez-with-herby-yogurt/"
}