{
  "date": "2006-09-05T17:44:29+00:00",
  "directions": [
    "Preheat the oven to 350°F. ",
    "In the bowl of an electric mixer fitted with a paddle attachment, mix the butter and sugar together until they are just combined. Add the vanilla. In a medium bowl, sift together the flour and salt, then add them to the butter-and-sugar mixture. Mix on low speed until the dough starts to come together. Dump onto a surface dusted with flour and shape into a flat disk. Press the dough into a 10-inch-round or 9-inch-square false-bottom tart pan, making sure that the finished edge is flat. Chill until firm. ",
    "Butter one side of a square of aluminum foil to fit inside the tart and place it, buttered side down, on the pastry. Fill with beans or rice. Bake for 20 minutes. Remove the foil and beans, prick the tart all over with the tines of a fork, and bake again for 20 to 25 minutes more, or until lightly browned. Allow to cool to room temperature. ",
    "Remove the zest of 4 limes with a vegetable peeler or zester, being careful to avoid the white pith. Squeeze the limes to make 1/2 cup of juice and set the juice aside. Put the zest in a food processor fitted with a steel blade. Add the sugar and process for 2 to 3 minutes, until the zest is very finely minced. In the bowl of an electric mixer fitted with a paddle attachment, cream the butter with the sugar and lime zest. Add the eggs, one at a time, and then add the lime juice and salt. Mix until combined. ",
    "Pour the mixture into a 2-quart saucepan and cook over low heat, stirring constantly, until thickened, about 10 minutes. The lime curd will thicken at about 175°F, or just below a simmer. Remove from the heat and set aside. ",
    "Fill the tart shell with warm lime curd and allow to set at room temperature. Once set, serve immediately or refrigerate until ready to serve.",
    "* I made one change: I found the mixture to be very crumbly, so I added an egg to hold it together, which is a fairly typical inclusion in tart crusts. After that, it rolled out perfectly."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/in-praise-of-the-pocket-sized1.jpg?w=500",
  "ingredient_list": [
    "Tart Shell*",
    "3/4 cup (1.5 sticks) unsalted butter at room temperature",
    "1/2 cup sugar",
    "1/2 teaspoon pure vanilla extract",
    "1 3/4 cups all-purpose flour",
    "Pinch salt ",
    "Filling",
    "4 limes at room temperature",
    "1 1/2 cups sugar",
    "1/4 pound (1 stick) unsalted butter at room temperature",
    "4 extra-large eggs at room temperature",
    "1/8 teaspoon salt"
  ],
  "tags": [
    "Citrus",
    "Fruit",
    "Lime",
    "Photo",
    "Tarts/Pies",
    "Winter"
  ],
  "title": "key lime tart",
  "url": "https://smittenkitchen.com/2006/09/in-praise-of-the-pocket-sized/"
}