{
  "date": "2013-07-15T12:04:00+00:00",
  "directions": [
    "Place water and farro in a medium saucepan to presoak (I find just 5 to 10 minutes sufficient) while you prepare the other ingredients. Adding each ingredient to the pot as you finish preparing it, cut onion in half again, and very thinly slice it into quarter-moons. Thinly slice garlic cloves as well. Halve or quarter tomatoes. Add salt, pepper flakes (to taste) and 1 tablespoon olive oil to pan, and set a timer for 30 minutes. Bring uncovered pan (no lid necessary) up to a boil, then reduce to a gentle simmer, stirring occasionally. When the timer rings, the farro should be perfectly cooked (tender but with a meaty chew), seasoned and the cooking water should be almost completely absorbed. If needed, though I’ve never found it necessary, cook it for 5 additional minutes, until farro is more tender. ",
    "Transfer to a wide serving bowl. If there’s enough leftover cooking liquid to be bothersome, simply use a slotted spoon to leave the amount you wish to behind. Drizzle farro lightly with additional olive oil, scatter with basil and parmesan. Eat immediately. Repeat tomorrow."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/one-pan-farro-with-tomatoes.jpg?w=750",
  "ingredient_list": [
    "2 cups water",
    "1 cup (updated) semi-pearled farro (see Note above for farro types)",
    "1/2 large onion (I usually use a white one, for mildness)",
    "2 cloves garlic",
    "9 ounces grape or cherry tomatoes",
    "1 1/4 teaspoons kosher or coarse sea salt",
    "Up to 1/4 teaspoon red pepper flakes (to taste)",
    "1 tablespoon olive oil, plus extra for drizzling",
    "Few basil leaves, cut into thin ribbons",
    "Grated parmesan cheese, for serving (optional)"
  ],
  "tags": [
    "Grain/Rice",
    "Photo",
    "Quick",
    "Summer",
    "Tomatoes",
    "Vegan",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "one-pan farro with tomatoes",
  "url": "https://smittenkitchen.com/2013/07/one-pan-farro-with-tomatoes/"
}