{
  "date": "2007-07-09T17:37:07+00:00",
  "directions": [
    "Preheat oven to 375 degrees F.",
    "Pour tomato puree into bottom of an oval baking dish, approximately 10 inches across the long way. Drop the sliced garlic cloves and chopped onion into the sauce, stir in one tablespoon of the olive oil and season the sauce generously with salt and pepper. ",
    "Trim the ends off the eggplant, zucchini and yellow squash. As carefully as you can, trim the ends off the red pepper and remove the core, leaving the edges intact, like a tube. ",
    "On a mandoline, adjustable-blade slicer or with a very sharp knife, cut the eggplant, zucchini, yellow squash and red pepper into very thin slices, approximately 1/16-inch thick.",
    "Atop the tomato sauce, arrange slices of prepared vegetables concentrically from the outer edge to the inside of the baking dish, overlapping so just a smidgen of each flat surface is visible, alternating vegetables. You may have a handful leftover that do not fit. ",
    "Drizzle the remaining tablespoon olive oil over the vegetables and season them generously with salt and pepper. Remove the leaves from the thyme sprigs with your fingertips, running them down the stem. Sprinkle the fresh thyme over the dish.",
    "Cover dish with a piece of parchment paper cut to fit inside. (Tricky, I know, but the hardest thing about this.) ",
    "Bake for approximately 45 to 55 minutes, until vegetables have released their liquid and are clearly cooked, but with some structure left so they are not totally limp. They should not be brown at the edges, and you should see that the tomato sauce is bubbling up around them.",
    "Serve with a dab of soft goat cheese on top, alone, or with some crusty French bread, atop polenta, couscous, or your choice of grain. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/758095178_8643a61f2b_o.jpg?w=749",
  "ingredient_list": [
    "1/2 onion, finely chopped",
    "2 garlic cloves, very thinly sliced",
    "1 cup tomato puree (such as Pomi)",
    "2 tablespoons olive oil, divided",
    "1 small eggplant (my store sells these “Italian Eggplant” that are less than half the size of regular ones; it worked perfectly)",
    "1 smallish zucchini",
    "1 smallish yellow squash",
    "1 longish red bell pepper",
    "Few sprigs fresh thyme",
    "Salt and pepper",
    "Few tablespoons soft goat cheese, for serving"
  ],
  "tags": [
    "Eggplant",
    "Peppers",
    "Photo",
    "Summer",
    "Vegetarian",
    "Weeknight Favorite",
    "Zucchini"
  ],
  "title": "ratatouille’s ratatouille",
  "url": "https://smittenkitchen.com/2007/07/rat-a-too-ee-for-you-ee/"
}