{
  "date": "2010-12-07T14:13:34+00:00",
  "directions": [
    "Preheat oven to 450°F. Cut a small X on the top of each chestnut with a very sharp knife. Don’t be afraid to cut into the “meat” of the chestnut a little; I found that the the ones that were the most easy to peel start with a deep enough cut that the skin peels back while roasting. Roast chestnuts on a baking sheet for about 20 to 30 minutes, until a darker shade of brown and the X peels back to reveal the inner nut.",
    "Cool on tray and then peel. Don’t worry if they break up as you do so if you have to dig them out in pieces, you won’t need whole ones for this.",
    "Once the peeled chestnuts are fully cool, chop them coarsely on a cutting board. Measure 1 cup of chopped chestnuts, and dump them in the bowl of a food processor. Grind them until they are very well chopped, then add the softened butter, and pulse again until combined. Add 1/2 cup of your powdered sugar, vanilla extract, 1/4 teaspoon cinnamon, nutmeg, salt and flour and pulse until an even dough is formed.",
    "[No food processor? Chop-chop-chop those chestnuts as fine as you can, then use an electric mixer to whip the butter and 1/2 cup powdered sugar. Add the vanilla, 1/4 teaspoon cinnamon, nutmeg, salt, flour and chestnuts and beat until well blended.]",
    "Divide dough and wrap each half in plastic, chilling for one hour or until firm. Once chilled, preheat the oven to 350°F. Whisk remaining 1 1/2 cups powdered sugar and a few pinches of cinnamon in a small bowl. Set aside. Working with one half of the chilled dough at at time, roll it into 2 teaspoon-sized balls (I use my 1 tablespoon measure, but didn’t fill it) in the palm of your hand. Arrange on parchment-lined baking sheet but no need to leave more than 1/2 inch between the cookies; they won’t spread.",
    "Bake cookies until golden brown on bottom and just pale golden on top, about 14 to 17 minutes. (See Note up top about baking times.) Cool cookies 5 minutes on baking sheet. Gently toss warm cookies in cinnamon sugar to coat completely. Transfer coated cookies to rack and cool completely. Repeat procedure with remaining half of dough. To touch them up before serving, you can sift some of the leftover cinnamon-sugar mixture over them.",
    "Do ahead: Dough can be chilled in the fridge for a day or two, longer in the freezer. Chestnuts can be roasted in advance, kept at room temperature for a day or so. Cookies will keep in an airtight container at room temperature for a week."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-chestnut-cookies1.jpg?w=500",
  "ingredient_list": [
    "1 pound chestnuts",
    "1 cup (2 sticks or 8 ounces) unsalted butter, room temperature",
    "2 cups powdered sugar",
    "2 teaspoons vanilla extract",
    "1/4 teaspoon ground cinnamon + additional for coating",
    "A few gratings of fresh nutmeg",
    "1/8 teaspoon salt",
    "2 cups all purpose flour"
  ],
  "tags": [
    "Cookie",
    "Photo",
    "Winter"
  ],
  "title": "roasted chestnut cookies",
  "url": "https://smittenkitchen.com/2010/12/roasted-chestnut-cookies/"
}