{
  "date": "2008-04-04T12:26:36+00:00",
  "directions": [
    "Preheat oven to 400°F.",
    "Mix the bread cubes with the garlic, olive oil, parmesan, salt and pepper in a large bowl. Toss to coat well. Transfer bread to a baking sheet and sprinkle with salt and pepper. Bake stirring once or twice, until the croutons are crisp and lightly colored on the outside but still soft within, about 10 to 15 minutes. Set aside and let cool.",
    "Mix the red onion with the vinegar and lemon juice in a small bowl and set aside for a few minutes before whisking in the remaining vinaigrette ingredients: olive oil and dijon. Set aside.",
    "Cut off dark green tops of leeks and trim root ends. Halve each leek lengthwise to within 2 inches of root end. Rinse well under cold running water to wash away sand. Cover leeks with cold water in a 12-inch heavy skillet. Add salt and simmer leeks, uncovered, until tender, 15 to 20 minutes.",
    "Without draining the cooking water (you will reuse it for the asparagus), transfer leeks to a bowl of ice and cold water to stop cooking, then pat the leeks dry with paper towels. Break off tough ends of asparagus and cook it in the boiling water until crisp-tender, no more than three minutes if they’re pencil-thin, more if your asparagus is thicker. Transfer it to another bowl of ice water, drain and pat it dry.",
    "Cut the leeks and the asparagus each into one-inch segments–the leeks will be especially slippery and prone to separating; hold firm and use a sharp knife! Place pieces in a large bowl and mix in beans and cooled parmesan croutons. Pour vinaigrette over and toss well. Season with salt and pepper. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2008/04/spring-panzanella.jpg?w=750",
  "ingredient_list": [
    "For the croutons:",
    "1/4 cup olive oil",
    "2 cloves garlic, finely chopped",
    "6 cups day-old bread, crust removed, cubed",
    "6 tablespoons finely grated Parmesan, plus more for garnish",
    "Salt and freshly ground black pepper",
    "For the vinaigrette:",
    "Half a red onion, finely diced",
    "2 to 2 1/2 tablespoons champagne or white wine vinegar",
    "Juice of half a lemon",
    "1/4 cup olive oil",
    "1/2 teaspoon Dijon mustard",
    "For the salad:",
    "4 large leeks",
    "2 teaspoons salt",
    "1 pound asparagus",
    "1 19-ounce can of white beans, rinsed and drained or 1 1/2 cups cooked white beans"
  ],
  "tags": [
    "Asparagus",
    "Beans",
    "Leeks",
    "Photo",
    "Picnics",
    "Salad",
    "Spring",
    "Vegetarian",
    "Weeknight Favorite"
  ],
  "title": "spring panzanella",
  "url": "https://smittenkitchen.com/2008/04/spring-panzanella/"
}