{
  "date": "2016-05-09T11:52:01+00:00",
  "directions": [
    "Heat a large, deep skillet with a lid** over medium-high heat. If using, add prosciutto in a single layer and cook until curling and browned underneath, about 2 minutes. Flip over and let cook until browned on the other side. Transfer a paper towel to blot oil and cool.\nAdd oil to same skillet and heat it for a minute. Add frozen tortellini in a single layer and cook for 2 to 4 minutes, until they’re browned underneath. Sprinkle with frozen peas and add water to pan. Be careful; it’s going to ROARHISS wildly. Put the lid on, and let them steam for about 5 minutes but don’t go too far because if the water cooks off too quickly, you’ll want to add a splash more. At 5 minutes, all water should have cooked off. Scoops pasta and peas into bowl. If you find any pasta has stuck, just add a splash more water over high heat to “deglaze” them off — loosen them with a thin spatula and toss them around until they’re crisp again.\nImmediately dollop on crème fraîche so it melts over the pasta. Squeeze lemon juice over, then sprinkle with salt, pepper, crumble prosciutto over (if using), then slivers of mint and parmesan, if desired. Dig in. Give your freezer a pat on its back.I use this one."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/crispy-tortellini-with-peas-and-prosciutto1.jpg?w=750",
  "ingredient_list": [
    "3 thin slices prosciutto (optional)",
    "1 to 2 tablespoons olive oil",
    "1 13-14 ounce package frozen cheese tortellini (about 3 cups)",
    "1/2 cup frozen peas, no need to defrost",
    "1/3 cup water",
    "3 tablespoons crème fraîche or mascarpone",
    "Juice of half a lemon, more or less to taste",
    "Salt and freshly ground black pepper",
    "A few fresh mint leaves, cut into thin slivers",
    "Grated parmesan (optional)"
  ],
  "tags": [
    "Pasta",
    "Peas",
    "Photo",
    "Quick",
    "Weeknight Favorite"
  ],
  "title": "crispy tortellini with peas and prosciutto",
  "url": "https://smittenkitchen.com/2016/05/crispy-tortellini-with-peas-and-prosciutto/"
}