[
    {
        "ingredient_list": [
            "44-Clove Garlic Soup with Parmesan Cheese", 
            "From Bon Appetit, February 1999", 
            "26 garlic cloves (unpeeled)", 
            "2 tablespoons olive oil", 
            "2 tablespoons (1/4 stick) butter", 
            "2 1/4 cups sliced onions", 
            "1 1/2 teaspoons chopped fresh thyme", 
            "18 garlic cloves, peeled", 
            "3 1/2 cups chicken stock or canned low-salt chicken broth", 
            "1/2 cup whipping cream", 
            "1/2 cup finely grated Parmesan cheese (about 2 ounces)", 
            "4 lemon wedges "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/08/44-clove-garlic-soup.jpg?w=750", 
        "tags": [
            "Budget", 
            "Gluten-Free", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2006/08/a-44-clove-ticket-to-a-happier-place/", 
        "title": "44-clove garlic soup", 
        "directions": [
            "Preheat oven to 350°F. Place 26 garlic cloves in small glass baking dish. Add 2 tablespoons olive oil and sprinkle with salt and pepper; toss to coat. Cover baking dish tightly with foil and bake until garlic is golden brown and tender, about 45 minutes. Cool. Squeeze garlic between fingertips to release cloves. Transfer cloves to small bowl.", 
            "Melt butter in heavy large saucepan over medium-high heat. Add onions and thyme and cook until onions are translucent, about 6 minutes. Add roasted garlic and 18 raw garlic cloves and cook 3 minutes. Add chicken stock; cover and simmer until garlic is very tender, about 20 minutes. Working in batches, puree soup in blender until smooth. Return soup to saucepan; add cream and bring to simmer. Season with salt and pepper. ", 
            "Divide grated cheese among 4 bowls and ladle soup over. Squeeze juice of 1 lemon wedge into each bowl and serve. ", 
            "Do ahead: Can be prepared 1 day ahead. Cover and refrigerate. Rewarm over medium heat, stirring occasionally."
        ], 
        "date": "2006-08-30T22:11:49+00:00"
    }, 
    {
        "ingredient_list": [
            "For squash soup", 
            "3/4 stick (6 tablespoons) unsalted butter, cut into pieces", 
            "1 medium onion, halved lengthwise and thinly sliced crosswise", 
            "1/2 teaspoon salt", 
            "2 lb yellow summer squash, halved and thinly sliced", 
            "2 carrots, thinly sliced", 
            "1 yellow-fleshed potato (1/2 pound), peeled, halved, and thinly sliced", 
            "4 cups chicken stock or reduced-sodium chicken broth", 
            "For pistou**", 
            "3/4 cup loosely packed fresh mint leaves", 
            "1/2 cup loosely packed fresh flat-leaf parsley sprigs", 
            "1 large scallion, chopped (1/2 cup)", 
            "1/4 cup extra-virgin olive oil", 
            "2 tablespoons water", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/a-soup-to-build-dream-on1.jpg?w=500", 
        "tags": [
            "Carrots", 
            "Gluten-Free", 
            "Photo", 
            "Potatoes", 
            "Soup", 
            "Summer", 
            "Summer Squash"
        ], 
        "url": "https://smittenkitchen.com/2006/09/a-soup-to-build-dream-on/", 
        "title": "summer squash soup", 
        "directions": [], 
        "date": "2006-09-11T09:26:32+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive oil", 
            "3 1/4 cup sliced onions", 
            "3 large cloves garlic, crushed", 
            "1/4 cup dry white wine", 
            "12 large red bell peppers, cut into 1-inch pieces", 
            "2 cups chicken or vegetable stock or broth", 
            "2 tablespoons chopped fresh thyme", 
            "1/4 to 1/2 teaspoon hot red pepper flakes", 
            "Salt and white or black pepper", 
            "Crème fraîche for garnish", 
            "Thyme sprigs for garnish. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/at-last-this-soup1.jpg?w=500", 
        "tags": [
            "Peppers", 
            "Photo", 
            "Soup", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/07/at-last-this-soup/", 
        "title": "red pepper soup", 
        "directions": [
            "Put oil in large pot. Add onion when oil is hot. Cook onions until they begin to soften and take on color. Add garlic and cook another minute. Add wine and cook down quickly and on high heat, until only one tablespoon is left. Add peppers, stock, thyme and red pepper flakes. Season to taste with salt and pepper. Cover and simmer until peppers are tender, about 30 minutes. In food processor or with an immersion blender, puree mixture in until smooth (if a food processor, in batches). Adjust seasonings to taste.", 
            "Soup can be served warm or chilled. Serve in demitasse cups or soup bowls, topped with a dab of crème fraîche and a tiny sprig of thyme.", 
            "Do ahead: Cover and chill overnight or for as long as 2 days or freeze (whisk well before serving if thawed). "
        ], 
        "date": "2007-07-19T00:07:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 bunch (about 6 ounces) kale (I used Lacinato or “Dinosaur” Kale but I understand that the curlier stuff works, too, possibly even better)", 
            "1 tablespoon olive oil", 
            "Sea salt, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/baked-kale-chips1.jpg?w=500", 
        "tags": [
            "Kale", 
            "Photo", 
            "Snack", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/03/baked-kale-chips/", 
        "title": "baked kale chips", 
        "directions": [
            "Preheat oven to 300°F. Rinse and dry the kale, then remove the stems and tough center ribs. Cut into large pieces, toss with olive oil in a bowl then sprinkle with salt. Arrange leaves in a single layer on a large baking sheet (I needed two because mine are tiny; I also lined mine with parchment for easy clean-up but there’s no reason that you must). Bake for 20 minutes, or until crisp. Place baking sheet on a rack to cool.", 
            "Kale-Dusted Popcorn If you’re making the chips with the intention to grind them up for popcorn, I’d use less oil — perhaps half — so they grind without the “powder” clumping. I ground a handful of my chips (about half) in a mortar and pestle (well, actually the “pestle” was MIA so I used the handle of an OXO reamer, not that anyone asked) and sprinkled it over popcorn (1/4 cup popcorn kernels I’d cooked in a covered pot with 1 1/2 tablespoons oil over medium heat, shaking it about with potholders frequently). I seasoned the popcorn with salt. I liked this snack, but I think Parmesan and Kale-Dusted Popcorn would be even more delicious. Next time!"
        ], 
        "date": "2010-03-26T11:56:50+00:00"
    }, 
    {
        "ingredient_list": [
            "1 head garlic", 
            "3 tablespoons unsalted butter", 
            "2 medium leeks, white and light green parts halved lengthwise, washed, and chopped small", 
            "5 to 6 cups low-sodium chicken or vegetable broth (I used 5 cups; add the extra cup after pureeing if you’d like a thinner soup)", 
            "2 bay leaves", 
            "Table salt", 
            "2 1/2 pounds russet potatoes, peeled and cut into 1/2-inch cubes", 
            "1/3 cup sour cream", 
            "Ground black pepper", 
            "Toppings, optional:", 
            "Minced fresh chives or scallions", 
            "Bacon bits", 
            "Sour cream", 
            "Grated cheddar", 
            "A drizzle of melted (or melted and browned) butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/01/baked-potato-soup.jpg?w=751", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Soup", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/01/baked-potato-soup/", 
        "title": "baked potato soup", 
        "directions": [
            "Rinse the head of garlic to remove any outside grit or dirt. Cut the top third off the head and peel any loose papery skins off the bottom two-thirds. Instead of discarding the top third (CI’s suggestion), pop out a bunch (or all) of the garlic clove tips and mince them. If you’re Deb, breathe a sigh of relief that you have wasted nothing.", 
            "In a large, heavy pot or Dutch oven, melt the butter over medium heat. Add leeks and cook them until soft (but not brown), about 5 minutes. Add the minced garlic and cook another minute. Add the larger part of the garlic head (whole, not chopped), broth, bay leaves and 3/4 teaspoon salt. Reduce heat and simmer until garlic is very tender when pierced with tip of knife, 30 to 40 minutes. Add potatoes and continue to simmer, partially covered, until potatoes are tender, about 15 to 20 minutes.", 
            "Discard bay leaves. Remove garlic heads. Optional: If you’d like an extra garlic boost to the soup, using tongs or paper towels, squeeze garlic head at root end until cloves slip out of their skins. Using a  fork, mash the garlic cloves to smooth paste and add it back to the soup. [I felt our soup was garlicky enough without this. It had a great suggestion of garlic without overpowering the baked potato flavor.]", 
            "Add sour cream to soup and cook for another 2 to 3 minutes. Adjust seasonings, adding more salt and pepper to taste. Using immersion blender, process soup until chunky-creamy, leaving lots of potato texture intact. (Alternatively, transfer a portion of the potatoes and broth to a food processor or blender and puree until smooth.) Serve with whatever makes you happy on top, or nothing at all."
        ], 
        "date": "2011-01-19T12:42:08+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/beef-leek-and-barley-soup1.jpg?w=500", 
        "tags": [
            "Freezer Friendly", 
            "Grain/Rice", 
            "Leeks", 
            "Meat", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/10/beef-leek-and-barley-soup/", 
        "title": "beef, leek and barley soup", 
        "directions": [
            "1. Trim two big, meaty short ribs and put them on the bottom of your soup pot.", 
            "2. Add 1/2 cup of barley, three big cloves of garlic shopped up, two chopped onions, and three leeks cut lengthwise and then into segments–use both the white and the green parts. You can also add mushrooms and any other vegetables you might like. Grind in a little black pepper.", 
            "3. Add about eight cups of filtered water or beef stock and let it simmer on the back burner for at least three hours while you go about your business. You can also add lima beans, cube potatoes, peas, corn, string beans and chopped tomatoes at any point, or the second day, should you have any leftover.", 
            "4. Before serving, skim off the fat–there will be a bit, as short ribs are quite fatty–take the meat off the bones, chop it and put it back in the soup."
        ], 
        "date": "2008-10-02T15:39:12+00:00"
    }, 
    {
        "ingredient_list": [
            "Lid", 
            "2 cups (250 grams) all- purpose flour", 
            "1/2 teaspoon fine sea or table salt", 
            "13 tablespoons (185 grams or 6 1/2 ounces) cold unsalted butter, diced", 
            "6 tablespoons (90 grams) sour cream or Greek-style yogurt", 
            "1 tablespoon (15 ml) cider vinegar", 
            "1/4 cup (60 ml) very cold water", 
            "1 egg, beaten with 1 teaspoon water, for egg wash", 
            "Filling", 
            "Salt and freshly ground black pepper", 
            "3 1/2 to 4 pounds bone-in, skin-on chicken parts (breasts, thighs and drumsticks are ideal)", 
            "1 to 2 glugs olive oil", 
            "2 medium leeks, white and light green parts only, cut in half lengthwise and then into 1/2-inch slices", 
            "1 large onion, diced small", 
            "1/4 cup dry sherry (optional)", 
            "3 cups low-sodium chicken broth", 
            "1/4 cup milk or heavy cream", 
            "1 bay leaf", 
            "1 teaspoon minced fresh thyme", 
            "3 tablespoons unsalted butter, at room temperature", 
            "4 1/2 tablespoons all-purpose flour", 
            "1 cup fresh or frozen green peas (no need to defrost)", 
            "2 large carrots, diced small (about 1 cup carrots)", 
            "2 tablespoons chopped flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/img_92401.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Fall", 
            "Photo", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/10/better-chicken-pot-pies/", 
        "title": "better chicken pot pies", 
        "directions": [
            "Make pastry lids: In a large, wide bowl (preferably one that you can get your hands into), combine the flour and salt. Add the butter and, using a pastry blender or your fingertips, cut them up and into the flour mixture until it resembles little pebbles. Keep breaking up the bits of butter until the texture is closer to uncooked couscous. In a small dish, whisk together the sour cream, vinegar, and water, and combine it with the butter-flour mixture. Using a flexible spatula, stir the wet and the dry together until a craggy dough forms. If needed, get your hands into the bowl to knead it a few times into one big ball. Pat it into a flattish ball, wrap it in plastic wrap, and chill it in the fridge for 1 hour or up to 2 days. Meanwhile…", 
            "Make filling: Generously season all sides of the chicken parts with salt and freshly ground black pepper. If your chicken breasts are particularly large, I find that halving them can ensure they cook at the same pace at the other parts. Heat first glug of olive oil over medium-high  heat in the bottom of a large Dutch oven (minimum of 4 quarts; mine is 5). Brown chicken in two parts, cooking until golden on both sides. Transfer to a plate and repeat with second half of chicken. Set aside. ", 
            "Heat second glug of olive oil in the same pot. Add onions and leeks, season with salt and pepper, and saute them until softened, about 7 minutes. If using, pour in sherry and use it to scrape up any bits stuck to the bottom of the pan. Simmer until mostly cooked off. Add milk or cream, chicken broth, thyme and bay leaf and bring to a simmer. Nestle the browned chicken and any accumulated juices into the pot. Cover and gently simmer to 30 minutes, after which the chicken should be fully cooked and tender.", 
            "Transfer the chicken to a cutting board to cool slightly. Discard the bay leaves. Allow the sauce to settle for a few minutes, then skim the fat from the surface using a wide spoon; reserve it for another use, or this:", 
            "In a medium bowl, mash butter (feel free to replace any part of it with skimmed chicken fat from the previous step, thanks to a commenter below for the suggestion) and flour together with a fork until a paste forms and no flour is still visibly dry. Pour one ladleful of filling over it, and whisk until smooth. Add a second ladleful, whisking again. Return this butter-flour-filling mixture to the larger pot, stir to combine, and bring mixture back to a simmer for 10 minutes. The brothy base should thicken to a gravy-like consistency. Adjust seasonings, if needed.", 
            "Add carrots and peas to stew and simmer for 3 minutes, until firm-tender. Shred or dice the chicken, discarding the bones and skin or saving it for another use. Return chicken to stew and re-simmer for 1 minute. Stir in parsley. ", 
            "Assemble and bake pies: Heat your oven to 375 degrees F.", 
            "Divide chilled dough into quarters. Roll each quarter out into rounds that will cover 4 2-cup ovenproof bowls or baking dishes with a 1-inch overhang. Cut vents into rounds. Ladle filling into four bowls, filling only to 1 to 1 1/2 inches below the rim to leave room for simmering. Whisk egg with water to make an egg wash. Brush edges of bowls with egg wash, or if you like lids that easily lift off your bowls and are willing to risk that they may slip slightly into the bowl when baking, you can skip this. Place a lid over each bowl, pressing gently to adhere it to the outer sides of the bowl. Brush the lids with egg wash. Bake until crust is bronzed (more than mine, please, if nobody in your family is having a hangry meltdown) and filling is bubbling, 30 to 35 minutes.", 
            "Do ahead: The dough for the lids can be made up to 3 days in advance and chilled. The filling can be made up to a day in advance and re-warmed before assembling and baking the pot pies. "
        ], 
        "date": "2014-10-06T12:15:46+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/11/black-bean-pumpkin-soup.jpg?w=750", 
        "tags": [
            "Beans", 
            "Fall", 
            "Gluten-Free", 
            "Photo", 
            "Pumpkin", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2007/11/black-bean-pumkin-soup/", 
        "title": "black bean pumpkin soup", 
        "directions": [
            "Garnish: sour cream and coarsely chopped lightly toasted pumpkin seeds ", 
            "In a food processor coarsely puree beans and tomatoes.", 
            "In a 6-quart heavy kettle cook onion, shallot, garlic, cumin, salt, and pepper in butter over moderate heat, stirring, until onion is softened and beginning to brown. Stir in bean puree. Stir in broth, pumpkin, and Sherry until combined and simmer, uncovered, stirring occasionally, 25 minutes, or until thick enough to coat the back of a spoon.", 
            "Just before serving, add ham and vinegar and simmer soup, stirring, until heated through. Season soup with salt and pepper.", 
            "Serve soup garnished with sour cream and toasted pumpkin seeds. "
        ], 
        "date": "2007-11-07T00:48:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            "2 medium-size red onions, chopped", 
            "1 medium-size red bell pepper, chopped", 
            "1 medium-size green bell pepper, chopped", 
            "4 garlic cloves, minced", 
            "4 teaspoons ground cumin", 
            "1 16-ounce package dried black beans", 
            "1 tablespoon chopped chipotle chiles from a can (this gives it a solid kick, dial back if you are wary)", 
            "7 cups water", 
            "2 tablespoons fresh lime juice", 
            "2 teaspoons coarse kosher salt", 
            "1/4 teaspoon ground black pepper", 
            "1 tablespoon whole cumin seeds", 
            null, 
            "Salt and freshly ground pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/black-bean-soup1.jpg?w=750", 
        "tags": [
            "Beans", 
            "Budget", 
            "Gluten-Free", 
            "Peppers", 
            "Photo", 
            "Slow Cooker", 
            "Soup", 
            "Tex-Mex", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/01/black-bean-soup-toasted-cumin-seed-crema/", 
        "title": "black bean soup + toasted cumin seed crema", 
        "directions": [
            "Make the soup on the stove: Heat olive oil in the bottom of a 5-quart or larger Dutch oven or stock pot over medium-high heat. Add onions and both bell peppers and sauté until beginning to brown, about eight minutes. Add garlic and cumin; stir one minute. Add beans and chipotles, then 7 cups water. Bring to a full boil, boil for 1 minute, then reduce heat to a gentle simmer, partially cover pot, and cook until beans have softened, about 2 to 3 hours. (These times can vary a lot depending on the age of the beans and kind of water.)\nMake the soup in a slow-cooker: Heat olive oil in large skillet over medium-high heat. Add onions and both bell peppers and sauté until beginning to brown, about eight minutes. Add garlic and cumin; stir one minute. Transfer mixture to 6-quart slow cooker. Add beans and chipotles, then 7 cups hot water. Cover and cook on high until beans are very tender, about 6 hours. [But see note up top because mine finish sooner, although most others have not.]\nMake the soup in an InstantPot or electric pressure cooker: Heat olive oil in the bottom of your pressure cooker on the sauté function. Add onions and both bell peppers and sauté until beginning to brown, about eight minutes. Add garlic and cumin; stir one minute. Add beans and chipotles, then 7 cups hot water. Cover, locking lid and closing steam valve. Cook at high pressure on the manual setting for 30 minutes. If you have time, let the pressure release naturally. I didn’t have a lot of time, and let it release naturally for 10 to 15 minutes, then manually the rest of the way.\nWhile it cooks, make the topping: Place the cumin in a small sauté pan over medium heat. Toast until lightly golden brown. Place in spice grinder or mortar and pestle and grind until coarse. Stir it into the cream and season with salt and pepper, to taste.\nAll cooking methods: Transfer two cups bean mixture to blender; puree until smooth, then return the puree to remaining soup in slow cooker. Or, you can use an immersion blender to partially blend the soup right where you’ve cooked it. Stir in lime juice, salt, and pepper. Adjust seasonings to taste; we found we needed more salt. Ladle soup into bowls. Spoon dollop of toasted cumin seed cream (below) over each bowl and serve.", 
            "Do ahead: This soup keeps great in the fridge, and even thickens a bit. In a good way!\n"
        ], 
        "date": "2010-01-12T14:00:01+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons oil, butter (regular or ghee)", 
            "1 medium onion, finely chopped", 
            "1/2 teaspoon cumin seeds", 
            "1-inch piece of ginger, finely chopped", 
            "2 garlic cloves, finely chopped", 
            "1 teaspoon ground coriander", 
            "1/4 teaspoon ground turmeric", 
            "1/2 teaspoon garam masala (optional but traditional)", 
            "Ground chile powder, to taste (I started with a 1/2 teaspoon, but I have to keep things weak for kids)", 
            "1 cup finely chopped or pureed tomatoes, fresh or from a can", 
            "1 teaspoon fine sea salt, plus more to taste", 
            "1 cup dried black lentils", 
            "4 1/2 cups water, plus more to taste", 
            "4 teaspoons butter (salted is lovely here)", 
            "2 tablespoons heavy cream", 
            "Handful chopped fresh cilantro"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/black-lentil-dal.jpg?w=750", 
        "tags": [
            "Freezer Friendly", 
            "Gluten-Free", 
            "Indian", 
            "Photo", 
            "Soup", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/03/black-lentil-dal/", 
        "title": "punjabi-style black lentils", 
        "directions": [
            "Make the dal: Heat oil (or oil and butter) over medium. Once hot, add onion and cumin seeds and cook, stirring occasionally, until onion browned in spots. Add garlic and ginger, cook for 1 minute more, then the rest of the spices and tomato and cook for 3 minutes more, scraping up any stuck bits. Add water and salt, then lentils. Bring to simmer, then reduce to low and cover and cook until lentils are tender, between 35 and 45 minutes, stirring occasionally. For a looser dal, you can add more water. Adjust spices and seasonings to taste.", 
            "To finish as shown: Ladle into four bowls. Place a 1-teaspoon pat of butter in the center of each, letting it begin to melt before swirling in 1 1/2 teaspoons cream and finishing with cilantro."
        ], 
        "date": "2017-03-06T12:59:06+00:00"
    }, 
    {
        "ingredient_list": [
            "2 lemons, halved", 
            "5 large artichokes (about 12 ounces each)", 
            "11/2 cups shelled fresh or frozen fava beans, or shelled frozen edamame", 
            "1/4 cup extra-virgin olive oil, plus more as needed", 
            "1 large onion, thinly sliced", 
            "1 sprig oregano, optional", 
            "2 ounces guanciale or pancetta, slivered", 
            "Salt", 
            "2 cups shelled (fresh or frozen) peas", 
            "1/4 cup chopped parsley", 
            "2 tablespoons chopped mint", 
            "* teaspoon lemon juice, plus more to taste", 
            "Freshly ground black pepper. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/box-one-of-two1.jpg?w=500", 
        "tags": [
            "Artichokes", 
            "Beans", 
            "Easter", 
            "Italian", 
            "Photo", 
            "Spring", 
            "Stew"
        ], 
        "url": "https://smittenkitchen.com/2007/06/box-one-of-two/", 
        "title": "spring vegetable stew", 
        "directions": [
            "1. To prepare the artichokes: Fill a large bowl halfway with cold water. Squeeze the lemons into the water and add the rinds to the bowl. Using a serrated knife, cut off the top third of an artichoke. Pull back and snap off the dark green, leafy blades, one by one, until only the pale yellow leaves remain. Using a paring knife, trim the artichoke bottom and stem to the pale green flesh, then cut it in half lengthwise. Drop into the water (to keep the artichoke from turning brown) and repeat with the remaining artichokes. Using a spoon, scoop out the prickly leaves and hairy choke. Cut each half into 4 wedges and return to the water until ready to use. ", 
            "2. If using fresh fava beans, bring a large pot of water to a boil. Fill a large bowl two-thirds full with ice water. When the water comes to a boil, add the beans and cook for 1 minute, then drain and immediately submerge the beans in the ice water. Peel the beans by gently tearing the pale skins and pinching at one end. Discard the skins, reserving the dark green interiors. ", 
            "3. To cook the ragout: Heat a 12-inch nonreactive pan over medium heat. Add 1/4 cup olive oil and when hot, add the onion, oregano (if using) and guanciale. Cook, stirring occasionally until the onion and guanciale are translucent, about 10 minutes. Drain artichokes and add to the pan, along with 2 cups water and 11/4 teaspoons salt. Bring the liquid to a boil, then reduce heat to a simmer and cook until artichokes are just tender, about 25 minutes. If using frozen favas, add them and cook for 2 minutes. If using fresh favas or frozen edamame, add them, along with the peas, and cook until warm and tender, about 5 minutes more. Remove the oregano sprig. Sprinkle in parsley and mint. Season with lemon juice, freshly ground black pepper and, if desired, additional salt. Drizzle with extra-virgin olive oil and serve."
        ], 
        "date": "2007-06-05T23:38:32+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound cucumbers, sliced 1/4-inch thick — “pickling” or kirby cucumbers work best here", 
            "1 large sweet onion, thinly sliced", 
            "1/4 cup Diamond Kosher salt [Updated: Why Diamond? Read this first.]", 
            "1/2 to 3/4 cups sugar (see note above)", 
            "1/2 cup distilled white vinegar", 
            "1/4 teaspoons ground turmeric", 
            "1 tablespoon mustard seeds", 
            "1 tablespoon coriander seeds (if ground, use 1 teaspoon)", 
            "1/4 teaspoon celery seed"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/bread-and-butter-pickles1.jpg?w=500", 
        "tags": [
            "Cucumber", 
            "Grilling", 
            "Photo", 
            "Pickled", 
            "Snack", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/06/bread-and-butter-pickles/", 
        "title": "bread and butter pickles", 
        "directions": [
            "In a medium bowl, combine the cucumbers, onion and salt. Mix well. Cover the mixture with ice. Let stand at room temperature for two hours. In a pot, bring sugar, vinegar and spices to a boil. Drain cucumbers and onions. Add to vinegar mixture and bring almost back to a boil. Remove from heat and cool. You can store the pickles in an airtight container for up to three weeks in the fridge. They will begin tasting pickled in just a couple hours."
        ], 
        "date": "2010-06-18T14:56:15+00:00"
    }, 
    {
        "ingredient_list": [
            "4 tablespoons unsalted butter", 
            "1 small onion, chopped small", 
            "1 garlic clove, minced", 
            "1/4 cup all-purpose flour", 
            "1 cup half-and-half", 
            "4 cups low-sodium vegetable or chicken broth (here’s my favorite chicken stock)", 
            "1 bay leaf", 
            "Kosher salt and freshly ground pepper", 
            "1 1/4 pounds broccoli or 4 cups broccoli florets and stems, chopped small", 
            "1 large carrot (about 6 ounces) or 2 slim ones, chopped tiny (1 cup)", 
            "8 ounces (about 2 1/2 cups) coarsely grated sharp cheddar cheese, plus a pinch extra for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/broccoli-cheddar-soup1.jpg?w=750", 
        "tags": [
            "Broccoli", 
            "Fall", 
            "Freezer Friendly", 
            "Photo", 
            "Soup", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/09/broccoli-cheddar-soup/", 
        "title": "broccoli cheddar soup", 
        "directions": [
            "Melt the butter in a large, heavy pot over medium heat. Add the onion and garlic and cook until tender, about 3 to 5 minutes. Stir in the flour and cook until golden, 3 to 4 minutes, then gradually whisk in the half-and-half until smooth. Add the chicken broth, bay leaf, salt and pepper and bring to a simmer. Reduce the heat to medium-low and cook, uncovered, stirring occasionally, until slightly thickened, about 10 minutes.", 
            "Add the broccoli and carrot to the broth mixture and simmer until tender, about 15 to 20 minutes. Discard the bay leaf and adjust seasoning if needed, but err on the cautious side with the salt because the cheese will add a bit. Puree the soup to your desired texture — I like mine fairly chunky, just lightly blended — with an immersion blender or in an upright one. Back on the stove, add cheese and whisk until melted, about 1 minute. ", 
            "Serve in bowls, garnished with a pinch of cheese. We like a hearty slice of grainy toasted bread on the side, for swiping."
        ], 
        "date": "2015-09-29T11:52:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound broccolini or regular broccoli", 
            "2 tablespoons olive oil", 
            "3 cloves garlic, minced", 
            "A few pinches red pepper flakes, to taste", 
            "Finely grated zest, then juice, of 1/2 lemon (juice before zesting only if you enjoy being grumpy)", 
            "Coarse salt, to taste", 
            "1/2 cup finely grated aged pecorino romano cheese", 
            "8 thin slices totally unfancy deli provolone", 
            "8 slices bread of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/broccoli-melts1.jpg?w=640", 
        "tags": [
            "Broccoli", 
            "Cheese", 
            "Photo", 
            "Sandwich", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/02/broccoli-melts/", 
        "title": "broccoli melts", 
        "directions": [
            "If using broccolini, cut it into 2-inch segments. If regular broccoli, peel the stems with a vegetable peeler first so that they cook evenly, and cut the rest into large chunks.", 
            "Pour about 1-inch puddle of salted water into a large sauté pan and bring to a boil. Add broccoli and cover with a lid and boil/steam for 2 minutes. Drain well and pat dry on paper towels, wringing out as much extra liquid as possible. Chop into small (roughly 1/2-inch) bits.", 
            "Wipe sauté pan dry and heat over medium. Add olive oil and let it heat for a full minute. Add garlic and pepper flakes, cooking for 1 minutes, or until the garlic is just beginning to turn golden. Add the broccoli and cook 1 to 2 minutes more, seasoning with salt. Transfer mixture to a bowl and add lemon zest, juice, pecorino and more salt and pepper flakes to taste.", 
            "Heat broiler. Arrange slices of bread on a tray and lightly toast on both sides. Scoop broccoli mixture onto each slice of bread, lay a slice of provolone over it and run under the broiler until cheese has melted and begun to blister. Eat. Repeat. Don’t forget to share, or at least hide the evidence if you decide not to."
        ], 
        "date": "2016-02-16T12:02:07+00:00"
    }, 
    {
        "ingredient_list": [
            "8 ounces (1 small-to-medium bundle, 225 grams) fresh broccoli (3 cups chopped)", 
            "1 large egg", 
            "1/2 cup (65 grams) all-purpose flour", 
            "1/3 cup (30 grams) finely grated parmesan cheese", 
            "1 small clove garlic, minced", 
            "1/2 teaspoon Kosher salt, plus more to taste", 
            "A pinch of red pepper flakes or several grinds of black pepper", 
            "Olive or vegetable oil for frying"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/broccoli-parmesan-fritters1.jpg?w=640", 
        "tags": [
            "Broccoli", 
            "Lunch", 
            "Pancakes", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Snack", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/06/broccoli-parmesan-fritters/", 
        "title": "broccoli parmesan fritters", 
        "directions": [
            "Prepare your broccoli: Separate the florets from the biggest stem(s). Cut the florets into 1-inch chunks. To prepare the stems, I like to peel them, as the skin can be thick and doesn’t cook quickly, then slice them into 1/2-inch lengths. You should have about 3 cups of chopped broccoli total.", 
            "Steam your broccoli until tender but not mushy: Use whatever method you prefer. My quickie, lazy method is to bring a 1/2-inch or so of water to a boil in a small saucepan, then add the broccoli, place a lid on it and simmer it for 5 to 6 minutes. Drain the broccoli, then set it aside to cool slightly.", 
            "In the bottom of a large bowl, lightly beat your egg. Add the flour, cheese, garlic, salt and pepper. Then, add the somewhat cooled broccoli and, using a potato masher, mash the broccoli just a bit. You’re looking to keep the bits recognizable, but small enough (1/4- to 1/2-inch chunks) that you can press a mound of the batter into a fritter in the pan. Once mashed a bit, stir or fold the ingredients together the rest of the way with a spoon. Adjust seasonings to taste.", 
            "Heat a large, heavy skillet over moderate heat. Once hot, add a good slick of oil (I usually use a mix of olive and vegetable oil), about 2 to 3 tablespoons. Once the oil is hot (you can test it by flicking a droplet of water into it; it should hiss and sputter), scoop a two tablespoon-size mound of the batter and drop it into the pan, then flatten it slightly with your spoon or spatula. Repeat with additional batter, leaving a couple inches between each. Once brown underneath, about 2 to 3 minutes, flip each fritter and cook on the other side until equally golden, about another 1 to 2 minutes.", 
            "Transfer briefly to paper towels to drain, then to a serving plate if you’ll be eating them shortly or a baking sheet in a 200 degree oven if you’d like to keep them warm for a while until needed. Repeat with remaining batter, adding more oil as needed. Serve with some of the suggestions listed in the head notes, above."
        ], 
        "date": "2012-06-12T12:25:02+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds mussels", 
            "1 cup white wine (they suggest 1/2 cup but I need more to steam that volume)", 
            "4 tablespoons butter, softened", 
            "1 handful fresh flat-leaf parsley leaves, minced", 
            "1 small clove garlic, minced", 
            "4 pinches smoked paprika (pimenton)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/broiled-mussels1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Seafood"
        ], 
        "url": "https://smittenkitchen.com/2010/12/broiled-mussels/", 
        "title": "broiled mussels", 
        "directions": [
            "Clean your mussels. There are a zillion ways to do this, this is mine: I put them in a big bowl of very cold water for about 10 minutes. This encourages them to expel their sand. Scoop them out (not dump, if you dump the sandy water over them, it defeats the purpose) one by one and scrub them under running water. Most cultivated mussels have the bissus (beard) removed but if one lingers, yank it toward the hinge (if you do it away from the hinge, it can kill the mussel prematurely) or cut it with a knife. Discard any mussels with chipped shells or that are not completely shut; they are more than likely dead and it’s not worth finding out if it may or may not make you sick, right?", 
            "Boil your wine in a medium pot. Add the mussels, cover and steam them open over high heat until they open. You can start checking at 3 minutes, but it can take up to 6. I like to use the lid and potholders and shake them around a little from time to time, to make sure they’re getting equal access to the wine and heat.", 
            "Once open, let the mussels cool. Twist off and discard one of the shells from each mussels (discard any that didn’t open), making sure that the remaining shell contains the mussel. Reserve the mussel broth for another use. Mash butter, parsley, garlic, pimenton and salt to taste in a small bowl and slather each mussel with the compound butter. Arrange them in a broiler-safe tray and chill them in the fridge until the butter is hard. [This is a great do-ahead interval, if you’d like to prepare these for when you entertain.]", 
            "Preheat the broiler (or your oven to 500, if you don’t have a broiler). Broil the mussels until the butter is bubbling hot, about 2 minutes (or up to 4 in an oven). Serve immediately, with crusty bread or my favorite, baked pommes frites."
        ], 
        "date": "2010-12-20T19:50:17+00:00"
    }, 
    {
        "ingredient_list": [
            "6 large eggs", 
            "12 small romaine lettuce leaves", 
            "2 to 3 tablespoons mayo (2 is suggested but 3 will make a creamier filling)", 
            "2 teaspoons smooth Dijon mustard", 
            "1/4 teaspoon Worcestershire sauce (optional)", 
            "1/2 teaspoon lemon juice", 
            "2 tablespoons chopped fresh flat-leaf parsley", 
            "Salt and freshly ground black pepper", 
            "1 tablespoon olive oil", 
            "1 anchovy fillet, minced", 
            "1 small clove garlic, minced", 
            "1/4 teaspoon grated lemon zest", 
            "1/4 cups (30 grams) panko bread crumbs", 
            "2 tablespoons freshly grated Parmesan cheese or more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/caesar-salad-deviled-eggs.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Easter", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2011/12/caesar-salad-deviled-eggs/", 
        "title": "caesar salad deviled eggs", 
        "directions": [
            "Place the eggs in a saucepan and cover with water. Bring to a boil over high heat. Once water begins to boil, reduce it to medium-low and simmer eggs for exactly 10 minutes. Drain eggs and cover with cold water. Sitting them in ice water will help the eggs chill more quickly.", 
            "Do ahead: As I discovered giving your eggs two to four days to rest in the fridge ensures that they peel more easily. If you’ve got time, do this now.", 
            "Arrange 12 small lettuce leaves on a serving platter. Carefully peel the eggs and cut in half lengthwise. Remove the yolks and place them in a small bowl. Arrange the whites on leaves. Mash the yolks with the mayo, Dijon, Worcestershire (if using), lemon juice and 1 tablespoon of the parsley until smooth. Season generously with salt and freshly ground black pepper. Set the filling aside.", 
            "In a small skillet, heat the olive oil over medium heat. Add the anchovy and garlic and cook, stirring, until the anchovy begins to dissolve into the oil, about 1 minute. Add the lemon zest and bread crumbs and saute them until golden, about 2 to 3 minutes. Stir in Parmesan and set crumbs aside.", 
            "When you’re ready to serve the eggs, spoon the yolk mixture back into the cavities of the egg whites, mounding it slightly in the center. (To make extra-cute eggs, you can pipe the filling with a star tip.) Sprinkle each egg with some of the crumb mixture (about 1 teaspoon), allowing some to spill onto the lettuce cups. Garnish with remaining chopped parsley and serve."
        ], 
        "date": "2011-12-12T13:57:38+00:00"
    }, 
    {
        "ingredient_list": [
            "Soup", 
            "2 tablespoons olive oil", 
            "2 pounds carrots, peeled, thinly sliced", 
            "1 large onion, finely chopped", 
            "4 regular or 6 small garlic cloves, peeled and smashed", 
            "1 tablespoon finely chopped or grated ginger, or more to taste (it could easily be doubled)", 
            "4 cups vegetable broth", 
            "1/4 cup white miso paste, or more to taste", 
            "To finish", 
            "Drizzle of toasted sesame oil", 
            "2 scallions, very thinly sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/carrot-soup-with-miso-and-sesame1.jpg?w=500", 
        "tags": [
            "Carrots", 
            "Gluten-Free", 
            "Photo", 
            "Quick", 
            "Soup", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/01/carrot-soup-with-miso-and-sesame/", 
        "title": "carrot soup with miso and sesame", 
        "directions": [
            "Heat oil in heavy large saucepan over medium heat. Add carrots, onion and garlic sauté until onion is translucent, about 10 minutes. Add broth and ginger. Cover and simmer until carrots are tender when pierced, stirring occasionally, about 30 minutes. ", 
            "Puree soup in batches in blender, or all at once with an immersion blender. In a small bowl, whisk together the miso an a half-cup of the soup. Stir the mixture back into the pot of soup. Taste the soup and season with salt, pepper or additional miso to taste.", 
            "Ladle into bowls and garnish each with a drizzle of sesame oil and small mound of scallions.", 
            "Pickled scallions? I didn’t do this in the end, but was tempted to lightly pickled the scallions by letting them hang out in a mixture of 6 tablespoons rice vinegar, 2 tablespoons water, 1 tablespoon of Kosher salt (I use Diamond brand, use less if you’re using Morton or another, which are more dense) and 1 1/2 teaspoons sugar for a while before using them as garnish. "
        ], 
        "date": "2012-01-03T10:41:23+00:00"
    }, 
    {
        "ingredient_list": [
            "Soup", 
            "2 tablespoons (30 ml) olive oil", 
            "2 pounds (905 grams) carrots, peeled, diced or thinly sliced", 
            "1 large onion, finely chopped", 
            "4 regular or 6 small garlic cloves, peeled and smashed", 
            "1/4 teaspoon ground coriander", 
            "1/2 teaspoon ground cumin", 
            "1/2 teaspoon table salt, plus more if needed", 
            "Pinch of Aleppo pepper or red pepper flakes", 
            "4 cups (945 ml) vegetable broth", 
            "Crisped chickpeas", 
            "1 3/4 cups cooked chickpeas, or 1 15-ounce (425-gram) can, drained, patted dry on paper towels", 
            "1 generous tablespoon (15 ml or so) olive oil", 
            "1/2 teaspoon coarse salt", 
            "1/4 teaspoon ground cumin", 
            "Lemon-tahini dollop", 
            "3 tablespoons (25 grams) tahini paste", 
            "2 tablespoons (30 ml) lemon juice", 
            "Pinch or two of salt", 
            "2 tablespoons (30 ml) water", 
            "Pita wedges, garnish", 
            "A few large pitas, cut into 8 wedges", 
            "Olive oil, to brush pitas", 
            "Za’atar (a Middle Eastern spice-herb blend) or sesame seeds and sea salt to sprinkle", 
            "2 tablespoons flat-leaf parsley, coarsely chopped"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/carrot-soup-with-tahini-and-crisped-chickpeas1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Carrots", 
            "Gluten-Free", 
            "Soup", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/01/carrot-soup-with-tahini-and-crisped-chickpeas/", 
        "title": "carrot soup with tahini and crisped chickpeas", 
        "directions": [
            "Heat two tablespoons olive oil in heavy large pot over medium heat. Add carrots, onion, garlic, coriander, cumin, salt and pepper flakes and sauté until they begin to brown, about 15 minutes. ", 
            "Meanwhile, heat your oven to 425 degrees F. Toss chickpeas with one tablespoon olive oil, salt and cumin until they’re all coated. Spread them on a baking sheet or pan and roast them in the oven until they’re browned and crisp. This can take anywhere from 10 to 20 minutes, depending on the size and firmness of your chickpeas. Toss them occasionally to make sure they’re toasting evenly.", 
            "Once vegetables have begun to brown, add broth, using it to scrape up any bits stuck to the bottom of the pot. Cover pot with lid and simmer until carrots are tender, stirring occasionally, about 30 minutes. ", 
            "Meanwhile, in a small dish, whisk together tahini, lemon juice, salt and water until smooth with a yogurt-like consistency. If more liquid is needed to thin it, you can add more lemon juice or water, a spoonful at a time, until you get your desired consistency.", 
            "Spread pita wedges on a second baking sheet and brush lightly with olive oil. Sprinkle with za’atar or a combination of sea salt and sesame seeds and toast in oven with chickpeas until brown at edges, about 5 minutes.", 
            "Puree soup in a blender or with an immersion blender until smooth. Ladle into bowls. Dollop each with lemon-tahini, sprinkle with crisped chickpeas and garnish with chopped parsley. Serve with pita wedges. Forget January, you’d eat this anytime. Right?"
        ], 
        "date": "2013-01-03T12:24:36+00:00"
    }, 
    {
        "ingredient_list": [
            "6 cups canned low-salt chicken broth", 
            "3 1/2 tablespoons butter", 
            "1 1/2 tablespoons olive oil", 
            "2 large shallots, chopped", 
            "2 cups arborio rice or medium-grain white rice", 
            "1/4 cup dry white wine", 
            "1 cup freshly grated Parmesan cheese (about 3 ounces)", 
            "2 tablespoons chopped fresh parsley", 
            "2 tablespoons fresh lemon juice", 
            "4 teaspoons grated lemon peel"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/catch-up-solstice-edition1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Fruit", 
            "Grain/Rice", 
            "Italian", 
            "Lemon", 
            "Photo", 
            "Seafood"
        ], 
        "url": "https://smittenkitchen.com/2007/06/catch-up-solstice-edition/", 
        "title": "lemon risotto", 
        "directions": [
            "Bring broth to simmer in large saucepan over medium heat. Reduce heat to low; cover to keep warm. Melt 1 1/2 tablespoons butter with oil in heavy large saucepan over medium heat. Add shallots and saute until tender, about 6 minutes. Add rice; stir 1 minute. Add wine and stir until evaporated, about 30 seconds. Add 1 1/2 cups hot broth; simmer until absorbed, stirring frequently. Add remaining broth 1/2 cup at a time, allowing broth to be absorbed before adding more and stirring frequently until rice is creamy and tender, about 35 minutes. Stir in cheese and remaining 2 tablespoons butter. Stir in parsley, lemon juice, and lemon peel. Season risotto with salt and pepper. Transfer to bowl and serve."
        ], 
        "date": "2007-06-21T23:18:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 small head cauliflower (1 pound florets, i.e. stems and leaves removed), cut into generous 1 to 2 inch chunks", 
            "1 large egg", 
            "1 garlic clove, minced", 
            "Few gratings of fresh lemon zest", 
            "3 ounces crumbled feta (about 1/2 cup)", 
            "1/2 cup all-purpose flour", 
            "1/4 teaspoon Aleppo pepper flakes; less if using regular red pepper flakes, which are hotter", 
            "3/4 teaspoon table salt or more to taste", 
            "1/2 teaspoon baking powder", 
            "Olive oil for frying", 
            "To serve", 
            "3/4 cup yogurt", 
            "1/2 teaspoon ground cumin", 
            "Salt and pepper to taste", 
            "Handful pomegranate arils"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/12/cauliflower-feta-fritters-with-pomegranate.jpg?w=751", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cauliflower", 
            "Lunch", 
            "Photo", 
            "Pomegranate", 
            "Snack", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/12/cauliflower-feta-fritters-with-pomegranate/", 
        "title": "cauliflower-feta fritters with pomegranate", 
        "directions": [
            "Cook cauliflower in simmering salted water, uncovered, until tender, about 5 to 6 minutes, until firm but tender. Using a slotted spoon, transfer to a bowl of ice water to stop cooking. Drain well. Spread on towels to dry as much as possible.", 
            "In the bottom of a large bowl, whisk together egg, garlic and lemon zest. Add cauliflower florets and mash with a potato masher until they’re crushed into an average of pea-sized pieces (i.e. some will be bigger, some smaller, but most will be little nubs). Sprinkle in feta and stir to combine egg mixture, cauliflower and feta. In a small dish, whisk flour, salt, pepper and baking powder until evenly combined. Sprinkle over cauliflower batter and stir just until combined.", 
            "Heat oven to 200 degrees F and place a tray inside. On the stove, heat a large, heavy skillet over moderate heat. Once hot, add a good slick of oil, about 2 to 3 tablespoons. Once the oil is hot (you can test it by flicking a droplet of water into it; it should hiss and sputter), scoop a two tablespoon-size mound of the batter and drop it into the pan, then flatten it slightly with your spoon or spatula. Repeat with additional batter, leaving a couple inches between each. Once brown underneath, about 2 to 3 minutes, flip each fritter and cook on the other side until equally golden, about another 1 to 2 minutes.", 
            "Transfer briefly to paper towels to drain, then the tray in the oven to keep them warm until needed. Once all fritters are cooked, mix yogurt with cumin, salt and pepper. Spread fritters on serving platter. Dollop each with cumin yogurt and sprinkle with pomegranate arils.", 
            "Do ahead: Fritters both freeze and reheat well. To warm and recrisp them, lay them on a tray and toast them at 400 degrees in the oven until crisp again."
        ], 
        "date": "2012-12-04T10:13:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound Swiss chard (can also swap kale, spinach or another green), ribs and stems removed and cleaned", 
            "3 tablespoons olive oil", 
            "1 cup (5 1/4 ounces) chopped carrots", 
            "1 cup (5 ounces) chopped celery", 
            "1 cup (4 1/4 ounces) chopped shallots, about 4 medium", 
            "2 garlic cloves, finely chopped", 
            "1 cup dry white wine", 
            "2 15-ounce cans (or about 3 3/4 cups) white beans, drained and rinsed", 
            "2 cups (or more to taste) vegetable broth", 
            "1 cup pureed tomatoes (from a can/carton/your jarred summer supply)", 
            "Salt and freshly ground black pepper", 
            "3 fresh thyme sprigs", 
            "1 bay leaf", 
            "1 tablespoon sherry vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/01/chard-and-white-bean-stew.jpg?w=750", 
        "tags": [
            "Beans", 
            "Budget", 
            "Freezer Friendly", 
            "Gluten-Free", 
            "Photo", 
            "Put An Egg On It", 
            "Stew", 
            "Swiss Chard", 
            "Vegan", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/01/chard-and-white-bean-stew/", 
        "title": "chard and white bean stew", 
        "directions": [
            "Toasted bread slices, poached eggs (tutorial), chopped herbs such as tarragon, parsley or chives or grated Parmesan or Romano to serve (optional)", 
            "Bring medium pot of salted water to boil. Cook chard (or any heavier green; no need to precook baby spinach) for one minute, then drain and squeeze out as much extra water as possible. Coarsely chop chard.", 
            "Wipe out medium pot to dry it, and heat olive oil over medium. Add carrots, celery, shallots and garlic and saute for 15 minutes. Barber warns not to brown them but I didn’t mind a light golden color on them. Add wine (scraping up any bits that have stuck to the pot) and cook it until it reduced by three-fourths. Add beans, broth, tomatoes, a few pinches of salt, freshly ground black pepper, thyme and bay leaf and bring to a boil. Reduce heat to medium-low and simmer for 20 minutes. Add chard and cook for 5 minutes more. Remove thyme and bay leaf. Add more broth if you’d like a thinner stew and adjust salt and pepper to taste.", 
            "Serve as is drizzled with sherry vinegar. Or you can ladle the stew over thick piece of toasted country bread or baguette that has been rubbed lightly with half a clove of garlic, top that with a poached egg and a few drops of sherry vinegar and/or some grated cheese. "
        ], 
        "date": "2011-01-04T09:55:42+00:00"
    }, 
    {
        "ingredient_list": [
            "2 small or 1 large fresh poblano chiles", 
            "1 small head cauliflower, cored and cut into rough 1-inch chunks", 
            "Salt and freshly ground black pepper to taste", 
            "3 tablespoons olive oil, plus more for cooking quesadillas", 
            "3 scallions, thinly sliced", 
            "1 tablespoon lime juice", 
            "2 cups (about 8 ounces) coarsely grated monterey jack cheese", 
            "12 small (7-inch) flour tortillas", 
            "1/2 cup sour cream or Mexican crema", 
            "A few gratings fresh lime zest", 
            "1 tablespoon freshly squeezed lime juice", 
            "1/2 teaspoon ground cumin", 
            "Pinch of salt", 
            "1 bag coleslaw mix or (as used here) 3 cups finely shredded red cabbage and 1 coarsely grated carrot", 
            "Coarse salt", 
            "Juice of half a lime", 
            "2 scallions, sliced thin", 
            "A dollop of mayonnaise, sour cream or plain yogurt", 
            "A dash of hot sauce (optional)", 
            "1/4 cup roughly chopped cilantro or flat-leaf parsley leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/charred-cauliflower-quesadillas1.jpg?w=751", 
        "tags": [
            "Cauliflower", 
            "Peppers", 
            "Photo", 
            "Sandwich", 
            "Tex-Mex", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2015/02/charred-cauliflower-quesadillas/", 
        "title": "charred cauliflower quesadillas", 
        "directions": [
            "Toss cabbage mix, salt and lime together in a large bowl; set aside for 5 minutes. It will shrink down a bit. Stir in scallions, then mayo and hot sauce. Adjust seasonings/ingredients to taste, then stir in cilantro leaves. Serve alongside quesadillas or any of your favorite tortilla-clad meals. "
        ], 
        "date": "2015-02-02T11:54:41+00:00"
    }, 
    {
        "ingredient_list": [
            "Bread", 
            "4 tablespoons (55 grams) unsalted butter", 
            "1/4 cup plus 1/3 cup beer (140 ml), preferably dark but really, use whatever you like to drink", 
            "2 1/2 cups (315 grams) all-purpose flour, divided", 
            "1/3 cup (40 grams) rye flour (use additional a-p flour if you don’t have this)", 
            "2 tablespoons (25 grams) granulated sugar", 
            "2 1/4 teaspoons (1 envelope, 1/4 ounce or 7 grams) instant yeast", 
            "1 teaspoon (6 grams) table salt", 
            "2 large eggs, at room temperature", 
            "Filling", 
            "3 tablespoon (42 grams) unsalted butter", 
            "1 tablespoon (15 grams) Dijon or a mustard of your choice", 
            "1 1/2 teaspoons (8 ml) Worcestershire sauce", 
            "Dash of hot sauce", 
            "1 teaspoon (3 grams) mustard powder", 
            "1 teaspoon (2 grams) paprika", 
            "1/2 teaspoon (3 grams) table salt", 
            "Several grinds black pepper", 
            "1 1/2 cups (170 grams) shredded cheddar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cheddar-beer-and-mustard-pull-apart-bread1.jpg?w=500", 
        "tags": [
            "Bread", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2012/02/cheddar-beer-and-mustard-pull-apart-bread/", 
        "title": "cheddar, beer and mustard pull-apart bread", 
        "directions": [
            "Make dough: In a small saucepan, heat the 4 tablespoons butter and 1/4 cup of beer, just until the butter has melted. Remove from heat and add the remaining 1/3 cup beer. Set aside to cool down slightly. You want the mixture warm (110 to 116 degrees), but not steaming hot. ", 
            "Meanwhile, in the bowl of a stand mixer, stir together 2 cups of the all-purpose flour, sugar, yeast and table salt.  With the mixer on low, pour in the butter-beer mixture, mixing only until the flour is moistened. Add eggs, one at a time, and mix until combined. The batter will look lumpy, but will become smooth in a moment. Add the remaining 1/2 cup all-purpose flour and all of the rye flour, mixing until just combined. Replace paddle with a dough hook and let the machine knead the dough for 3 to 4 minutes on low. ", 
            "Oil a medium/large bowl and transfer dough to it. Cover loosely with plastic wrap and set aside for 50 to 60 minutes, until doubled. Meanwhile, prepare fillings. ", 
            "[Do ahead: You can also rest the dough in the fridge overnight — wrapped tightly with plastic. The next day, let it rest at room temperature for an hour before rolling out.]", 
            "Make fillings: Back in the same small saucepan you used for the butter and beer, melt the 3 tablespoons butter. Remove from heat and whisk in mustard, Worcestershire and hot sauce until smooth. Set aside.", 
            "In the bottom of a medium bowl, stir together mustard powder, paprika, table salt and several grinds of black pepper. Add shredded cheddar and toss until grated strands are evenly coated with spices. I like to keep this in the fridge until needed so it doesn’t get soft and clumpy, making it harder to sprinkle over the dough in a bit.", 
            "Assemble bread: Either coat a 9-by-5 loaf pan lightly with butter or a nonstick spray and set aside. ", 
            "Turn dough out onto a well-floured counter and roll the dough into a 20-by-12-inch rectangle, making sure it doesn’t stick to the counter by lifting sections and re-flouring the counter as needed. Brush the butter-mustard-Worcestershire mixture evenly over the whole surface, right up to the edges. Cut the dough crosswise into 5 strips; each should be 12-by-4 inches.  Sprinkle the first one evenly with a heaping 1/4 cup of the grated cheese (which is now fine to leave out at room temperature). Gently place another strip on top of it, coat it with another heaping 1/4 cup of cheese, and repeat with remaining strips until they are stacked 5-high and all of the cheese is used.", 
            "With your very sharpest serrated knife, gently — so gently! The lightest sawing motions the weight of the blade will allow! — cut your stack into 6 to 7 2-inch segments (each stacked segment should be 4-by-2 inches). I say 6 to 7 range because while your 12-inch length should clearly yield only 6 2-inch segments, I find that the soft dough stretches so much when you lift and stack it that I end up with 7. Either amount will fit; this is totally not something to fret over.", 
            "Arrange stacks of dough down the length of your prepared loaf pan as if filling a card catalog drawer. I make this easier by standing my loaf pan up on its short end to make the next part easier. If, when you finish filing all of your dough stacks, you ended up with less than needed for the dough “cards” to reach the end of the pan, when you return the pan to rest flat on the counter again, just shimmy it a little so the dough centers. It will all even out in the final rise/oven. If you ended up with too many dough cards, before you add the last stack, simply press gently on the dough already filed to make room for it.  ", 
            "Loosely cover the pan with more plastic wrap and set it aside to rise again for 30 to 45 more minutes. Meanwhile, preheat your oven to 350 degrees.", 
            "Bake loaf for 25 to 35 minutes, until puffed and brown. Transfer it to a wire rack and let it cool for 5 minutes before flipping it out onto a serving plate/cutting board. Serve warm with cold beer. ", 
            "Loaf “pulls” apart the easiest when it is hot or warm. If it has cooled beyond the point that the layers wish to easily separate, simply serve it in thin slices. Wrap leftovers in plastic and keep at room temperature for a day. I bet the leftovers would be fantastic reheated with scrambled eggs.  "
        ], 
        "date": "2012-02-03T22:40:51+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds boneless skinless chicken parts, cut into 3 to 4 large chunks (I use a 50/50 mix of breasts and thighs)", 
            "1 small yellow onion, chopped small", 
            "2 large garlic cloves, minced", 
            "1 tablespoon ground cumin", 
            "1 1/2 teaspoons dried oregano", 
            "2 teaspoons fine sea salt", 
            "Heat via 1 to 2 jalapenos or other fresh hot pepper, minced, or a ground chili powder of your choice, to taste", 
            "1 28-ounce can crushed tomatoes, fire-roasted if you can find them or 2 10-ounce cans Ro-Tel (yield is a little less but not noticeable in final chili)", 
            "2 2/3 cups small dried beans (I use half black beans, half small red beans; I do not presoak but do read the updated note up top; read the note at the bottom if you’re using kidney beans)", 
            "5 1/3 cups water (can replace all or part with broth)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/chicken-chili1.jpg?w=640", 
        "tags": [
            "Beans", 
            "Gluten-Free", 
            "Photo", 
            "Slow Cooker", 
            "Stew", 
            "Tex-Mex", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/01/chicken-chili/", 
        "title": "chicken chili", 
        "directions": [
            "To serve: Lime wedges, sour cream or Mexican crema, finely chopped white onion or thinly sliced scallion, chopped cilantro, corn or flour tortilla chips, and hot sauce", 
            "(I have always wanted to write recipe instructions just like this!) Throw everything in the pot and turn the heat on:", 
            "To finish: The chicken will likely have fallen apart, but you can help it along by reaching into the pot with two forks and shredding it to your desired texture. Taste and adjust seasonings. Serve with fixings of your choice.", 
            "P.S. We like this with baked tortilla chips. I estimate two small corn tortillas per person and cut them into 8 wedges. Brush a large baking sheet lightly with olive oil, arrange tortilla wedges in one layer, lightly dab the tops with more olive oil and sprinkle with fine salt. Bake at 350 for 10 minutes, check for color, and add more baking time as needed until they’re golden and crisp.", 
            "A note about kidney beans: I do not use kidney beans here, but small red ones, and I do not presoak my beans however if you are using red kidney beans, do keep in mind that due to a pathogen known as phytohaemagglutinin the FDA advises people who wish to use kidney beans in slow-cookers to first soak the beans for at least 5 hours, dump the water, boil them in fresh water for 10 minutes and then continue with the recipe. As your beans will have soaked up more liquid before they go in, you will find you need less to cook them in for the final chili. In terms of how freaked out you should be over kidney beans, from the FDA website: “Reports of this syndrome in the United States are anecdotal and have not been formally published.” And that this was mostly a concern reported in the last 70s in the UK. "
        ], 
        "date": "2016-01-04T11:45:09+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon vegetable oil", 
            "1 large onion, chopped", 
            "3-pound chicken, in parts or 3 pounds chicken pieces of your choice", 
            "8 cups water", 
            "1 bay leaf", 
            "2 teaspoons table salt", 
            "Freshly ground black pepper", 
            "1 large carrot, diced (1/3-inch)", 
            "1 medium parsnip, diced (1/3-inch) (optional)", 
            "1 large celery stalk, diced (1/3-inch)", 
            "3 ounces dried egg noodles, I prefer wide ones", 
            "1 tablespoon chopped fresh dill or flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/chicken-noodle-soup1.jpg?w=640", 
        "tags": [
            "Chicken", 
            "Fall", 
            "Pasta", 
            "Photo", 
            "Soup", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2012/10/chicken-noodle-soup/", 
        "title": "chicken noodle soup", 
        "directions": [
            "Prepare broth: In a large (5-quart) heavy pot over medium-high heat, heat the vegetable oil. Add the onion and saute it for 3 to 4 minutes, until beginning to take on color at edges. Add the chicken pieces (if too crowded, can do this in two batches), making little wells in the onions so that the parts can touch the bottom of the pan directly. Cook chicken parts until lightly browned, about 10 minutes. ", 
            "Add water, bay leaf, table salt and some freshly ground black pepper and bring the mixture to a boil. Reduce the heat to a simmer and skim any (sorry for lack of better term) scum that appears at the surface of the pot. Simmer pot gently, partially covered, for 20 minutes. ", 
            "Transfer chicken parts to a plate to cool a bit before handling. Set a fine-mesh strainer over a bowl (ideally, with a spout) and pour soup through it. ", 
            "If your pot looks grimy and you’re fanatical about having a clear soup, you can give it a quick wash before returning the broth to the pot. You can remove a bit of fat at this point, if it looks necessary. Bring the broth back to a simmer. ", 
            "You may be tempted at this point to taste it and add more salt. I know this because I do it every single time, adding another teaspoon, and every. single. time. I regret this as it is too salty in the end. So, proceed with any re-seasoning with caution.", 
            "To finish and serve: Add diced vegetables and simmer them until they’re firm-tender, about 5 minutes. Add dried noodles and cook them according to package directions, usually 6 to 9 minutes. While these simmer, remove the skin and chop the flesh from a couple pieces of chicken, only what you’re going to use. You won’t need all of it in the soup. I usually use the breasts first because they’re my least favorite and benefit the most from the extra moisture of the soup. The remaining parts can be slipped into an airtight bag in the fridge (I recommend leaving the skin on for retained moisture until needed) and used for chicken salad or the like over the next few days.", 
            "Once noodles have cooked, add chicken pieces just until they have rewarmed through (30 seconds) and ladle into serving bowls. Garnish with dill or parsley, dig in and let it fix everything that went wrong with your day.", 
            "Do ahead: If planning ahead, the point where you strain your chicken broth is a great place to pause. Refrigerate the chicken broth until the next day. Before heating it and finishing the recipe, you can easily remove any solidified fat from the surface for a virtually fat-free soup. Then, you can cook the vegetables and noodles to order, adding the chicken only so that it can rewarm (and not overcook!). If making the broth more than a day in advance, you might as well freeze it. I recommend freezer bags with as much air as possible pressed out. Freezing the bags flat will make it easier to stack and store with other frozen soups, and the bag will only require a short soak in warm water to defrost."
        ], 
        "date": "2012-10-10T11:26:11+00:00"
    }, 
    {
        "ingredient_list": [
            "Broth", 
            "2 unpeeled yellow onions, quartered", 
            "Three 1/2-inch-thick slices of unpeeled fresh ginger, smashed", 
            "4 quarts cold water", 
            "3 pounds chicken bones or chicken wings", 
            "One fresh 3 1/2-pound chicken, quartered", 
            "1 tablespoon kosher salt", 
            "2 teaspoons sugar", 
            "Additional spices (optional): Cinnamon, star anise, black cardamoms, coriander seeds, fennel seeds or cloves", 
            "1/4 cup Asian fish sauce", 
            "1 pound dried rice noodles, a linguine shape (bánh phở) if you can find them", 
            "Garnishes", 
            "1 large scallion, thinly sliced", 
            "1 pound mung bean sprouts", 
            "1/2 cup torn basil leaves, Thai basil if you can find it", 
            "1/2 cup cilantro leaves", 
            "2 limes, cut into wedges", 
            "2 jalapeños, thinly sliced", 
            "Asian chili-garlic sauce", 
            "Hoisin sauce", 
            "Crispy shallots, recipe follows", 
            "2 cups thinly sliced shallots (about 4 large shallots)", 
            "2 cups canola oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/chicken-pho1.jpg?w=640", 
        "tags": [
            "Chicken", 
            "Gluten-Free", 
            "Photo", 
            "Soup", 
            "Vietnamese"
        ], 
        "url": "https://smittenkitchen.com/2014/01/chicken-pho/", 
        "title": "chicken phở", 
        "directions": [
            "In a small saucepan or large heavy skillet, heat the oil over medium-high until it registers 275°F on a deep-fry or candy thermometer. Add the shallots and cook, stirring frequently as they’ll want to cook unevenly, until light golden brown, about 4 to 8 minutes, depending on their thickness. Transfer to a paper towel-lined plate to drain.", 
            "Increase the heat to high and place a fine-mesh sieve over a heatproof bowl. When the oil registers 375°F on the deep-fry or candy thermometer, add return the fried shallots to the oil and cook just until they are crispy and well-browned, about 5 seconds, watching carefully so the shallots don’t burn.", 
            "Pour the oil and shallots through the sieve to immediately stop the cooking, then transfer to shallots to a paper towel-lined plate to drain. Sprinkle with salt to season. Reserve the oil for another use. The shallots will keep, stored in an airtight container, for 1 day, but they’re best the day they are made."
        ], 
        "date": "2014-01-13T12:34:34+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 pound ground chicken", 
            "1 teaspoon soy sauce", 
            "3/4 teaspoon kosher salt", 
            "1 1/2 teaspoons toasted sesame oil", 
            "1 1/2 teaspoons grated fresh ginger", 
            "3 tablespoons minced garlic chives, regular chives or scallions", 
            "Ground white pepper, to taste", 
            "50 wonton wrappers (about 12 ounces), thawed if frozen, thinnest ones you can find", 
            "Cornstarch, to prevent sticking", 
            null, 
            "A 3-inch piece of ginger, peeled and sliced", 
            "2 large garlic cloves, crushed", 
            "1 bundle scallions, to be used here and to finish", 
            "Soy sauce or salt, to taste", 
            "3 ounces baby spinach leaves (a few handfuls)", 
            "Toasted sesame oil and soy sauce, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/01/chicken-wonton-soup.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Chinese", 
            "Photo", 
            "Soup", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2017/01/chicken-wonton-soup/", 
        "title": "chicken wonton soup", 
        "directions": [
            "Make your filling: Combine chicken, soy sauce, salt, sesame oil, ginger, chives and pepper in a bowl with a fork. If you’d like to test for seasoning, put a tiny dab in a microwave-safe bowl or plate and cook for 10 very splattery seconds. Adjust flavors as desired.\nForm your wontons: Place a few wontons wrappers on your counter. Cover the remaining ones with a piece of plastic wrap. Place 1 heaped teaspoon (from a measuring spoon set) in the center. Use your fingers dipped in water to dampen the edges. Fold one corner diagonally across to the other, pressing air out as you seal it shut. Then, bring the two corners on the wide side of the triangle down below it and use a dab of water to seal them shut. You’re not trying to pull the corners across the belly, but pointing downward. Lightly sprinkle a big plate with cornstarch and place form wontons on it. Repeat with remaining wontons. I found that after I’d made a couple and got the hang of it, I could lay out 6 at a time and get each batch of 6 done in 2 minutes, meaning that this process took me about 20 minutes total.\nFix up your stock (optional): While you’re forming wontons, should you want to enhance your stock (see note up top first), chop the white and light green parts of your scallions into 1/2- to 1-inch segments. Cut dark green tops into thin slivers and save for garnish later. Place stock in 3 to 4-quart pot with sliced ginger, the white and light green scallions you’ve just chopped, garlic and soy sauce or salt, as needed, to season. Simmer them together for 20 minutes while you make the wontons, then strain out the ginger, scallions and garlic.", 
            "Cook the wontons: Once your wontons are formed, you can cook them right in the simmering broth or you can do so in simmering water — the latter is better so that the cornstarch on the wrappers doesn’t make the soup cloudy. Boil wontons for 3 minutes to cook them inside; this is really all it takes, but if you’re nervous, cut one in half to make sure.\nTo finish soup: Add spinach to simmering broth and let cook for one minute, until softened. Add cooked wontons to broth and let them warm through again for 30 seconds. Ladle wontons and soup into bowls. I used about 1 1/4 cups broth and 6 wontons per serving. Drizzle each dish with a little toasted sesame oil, a bit of soy sauce (if desired) and scatter with reserved dark green scallion tops. Dig in.\nDo ahead: Wontons can be formed and refrigerated for a day, or frozen for a month or longer."
        ], 
        "date": "2017-01-06T13:17:38+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups (10 ounces or 285 grams) hazelnuts", 
            "3 1/2 cups (830 grams) water, plus more for soaking", 
            "1 1/4 cups (7 1/2 ounces 215 grams) semisweet chocolate chips or rough-chopped chocolate", 
            "Sugar or a sweetener to taste (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/chocolate-and-toasted-hazelnut-milk1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Drinks", 
            "Photo", 
            "Snack", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2014/09/chocolate-and-toasted-hazelnut-milk/", 
        "title": "chocolate and toasted hazelnut milk", 
        "directions": [
            "Heat oven to 350 degrees F. Spread hazelnuts on a tray and bake for 10 minutes, then toss them around and return them to the oven for another 2 to 5 minutes, until they’re fragrant and golden brown under their skins. Let cool to lukewarm. Place in a large bowl or jar and cover with an inch or so of water. Let soak overnight or up to two days at room temperature.", 
            "Drain hazelnuts and rinse, then place in a food processor or blender. (If you have both, I’d opt for the blender.) Add 3 1/2 cups water and blend for longer than seems necessary to puree them. Set a mesh strainer over a large bowl. Line it with a fine-mesh cheesecloth such as butter muslin or nut milk bag or a lint-free dish towel, leaving overhang so that you’ll have enough cloth to wring the mixture out in a few minutes.", 
            "Pour blended hazelnut mixture through cloth; you can use a spoon to stir it and help it along. When you’ve got mostly semi-solids left in the cloth, pull up the sides and use it to wring what you can from the hazelnuts.* What’s in your bowl is now the toasted hazelnut milk.", 
            "In a large saucepan or microwave-safe bowl, melt your chocolate halfway, then stir it off the heat until it it finishes melting. Whisk in 1 cup toasted hazelnut milk, at first one teaspoon at at time and then in a thin stream until you have a smooth chocolate-hazelnut sauce. Whisk this into the remaining toasted hazelnut milk. Chill until needed.", 
            "Do ahead: I’ve read that nut milks only keep for two days, but could this be true? I would have guessed a week. I will update this with a firmer estimate once I learn/experiment more.", 
            "* What to do with the leftover nut meal? I’ve seen suggestions to toast it in a pan to dry it out and then add the nut meal to baked goods and/or granola. Let me know if you have a creative use for it."
        ], 
        "date": "2014-09-05T11:14:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/4 cups (100 grams) rolled oats (be sure that they’re labeled gluten-free if needed; I prefer old-fashioned but any will work)", 
            "1/4 cup (20 grams) rolled oats, finely ground, or 1/4 cup oat flour", 
            "3/4 cup (60 grams) dried unsweetened shredded coconut (I used a medium grind)", 
            "1/3 cup (65 grams) uncooked millet (see alternatives up top)", 
            "1/2 teaspoon fine sea salt", 
            "1/4 teaspoon ground cinnamon (optional)", 
            "1 cup (about 140 grams) chopped dried fruit", 
            "1 cup (170 grams) chopped dark chocolate or chocolate chips", 
            "1/4 cup (65 grams) sunflower seed butter", 
            "1/4 cup olive oil or coconut oil, warmed until liquefied", 
            "1/4 cup (about 85 grams) maple syrup, honey or golden syrup"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/06/chocolate-chunk-granola-bars1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Dairy-Free", 
            "Freezer Friendly", 
            "Gluten-Free", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2015/06/chocolate-chunk-granola-bars/", 
        "title": "chocolate chunk granola bars", 
        "directions": [
            "Heat oven to 350°F (175°C). Line an 8-by-8 inch square pan with two sheets of parchment paper, extending each up two sides, forming a “sling” for your bars to make them easy to remove.", 
            "In a large bowl, combine oats, oat flour or ground oats, coconut, millet, salt, cinnamon (if using), dried fruit and chocolate. In a separate, small bowl, whisk together sunflower seed butter, oil and sweetener of choice until smooth. Pour wet mixture into dry and stir until combined. Transfer to prepared pan, spreading until flat, then use an addition square of parchment paper to protect your hand as you press, press, press the ingredients tightly into all corners of the pan, until they can be pressed no flatter.", 
            "Bake for 25 to 30 minutes, until the tops are golden and the edges are light brown. Let cool completely before cutting; they’ll be even easier to cut without crumbling if you chill them in the fridge first, so feel free to cool them there. Once cool, use the parchment “sling” to lift bars from pan and transfer to cutting board. Use a sharp, serrated knife in a very gentle sawing motion to cut bars into desired sizes (I usually go for 16 2×2-inch squares). ", 
            "Bars will keep at room temperature for up to a week in an airtight container, but I prefer to freeze them, individually wrapped, until needed. They only need to be out of the freezer for about an hour to fully defrost. "
        ], 
        "date": "2015-06-25T11:25:21+00:00"
    }, 
    {
        "ingredient_list": [
            "2 (28-ounce) cans whole tomatoes packed in juice, drained, 3 cups juice reserved", 
            "1 1/2 tablespoons dark brown sugar", 
            "4 tablespoons unsalted butter", 
            "4 large shallots, minced (about 1/2 cup)", 
            "1 tablespoon tomato paste", 
            "Pinch ground allspice", 
            "2 tablespoon all-purpose flour", 
            "1 3/4 cups chicken stock, homemade or canned low-sodium", 
            "1/2 cup heavy cream", 
            "2 tablespoons brandy or dry sherry", 
            "Salt and cayenne pepper", 
            "3 ounces cheese (preferably mild cheddar) or combination of cheese, grated on large holes of box grater (about 3/4 cup)", 
            "4 slices (1/2 inch-thick) from white sandwich bread, such as Pepperidge Farm Toasting White", 
            "2 tablespoons butter (preferably salted), melted"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/come-on-thunder1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Sandwich", 
            "Soup", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2006/11/come-on-thunder/", 
        "title": "classic grilled cheese + cream of tomato soup", 
        "directions": [
            "1.\tHeat heavy 12-inch skillet over low to medium-low heat. Meanwhile, sprinkle a portion of cheese over two bread slices. Top each with a remaining bread slice, pressing down gently to set. ", 
            "2.\tBrush sandwich tops completely with half of melted butter; place each sandwich, buttered-size down, in skillet. Brush remaining side of each sandwich completely with remaining butter. Cook until crisp and deep golden brown, 5 to 10 minutes per side, flipping sandwiches back to first side to reheat and crisp, about 15 seconds. Serve immediately. "
        ], 
        "date": "2006-11-09T13:54:10+00:00"
    }, 
    {
        "ingredient_list": [
            "For the filling", 
            "1 1/2 cups (8 ounces) pitted dates, chopped", 
            "3/4 cup water", 
            "1 teaspoon finely grated orange (or mandarin or clementine) zest", 
            "For the crumbs", 
            "2 tablespoons packed brown sugar", 
            "1/4 cup raw or turbinado sugar", 
            "1/2 cup olive oil, coconut oil, melted butter or a mix of the above", 
            "3/4 cups rolled oats, I used quick-cooking but old-fashioned should work just fine", 
            "3/4 cup plus 2 tablespoons whole wheat flour, or a wholegrain flour mix of your choice", 
            "1/2 teaspoon ground cinnamon", 
            "A few gratings of fresh nutmeg", 
            "A pinch or two of ground cloves", 
            "1/4 teaspoon baking soda", 
            "1/4 teaspoon coarse sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/11/date-breakfast-squares1.jpg?w=750", 
        "tags": [
            "Bars", 
            "Breakfast", 
            "Dates", 
            "Photo", 
            "Snack", 
            "Vegan"
        ], 
        "url": "https://smittenkitchen.com/2015/11/date-breakfast-squares/", 
        "title": "date breakfast squares", 
        "directions": [
            "Heat oven to 400 degrees. Either grease bottom and sides of an 8×8-inch pan or line the bottom and sides with parchment paper. ", 
            "In a small saucepan, combine dates, water and zest over low heat, simmering for 5 to 10 minutes, until liquid has absorbed and mixture has thickened. Set aside while you make the crumbs.", 
            "In a large bowl, mix the sugars and oil or butter together. Add the oats, flour, spices, baking soda and salt and stir to combine; the mixture should form a coarse rubble. ", 
            "Press half into the bottom of your prepared pan. Dollop the date mixture over it and use a small offset spatula (or whatever you have on hand) to spread the mixture smoothly over the crumbs. Don’t worry if the crumbs move around a little underneath; these bars don’t require perfection. Sprinkle remaining crumbs over date layer and press lightly to cover. ", 
            "Bake bars for 25 minutes, or until light brown at the edges. Cool in pan. Cut into squares. They’ll keep just fine at room temperature but will last up to a week in the fridge and longer in the freezer."
        ], 
        "date": "2015-11-20T11:50:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup (100 grams) granulated sugar", 
            "1 tablespoon (8 grams) cornstarch", 
            "3 ounces (85 grams) semi- or bittersweet chocolate, roughly chopped", 
            "1/2 cup (40 grams) cocoa powder, any kind you like", 
            "1/4 teaspoon vanilla extract or the seeds from a tiny segment of fresh vanilla bean", 
            "1/8 teaspoon fine sea salt or 1/4 teaspoon kosher salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/decadent-hot-chocolate-mix1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "Drinks", 
            "Photo", 
            "Snack", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/12/decadent-hot-chocolate-mix/", 
        "title": "decadent hot chocolate mix", 
        "directions": [
            "Combine all ingredients in a food processor and blend until powdery. Don’t have a food processor? Chop or grate the chocolate until it is as fine as you can get it, and stir it into the remaining ingredients. Mixture keeps in an airtight container at room temperature for up to 2 months.", 
            "To use: Heat one cup of milk (coconut, almond or others would work here too) in a saucepan over medium heat until steamy. Add 3 tablespoons hot cocoa mix. Whisk over heat for another minute or two, until it begins to simmer and mix is completely dissolved. Pour into mug, top with mini-marshmallows or a dollop of whipped cream and hide somewhere nobody will make you share give it to someone you love.", 
            "Other flavors: CI walks you through how to make variations including Mexican Hot Chocolate (with some chile powder, cayenne and cinnamon), Mint Hot Chocolate (with mint extract instead of vanilla), Mocha Hot Chocolate (with a couple tablespoons of espresso powder) and usually I’d say “have fun with it!” I mean, you can and should. But I have to admit to being a bit of a traditionalist with my cocoa, and would take the pure chocolate flavor of the above recipe over anything that would clutter my tastebuds. Then again, maybe you shouldn’t listen to someone who needs a minimum of two dozen mini-marshmallows on a single cup of hot chocolate?", 
            "Packaging ideas: Had I more time, I might have picked up some charming Weck Juice Jars or Tulip Jars (.5 liter size, which will give you some space at the top — perfect for a handful of marshmallows?), either of which can be used later for pickling or storage. I used Mason jar-ish mugs with lids (1, 2), which could be used later for hot chocolate consumption. You could tie a a tablespoon measure on as well with ribbon, to make their end of the work even easier. "
        ], 
        "date": "2014-12-04T09:38:12+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound salt pork, pancetta or bacon, diced", 
            "1 large onion, finely diced", 
            "3 shallots, chopped", 
            "4 tablespoons butter, as needed", 
            "2 pounds beef chuck, in 1-inch cubes", 
            "2 tablespoons flour", 
            "Salt and freshly ground black pepper", 
            "1/2 cup Cognac (see Note)", 
            "2 cups unsalted beef stock", 
            "1/2 cup smooth Dijon mustard", 
            "4 tablespoons coarse Dijon or Pommery mustard (see Note)", 
            "4 medium carrots, peeled and cut into half-moon slices", 
            "1/2 pound mushrooms, stemmed, cleaned and quartered", 
            "1/4 cup red wine (see Note)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/dijon-and-cognac-beef-stew.jpg?w=750", 
        "tags": [
            "Beef", 
            "Date Night", 
            "French", 
            "Photo", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/02/dijon-and-cognac-beef-stew/", 
        "title": "dijon and cognac beef stew", 
        "directions": [
            "Place salt pork in a Dutch oven or a large heavy kettle over low heat, and cook until fat is rendered. Remove solid pieces with a slotted spoon, and save for another use, like your salad, vegetables or, uh, snacking. Raise heat to medium-low, and add onion and shallots. Cook until softened but not browned, about 10 to 15 minutes. Use a slotted spoon to transfer to a large bowl.", 
            "If necessary, add 2 tablespoons butter to the pan to augment fat. Dust beef cubes with flour, and season lightly with salt and more generously with pepper. Shake off excess flour, and place half the cubes in the pan. Cook over medium-high heat until well browned, almost crusty, on all sides, then transfer to a bowl with onions. Repeat with remaining beef.", 
            "Add Cognac to the empty pan, and cook, stirring, until the bottom is deglazed and any crusted-on bits come loose. Add stock, smooth Dijon mustard and 1 tablespoon coarse or Pommery mustard. Whisk to blend, then return meat and onion mixture to pan. Lower heat, cover pan partway, and simmer gently until meat is very tender, about 1 1/4 hours.", 
            "Add carrots, and continue simmering for 40 minutes, or until slices are tender. As they cook, heat 2 tablespoons butter in medium skillet over medium-high heat, and sauté mushrooms until browned and tender. Stir mushrooms into stew along with remaining mustard and red wine. Simmer 5 minutes, then taste, and adjust seasoning. Serve hot."
        ], 
        "date": "2014-02-24T12:16:34+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds eggplant (about 2 medium)", 
            "1/2 cup all-purpose flour", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "3 large eggs", 
            "2 1/2 cups panko breadcrumbs", 
            "Olive oil, for baking, roasting or frying", 
            "3 1/2 cups prepared sauce or the following ingredients to make your own:", 
            "1 tablespoon olive oil (or frying oil)", 
            "2 garlic cloves, minced", 
            "1 28-ounce can tomato puree", 
            "1 teaspoon dried oregano", 
            "Salt and freshly ground black pepper, to taste", 
            "Pinches of red pepper flakes, to taste", 
            "2 tablespoon chopped fresh basil, plus more to garnish", 
            "About a 1-pound loaf seeded Italian bread or baguette", 
            "3/4 cup grated parmesan", 
            "3/4 pounds mozzarella, in thin slices"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/08/eggplant-parmesan-melts-e1471881049161.jpg?w=750", 
        "tags": [
            "Eggplant", 
            "Italian", 
            "Photo", 
            "Sandwich", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/08/eggplant-parmesan-melts/", 
        "title": "eggplant parmesan melts", 
        "directions": [
            "Cook eggplant: Trim eggplant and cut into 1/4-inch slices.", 
            "To bread and bake or fry: Set up three wide, deep bowls on your counter, one with flour, one with the three eggs and one with the breadcrumbs. Season the flour very heavily (at least a teaspoon of kosher salt and many grinds of black pepper) and stir to combine. Beat the eggs until combined. Dip each slice of eggplant in the flour, tapping off excess, then the egg, letting excess drip off, and then the breadcrumbs, packing them on.\nTo bake breaded eggplant: Heat oven to 400 degrees. Place two racks (such as a metal cooling rack for cookies) over two large baking sheets and brush or spray them with olive oil. Arrange breaded eggplant slices in one layer on racks, season well with salt and pepper, and bake for 20 minutes on first side and 15 on the second, until edges are crisp and eggplant inside is soft. Set aside.\nTo fry breaded eggplant: Heat a large skillet with 1/2-inch olive oil over medium/medium-high heat. Feeling stingy with the good olive oil? Use half olive oil and half of another good oil for frying, such as sunflower, safflower, vegetable, grapeseed or canola. (Most restaurants do!) Once hot enough that a droplet of water hisses and splatters when added to the oil, fry breaded eggplant, a few slices at a time, until golden underneath, about 3 to 4 minutes, then flip and cook until browned on the second side, 2 to 3 minutes more. Drain on paper towels and immediately, while they’re still very hot, season with salt and pepper. Repeat with remaining slices.\nTo roast un-breaded eggplant: Brush two large baking sheets with a couple tablespoons of olive oil. Arrange eggplant slices in one layer and season well with salt and pepper. Roast for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release from the pan with no effort. If they’re not, let it cook longer. Once flipped, sprinkle them with additional salt and freshly ground black pepper and return the pan to the oven for another 10 to 12 minutes or so, until the undersides match the tops.\nMeanwhile, make sauce: Heat 1 tablespoon olive oil in a large frying pan over medium heat. Once hot, add garlic and cook for one minute, until faintly golden. Add tomato puree, which is going to sputter and splash, so step back. Season with salt, black pepper, pepper flakes and stir in oregano. Simmer, stirring from time to time, for 15 minutes.\nAssemble melts: Heat broiler. Split bread in half and briefly run under broiler, just to lightly toast it so that the sauce doesn’t make it soggy. Split each bread half into 6 smaller toasts and arrange on 1 to 2 large baking sheets that have been lined with foil. Spread a little prepared sauce over each toast and sprinkle with some of the parmesan. Add a few eggplant slices to each, fanning them out. Top with more sauce (to taste, but not so much that eggplant is drenched), parmesan and then place a slice or so off mozzarella over the top of each, enough that when it melts, it should drape down easily. Run trays of melts under the broiler until cheese on top is melted and blistery, 5 minutes in my oven but possibly more or less in yours, so please keep an eye on it. Garnish with additional basil and dig in."
        ], 
        "date": "2016-08-22T12:32:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large egg", 
            "2 tablespoons water", 
            "1/4 cup plain dried breadcrumbs", 
            "12 ounces lean ground turkey", 
            "1/4 cup freshly grated Parmesan cheese", 
            "2 tablespoons chopped fresh Italian parsley", 
            "2 garlic cloves, minced", 
            "3/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "8 cups (or more) low-salt chicken broth", 
            "1 cup chopped peeled carrots", 
            "3/4 cup orzo (rice-shaped pasta)", 
            "4 cups coarsely chopped escarole (about 1/2 medium head)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/escarole-and-orzo-soup-with-meatballs1.jpg?w=500", 
        "tags": [
            "Escarole", 
            "Greens", 
            "Photo", 
            "Soup", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/02/escarole-and-orzo-soup-with-meatballs/", 
        "title": "escarole and orzo soup with meatballs", 
        "directions": [
            "Whisk egg and 2 tablespoons water in medium bowl to blend. Mix in breadcrumbs; let stand 5 minutes. Add turkey, Parmesan cheese, parsley, garlic, salt, and pepper; gently stir to blend. Using wet hands, shape turkey mixture into 1 1/4-inch-diameter meatballs. Place on baking sheet; cover and chill 30 minutes.", 
            "Bring 8 cups chicken broth to boil in large pot. Add carrots and orzo; reduce heat to medium and simmer uncovered 8 minutes. Add turkey meatballs and simmer 10 minutes. Stir in chopped escarole and simmer until turkey meatballs, orzo, and escarole are tender, about 5 minutes longer. Season soup to taste with salt and pepper. (Can be made 2 hours ahead. Rewarm over medium heat, thinning with more broth if desired.)", 
            "Ladle soup into bowls and serve."
        ], 
        "date": "2008-02-22T13:01:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups cooked, drained chickpeas (from a 15-ounce can) or a little shy of 2/3 cup dried chickpeas (for same yield)", 
            "1/2 teaspoon baking soda (for dried chickpeas only)", 
            "1/2 cup tahini paste", 
            "2 tablespoons freshly squeezed lemon juice, or more to taste", 
            "2 small cloves garlic, roughly chopped", 
            "3/4 teaspoon table salt, or more to taste", 
            "Approximately 1/4 cup water or reserved chickpea cooking water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/01/ethereally-smooth-hummus.jpg?w=750", 
        "tags": [
            "Beans", 
            "Middle Eastern", 
            "Photo", 
            "Snack", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/01/ethereally-smooth-hummus/", 
        "title": "ethereally smooth hummus", 
        "directions": [
            "Olive oil, paprika or sumac, pita wedges (brushed with olive oil and sprinkled with za’atar, or a combination of sesame seeds and sea salt), and/or carrot sticks [optional] to serve", 
            "If using dried chickpeas: There are multiple methods to cooking them, and you can use whichever is your favorite, or Ottolenghi’s, or mine. Ottolenghi’s is to put the chickpeas in a large bowl and cover them with at least twice their volume of cold water, leaving them to soak overnight. The next day, drain them, and saute them in a medium saucepan with the baking soda (which many find reduces the gassy effects of fresh beans) for about three minutes. Add 3 1/4 cups water and bring it to a boil. Skim any foam that floats to the surface. They’ll need to cook for 20 to 40 minutes, sometimes even longer, depending on freshness, to become tender. When tender, one will break up easily between your thumb and forefinger. My method is similar, but I often put mine in a slow-cooker on high with the baking soda for approximately three hours, so I don’t have to monitor them as much. ", 
            "Drain the chickpeas (saving the chickpea broth for soups or to thin the hummus, if desired) and cool enough that you can pick one up without burning your fingers. ", 
            "Whether fresh or canned chickpeas: Peel your chickpeas. I find this is easiest when you take a chickpea between your thumb and next two fingers, arranging the pointy end in towards your palm, and “pop!” the naked chickpea out. Discard the skin. I get into a rhythm and rather enjoy this, but it’s also already established that I’m a weirdo.", 
            "In a food processor, blend the chickpeas until powdery clumps form, a full minute, scraping down the sides. Add the tahini, lemon juice, garlic and salt and blend until pureed. With the machine running, drizzle in water or reserved chickpea cooking water, 1 tablespoon at a time, until you get very smooth, light and creamy mixture. I find I need about 4 tablespoons for this volume, but you may need slightly more or less. ", 
            "Taste and adjust seasonings, adding more salt or lemon if needed. I do recommend that you hold off on adding more garlic just yet, however. I find that it “blooms” as it settles in the fridge overnight, becoming much more garlicky after a rest, so that even if it doesn’t seem like enough at first, it likely will be in the long run.", 
            "Transfer the hummus to a bowl and rest it in the fridge for at least 30 minutes, longer if you can. To serve, drizzle it with a little olive oil, and sprinkle it with paprika. Serve it with pita wedges or carrot sticks. "
        ], 
        "date": "2013-01-08T11:55:50+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound feta (cow’s milk)", 
            "2/3 cup sundried tomatoes in oil", 
            "1/2 cup pitted Kalamata olives", 
            "2 tablespoons fresh dill", 
            "3 tablespoons flat-leaf parsley", 
            "2 scallions", 
            "1/4 cup olive oil"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/feta-salsa1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Salad", 
            "Savory Sauces and Condiments"
        ], 
        "url": "https://smittenkitchen.com/2008/12/feta-salsa/", 
        "title": "feta salsa", 
        "directions": [
            "Crumble the feta into a bowl. Chop the tomatoes and olives, dill and parsley and thinly slice the scallions. Gently mix the ingredients together and drizzle with a few tablespoons of olive oi, or to taste."
        ], 
        "date": "2008-12-05T17:36:49+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://i0.wp.com/farm1.static.flickr.com/213/464605524_cb4d9eef9a.jpg", 
        "tags": [
            "Guest Post", 
            "Photo", 
            "Seafood", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2007/04/fish-tacos/", 
        "title": "fish tacos", 
        "directions": [
            "Ciao foodies,", 
            "Jocelyn, Bloggysitter Extraordinaire"
        ], 
        "date": "2007-04-18T21:36:18+00:00"
    }, 
    {
        "ingredient_list": [
            "2 to 3 tablespoons olive oil", 
            "1/2 small yellow onion, chopped", 
            "2 cloves garlic, crushed then minced", 
            "1 red bell pepper, cored and sliced into thin strips", 
            "1 yellow bell pepper, cored and sliced into thin strips", 
            "1 Anaheim or 1 jalapeño chile, cored and sliced into thin strips", 
            "1/2 teaspoon ground cumin", 
            "1 teaspoon paprika", 
            "1/4 teaspoon table salt", 
            "1 14-ounce can crushed tomatoes, fire-roasted if you can get them", 
            "6 eggs", 
            "1/2 cup feta cheese, crumbled", 
            "2 teaspoons (or more to taste) za’atar", 
            "1 to 2 tablespoons chopped flat-leaf parsley (optional), to garnish", 
            "6 small or 4 large pitas", 
            "Pickled shallots", 
            "1/4 cup red or white wine vinegar", 
            "2 teaspoons kosher salt", 
            "1 1/2 teaspoons sugar", 
            "1/4 cup water", 
            "3 small shallots, peeled and thinly sliced", 
            "Asparagus pesto", 
            "1/2 pound asparagus spears, trimmed of tough ends", 
            "1 garlic clove, peeled and chopped", 
            "1/4 cup grated Parmesan cheese", 
            "3 tablespoons pine nuts or almonds, toasted and cooled, divided", 
            "1/4 teaspoon table salt, or a little more of a coarse sea salt", 
            "2 tablespoons olive oil", 
            "To assemble", 
            "6 large slices whole-wheat sourdough bread, miche, or another sliced country bread of your choice, toasted", 
            "2 tablespoons whole grain Dijon mustard", 
            "6 large hard-boiled eggs", 
            "2 to 3 slices of bacon, halved to approximate sandwich lengths", 
            "2 thin slices white, sourdough or a country bread, toasted", 
            "4 thin slices of tomato", 
            "A few leaves of iceberg lettuce", 
            "1 tablespoon mayonnaise", 
            "1 large egg", 
            "1 teaspoon butter", 
            "Salt and freshly ground black pepper to taste", 
            "1 pound Yukon Gold potatoes, cut into small (about 1/2-inch) cubes", 
            "1 tablespoon olive or vegetable oil", 
            "1/2 small onion, finely chopped", 
            "1/2 pound Mexican chorizo, casings removed", 
            "Salt", 
            "Freshly ground black pepper", 
            "6 large eggs", 
            "8 small corn tortillas, warmed or blistered in a hot pan", 
            "To finish", 
            "Crumbled queso freso (cotija, ricotta salata and feta are decent substitutes, if you can’t find it)", 
            "Chopped cilantro, diced tomatoes, diced white onions (you can also sink these in the same pickle brine as the shallots in the earlier recipe), pickled jalapenos, a dollop of crèma or sour cream, a squeeze of lime juice, a dash or hot sauce or all of the above", 
            "Waffles", 
            "3/4 cups all-purpose flour", 
            "3/4 cups cornmeal", 
            "1 1/2 teaspoons baking powder", 
            "1 teaspoon granulated sugar", 
            "1/2 teaspoon table salt", 
            "1 cup buttermilk", 
            "1 tablespoon unsalted butter, melted and cooled slightly", 
            "1 large egg", 
            "1/2 cup finely grated cheddar cheese", 
            "Spray cooking oil to coat waffle iron", 
            "Creamed greens", 
            "5 ounces baby spinach or another fairly quick-cooking green of your choice, stemmed if stems are heavy", 
            "Butter", 
            "1/4 small onion, finely chopped", 
            "3 tablespoons heavy cream", 
            "To assemble", 
            "4 large eggs", 
            "Hot sauce and diced fresh tomatoes (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/five-new-ways-to-make-egg-sandwiches1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Eggs", 
            "Photo", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2014/05/five-egg-sandwiches/", 
        "title": "five egg sandwiches", 
        "directions": [
            "Preheat your oven to warm and place a tray on a middle rack.", 
            "Make waffles: Whisk flour, cornmeal, baking powder, sugar and salt in a medium bowl. In a smaller bowl, whisk together buttermilk, butter and egg. Stir wet ingredients and grated cheese into the dry mixture until combined. ", 
            "Make waffles according to your manufacturer’s directions. In the waffle iron I used – a thin one that made 6 rectangular waffles per batch – I cooked the waffles on the middle heat setting and needed 1 1/4 to 1 1/2 cups batter per batch. I made about 1 1/2 batches, yielding 9 small waffles. ", 
            "Transfer waffles to tray in warmed oven and leave them there while you cook your greens.", 
            "Prepare creamed greens: Wash greens but no need to dry them. In a large skillet over medium-high heat, cook the greens until wilted. For baby spinach, we prefer it just barely wilted, which takes just a minute. For heartier greens, you’ll want to cook them a few minutes longer. Transfer greens to a colander and press out as much extra liquid as you can. If desired, coarsely chop greens. ", 
            "Wipe out pan and return it to medium heat. Melt butter and then cook onion until soft and tender, about 5 minutes. Return greens to pan and drizzle heavy cream over them. Cook, stirring, until cream simmers for a minute and mixture is evenly combined. Season with salt and freshly ground black pepper and set aside.", 
            "Poach eggs: Poach eggs according to your favorite method. If you don’t have one, here’s mine: Heat a saucepan with a few couple inches of water to the point right before it simmers. Using a cooking spoon, create a whirlpool and crack your egg right into the center of it and stop swirling. The egg should mostly wrap around itself. Continue to let the egg cook, keeping the water from fully simmering, until the white is firmed up but it the egg still jiggles from the middle when nudged with a spoon, about 3 to 4 minutes. Scoop out with a slotted spoon and repeat with remaining eggs.", 
            "Assemble sandwiches: Place one square or wedge of waffle on a plate. Top with 1/4 of the creamed greens and a single poached egg. Dash with hot sauce, if desired, or a scattering of chopped tomatoes. Top with a second square or wedge of waffle and eat, precariously. "
        ], 
        "date": "2014-05-16T10:36:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups (7 3/4 ounces or 220 grams) all-purpose flour", 
            "1 teaspoon baking powder", 
            "3/4 teaspoon table salt", 
            "1/2 cup (118 ml) water", 
            "1/3 cup (79 ml) olive oil", 
            "2/3 to 3/4 cup (about 3 ounces or 85 grams) grated Mahon cheese (see above for replacements)", 
            "1/3 to 1/2 cup (79 to 118 ml) honey", 
            "1 tablespoon fresh thyme", 
            "Flaky sea salt such as Maldon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/flatbreads-with-honey-thyme-and-sea-salt1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Bread", 
            "Quick", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2011/07/flatbreads-with-honey-thyme-and-sea-salt/", 
        "title": "flatbreads with honey, thyme and sea salt", 
        "directions": [
            "Preheat oven to 450°F with a heavy baking sheet or pizza stone on a middle rack.", 
            "Whisk together flour, baking powder, and salt in a medium bowl. Make a well in center, then add water and oil and gradually stir into flour with a wooden spoon until a dough forms. Knead dough gently on a work surface 4 or 5 times. It will feel quite oily (but just think of how great your hands will look later!). ", 
            "Divide dough into 4 pieces and roll out 1 piece at on a sheet of parchment paper into a longish irregular rustic shape; mine were about 12″x6″. The dough should be rolled thin and it be crazy oily and you’ll think I’ve lost my mind suggesting that it will make anything but a mess, but you’ll see in a few minutes how perfectly ungreasy it bakes up, promise.", 
            "Slide rolled out dough and parchment paper together onto the preheated baking sheet or stone, and bake about 5 minutes, until lightly golden. Leaving the oven on, remove tray from oven and quickly sprinkle with 1/4 of grated cheese. Bake an additional 3 to 4 minutes, until browned at edges and in thinner spots. Remove flatbreads from oven a final time, quickly drizzle each with honey (1 used about a tablespoon per flatbread, but the restaurant used more; they were truly flooded with honey and it was delicious), sprinkle with sea salt and garnish with thyme leaves. Cut each cracker width-wise into 4 sections (about 3″x6″ each) with a sharp knife. Repeat with remaining pieces of dough. Serve warm.", 
            "Do ahead: Should you want to prepare these ahead of time for a party, I’d bake them including the cheese about 1 minute less than needed. Shortly before you’re ready to serve them, re-toast them in the oven and then drizzle on the honey/thyme/sea salt. "
        ], 
        "date": "2011-07-10T18:39:42+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large garlic cloves, chopped", 
            "1/4 cup plus 1/2 tablespoon extra-virgin olive oil", 
            "1 (14- to 15-oz) can stewed tomatoes", 
            "1 3/4 cups reduced-sodium chicken broth", 
            "2 (19-oz) cans cannellini beans, rinsed and drained (3 cups)", 
            "1 (1/2-lb) piece baked ham (1/2 to 3/4 inch thick), cut into 1/2-inch cubes", 
            "1/4 teaspoon black pepper", 
            "1 (5-oz) bag baby romaine (er, what? I used spinach) or baby arugula (10 cups loosely packed)", 
            "8 (3/4-inch-thick) slices baguette"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/four-cool-things-plus-white-bean-stew1.jpg?w=500", 
        "tags": [
            "Announcements", 
            "Beans", 
            "Photo", 
            "Stew", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/03/four-cool-things-plus-white-bean-stew/", 
        "title": "four cool things plus white bean stew", 
        "directions": [
            "Cook garlic in 1/4 cup oil in a 3 1/2- to 4 1/2-quart heavy pot over moderately high heat, stirring, until golden, 1 to 2 minutes. Coarsely cut up tomatoes in can with kitchen shears, then add (with juice) to garlic in oil. Stir in broth, beans, ham, and pepper and bring to a boil. Reduce heat and simmer, uncovered, 5 minutes. Stir in greens and cook until wilted, 3 minutes for romaine or 1 minute for arugula.", 
            "While stew is simmering, preheat broiler. Put bread on a baking sheet and drizzle with remaining 1/2 tablespoon oil. Broil 3 to 4 inches from heat until golden, 1 to 1 1/2 minutes.", 
            "Serve stew with toasts."
        ], 
        "date": "2008-03-12T17:21:20+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds (680 grams or 24 ounces or about 5 cups) thinly sliced yellow onions", 
            "3 tablespoons (42 grams or 1 1/2 ounces) unsalted butter", 
            "1 tablespoon (15 ml) olive oil", 
            "1 teaspoon (5 grams) table salt, plus additional to taste", 
            "1/4 teaspoon (1 gram) granulated sugar (helps the onions to brown)", 
            "3 tablespoons (24 grams or 7/8 ounce) all-purpose flour", 
            "2 quarts (8 cups or 1.9 liters) beef or other brown stock*", 
            "1/2 cup (118 ml) dry white wine or dry white vermouth", 
            "Freshly ground black pepper", 
            "3 tablespoons (45 ml) cognac or brandy (optional)", 
            "To finish [Gratinée] (Optional)", 
            "1 tablespoon grated raw onion", 
            "1 to 2 cups (to taste) grated Swiss (I often use Gruyere) or a mixture of Swiss and Parmesan cheese", 
            "1 tablespoon butter, melted", 
            "12 to 16 1-inch thick rounds French bread, toasted until hard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/04/french-onion-soup.jpg?w=750", 
        "tags": [
            "Budget", 
            "French", 
            "Onions", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2011/04/french-onion-soup/", 
        "title": "french onion soup", 
        "directions": [
            "Melt the butter and oil together in the bottom of a 4- to 5-quart saucepan or Dutch oven over moderately low heat. Add the onions, toss to coat them in oil and cover the pot. Reduce the heat to real low and let them slowly steep for 15 minutes. They don’t need your attention; you can even go check your email.", 
            "After 15 minutes, uncover the pot, raise the heat slightly and stir in the salt and sugar. Cook onions, stirring frequently, for 30 to 40 minutes until they have turned an even, deep golden brown. Don’t skimp on this step, as it will build the complex and intense flavor base that will carry the rest of the soup. Plus, from here on out, it will be a cinch.", 
            "After the onions are fully caramelized, sprinkle them with flour and cook, stirring, for 3 minutes. Add the wine in full, then stock, a little at a time, stirring between additions. Season to taste with salt and pepper. Bring to a simmer and simmer partially covered for 30 to 40 more minutes, skimming if needed. Correct seasonings if needed but go easy on the salt as the cheese will add a bit more saltiness and I often accidentally overdo it. Stir in the cognac, if using. I think you should.", 
            "Set aside until needed. I find that homemade onion soup is so deeply fragrant and flavor-rich that it can stand alone, but that doesn’t mean we don’t enjoy the graitinéed top once in a while. Here’s how to pull it off:", 
            "Preheat oven to 325. Arrange six ovenproof soup bowls or crocks on a large, foil-lined baking sheet. Bring the soup back to a boil and divide among six bowls. To each bowl, add 1/2 teaspoon grated raw onion and a tablespoon of grated cheese. Stir to combine. Dab your croutons with a tiny bit of butter and float a few on top of your soup bowls, attempting to cover it. Mound grated cheese on top of it; how much you use will be up to you. [Julia Child, in another era, felt that 1/2 cup of grated cheese could be divided among 6 bowls. I can assure you that if you’d like your gooey bubbling cheese lid to be anything like what you get at your local French restaurant, you are looking to use more, such as a generous 1/4 cup.]", 
            "Bake soups on tray for 20 minutes, then preheat broiler. Finish for a minute or two under the broiler to brown the top lightly. Grab pot holders, and serve immediately.", 
            "*  Porcini or mushroom stock are a robust vegetarian substitution."
        ], 
        "date": "2011-04-09T11:48:38+00:00"
    }, 
    {
        "ingredient_list": [
            "4 pounds sad, unloved tomatoes (some swear by romas, I’ve had success with all varieties)", 
            "1/4 cup olive oil", 
            "Small onion", 
            "2 to 3 small cloves of garlic", 
            "1/2 medium carrot", 
            "1/2 stalk of celery", 
            "1/2 teaspoon salt plus more to taste", 
            "Slivers of fresh basil, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/08/fresh-tomato-sauce.jpg?w=750", 
        "tags": [
            "Italian", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/08/fresh-tomato-sauce/", 
        "title": "fresh tomato sauce", 
        "directions": [
            "Peel your tomatoes: Bring a pot of water to boil. Cut a small X at the bottom of each tomato. Blanche the tomatoes in the boiling water for 10 to 30 seconds, then either rinse under cold water or shock in an ice water bath. Peeling the tomatoes should now be a cinch. If one gives you trouble, toss it back in the boiling water for another 10 seconds until the skin loosens up. Discard the skins (or get crafty with them).", 
            "Finish preparing your tomatoes: If using plum tomatoes, halve each lengthwise. If using beefsteak or another round variety, quarter them. Squeeze the seeds out over a strainer over a bowl and reserve the juices. (You can discard the seeds, or get crafty with them.) Either coarsely chop you tomatoes on a cutting board or use a potato masher to do so in your pot, as you cook them in a bit.", 
            "Prepare your vegetables: I finely chop my onion, and mince my carrot, celery and garlic, as does Bastianich. Batali grates his carrots. Burell pulses all four on the food processor to form a paste. All of these methods work.", 
            "Cook your sauce: Heat your olive oil in a large pot over meduim. Cook your onions, carrots, celery and garlic, if you’re using them, until they just start to take on a little color, about 10 minutes. I really like to concentrate their flavor as much as possible. Add your tomatoes and bring to a simmer, lowering the heat to medium-low to keep it at a gentle simmer. If you haven’t chopped them yet, use a potato masher to break them up as you cook them. Simmer your sauce, stirring occasionally. At 30 minutes, you’ll have a fine pot of tomato sauce, but at 45 minutes, you might just find tomato sauce nirvana: more caramelized flavors, more harmonized texture. ", 
            "If your sauce seems to be getting thicker than you want it to be, add back the reserved tomato juice as need. If your sauce is too lumpy for your taste, use an immersion blender to break it down to your desired texture. (“Blasphemy!” some will say, but they’re not in the kitchen with you. So there.) Season with 1/2 teaspoon salt and more to taste. I like somewhere between 1/2 and 1 teaspoon for 4 pounds of tomatoes. Scatter fresh basil over the pot before serving. Taste once more. Swear you’ll never buy jarred sauce again.", 
            "More ways to play around: There are innumerable ways to tweak your tomato sauce. Some like a pinch of red pepper flakes cooked with the carrots/celery/garlic and onion in the beginning. Some add them at the end. Some swear by a glug of red wine added with the tomatoes. Others insist that a tablespoon of tomato paste will give your relatively quick-cooked sauce a longer-cooked flavor. Have fun with it.", 
            "To play around as little as possible: Skip the onion, carrot and celery. Just cook your tomatoes for 30 to 45 minutes and at the end, drizzle in some olive oil or melted butter. If you have time, you can infuse that oil or butter with garlic and basil. Season to taste with salt. Wonder why you ever added so many ingredients to something so obviously perfect without them."
        ], 
        "date": "2010-08-30T14:49:15+00:00"
    }, 
    {
        "ingredient_list": [
            "2 slices bread of your choice", 
            "2 teaspoons butter, salted or unsalted", 
            "1/2 cup (2 ounces) coarsely grated cheddar "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/frico-grilled-cheese-sandwiches1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Quick", 
            "Sandwich", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/10/frico-grilled-cheese-sandwiches/", 
        "title": "frico grilled cheese sandwiches", 
        "directions": [
            "Spread butter on one side of each slice of bread, the one that will be on the outside of the sandwich. Scatter all but 2 tablespoons cheese unbuttered side of one slice. Top with second slice, so that the buttered side faces out. Heat skillet over low-to-moderate heat. (I like to use a well-seasoned cast iron frying pan here.) Sprinkle 1 tablespoon cheese roughly in center of skillet. Place sandwich on top. Cook sandwich until golden underneath and cheese browns and crisps, about 2 to 4 minutes. Carefully lift melted (frico-ed) cheese and bread onto spatula, sprinkle remaining spoonful of cheese back in skillet, then flip sandwich over on top of it. Cook on second side until golden and crisp as well, pressing down on it with the spatula to encourage it to all come together. ", 
            "Transfer to a plate, cut in half if desired, and dig in.", 
            "Alternate riffs on the classic: Are you a purist or do you like to put other things on your grilled cheese? I’m a sucker for sweet and sour red onions with a baby Swiss or gruyere cheese (this recipe in the book). But when I’m using classic cheddar, I either like a thin slice of tomato inside my sandwich, or sometimes, like the day I made these, the thinnest schmear of smooth Dijon and a dash of onion powder. "
        ], 
        "date": "2013-10-03T11:19:39+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups frisée (French curly endive), torn into-bite size pieces (about 2 ounces)", 
            "1 bacon slice, preferably thick-cut", 
            "1 tablespoon minced shallot (from 1 small)", 
            "1 teaspoon smooth Dijon mustard", 
            "4 teaspoons red wine vinegar", 
            "Salt and freshly ground black pepper", 
            "1/4 cup crumbled blue cheese ", 
            "1 to 2 teaspoons unsalted butter, divided", 
            "2 large eggs", 
            "Salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/02/fried-egg-sandwich-with-bacon-and-blue-cheese.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Eggs", 
            "Photo", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2012/02/fried-egg-sandwich-with-bacon-and-blue-cheese/", 
        "title": "fried egg sandwich with bacon and blue cheese", 
        "directions": [
            "Split your rolls and put them in to toast.", 
            "Place frisée in a medium bowl. Cut bacon crosswise into 1/4-inch wide lardons. In a small heavy skillet, cook bacon over moderate heat, until pieces are crisp. With a slotted spoon, transfer bacon to paper towels, reserving bacon fat in pan. Add shallot to bacon fat and cook for one minute, stirring. Add red wine vinegar and let hiss and bubble for 20 to 30 seconds, then remove from heat and whisk in Dijon. Immediately pour hot dressing over frisée and toss with drained lardons, salt and pepper. Don’t try the salad just yet or you will be tempted to eat it just the way it is when, I promise, it’s even better with an egg on top.", 
            "Remove rolls from toaster and divide bacon-frisee salad between each bottom bun. You’ll want to heap on more than seems feasible or needed, especially once you realize how tasty it is. Top each salad pile with half (2 tablespoons) of the blue cheese.", 
            "Reheat skillet over medium-high heat. Add the butter and swirl it to coat the pan. Crack one egg into the skillet, season with salt and pepper and reduce heat to medium. I like to cover the skillet with a small lid at this point, as it seems to help the egg cook faster and more evenly. In one minute, you should have a perfect sunny-side-up egg. However, I find that for this sandwich, to somewhat rein in the mess, it helps to then flip the egg for 20 to 30 seconds, until the yolk is still runny, but less likely to run right off your sandwich.", 
            "Remove the egg from the pan and place it on top of the bacon-frisée salad on the bun. Repeat with remaining egg and come on, what are you waiting for? Dig in."
        ], 
        "date": "2012-02-27T17:54:54+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound mix leftover cheese, harder cheeses grated, softer ones cut into chunks", 
            "A couple pats of butter, if using mostly firm cheese varieties", 
            "1 small clove garlic, minced, or more to taste", 
            "1/2 to 1 cup leftover white wine", 
            "1 to 2 tablespoons finely chopped fresh herbs, such as parsley, thyme, rosemary or chives", 
            "Salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/12/fromage-fort.jpg?w=751", 
        "tags": [
            "Appetizers + Party Snacks", 
            "French", 
            "Photo", 
            "Quick", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2012/12/fromage-fort/", 
        "title": "fromage fort", 
        "directions": [
            "Blend cheese, butter (if using) and garlic in food processer until combined. Drizzle in wine with the motor running until you get your desired consistency — some like it completely smooth, others prefer chunks. Add herbs, pulsing the machine until just combined. Season to taste with salt and pepper.", 
            "Fromage fort can be used right away, or kept in the fridge until needed. In the fridge, it will thicken and age a little; the flavors will mingle and deepen."
        ], 
        "date": "2012-12-28T11:32:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds small (I used Manila) clams", 
            "2 thick slices country or sourdough bread", 
            "1/2 tablespoon olive oil to brush bread (optional)", 
            "2 tablespoons butter", 
            "2 cloves garlic, thinly sliced or minced", 
            "1 large or 2 small shallots, minced or 1/4 cup minced white onion", 
            "Salt and red pepper flakes", 
            "1/2 cup dry white wine", 
            "1 tablespoon chopped fresh herbs — parsley, cilantro, chives or a mix", 
            "1 lemon, in wedges"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/garlic-wine-and-butter-steamed-clams.jpg?w=750", 
        "tags": [
            "Budget", 
            "Date Night", 
            "Photo", 
            "Portuguese", 
            "Quick", 
            "Seafood", 
            "Summer", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/09/garlic-wine-and-butter-steamed-clams/", 
        "title": "garlic wine and butter steamed clams", 
        "directions": [
            "If you think your clams may not be clean, wash them first: Fill a large bowl with cool tap water and place the clams in it. Let them soak for 20 minutes during which they’ll expel any sand and grit.", 
            "While they’re soaking, grill or broil your bread: Dab both sides lightly with olive oil, if using, and grill or broil until well-toasted on both sides.", 
            "Lightly scrub your clams. Discard any with chipped shells.", 
            "In a large saute pan with a lid, melt butter and add garlic, shallots, salt and pepper flakes. Cook for 1 to 2 minutes over medium-high. Add wine — and as soon as it simmers, add all the clams and cover with a lid. In three minutes, almost all should be wide open; discard any that do not open. Transfer to a bowl and ladle cooking liquid over. Scatter with herbs and serve with grilled bread and lemon."
        ], 
        "date": "2016-09-20T11:58:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1 round (about 1 pound) loaf firm sourdough bread", 
            "1/2 cup (4 ounces or 115 grams) salted or unsalted butter", 
            "1/2 teaspoon coarse or flaky salt, or 1/4 teaspoon table salt (if butter is unsalted)", 
            "4 medium cloves garlic, minced", 
            "Pinch or two of red pepper flakes or freshly ground black pepper to taste", 
            "1 cup finely grated cheese (I used a mix of 2/3 firm aged cheeses — pecorino and asiago — and 1/3 fontina for meltiness)", 
            "1 teaspoon finely minced fresh herbs (I used 1/2 each rosemary and oregano; use more to taste)", 
            "1 tablespoon extra fresh herbs (such as chives or parsley) to finish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/garlicky-party-bread-with-herbs-and-cheese1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Bread", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2014/01/garlicky-party-bread-with-cheese-and-herbs/", 
        "title": "garlicky party bread with cheese and herbs", 
        "directions": [
            "Heat oven to 350°F. Being careful not to cut through the bottom crust (i.e., leave slices attached), cut bread loaf into 1-inch slices in one direction, then perpendicular, forming porcupine-like bread fingers. Transfer to baking sheet or roasting pan. In a small saucepan or your microwave, combine butter, salt and garlic until butter is melted and sizzling. Pour over bread, making sure to separate any fingers leaning on each other to ensure the bread is evenly butter-soaked. Scatter with grated cheese, again making sure to get cheese all the way to the bottom crust too (helps finger separation, too) with a spoon. Sprinkle with first teaspoon of herbs. Cover dish with foil and bake loaf for 15 minutes, until warmed through. Remove foil and bake another 15 to 20 minutes, until edges of loaf are toasty and cheese has melted. Scatter with any additional green herbs for garnish and serve warm."
        ], 
        "date": "2014-01-30T12:12:20+00:00"
    }, 
    {
        "ingredient_list": [
            "Tomato broth", 
            "2 tablespoons (30 ml) olive oil", 
            "1 medium carrot, chopped", 
            "1 medium stalk celery, chopped", 
            "1 small yellow onion, chopped", 
            "3 garlic cloves, peeled and smashed", 
            "1/2 cup (120 ml) white wine", 
            "One 28-ounce (795 grams) can whole or chopped tomatoes with juices", 
            "Small handful fresh basil leaves, plus more for garnish", 
            "2 cups (475 ml) chicken or vegetable stock", 
            "Salt and freshly ground black pepper, to taste", 
            "Gnocchi", 
            "2 pounds (905 grams) Russet potatoes (3 to 4)", 
            "1 large egg, lightly beaten", 
            "1 teaspoon table salt", 
            "1 1/4 to 1 1/2 cups (156 to 190 grams) all-purpose flour, plus more for dusting surface", 
            "To finish", 
            "Fresh ricotta or shaved Parmesan, to taste, plus addition slivers of basil leaves (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/gnocchi-in-tomato-broth-more-book-tour1.jpg?w=500", 
        "tags": [
            "Italian", 
            "Pasta", 
            "Photo", 
            "Soup", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/01/gnocchi-in-tomato-broth-more-book-tour/", 
        "title": "gnocchi in tomato broth + more book tour", 
        "directions": [
            "Bake potatoes: Heat your oven to 400 degrees. Bake potatoes for 45 minutes to 1 hour, depending on size, until a thin knife can easily pierce through them. Meanwhile, prepare the tomato broth.", 
            "Make tomato broth: Heat the oil in a heavy pot over medium-high heat. One it’s hot, add the carrot, celery, and onion, and cook together for 5 minutes, reducing the heat to medium if they begin to brown. Add the garlic, and cook for one minute more. Pour in the wine, and use it to scrape up any browned bits stuck to the bottom of the pan, then cook the wine unti it is reduced by half, for several minutes. Stir in the tomatoes, mashing them a bit with a spoon if they’re whole, and the basil and stock, and simmer until the tomato broth thickens slightly, for about 45 minutes. Strain out the vegetables in a fine-mesh colander, and season the broth with salt and pepper to taste. Set aside until needed.", 
            "Make gnocchi: Let the potatoes cool for 10 minutes after baking, then peel them with a knife or a peeler. Run the potatoes through a potato ricer or grate them on the large holes of a box grater (grated baked potatoes will fall apart, which is the goal). Cool them to lukewarm, about another 10 minutes. Add the egg and salt, mixing to combine. Add 1/2 cup flour, and mix to combine. Add the next 1/2 cup flour, mixing again. Add 1/4 cup flour, and see if this is enough to form a dough that does not easily stick to your hands. If not, add the last 1/4 cup of flour, 1 tablespoon at a time, until the dough is soft but only a little sticky, and able to hold its shape enough to be rolled into a rope. Knead the dough together briefly, gently, on a counter, just for a minute.", 
            "Divide the dough into quarters. Roll each piece into a long rope, about 3/4-inch thick. Cut each rope into 3/4-inch lengths. At this point, you can use a floured fork or a gnocchi board to give each piece the traditional ridges, but I never bother. (The ridges are supposed to help sauce adhere, but here, we’re just floating them in a broth so it’s not a top concern.) Place the gnocchi on a a parchment-lined tray. ", 
            "[Do ahead: If you’d like to freeze gnocchi for later user, do so on this tray. Once they are frozen, drop them into a freezer bag until needed. No need to defrost before cooking them; it will just take a minute or two longer.]", 
            "Cook gnocchi: Place the gnocchi, a quarter-batch at a time, into a pot of boiling well-salted water. Cook the gnocchi until they float — about 2 minutes — then drain. ", 
            "Assemble dish: Meanwhile, reheat broth to a simmer. Add drained gnocchi then reheat through. Serve gnocchi and broth together, garnished with a few slivers of basil leaves and/or a dollop of fresh ricotto or some Parmesan shavings, if desired."
        ], 
        "date": "2013-01-15T11:29:05+00:00"
    }, 
    {
        "ingredient_list": [
            "5 slices bacon, chopped", 
            "3 pounds boneless chuck, trimmed and cut into 1/2-inch cubes", 
            "2 tablespoons vegetable oil", 
            "4 medium onions (about 1 1/2 pounds), chopped fine", 
            "3 garlic cloves, minced", 
            "3 tablespoons paprika (preferably Hungarian sweet*)", 
            "1 1/2 teaspoons caraway seeds", 
            "1/3 cup all-purpose flour", 
            "1/4 cup red-wine vinegar", 
            "1/4 cup tomato paste", 
            "5 cups beef broth", 
            "1 to 5 cups water or beer (use the former to make a stew, the latter to make a soup)", 
            "1 teaspoon salt", 
            "2 red bell peppers, chopped fine"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/goulash1.jpg?w=500", 
        "tags": [
            "Meat", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/01/goulash/", 
        "title": "goulash", 
        "directions": [
            "In an 8-quart heavy kettle cook bacon over moderate heat, stirring, until crisp and transfer with a slotted spoon to a large bowl. In fat remaining in kettle brown chuck in small batches over high heat, transferring it as browned with slotted spoon to bowl.", 
            "Reduce heat to moderate and add oil. Add onions and garlic and cook, stirring, until golden. Stir in paprika, caraway seeds, and flour and cook, stirring, 2 minutes. Whisk in vinegar and tomato paste and cook, whisking, 1 minute. (Mixture will be very thick.) Stir in broth, water, salt, bell peppers, bacon, and chuck and bring to a boil, stirring. Simmer soup, covered, stirring occasionally, 60 to 75 minutes.", 
            "Season soup with salt and pepper. Soup may be made 3 days ahead and cooled, uncovered, before chilling, covered. Reheat soup, thinning with water if desired.", 
            "* New Yorkers, we actually found this at Gristedes. Non-New Yorkers, Gristedes is a totally generic grocery store. Oddly, Whole Foods didn’t have it, but they could have been out. Looks like it is available on the Web as well."
        ], 
        "date": "2008-01-04T16:43:04+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup rolled oats (quick-cooking or old-fashioned will work; instant might get a little dusty)", 
            "1/4 cup shredded or flaked unsweetened coconut", 
            "2 tablespoons pepitas, or another nut or seed of your choice", 
            "1/4 cup dark or light brown sugar (for low-to-moderate sweetness)", 
            "1/8 teaspoon ground cinnamon", 
            "Few pinches sea salt", 
            "1 large egg white", 
            "2 teaspoons water (adjusted from 1 T)", 
            "2 cups (approximately 1/2 pound) walnuts, pecans or nuts that you prefer"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/granola-crusted-nuts1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2012/11/granola-crusted-nuts/", 
        "title": "granola-crusted nuts", 
        "directions": [
            "Preheat oven to 300 degrees. Line a baking sheet with parchment paper. In a food processor, pulse oats, coconut, pepitas, sugar, cinnamon and salt in short bursts until the mixture is very well chopped but not powdery — it needn’t be like a flour. In a large bowl, beat egg white and water until frothy (but not stiff). Add nuts to bowl and coat them very well, using a few more stirs than will seem necessary because if the egg doesn’t get into the craters of the nuts, no granola will stick there. And that would be sad. Pour oat mixture into bowl and very gently fold it together with the nuts, so that it just barely sticks. (I found that if you stirred it a lot, the mixture just started falling off, so just a few folds will do.) You’ll have more granola coating than will seem necessary, but this is fine. Spread nuts-and-granola out on baking sheet in a single layer but no need to separate them. Sprinkle any granola mix leftover in the bowl over the nuts. ", 
            "Bake for 20 minutes, moving nuts around just once in the baking time so that the inner nuts get as toasty as the ones at the edge, and up to 10 minutes more if they don’t look toasty yet at 20 minutes. Transfer pan to cooling rack and let nuts cool completely there. Once fully cool, break up any nut clusters and place mixture in jars/bags/your hand."
        ], 
        "date": "2012-11-09T13:07:32+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 cup (177 ml) warm water  (105° to 110°F)", 
            "2 tablespoons (30 ml) milk, slightly warmed", 
            "1 1/2 teaspoons (6 grams) sugar", 
            "1 1/4 teaspoons (5 grams) active dry yeast", 
            "2 cups (250 grams) all-purpose flour", 
            "1/2 teaspoon (3 grams) salt", 
            "6 tablespoons (90 ml) olive oil", 
            "1 1/2 cups halved Concord, red or black grapes, seeded", 
            "1 teaspoon fresh rosemary needles", 
            "2 tablespoons (8 grams) raw or another coarse sugar", 
            "2 teaspoons coarse sea salt (heads up: some are finding this too salty; if you’re worried, use less)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/grape-focaccia-with-rosemary1.jpg?w=500", 
        "tags": [
            "Bread", 
            "Grapes", 
            "Photo", 
            "Picnics", 
            "Snack", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2010/09/grape-focaccia-with-rosemary/", 
        "title": "grape focaccia with rosemary", 
        "directions": [
            "In the bowl of an electric mixer fitted with the paddle attachment, stir together the water, milk, sugar, and yeast. Let the mixture sit until foamy, about 10 minutes. Add the flour, salt and 2 tablespoons of the olive oil to the yeast mixture and mix well on low. Attach the dough hook, raise the speed to medium-low and knead the dough for 8 minutes longer.", 
            "[And yes, you can stir this together entirely by hand with a wooden spoon, then smash it around on a floured counter to “knead” it for a bit. It’ll be sticky, but doable, and of course you’ll get to say you made bread “old school” style.]", 
            "Brush a large bowl with a generous amount of olive oil. Scrape dough into the bowl and brush the top with additional oil. Cover with plastic wrap and let it rise in a cool place until it doubles in bulk, 1 1/2 to 2 hours.", 
            "Press the dough down with a floured hand. Turn the dough out onto a floured surface and divide it into two balls. Brush a large baking sheet (or two small ones) with olive oil, place the balls of dough on it and brush the top with more oil. Set it aside for 20 minutes, lightly covered with a kitchen towel. After 20 minutes, dip your fingers in olive oil and press and stretch each ball of dough into a 8 to 9-inch circle-ish shape. It will be dimpled from your fingers. Cover again with the towel and let it rise for another 1 1/4 hours in a cool place.", 
            "Preheat the oven to 450°F. Brush tops of dough with remaining olive oil and top the sprinkle grapes, rosemary, coarse sugar and coarse sea salt evenly over the dough. Bake for 15 minutes, until the crust is golden brown and puffed around edges. Let cool before serving. Serve warm or at room temperature. Try not to eat the whole thing like, uh, some people we might know."
        ], 
        "date": "2010-09-07T20:30:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup ketchup", 
            "1 tablespoon prepared horseradish", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "1 teaspoon ancho or other mild chili powder", 
            "Pinch cayenne pepper", 
            "1 tablespoon juice from 1 small lemon (we use more)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/05/3564906953_91d36a4607_o.jpg?w=753", 
        "tags": [
            "Grilling", 
            "Photo", 
            "Seafood", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2009/05/grilled-shrimp-cocktail/", 
        "title": "grilled shrimp cocktail", 
        "directions": [
            "Stir all ingredients together in a small bowl; adjust seasonings as necessary. Cocktail sauce keeps for up to two weeks in the fridge.", 
            "To Grill Your Shrimp Peel and devein shrimp, leaving the tails attached. Toss the shrimp in a large bowl with a generous amount of olive oil, salt and fresh pepper. Grill them for just a minute or two on each side — threading them first on skewers that you’ve soaked in water makes this even easier — being careful not to overcook them. You can squeeze some lemon juice on when you’re done, for an extra hit of flavor. Serve with cocktail sauce.", 
            "To Poach Your Shrimp: Peel and devein shrimp, leaving the tails attached. Bring shrimp stock (you can make this by boiling the shrimp shells for 20 minutes in three cups of water with a tablespoon of salt and straining the liquid) or water to a boil. Additionally, you might add some lemon peels, several glugs of white wine, peppercorns, a bay leaf or tarragon to the boiling liquid for extra flavor. Turn off heat and stir in shrimp; cover and let stand until firm and pink, 8 to 10 minutes. Drain shrimp. Plunge shrimp into ice water to stop cooking, then drain again. Serve shrimp chilled with cocktail sauce."
        ], 
        "date": "2009-05-26T15:07:38+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons minced white onion (from about 1/8 large one)", 
            "1 1/2 tablespoons minced, seeded jalapeño (from about half a medium one)", 
            "2 tablespoons cilantro leaves, minced, plus more to taste", 
            "Juice of half a lime", 
            "1/4 teaspoon coarse or kosher salt, plus more to taste", 
            "2 medium-large ripe avocados"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/guacamole.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Avocado", 
            "Photo", 
            "Snack", 
            "Tex-Mex", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/02/guacamole/", 
        "title": "guacamole", 
        "directions": [
            "\nMix the onion, jalapeño and cilantro in the bottom of a medium bowl. Add lime and salt. Cut avocado in half and remove the pit. Use a knife to score each half in a grid pattern, being careful not to cut through the skin of the avocado. Run a soup  spoon between the avocado and skin to scoop the chunks cleanly into the bowl. Turn them over a few times to coat them with the dressing. Taste mixture, adding more of other ingredients to taste. Use a fork to mash chunks to desired consistency, or not at all. Try not to eat this bowl by yourself, although it will be hard.\n"
        ], 
        "date": "2017-02-03T13:16:54+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups minced yellow onion (from 1 large onion)", 
            "3 garlic cloves, minced", 
            "6 tablespoons vegetable oil", 
            "1 cup (265 grams) tomato paste (from a 10-ounce can)", 
            "1 cup (235 ml) apple cider vinegar", 
            "1 cup (335 grams) honey", 
            "1/2 cup (120 ml) Worcestershire sauce", 
            "1 cup (240 grams) smooth dijon mustard", 
            "1/2 cup (120 ml) soy sauce", 
            "1 cup (335 grams) hoisin sauce", 
            "2 tablespoons mild chili powder", 
            "1 tablespoon ground cumin", 
            "Red pepper flakes, to taste (Ina recommends 1/2 tablespoon, mine are quite hot and I use 1/2 teaspoon)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/08/homemade-barbecue-sauce1.jpg?w=750", 
        "tags": [
            "Freezer Friendly", 
            "Grilling", 
            "Photo", 
            "Savory Sauces and Condiments"
        ], 
        "url": "https://smittenkitchen.com/2006/08/homemade-barbecue-sauce/", 
        "title": "homemade barbecue sauce", 
        "directions": [
            "\n"
        ], 
        "date": "2006-08-07T08:40:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large red bell pepper", 
            "4 ounces dried chiles (see suggestions above)", 
            "3 sun-dried tomatoes, dry-packed", 
            "2 clove garlic, peeled", 
            "1 teaspoon coarse or kosher salt", 
            "3/4 teaspoon ground coriander (1 1/2 teaspoons seeds, toasted and ground)", 
            "1/2 teaspoon ground caraway (or 1 teaspoon seeds, toasted and ground)", 
            "1/2 teaspoon ground cumin (or 1 teaspoon seeds, toasted and ground)", 
            "1 tablespoon olive oil, plus extra for storage"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/homemade-harissa1.jpg?w=640", 
        "tags": [
            "North African", 
            "Peppers", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/10/homemade-harissa/", 
        "title": "homemade harissa", 
        "directions": [
            "Roast your red pepper: You can do so in a 350°F oven, turning it every 15 minutes for a total of 45 to 60, until it’s deeply roasted on all sides. Some people prefer to do this over a gas flame, but be sure you cook it long enough that’s it truly soft inside, so it will blend well. Set aside to cool — you can do this in a bowl with foil or plastic over it, but I find it’s just as easy to peel a well-roasted pepper even if it’s cooled right on the tray, without the added steam. Once cool enough to handle, peel and seed the pepper.", 
            "Meanwhile, place dried chiles and sundried tomato in a bowl and cover with boiling water. Let sit for 30 minutes, until well-softened. Drain and with gloved hands, if you don’t like living on the edge, remove the seeds and stems from the chiles. The sundried tomatoes can be used as-is.", 
            "Place roasted red pepper, rehydrated chiles, tomatoes, garlic, salt and spices in a blender or food processor with 1 tablespoon olive oil and blend until it becomes a thick paste; a little water may be necessary to help this along. Store in the fridge, topped with a thin layer of olive oil. Use on everything."
        ], 
        "date": "2014-10-20T12:27:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/4 cups (155 grams) whole wheat flour", 
            "1 1/2 tablespoons (20 grams) sugar", 
            "1/2 teaspoon (3 grams) table salt, plus additional for topping", 
            "1/4 teaspoon paprika", 
            "4 tablespoons (55 grams) unsalted butter, cold is fine, cut into small bits"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/09/homemade-wheat-thins.jpg?w=750", 
        "tags": [
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2012/09/homemade-wheat-thins/", 
        "title": "homemade wheat thins", 
        "directions": [
            "In a food processor: Combine the flour, sugar, salt, paprika and butter in a food processor, pulsing the mixture until the butter is evenly disbursed in the crumbs. Drizzle in 1/4 cup (60 ml) cold water with the machine running; run it until the mixture begins to form a ball.", 
            "By hand: Combine the flour, sugar, salt, paprika and butter in a medium bowl. Using a pastry blender or your fingertips, work the butter into the mixture until mixture resembles coarse cornmeal. Add 1/4 cup (60 ml) cold water, stir with spoon until combined. Knead once or twice on counter.", 
            "Heat your oven to 400 degrees. Either lightly grease baking sheets or line them with parchment paper.", 
            "Roll your dough out, half at a time, to a large, very, very thin rectangle-ish shape on a well-floured counter. Did I mention you should roll them thin? Thinner than you even think necessary is best. Frequently check to make sure your dough isn’t sticking; if it is, gently scrape a spatula underneath to lift it, then flour the counter again. Using a knife or pastry wheel, cut dough into about 1 1/2-inch squares. Dock crackers all over with a toothpick or pointy end of a thermometer. (Technically speaking, I noted a 9-dot docking pattern, like the 9 sides of a pair of dice, on my store-bought Wheat Thins. I highly recommend you do not drive yourself bonkers trying to emulate this.) ", 
            "Transfer crackers to baking sheets, spacing them only a little as they really don’t spread. Sprinkle with additional table salt if you’d like to approximate the salty exteriors of the store-bought crackers. Bake crackers until crisp and bronzed, about 5 to 7 minutes but please keep a close watch on the first batch as thinner crackers (high-five!) will bake faster and thicker ones will take longer.", 
            "Cool in baking pans on racks. Crackers will keep in an airtight container officially for a week but ours are in fact two weeks old and still perfect. You can also freeze them in an airtight container between sheets of waxed paper for a couple months."
        ], 
        "date": "2012-09-24T16:57:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1 ounce (1/2 cup) dried wood ear mushrooms or 5 fresh button or shiitake mushrooms, wiped clean and thinly sliced", 
            "2 tablespoons canola oil or other neutral cooking oil", 
            "1/2 pound lean pork shoulder, sliced 1/8 inch thick and cut into 1-by-1/4-inch strips, or 1/2 pound ground pork", 
            "1 tablespoon finely chopped garlic", 
            "1 tablespoon finely chopped peeled fresh ginger", 
            "1/2 cup chopped scallions, plus more for garnish, if desired", 
            "4 cups chicken stock or low-sodium broth", 
            "1/3 cup (about 2 ounces) bamboo shoots, drained", 
            "1/2 pound soft tofu, cut into 1/2-inch dice", 
            "1/3 cup unseasoned rice vinegar, plus more for serving", 
            "3 tablespoons soy sauce", 
            "1 teaspoon sugar (I skipped this)", 
            "1 teaspoon black or white pepper", 
            "1 teaspoon toasted sesame oil", 
            "1 tablespoon Sriracha, plus more for serving", 
            "Kosher salt", 
            "2 large eggs, beaten"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/hot-and-sour-soup11.jpg?w=640", 
        "tags": [
            "Chinese", 
            "Gluten-Free", 
            "Meat", 
            "Mushrooms", 
            "Photo", 
            "Quick", 
            "Soup", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/02/hot-and-sour-soup/", 
        "title": "hot and sour soup", 
        "directions": [
            "If using dried mushrooms: Cover the mushrooms with boiling water in a small bowl, and let stand until softened, about 30 minutes. Drain and coarsely chop the mushrooms.", 
            "In a large saucepan, heat the canola oil.  Add the pork, garlic, ginger and 1/2 cup scallions and cook over moderately high heat, stirring occasionally, until the pork is golden brown, about 3 minutes. Stir in the stock and add the bamboo shoots (if using), tofu, 1/3 cup of vinegar, the soy sauce, sugar, pepper, sesame oil, mushrooms and 1 tablespoon Sriracha. Bring the soup to a simmer and season with salt. While stirring constantly, drizzle in the eggs and cook until strands form, about 1 minute. Serve hot, garnished with extra scallions if desired, passing rice vinegar and Sriracha at the table."
        ], 
        "date": "2016-02-08T11:55:08+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive or peanut oil", 
            "1/2 teaspoon whole cumin seeds", 
            "1/4 teaspoon whole fennel seeds", 
            "1 medium onion, peeled and chopped", 
            "1 medium potato (about 6 ounces), peeled and chopped", 
            "2 teaspoons peeled and chopped fresh ginger", 
            "2 cloves garlic, peeled and chopped", 
            "1 fresh hot green chili, chopped (more or less to taste)", 
            "2 teaspoons ground coriander", 
            "1 teaspoon ground cumin", 
            "1/4 teaspoon ground turmeric", 
            "1/4 teaspoon red chili powder or cayenne (to taste)", 
            "About 3 1/2 cups cauliflower florets (from about 1/2 a large 2.75-pound head)", 
            "2 medium tomatoes, peeled and chopped or 1 1/2 cups canned chopped tomatoes", 
            "1 1/2 teaspoons salt, or to taste (we wanted more)", 
            "A couple spoonfuls heavy cream or dollops of yogurt", 
            "1/2 cup cooked basmati or other long-grain white rice", 
            "Handful of fresh cilantro, chopped", 
            "Freshly ground black pepper", 
            "Lime wedges", 
            "Toasted pita or naan wedges"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/indian-spiced-cauliflower-soup.jpg?w=750", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Freezer Friendly", 
            "Indian", 
            "Photo", 
            "Potatoes", 
            "Soup", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/09/indian-spiced-cauliflower-soup/", 
        "title": "indian-spiced cauliflower soup", 
        "directions": [
            "Heat oil in the bottom of a 4 to 5-quart pot over medium-high heat. Once hot, add the cumin seeds and a few seconds later, the fennel seeds. Pause 2 seconds and then add the onions and potatoes. Stir and sauté for 5 minutes. Add the ginger, garlic and green chiles and stir for 1 minute more.\nTurn the heat to medium low and add the ground coriander, cumin, turmeric and red pepper. Stir for 1 minute. Add the cauliflower, tomatoes and salt and stir for 1 minute. Add 4 cups water, stir, and bring to a boil over medium-high heat. Cover, lower the heat again, and simmer gently for 25 minutes.\nLet the soup cool slightly, then blend it to your desired texture. Taste for seasoning and adjust as needed. Ladle into bowls and add a dollop of yogurt or tiny swirl (about 1/2 teaspoon) heavy cream, if desired. Squeeze lime juice over, add a few grinds of black pepper and place 2 tablespoons cooked rice to the center of each bowl. Scatter with cilantro and serve with pita wedges on the side, if desired. Dig in.\n"
        ], 
        "date": "2016-09-27T12:07:56+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup olive oil, divided", 
            "4 large links of sweet Italian sausage, casings removed (I used half of this, preferring the sausage to not dominate the soup’s flavor [update] and from the comments, it sounds like most of you preferred it with just 2 links as well)", 
            "1 medium onion, diced", 
            "2 celery stalks, sliced or diced", 
            "2 medium carrots, peeled and sliced into half-moons or diced", 
            "4 cloves garlic, sliced (reserve half for later in recipe)", 
            "Kosher salt", 
            "A pinch of crushed red pepper flakes (optional)", 
            "1 cup brown lentils, sorted and rinsed", 
            "2 bay leaves", 
            "1 28-ounce can crushed tomatoes", 
            "6 cups water", 
            "Freshly ground black pepper", 
            "3 to 4 cups shredded or thinly ribboned Swiss chard leaves or kale", 
            "Grated Pecorino Romano cheese to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/01/lentil-soup-with-sausage-chard-and-garlic.jpg?w=750", 
        "tags": [
            "Beans", 
            "Date Night", 
            "Photo", 
            "Soup", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2013/01/lentil-soup-with-sausage-chard-and-garlic/", 
        "title": "lentil soup with sausage, chard and garlic", 
        "directions": [
            "Heat 1/4 cup olive oil (enough to coat bottom of pot) in a large pot on medium heat. When hot, add the sausage, breaking it up with a wooden spoon until it starts to brown, about five minutes. Add the onion, celery, carrots, first two garlic cloves, a pinch of salt, and if you like your soup spicy, a pinch of red pepper flakes. Cook with the sausage until the vegetables soften a bit, another 5 minutes. Add the lentils, bay leaves, tomatoes, water (6 cups is, conveniently, a little less than 2 empty 28-ounce cans, so you can get any tomato pulp you missed), more salt and black pepper to taste. Bring to a simmer and allow to cook until the lentils are tender, about 40 minutes. (It might be necessary to add more water if the soup gets too thick, though we preferred ours on the thick side.)", 
            "When the lentils are cooked, add the chard and cook until the leaves are tender, just a few minutes more. Discard the bay leaves. ", 
            "To finish, divide soup among bowls, then add the remaining 1/4 cup olive oil and 2 garlic cloves to a small skillet and heat over medium until the garlic softens and hisses. Drizzle this over soup bowls, and top with fresh Romano, passing more at the table. Leftovers will keep for several days in the fridge."
        ], 
        "date": "2013-01-22T11:36:49+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups (from approximately 1 1/2 pounds peas in pods) fresh pea or a 10-ounce package frozen peas, defrosted", 
            "1 small garlic clove, minced", 
            "2 tablespoons pine nuts, toasted and cooled", 
            "1/2 cup  (1 1/8 ounces) finely grated parmesan cheese", 
            "1/4 teaspoon table salt, plus more for pasta water", 
            "1/3 cup olive oil", 
            "12 ounces dried linguine", 
            "Garnish (optional): thinly slivered basil or mint leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/06/linguine-with-pea-pesto.jpg?w=750", 
        "tags": [
            "Pasta", 
            "Peas", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/06/linguine-with-pea-pesto/", 
        "title": "linguine with pea pesto", 
        "directions": [
            "If you’re completely maniacal about your peas getting overcooked (I am!), prepare an ice bath, a large bowl filled with ice water. Bring a small saucepan of lightly salted water to a boil. Add peas and cook for 2 minutes (this leaves them with a bit of structure). Drain peas then add them to the ice bath (if using) and drain again. If you haven’t used an ice bath, let your peas cool to lukewarm before making the pesto.", 
            "Set aside 1/2 cup of your cooked peas. Whirl the remaining cup of peas in the work bowl of a food processor with garlic, pine nuts, 1/3 cup parmesan and salt until smooth, about 2 to 3 minutes, scraping down the bowl as necessary. With the machine running, drizzle in olive oil. You can stop right here, toast some baguette slices and make some fine, fine crostini. Or, you can continue…", 
            "Cook your linguine until al dente. Reserve about two cups pasta cooking water (yes, this is a lot, the pea pesto will be surprisingly thick) then drain linguine and return it to pot. Over moderate heat, toss pasta with pesto, reserved peas and as much reserved pasta water as needed to smooth and distribute pesto; let cook for one minute so that the pesto adheres. Adjust salt to taste, add freshly ground black pepper if desired. Serve immediately, garnished with fresh herbs, if using, and remaining parmesan for passing."
        ], 
        "date": "2011-06-23T09:58:31+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds unpeeled small Yukon gold (Ina’s suggestion) or fingerling (what I used) potatoes", 
            "Coarse, kosher or sea salt", 
            "3 tablespoons Champagne or white wine vinegar", 
            "1/2 teaspoon Dijon mustard", 
            "1/2 teaspoon minced or pressed garlic", 
            "1 large or extra-large egg yolk, ideally at room temperature", 
            "Freshly ground black pepper", 
            "1/2 cup olive oil", 
            "1/4 cup dry white wine (you can skip this, or use less, with little harm; I used 1 tablespoon vermouth instead)", 
            "3 tablespoons drained capers (I imagine minced cornichons would be a good alternative)", 
            "6 scallions, thinly sliced (yielding about 1 cup)", 
            "2 medium stalks celery, diced small (about 1/4 inch) (yielding about 1/2 cup)", 
            "1/2 cup finely diced red onion", 
            "1 1/2 pounds cooked lobster meat, cooked and cooled, in a 1-inch dice (from about 7 to 8 pounds fresh lobster; see post above for better budgeted suggestions)", 
            "1 lemon", 
            "3 tablespoons coarsely chopped fresh tarragon (Ina’s suggestion) or flat-leaf parsley (what we used)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/lobster-and-potato-salad.jpg?w=750", 
        "tags": [
            "Photo", 
            "Picnics", 
            "Potatoes", 
            "Salad", 
            "Seafood", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2013/05/lobster-and-potato-salad/", 
        "title": "lobster and potato salad", 
        "directions": [
            "Cook the potatoes: Place the potatoes in a large pot and cover with an inch or two over water. Add 1 tablespoon salt and bring to a boil. Lower the heat and simmer for 15 to 25 minutes, depending on the size of the potatoes, until just tender. (A bamboo skewer is ideal to test them.) Drain in a colander, and let potatoes cool for 5 minutes. Cut potatoes into quarters or halves (or fingerlings into 1/2- to 1-inch segments) and place them in a large bowl.", 
            "Make the vinaigrette: Whisk together the vinegar, mustard, garlic, egg yolk, 1 teaspoon salt, and many grinds of black pepper (Ina recommends you use a full teaspoon of pepper). Whisking constantly and vigorously, pour the oil in in a thin drizzle, ideally making an emulsion. Stir in the wine (if using) and capers. ", 
            "Assemble the salad: While the potatoes are still very warm, pour half the vinaigrette on the potatoes and toss them gently, allowing them to soak up the vinaigrette. Stir in the scallions, celery, red onion, lobster, and add enough vinaigrette to moisten. Reserve any remaining vinaigrette for later. Add the zest and juice of the lemon, the tarragon or parsley, and more salt and pepper to taste (Ina calls for another 2 teaspoons salt and 1 teaspoon pepper, but this felt like overkill). Cover with plastic wrap and refrigerate for at least an hour to allow flavors to blend. Taste for seasonings and add more vinaigrette, if necessary. ", 
            "Serve: This salad is especially good served closer to room temperature. Don’t forget to share."
        ], 
        "date": "2013-05-29T10:56:52+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds cooked lobster meat*, chopped roughly into 1/2 and 3/4-inch pieces", 
            "1 small celery rib, finely chopped", 
            "1/4 cup mayonnaise (Charles insists on Hellman’s; I didn’t argue)", 
            "Squeeze or two of lemon juice", 
            "Pinch of kosher salt and freshly ground black pepper", 
            "2 top-loading hot dog buns or 64 miniature burger buns (described above) or small dinner rolls", 
            "Unsalted butter", 
            "Snipped fresh chives for garnish (though we mixed ours right into the salad, for convenience)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/lobster-rolls1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Salad", 
            "Seafood"
        ], 
        "url": "https://smittenkitchen.com/2009/08/lobster-rolls/", 
        "title": "lobster rolls", 
        "directions": [
            "In a large bowl, combine the lobster meat, celery, mayonnaise, lemon and salt and pepper and mix thoroughly. Adjust seasonings to taste.", 
            "Do ahead: Cover the mixture and store it in the refrigerator until ready to serve. It will last for up to two days.", 
            "How they prepare the buns at the restaurant: In a small sauté pan over low to medium heat, melt two teaspoons of butter. Place the hot dog buns on their sides in the butter. Flip the buns a couple of times so that both sides soak up an equal amount of butter and brown evenly. Remove the buns from the pan and place them on a large plate. Fill the toasted buns with lobster salad.", 
            "How we prepared our miniature rolls: On large roasting pans, we split each of our rolls and lightly toasted them, open side up, before quickly slathering both sides with butter and filling each with a generous tablespoon of lobster salad.", 
            "Sprinkle your rolls with chives and serve with a salad, slaw or shoestring fries.", 
            "* We bought our lobster meat, cooked that morning and shelled, from The Lobster Place, for those of you who were going to ask. However, not all markets are as trustworthy when it comes to lobster meat that they label “fresh” — it is often overcooked and not as recently-rendered as they promise. If you’re up for it, cooking and cracking your own will ensure freshness while reducing your grocery tab. About 20 percent of the weight of a lobster is its meat, so you would need, for example, five one-pound lobsters to get one pound of meat. Don’t panic — as I did — when you see how tiny the mass of two pounds of lobster meat might look. Once diced, our salad nearly filled a six-cup bowl."
        ], 
        "date": "2009-08-10T11:45:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound small shrimp, shelled and deveined or pre-cooked and defrosted", 
            "2 firm-ripe avocados, halved, scored into a small dice", 
            "2 cups grape tomatoes, quartered or 2 cups chopped tomatoes, drained a little", 
            "1/2 small white onion, very finely chopped (use red if you can’t find white)", 
            "1 small jalapeño, seeded and finely chopped (optional)", 
            "Drizzle of olive oil", 
            "Juice of 1 to 2 limes", 
            "Salt", 
            "Handful cilantro leaves, roughly chopped", 
            "Hot sauce, on the side", 
            "Tortilla chips, to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/9349257784_815a1814b7_o.jpg?w=750", 
        "tags": [
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Seafood", 
            "Side Dish", 
            "Summer", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2013/07/mama-canales-garcias-avocado-shrimp-salsa/", 
        "title": "mama canales-garcia’s avocado-shrimp salsa", 
        "directions": [
            "To cook the shrimp: Bring salted water* to a boil and turn off heat. Add shrimp, cover pot and let stand until firm and pink, about 5 to 7 minutes. Drain shrimp, pat dry and chill. ", 
            "Make salsa: Chop shrimp into small bites and put in medium bowl. Scoop avocados into bowl. Add tomatoes, white onion, jalapeño (if using, to taste) and a drizzle of olive oil. Add the juice of one lime, and a second one, if needed. Add salt to taste, then cilantro. Serve with tortilla chips.", 
            "* If you have more time, you can first make a shrimp stock with about 3 cups water, 1 cup beer or wine, the reserved shrimp shells, additional lime juice or the peels from the lime juice you’ll use in the salad and some peppercorns or red pepper flakes. Boil these together for 20 minutes, then strain the mixture. Cook the shrimp in this stock instead."
        ], 
        "date": "2013-07-23T12:01:06+00:00"
    }, 
    {
        "ingredient_list": [
            "3 1/2 to 4 1/2 pounds chicken necks, backs and wings", 
            "3 celery ribs, cut into big chunks", 
            "3 carrots, scrubbed and cut into big chunks", 
            "2 parsnips, scrubbed and cut into big chunks", 
            "2 onions, unpeeled and quartered", 
            "1 head garlic, cut horizontally in half", 
            "1 Turkish or 1/2 California bay leaf", 
            "1 tablespoon black peppercorns", 
            "1 tablespoon Kosher salt", 
            "4 quarts cold water", 
            "–and/or–", 
            "Any vegetables you have stashed in your Stock Bag (described above) ", 
            "Matzo Balls", 
            "1/2 cup matzo meal", 
            "2 eggs, lightly beaten", 
            "2 tablespoons reserved chicken fat or vegetable oil", 
            "1 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "2 tablespoons chicken stock or seltzer (which both of our mothers swear by for making the balls extra light)", 
            "For soup", 
            "2 to 3 quarts prepared chicken stock (recipe above)", 
            "1 carrot, thinly sliced", 
            "A few sprigs of dill"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/matzo-ball-soup.jpg?w=750", 
        "tags": [
            "Dumplings", 
            "Jewish", 
            "Passover", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/02/matzo-ball-soup/", 
        "title": "matzo ball soup", 
        "directions": [
            "Mix all matzo ball ingredients in a bowl. Cover and place in the refrigerator for 30 minutes. ", 
            "Bring 1 1/2 quarts of well-salted water to a brisk boil in a medium sized pot.", 
            "Reduce the flame. Run your hands under water so they are thoroughly wet. Form matzo balls by dropping spoonfuls of matzo ball batter approximately 1-inch in diameter into the palm of your wet hands and rolling them loosely into balls. Drop them into the simmering salt water one at a time. Cover the pot and cook them for 30 to 40 minutes.", 
            "About ten minutes before the matzo balls are ready, bring prepared chicken stock to a simmer with the sliced carrot in it. Ladle some soup and a couple matzo balls into each bowl and top with a couple snips of dill. Eat immediately. "
        ], 
        "date": "2008-02-04T16:08:59+00:00"
    }, 
    {
        "ingredient_list": [
            "Meatballs", 
            "The baguettes or seeded sandwich rolls you’ll use for your sandwiches (see Note above for how to estimate)", 
            "2 pounds ground meat of your choice (I used pork but have in the past used beef, veal, chicken, turkey or a blend thereof)", 
            "2 tablespoons chopped parsley", 
            "1/3 cup finely grated Parmesan or Romano cheese", 
            "3/4 teaspoon salt", 
            "Pinch of red pepper flakes", 
            "2 small garlic cloves, minced", 
            "1 teaspoon onion powder", 
            "1 teaspoon Worcestershire sauce", 
            "1 large egg", 
            "Olive oil", 
            "4 cups prepared tomato sauce (plus extra if you like a lot of extra sauce)", 
            "Caramelized onions", 
            "2 large yellow onions, thinly sliced", 
            "1 tablespoon butter", 
            "1 tablespoon olive oil", 
            "Salt", 
            "Assembly", 
            "2 cups coarsely shredded Gruyère"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/meatball-sub-with-caramelized-onions.jpg?w=750", 
        "tags": [
            "Meat", 
            "Onions", 
            "Photo", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2011/02/meatball-sub-with-caramelized-onions/", 
        "title": "meatball subs with caramelized onions", 
        "directions": [
            "Make the meatballs: Split your rolls almost the whole way through, leaving one side attached. Scoop out some of the roll to create a channel for the meatballs to rest in. Grind the bread you pulled out in a food processor or tear it into minuscule bits. You will need 1 1/3 cups or 2 3/4 ounces of fresh breadcrumbs for the meatballs. If you’re not making subs, you can get this same amount of breadcrumbs from 2 to 3 sandwich bread slices. Set rolls aside until later.", 
            "Place the fresh breadcrumbs in a large bowl with 3/4 cup warm water and all of the meatball ingredients except for the olive oil and tomato sauce. Combine with a fork, breaking up clumps of meat until the ingredients are evenly distributed. Form mixture into 2-inch meatballs are arrange on a tray. I find wet hands make it easier to form meatballs without them sticking too much.", 
            "Heat a generous slick of oil (few tablespoons) in a large saute pan with a lid. Brown meatballs in batches, being careful not to crowd the pan or nudge them before they are nicely browned or they will stick and you’ll leave delicious meatball bits in the pan. These meatballs are soft, so use a gentle hand. Transfer meatballs to a paper towel-lined tray and continue until they are all browned.", 
            "Discard the oil and heat your tomato sauce in the pan. Add the meatballs, cover the pan and simmer them on the lowest heat possible for 25 to 30 minutes, until the meatballs are cooked through.", 
            "Caramelize onions: While the meatballs are simmering, you can cook the onions. Heat the olive oil and butter in a heavy large skillet over medium-low heat. Add onion, sprinkle with salt and a little pepper and cook until they’re tender, sweet, and a deep golden brown, stirring occasionally. This takes me about 30 minutes.", 
            "Assemble subs: Arrange meatballs with sauce in the hollowed-out roll(s). Drape caramelized onions over the top and sprinkle with shredded cheese. Place subs under a broiler or in an oven at top heat to melt the cheese."
        ], 
        "date": "2011-02-04T13:40:16+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/miso-black-sesame-caramel-corn1.jpg?w=640", 
        "tags": [
            "Candy", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2016/02/miso-black-sesame-caramel-corn/", 
        "title": "miso black sesame caramel corn", 
        "directions": [
            "Heat oven to 300°F. Line a rimmed baking sheet with parchment paper; set aside. Lightly coat parchment and a the very largest bowl you own with nonstick spray. ", 
            "Place 2 tablespoons oil and 2 to 3 kernels in a 3-quart or larger pot. Turn heat to medium-high and cover with a lid. When you hear these first kernels pop, add the remaining kernels and replace the lid. Using potholders, shimmy the pot around to keep the kernels moving as they pop. When several seconds pass between pops, remove from heat. Transfer to coated bowl. You should have about 8 cups popcorn. ", 
            "Wipe out pot you used to pop corn. Add sugar and water to it, and bring to a boil over medium-high heat, only stirring until sugar has dissolved. Boil, swirling pan around (wear potholders) until caramel is a deep amber color, which took about 8 to 9 minutes in my already-heated-from-the-popcorn pot. Remove from heat and stir in butter (mixture will hiss and bubble furiously). Return to stove, reduce heat to medium-low, and cook for another 2 to 3 minutes, removing from the stove if it appears smoky sooner. Remove from heat and whisk (a whisk will best break it up) in the salt, baking soda and miso. ", 
            "Quickly pour it over the prepared popcorn and toss to coat. You’ll be glad you used a gigantic bowl. I use two silicone spatulas to mix it up because it’s a messy project and popcorn will want to fall out. Whatever you do, do not pick up any caramel-coated popcorn that falls out unless you like burned fingertips. (Wait until it cools.) Coat popcorn as best as you can, but don’t fret if there are gaps. ", 
            "Spread popcorn on prepared baking sheet. Sprinkle sesame seeds over. Bake in oven, tossing occasionally (which will also help coat any scantily-clad popped kernels) until mixture is dry, about 15 to 20 minutes. Let cool completely on baking sheet, then break it up into a large bowl. ", 
            "Do ahead: Keeps at its very best for 4 hours. Longer, it can be stored in containers or bags at room temperature, but if the day is humid, it might get just a tiny bit sticky. Nobody will care.", 
            " "
        ], 
        "date": "2016-02-04T12:07:49+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups light, dry white win or 1 cup dry white vermouth", 
            "An 8- to 10-quart enameled kettle with cover, though I’ve made this in many other pots successfully", 
            "1/2 cup minced shallots, or green onions, or very finely minced onions", 
            "8 parsley sprigs", 
            "1/2 bay leaf", 
            "1/4 teaspoon thyme", 
            "1/8 teaspoon pepper", 
            "6 tablespoons butter", 
            "6 quarts scrubbed, soaked mussels", 
            "1/2 cup roughly chopped parsley ", 
            "6 russet potatoes", 
            "1/4 cup extra-virgin olive oil*", 
            "Salt and freshly ground black pepper "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/08/moules-frites.jpg?w=750", 
        "tags": [
            "French", 
            "Gluten-Free", 
            "Photo", 
            "Seafood"
        ], 
        "url": "https://smittenkitchen.com/2006/08/moules-frites/", 
        "title": "moules à la marinière", 
        "directions": [
            "Preheat the oven to 400 degrees F. Peel potatoes (if peeled fries are your thing, skip it if you couldn’t care) and cut into half-inch thick slices (lengthwise) cut again into 1/2-inch thick fries. Place the potatoes into a pot with cold water and 1 tablespoon of salt. Bring up to a gentle boil and simmer until a paring knife tip goes through easily, cooked about 3/4 of the way through. ", 
            "Drain carefully and put potatoes a bowl. Add olive oil, 1 tablespoon salt, 1/2 teaspoon black pepper. Toss well and lay out in 1 layer on baking sheet. Bake until light brown. ", 
            "* I used less this time, oiling the baking sheet first to limit sticking. He suggests you use a non-stick baking sheet if you have one. (I don’t.)"
        ], 
        "date": "2006-08-26T11:10:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup dried mushrooms like porcini", 
            "2 tablespoons oil", 
            "1 medium onion, diced", 
            "1 medium carrot, diced", 
            "2 cloves garlic, minced", 
            "1 pound mushrooms (you’ll prepare them shortly)", 
            "1/2 cup farro, pearled barley, or spelt, rinsed", 
            "6 cups low sodium or salt-free beef broth or stock (vegetable, mushroom or chicken stock can be swapped)", 
            "1/4 cup dry sherry", 
            "1 tablespoon tomato paste", 
            "Salt and pepper to taste", 
            "1 tablespoon sherry vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/01/mushroom-and-farro-soup-1.jpg?w=750", 
        "tags": [
            "Grain/Rice", 
            "Mushrooms", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2011/01/mushroom-and-farro-soup/", 
        "title": "mushroom and farro soup", 
        "directions": [
            "Cover dried mushrooms with 1 cup boiling water, and set aside for 20 minutes, or while you prepare the rest of the soup. ", 
            "Trim and slice fresh mushrooms, then give them a rough chop to your desired texture.", 
            "Heat oil in heavy-bottomed deep pot. Sauté onions and carrots over medium heat until onions begin to color, about 10 to 15 minutes. Add garlic, and sauté for 30 seconds. Add fresh mushrooms, and cook until they begin to release liquid, about 5 to 10 minutes. Raise heat and add barley; sauté until it begins to color (this didn’t really happen for me, because the mushroom liquid was still sloshing about). Add broth, sherry and tomato paste. Scoop the porcinis out of their soaking liquid (hang onto the liquid) and finely chop them. Strain the soaking liquid to remove any grit and add both this liquid and the chopped porcinis to pot. Season with salt and pepper, and simmer for about 40 minutes, until grains area tender. Stir in sherry vinegar; adjust seasonings and serve."
        ], 
        "date": "2011-01-31T17:00:23+00:00"
    }, 
    {
        "ingredient_list": [
            "Broth", 
            "2 medium-large yellow onions, unpeeled, halved or 1 large onion plus 1 large leek, cleaned and cut lengthwise", 
            "2 garlic cloves, peeled and smashed a little", 
            "1 large carrot", 
            "1 large parnsip (optional)", 
            "1 celery rib", 
            "4 quarts water", 
            "4 pounds chicken bones (from about two carcasses leftover from a roast or rotisserie) or a combination of fresh chicken wings (my first choice), backs, necks or feet", 
            "1 tablespoon kosher salt", 
            "1/2 teaspoon dried thyme or 2 teaspoons chopped fresh", 
            "1/8 teaspoon red pepper flakes", 
            "1 tablespoon tomato paste", 
            "1 bay leaf", 
            "To Finish", 
            "3 bone-in skin-on chicken breast halves", 
            "2 large carrots, peeled and diced or 1 large carrot and 1 large parsnip, diced", 
            "1 large leek, trimmed and sliced into 1/2-inch segments", 
            "1 to 2 celery ribs, chopped or diced", 
            "9 ounces thin egg noodles or soup noodles of your choice", 
            "2 tablespoons finely-chopped flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/my-ultimate-chicken-noodle-soup1.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Photo", 
            "Soup", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/01/my-ultimate-chicken-noodle-soup/", 
        "title": "my ultimate chicken noodle soup", 
        "directions": [
            "Make the broth: ", 
            "[On the stove] Combine all ingredients in a large (6 to 8 quart) stock pot over high heat and bring to a boil. Once boiling, reduce to a gentle simmer, skim any unpleasant looking foam (“skim the scum” is kitchen parlance for this step, but I’m trying to be polite) and cover with a lid. Simmer for 2 1/2 hours. ", 
            "[In a slow-cooker] Combine all ingredients in a large (6 quart or larger) slow-cooker. Cook on LOW for 10 hours or HIGH for 5. Strain into a large pot (5.5 quarts or more) and let rest in the fridge until needed, or, if you’re finishing the soup right away, bring to a simmer on the stove. ", 
            "Cook the chicken:", 
            "[Both methods] Add whole chicken breasts to simmering broth. Simmer for 20 minutes, until they’re cooked through, then strain broth [for stovetop method] or simply remove cooked chicken breasts [from the slow-cooker method] and set them aside. Taste broth, and adjust seasoning if needed. ", 
            "Finish the soup:", 
            "Add diced vegetables to simmering broth on stove and cook for 5 minutes, until firm-tender. Add soup noodles and cook according to package instructions, usually 6 to 10 minutes. Meanwhile, once chicken breasts are cool enough to handle, remove skin and bones and shred or chop into small chunks. Return chicken to soup and simmer for 2 minutes, until heated through. Finish with parsley and serve to some very lucky people. ", 
            "To de-fat the broth: Once the broth portion is complete and the soup has settled a little, you can skim any fat that’s accumulated at the surface with a soup skimmer or spoon, to taste. If you’re going to chill the broth before finishing the soup another day, it’s easiest to take the fat off right before you use it; it will have solidified at the surface. P.S. Don’t toss it, please! It makes for wonderful matzo balls and fried latkes. "
        ], 
        "date": "2015-01-05T11:56:19+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pound plum tomatoes", 
            "3/4 teaspoon coarse salt", 
            "1 large clove garlic, thinly sliced", 
            "Pinch of red pepper flakes", 
            "Small handful basil leaves, most left whole, a few slivered for garnish", 
            "1/4 cup olive oil", 
            "12 ounces (3/4 pound) dried spaghetti", 
            "1 tablespoon unsalted butter, or maybe two if nobody is looking"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/naked-tomato-sauce1.jpg?w=750", 
        "tags": [
            "Italian", 
            "Pasta", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Summer", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2011/08/naked-tomato-sauce/", 
        "title": "naked tomato sauce", 
        "directions": [
            "Bring a large pot of water to boil. Cut a small X at the bottom of each tomato. Blanch the tomatoes in the boiling water for 10 to 30 seconds, then either rinse under cold water or shock in an ice water bath. Peeling the tomatoes should now be a cinch. Discard the skins. Keep the pot full of hot water — you can use it to cook your spaghetti in a bit.", 
            "Cut each of your tomatoes in half lengthwise and scoop out the seeds with your fingertips into a small strainer set over a bowl. Ditch the seeds, reserve the juices.", 
            "Add tomatoes and salt to a large saucepan (you’ll be adding the pasta to this later, so err on the big side) and turn the heat to medium-high. There are several ways to break the tomatoes down (with your hands, chopping, an immersion blender that I don’t think Italian Grandmothers would approve of but don’t worry, they’re not in the kitchen with you anyway) but I loved Conant’s suggestion of a potato masher, as it gives you the maximum control over how chunky, smooth you want your sauce.", 
            "Once the sauce has begun to boil, turn your heat down to medium-low and gently simmer your tomatoes for 35 to 45 minutes, mashing them more if needed. If they begin to look a little dry, add your strained and reserved tomato juices.", 
            "While the tomato sauce cooks, combine garlic, a few whole basil leaves, a pinch of red pepper flakes and 1/4 cup olive oil in a small saucepan. Heat them slowly, over the lowest heat so that they take a long time to come to a simmer. Once it does, immediately remove it from the heat and strain the oil into a small dish. You’ll need it shortly.", 
            "When the tomato sauce has been simmering for about 25 minutes, bring your tomato-blanching pot of water back to a boil with a healthy helping of salt. Once boiling rapidly, cook your spaghetti until it is al dente, i.e. it could use another minute of cooking time. Reserve a half-cup of pasta cooking water and drain the rest.", 
            "Once your sauce is cooked to the consistency you like, stir in the reserved olive oil and adjust seasonings to taste. Add drained spaghetti and half the reserved pasta water to the simmering tomato sauce and cook them together for another minute or two. Add remaining pasta water if needed to loosen the sauce. Stir in the butter, if using, and serve immediately with slivered basil for garnish. We found that sauce this good, this simple and rich, needs no grated cheese."
        ], 
        "date": "2011-08-31T10:25:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2-inch slice seven-grain sandwich bread", 
            "1/2 a large, ripe avocado", 
            "1 tablespoon olive oil", 
            "1 tablespoon lemon juice, or more to taste", 
            "Salt", 
            "An unholy amount of red pepper flakes"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/03/nolita-style-avocado-toast1.jpg?w=640", 
        "tags": [
            "Avocado", 
            "Budget", 
            "Photo", 
            "Quick", 
            "Sandwich", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/03/nolita-style-avocado-toast/", 
        "title": "nolita-style avocado toast", 
        "directions": [
            "Toast the bread so that it’s dark and firm. Scoop the avocado into a bowl and lightly mash/chop it, or directly onto your toast and do the same. Spread the avocado from edge to edge of the toast, leaving no bread uncovered, mounding it smoothly in the center. Drizzle olive oil over so that it rolls off onto the plate. Repeat with lemon juice. Shake or grind on some fine salt and cover with red pepper flakes. Slice toast on the diagonal and eat with a knife and fork, if before noon, with a cup of coffee or tea, if after, a petite glass of rose wine. ", 
            "On the side: If trying to stretch this into a fuller meal, you cannot go wrong with David Lebovitz’s simple carrot salad on the side, or the Moroccan-hinted harissa and feta version in the archives here."
        ], 
        "date": "2016-03-08T12:05:25+00:00"
    }, 
    {
        "ingredient_list": [
            "5 cups (635 grams) whole-wheat flour", 
            "2 cups (160 grams) rolled oats (I used quick-cooking for the least noticable texture)", 
            "1 tablespoon kosher or coarse salt", 
            "3 tablespoons raw or brown sugar, honey or agave nectar", 
            "1 large egg", 
            "1/4 cup (55 grams grams) vegetable or olive oil, plus a little more to coat bowl", 
            "1 1/4 cups lukewarm water", 
            "1 1/4 cups lukewarm milk, any kind", 
            "1 1/2 tablespoons (about 14 grams) instant yeast"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/oat-and-wheat-sandwich-bread1.jpg?w=750", 
        "tags": [
            "Bread", 
            "Freezer Friendly", 
            "Photo", 
            "Sandwich", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/09/oat-and-wheat-sandwich-bread/", 
        "title": "oat and wheat sandwich bread", 
        "directions": [
            "Make bread dough: In the bottom of large mixing bowl, combine water, milk and sugar or honey, then stir in yeast. Add egg and oil and whisk until combined. Add flour, oats and salt and if mixing with a machine, combine with paddle attachment at the lowest speed for 1 minute. If mixing by hand, use a large spoon and stir for 1 minute. The dough will be wet and coarse; do not fret. Let it rest for 5 minutes.", 
            "If using a mixer, switch to the dough hook and mix the dough on medium-low for 2 more minutes. By hand, do the same with your spoon. The dough will seem firm and more smooth, ideally supple and sticky, but if it’s still very wet, add a bit more flour, a spoonful at a time. If it seems excessively stiff, add a little more water, a spoonful at a time. Continue to mix with dough hook or by hand for 4 minutes.", 
            "Scrape dough out onto lightly floured counter. Knead a few times, then form the dough into a ball. Oil your empty mixing bowl and return dough to it. Cover with plastic wrap and let proof at room temperature for 60 to 70 minutes, or until doubled in buik or transfer to the fridge and let it ferment overnight or up to 5 days. If proofing in the fridge, remove the dough before the fridge about 3 hours before you plan to bake it.", 
            "Form loaves: [Edited to add:] Lightly coat two standard loaf pans with oil, butter or a nonstick spray. Turn dough onto a floured counter and divide it into two equal pieces. Press each gently into a rough rectangle-ish shape. Fold in sides so that the first dough is roughly the width of your prepared bread loaf pan (about 9 inches). Roll from bottom to top and then put this log into your bread loaf pan, seam side down. Repeat with remaining dough. Let proof at room temperature for about an hour, or until the dough has crowned 1 inch above the rim of the baking pan. Halfway through, heat oven to 350 degrees F.", 
            "Bake bread: For 35 to 40 minutes, rotating pans once for even color. A cooked loaf of bread will sound a bit hollow when tapped and the internal temperature should read 190 degrees F. Remove loaves from tins and let cool on a rack. If you’re planning to freeze bread, I like to let it cool completely before slicing it, then sliding the sliced loaf into freezer bags. You can mark them with a date, but they rarely last long enough to be forgotten."
        ], 
        "date": "2015-09-21T12:24:24+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds or about 5 cups of thinly sliced yellow onions (Deb note: I find even 6-7 cups is never too much)", 
            "3 tablespoons butter", 
            "1 tablespoon oil", 
            "A heavy-bottomed 4-quart covered saucepan", 
            "1 teaspoon salt", 
            "1/4 teaspoon sugar (helps the onions to brown)", 
            "3 tablespoons flour", 
            "2 quarts boiling brown stock, canned beef bouillon, or 1 quart of boiling water and 1 quart of stock or bouillon", 
            "1/2 cup dry white wine or dry white vermouth", 
            "Salt and pepper to taste", 
            "3 tablespoons cognac", 
            "Rounds of hard-toasted French bread (see following recipe)", 
            "1 to 2 cups grated Swiss or Parmesan cheese (Deb note: I always use cave-aged gruyere)", 
            "1 1/2 tablespoons Champagne vinegar", 
            "1 teaspoon Dijon mustard", 
            "1 very small clove minced fresh garlic or 1 tablespoon minced shallot", 
            "1 egg yolk, at room temperature (Just omit it if it freaks you out)", 
            "1/4 teaspoon salt", 
            "1/8 teaspoon black pepper", 
            "1/4 cup good olive oil "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/paris-instead1.jpg?w=500", 
        "tags": [
            "French", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2006/12/paris-instead/", 
        "title": "onion soup", 
        "directions": [
            "Salad greens or mesclun mix for 2 to 4 people", 
            "Whisk everything together. The Dijon and egg yolk act as emulsifiers so you don’t need to do that slow drizzle thing to convince them to merge.", 
            "Note: If you’re worried about raw egg, just omit it."
        ], 
        "date": "2006-12-12T09:32:09+00:00"
    }, 
    {
        "ingredient_list": [
            "Broth", 
            "8 ounces cheese rinds, any paper at the ends removed", 
            "6 cups water", 
            "1 large onion, peeled and quartered", 
            "3 cloves garlic, peeled and smashed", 
            "1/2 teaspoon whole peppercorns", 
            "Handful of flat-leaf parsley", 
            "Salt, to taste", 
            "To serve", 
            "2 to 3 ounces tuscan kale (also known as black or lacinato kale; this is the thinner, flatter leaf variety), washed and patted dry (updated measurement)", 
            "1 1/4 cups cooked white beans (from about 1/4 pound dried), with their cooking liquid if fresh (usually about 1 1/2 cups) (updated measurement)", 
            "Thin slices of baguette, toasted", 
            "Olive oil and parmesan for serving"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/parmesan-broth-with-kale-and-white-beans1.jpg?w=500", 
        "tags": [
            "Announcements", 
            "Appetizers + Party Snacks", 
            "Beans", 
            "Italian", 
            "Kale", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2014/01/parmesan-broth-with-kale-and-white-beans/", 
        "title": "parmesan broth with kale and white beans", 
        "directions": [
            "Beans: I used cannelini beans for this the first time, but I spied some of Rancho Gordo’s Yellow-Eye beans in my cabinet (which are a great swap for white beans, wherever you use them) and had to use them instead, as it was just a day or two after New Years and I hadn’t gotten my black-eyed pea fix. The only downside of using a non-white bean such as this is that if you want to add the bean broth to your soup, it will change the color to something even less pretty.", 
            "How to cook dried beans: I promise, a separate post is coming on this. In the meanwhile, if you have time to soak your beans (cover them with way more water in a bigger bowl than you think you’ll need and leave them to soak for 8 hours or up to 24), do it, I find that it cuts stovetop time in half, or at least down by 1 hour. I dump it, soaking liquid and all, into a heavy pot, add more water (plus any aromatics you’d want, herbs, bay leaves, spice, onions, or garlic, but hold off on the salt for now) and bring the pot to a full boil. Boil it for one full minute, skimming any foam or, ahem, “scum” that floats, then reduce the heat to the lowest simmer possible, checking it from time to time and adding more liquid if needed. Your beans, depending on variety/age/if you soaked them, will take 1 to 3 hours to cook from here. My soaked-overnight white beans took just 1 hour. Once they are mostly softened, you can add salt to taste. Store them in their cooking liquid, which you should seriously consider adding to any/all soups as extra broth. Don’t dump all the flavor down the drain. I’ve also cooked beans many times, usually without bothering to soak, in a slow-cooker, for anywhere from 2 1/2 to 5 hours on HIGH (or longer on LOW). Yes, it takes longer, but the beauty of the slow-cooker is that it’s hands-off, while a stovetop needs to be somewhat monitored.", 
            "Not technically vegetarian: Strict vegetarians do not eat Parmesan as calf rennet is used in production. (More here.)"
        ], 
        "date": "2014-01-06T12:15:51+00:00"
    }, 
    {
        "ingredient_list": [
            "Pancakes", 
            "1/2 pound (about 1 large) Russet potato", 
            "1 tablespoon fresh lemon juice", 
            "1 pound parsnips (about 2 large or 4 medium)", 
            "1/4 cup all-purpose flour", 
            "1 teaspoon baking powder", 
            "2 large eggs, lightly beaten", 
            "2 tablespoons chopped fresh dill", 
            "1 teaspoon table salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "Olive oil (or a mix of olive and vegetable or peanut oil) for frying", 
            "Sauce", 
            "1 cup sour cream", 
            "1 tablespoon lemon juice", 
            "1/2 teaspoon table salt", 
            "1 tablespoon freshly grated or prepared horseradish", 
            "1 tablespoon chopped dill"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/12/parsnip-latkes-with-horseradish-and-dill.jpg?w=749", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Hanukah", 
            "Jewish", 
            "Pancakes", 
            "Parsnips", 
            "Photo", 
            "Potatoes", 
            "Snack", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/12/parsnip-latkes-with-horseradish-and-dill/", 
        "title": "parsnip latkes with horseradish and dill", 
        "directions": [
            "Preheat: Oven to 250 degrees. Line one large or two smaller baking sheets with foil and leave them in the oven until needed.", 
            "Prepare vegetables: Peel vegetables and grate them on the large holes of a box grater or (my preferred method) using the shredding blade of a food processor. If using the food processor, I like to lay the vegetables sideways in the chute, in an attempt to get the longest strands of vegetables. This creates latkes that look like little piles of mops, which is my goal.", 
            "Transfer shredded vegetables to a lint-free dishtowel or square of cheesecloth, and wring out as much liquid as possible. Let stand for two minutes, then wring again. Wetness is the enemy of crisp, light latkes, so we want to get rid of as much as possible.", 
            "Make batter: Transfer wrung-out vegetables to a large bowl. Add lemon juice. In a tiny dish, stir together the flour, baking powder, salt, pepper and any herbs or additional seasonings and toss with vegetables, evenly coating the strands. In the same tiny dish, whisk your egg(s) and then stir this into the vegetable-flour mixture, evenly coating the strands.", 
            "Prepare pan: Heat a large, heavy skillet, preferably cast iron, over medium heat. Once skillet is hot, add 3 tablespoons oil and heat oil until shimmering. If you’re unsure, you can flick a droplet of water onto the oil; if it hisses and sputters, you’re good to go.", 
            "Cook: Using a fork or your fingertips (letting the eggy batter drain off a little is good), gather spoonful-sized mounds of battered vegetables and drop them onto the heated skillet. When golden underneath, 3 to 4 minutes later, flip pancakes. [If you’re using a gas range, you’ll likely have to rotate your pancakes 180 degrees halfway through the cooking time so that they color evenly underneath.] Cook on the other side until nicely bronzed underneath, another 2 to 3 minutes, and transfer to paper towels briefly to drain pancakes, before transferring them again to tray(s) in warm oven. If latkes cook too quickly or slowly on the stove, adjust the heat accordingly.", 
            "Add more oil if needed (you want to keep the pan at that 3 tablespoon level), being sure it is heated before adding more pancakes to the skillet. Repeat with remaining batter.  I like to keep the latkes in the oven for at least 10 minutes to ensure they’ve cooked through before serving them. This gives you time to…", 
            "Make sauce: Mix sauce ingredients in a small dish. Adjust seasonings to taste.", 
            "Serve: Warm with a dollop of the sauce."
        ], 
        "date": "2011-12-22T13:13:41+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds uncooked chicken wings", 
            "3 quarts water", 
            "1 large onion, chopped", 
            "1 garlic clove, smashed", 
            "1 teaspoon table salt, or more to taste*"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/perfect-uncluttered-chicken-stock1.jpg?w=640", 
        "tags": [
            "Chicken", 
            "Photo", 
            "Slow Cooker", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2013/11/perfect-uncluttered-chicken-stock/", 
        "title": "perfect, uncluttered chicken stock", 
        "directions": [
            "How should I use this? You can use this as stock or broth in any soup. You can use it to cook grains or beans. But most importantly, the flavor is so wonderful that you can have it straight. It particularly excels in broth-y soups, like Chicken Noodle, Matzo Ball and Italian Wedding-style soups, where you directly taste the stock. Here, I show you how I simmered in some vegetables (and later, chicken chunks) to make a chicken noodle soup. Next, I’d love to talk about soup noodles, but at 1,500-plus words here, I think I’ve done run out of space, eh?", 
            "How should I store this? If I’m not using it immediately, I divide it into 1 quart freezer bags and freeze them flat. This is a great old trick from Real Simple magazine, as the flat bags can easily be dipped in hot water for quick defrosting. 1 quart of stock in gallon bags will freeze even thinner and flatter. They also stack well in the freezer. I won’t lie; I felt like a SuperDuperDomesticDiva when I can heat up one of these with some simple vegetables and noodles when one of us is getting sick. Then I remember I don’t want to set the table and hate doing dishes and go back to being myself. Anyway, it can also be frozen in ice cube trays for tiny amounts (great to add flavor to cooked grains or beans) and CI recommends nonstick standard muffin pans for 1/2-cup servings.", 
            "Why chicken wings? In Cook’s Illustrated’s chicken broth tests, they found that both chicken legs along and necks and backs lent a “livery” taste to the broth. In my own experiments, saving the backs of chickens that I take apart in the freezer to later make broth with, I reluctantly agree (i.e. I wish it were some other way). Chicken wings, with their high bone-to-flesh ratio, made most refined and full-flavored broth and it took me a single sip of this stock to be fully converted.", 
            "Do I have to toss the cooked wings when I’m done? Yes and no. I find them overcooked, but not really inedible, so it’s a matter of preference. One thing I love about this recipe is that wings have so little usable flesh, it feels less wasteful than making chicken with larger parts can be (especially because they usually get overcooked and tough, thus, at least I do want to eat them).", 
            "* What’s the difference between stock and broth? In most grocery store aisles, they’re used interchangeably but technically, there are small small differences. Stock is often heavier in bones and things that will add body, as this recipe is, though it doesn’t have to be. However, it is unseasoned, which means to make this a true stock, you would skip the salt. Stock is often used in restaurants to make reductions (it is really the backbone of restaurant cooking), and if you reduce something already salty, obviously, you will have an oversalted mess. So, salt is added when needed for final dishes.", 
            "Why did this take you two years to tell us about it, Deb?! I was reluctant at first to share this recipe (despite being unable to stop myself from gushing about it to anyone who asked and a great many people who did not) because it felt excessively lush to me. I mean, three pounds of wings just to throw them away? Given, it’s quite easy to buy wings inexpensively in bulk (sometimes as disturbingly cheap as $1/pound), but if you prefers to buy local/cage-free/etc.-type chicken, it’s not exactly the cheapest way to approach what’s supposed to be the most economical kitchen ingredient, designed to use up scraps. But, when I actually ran the numbers, using wings on the priciest end of the spectrum (here, organic/antibiotic-free $3.99/pound and each pound of parts yields 1 quart of stock) the equivalent stuff from the box (the organic, free-range broth I’d buy is $4.50/quart, boasted such lovely ingredients as “yeast extract” and “chicken flavor), I realized that even if the taste didn’t speak for itself (it will), I’d been wrong about the cost. ", 
            "When are you going to make a life-changing vegetable broth, for the rest of us? Soon. But it’s far more complicated because I don’t think that there is one magical combination of vegetables that will yield the ideal vegetable stock, it’s more about what flavors you enjoy lingering in the background your soups. Boy, I’m glad we had this talk because the kind of vegetable stock I’d like to make just totally hit me. ", 
            "[New additions to the list, based on comments below]", 
            "Why is my stock so thick? I’m sorry I didn’t mention this sooner, but if you’ve never made stock before, it might have been a surprise to find that it became like Jell-o in the fridge over night. This is a good thing; this is excellent! It actually became exactly like Jell-o because stocks cooked for a long time with bones release the natural collagen in them. Stocks that jiggle when cool are the ones with the best and deepest flavors. Once warmed (even a little), it will immediately re-liquefy — do not fret. ", 
            "I had expected more flavor. If this stock ended up not having the flavor you were hoping for, there are a couple directions you could go in:", 
            "* Edited again to add: However, upon further consideration, my first choice would be #2, to cook it longer. With this many bones and that little water, I’m more and more convinced that any lack of flavor just means that it’s possible your slow-cooker is more gentle on heat than others (I do know that mine is on the robust/running-hot side), and that it would benefit from more cooking time. The flavor is there, in the bones, it’s just a matter of whether the stock has been cooked enough to access it. "
        ], 
        "date": "2013-11-07T11:55:29+00:00"
    }, 
    {
        "ingredient_list": [
            "Pickling mixture", 
            "1 cup distilled white vinegar", 
            "4 tablespoons sugar", 
            "2 tablespoons Kosher salt", 
            "2 tablespoons yellow mustard seeds", 
            "1 cup cold water", 
            "Slaw mixture", 
            "4 to 5 cups mixed slivered or julienned* firm, raw vegetables (see above for vegetable suggestions, below for slicing tips)", 
            "Optional: Few slivers of jalapeno"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/06/pickled-vegetable-sandwich-slaw.jpg?w=750", 
        "tags": [
            "Photo", 
            "Pickled", 
            "Picnics", 
            "Salad", 
            "Sandwich", 
            "Side Dish", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/06/pickled-vegetable-sandwich-slaw/", 
        "title": "pickled vegetable sandwich slaw", 
        "directions": [
            "Heat vinegar, sugar, salt and mustard seeds to a simmer in a small, non-reactive pot over moderate heat, stirring only until sugar and salt dissolve. Stir in water, which should bring the mixture’s temperature down significantly. Let cool to lukewarm. ", 
            "Divide vegetables between jars. (I used two 3/4 liter jars.) Pour vinegar mixture over vegetables and refrigerate until needed. You’ll find the vegetables to be lightly pickled within an hour, and deliciously pickled within a day. They will get slightly more pickled as they sit, but the change shouldn’t be too dramatic from the 24 hour level.", 
            "Eat with/on sandwiches, aside grilled food and pack it along for picnics — it goes with almost anything. Then make more, because this stuff is habit-forming.", 
            "Do ahead: Mine have kept in the fridge for a month without any change in taste or appearance. Updated to add (thanks, Erika!) that you’ll want to make sure that your vegetables are submerged in the brine for them to keep this long.", 
            "* I used a mix of a sharp knife, a simple mandoline (that includes julienne blades) and a julienne peeler (the Kuhn one), which I was embarrassed to admit I bought last year until I realized how much easier it makes getting juliennes from long, thin vegetables (carrots, cucumbers, parsnips and zucchini). Don’t fret if you don’t have a fancy peeler or mandoline; you can cut thin strips with your knife, then slice them into skinny matchsticks quite easily."
        ], 
        "date": "2013-06-27T11:28:55+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoon olive or a neutral oil", 
            "6 tablespoons (70 grams) unpopped popcorn kernels", 
            "1 cup nuts (I used peanuts, which weigh 140 grams)", 
            "2 cups bite-sized pretzels, or bigger ones, broken up", 
            "1 cup broken-up plain bagel or pita chips, oyster crackers or melba toast", 
            "6 tablespoons (85 grams) unsalted butter", 
            "2 tablespoons Worcestershire sauce", 
            "2 teaspoons (8 grams) dark brown sugar", 
            "1/2 tablespoon smooth Dijon mustard", 
            "1/2 teaspoon mustard powder", 
            "3/4 teaspoon fine sea salt, adjusted to taste", 
            "1 teaspoon ground smoked paprika", 
            "1/4 teaspoon cayenne, or more to taste", 
            "1 teaspoon garlic powder", 
            "1 teaspoon onion powder"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/popcorn-party-mix1.jpg?w=750", 
        "tags": [
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2014/12/popcorn-party-mix/", 
        "title": "popcorn party mix", 
        "directions": [
            "Heat oven to 250°F (120°C).", 
            "Pop your popcorn: Place 3 tablespoons olive oil and 2 to 3 kernels in a 3-quart or larger pot and cover with a lid. Turn heat to medium-high. When you hear these first kernels pop, add the remaining kernels and replace the lid. Using potholders, shimmy the pot around to keep the kernels moving as they pop. When several seconds pass between pops, remove from heat. You should have just over 6 cups. Dump into a giant mixing bowl and add the nuts, pretzels, chips or crackers to the popcorn. ", 
            "Brown your butter and make the sauce: Wipe out your empty pot and place the butter in it, set over medium heat (no lid needed). Melt the butter and keep cooking it, stirring occasionally and watching out for hisses and splatters, until the bits at the bottom of the melted butter puddle begin to turn golden and light brown. Remove from heat, and whisk in Worcestershire, sugar, spices and salt. If you ended up using pre-popped or seasoned popcorn with salt, or salted nuts or crackers, you might go easier on the salt. If you like your mix quite traditionally salty and none of your packaged ingredients were coated with salt, you might up it to a full teaspoon. ", 
            "Pour butter-spice mixture over popcorn mix and toss, toss, toss, until all the ingredients are evenly coated. Spread out on your biggest baking sheet or two medium-sized ones. Bake for 45 minutes, tossing the ingredients around every 15 so that they cook evenly. Let cool completely on trays, then pack into jars and get on your way."
        ], 
        "date": "2014-12-31T10:18:17+00:00"
    }, 
    {
        "ingredient_list": [
            "2 teaspoons good olive oil", 
            "2 cups large-diced yellow onions (2 onions)", 
            "2 cups large-diced carrots (3 to 4 carrots)", 
            "1 tablespoon minced garlic (3 cloves)", 
            "1 (28-ounce) can whole plum tomatoes", 
            "1 cup French green lentils (7 ounces)", 
            "2 cups vegetable or chicken broth", 
            "2 teaspoons mild curry powder", 
            "2 teaspoons chopped fresh thyme leaves", 
            "2 teaspoons kosher salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "1 tablespoon red wine vinegar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/queens-and-contessas1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Freezer Friendly", 
            "Photo", 
            "Stew", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2006/10/queens-and-contessas/", 
        "title": "stewed lentils and tomatoes", 
        "directions": [
            "Heat the oil in a large saucepan. Add the onions and the carrots and cook over medium-low heat for 8 to 10 minutes, until the onions start to brown. Stir occasionally with a wooden spoon. Add the garlic and cook for one minute more.", 
            "Meanwhile, place the canned plum tomatoes, including the juice, in the bowl of a food processor fitted with a steel blade and pulse several times until the tomatoes are coarsely chopped. Rinse and pick over the lentils to make sure there are no stones in the package.", 
            "Add the tomatoes, lentils, broth, curry powder, thyme, salt and pepper to the pan. Raise the heat to bring to a boil, then lower the heat and simmer covered for about 40 minutes, until the lentils are tender. Check occasionally to be sure the liquid is still simmering. Remove from the heat and allow the lentils to sit covered for another 10 minutes. Add the vinegar, season to taste and serve hot."
        ], 
        "date": "2006-10-30T12:45:45+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup extra virgin olive oil", 
            "1/4 cup chopped fresh ginger (I use half this; I’m tepid in the fresh ginger department)", 
            "1 medium onion, finely chopped", 
            "1 plum tomato, diced", 
            "3 cloves garlic, chopped", 
            "1 large green chili, chopped (optional)", 
            "1 teaspoon salt", 
            "1 teaspoon ground cumin", 
            "1 teaspoon ground coriander", 
            "1/2 teaspoon cumin seeds", 
            "1/2 teaspoon ground tumeric", 
            "1/4 teaspoon cayenne", 
            "8 ounce can of tomato sauce or 8 ounces of one of your choice", 
            "3 cups boiled red kidney beans or 30 ounces canned red kidney beans, undrained", 
            "1/2 cup chopped fresh cilantro (or parsley, if you’re cilantro-averse)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/02/red-kidney-bean-curry.jpg?w=753", 
        "tags": [
            "Beans", 
            "Freezer Friendly", 
            "Indian", 
            "Photo", 
            "Quick", 
            "Stew", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/02/red-kidney-bean-curry/", 
        "title": "red kidney bean curry", 
        "directions": [
            "Heat oil in a deep sauce pan over medium heat for one minute. Add ginger, garlic, onion, green chili, and let sizzle for one minute. Add the tomato sauce, salt and remaining spices and cook for an additional five minutes, stirring frequently. Add the kidney beans with water or canned red kidney beans (undrained) plus one additional cup of water, and tomatoes. Bring it to a boil, then reduce to medium heat and let cook uncovered for 10 minutes. Remove from heat. Garnish with cilantro.", 
            "Serve over rice or with naan. A dollop of plain yougurt on top is heavenly."
        ], 
        "date": "2009-02-17T19:21:06+00:00"
    }, 
    {
        "ingredient_list": [
            "3 medium tomatoes, halved", 
            "1 large eggplant (about 1 1/2 pounds), halved lengthwise (I used 3 smaller ones)", 
            "1 small onion, halved (eh, mine was medium)", 
            "6 large garlic cloves, peeled", 
            "2 tablespoons olive oil", 
            "1 tablespoon chopped fresh thyme or 1 teaspoon dried", 
            "4 cups chicken stock or vegetable broth", 
            "1/4 cup heavy cream (you can add more to taste, or skip this entirely)", 
            "3/4 cup (about 3 1/2 ounces) crumbled goat cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-eggplant-soup1.jpg?w=500", 
        "tags": [
            "Eggplant", 
            "Fall", 
            "Photo", 
            "Soup", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/10/roasted-eggplant-soup/", 
        "title": "roasted eggplant soup", 
        "directions": [
            "Preheat oven to 400°F. Arrange tomatoes, eggplant, onion and garlic on a large baking sheet, or two smaller ones if you, like me, have a tiny oven. Brush or drizzle vegetables with oil then roast them for 20 minutes, pausing only to remove the garlic cloves (the original recipe had you keep them in the whole time, and mine, sadly, burned) and returning the pans to the oven for another 25 minutes, until the remaining vegetables are tender and brown in spots. Remove from oven and scoop eggplant from skin into a heavy, large saucepan or soup pot. Add the rest of the vegetables, the thyme and the chicken or vegetable stock and bring to a boil, then reduce to a simmer. Cook until onion is very tender, about 45 minutes (mine took longer). Cool slightly.", 
            "Working in batches, puree soup in blender until it is as smooth as you’d like it to be. (Or, if you have an immersion blender, you can do this in the pot.) Back in the pot, add the cream and bring the soup back to a simmer. Season with salt and pepper. Serve in four bowls, sprinkled with goat cheese.", 
            "A spicier riff: As I mentioned above, if you like to play with spices, this soup has a lot of potential. The next time I make it, I might give it a spin with 1 to 2 teaspoons ground cumin, 1 teaspoon ground coriander and a pinch of red pepper flakes or Aleppo pepper added in with the broth. I might finish the soup with a squeeze of lemon juice and I might use feta, which has a stronger flavor than the soft chevre that I used. If you add any spices or made any changes, I’d love to hear what you came up with in the comments."
        ], 
        "date": "2010-10-13T10:03:18+00:00"
    }, 
    {
        "ingredient_list": [
            "Soup", 
            "3 pounds plum tomatoes, halved lengthwise", 
            "2 tablespoons olive oil", 
            "2 large or 4 small cloves garlic, unpeeled", 
            "1 teaspoon finely chopped fresh thyme leaves or 1/4 teaspoon dried", 
            "1/4 teaspoon (or more to taste) dried crushed red pepper", 
            "4 cups chicken or vegetable stock", 
            "Lid", 
            "4 1-inch slices from a large loaf of rye bread, whole wheat sourdough or bread of your choice (or 16 1-inch slices from a baguette), toasted until hard and lightly buttered on one side", 
            "1 tablespoon grated raw onion", 
            "1 cup coarsely grated cheddar (or more to taste)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/09/roasted-tomato-soup-with-broiled-cheddar.jpg?w=750", 
        "tags": [
            "Photo", 
            "Soup", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/09/roasted-tomato-soup-with-broiled-cheddar/", 
        "title": "roasted tomato soup with broiled cheddar", 
        "directions": [
            "Make soup: Preheat oven to 400°F. Wrap garlic cloves in a tight foil packet. Place tomatoes, cut side up, on large baking sheet. Sprinkle generously with salt and pepper (I used 1 full teaspoon of Kosher salt). Drizzle tomatoes with olive oil.  Add foil packet of garlic to tray. Roast until tomatoes are brown and tender (garlic will be very tender), about 1 hour. Cool slightly.", 
            "Unwrap garlic packet and peel cloves. Transfer cloves, tomatoes and any accumulated juices to a blender or food processor and pulse machine on and off until tomatoes are a chunky puree. Transfer tomatoes to medium pot and add thyme, crushed red pepper and stock and bring to a boil Reduce heat to a simmer and cook, uncovered, for 25 minutes. Remove from heat and adjust seasonings to taste.", 
            "Create cheddar lid: Preheat oven to 350. Arrange four ovenproof soup bowls, crocks or large mugs on a large, foil-lined baking sheet. Stir grated onion into the warm soup. (I love this last-minute suggestion of onion.) Float toast slice(s) in each bowl, buttered side up and divide grated cheese generously over top. (If you’re using a wide bowl, you might find that you want more cheese to create a thick, broiled lid.)  Bake soups on tray for 15 to 20 minutes, until cheese on top is bubbling and brown at the edges. If you’d like it even more bronzed on top, preheat your broiler and finish soups for a minute or two under it. Serve immediately.", 
            "Do ahead: Soup can be prepared one day ahead, and kept covered in the fridge. Rewarm before serving, or before finishing with cheddar crouton."
        ], 
        "date": "2011-09-20T13:49:02+00:00"
    }, 
    {
        "ingredient_list": [
            "2/3 cup water", 
            "1 tablespoon butter", 
            "1/2 teaspoon salt", 
            "1/2 cup semolina", 
            "1 tablespoon Parmesan cheese", 
            "1 egg, lightly beaten", 
            "1 tablespoon chopped parsley or chives (optional)", 
            "1 carrot, peeled, cut into short, fat matchsticks", 
            "1 parsnip, peeled, cut the same as the carrot", 
            "Few tablespoons snipped chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/semolina-dumpling-soup1.jpg?w=500", 
        "tags": [
            "Dumplings", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/05/semolina-dumpling-soup/", 
        "title": "semolina dumpling soup", 
        "directions": [
            "Once your stock is ready, add the carrots and parnsips and simmer them until they’re almost cooked, about five minutes. You can make the dumplings while you wait. Once everything is cooked, garnish (or forget to, in our case) and serve quickly."
        ], 
        "date": "2008-05-21T15:49:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 head cauliflower", 
            "2 tablespoons extra-virgin olive oil", 
            "1 small onion, chopped", 
            "2 cloves garlic, minced", 
            "1 quart low-sodium chicken stock", 
            "1/2 cup finely grated Parmesan", 
            "Salt and freshly ground black pepper ", 
            "2 tablespoons mayonnaise – or – 1 egg", 
            "1 tablespoon fresh lemon juice", 
            "1/2 teaspoon Dijon mustard", 
            "1 small garlic clove, minced", 
            "1/2 teaspoon Worcestershire sauce", 
            "1 oil-packed anchovy fillet, finely chopped (optional)", 
            "1/4 cup extra-virgin olive oil", 
            "10 to 12 ounces good-quality solid tuna packed in olive oil, well drained*", 
            "2 scallions washed, trimmed and chopped fine", 
            "6 pepperoncini peppers, destemmed and julienned", 
            "3 tablespoons chopped fresh dill", 
            "1/4 cup roasted or smoked almonds, chopped roughly, or a small handful toasted pine nuts", 
            "1/4 cup good-quality olive oil (or the oil the tuna was packed in)", 
            "1 tablespoon smooth Dijon mustard", 
            "1 tablespoon whole-grain mustard", 
            "1 teaspoon balsamic vinegar", 
            "1 teaspoon fresh lemon juice or more to taste", 
            "1/4 to 1/2 teaspoon freshly ground black pepper. "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/09/silky-cauliflower-soup.jpg?w=749", 
        "tags": [
            "Cauliflower", 
            "Gluten-Free", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Seafood", 
            "Soup", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2006/09/silky-cauliflower-soup/", 
        "title": "silky cauliflower soup", 
        "directions": [
            "Mix all the ingredients well with a fork in a medium-size, nonreactive bowl. Taste and adjust the lemon juice and pepper. The salad can be made up to 3 days in advance and refrigerated. ", 
            "* I’ve done this two ways, with oil-packed and the reserved oil, as well as using drained water-packed and adding in 1/4 cup olive oil, and have to say that I find the latter to be a far less oil-slicked result. You can always add more olive oil, but I found it hard to take away the heaviness the oil-packed came with."
        ], 
        "date": "2006-09-03T11:54:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 15-ounce can chickpeas, drained and rinsed", 
            "2 tablespoons pitted, halved and very thinly sliced black olives", 
            "1 tablespoon finely chopped red onion", 
            "1 tablespoon chopped fresh parsley", 
            "Zest and juice from half a lemon (if you’ve got one of those sad, juiceless lemons, use both sides for juice)", 
            "Couple good pinches of salt", 
            "A few grinds of black pepper", 
            "A few glugs of olive oil (the original is quite oily, like bread-soaking oily, I went a little lighter. Both ways are delicious)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/smashed-chickpea-salad1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Budget", 
            "Lunch", 
            "Photo", 
            "Salad", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2009/01/smashed-chickpea-salad/", 
        "title": "smashed chickpea salad", 
        "directions": [
            "Mix everything but the olive oil in a small to midsize bowl. Very lightly smash the chickpea mixture with the back of a fork or a potato masher. You’re not looking for a hummus-like puree but something closer to a coarse chop with a few smaller bits to hold it together. Add the glugs of olive oil, mix it lightly and enjoy.", 
            "This is also awesome as a sandwich on toasted bread, and it needs nothing else on it. But, if you want to doll it up, here are some ideas: A slice of roasted red pepper (as they do at ‘wichcraft), watercress (ditto), a slice of pickled garlicky red pepper (our way). We schmeared the bread with a tahini dressing, which was just tahini, lemon juice and a minced garlic clove thinned with water, but if you’ve got some harissa, I bet that would also be delicious."
        ], 
        "date": "2009-01-19T14:07:00+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup mayonnaise", 
            "1/2 cup sour cream", 
            "1 tablespoon prepared horseradish", 
            "1 tablespoon Worcestershire sauce", 
            "2 tablespoons Creole mustard, or a mustard that you prefer", 
            "1 teaspoon smoked paprika", 
            "Zest and juice from 2 lemons", 
            "2 tablespoons Tabasco sauce (see Note; I skipped this)", 
            "1 teaspoon cayenne powder (I used much less)", 
            "3 green onions, thinly sliced (white and green parts)", 
            "1 stalk celery, finely diced", 
            "1/2 jalapeño, finely chopped (I skipped this)", 
            "1/2 medium yellow onion, finely diced (and this)", 
            "1 pound skinned and flaked smoked whitefish", 
            "Salt and pepper, to taste", 
            "Saltine crackers to serve", 
            "1 tablespoons finely chopped chives, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/smoked-whitefish-dip-horseradish1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Lunch", 
            "Photo", 
            "Recipes", 
            "Salad", 
            "Seafood", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2014/11/smoked-whitefish-dip-with-horseradish/", 
        "title": "smoked whitefish dip with horseradish", 
        "directions": [
            "Make the dressing by mixing mayonnaise, sour cream, horseradish, Worcestershire, mustard, paprika, zest and lemon juice, hot sauce (if using), cayenne (to taste), green onions, celery, jalapeño (if using) and onion in a medium bowl. Season with salt and pepper to taste.\nPlace skinned and flaked whitefish in a larger bowl. Add dressing to taste (we used about 3/4 of it total) and adjust seasonings with salt and pepper. Serve with crackers, garnished with chives.\n"
        ], 
        "date": "2014-11-03T11:53:27+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon unsalted butter", 
            "1 tablespoon olive oil", 
            "1 medium yellow onion, small dice", 
            "4 medium cloves garlic, thinly sliced", 
            "2 teaspoons ground cumin", 
            "1 (3-inch) cinnamon stick", 
            "Salt and freshly ground black pepper", 
            "1 pound butternut squash, large dice", 
            "3/4 pound red potatoes, large dice", 
            "2 cups low-sodium chicken or vegetable broth", 
            "2 cups cooked chickpeas, drained", 
            "1 (14-ounce) can diced tomatoes, with juices", 
            "Pinch saffron threads (optional)", 
            "1/2 preserved lemon, finely chopped", 
            "1 cup brined green olives (Aida recommended Cerignola)", 
            "Steamed couscous, for serving (directions here and elsewhere on the web)", 
            "Fresh cilantro leaves, roughly chopped, for garnish", 
            "Toasted slivered almonds, for garnish", 
            "Plain yogurt, for garnish", 
            "Hot sauce of your choice (for serving)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/squash-and-chickpea-moroccan-stew1.jpg?w=500", 
        "tags": [
            "Beans", 
            "North African", 
            "Photo", 
            "Stew", 
            "Vegan", 
            "Vegetarian", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2009/01/squash-and-chickpea-moroccan-stew/", 
        "title": "squash and chickpea moroccan stew", 
        "directions": [
            "Heat butter and olive oil in a 3- to 4-quart Dutch oven or heavy-bottomed saucepan with a tight fitting lid over medium heat. When oil shimmers, add onion, garlic, cumin, and cinnamon, and season with salt and freshly ground black pepper. Cook, stirring occasionally, until spices are aromatic and onions are soft and translucent, about 5 minutes.", 
            "Add squash and potatoes, season with salt and freshly ground black pepper, stir to coat, and cook until just tender, about 3 minutes. Add broth, chickpeas, tomatoes and their juices, and saffron, if using. Bring mixture to a boil then reduce heat to low. Cover and simmer until squash is fork tender, about 10 minutes.", 
            "Remove from heat and stir in preserved lemon and olives. Serve over couscous garnished with cilantro, almonds, and yogurt. "
        ], 
        "date": "2009-01-07T13:39:08+00:00"
    }, 
    {
        "ingredient_list": [
            "2 teaspoons vegetable oil", 
            "2 garlic cloves, minced", 
            "1/2 cup hoisin sauce", 
            "1 tablespoon light soy sauce", 
            "3 tablespoons sake or dry sherry", 
            "1 tablespoon ketchup", 
            "1 tablespoon rice vinegar", 
            "1/2 teaspoon Asian sesame oil (I used the hot stuff)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/09/1316357035_e78a5e3f54_o.jpg?w=753", 
        "tags": [
            "Grilling", 
            "Photo", 
            "Savory Sauces and Condiments"
        ], 
        "url": "https://smittenkitchen.com/2007/09/stand-up-eats/", 
        "title": "hoisin barbecue sauce", 
        "directions": [
            "Heat the vegetable oil in a small saucepan and cook the garlic over moderately low heat until fragrant, about two minutes. Add the hoisin sauce, soy sauce, sake, ketchup and rice vinegar and simmer over moderately low heat, stirring, until thickened, about three minutes. Remove from the heat and stir in the sesame oil. Let cool and serve. ", 
            "Do ahead: The hoisin barbecue sauce can be refrigerated for 2 days, frozen for a month."
        ], 
        "date": "2007-09-04T22:52:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (12-ounce) 1-inch thick New York strip boneless beef top loin steak", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "Olive oil", 
            "2 yellow onions, sliced in rings", 
            "1/2 teaspoon fresh thyme leaves", 
            "Mustard Mayo, recipe follows", 
            "2 mini focaccia buns, sliced in 1/2 (we used a small ciabatta)", 
            "1/2 cup baby arugula", 
            "1/3 cup good mayonnaise", 
            "2 tablespoons Dijon mustard", 
            "1 tablespoon whole-grain mustard", 
            "2 tablespoons sour cream", 
            "1/8 teaspoon kosher salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/steak-sandwiches1.jpg?w=500", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Picnics", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2009/02/steak-sandwiches/", 
        "title": "steak sandwiches", 
        "directions": [
            "Whisk the ingredients together in a small bowl. Serve at room temperature."
        ], 
        "date": "2009-02-28T17:00:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound strawberries, trimmed and sliced", 
            "1/2 cup granulated sugar", 
            "3 cups milk", 
            "1 cup buttermilk"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/06/strawberry-milk1.jpg?w=750", 
        "tags": [
            "Drinks", 
            "Photo", 
            "Snack", 
            "Strawberries", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2016/06/strawberry-milk/", 
        "title": "strawberry milk", 
        "directions": [
            "Mix strawberries and sugar in the bottom of a bowl (or even your blender’s bowl) and let them macerate for at least an hour, or until very syrupy. The more juice they exude now, the better. Blend strawberries and juices until smooth, then pour into a pitcher along with milk and buttermilk. Stir and let steep overnight in the fridge. In the morning, mix again if needed, and pour into glasses. Repeat as long as it lasts."
        ], 
        "date": "2016-06-09T11:54:59+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/blue-sky-bran-muffins1.jpg?resize=200%2C200", 
        "tags": [
            "Baby", 
            "Meals", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2010/10/summer-squash-soup/", 
        "title": "summer squash soup", 
        "directions": [
            "Heat oil and butter in a large, heavy wide pot over moderate heat. Cook onion with salt, stirring until it begins to caramelize, about 8 minutes. Add remaining vegetables and stock and bring to a boil. Reduce to a simmer and cook, partially covered, until vegetables are very tender, about 20 minutes. Let cool for 10 minutes off heat before pureeing to desired consistency. Season with additional salt and pepper to taste."
        ], 
        "date": "2010-10-18T15:01:52+00:00"
    }, 
    {
        "ingredient_list": [
            "1 ounce dried mushrooms (porcini, morels, or shitakes)", 
            "1/2 cup olive oil", 
            "2 sprigs of rosemary", 
            "4 sprigs of sage", 
            "1 large yellow onion, peeled and thinly sliced", 
            "3 garlic cloves, peeled and thinly sliced", 
            "1 1/2 teaspoons salt", 
            "1/4 tsp freshly ground white pepper", 
            "1 pound white button mushrooms, cleaned and thinly sliced", 
            "1 pound shitake mushrooms stemmed, cleaned and thinly sliced", 
            "6 cups chicken stock or water", 
            "1 cup heavy cream", 
            "2 tablespoons unsalted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/01/balthazars-cream-of-mushroom-soup.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Gluten-Free", 
            "Mushrooms", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2007/01/superlatively-souper/", 
        "title": "balthazar’s cream of mushroom soup", 
        "directions": [
            "1.\tSoak the dry mushrooms in 1 cup of warm water for 20 to 30 minutes, until plump.", 
            "2.\tStrain the soaking liquid through a coffee filter to remove grit and reserve, along with the reconstituted mushrooms, until needed.", 
            "3.\tHeat the olive oil in a large pot over a medium flame. Bundle the rosemary and sage together and tie with kitchen twine.  When the oil is hot, add the herb bundle and sizzle for a few minutes on both sides to infuse the oil.", 
            "4.\tAdd the onion, garlic, salt and pepper and cook for 5 minutes, until the onion is soft and translucent but not brown.", 
            "5.\tTurn the flame to high and add the white mushrooms and shitakes.", 
            "6.\tCook for 10 minutes, during which the mushrooms will give off their liquid (which should evaporate quickly due to the high heat) and deflate significantly. Stir occasionally.", 
            "7.\tAdd the chicken stock and the dried mushrooms along with the soaking water.", 
            "8.\tSimmer for 30 minutes. Remove the herbs, then add the cream and butter. Working in batches, puree the soup in a blender until smooth. Return to the pot and keep at a very low simmer until ready to serve.", 
            "Deb adjustments: I used far less olive oil, replaced some of the chicken stock with beef, as I had it on hand and love mixing that flavor with mushrooms; half as much cream, preferring a more potent soup and thyme instead of rosemary, also due to personal preference."
        ], 
        "date": "2007-01-04T14:38:10+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons extra-virgin olive oil, divided", 
            "1 10- to 11-ounce fully cooked smoked Portuguese linguica sausage or chorizo sausage, cut crosswise into 1/4-inch-thick slices (Spanish chorizo can be substituted)", 
            "2 medium onions, chopped", 
            "2 large garlic cloves, minced", 
            "2 pounds red-skinned sweet potatoes (yams; about 2 large), peeled, quartered lengthwise, cut crosswise into 1/4-inch-thick slices", 
            "1 pound white-skinned potatoes, peeled, halved lengthwise, cut crosswise into 1/4-inch-thick slices", 
            "6 cups low-salt chicken broth", 
            "1 9-ounce bag fresh spinach"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sweet-potato-and-sausage-soup1.jpg?w=500", 
        "tags": [
            "Fall", 
            "Meat", 
            "Photo", 
            "Potatoes", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2007/10/sweet-potato-and-sausage-soup/", 
        "title": "sweet potato and sausage soup", 
        "directions": [
            "Heat 2 tablespoons oil in heavy large pot over medium-high heat. Add sausage; cook until brown, stirring often, about 8 minutes. Transfer sausage to paper towels to drain. (I poured off some of the oil in the pot at this point, but the original recipe doesn’t think this is needed.) Add onions and garlic to pot and cook until translucent, stirring often, about 5 minutes. Add all potatoes and cook until beginning to soften, stirring often, about 12 minutes. Add broth; bring to boil, scraping up browned bits. Reduce heat to medium-low, cover, and simmer until potatoes are soft, stirring occasionally, about 20 minutes. Using potato masher, mash some of potatoes in pot. Add browned sausage to soup. Stir in spinach and simmer just until wilted, about 5 minutes. Stir in remaining 1 tablespoon oil. Season with salt and pepper. Divide among bowls and serve.", 
            "Other options to consider: Kielbasa (suggested by commenter Wendy) instead of chorizo/linguica, adding a can or two of drained white beans or using more spinach. I love spinach wilted in soups and could have used even more. "
        ], 
        "date": "2007-10-28T10:07:43+00:00"
    }, 
    {
        "ingredient_list": [
            "Soup", 
            "1/4 cup (1/2 stick) butter", 
            "1 large onion, finely chopped", 
            "4 large garlic cloves, chopped", 
            "3 14 1/2-ounce cans low-salt chicken broth", 
            "4 cups 1-inch pieces peeled butternut squash (about 1 1/2 pounds)*", 
            "4 cups 1-inch pieces peeled acorn squash (about 1 1/2 pounds)*", 
            "1 1/4 teaspoons minced fresh thyme", 
            "1 1/4 teaspoons minced fresh sage", 
            "1 1/2 teaspoons ground cumin", 
            "1/2 teaspoon ground ginger", 
            "1/8 cup whipping cream", 
            "Croutons", 
            "2 tablespoons (1/4 stick) butter", 
            "24 1/4-inch-thick baguette bread slices", 
            "1 cup grated Gruyere cheese", 
            "1 teaspoon minced fresh thyme", 
            "1 teaspoon minced fresh sage ", 
            "1 deep pie dish, or frankly, any old dish you feel like baking in", 
            "1/4 peck of your favorite apples to bake with, or whatever the lady is selling that day", 
            "1 tablespoon flour", 
            "1-2 tablespoons sugar, or to taste", 
            "1 teaspoon cinnamon", 
            "1/2 teaspoon nutmeg", 
            "A pinch of allspice", 
            "5-6 tablespoons unsalted or salted butter, your choice, melted", 
            "1/3 cup brown sugar", 
            "1 teaspoon cinnamon", 
            "1/3 cup dried oatmeal", 
            "Up to 1 cup all-purpose flour "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/10/winter-squash-soup-with-gruyere-croutons.jpg?w=750", 
        "tags": [
            "Fall", 
            "Photo", 
            "Soup", 
            "Thanksgiving", 
            "Travel", 
            "Winter Squash"
        ], 
        "url": "https://smittenkitchen.com/2006/10/the-leaf-peeps/", 
        "title": "winter squash soup with gruyere croutons", 
        "directions": [
            "Mix the brown sugar, cinnamon and oatmeal into the melted butter. Now, here’s where all of your personal choice comes in. You could: ", 
            "Add flour a couple tablespoons at a time until the mixture forms a dry crumble. I find the more I add, as long as I don’t add so much that there is flour that can’t adhere at all, the better it comes out. Taste a clump, and adjust the sugar and spice to taste. ", 
            "Sprinkle this over your apples and bake at 400 degrees for about 45 minutes, or until the top is golden and the apples underneath are bubbling in their thickened juices. If the top browns before this happens, cover it with foil until the apples are done. ", 
            "Serve alone or with ice cream, whipped cream, creme fraiche, plain or vanilla yogurt or dusted with powdered sugar. "
        ], 
        "date": "2006-10-16T16:53:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon olive oil", 
            "1 medium onion, chopped small", 
            "1 to 2 peppers of your choice (see Notes, below), finely chopped", 
            "3 cloves garlic, minced", 
            "2 tablespoons chili powder", 
            "2 teaspoons ground cumin", 
            "1 teaspoon dried oregano", 
            "1 1/2 teaspoons table salt or 2 1/2 teaspoons kosher or coarse salt", 
            "1 12-ounce bottle beer", 
            "1 28-ounce can crushed tomatoes, fire-roasted if you can find them", 
            "1 1/2 cups mixed dried beans (see Note)", 
            "3 1/2 to 4 cups water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/04/three-bean-chili.jpg?w=750", 
        "tags": [
            "Beans", 
            "Photo", 
            "Slow Cooker", 
            "Stew", 
            "Tex-Mex", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/04/three-bean-chili/", 
        "title": "three-bean chili", 
        "directions": [
            "To serve: Lime wedges, sour cream, diced white onion, cilantro, corn or flour tortillas or tortilla chips or rice", 
            "Heat oil in the bottom of a medium-sized heavy pot or Dutch oven (if finishing it on the stove), in the pot of your pressure-cooker (if using one) or in a large skillet (if finishing in a slow-cooker). Once warm, add onion and cook for 5 minutes, until translucent. Add any fresh peppers and cook for 3 more minutes. Add garlic, chili powder, cumin, oregano and salt and cook for 2 minutes, until browned and deeply fragrant. Add beer and scrape up any bits stuck to the pot. Boil until reduced by half, or, if you’re nervous about alcohol content, until it has all but disappeared. ", 
            "If finishing on the stove: Add tomatoes, dried beans, any dried or rehydrated-and-pureed chiles and the smaller amount of water. Bring mixture to a full boil and boil for one minute, then reduce heat to a very low, gentle simmer, place a lid on your pot, and cook for 2 1/2 to 3 hours, until the beans are tender, stirring occasionally. Add the last 1/2 cup water if mixture seems to be getting dry, though I didn’t need it in most of my tested batches. If a slightly more sloshy chili wouldn’t bother you, you can add it from the get-go.", 
            "If finishing in a slow-cooker: Scrape onion, spice and beer mixture into a slow-cooker and add tomatoes, dried beans, any dried or rehydrated-and-pureed chiles and the smaller amount of water. Cook on HIGH for 6 to 7 hours, until beans are tender. You can add the last 1/2 cup water if needed, but probably will not find it necessary.", 
            "If finishing in a pressure-cooker: Follow the directions from your pressure cooker manufacturer. I failed to get this fully tested in my new one (boo) but estimate that it will take 20 to 22 minutes on high. ", 
            "Serve as-is or with fixings of your choice.", 
            "Notes:"
        ], 
        "date": "2014-04-02T12:13:23+00:00"
    }, 
    {
        "ingredient_list": [
            "4 1/2-inch thick slices your favorite sturdy bread*", 
            "4 tablespoons mayonnaise", 
            "Two to four 1/4-inch slices provolone cheese (use larger amount for smaller slices)", 
            "Olive oil2 medium-sized perfectly ripe tomatoes, sliced", 
            "Flaky salt and freshly cracked black pepper, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/07/tomato-and-fried-provolone-sandwich1.jpg?w=640", 
        "tags": [
            "Photo", 
            "Quick", 
            "Sandwich", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/07/tomato-and-fried-provolone-sandwich/", 
        "title": "tomato and fried provolone sandwich", 
        "directions": [
            "Spread each slice of bread with mayonnaise and set aside.", 
            "Heat a skillet, preferably nonstick, over medium-low heat. Add a thin layer of olive oil and let it heat until shimmering. Add first slice of provone to skillet and fry it until crusty and golden underneath. Using a very thin spatula (this “flexible fish spatula” style is my favorite, for everything) carefully flip slice. It’s probably not going to flip neatly and you’ll probably curse me and also Hess but a messy slice will taste no less delicious than a photogenic one, promise. Just do your best. Fry the slice on the other side until golden underneath, then lift this browned cheese mess out of the pan and onto your first prepared bread slice. Repeat with remaining slices of cheese, frying more than one at a time if you’re now more comfortable with the process. ", 
            "Arrange slices of tomatoes over fried provolone on bread, sprinkle with salt and pepper and eat with one hand while calming an irate newborn with the other (if you’re me) or with two hands, from a plate, sitting down with a napkin on your lap, you civilized thing (if you’re not me, clearly). ", 
            "* Forgive me if I sound like a broken record, but my favorite is the whole wheat sourdough (a.k.a. miche or pain de campagne; think: Poilâne, but not requiring a ticket to Paris) you see here and elsewhere on the site. If you live near a Le Pain Quotidien, they sell theirs in quarters from gigantic loaves. Balthazar also makes their own, which is wonderful, and also sells it in quarters, inexpensively. "
        ], 
        "date": "2015-07-29T11:11:33+00:00"
    }, 
    {
        "ingredient_list": [
            "28 ounces (800 grams) whole peeled tomatoes from a can (San Marzano, if you can find them)*", 
            "5 tablespoons (70 grams) unsalted butter", 
            "1 medium-sized yellow onion, peeled and halved", 
            "Salt to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/tomato-sauce-with-butter-and-onion.jpg?w=753", 
        "tags": [
            "Budget", 
            "Date Night", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/01/tomato-sauce-with-butter-and-onions/", 
        "title": "tomato sauce with onion and butter", 
        "directions": [
            "Put the tomatoes, onion and butter in a heavy saucepan (it fit just right in a 3-quart) over medium heat. Bring the sauce to a simmer then lower the heat to keep the sauce at a slow, steady simmer for about 45 minutes, or until droplets of fat float free of the tomatoes. Stir occasionally, crushing the tomatoes against the side of the pot with a wooden spoon. Remove from heat, discard the onion, add salt to taste (you might find, as I did, that your tomatoes came salted and that you didn’t need to add more) and keep warm while you prepare your pasta.", 
            "Serve with spaghetti, with or without grated parmesan cheese to pass.", 
            "* I liked this enough to make us more the next day, but I only had a can of tomato puree. It also worked well, despite having slightly less texture. You will need a little less simmering time as the tomatoes are already broken down."
        ], 
        "date": "2010-01-17T13:36:23+00:00"
    }, 
    {
        "ingredient_list": [
            "18 ounces (3 2/3 cups) assorted unsalted nuts or 2 1/3 cups mixed nuts and 1 1/3 cups pretzel nuggets", 
            "1 tablespoon butter, melted", 
            "2 tablespoons fresh rosemary, coarsely chopped", 
            "1/4 to 1/2 teaspoon cayenne (see note up top)", 
            "2 teaspoons dark brown sugar", 
            "1 teaspoon kosher salt (see note up top)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/12/union-square-cafes-bar-nuts.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Quick", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2016/12/union-square-cafes-bar-nuts/", 
        "title": "union square cafe’s bar nuts", 
        "directions": [
            "Heat oven to 350 degrees. Spread nuts (if using pretzels, don’t add them yet) on a tray and toast for 10 to 15 minutes, until lightly golden and fragrant. While they’re toasting, whisk butter, rosemary, cayenne, sugar and salt in the bottom of a large bowl. When nuts are toasted, add them to bowl and stir to evenly coat. Add pretzels, if using, and coat again. Spread back on tray and toast for another 5 to 10 minutes. Let cool slightly, then serve warm in bowls. Nuts are also good at room temperature, and keep for weeks in airtight jars."
        ], 
        "date": "2016-12-09T13:15:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound pork butt, cut into small cubes", 
            "1 1/2 quarts chicken stock", 
            "4 cups water", 
            "3 allspice berries", 
            "3 bay leaves", 
            "1 tablespoon dried marjoram", 
            "1 cup sauerkraut, plus around 4 tablespoons juice", 
            "1 large potato, peeled and diced", 
            "2 carrots, minced", 
            "3 stalks celery, minced", 
            "1 small onion, diced", 
            "2 cups fresh cabbage, shredded thin"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/veselkas-cabbage-soup1.jpg?w=500", 
        "tags": [
            "Cabbage", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/11/veselkas-cabbage-soup/", 
        "title": "veselka’s cabbage soup", 
        "directions": [
            "Place the pork in a medium stockpot with the chicken stock, water, allspice, bay leaves, and marjoram. Bring to a boil and then simmer on low heat for about 2 hours. Remove the pork and set aside on a plate to cool. Skim fat from stock, leaving a few “eyes” of fat for flavor.", 
            "Add sauerkraut and simmer for 20 minutes. Add potato and simmer for 5 minutes. Add the carrots, celery, onion, and cabbage and simmer for 20 minutes. Add the pork and simmer for 10 more minutes. Season with salt and pepper. Add sauerkraut juice."
        ], 
        "date": "2008-11-30T23:20:25+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup wild rice, uncooked", 
            "3 tablespoons unsalted butter", 
            "2 1/2 pounds (about 4) Vidalia onions, or other sweet onions, quartered and very thinly sliced", 
            "6 cups chicken or vegetable stock", 
            "Herb bundle (see Note above)", 
            "Salt and pepper", 
            "8 slices baguette", 
            "2 tablespoons extra-virgin olive oil", 
            "4 ounces Maytag or other young, not too sharp, blue cheese, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/05/vidalia-onion-soup-with-wild-rice-and-blue-cheese.jpg?w=750", 
        "tags": [
            "Easter", 
            "Grain/Rice", 
            "Onions", 
            "Photo", 
            "Soup", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/05/vidalia-onion-soup-with-wild-rice/", 
        "title": "vidalia onion soup with wild rice", 
        "directions": [
            "Cook the wild rice in a small saucepan according to package directions. Usually, 2 cups of water is the amount needed for 1/2 cup wild rice. Bring to a boil, reduce heat to a very low simmer and cover the pot. Let it cook, undisturbed, until the rice is tender and the water is absorbed, about 50 to 55 minutes. Set aside. ", 
            "Melt the butter in the bottom of a 4- to 5-quart saucepan or Dutch oven over moderately low heat. Add the onions, toss to coat them in oil and cover the pot. Reduce the heat to real low and let them slowly steep for 15 minutes. They don’t need your attention; you can even check your email, eh, who are we kidding, Facebook.", 
            "After 15 minutes, uncover the pot, raise the heat slightly and season the onions with a bit of salt and pepper. Cook onions, stirring frequently, for another 15 to 25 minutes, until they are tender, limp and sweet. Add the stock and simmer for 20 minutes. Wrap the herbs (see Note up top) in a small piece of cheesecloth and tie with kitchen string. Trotter suggests you drop the bundle into the broth for one minute, then remove it, but after going through such an effort to make one, I decided to leave mine in a little longer; it made me feel better. Adjust seasonings with additional salt and pepper, if needed.", 
            "Heat oven to 400 degrees. Brush both sides of the baguette slices with oil. Bake on a baking sheet until light golden brown, 5 to 10 minutes. While the croutons are still warm, spread them with blue cheese.", 
            "To serve, divide the rice among four bowls, and ladle broth and onions on top. Float two croutons in the center of each bowl, and sprinkle with more pepper. Eat immediately."
        ], 
        "date": "2012-05-21T16:02:02+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup shelled walnuts, even better if you toast and cool them first", 
            "1/4 cup grated Parmesan cheese", 
            "1 small garlic clove, peeled and crushed", 
            "3 sprigs of thyme, cleaned", 
            "Salt", 
            "Small splash of sherry vinegar (I used a generous splash and felt it dominated too much; go easy)", 
            "1/3 cup extra virgin olive oil", 
            "2 tablespoons minced sun-dried tomatoes (oil or dry-packed will both work)", 
            "1 loaf country bread, or a baguette, sliced"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/12/walnut-pesto.jpg?w=752", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Quick", 
            "Savory Sauces and Condiments"
        ], 
        "url": "https://smittenkitchen.com/2009/12/walnut-pesto/", 
        "title": "walnut pesto", 
        "directions": [
            "In food processor, coarsely grind walnuts, cheese, garlic, thyme, salt and vinegar. Stir in oil and tomatoes.", 
            "Grill or toast bread. While hot, top each slice with a heaping teaspoon of pesto. "
        ], 
        "date": "2009-12-29T11:24:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound very large (16 to 20 per pound) shrimp, peeled, de-veined, and rinsed, shells reserved", 
            "1 teaspoon salt", 
            "1 cup dry white wine", 
            "4 peppercorns", 
            "5 coriander seeds", 
            "1/2 bay leaf", 
            "5 sprigs fresh parsley", 
            "1 sprig fresh tarragon", 
            "1teaspoon juice from 1 small lemon", 
            "1 cup ketchup", 
            "2 1/2 teaspoons prepared horseradish (I believed we used slightly more)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "1 teaspoon ancho or other mild chili powder", 
            "Pinch cayenne pepper", 
            "1 tablespoon juice from 1 small lemon", 
            "3 tablespoons good olive oil", 
            "1 small French bread or boule, cut into 1-inch cubes (6 cups)", 
            "1 teaspoon kosher salt", 
            "2 large ripe tomatoes, cut into 1-inch cubes", 
            "1 hothouse cucumber, unpeeled, seeded, and sliced 1/2 inch thick", 
            "1 red bell pepper, seeded and cut into 1-inch cubes", 
            "1 yellow bell pepper, seeded and cut into 1-inch cubes", 
            "1/2 red onion, cut in half and thinly sliced", 
            "20 large basil leaves, coarsely chopped", 
            "3 tablespoons capers, drained", 
            "1 lemon", 
            "4 small\tartichokes", 
            "2/3 cup\theavy cream", 
            "1 teaspoon garlic, finely chopped (about 1 medium clove)", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon ground white pepper", 
            "2 tablespoons olive oil", 
            "6 medium Yukon Gold potatoes", 
            "4 ounces Asiago cheese, grated (I used cave-aged Gruyere, because it’s my favorite)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/when-the-stars-make-you-drool1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Artichokes", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Seafood", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2006/11/when-the-stars-make-you-drool/", 
        "title": "shrimp cocktail + artichoke-potato gratin", 
        "directions": [
            "1.\tBring reserved shells, 3 cups water and salt to boil in medium saucepan over medium-high head; reduced heat to low; cover, and simmer until fragrant, about 20 minutes. Strain stock through sieve, pressing on shells to extract all liquid.", 
            "2.\tBring stock and remaining ingredients except shrimp to boil in 3- or 4-quart saucepan over high heat; boil 2 minutes. Turn off heat and stir in shrimp; cover and let stand until firm and pink, 8 to 10 minutes. Drain shrimp, reserving stock for another use. Plunge shrimp into ice water to stop coking, then draining again. Serve shrimp chilled with cocktail sauce.", 
            "1. Heat the oil in a large saute pan. Add the bread and salt; cook over low to medium heat, tossing frequently, for 10 minutes, or until nicely browned. Add more oil as needed.", 
            "2. For the vinaigrette, whisk together the ingredients.", 
            "3. In a large bowl, mix the tomatoes, cucumber, red pepper, yellow pepper, red onion, basil, and capers. Add the bread cubes and toss with the vinaigrette. Season liberally with salt and pepper.", 
            "4. Serve immediately, or allow the salad to sit for about half an hour for the flavors to blend."
        ], 
        "date": "2006-11-06T17:25:43+00:00"
    }, 
    {
        "ingredient_list": [
            "6 ounces (1 1/2 cups coarsely grated) sharp cheddar, orange if you can find one you like", 
            "4 tablespoons (2 ounces or 57 grams) butter", 
            "1/2 cup (2 1/2 ounces or 62 grams) whole wheat flour", 
            "1/4 cup (1 1/8 ounces or 31 grams) all-purpose flour", 
            "1/8 teaspoon onion powder", 
            "1/8 to 1/4 teaspoon table salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/03/whole-wheat-goldfish-crackers.jpg?w=750", 
        "tags": [
            "Cheese", 
            "Photo", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2011/03/whole-wheat-goldfish-crackers/", 
        "title": "whole wheat goldfish crackers", 
        "directions": [
            "Preheat oven to 350°F. Combine all ingredients in a food processor, running the machine until the dough forms a ball, about two minutes.", 
            "If the dough feels warm or worrisome-ly soft, wrap it in waxed paper or plastic wrap and chill it in the fridge for 30 to 45 minutes. This also makes it easier to transfer shapes once they are rolled out.", 
            "On a lightly floured surface, using a lightly floured rolling pin, roll the dough out 1/8-inch thick. Form shapes with a cookie cutter, dipping it in flour from time to time to ensure a clean cut. Gently transfer crackers to an ungreased (though mine were parchment-lined, because they are in despicable shape) cookie sheet with a 1/2 inch between them. Bake the crackers on the middle rack for 12 to 15 minutes, or until they are barely browned at the edges. Remove from the oven and set the cookie sheet on a rack to cool.", 
            "Tiny Goldfish Cookie Cutter: I bought mine here."
        ], 
        "date": "2011-03-03T15:53:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound (about 2 large) zucchini or other summer squash, trimmed", 
            "1 1/4 teaspoons fine sea or table salt, plus more if needed", 
            "1 cup (3 ounces or 85 grams) coarsely grated gruyere cheese", 
            "3/4 cup (2 1/2 ounces or 70 grams) coarsely grated fontina or provolone cheese", 
            "1/4 cup (20 grams) finely grated parmesan or pecorino cheese", 
            "Freshly ground black pepper", 
            "8 thin slices bread of your choice, I used a country-style white bread", 
            "A couple tablespoons softened butter or olive oil for brushing bread"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/06/zucchini-grilled-cheese.jpg?w=750", 
        "tags": [
            "Picnics", 
            "Recipes", 
            "Sandwich", 
            "Summer Squash", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2017/06/zucchini-grilled-cheese/", 
        "title": "zucchini grilled cheese", 
        "directions": [
            "Prepare zucchini: Use a food processor with a grater attachment or the large holes of a box grater to grate the zucchini. In a large colander, toss together the zucchini and salt. Let stand for 20 to 30 minutes, until the zucchini has wilted and begun to release liquid. Drain the zucchini in a colander and then use your hands to squeeze out as much water as possible, a fistful at a time. Place wrung-out zucchini on paper towels to drain further.\nMake filling and assemble sandwiches: Mix zucchini with grated cheese, a lot of freshly ground black pepper, and more salt if needed.", 
            "Brush or spread the bread sides that will form the outsides of the sandwiches with olive oil or softened butter. Spread zucchini-cheese on insides and close the sandwiches.", 
            "Cook the sandwiches: Place sandwiches on a large griddle or frying pan over low-medium heat. I like to cook grilled cheese slowly to give the centers a chance to really melt before the outsides get too brown. When the undersides are a deep golden brown, flip the sandwiches and cook until the color underneath matches the lid. Cut sandwiches in half and dig in. Perhaps some pickled vegetable sandwich slaw on the side?"
        ], 
        "date": "2017-06-22T12:04:08+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/09/zucchini-parmesan-crisps.jpg?w=750", 
        "tags": [
            "Photo", 
            "Side Dish", 
            "Snack", 
            "Summer", 
            "Summer Squash", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2013/09/zucchini-parmesan-crisps/", 
        "title": "zucchini parmesan crisps", 
        "directions": [
            "Heat oven to 450 degrees. Coat two baking sheets lightly with cooking spray or thinly with olive oil. Slice zucchini into slightly-less-than 1/4-inch thick rounds; if they feel especially wet, spread them on a towel while you prepare the other ingredients. In a small bowl, lightly beat first egg white with 1 teaspoon water to loosen it. Combine cheese, crumbs, salt and pepper in a separate bowl. Dip each zucchini coin in egg white, letting excess run off before gently dipping them in parmesan mixture. Arrange in single layer on baking sheets. If additional egg white is needed, prepare it the same way, with 1 teaspoon of water. If additional crumb mixture is needed, make a few spoonfuls at a time, matching the volume of crumbs and cheese. ", 
            "Bake zucchini rounds until browned and crisp, about 25 to 30 minutes, flipping each over halfway through. Please keep an eye on them; they may need to be moved around on the tray so the ones at the edges don’t bake more quickly than the ones in the center. Take them out only when they’re golden all over and let them cool on the tray on a cooling rack or a plate. ", 
            "Keep at room temperature until needed. Crisps are best on the first day. "
        ], 
        "date": "2013-09-03T11:45:21+00:00"
    }
]