{
  "date": "2007-12-21T09:00:33+00:00",
  "directions": [
    "1. Put the butter in the bowl of a mixer fitted with the paddle attachment and beat at medium speed until it is smooth. Add the sifted confectioners’ sugar and beat again until the mixture is smooth and silky. Beat in the egg yolks and vanilla or almond, followed by the salt and any dried fruits, zest, nuts or seeds. Reduce the mixer speed to low and add the flour, beating just until it disappears. It is better to underbeat than overbeat at this point; if the flour isn’t fully incorporated, that’s okay just blend in whatever remaining flour needs blending with a rubber spatula. Turn the dough out onto a counter, gather it into a ball, and divide it in half. Wrap each piece of dough in plastic wrap and refrigerate for about 30 minutes.",
    "2. Working on a smooth surface, form each piece of dough into a log that is about 1 to 1 1/4 inches (2.5 to 3.2 cm) thick. (Get the thickness right, and the length you end up with will be fine.) Wrap the logs in plastic and chill for 2 hours. (The dough can be wrapped airtight and kept refrigerated for up to 3 days or stored in the freezer for up to 1 month.)",
    "3. Position the racks to divide the oven into thirds and preheat the oven to 350°F (180°C). Line two baking sheets with parchment paper.",
    "4. While the oven is preheating, roll cookie logs in any coatings of your choice. Then, using a sharp slender knife, slice each log into cookies about 1/3 inch (10 mm) thick. (You can make the cookies thicker if you’d like; just bake them longer.) Place the cookies on the lined baking sheets, leaving about 1/2 inch (1.5 cm) space between them.",
    "5. Bake the cookies for 12 to 14 minutes, or until they are set but not browned. Transfer the cookies to cooling racks to cool to room temperature.",
    "Do ahead: Packed airtight, the cookies will keep for about 5 days at room temperature, or in the freezer for a month. Unbaked logs can be frozen for longer. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/12/slice-and-bake-cookie-palette.jpg?w=750",
  "ingredient_list": [
    "2 sticks (8 ounces; 230 grams) unsalted butter, at room temperature",
    "2/3 cup (80 grams) confectioners’ sugar, sifted",
    "2 large egg yolks, at room temperature",
    "Pinch of salt",
    "1 teaspoon (5 ml) vanilla or almond extract",
    "2 cups (280 grams) all-purpose flour"
  ],
  "tags": [
    "Cookie",
    "Photo"
  ],
  "title": "a slice-and-bake cookie palette",
  "url": "https://smittenkitchen.com/2007/12/a-slice-and-bake-cookie-palette/"
}