{
  "date": "2016-05-12T12:10:09+00:00",
  "directions": [
    "To make in a food processor: Place flour, baking powder, baking soda and salt in the work bowl and pulse a few times to blend. Add butter and cream cheese in large chunks, plus sugar and blend until mixture is powdery. Add egg, vanilla and almond extracts and run machine until the dough balls together. You’ll probably need to scrape it down once or twice to get the mixture even.\nTo make with an electric mixer: Combine flour, baking powder, baking soda and salt in a bowl and whisk to blend. In a large bowl or the bowl of a stand mixer, beat cream cheese, butter and sugar until fluffy. Add egg and extracts and blend again. Add flour mixture and beat just until flour disappears. In some cases, this dough will feel too soft to roll into balls in your hands; if so, let it chill in the fridge for 20 minutes or so before using.\nBoth methods: Scoop balls of dough — I like these cookies best with a #40, or 1 1/2 tablespoon, scoop; the texture is less dynamic when made smaller — and roll them briefly in the palms of your hands before dropping them in a bowl of rainbow sprinkles and gently rolling to coat them evenly. I find that the sprinkles adhere much better to tacky exterior of balls of dough that have been briefly warmed by your hands — trust me here.",
    "Transfer balls of sprinkle-coated dough to baking sheets at least two inches apart. Use the bottom of a drinking glass to press down on the cookies until they are about 1/4 to 1/2-inch tall. If you see any bare spots in the sprinkles that bother you, you can sprinkle a few more on top. Bake for 9 to 10 minutes until they look underbaked but lightly golden underneath. [If they’re not quite soft in the center, they will be fully crisped through the next day.] Let set on the baking sheet on a rack for a few minutes before transferring to cooling racks to cool the rest of the way. Repeat with remaining cookie dough."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/05/confetti-cookies1.jpg?w=750",
  "ingredient_list": [
    "3 cups (375 grams) all-purpose flour",
    "1 teaspoon baking powder",
    "1/4 teaspoon baking soda",
    "3/4 teaspoon fine sea or table salt",
    "1 cup (8 ounces, 225 grams or 2 sticks) unsalted butter",
    "1/4 cup (2 ounces, 55 grams or 1/4 of an 8-ounce brick) cream cheese",
    "1 1/4 cups (250 grams) granulated sugar",
    "1 large egg",
    "2 teaspoons vanilla extract or 1/2 a vanilla bean, split and scraped (see Note up top)",
    "1/4 teaspoon almond extract (optional)",
    "1 cup rainbow sprinkles"
  ],
  "tags": [
    "Cookie",
    "Photo"
  ],
  "title": "confetti cookies",
  "url": "https://smittenkitchen.com/2016/05/confetti-cookies/"
}