{
  "date": "2009-05-29T09:29:02+00:00",
  "directions": [
    "Make the dough: Combine the flour, brown sugar, baking soda, and salt in the bowl of a food processor fitted with the steel blade or in the bowl of an electric mixer fitted with the paddle attachment. Pulse or mix on low to incorporate. Add the butter and pulse on and off on and off, or mix on low, until the mixture is the consistency of a coarse meal.",
    "[Alternately, if you don’t have a food processor or electric mixer, you can cut the ingredients together with a pastry blender. Just make sure they’re very well incorporated.]",
    "In a small bowl, whisk together the honey, milk, and vanilla extract. Add to the flour mixture and pulse on and off a few times or mix on low until the dough barely comes together. It will be very soft and sticky. Lay out a large piece of plastic wrap and dust it lightly with flour, then turn the dough out onto it and pat it into a rectangle about 1-inch thick. Wrap it, then chill it until firm, about 2 hours or overnight. Meanwhile, prepare the topping, if using, by combining the sugar and cinnamon in a small bowl and setting aside.",
    "Roll out the crackers: Divide the dough in half and return one half to the refrigerator. Sift an even layer of flour onto the work surface and roll the dough into a long rectangle about 1/8 inch thick. The dough will be sticky, so flour as necessary. Trim the edges of the rectangle to 4 inches wide. Working with the shorter side of the rectangle parallel to the work surface, cut the strip every 4 1/2 inches to make 4 crackers. [This makes a traditional graham cracker shape. I rebelled and made mine into 2-inch fluted squares with one of these.]",
    "Place the crackers on one or two parchment-lined baking sheets and sprinkle with the topping. Chill until firm, about 30 to 45 minutes in the fridge or 15 to 20 minutes in the freezer. Repeat with the second batch of dough. Finally, gather any scraps together into a ball, chill until firm, and re-roll.",
    "Adjust the oven rack to the upper and lower positions and preheat the oven to 350°F. ",
    "Decorate the crackers: Mark a vertical line down the middle of each cracker, being careful not to cut through the dough (again, this is for the traditional cracker shape). Using a toothpick or skewer (I like to use the blunt end of a wooden skewer for more dramatic dots), prick the dough to form two dotted rows about 1/2 inch for each side of the dividing line.",
    "Bake for 15 to 25 minutes, until browned and slightly firm to the touch, rotating the sheets halfway through to ensure even baking. [The baking time range is long because the original recipe calls for 25 minutes but my new oven — which I suspect runs crazy hot but have yet to confirm with the actual purchase of an oven thermometer — had them done in way less. Be safe, check them sooner. Nobody likes a burnt cracker!]"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/graham-crackers1.jpg?w=500",
  "ingredient_list": [
    "2 1/2 cups plus 2 tablespoons (375 grams) unbleached all-purpose flour (a swap of 1/2 cup with whole wheat flour or 1 cup whole wheat pastry flour works well here, too)",
    "1 cup (176 grams) dark brown sugar, lightly packed",
    "1 teaspoon (6 grams) baking soda",
    "3/4 teaspoon kosher or coarse sea salt  (4 grams)",
    "7 tablespoons (3 1/2 ounces or 100 grams) unsalted butter, cut into 1-inch cubes and frozen",
    "1/3 cup  (114 grams) mild-flavored honey, such as clover",
    "5 tablespoons (77 grams) milk, full-fat is best",
    "2 tablespoons (27 grams) pure vanilla extract",
    "Topping (optional)",
    "3 tablespoons  (43 grams) granulated sugar",
    "1 teaspoon  (5 grams) ground cinnamon"
  ],
  "tags": [
    "Cookie",
    "Photo"
  ],
  "title": "graham crackers",
  "url": "https://smittenkitchen.com/2009/05/graham-crackers/"
}