{
  "date": "2010-12-16T12:52:41+00:00",
  "directions": [
    "Preheat oven to 350°F with racks in the upper and lower thirds of the oven. Rub two baking sheets with butter. In a food processor, grind 1/2 cup of oats to a fine powder, then add remaining oats and grind them all together until it resembles coarse meal, with only a few large flakes remaining.",
    "Sift dry ingredients into a large bowl, pouring back any bits of grains or other ingredients that remain in the sifter. In a small bowl, whisk butter and eggs until combined. Using a spatula, fold the wet ingredients into the dry ingredients.",
    "Scoop balls of dough about 2 to 3 tablespoons in size (I used a #40 cookie scoop, which scooped 2 tablespoon-sized balls) onto cookie sheets about 3 inches apart. Bake for 16 to 20 minutes, rotating the sheets halfway through. When tops are evenly brown, take them out and transfer them to a cooling rack. Repeat with remaining cookie dough. Let cookies cool completely before icing.",
    "In a bowl, whisk icing ingredients together until smooth. It should have a honey-like consistency.  Drizzle the frosting over the cookies. Let the frosting set for 30 minutes (or more; it took longer at my place but by the next day, was fully firmed up) before eating. The cookies can be stored in an airtight container for up to a week.",
    "* The original recipe replaced this volume with a multigrain flour mix that worked out to 1/2 cup barley flour + 1/4 cup millet flour + 1/4 cup rye flour. If you have any of these flours, swap them in and reduce the volume of all-purpose.",
    "** Saltiness of kosher salt varies by brand. I’d recommend 2 teaspoons if you use Diamond kosher salt, and about half as much if you use Morton kosher salt or another brand."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/iced-oatmeal-cookies1.jpg?w=500",
  "ingredient_list": [
    "Icing:",
    "2 1/4 (9 1/2 ounces or 270 grams) cups powdered sugar",
    "5 to 6 (75 to 90 ml) tablespoons whole milk",
    "1 tablespoon (6 grams) cinnamon",
    "1/4 teaspoon kosher salt**"
  ],
  "tags": [
    "Cookie",
    "Photo"
  ],
  "title": "iced oatmeal cookies",
  "url": "https://smittenkitchen.com/2010/12/iced-oatmeal-cookies/"
}