{
  "date": "2010-02-19T12:26:37+00:00",
  "directions": [
    "In a large bowl, combine the flour, cornstarch and one-fourth teaspoon salt. Cut the butter in with a pastry blender, fork or two knives until it is in very tiny bits. Add one egg and mix with a fork until a dough forms. If this does not happen easily, toss it out onto a counter and knead it together. This dough is rather tough but with a little elbow grease, it does come together nicely. (Dough can also be made in a food processor, or as the original recipe suggests, in a stand mixer, though I have not tested in in the latter.)",
    "On a lightly floured surface, roll the dough out to a 12-inch circle. Place the dough in a 9-inch pie plate or tart pan and press to remove any air bubbles. Crimp the edges, and refrigerate for 30 minutes. Proceed with a filling of your choice, no parbaking required."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2010/02/cauliflower-and-caramelized-onion-tart.jpg?w=753",
  "ingredient_list": [
    "1 small head of cauliflower (about 1 pound) or 1 pound of a larger head of cauliflower, cut into 1-inch flowerets (Romanesco cauliflower, especially orange or green, would be a pretty substitute)",
    "3 1/2 tablespoons olive oil",
    "1 tablespoon truffle oil or a few pinches of truffle salt (optional) (see Notes below)",
    "1 refrigerated pie crust or a homemade tart shell (recipe below)",
    "1 large onion, halved lenghtwise and thinly sliced",
    "1 tablespoon Dijon mustard",
    "2 large eggs",
    "1 (7- to 8- ounce) container mascarpone cheese (see Note below for suggested substitutions)",
    "1/2 cup whipping cream (although any low- or full-fat milk or light cream will work as well)",
    "1/4 teaspoon ground white or black pepper",
    "Pinch of ground nutmeg",
    "1 cup grated Gruyère cheese (Swiss or Comté are great swaps)",
    "1/3 cup Parmesan cheese",
    "1 1/4 cups flour",
    "1 tablespoon plus 2 teaspoons cornstarch",
    "1/4 teaspoon salt",
    "6 tablespoons butter, diced",
    "1 egg"
  ],
  "tags": [
    "Cauliflower",
    "Freezer Friendly",
    "Onions",
    "Photo",
    "Tarts/Quiche"
  ],
  "title": "cauliflower and caramelized onion tart",
  "url": "https://smittenkitchen.com/2010/02/cauliflower-and-caramelized-onion-tart/"
}