{
  "date": "2016-09-27T12:07:56+00:00",
  "directions": [
    "Heat oil in the bottom of a 4 to 5-quart pot over medium-high heat. Once hot, add the cumin seeds and a few seconds later, the fennel seeds. Pause 2 seconds and then add the onions and potatoes. Stir and sauté for 5 minutes. Add the ginger, garlic and green chiles and stir for 1 minute more.\nTurn the heat to medium low and add the ground coriander, cumin, turmeric and red pepper. Stir for 1 minute. Add the cauliflower, tomatoes and salt and stir for 1 minute. Add 4 cups water, stir, and bring to a boil over medium-high heat. Cover, lower the heat again, and simmer gently for 25 minutes.\nLet the soup cool slightly, then blend it to your desired texture. Taste for seasoning and adjust as needed. Ladle into bowls and add a dollop of yogurt or tiny swirl (about 1/2 teaspoon) heavy cream, if desired. Squeeze lime juice over, add a few grinds of black pepper and place 2 tablespoons cooked rice to the center of each bowl. Scatter with cilantro and serve with pita wedges on the side, if desired. Dig in.\n"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/indian-spiced-cauliflower-soup.jpg?w=750",
  "ingredient_list": [
    "2 tablespoons olive or peanut oil",
    "1/2 teaspoon whole cumin seeds",
    "1/4 teaspoon whole fennel seeds",
    "1 medium onion, peeled and chopped",
    "1 medium potato (about 6 ounces), peeled and chopped",
    "2 teaspoons peeled and chopped fresh ginger",
    "2 cloves garlic, peeled and chopped",
    "1 fresh hot green chili, chopped (more or less to taste)",
    "2 teaspoons ground coriander",
    "1 teaspoon ground cumin",
    "1/4 teaspoon ground turmeric",
    "1/4 teaspoon red chili powder or cayenne (to taste)",
    "About 3 1/2 cups cauliflower florets (from about 1/2 a large 2.75-pound head)",
    "2 medium tomatoes, peeled and chopped or 1 1/2 cups canned chopped tomatoes",
    "1 1/2 teaspoons salt, or to taste (we wanted more)",
    "A couple spoonfuls heavy cream or dollops of yogurt",
    "1/2 cup cooked basmati or other long-grain white rice",
    "Handful of fresh cilantro, chopped",
    "Freshly ground black pepper",
    "Lime wedges",
    "Toasted pita or naan wedges"
  ],
  "tags": [
    "Cauliflower",
    "Fall",
    "Freezer Friendly",
    "Indian",
    "Photo",
    "Potatoes",
    "Soup",
    "Vegetarian"
  ],
  "title": "indian-spiced cauliflower soup",
  "url": "https://smittenkitchen.com/2016/09/indian-spiced-cauliflower-soup/"
}