{
  "date": "2006-12-20T17:14:06+00:00",
  "directions": [
    "Special equipment: an electric coffee/spice grinder ",
    "Put oven racks in upper and lower thirds of oven and preheat oven to 350°F. Pulse peppercorns in grinder until coarsely ground.",
    "Whisk together flour, baking powder, salt, 2 cups cheese, and 1 tablespoon ground black pepper in a large bowl. Blend in butter with a pastry blender or your fingertips until mixture resembles coarse meal. Whisk 3 eggs with milk and add to flour mixture, stirring with a fork until a soft dough forms.",
    "Turn dough out onto a lightly floured surface and quarter dough. Using well-floured hands, form each piece into a slightly flattened 12-inch-long log (about 2 inches wide and 3/4 inch high). Transfer logs to 2 ungreased large baking sheets, arranging logs about 3 inches apart.",
    "Whisk remaining egg and brush some over logs, then sprinkle tops of logs evenly with remaining 1/4 cup cheese and 1/2 tablespoon ground pepper. Bake, rotating sheets 180 degrees and switching position of sheets halfway through baking, until logs are pale golden and firm, about 30 minutes total. Cool logs to warm on sheets on a rack, about 10 minutes.",
    "Reduce oven temperature to 300°F.",
    "Carefully transfer 1 warm log to a cutting board and cut diagonally into 1/2-inch-thick slices with a serrated knife. Arrange slices, cut sides down, in 1 layer on a baking sheet. Repeat with remaining logs, transferring slices to sheets. Bake, turning over once, until golden and crisp, 35 to 45 minutes total. Cool biscotti on baking sheets on racks, about 15 minutes.",
    "Do ahead: Biscotti keep in an airtight container at room temperature 2 weeks. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-anticandy1.jpg?w=500",
  "ingredient_list": [
    "1 1/2 tablespoons whole black peppercorns",
    "4 cups all-purpose flour plus additional for dusting",
    "2 teaspoons baking powder",
    "2 teaspoons salt",
    "4 1/2 oz Parmigiano-Reggiano, finely grated (2 1/4 cups)",
    "1 1/2 sticks (3/4 cup) cold unsalted butter, cut into 1/2-inch cubes",
    "4 large eggs",
    "1 cup whole milk"
  ],
  "tags": [
    "Appetizers + Party Snacks",
    "Photo"
  ],
  "title": "parmesan black pepper biscotti",
  "url": "https://smittenkitchen.com/2006/12/the-anticandy/"
}