[
    {
        "ingredient_list": [
            "3 whole boneless chicken breasts with skin (about 2 1/2 pounds), halved (see Note)", 
            "1 1/2 tablespoons olive oil", 
            "3 1/2 tablespoons unsalted butter", 
            "1 onion, halved and sliced thin", 
            "3/4 pound mushrooms, sliced thin, any variety you like", 
            "1/2 cup dry Marsala", 
            "1 cup chicken broth", 
            "2 tablespoons minced fresh parsley leaves (optional, for garnish)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/03/alexs-chicken-and-mushroom-marsala.jpg?w=750", 
        "tags": [
            "Chicken", 
            "Date Night", 
            "Gluten-Free", 
            "Mushrooms", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2008/03/alexs-chicken-and-mushroom-marsala/", 
        "title": "alex’s chicken and mushroom marsala", 
        "directions": [
            "Pat chicken dry and season with salt and pepper. In a large heavy skillet heat oil and 1 1/2 tablespoons butter over moderately high heat until hot but not smoking and brown chicken in 2 batches, transferring with tongs to a large plate as browned.", 
            "Discard all but 1 tablespoon fat from skillet and sauté onion and mushrooms, stirring occasionally, until liquid mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until Marsala is almost evaporated. Add broth and chicken with any juices that have accumulated on plate and simmer, turning chicken once, until cooked through, about 15 minutes. Transfer chicken with tongs to a platter.", 
            "Simmer mushroom sauce until liquid is reduced to about 1/2 cup. Remove skillet from heat and stir in remaining 2 tablespoons butter and salt and pepper to taste, stirring until butter is just incorporated. Spoon mushroom sauce around chicken and sprinkle with parsley. ", 
            "New note, 11/21/13: Tonight, I made this with boneless, skinless chicken thighs and it was fantastic — and quick, with refreshingly few ingredients. This takes well under an hour to cook, and deserves to be placed back in the weeknight rotation. "
        ], 
        "date": "2008-03-03T12:44:14+00:00"
    }, 
    {
        "ingredient_list": [
            "1 can (28 ounces) diced tomatoes in juice", 
            "1 tablespoon olive oil", 
            "3/4 pound sweet or hot Italian sausage, casings removed", 
            "1 small onion, finely chopped", 
            "Coarse salt and ground pepper", 
            "1 cup Arborio rice", 
            "1/2 cup dry white wine", 
            "1 bunch flat-leaf spinach (10 to 14 ounces), washed well, tough stems removed, chopped (about 7 cups)", 
            "1/2 cup grated Parmesan cheese, plus more for serving (optional)", 
            "2 tablespoons butter "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/11/tomato-and-sausage-risotto.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Gluten-Free", 
            "Meat", 
            "Photo", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2006/11/alexs-restaurant/", 
        "title": "tomato and sausage risotto", 
        "directions": [], 
        "date": "2006-11-14T17:44:30+00:00"
    }, 
    {
        "ingredient_list": [
            "6 cups torn chunks French, sourdough or country loaf, torn into bits (I use 2 7-ounce demi-baguettes)", 
            "5 tablespoons unsalted butter", 
            "1 large Spanish or sweet onion, chopped small", 
            "1 large or 2 small stalks celery, diced small", 
            "1 teaspoon chopped fresh thyme leaves", 
            "1/2 teaspoon table salt, plus more to taste", 
            "Freshly ground black pepper", 
            "1 large or 2 small firm, tart tart apples, such as Granny Smith, peeled, cored and diced small", 
            "1/4 cup roughly chopped flat-leaf parsley", 
            "3 sage leaves, minced", 
            "1/2 to 1 cup cup turkey, chicken or vegetable stock or broth", 
            "1 large egg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/apple-herb-stuffing-for-all-seasons1.jpg?w=640", 
        "tags": [
            "Apple", 
            "Bread", 
            "Celery", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2013/11/apple-and-herb-stuffing-for-all-seasons/", 
        "title": "apple-herb stuffing for all seasons", 
        "directions": [
            "Position rack in center of oven and preheat to 350°F. Spread bread cubes in single layer on large rimmed baking sheet. Bake until pale golden, stirring occasionally, 10 to 15 minutes. Let cool in pan while you prepare the other ingredients. ", 
            "Generously butter a 2-quart baking dish (a 9×5-inch loaf, 8- or 9-inch square dish, etc.) with 1 tablespoon butter. Melt remaining 4 tablespoons butter in large skillet over medium heat. Add onion, thyme, salt and lots of freshly ground black pepper and cook for 2 minutes, until becoming translucent. Add celery and cook for 2 more minutes. Add apple and saute until a bit tender, 3 to 4 minutes more. ", 
            "Place bread in large mixing bowl. Scrape contents of skillet on top. Whisk egg and 1/2 cup broth or stock together and pour over. Stir in parsley and sage. Spoon into prepared pan. If mixture looks a little dry, pour remaining 1/2 cup broth over it. [This is a good place to pause, if needed. Nothing bad comes of the stuffing absorbing the liquids for longer.] Bake for 30 to 40 minutes, until brown on top and no liquid appears if you insert a knife vertically into the center of the stuffing pan and turn it slightly. Serve immediately, or reheat as needed.", 
            "* On a technical note, I insist upon calling stuffing what is actually dressing, even though I know it is wrong. Although they use the same recipes, stuffing goes inside the bird, dressing is baked outside, and I insist that it is better outside the bird. When making stuffing to, uh, stuff, uh, places, one must cook the bird to a higher-than-normal temperature to ensure that the stuffing inside is free from undercooked poultry drippings. Seeing as most turkey is dry enough, I see no point in helping it along. ", 
            "Variations:"
        ], 
        "date": "2013-11-19T12:04:08+00:00"
    }, 
    {
        "ingredient_list": [
            "Dough", 
            "1 cup all-purpose flour plus additional for kneading and rolling", 
            "3/4 cup cake flour (not self-rising)", 
            "2 large eggs", 
            "3/4 teaspoon salt", 
            "1/4 cup water", 
            "Filling", 
            "1/4 cup water", 
            "1/4 cup plus 2 tablespoons sugar", 
            "2 tablespoons apricot brandy (optional)", 
            "6 oz dried apricots (1 cup; preferably California)", 
            "1/2 cup walnuts (2 oz), finely chopped", 
            "Dough (recipe above)", 
            "1 stick (1/2 cup) unsalted butter", 
            "1/2 cup fresh bread crumbs", 
            "1/4 teaspoon cinnamon"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apricot-and-walnut-vareniki1.jpg?w=500", 
        "tags": [
            "Apricots", 
            "Dumplings", 
            "Fruit", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/11/apricot-and-walnut-vareniki/", 
        "title": "apricot and walnut vareniki", 
        "directions": [
            "Make filling: Bring water and 1/4 cup sugar to a boil, stirring until sugar is dissolved. Remove from heat and stir in brandy. Finely chop apricots in a food processor, then add sugar syrup and pulse until just combined (do not puree). Transfer to a bowl and stir in 1/4 cup walnuts. Cool.", 
            "Roll out dough and fill varenikis: Halve dough and roll out 1 piece on a lightly floured surface into a 15-inch round, keeping remaining dough wrapped. Trim dough to a 13-inch square. Cut lengthwise into 4 strips, then crosswise into fourths to form 16 (3 1/4-inch) squares. ", 
            "Put 1 slightly rounded teaspoon filling in center of each square. Working with 1 square at a time, moisten edges with water and fold in half diagonally to form a triangle, pressing edges firmly together to seal. overlap bottom points of triangle and press to seal (dumpling will look like a pointed hat). Transfer vareniki to a flour-dusted kitchen towel. Repeat with remaining squares, then make more dumplings with remaining dough and filling.", 
            "Cook varenikis in a large pot of lightly salted boiling water until tender, about 15 minutes. Make topping while varenikis cook:", 
            "Heat 2 tablespoons butter in a skillet over moderate heat, then cook bread crumbs and remaining 1/4 cup walnuts, stirring frequently, until golden, 2 to 3 minutes. Remove from heat and season lightly with salt. Stir together cinnamon and remaining 2 tablespoons sugar. Sprinkle 2 teaspoons cinnamon sugar over crumb mixture and toss. ", 
            "To serve varenikis: Melt remaining 6 tablespoons butter, then drizzle about 2 tablespoons on a warmed serving platter. Transfer varenikis with a slotted spoon to platter and drizzle with remaining 4 tablespoons butter. ", 
            "Serve hot, sprinkled with bread-crumb mixture and remaining cinnamon sugar to taste. "
        ], 
        "date": "2007-11-08T23:15:27+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large eggs", 
            "1/3 cup whole blanched almonds, Marconas if you can get them", 
            "Yogurt dressing", 
            "1 cup plain yogurt (strained or Greek-style if you can find it)", 
            "2 tablespoons lemon juice", 
            "1 teaspoon smoked paprika", 
            "1 small clove garlic, minced", 
            "1/4 teaspoon table salt", 
            "Asparagus", 
            "1 tablespoon olive oil", 
            "1 pounds asparagus spears, tough ends trimmed or peeled", 
            "Salt and freshly ground black pepper", 
            "To serve", 
            "Squeeze of lemon juice", 
            "Drizzle of olive oil", 
            "Coarse sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/asparagus-with-almonds-and-yogurt-dressing1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Asparagus", 
            "Easter", 
            "Photo", 
            "Side Dish", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/06/asparagus-with-almonds-and-yogurt-dressing/", 
        "title": "asparagus with almonds and yogurt dressing", 
        "directions": [
            "Hard-boil your eggs according to your favorite method. I like to put my eggs cold in a pot of water and bring it to a boil over high heat. Once it comes to a boil, I set the timer for 10 minutes and reduce the heat to a moderate simmer. When the timer goes off, I drain them and plunge them in ice water for a quick cooling. While they cool, toast your almonds. [If you have time, cook the eggs 24 hours or more in advance. Older hard-boiled eggs peel more cleanly.] ", 
            "In a 12-inch heavy skillet, toast your almonds over medium heat, tossing them frequently until they’re lightly bronzed. [Marcona almonds often come already toasted and in a bit of olive oil. If you’re happy with their color, use them as is. If not, you can put the almonds and oil in the skillet to toast them more deeply, as I did.] Let cool.", 
            "Once eggs and almonds are cool, coarsely chop both and set aside. ", 
            "Make your yogurt dressing, whisking all of the ingredients in a small bowl. Adjust seasonings to taste. Spread 1/2 cup dressing in a thin layer over serving dish and set aside. ", 
            "Reheat heavy 12-inch skillet over medium high heat. Add oil, and once the oil is fully heated, add your trimmed asparagus spears — placing half in one direction and half in the other allows them to fit better. They won’t fit flat in a single layer, but you should try to spread them as evenly as possible. Cover the skillet with a lid (foil if you don’t have one that fits) and let skinny spears cook for 3 minutes and fatter ones for 5. Remove the lid, increase the heat to high, season the asparagus with salt and black pepper, and use tongs to cook the spears until they’re crisp-tender and well-browned along a side or two, about 5 minutes more for skinny spears or 7 minutes for thicker ones. ", 
            "Transfer asparagus to dressing-coated serving dish. Sprinkle spears with an additional squeeze of lemon juice, if desired, a tiny drizzle of olive oil, chopped almonds, eggs and a bit of coarse sea salt. Dollop with additional yogurt dressing. Then dig in."
        ], 
        "date": "2012-06-01T14:03:21+00:00"
    }, 
    {
        "ingredient_list": [
            "4 baking potatoes (about 2 pounds)", 
            "3 tablespoons olive oil, divided", 
            "3 tablespoons butter, divided", 
            "1 small white onion, finely chopped", 
            "2 garlic cloves minced", 
            "1 1/2 pounds mixed mushrooms, wild are wonderful, but sliced cremini or white mushrooms will also work", 
            "Salt and freshly ground pepper", 
            "1/2 cup white wine or vermouth, or 1/4 cup sherry or marsala (optional)", 
            "1/2 cup vegetable or beef broth, plus a splash or two extra if needed", 
            "1/2 teaspoon chopped thyme", 
            "4 ounce-log soft goat cheese", 
            "1 tablespoon minced fresh chives or flat-leaf parsley, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/10/baked-potatoes-with-wild-mushroom-ragu1.jpg?w=750", 
        "tags": [
            "Fall", 
            "Mushrooms", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/10/baked-potatoes-with-wild-mushroom-ragu/", 
        "title": "baked potatoes with wild mushroom ragù", 
        "directions": [
            "Heat oven to 425°F. Pierce potatoes all over with a fork and rub with 1 tablespoon olive oil. Place on rack and bake for 1 hour, or until tender in center when pierce with a skewer.", 
            "Meanwhile, in a large, deep skillet, melt the 2 tablespoons butter with 2 tablespoons olive oil over medium heat. Add the onion and garlic and sauté until softened, about 8 minutes. Turn heat to high, add mushrooms, salt and pepper and cook until the mushrooms brown, then release their juices and cook them off, about 10 minutes. Add wine, if using, scrape up any bits stuck to pan. Cook until evaporated. Add broth and thyme and bring to a simmer. Stir in final tablespoon of butter until melted. Adjust seasonings to taste.", 
            "Slit the potatoes and fluff the insides with a fork. Sprinkle with a little salt and pepper, a few goat cheese crumbles, a ladleful of the mushrooms and chives. Serve with extra mushrooms and goat cheese on the side."
        ], 
        "date": "2015-10-19T12:07:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups fresh bread crumbs (though I found I needed far less)", 
            "2 teaspoons thyme leaves", 
            "2 tablespoons extra virgin olive oil plus an extra glug or two for drizzling", 
            "4 tablespoons unsalted butter", 
            "2 pounds medium-sized brussels sprouts, washed and trimmed", 
            "Salt and pepper", 
            "6 ounces pancetta in small dice (1 1/2 cups)", 
            "3 tablespoons minced shallots", 
            "1 tablespoon minced garlic", 
            "1/2 cup balsamic vinegar", 
            "1 1/2 cups veal stock, rich chicken or vegetable broth, more if needed", 
            "2 tablespoons chopped parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/balsamic-braised-brussels-sprouts-with-pancetta1.jpg?w=640", 
        "tags": [
            "Brussels Sprouts", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2009/12/balsamic-braised-brussels-with-pancetta/", 
        "title": "balsamic braised brussels with pancetta", 
        "directions": [
            "Heat oven to 350 degrees. In a bowl, mix bread crumbs and thyme with a couple glugs of olive oil, and spread on a cookie sheet. Toast, tossing frequently, until golden brown, 10 to 12 minutes.", 
            "Heat butter and remaining olive oil in a large skillet over medium-high heat until foamy. Add brussels sprouts, sprinkle with salt and pepper, and sauté, tossing frequently, until lightly browned, about 7 to 10 minutes. Add diced pancetta, and sauté, tossing frequently, until sprouts are well browned and softened slightly, and pancetta is crisp, about 10 to 15 minutes more. Reduce heat, add shallots and garlic, and sauté until fragrant, 2 minutes.", 
            "Increase heat to high, add balsamic vinegar and stock, and cook, tossing frequently, until sprouts are glazed and tender, about 20 minutes; add more stock if needed. Taste, adjusting seasoning if necessary, and sprinkle with chopped parsley. Transfer to a warm serving bowl and scatter bread crumbs on top."
        ], 
        "date": "2009-12-01T10:05:05+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds cipollini or small (1 1/2-inch) onions", 
            "4 tablespoons virgin olive oil", 
            "3 tablespoons sweet butter", 
            "2 tablespoons sugar", 
            "1 cup balsamic vinegar", 
            "1/2 cup tomato sauce of your choice (I cheated and used canned. Don’t tell!)", 
            "1 cup water", 
            "1 teaspoon chopped fresh rosemary leaves"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/balsamic-glazed-sweet-and-sour-cippoline1.jpg?w=500", 
        "tags": [
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/09/balsamic-glazed-sweet-and-sour-cippoline/", 
        "title": "balsamic-glazed sweet and sour cipollini", 
        "directions": [
            "Blanche the onions in boiling water for one minute and let them cool so that they can easily be peeled. Peel the onions, leaving and washing any root strand you may find.", 
            "In a 12 to14-inch saute pan over a medium high flame, heat virgin olive oil until just smoking. Add butter and cook until foam subsides. Add onions and saute until light golden brown on all sides, about 8 to 10 minutes. [Batali doesn’t mention this but listen to me and my messily-splattered walls, floor, ceiling and arms that still hurt at the thought of it: this will splatter a lot. You either want to use a splatter screen, should you be savvy enough to have one, or a lid. Consider yourself warned.]", 
            "Add sugar, vinegar, tomato sauce and water and bring to a boil. Cook onions uncovered covered (again, the splatter effect is such that a lid is worth using) until just al dente, about 10 minutes. If liquid dissipates too quickly, add more water, a 1/4 cup at a time, realizing that it is essential not to overcook the onions. The sauce should just adhere to the onions. Remove from saute pan to an earthenware dish and hold in a warm place, or allow to cool if you are serving them later or as an antipasto. Sprinkle with rosemary as a garnish."
        ], 
        "date": "2008-09-23T14:16:35+00:00"
    }, 
    {
        "ingredient_list": [
            "6 bacon slices*", 
            "1 1/2 cups chopped onion", 
            "1 1/4 cups purchased barbecue sauce", 
            "3/4 cup dark beer", 
            "1/4 cup mild-flavored (light) molasses", 
            "3 tablespoons Dijon mustard 3 tablespoons (packed) dark brown sugar", 
            "2 tablespoons Worcestershire sauce", 
            "1 tablespoon soy sauce", 
            "4 to 6 teaspoons minced canned chipotle chilies**", 
            "6 15- to 16-ounce cans Great Northern beans, drained", 
            "Chopped fresh parsley***"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/07/hot-and-smoky-baked-beans.jpg?w=750", 
        "tags": [
            "Beans", 
            "Photo", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2006/07/beans-beans-theyre-good-for-your-heart/", 
        "title": "hot and smoky baked beans", 
        "directions": [], 
        "date": "2006-07-20T22:27:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup all-purpose flour plus additional for kneading and rolling", 
            "3/4 cup cake flour (not self-rising)", 
            "2 large eggs", 
            "3/4 teaspoon salt", 
            "1/4 cup water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/best-things-in-small-packages1.jpg?w=500", 
        "tags": [
            "Dumplings", 
            "Mushrooms", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/11/best-things-in-small-packages/", 
        "title": "wild mushroom pirogies", 
        "directions": [
            "Stir together flours in a bowl. Make a well in flour and add eggs, salt, and water, then stir together with a fork without touching flour. Continue stirring, gradually incorporating flour into well until a soft dough forms. Transfer dough to a lightly floured work surface and knead, adding only as much additional flour as needed to keep dough from sticking, until smooth and elastic, about 8 minutes. (Dough will be soft.) Cover with plastic wrap and let rest at room temperature at least 30 minutes.", 
            "Do ahead: Dough may be made 2 hours ahead, wrapped well in plastic wrap and chilled. Bring to room temperature before using."
        ], 
        "date": "2006-11-22T00:38:47+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup extra virgin olive oil", 
            "1/2 cup minced celery", 
            "1/2 cup minced carrot", 
            "1 cup minced red onion", 
            "1 clove garlic, crushed", 
            "2 sprigs fresh rosemary", 
            "1 teaspoon tomato paste", 
            "1 cup peeled, crushed ripe tomatoes, preferably plum tomatoes, with their juices", 
            "Salt and freshly ground black pepper", 
            "1 1/2 pounds romano beans (flat green beans), ends trimmed (or fresh cranberry beans in their shells)."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/braised-romano-beans1.jpg?w=500", 
        "tags": [
            "Green Beans", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/09/braised-romano-beans/", 
        "title": "braised romano beans", 
        "directions": [
            "1. Heat oil in a deep skillet or a shallow three-quart saucepan. Add celery, carrot and onion and cook over medium heat, stirring occasionally, until vegetables barely begin to brown, about 25 minutes. Add garlic and rosemary and cook until fragrant, a few minutes. Stir in tomato paste and tomatoes. Bring to a simmer. Season with salt and pepper. Simmer until mixture is well combined, about 5 minutes.", 
            "2. Add beans, setting them in pan all in one direction. Add 1/2 cup water. Bring to a simmer. Baste beans, season with salt, reduce heat to low. Cook gently, partly covered, turning beans in sauce from time to time, until beans are very tender, about 40 minutes. Adjust seasoning and serve hot or at room temperature.", 
            "Yield: 6 servings."
        ], 
        "date": "2008-09-11T11:49:19+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons butter", 
            "1/2 large onion, diced", 
            "Salt", 
            "2/3 cup uncooked wild rice blend, rinsed", 
            "1 pound broccoli", 
            "1 garlic clove, minced or pressed", 
            "1/4 teaspoon ground mustard powder or 1/2 teaspoon smooth Dijon", 
            "Pinch of cayenne pepper", 
            "2 tablespoons all-purpose flour", 
            "1 cup whole milk", 
            "2/3 cup low-sodium vegetable or chicken broth", 
            "8 ounces cheddar cheese, coarsely grated", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/03/broccoli-cheddar-and-wild-rice-casserole.jpg?w=750", 
        "tags": [
            "Broccoli", 
            "Photo", 
            "Side Dish", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/03/broccoli-cheddar-and-wild-rice-casserole/", 
        "title": "broccoli, cheddar and wild rice casserole", 
        "directions": [
            "Heat 1 tablespoon butter in a medium saucepan over medium heat. Once melted, add onion and saute until translucent, about 5 minutes. Add rice to onion and cook for 1 minute, then add 1 1/3 cups water and a few pinches of salt. Bring mixture to a simmer, then reduce heat to lowest temperature and cook with the lid on for about 50 minutes (or whatever amount of time is suggested on your package of rice). If you’d like a rice cooker to do this for you, transfer onions, water and rice to the machine and set the machine.", 
            "Heat oven to 400 degrees.", 
            "Peel broccoli stems and dice them into large chunks. Cut florets into 1-inch pieces. Cook in boiling, well-salted water for 2 to 3 minutes, then drain.", 
            "You can use this same pan to make the cheese sauce. Melt remaining 2 tablespoons butter in pan over medium heat. Once melted, add the mustard powder (if using), a pinch of cayenne and garlic and let sizzle for 1 minute. Add flour and whisk until combined, cooking the butter-flour mixture for 1 to 2 minutes. Slowly drizzle in milk, whisking constantly, then broth. Bring to a simmer and cook mixture at a simmer, stirring the whole time, until sauce is slightly thickened, about 5 minutes. Stir in smooth Dijon mustard if you didn’t use mustard powder.", 
            "Remove pan from heat and stir in 1/3 of grated cheese until melted. Season generously with salt and pepper.", 
            "Combine cooked wild rice blend and broccoli in a 2-quart baking dish or a 9-inch oven-safe skillet. Pour cheese sauce over and gently nudge to ensure all pieces get some sauce. Sprinkle remaining cheese over top. Bake casserole for 10 to 15 minutes, until the sauce is bubbly, then run mixture under the broiler until cheese is toasty on top. "
        ], 
        "date": "2014-03-11T12:37:05+00:00"
    }, 
    {
        "ingredient_list": [
            "8 ounces (1 small-to-medium bundle, 225 grams) fresh broccoli (3 cups chopped)", 
            "1 large egg", 
            "1/2 cup (65 grams) all-purpose flour", 
            "1/3 cup (30 grams) finely grated parmesan cheese", 
            "1 small clove garlic, minced", 
            "1/2 teaspoon Kosher salt, plus more to taste", 
            "A pinch of red pepper flakes or several grinds of black pepper", 
            "Olive or vegetable oil for frying"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/broccoli-parmesan-fritters1.jpg?w=640", 
        "tags": [
            "Broccoli", 
            "Lunch", 
            "Pancakes", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Snack", 
            "Summer", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2012/06/broccoli-parmesan-fritters/", 
        "title": "broccoli parmesan fritters", 
        "directions": [
            "Prepare your broccoli: Separate the florets from the biggest stem(s). Cut the florets into 1-inch chunks. To prepare the stems, I like to peel them, as the skin can be thick and doesn’t cook quickly, then slice them into 1/2-inch lengths. You should have about 3 cups of chopped broccoli total.", 
            "Steam your broccoli until tender but not mushy: Use whatever method you prefer. My quickie, lazy method is to bring a 1/2-inch or so of water to a boil in a small saucepan, then add the broccoli, place a lid on it and simmer it for 5 to 6 minutes. Drain the broccoli, then set it aside to cool slightly.", 
            "In the bottom of a large bowl, lightly beat your egg. Add the flour, cheese, garlic, salt and pepper. Then, add the somewhat cooled broccoli and, using a potato masher, mash the broccoli just a bit. You’re looking to keep the bits recognizable, but small enough (1/4- to 1/2-inch chunks) that you can press a mound of the batter into a fritter in the pan. Once mashed a bit, stir or fold the ingredients together the rest of the way with a spoon. Adjust seasonings to taste.", 
            "Heat a large, heavy skillet over moderate heat. Once hot, add a good slick of oil (I usually use a mix of olive and vegetable oil), about 2 to 3 tablespoons. Once the oil is hot (you can test it by flicking a droplet of water into it; it should hiss and sputter), scoop a two tablespoon-size mound of the batter and drop it into the pan, then flatten it slightly with your spoon or spatula. Repeat with additional batter, leaving a couple inches between each. Once brown underneath, about 2 to 3 minutes, flip each fritter and cook on the other side until equally golden, about another 1 to 2 minutes.", 
            "Transfer briefly to paper towels to drain, then to a serving plate if you’ll be eating them shortly or a baking sheet in a 200 degree oven if you’d like to keep them warm for a while until needed. Repeat with remaining batter, adding more oil as needed. Serve with some of the suggestions listed in the head notes, above."
        ], 
        "date": "2012-06-12T12:25:02+00:00"
    }, 
    {
        "ingredient_list": [
            "1 bone-in pork shoulder, about 4 pounds", 
            "Kosher salt", 
            "2 tablespoons olive oil", 
            "1 medium white or yellow onion, peeled and cut into large pieces", 
            "1 large rib celery, cut into large pieces", 
            "1 small fennel bulb, trimmed and cut into large pieces", 
            "1 quart chicken stock, plus a splash or two more, if needed", 
            "3 sprigs fresh thyme", 
            "Freshly ground black pepper", 
            "4 tablespoons unsalted butter", 
            "2 9-ounce boxes dry lasagna, broken into 3-inch shards", 
            "2 tablespoons fresh lemon juice, or more to taste", 
            "2 tablespoons (although I use more) grated or shaved parmesan or grana padano cheese", 
            "1 tablespoon chopped parsley (optional)", 
            "Large handful arugula leaves, cleaned"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/10/broken-pasta-with-pork-ragu.jpg?w=750", 
        "tags": [
            "Arugula", 
            "Date Night", 
            "Fall", 
            "Freezer Friendly", 
            "Italian", 
            "Meat", 
            "Pasta", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/10/broken-pasta-with-pork-ragu/", 
        "title": "broken pasta with pork ragu", 
        "directions": [
            "Prepare pork: Use a sharp knife to remove the thick skin from the pork, but not trimming off all the fat — leave a thin sheen. Season generously with salt and place in fridge until ready to use — overnight is ideal but a few hours will cut it as well.\nBraise the pork: Heat your oven to 350 degrees. Heat a deep saucepan or Dutch oven over medium-high and add 2 tablespoons of the olive oil. When it shimmers, gently cook the onion, celery and fennel until they begin to soften, about 10 minutes. Add the stock and thyme and bring to a simmer, then season well with salt and pepper.", 
            "Rinse pork to remove excess salt, dry with a paper towel and add to seasoned broth. Cover and place in the oven for 90 minutes or more, until the meat just begins to pull away from the bone.\nAllow both meat and broth to cool in the braise out of the oven for 30 minutes, or until you can touch the meat with your hands. Remove the pork and gently pull the meat from the bone, then tear the chunks into bite-size shreds. Place these in a large bowl.\nStrain the braising liquid, pouring enough of it over the pork to barely cover it and keep it from drying out.", 
            "Pour the rest back into the pot, simmering it until it is reduced by half. Add pork and cooking liquid that has covered it, and warm it back to a simmer. Taste and adjust seasonings, adding more salt and pepper if needed. Add the butter and stir to emulsify.\nBring large pot of well-salted water to boil. Cook pasta until al dente, or usually a minute shy of package directions. Drain and add to the pork ragu, simmering for 1 minute.  Add the lemon juice, half the cheese and parsley, if using. Ladle into wide pasta bowls with and top with arugula and remaining cheese. We enjoyed this with an extra lemon wedge on the side.’\nDo ahead: Should you wish to freeze this — we froze half and I was overjoyed to find it again last month — shred the pork and return it to the reduced cooking liquid, stopping short of the butter; freeze them together in a bag. Once defrosted, rewarm to a simmer, add a splash or two of pasta cooking water if needed to loosen it, and then the butter (this ensures you get the most flavor from it). Add freshly cooked pasta, lemon and parmesan from here."
        ], 
        "date": "2016-10-24T12:26:38+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/brussel-sprouts-and-chestnuts-in-brown-butter1.jpg?w=500", 
        "tags": [
            "Brown Butter", 
            "Brussels Sprouts", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/11/brussel-sprouts-and-chestnuts-in-brown-butter/", 
        "title": "brussels sprouts and chestnuts in brown butter", 
        "directions": [
            "1. Bring 4 cups salted water to a boil, add brussels sprouts and cook 10 minutes. Drain and refresh under cold water. Drain again. ", 
            "2. Meanwhile, melt butter in a 3-quart saucepan. Add shallots and cook over medium heat, stirring, until light brown. Pour contents of pan through a fine strainer into a dish, pressing to remove as much butter as possible from shallots. Place shallots on paper towel to drain. Return butter to saucepan. ", 
            "3. If serving immediately, preheat oven to 400 degrees. Place saucepan over medium heat and cook until butter has a nutty aroma and is turning brown. Whisk in flour and cook until mixture is light brown. Whisk in stock and cook until sauce has thickened. Add lemon juice, salt and pepper to taste, and nutmeg. Add chestnuts and brussels sprouts, folding ingredients together. ", 
            "4. Transfer to an 8-cup baking dish. Scatter shallots on top. Bake about 15 minutes. Serve."
        ], 
        "date": "2007-11-14T23:57:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 large red onion, diced small", 
            "2 tablespoons red wine vinegar", 
            "2 teaspoons ground sumac", 
            "1/4 teaspoon kosher salt, plus more to season salad", 
            "2 cups shredded brussels sprouts", 
            "1/2 cup fresh pomegranate seeds (from about 1/2 a large one)", 
            "1/2 a large unpeeled apple, cored and diced (I used Granny Smith, the book recommends Pink Lady or Honeycrisp)", 
            "Juice of half a lemon, plus more to taste", 
            "1 1/2 to 2 tablespoons honey, plus more to taste", 
            "1/4 cup olive oil", 
            "3/4 cup toasted, cooled walnuts, lightly crushed or coarsely chopped", 
            "Ground chipotle chile pepper, urfa biber peppers, hot smoked paprika or another chile flake, to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad.jpg?w=750", 
        "tags": [
            "Apple", 
            "Brussels Sprouts", 
            "Fall", 
            "Gluten-Free", 
            "Onions", 
            "Photo", 
            "Pomegranate", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Tips", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad/", 
        "title": "brussels sprouts, apple and pomegranate salad", 
        "directions": [
            "Make the sumac-pickled onions: Combine red onion, wine vinegar, sumac and 1/4 teaspoon kosher salt in a small dish and set aside while you prepare the other ingredients, or ideally at least 15 minutes.\nCombine all salad ingredients, including red onions and their pickling liquid, in a medium bowl and season to taste with salt and red pepper. Taste and adjust ingredients as desired — I’ve seen versions of the recipe with more honey, olive oil and lemon; I didn’t need them but you might find you do.\nThis salad can be prepped ahead, but I’d keep the dressing off of it until at most an hour before serving so it doesn’t discolor the sprouts."
        ], 
        "date": "2016-11-21T13:06:43+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups diced (1/4 inch) cantaloupe (from a 2 1/4-lb piece)", 
            "1/4 cup diced (1/4 inch) sweet onion (such as Vidalia) or red onion", 
            "2 tablespoons chopped fresh basil or cilantro", 
            "1 (2-inch-long) fresh hot red or green chile (skip the seeds if you want to dim the heat), minced", 
            "2 tablespoons fresh lime juice", 
            "1/4 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/07/cantaloupe-salsa.jpg?w=752", 
        "tags": [
            "Cantaloupe", 
            "Fruit", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2009/07/cantaloupe-salsa/", 
        "title": "cantaloupe salsa", 
        "directions": [
            "Mix everything and eat immediately. "
        ], 
        "date": "2009-07-28T21:42:29+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (6 ounces) coarse cornmeal (also packaged as “polenta”) but regular old cornmeal will also work.", 
            "2 cups (16 ounces) buttermilk", 
            "1 to 2 tablespoons oil, butter or a combination thereof", 
            "1 cup onion in a 3/4-inch dice (I think you could also go up to 2 cups, if you’re really into the caramelized onion thing)", 
            "1 3/4 cups (8 ounces) unbleached, all-purpose flour", 
            "1 1/2 tablespoons (.75 ounce) baking powder", 
            "1/4 teaspoon (.05 ounce) baking soda", 
            "1 teaspoon (.25 ounce) salt", 
            "6 ounce log of goat cheese, at room temperature for a good while, so it’s very soft", 
            "2 tablespoons (1.5 ounces) honey", 
            "1/4 cup (2 ounces) granulated sugar", 
            "3 large (5 ounces) eggs, at room temperature", 
            "2 tablespoons (1 ounce) unsalted butter, mleted", 
            "2 1/2 cups (16 ounces) fresh or frozen corn kernels", 
            "2 tablespoons (1 ounce) bacon fat, vegetable oil or butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/caramelized-onion-and-goat-cheese-cornbread1.jpg?w=500", 
        "tags": [
            "Bread", 
            "Onions", 
            "Photo", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2009/03/caramelized-onion-and-goat-cheese-cornbread/", 
        "title": "caramelized onion and goat cheese cornbread", 
        "directions": [
            "The night before baking the cornbread, soak the cornmeal in the buttermilk. Cover and leave at room temperature overnight. [Though this step is optional, you might appreciate it if you use coarse cornmeal or if you often find cornbread on the gritty side.] If you don’t do this in advance, mix them in before you start the next step.", 
            "Preheat the oven to 350°F.", 
            "The next day, prepare the onions. Heat a large saute pan to medium and coat the bottom with 1 to 2 tablespoons of oil, butter or a combination thereof. Add the onions and cook them until they’re well-caramelized with browned edges. Season with salt and set aside.", 
            "Sift together the flour, baking powder, baking soda and salt and set aside.", 
            "In a large mixing bowl, beat the goat cheese until fluffy. Add the eggs, one at a time and scraping down the bowl between each. (It may look a little curdly at this point, don’t worry. It all comes back together in the oven.) Add the melted butter, honey, sugar and cornmeal/buttermilk mixture and mix until smooth. Add the flour mixture and stir until combined and then gently stir in the corn kernels, mixing them until the ingredients are evenly distributed.", 
            "Place two tablespoons of bacon fat, vegetable oil or butter in a 10 inch round cake pan (you can also use a cast-iron skillet, 9 by 13-inch baking pan or a 12-inch square pan). Place the pan in the oven for 5 to 7 minutes, until the fat gets very hot. With good pot holders, remove the pan and tilt it to grease the corners and sides. Pour in the batter, spreading it evenly and sprinkle the caramelized onion evenly over the top.", 
            "Bake for about 30 minutes, or until the cornbread is firm and springing (the baking time will depend on the size and type of pan) and a toothpick inserted into the center comes out clean.", 
            "Allow the bread to cool in the pan for at least 15 minutes before slicing it into squares or wedges. Serve immediately."
        ], 
        "date": "2009-03-18T13:49:47+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium head (about 2 to 2 1/4 pounds) cauliflower", 
            "4 tablespoons (55 grams or 2 ounces) unsalted butter", 
            "4 tablespoons (30 grams or 1 ounce) all-purpose flour", 
            "2 teaspoons mustard powder", 
            "Salt, to taste", 
            "Freshly ground black pepper or ground cayenne", 
            "2 cups (475 ml) milk, whole is best but low-fat will probably work just fine", 
            "1 1/4 cups plus 2 tablespoons (about 155 grams or 5 1/2 ounces total) grated cheddar, the strongest you can get, preferably English or Irish", 
            "Chopped chives or flat-leaf parsley, for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-cheese1.jpg?w=640", 
        "tags": [
            "British", 
            "Cauliflower", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/10/cauliflower-cheese/", 
        "title": "cauliflower cheese", 
        "directions": [
            "Heat oven to 400 degrees.", 
            "Trim cauliflower and remove tough core. Cut into 1 to 2-inch florets. Steam (for about 10 minutes) or par-boil (6 to 7 minutes) florets until firm but tender. Drain, if needed, and spread florets on a towel so that it can wick out as much moisture as possible", 
            "Meanwhile, in a medium saucepan, melt butter over medium-high heat. Add flour and whisk to combine; cook for 1 minute to ensure you get rid of the floury taste. Add mustard powder and a pinch of cayenne or few grinds of black pepper, and stir to combine. Drizzle in milk in a thin, steady stream, whisking the whole time so that no lumps form. Season with salt and bring mixture to a simmer, stirring with a spoon; mixture should thicken. Stir in 1 1/4 cups cheddar, a handful at a time, letting each handful melt before adding the next. Taste sauce and adjust seasonings if needed.", 
            "Spread cauliflower florets in a 2-quart baking ovenproof baking dish. Spoon sauce over florets and sprinkle with remaining 2 tablespoons cheese. Bake until until bronzed and bubbly, about 30 minutes. For reference, f I wasn’t in such a rush to get dinner out on the table, I’d have baked mine a minute or two longer, up to 35 minutes.", 
            "Sprinkle with herbs, if desired. Eat with abandon.", 
            "P.S. A hat tip to Kate, who reminded me earlier this week that this site is way overdue for cauliflower cheese, and immediately solving my what-to-make-for-dinner crisis du jour."
        ], 
        "date": "2014-10-23T12:03:07+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (3-pound) head cauliflower, cut into large florets", 
            "Kosher salt", 
            "4 tablespoons (1/2 stick) unsalted butter, divided", 
            "3 tablespoons all-purpose flour", 
            "2 cups hot milk", 
            "1/2 teaspoon freshly ground black pepper", 
            "1/4 teaspoon grated nutmeg", 
            "3/4 cup freshly grated Gruyere, divided", 
            "1/2 cup freshly grated Parmesan", 
            "1/2 cup fresh bread crumbs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/11/cauliflower-gratin.jpg?w=753", 
        "tags": [
            "Cauliflower", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2008/11/cauliflower-gratin/", 
        "title": "cauliflower gratin", 
        "directions": [
            "Preheat the oven to 375 degrees F.", 
            "Cook the cauliflower florets in a large pot of boiling salted water for 5 to 6 minutes, until tender but still firm. Drain.", 
            "Meanwhile, melt 2 tablespoons of the butter in a medium saucepan over low heat. Add the flour, stirring constantly with a wooden spoon for 2 minutes. Pour the hot milk into the butter-flour mixture and stir until it comes to a boil. Boil, whisking constantly, for 1 minute, or until thickened. Off the heat, add 1 teaspoon of salt, the pepper, nutmeg, 1/2 cup of the Gruyere, and the Parmesan.", 
            "Pour 1/3 of the sauce on the bottom of an 8 by 11 by 2-inch baking dish. Place the drained cauliflower on top and then spread the rest of the sauce evenly on top. Combine the bread crumbs with the remaining 1/4 cup of Gruyere and sprinkle on top. Melt the remaining 2 tablespoons of butter and drizzle over the gratin. Sprinkle with salt and pepper. Bake for 25 to 30 minutes, until the top is browned. Serve hot or at room temperature."
        ], 
        "date": "2008-11-23T20:03:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup thinly sliced almonds", 
            "Juice of half a lemon (about 1 tablespoon), plus more to taste", 
            "1 tablespoon white wine vinegar", 
            "1/4 teaspoon fine sea salt or table salt, then more to taste", 
            "3 tablespoons (30 grams) dried currants", 
            "5 tablespoons olive oil, plus more for frying", 
            "2 tablespoons (about 25 grams) brined or salt-packed capers", 
            "oil for frying", 
            "1 small, compact-looking head of cauliflower (about 1 1/4 pounds)", 
            "Freshly ground black pepper", 
            "3 scallions, thinly sliced (use green and white parts)", 
            "2 tablespoons chopped flat-leaf parsley (optional, mostly for color)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-slaw1.jpg?w=640", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Lunch", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/09/cauliflower-slaw/", 
        "title": "cauliflower slaw", 
        "directions": [
            "Heat oven to 350 degrees F. Spread almonds on a tray and toast them until they’re a deep golden color, tossing them once or twice to ensure even cooking. This will take 10 to 14 minutes. Set aside to cool.** ", 
            "Meanwhile, place lemon juice, vinegar and 1/4 teaspoon salt in a small bowl. Add currants; set aside and let them soak while you prepare the other ingredients. ", 
            "If using brined capers, drain and spread them on paper towels until most of their moisture has wicked out, about 5 minutes. If using salt-packed capers, soak them in water for 10 minutes to remove the saltiness, then drain, rinse and pat dry on paper towels. Pour a 1/2-inch of olive oil or another oil that you prefer to fry in in a small skillet or saucepan. Heat it over medium-high. When hot enough that a droplet of water added to the oil hisses, carefully add the capers and step back — they’re going to sputter a bit for the first 10 seconds. Once it’s safe to get closer, give them a stir. Depending on how dry they were, it can take 1 to 2 minutes for them to get lightly golden at the edges and then crisp. Remove with a slotted spoon. Drain on paper towels.", 
            "Trim cauliflower leaves and cut head into quarters. Using an adjustable-blade slicer (this is mine; it takes up very little room) to cut cauliflower, stem and florets, into 1/4-inch slices. Add to a large bowl. ", 
            "Scoop currants from vinegar mixture with a slotted spoon and add to bowl with cauliflower, along with almonds, capers, scallions and parsley. Slowly whisk 5 tablespoons olive oil into remaining vinegar mixture in a thin stream. Add several turns of freshly ground black pepper. Pour over cauliflower and other ingredients and turn gently to coat all pieces. Taste and adjust seasonings, adding more lemon juice, salt or pepper to taste. Dig in!", 
            "** P.S. I really tried to avoid this pesky oven step by toasting mine in a skillet, the one I’d use to fry the capers in a few minutes. Twice, I failed because the little bits got black and smoky before the larger ones toasted, no matter how much I kept them moving. I’m pretty sure I could do better in the future, but I was running out of almonds. If you trust your pan-toasting skills, feel free to cook the almonds there instead."
        ], 
        "date": "2014-09-16T11:56:06+00:00"
    }, 
    {
        "ingredient_list": [
            "1 head cauliflower, trimmed of leaves", 
            "1 1/2 tablespoons butter or olive oil", 
            "3 tablespoons fresh soft bread crumbs", 
            "1 tablespoon plus 1 teaspoon extra virgin olive oil", 
            "3 tablespoons whole almonds", 
            "Salt and freshly ground black pepper", 
            "2 tablespoons golden raisins (I had only dark ones on hand, nobody complained)", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon capers, rinsed and drained", 
            "1 teaspoon finely chopped parsley", 
            "1 teaspoon finely chopped tarragon", 
            "1 teaspoon finely sliced chives."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cauliflower-with-almonds-raisins-and-capers1.jpg?w=500", 
        "tags": [
            "Cauliflower", 
            "Photo", 
            "Side Dish", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/10/cauliflower-with-almonds-raisins-and-capers/", 
        "title": "cauliflower with almonds, raisins and capers", 
        "directions": [
            "1. Preheat oven to 350 degrees. Cut cauliflower from top to bottom in 1-inch slices. Place a large ovenproof skillet over low heat and add one tablespoon butter. When it has melted, add bread crumbs and toss until toasted and golden brown, about 3 minutes. Transfer crumbs to a plate and wipe out pan.", 
            "2. Return pan to medium heat and add one teaspoon olive oil. Add almonds and toss until lightly browned, 2 to 3 minutes. Season lightly with salt and pepper to taste. Transfer almonds to a plate, let cool, and cut each almond into three pieces*; set aside.", 
            "3. Wipe out pan and return to medium heat. Add remaining one tablespoon olive oil and cauliflower slices. Sauté until lightly browned on both sides. Transfer pan to oven and roast until tender, about 12 minutes. (I had to brown my cauliflower in batches, not having enough surface area in my pan, but tossed everything back in to roast it.) Meanwhile, in a small saucepan over low heat, melt remaining 1/2 tablespoon butter and add raisins, vinegar and 1 tablespoon water. Simmer until raisins are plump and soft, about 5 minutes; drain and set aside. In a small bowl, combine almonds, capers, raisins, parsley, tarragon and chives. Season with salt and pepper and toss to mix.", 
            "4. Arrange roasted cauliflower on a serving platter. Spoon almond-herb mixture evenly on top and sprinkle with toasted bread crumbs. Serve immediately.", 
            "* I read this step and laughed and laughed. Yes, SURE. Let’s all cut our almonds into thirds! Anyone have a scalpel and some tweezers? Impossible! And then the strangest thing happened: I stopped rolling my eyes — “chef recipes!” — long enough to try it and it turns out with a sharp knife one can absolutely cut almonds into thirds. This isn’t to say that you must, unless you’re feeling fancy. You are more than welcome to cut yours into halves or fifths or even roughly chop them and I won’t tell a soul. It can be our little secret."
        ], 
        "date": "2009-10-22T12:18:23+00:00"
    }, 
    {
        "ingredient_list": [
            "1 medium head cauliflower (1 1/2 to 2 pounds)", 
            "Oil for pan, if roasting", 
            "4 tablespoons salted or unsalted butter", 
            "1 medium or 2 tiny shallots, finely minced", 
            "1 small clove garlic, minced", 
            "Approximately 3/4 cup panko (Japanese-style) breadcrumbs", 
            "Salt and freshly ground black pepper", 
            "Few gratings of lemon zest", 
            "1 to 2 tablespoons fresh lemon juice", 
            "1 tablespoon chopped flat-leaf parsley or chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cauliflower-with-brown-butter-breadcrumbs1.jpg?w=640", 
        "tags": [
            "Brown Butter", 
            "Cauliflower", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/cauliflower-with-brown-butter-crumbs/", 
        "title": "cauliflower with brown butter crumbs", 
        "directions": [
            "To steam cauliflower: Set a steamer basket (see Notes) inside a large pot. Bring about one inch of water to a boil in the pot, lower cauliflower, whole or in large florets, into basket, and cover pot with lid. Reduce heat to medium. Let cauliflower steam for 10 to 20 minutes (less time if using a proper steamer basket, longer if using the modified basket below), or until it is easily pierced with a knife.   ", 
            "To roast cauliflower: Heat oven to 400 degrees. Lightly coat a large baking sheet with oil. Scatter cauliflower florets evenly over pan and roast until cauliflower is brown at edges and easily pierced with a knife, about 20 to 30 minutes. Toss and flip pieces once, halfway through roasting time, to ensure that they brown easily.", 
            "Make brown butter crumbs: When cauliflower is almost done, melt butter in a heavy frying pan over medium heat, and continue to cook it after it is melted until it is a little brown, and smells toasty. Working quickly, stir in the shallots, and let them hiss in the butter for about 30 seconds. Add the breadcrumbs, garlic, 1/4 teaspoon table salt (if using unsalted butter, skip if using salted) and a few grinds of black pepper and cook together, stirring frequently, until crumbs are a shade darker, anywhere from 5 to 10 minutes. Add a scrape or two of lemon zest and adjust seasonings to taste.", 
            "Assemble dish: Place whole cooked cauliflower or cauliflower florets in a low serving bowl. Toss gently with lemon juice, salt and pepper to taste. Spoon crumbs over cauliflower, pressing them onto the florets as you can, and letting the rest fall into the serving dish. Scatter herbs over top and serve with a large spoon.", 
            "Do ahead: Steam or roast cauliflower and make crumbs; keep them separate until serving. Just before serving, rewarm cauliflower and add crumbs.", 
            "Many notes:"
        ], 
        "date": "2013-11-20T12:06:40+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons (45 grams) melted butter", 
            "2 cups (250 grams) all-purpose flour, plus more for dusting the surface", 
            "1 tablespoon (15 grams) baking powder", 
            "1/2 teaspoon salt", 
            "1 tablespoon (15 grams) sugar (optional)", 
            "1 1/2 cups (355 ml) heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cream-biscuits1.jpg?w=500", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Muffin/Quick Bread", 
            "Scones/Biscuits", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2009/12/cream-biscuits/", 
        "title": "cream biscuits", 
        "directions": [
            "Preheat the oven to 425°F. Line a baking sheet with parchment paper. Melt butter in a small pot or microwave dish, and set aside. Sift two cups flour, the baking powder, salt and (if using) sugar into a large bowl. Fold in 1 1/4 cups cream. If the dough is not soft or easily handled, fold in the remaining 1/4 cup cream, little by little. (I ended up using two additional tablespoons, or half the unused cream.)", 
            "Turn dough onto a floured surface, mound it into a ball and, using your hands, press it to a thickness of about 3/4 inch. Cut into rounds, 2 1/2 inches in diameter. Gather dough scraps and continue to make rounds. Dip the top of each round in melted butter and arrange on the baking sheet. Bake until golden, 12 to 15 minutes. Serve immediately, or flash freeze for future use. [Biscuits can be baked straight from the freezer, and additional few minutes baking time will be needed, usually around 3 to 5.]"
        ], 
        "date": "2009-12-03T11:02:22+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1-pound bunch Swiss chard, thick stems removed and leaves sliced into ribbons", 
            "3 spring onions, ends trimmed, white and some green parts sliced into thin coins", 
            "3 tablespoons butter", 
            "3 tablespoons all-purpose flour", 
            "1 1/4 cups milk", 
            "Salt and pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creamed-chard-and-spring-onions1.jpg?w=500", 
        "tags": [
            "Onions", 
            "Pasta", 
            "Photo", 
            "Side Dish", 
            "Spring", 
            "Swiss Chard", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/04/creamed-chard-and-spring-onions/", 
        "title": "creamed chard and spring onions", 
        "directions": [
            "Wash your chard, but no need to dry it, just place it in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 6 minutes.", 
            "Press or squeeze out the excess liquid any number of ways, either by wringing it out in cheesecloth (my favorite method), putting it in a mesh strainer and pressing the moisture out with a spatula or large spoon or letting it cool long enough to grab small handfuls and squeezing them to remove as much water as possible.", 
            "Wipe out the large pot so you can use it again. Heat milk or cream in a small saucepan over moderate heat, stirring, until warm. Keep warm. Meanwhile, cook onion and garlic, if using, in butter in your wiped-out large pot over moderately low heat, stirring occasionally, until softened, about six minutes. Whisk in flour and cook roux, whisking, about three minutes. Add warm milk or cream in a slow stream, whisking constantly to prevent lumps, and simmer, whisking, until thickened, three to four minutes. Stir in chard, then salt and pepper to taste and cook, stirring, until heated through.", 
            "To make Creamed Chard and Spring Onion Pasta: Use 1 3/4 cups of milk instead of 1 1/4 cups. Stir 1/4 cup finely grated parmesan into the sauce while cooking, and keep extra on hand for serving. This should be enough to toss with about half a pound of pasta (more or less depending on how saucy you like yours)."
        ], 
        "date": "2010-04-25T13:25:41+00:00"
    }, 
    {
        "ingredient_list": [
            "100 or so pearl onions, unpeeled (from 3 10-ounce bags)", 
            "2 1/2 ounces bacon (applewood-smoked is suggested), cut into a small dice", 
            "1 1/4 cups heavy cream", 
            "1/4 teaspoon freshly grated nutmeg", 
            "2 tablespoons sherry", 
            "1/2 bunch chives, cut into 1/2-inch segments", 
            "Kosher salt, to taste (I used 1 teaspoon of Diamond Kosher salt)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creamed-onions-with-bacon-and-chives1.jpg?w=500", 
        "tags": [
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2010/11/creamed-onions-with-bacon-and-chives/", 
        "title": "creamed onions with bacon and chives", 
        "directions": [
            "Blanch the pearl onions for 3 minutes in a pot of boiling salted water. Drain, shock in a bath of ice water, and drain again. Peel the onions (making a slit with a paring knife down the side made this easiest for me), leaving a little of the root end intact.", 
            "[Want to use frozen, already peeled onions instead? I list some potential sources in the post.]", 
            "in a medium saucepan, cook the bacon until crisp, then remove it with a slotted spoon and drain it on paper towels. Leave only two tablespoons of the cooking fat in the pan, and add the pearl onions, heavy cream and nutmeg. Add salt to taste.", 
            "Cover the pot with a lid, leaving it a little ajar. Cook onions until they are nearly cooked through, about 90 percent of the way then remove the lid and finish cooking the onions while reducing the cream by half. Stir in the sherry.", 
            "If your onions are done cooking before the cream has sufficiently reduced or if you’re unsure about the alcohol in the sherry, remove the onions with a slotted spoon and transfer them to your serving dish. Continue cooking the remaining sauce to the desired consistency and taste and pour it back over the onions.", 
            "Garnish with bacon and chives and don’t forget to share."
        ], 
        "date": "2010-11-17T14:05:35+00:00"
    }, 
    {
        "ingredient_list": [
            "2 pounds baby spinach or 2 1/2 pounds fresh spinach, tough stems discarded", 
            "1 3/4 cups heavy cream or whole milk, or a mix thereof", 
            "1 small onion, finely chopped", 
            "1 small clove garlic, minced (optional)", 
            "3 tablespoons unsalted butter", 
            "3 tablespoons all-purpose flour", 
            "Pinch of freshly grated nutmeg"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/creamed-spinach.jpg?w=753", 
        "tags": [
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Spinach", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/11/creamed-spinach/", 
        "title": "creamed spinach", 
        "directions": [
            "Wash your spinach well but no need to spin or pat it dry. Place spinach in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 2 to 4 minutes for baby spinach and 4 to 6 minutes for regular spinach.", 
            "Press or squeeze out the excess liquid any number of ways, either by wringing it out in cheesecloth (my favorite method), putting it in a mesh strainer and pressing the moisture out with a spatula or large spoon or letting it cool long enough to grab small handfuls and squeezing them to remove as much water as possible. Coarsely chop the wrung-out spinach.", 
            "Wipe out large pot so you can use it again.", 
            "Heat milk or cream in a small saucepan over moderate heat, stirring, until warm. Keep warm. Meanwhile, cook onion and garlic, if using, in butter in your wiped-out large pot over moderately low heat, stirring occasionally, until softened, about six minutes. Whisk in flour and cook roux, whisking, about three minutes. Add warm milk or cream in a slow stream, whisking constantly to prevent lumps, and simmer, whisking, until thickened, three to four minutes. Stir in nutmeg, spinach, and salt and pepper to taste and cook, stirring, until heated through.", 
            "Do ahead: Creamed spinach can be made one day ahead and chilled, covered then reheated over moderately low heat until hot. However, it really tastes best eaten immediately."
        ], 
        "date": "2009-11-19T11:26:48+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound fresh broccoli", 
            "3 tablespoons olive oil, divided", 
            "1/2 teaspoon coarse or kosher salt", 
            "A few pinches of pepper flakes, to taste", 
            "Finely grated zest of half a lemon, or more to taste", 
            "1 large or 2 small garlic cloves, minced", 
            "Juice of half a lemon, or more to taste, to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/crispy-broccoli-with-lemon-and-garlic1.jpg?w=750", 
        "tags": [
            "Broccoli", 
            "Budget", 
            "Citrus", 
            "Lemon", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/04/crispy-broccoli-with-lemon-and-garlic/", 
        "title": "crispy broccoli with lemon and garlic", 
        "directions": [
            "Heat oven to 425°F (220°C). ", 
            "Prep your broccoli: Wash broccoli well — seriously, there is always a stem-colored worm hidden in the florets when I buy organic or from a farmer’s market, hooray for fewer pesticides! — and pat dry. Slice straight through the broccoli stem(s) as close to the crown of florets as possible. The crown should naturally break into several large florets, and you can cut these down into more manageable chunks. I find that less mess is made and less broccoli rubble is lost when I cut not down through the florets tops to halve chunks but up through the attached stems. (See 2nd photo above.) After cutting through the stem, I use my hands to break the floret the rest of the way in two. Don’t let the stems go to waste. I peel off the tough outer skin and knots and cut the stems into 1/2-inch segments; they cook up wonderfully this way, and at the same speed as the florets.", 
            "Drizzle the first tablespoon of oil over your baking sheet or roasting pan and brush or roll it around so it’s evenly coated. In a large bowl, toss prepared florets and stems with remaining olive oil, garlic, pepper flakes, salt and lemon zest until they’re evenly coated. Spread broccoli in an even layer in prepared pan. ", 
            "Roast for 20 minutes, then use a spatula to flip and move pieces around for even cooking. Roast another 10 to 15 minutes, checking every 5, until broccoli is toasty and as crisp as you like it. (As you can see, we like a serious char on ours.)", 
            "From the oven, taste a floret for seasoning and add more salt and pepper flakes if needed. Shower with fresh lemon juice and eat immediately, as-is or follow one of the adventures below.", 
            "7 More Insanely Delicious Things To Do With Crispy Broccoli "
        ], 
        "date": "2015-04-28T12:00:13+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons salted or unsalted butter, melted", 
            "3 tablespoons extra-virgin olive oil", 
            "Coarse salt", 
            "1/2 to 1 teaspoon red-pepper flakes (optional)(I used aleppo, which is milder and can therefore be used more generously)", 
            "4 pounds russet potatoes, peeled (smaller diameter potatoes are great, if you can find them)", 
            "4 shallots, peeled", 
            "8 sprigs thyme", 
            "Garnishes (optional): Bits of goat cheese, crumbles of bacon and/or bits of crisped pancetta"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/crispy-potato-roast1.jpg?w=640", 
        "tags": [
            "Budget", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/04/crispy-potato-roast/", 
        "title": "crispy potato roast", 
        "directions": [
            "Preheat oven to 375°F. In a small bowl, combine butter and oil. With a sharp knife or manoline, slice potatoes crosswise very thinly. Figure out what baking dish you’d like to use [see Note above]; Martha suggests a 9-inch round baking dish (a deep dish pie pan would fit this bill) though I think you could go an inch bigger, an oval 1 1/2 to 2 quart casserole dish might also be pretty. ", 
            "Once you’ve picked the dish that seems the best fit for your slices, pour a tablespoon or so of the butter/oil mixture in the bottom and spread it evenly. Sprinkle the oil mixture with a few pinches of coarse salt and red pepper flakes, if using; this will allow you to season both the top and underside of the potatoes. Arrange your potato slices vertically in the dish. ", 
            "Thinly slice shallots with your mandoline and slide shallot slivers between potato wedges, distributing them as evenly as possible. Brush with remaining oil/butter mixture. Generously season your dish with salt; go easier on the red pepper flakes, if using. Bake 1 1/4 hours, then arrange thyme sprigs on top and bake until potatoes are cooked through with a crisped top, about 35 minutes more. If casserole seems to brown too fast, cover it with foil to slow it down. Add any garnishes, if using, and serve immediately. "
        ], 
        "date": "2011-04-23T10:38:26+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons salted or unsalted butter, melted", 
            "3 tablespoons olive oil", 
            "Coarse salt and black pepper or red pepper flakes to taste", 
            "5 pounds sweet potatoes, peeled and sliced thin", 
            "2 shallots, peeled and sliced thin"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/crispy-sweet-potato-roast1.jpg?w=640", 
        "tags": [
            "Fall", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/11/crispy-sweet-potato-roast/", 
        "title": "crispy sweet potato roast", 
        "directions": [
            "Heat oven to 375°F (190°C). Heat butter and oil together until butter has melted. Pour 2 tablespoons of the mixture in the bottom of a 2-quart baking dish. (Mine is 9.5-by-12-inches, if that helps.) Sprinkle butter/oil puddle with some salt and pepper. Arrange your potato slices vertically in the dish. Add a sliver of shallot between every few slices of potato, if desired. Brush tops of potatoes with remaining butter/oil and season generously with more salt and pepper. Cover dish with foil and bake for 45 to 50 minutes, until potatoes are tender and almost fully cooked. Increase oven heat to 450æF (230°C), remove foil and let roast another 10 to 20 minutes, until tops of potatoes are nicely browned. ", 
            "If you’d like to finish this with the Thanksgiving Salsa Verde I show here, or at least serve it on the side, place 1 scant cup of parsley leaves, 1 tablespoon fresh rosemary, 1 generous teaspoon of fresh thyme and sage leaves, 1 small garlic clove, the zest of 1/2 a lemon and 2 teaspoons capers (rinsed and drained if salted) in a food processor or blender and blend until finely chopped. Drizzle in 7 tablespoons olive oil with the machine running, or enough the mixture is loose and somewhat pourable. Season well with salt and pepper flakes. ", 
            "[For more finishing suggestions, see last paragraph of post above.]"
        ], 
        "date": "2014-11-20T11:57:04+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 to 1 pound fresh mozzarella, diced into 1/2-inch cubes", 
            "1 pound peak-season tomatoes (I prefer roma for this because they’re less wet, but other varieties also work), diced into 1/2-inch cubes", 
            "1 15-ounce can white beans, drained and rinsed or 1 3/4 cups white beans that you’ve cooked fresh", 
            "1/4 cup pesto (or a handful of slivered basil plus 1/4 cup olive oil)", 
            "3 to 4 tablespoons red wine vinegar", 
            "Salt and pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cubed-hacked-caprese1.jpg?w=500", 
        "tags": [
            "Beans", 
            "Gluten-Free", 
            "Photo", 
            "Salad", 
            "Side Dish", 
            "Summer", 
            "Tomatoes"
        ], 
        "url": "https://smittenkitchen.com/2009/08/cubed-hacked-caprese/", 
        "title": "cubed, hacked caprese", 
        "directions": [
            "Mix and season and then reseason again to adjust to your taste. Eat at once or keep it in the fridge up to a few days (really, it will depend on how fresh your mozzarella is; the made-daily stuff is only good for a day or two, most others will last nearly a week)."
        ], 
        "date": "2009-08-24T22:03:04+00:00"
    }, 
    {
        "ingredient_list": [
            "For pork", 
            "1 pound solid piece boneless pork butt (shoulder) or pork tenderloin", 
            "1/4 cup hoisin sauce", 
            "1/4 cup soy sauce (low-sodium is best here)", 
            "1/4 cup Chinese rice wine or sake", 
            "1 tablespoon finely chopped peeled fresh ginger", 
            "1 teaspoon finely chopped garlic", 
            "1/2 teaspoon salt (see Note below)", 
            "For dressing", 
            "3/4 cup seasoned rice vinegar", 
            "1/2 cup peanut or vegetable oil**", 
            "3 tablespoons fresh lime juice", 
            "3 tablespoons finely grated peeled fresh ginger", 
            "1 large fresh jalapeno chile, seeded and minced", 
            "For salad", 
            "8 oz very thin bean-thread noodles (also known as cellophane, glass, or mung bean noodles)", 
            "3/4 lb Chinese long beans (1 bunch) or green beans, trimmed and cut into 3-inch pieces", 
            "1 seedless cucumber (usually plastic-wrapped; about 1 lb), halved lengthwise and sliced diagonally 1/8 inch thick", 
            "1 bunch scallions, cut into matchsticks", 
            "1 firm-ripe mango, peeled, pitted, and thinly sliced", 
            "2 thin carrots, cut into 1/8-inch-thick matchsticks", 
            "1/2 cup loosely packed fresh cilantro leaves", 
            "1/2 cup loosely packed fresh mint leaves", 
            "1/2 cup loosely packed fresh small basil leaves "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/05/cellophane-noodle-salad-with-roast-pork.jpg?w=753", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Salad", 
            "Vietnamese"
        ], 
        "url": "https://smittenkitchen.com/2007/05/deb-1-mandoline-0/", 
        "title": "cellophane noodle salad with roast pork", 
        "directions": [
            "Prepare pork:  Cut pork along the grain into long 1 1/2- to 2-inch-wide strips. Remove and discard any sinew but do not trim fat. Transfer pork to a large sealable plastic bag. Stir together remaining pork ingredients in a small bowl until combined well. Add to pork and turn to coat, then squeeze bag to eliminate as much air as possible and seal. Marinate pork, chilled, at least 4 hours but no longer than 24.", 
            "Roast pork: Put oven rack in lower third of oven and preheat oven to 375°F. Put 1/2 inch water in a 13- by 9-inch roasting pan and place a metal rack across top of pan (rack should not touch water). ", 
            "Remove pork from marinade, reserving marinade, and arrange pork strips 1 inch apart on rack. Roast in oven 15 minutes.", 
            "Meanwhile, bring marinade to a boil in a 1-quart saucepan, then boil 1 minute (marinade may look curdled). Remove from heat.", 
            "Brush both sides of pork with some marinade and roast 10 minutes more. Generously brush both sides of pork with marinade again and roast, basting 2 or 3 times, 10 minutes more. I recommend brushing it as many times as it takes to use the marinade up; you won’t regret it.", 
            "Increase oven temperature to 400°F and roast pork until strips are mahogany-colored and caramelized on edges, 10 to 15 minutes more (pork shoulder will need the most time, tenderloin the least; totally cooking time will be about 50 minutes). Transfer to a cutting board and let stand, loosely covered with foil, 10 minutes.", 
            "Make dressing while pork roasts:  Blend together all dressing ingredients in a blender until smooth. (See Note below about an alternate dressing.)", 
            "Cook noodles and beans while pork finishes roasting: Soak noodles in cold water to cover until pliable, about 15 minutes, then drain in a colander. Cut noodles in half with kitchen shears.", 
            "Cook beans in a 5- to 6-quart pot of boiling salted water, uncovered, until crisp-tender, 4 to 5 minutes. Transfer with a skimmer or slotted spoon to a large bowl of ice and cold water to stop cooking, reserving cooking liquid in pot. Drain beans and pat dry.", 
            "Return bean-cooking liquid to a boil, then cook noodles, uncovered, stirring occasionally, until just tender, about 2 minutes. Drain noodles in colander and rinse under cold water to stop cooking. Drain noodles again, then spread out on paper towels and pat dry.", 
            "Assemble salad:  Cut as much pork as desired for salad across the grain into 1/4-inch-thick slices. Toss noodles with 1/4 cup dressing in a bowl. Toss long beans with 2 tablespoons dressing in another bowl. Arrange pork, noodles, beans, and remaining salad ingredients on a large platter. Drizzle with some of dressing and serve remaining dressing on the side.", 
            "Many notes (Updated 1/10/14):"
        ], 
        "date": "2007-05-21T12:37:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound salt pork, pancetta or bacon, diced", 
            "1 large onion, finely diced", 
            "3 shallots, chopped", 
            "4 tablespoons butter, as needed", 
            "2 pounds beef chuck, in 1-inch cubes", 
            "2 tablespoons flour", 
            "Salt and freshly ground black pepper", 
            "1/2 cup Cognac (see Note)", 
            "2 cups unsalted beef stock", 
            "1/2 cup smooth Dijon mustard", 
            "4 tablespoons coarse Dijon or Pommery mustard (see Note)", 
            "4 medium carrots, peeled and cut into half-moon slices", 
            "1/2 pound mushrooms, stemmed, cleaned and quartered", 
            "1/4 cup red wine (see Note)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/dijon-and-cognac-beef-stew.jpg?w=750", 
        "tags": [
            "Beef", 
            "Date Night", 
            "French", 
            "Photo", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/02/dijon-and-cognac-beef-stew/", 
        "title": "dijon and cognac beef stew", 
        "directions": [
            "Place salt pork in a Dutch oven or a large heavy kettle over low heat, and cook until fat is rendered. Remove solid pieces with a slotted spoon, and save for another use, like your salad, vegetables or, uh, snacking. Raise heat to medium-low, and add onion and shallots. Cook until softened but not browned, about 10 to 15 minutes. Use a slotted spoon to transfer to a large bowl.", 
            "If necessary, add 2 tablespoons butter to the pan to augment fat. Dust beef cubes with flour, and season lightly with salt and more generously with pepper. Shake off excess flour, and place half the cubes in the pan. Cook over medium-high heat until well browned, almost crusty, on all sides, then transfer to a bowl with onions. Repeat with remaining beef.", 
            "Add Cognac to the empty pan, and cook, stirring, until the bottom is deglazed and any crusted-on bits come loose. Add stock, smooth Dijon mustard and 1 tablespoon coarse or Pommery mustard. Whisk to blend, then return meat and onion mixture to pan. Lower heat, cover pan partway, and simmer gently until meat is very tender, about 1 1/4 hours.", 
            "Add carrots, and continue simmering for 40 minutes, or until slices are tender. As they cook, heat 2 tablespoons butter in medium skillet over medium-high heat, and sauté mushrooms until browned and tender. Stir mushrooms into stew along with remaining mustard and red wine. Simmer 5 minutes, then taste, and adjust seasoning. Serve hot."
        ], 
        "date": "2014-02-24T12:16:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound brussels sprouts", 
            "1 tablespoon unsalted butter", 
            "1 tablespoon olive oil", 
            "Salt", 
            "Freshly ground black pepper", 
            "1/2 cup dry white wine", 
            "1 cup broth (chicken or vegetable)", 
            "2 to 3 shallots, peeled and thinly sliced", 
            "2 tablespoons heavy cream", 
            "1 tablespoon smooth dijon mustard (or more to taste)", 
            "2 tablespoons chopped flat-leaf parsley (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/dijon-braised-brussels-sprouts1.jpg?w=500", 
        "tags": [
            "Brussels Sprouts", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/11/dijon-braised-brussels-sprouts/", 
        "title": "dijon-braised brussels sprouts", 
        "directions": [
            "Trim sprouts and halve lengthwise. In a large, heavy 12-inch skillet heat butter and oil over moderate heat. Arrange halved sprouts in skillet, cut sides down, in one layer. Sprinkle with salt and pepper, to taste. Cook sprouts, without turning until undersides are golden brown, about 5 minutes. [Updated to note: If your sprouts don’t fit in one layer, don’t fret! Brown them in batches, then add them all back to the pan, spreading them as flat as possible, before continuing with the shallots, wine, etc.]", 
            "Add the shallots, wine and stock and bring to a simmer. Once simmering, reduce the heat to medium-low (for a gentle simmer), cover the pot with a lid (foil works too, if your skillet lacks a lid) and cook the sprouts until they are tender can be pierced easily with the tip of a paring knife, about 15 to 20 minutes.", 
            "Remove the lid, and scoop out brussels (leaving the sauce behind). Add cream and simmer for two to three minutes, until slightly thickened. Whisk in mustard. Taste for seasoning, and adjust as necessary with more salt, pepper or Dijon. Pour sauce over brussels, sprinkle with parsley, if using, and serve immediately."
        ], 
        "date": "2011-11-30T11:18:28+00:00"
    }, 
    {
        "ingredient_list": [
            "2 1/2 pounds (1 1/8 kg) Yukon Gold potatoes (about 6 medium)", 
            "6 cups (1.4 liters) peanut oil", 
            "Fine sea or table salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/03/easier-french-fries.jpg?w=750", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2017/03/easiest-french-fries/", 
        "title": "easiest french fries", 
        "directions": [
            "Cover your largest baking sheet with paper towels or paper bags for draining.\nScrub potatoes and dab them dry, then cut into 1/4-inch batons (see here for how I do it). Place in a 4 to 5-quart heavy, deep frying pan or Dutch oven and add oil; it will barely cover the potatoes. Turn burner to high and bring oil to a boil, which will take about 5 minutes. Cook potatoes for another 15 minutes; do not stir; they’ll just break. At this 20 minute mark, you can use tongs or a thin spatula to gently scrape loose any potatoes that have stuck to the pan. Continue to cook, stirring only if absolutely necessary, for 5 to 10 minutes longer, or until crisp and as golden as you like them.\nUse a large slotted spoon or spider to scoop potatoes from and spread them on prepared tray drain, tossing immediately with salt as you do.", 
            "You can keep fries warm in a 200 degree oven but the texture is really best right from the fryer."
        ], 
        "date": "2017-03-13T12:01:41+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds baking potatoes, peeled and cut into chunks", 
            "4 to 5 tablespoons unsalted butter + a little extra to melt and drizzle over the dumplings (Deb note: I was able to make do with just 2 T butter in a non-stick)", 
            "3 onions, finely chopped", 
            "Salt and black pepper to taste", 
            "1 to 2 packages of gyoza (pot sticker) wrappers", 
            "3 to 5 green onions, thinly sliced or 1/4 cup chopped chives or 2 tablespoons chopped parsley or additional fried onions (see note), to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/from-insert-your-origin-here-with-love1.jpg?w=500", 
        "tags": [
            "Dumplings", 
            "Photo", 
            "Potatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2007/07/from-insert-your-origin-here-with-love/", 
        "title": "quick potato pierogi", 
        "directions": [
            "Sour cream, melted butter or vinegar to serve ", 
            "Cook the potatoes in a large pot of salted boiling water until just tender. Drain and set aside. ", 
            "Melt the butter in a large heavy frying pan and cook the onions until they soften then lightly brown, darkly browned in spots. ", 
            "Mash the potatoes in a bowl then mix in the onions and their cooking butter. Season generously with salt and pepper. ", 
            "Using a round cookie or biscuit cutter the width of the smaller side of the dumpling wrapper, cut 10 to 12 wrappers at a time into circles, discarding the extra. Working on at a time, brush the edge of the round wrapper with water and place a spoonful of filling in the center. Fold dumpling in half, pressing the edges together to thoroughly seal. ", 
            "Place each dumpling on a parchment or waxed paper lined baking sheet and repeat until all filling has been used. ", 
            "Chill in the refrigerator if you are making them ahead of time. If you wish to freeze the dumplings for later use, make sure they are not touching, then freeze them until solid and later gather them into a freezer bag. This ensures that you will avoid having one mega-pierogi clump when you are ready to cook them.", 
            "To cook the pierogi: Bring a large pot of salted water to a boil and add the dumplings one at a time, until the surface of the pan is covered with dumplings. Do not overcrowd; you’ll have to work in batches. When they are done, about 2-3 minutes, remove with a slotted spoon. ", 
            "Transfer to bowls and serve sprinkled with green onions, parsley or chives, drizzled with a little melted butter or vinegar or topped with a deb of sour cream. ", 
            "Alternatively, you can pan-brown the pierogi. Heat some oil in a heavy frying pan and add dumplings in a single layer. When they are golden and in spots, browned, turn and brown other side. Add enough water to reach about 1/4-1/2 inch in depth. Cover and cook 3-4 minutes; remove lid and check for doneness. When pierogi are tender but not mushy to the tooth, and the liquid is evaporated, they are ready. ", 
            "Note: To make fried onions, saute 2 to 3 thinly sliced onions, in butter in a heavy frying pan until they are limp and lightly browned; add several tablespoons water and cook until the onions are soft and silky, the liquid mostly evaporated. Season with salt and pepper. "
        ], 
        "date": "2007-07-08T13:54:11+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound mushrooms such as cremini or white, halved lengthwise if large", 
            "2 tablespoons capers, rinsed and chopped", 
            "3 large garlic cloves, minced", 
            "2 tablespoons vegetable oil", 
            "3 tablespoons unsalted butter, cut into pieces", 
            "2 teaspoons fresh lemon juice", 
            "1/4 cup chopped flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/12/garlic-butter-roasted-mushrooms.jpg?w=749", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Mushrooms", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/12/garlic-butter-roasted-mushrooms/", 
        "title": "garlic butter roasted mushrooms", 
        "directions": [
            "Preheat oven to 450°F with rack in middle. Toss mushrooms with capers, garlic, oil, 1/8 teaspoon salt and several grinds of pepper in a 1 1/2- to 2-qt shallow baking dish. Top with butter and roast, stirring occasionally, until mushrooms are tender and golden and bubbly garlic sauce forms below, 15 to 20 minutes. Stir in lemon juice and parsley. Serve immediately, with crusty bread on the side for swiping up the juices."
        ], 
        "date": "2010-12-12T14:34:51+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds small (I used Manila) clams", 
            "2 thick slices country or sourdough bread", 
            "1/2 tablespoon olive oil to brush bread (optional)", 
            "2 tablespoons butter", 
            "2 cloves garlic, thinly sliced or minced", 
            "1 large or 2 small shallots, minced or 1/4 cup minced white onion", 
            "Salt and red pepper flakes", 
            "1/2 cup dry white wine", 
            "1 tablespoon chopped fresh herbs — parsley, cilantro, chives or a mix", 
            "1 lemon, in wedges"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/09/garlic-wine-and-butter-steamed-clams.jpg?w=750", 
        "tags": [
            "Budget", 
            "Date Night", 
            "Photo", 
            "Portuguese", 
            "Quick", 
            "Seafood", 
            "Summer", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/09/garlic-wine-and-butter-steamed-clams/", 
        "title": "garlic wine and butter steamed clams", 
        "directions": [
            "If you think your clams may not be clean, wash them first: Fill a large bowl with cool tap water and place the clams in it. Let them soak for 20 minutes during which they’ll expel any sand and grit.", 
            "While they’re soaking, grill or broil your bread: Dab both sides lightly with olive oil, if using, and grill or broil until well-toasted on both sides.", 
            "Lightly scrub your clams. Discard any with chipped shells.", 
            "In a large saute pan with a lid, melt butter and add garlic, shallots, salt and pepper flakes. Cook for 1 to 2 minutes over medium-high. Add wine — and as soon as it simmers, add all the clams and cover with a lid. In three minutes, almost all should be wide open; discard any that do not open. Transfer to a bowl and ladle cooking liquid over. Scatter with herbs and serve with grilled bread and lemon."
        ], 
        "date": "2016-09-20T11:58:56+00:00"
    }, 
    {
        "ingredient_list": [
            "Crispy Onions", 
            "2 medium yellow onions, halved and thinly sliced", 
            "1/4 cup all-purpose flour", 
            "2 tablespoons panko or plain breadcrumbs", 
            "1/2 teaspoon table salt", 
            "Freshly ground black pepper", 
            "Canola, safflower, peanut or other high-heat oil, for deep-frying", 
            "Mushroom Sauce", 
            "3 tablespoons butter", 
            "12 ounces mushrooms, thinly sliced or coarsely chopped", 
            "Few gratings fresh nutmeg (optional)", 
            "Freshly ground black pepper", 
            "3/4 teaspoon table salt", 
            "2 garlic cloves, minced", 
            "3 tablespoons all-purpose flour", 
            "1 1/2 cups vegetable or chicken broth", 
            "1/2 cup heavy cream", 
            "Assembly", 
            "1 to 1 1/2 pounds green beans, trimmed and halved (see note about volume)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/10/green-bean-casserole-with-crispy-onions1.jpg?w=640", 
        "tags": [
            "Fall", 
            "Green Beans", 
            "Mushrooms", 
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/green-bean-casserole-with-crispy-onions/", 
        "title": "green bean casserole with crispy onions", 
        "directions": [
            "Make the crispy onions: Toss onion with flour, breadcrumbs, salt and pepper. Heat a 1/2-inch or so of oil in a 12-inch cast iron skillet until a drop of water flicked into it will hiss and sputter. Add onions, just a handful at a time in something close to a single layer, and fry until a light golden brown (they’ll get more color in the oven; I overcooked mine a bit, forgetting this). Remove with a spider or large slotted spoon, let oil drip off a little, back into the skillet, then spread onions out on paper towels to drain. Repeat with remaining onions. Set aside until needed; this makes a lot.", 
            "Heat oven to 400 degrees F.", 
            "Prepare the beans: Bring a large pot of salted water to boil and boil greens for 5 minutes (for standard green beans) or 2 to 3 minutes (for haricot vert, or skinny ones). Drain beans, then plunge them into ice water to full stop them from cooking. Drain again, and set aside. (If you are adamant about only using one pot, you can boil them in your 12-inch cast iron skillet that you use for the other steps. But a saucepan can be easier.)", 
            "Make the mushroom sauce: Over medium-high heat, melt butter in the bottom of a 12-inch cast iron skillet. Add the mushrooms, salt and pepper and saute them until they start releasing their liquid, anywhere from 3 to 5 minutes, depending on how they were chopped. Add the garlic and saute one minute more. Add the flour and stir it until it fully coats the mushrooms. Add the broth, 1/4 cup at a time, stirring the whole time. Simmer mixture for 1 minute, then add cream and bring back to a simmer, cooking until the sauce thickens a bit, about 5 to 6 minutes, stirring frequently. ", 
            "Assemble and bake: Add cooked greens beans to sauce and stir until they are coated. Sprinkle crispy onions over the top. Bake for 15 minutes, or until sauce is bubbling and onions are a shade darker. Eat at once.", 
            "Do ahead, a few ways: Onions can be made long in advance (up to a day) and keep at room temperature, loosely wrapped (they’d get soggy in an airtight container). Green beans can be cooked and kept in fridge until needed, at least one day. Green beans can also be combined with mushroom sauce and kept refrigerated for up to a day. Add onions and bake shortly before serving. Finally, it’s less ideal, but the entire dish can be cooked, loosely wrapped (so the crispy top doesn’t get soggy) and then rewarmed in a low oven before serving. Just keep an eye on the topping so it doesn’t get too brown while reheating.", 
            "A few notes: "
        ], 
        "date": "2013-11-18T11:56:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound plain yogurt (regular or lowfat)", 
            "1/4 cup olive oil, plus more for brushing grill", 
            "1 teaspoon lemon zest", 
            "1/4 cup freshly squeezed lemon juice (2 lemons)", 
            "5 tablespoons fresh whole rosemary leaves, chopped", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon freshly ground black pepper", 
            "2 pounds top round lamb", 
            "1 red onion", 
            "14 ounces Greek yogurt (Ina recommends Fage Total; I recommend whatever you like best, and yes, I use full fat, always)", 
            "1 hothouse cucumber, unpeeled and seeded", 
            "1/4 cup sour cream", 
            "2 tablespoons freshly squeezed lemon juice", 
            "1 tablespoon white wine vinegar", 
            "1 tablespoon minced fresh dill", 
            "1 1/2 teaspoons minced garlic", 
            "2 teaspoons kosher salt", 
            "1/2 teaspoon freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/grilled-lamb-kebabs-tzatziki1.jpg?w=500", 
        "tags": [
            "Cucumber", 
            "Date Night", 
            "Greek", 
            "Grilling", 
            "Meat", 
            "Photo", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2009/09/grilled-lamb-kebabs-tzatziki/", 
        "title": "grilled lamb kebabs + tzatziki", 
        "directions": [
            "Place the yogurt in a medium bowl. Grate the cucumber on a box grater (or in your food processor, if you like to get things done in one hundreth of the time!) and squeeze the grated cucumber with your hand to remove some of the liquid. (Pressing it in mesh sieve with a spoon to extract the extra water or wringing it in cheesecloth also work well.) Add it to the yogurt along with the sour cream, lemon juice, vinegar, dill, garlic, salt and pepper and stir. Serve with grilled pita wedges."
        ], 
        "date": "2009-09-14T17:35:40+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds boneless pork shoulder or pork butt, cut into 2-inch cubes", 
            "1/2 cup orange juice", 
            "1/4 cup lime juice (from about 2 to 3 limes)", 
            "4 cloves garlic, peeled and crushed", 
            "1 teaspoon ground cumin", 
            "1 teaspoon Kosher salt, plus more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/11/homesick-texan-carnitas.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2011/11/homesick-texan-carnitas/", 
        "title": "homesick texan carnitas", 
        "directions": [
            "Place the pork in a large Dutch oven or heavy pot. Add the orange juice, lime juice, garlic, cumin, salt and enough water to just barely cover the meat. Bring the pot to a boil and then reduce the heat to a simmer. Simmer uncovered for two hours. Don’t touch the meat.", 
            "After two hours, increase the heat to medium-high and while occasionally stirring and turning the pieces, continue to cook for about 45 minutes, or until all of the liquid has evaporated, leaving only the rendered pork fat. Let it sizzle in this fat long enough to brown at the edges, turning pieces gently (they’ll be eager to fall apart), only as needed.", 
            "When pork has browned on both sides, it’s ready. Adjust seasonings to taste and serve on warmed tortillas with fixings. "
        ], 
        "date": "2011-11-04T11:09:19+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup leeks in 1/2-inch thick slices, white and light green parts only, cleaned and rinsed", 
            "Kosher or coarse salt", 
            "2 tablespoons (1 ounce) unsalted butter", 
            "Freshly ground black pepper", 
            "6 cups 1-inch-cubed crustless brioche or Pullman loaf (I used a little less than one loaf)", 
            "2 teaspoons finely chopped chives (I forgot to buy these; it made me sad)", 
            "1/2 teaspoons fresh thyme leaves", 
            "1 large egg", 
            "1 large egg yolk", 
            "3 cups whole milk, heavy cream or half-and-half or a combination thereof", 
            "Freshly grated nutmeg", 
            "1/2 cup shredded Comté, Emmanthaler or Swiss cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/03/leek-bread-pudding1.jpg?w=640", 
        "tags": [
            "Breakfast", 
            "Brunch", 
            "Easter", 
            "Eggs", 
            "Leeks", 
            "Photo", 
            "Side Dish", 
            "Spring", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/04/leek-bread-pudding/", 
        "title": "leek bread pudding", 
        "directions": [
            "Place a medium sauté pan over medium-high heat, drain excess water from leeks, and add to pan. Season with salt, and sauté until leeks begin to soften, about 5 minutes, then reduce heat to medium-low. Stir in butter. Cover and cook, stirring occasionally, until leeks are very soft, about 20 minutes. Adjust salt and pepper to taste.", 
            "Preheat oven to 350 degrees. While leeks are cooking, spread bread cubes on a baking sheet and bake until dry and pale gold, about 15 to 20 minutes (my already-stale brioche took less time to brown), turning pan about halfway through. Transfer to a large bowl, leaving the oven on.", 
            "Add leeks, chives and thyme to the bowl of bread; toss well. In another large bowl, lightly whisk the egg and egg yolks, then whisk in milk or cream, a generous pinch of salt, pepper to taste and a pinch of nutmeg.", 
            "Sprinkle 2 tablespoons shredded cheese in bottom of a buttered 9-by-5-inch loaf pan. Spread 1/2 of bread mixture in pan, and sprinkle with another 2 tablespoons cheese. Spread remaining bread mixture in pan, and sprinkle with another 1/4 cup cheese. Pour in enough milk mixture to cover bread, and gently press on bread so milk soaks in. Let rest 15 minutes.", 
            "Add remaining milk mixture, letting some bread cubes protrude. Sprinkle with salt. Bake until pudding is set and top is brown and bubbling, about 55 to 65 minutes. Serve hot or cold (because I’m weird and enjoy bread pudding cold)."
        ], 
        "date": "2010-04-30T12:00:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 cup olive oil, divided", 
            "4 large links of sweet Italian sausage, casings removed (I used half of this, preferring the sausage to not dominate the soup’s flavor [update] and from the comments, it sounds like most of you preferred it with just 2 links as well)", 
            "1 medium onion, diced", 
            "2 celery stalks, sliced or diced", 
            "2 medium carrots, peeled and sliced into half-moons or diced", 
            "4 cloves garlic, sliced (reserve half for later in recipe)", 
            "Kosher salt", 
            "A pinch of crushed red pepper flakes (optional)", 
            "1 cup brown lentils, sorted and rinsed", 
            "2 bay leaves", 
            "1 28-ounce can crushed tomatoes", 
            "6 cups water", 
            "Freshly ground black pepper", 
            "3 to 4 cups shredded or thinly ribboned Swiss chard leaves or kale", 
            "Grated Pecorino Romano cheese to finish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/01/lentil-soup-with-sausage-chard-and-garlic.jpg?w=750", 
        "tags": [
            "Beans", 
            "Date Night", 
            "Photo", 
            "Soup", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2013/01/lentil-soup-with-sausage-chard-and-garlic/", 
        "title": "lentil soup with sausage, chard and garlic", 
        "directions": [
            "Heat 1/4 cup olive oil (enough to coat bottom of pot) in a large pot on medium heat. When hot, add the sausage, breaking it up with a wooden spoon until it starts to brown, about five minutes. Add the onion, celery, carrots, first two garlic cloves, a pinch of salt, and if you like your soup spicy, a pinch of red pepper flakes. Cook with the sausage until the vegetables soften a bit, another 5 minutes. Add the lentils, bay leaves, tomatoes, water (6 cups is, conveniently, a little less than 2 empty 28-ounce cans, so you can get any tomato pulp you missed), more salt and black pepper to taste. Bring to a simmer and allow to cook until the lentils are tender, about 40 minutes. (It might be necessary to add more water if the soup gets too thick, though we preferred ours on the thick side.)", 
            "When the lentils are cooked, add the chard and cook until the leaves are tender, just a few minutes more. Discard the bay leaves. ", 
            "To finish, divide soup among bowls, then add the remaining 1/4 cup olive oil and 2 garlic cloves to a small skillet and heat over medium until the garlic softens and hisses. Drizzle this over soup bowls, and top with fresh Romano, passing more at the table. Leftovers will keep for several days in the fridge."
        ], 
        "date": "2013-01-22T11:36:49+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound small shrimp, shelled and deveined or pre-cooked and defrosted", 
            "2 firm-ripe avocados, halved, scored into a small dice", 
            "2 cups grape tomatoes, quartered or 2 cups chopped tomatoes, drained a little", 
            "1/2 small white onion, very finely chopped (use red if you can’t find white)", 
            "1 small jalapeño, seeded and finely chopped (optional)", 
            "Drizzle of olive oil", 
            "Juice of 1 to 2 limes", 
            "Salt", 
            "Handful cilantro leaves, roughly chopped", 
            "Hot sauce, on the side", 
            "Tortilla chips, to serve"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/07/9349257784_815a1814b7_o.jpg?w=750", 
        "tags": [
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Quick", 
            "Salad", 
            "Seafood", 
            "Side Dish", 
            "Summer", 
            "Tex-Mex"
        ], 
        "url": "https://smittenkitchen.com/2013/07/mama-canales-garcias-avocado-shrimp-salsa/", 
        "title": "mama canales-garcia’s avocado-shrimp salsa", 
        "directions": [
            "To cook the shrimp: Bring salted water* to a boil and turn off heat. Add shrimp, cover pot and let stand until firm and pink, about 5 to 7 minutes. Drain shrimp, pat dry and chill. ", 
            "Make salsa: Chop shrimp into small bites and put in medium bowl. Scoop avocados into bowl. Add tomatoes, white onion, jalapeño (if using, to taste) and a drizzle of olive oil. Add the juice of one lime, and a second one, if needed. Add salt to taste, then cilantro. Serve with tortilla chips.", 
            "* If you have more time, you can first make a shrimp stock with about 3 cups water, 1 cup beer or wine, the reserved shrimp shells, additional lime juice or the peels from the lime juice you’ll use in the salad and some peppercorns or red pepper flakes. Boil these together for 20 minutes, then strain the mixture. Cook the shrimp in this stock instead."
        ], 
        "date": "2013-07-23T12:01:06+00:00"
    }, 
    {
        "ingredient_list": [
            "3 1/2 to 4 1/2 pounds chicken necks, backs and wings", 
            "3 celery ribs, cut into big chunks", 
            "3 carrots, scrubbed and cut into big chunks", 
            "2 parsnips, scrubbed and cut into big chunks", 
            "2 onions, unpeeled and quartered", 
            "1 head garlic, cut horizontally in half", 
            "1 Turkish or 1/2 California bay leaf", 
            "1 tablespoon black peppercorns", 
            "1 tablespoon Kosher salt", 
            "4 quarts cold water", 
            "–and/or–", 
            "Any vegetables you have stashed in your Stock Bag (described above) ", 
            "Matzo Balls", 
            "1/2 cup matzo meal", 
            "2 eggs, lightly beaten", 
            "2 tablespoons reserved chicken fat or vegetable oil", 
            "1 teaspoon salt", 
            "1/4 teaspoon black pepper", 
            "2 tablespoons chicken stock or seltzer (which both of our mothers swear by for making the balls extra light)", 
            "For soup", 
            "2 to 3 quarts prepared chicken stock (recipe above)", 
            "1 carrot, thinly sliced", 
            "A few sprigs of dill"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/02/matzo-ball-soup.jpg?w=750", 
        "tags": [
            "Dumplings", 
            "Jewish", 
            "Passover", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/02/matzo-ball-soup/", 
        "title": "matzo ball soup", 
        "directions": [
            "Mix all matzo ball ingredients in a bowl. Cover and place in the refrigerator for 30 minutes. ", 
            "Bring 1 1/2 quarts of well-salted water to a brisk boil in a medium sized pot.", 
            "Reduce the flame. Run your hands under water so they are thoroughly wet. Form matzo balls by dropping spoonfuls of matzo ball batter approximately 1-inch in diameter into the palm of your wet hands and rolling them loosely into balls. Drop them into the simmering salt water one at a time. Cover the pot and cook them for 30 to 40 minutes.", 
            "About ten minutes before the matzo balls are ready, bring prepared chicken stock to a simmer with the sliced carrot in it. Ladle some soup and a couple matzo balls into each bowl and top with a couple snips of dill. Eat immediately. "
        ], 
        "date": "2008-02-04T16:08:59+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons olive oil", 
            "2 tablespoons butter, softened", 
            "2 pounds portobello mushrooms, in 1/4-inch slices (save the stems for another use) (you can use cremini instead, as well)", 
            "1/2 carrot, finely diced", 
            "1 small yellow onion, finely diced", 
            "2 cloves garlic, minced", 
            "1 cup full-bodied red wine", 
            "2 cups beef or vegetable broth (beef broth is traditional but vegetable to make it vegetarian; it works with either)", 
            "2 tablespoons tomato paste", 
            "1 teaspoon fresh thyme leaves (1/2 teaspoon dried)", 
            "1 1/2 tablespoons all-purpose flour", 
            "1 cup pearl onions, peeled (thawed if frozen)", 
            "Egg noodles, for serving", 
            "Sour cream and chopped chives or parsley, for garnish (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/01/mushroom-bourguignon-e1477582482731.jpg?w=625", 
        "tags": [
            "Date Night", 
            "Elsewhere", 
            "Freezer Friendly", 
            "Mushrooms", 
            "Photo", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2009/01/mushroom-bourguignon/", 
        "title": "mushroom bourguignon", 
        "directions": [
            "Heat the one tablespoon of the olive oil and one tablespoon of butter in a medium Dutch oven or heavy sauce pan over high heat. Sear the mushrooms until they begin to darken, but not yet release any liquid — about three or four minutes. Remove them from pan.", 
            "Lower the flame to medium and add the second tablespoon of olive oil. Toss the carrots, onions, thyme, a few good pinches of salt and a several grinds of black pepper into the pan and cook for 10, stirring occasionally, until the onions are lightly browned. Add the garlic and cook for just one more minute. ", 
            "Add the wine to the pot, scraping any stuck bits off the bottom, then turn the heat all the way up and reduce it by half. Stir in the tomato paste and the broth. Add back the mushrooms with any juices that have collected and once the liquid has boiled, reduce the temperature so it simmers for 20 minutes, or until mushrooms are very tender. Add the pearl onions and simmer for five minutes more.", 
            "Combine remaining butter and the flour with a fork until combined; stir it into the stew. Lower the heat and simmer for 10  more minutes. If the sauce is too thin, boil it down to reduce to the right consistency. Season to taste.", 
            "To serve, spoon the stew over a bowl of egg noodles, dollop with sour cream (optional) and sprinkle with chives or parsley."
        ], 
        "date": "2009-01-15T15:48:36+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound (8 ounces or 225 grams) pasta of you choice, such as a ziti or twisty shape", 
            "1 tablespoon (15 ml) olive oil", 
            "3/4 pounds (340 grams) fresh mushroom, sliced (I used pre-sliced cremini, my new favorite thing)", 
            "1 small-to-medium yellow onion, halved and sliced thin", 
            "Salt and freshly ground black pepper to taste", 
            "1/4 cup (60 ml) dry marsala wine (see notes at end for more information)", 
            "3 tablespoons (45 grams) unsalted butter", 
            "3 tablespoons (25 grams) all-purpose flour", 
            "1 1/2 cups (355 ml) stock or broth (chicken, vegetable or mushroom)", 
            "1/2 cup (50 grams) finely grated parmesan cheese", 
            "4 ounces (115 grams) mozzarella, cut into small cubes", 
            "3 tablespoons chopped fresh flat-leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/01/mushroom-marsala-pasta-bake1.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Date Night", 
            "Freezer Friendly", 
            "Mushrooms", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Vegetarian", 
            "Weeknight Favorite", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/01/mushroom-marsala-pasta-bake/", 
        "title": "mushroom marsala pasta bake", 
        "directions": [
            "A tip: If we play our cards right here, this can be made entirely in one dish. I used a 4-quart Staub braiser (Happy Hanukah to me!) but any 3-to-4 quart stovetop-to-oven type dish will work.", 
            "Cook the pasta: Bring a pot of well-salted water to a boil. Add pasta and cook until al dente, about 1 to 2 minutes before perfect doneness. Drain and set aside.", 
            "Heat oven: To 400 degrees.", 
            "Make the sauce: Reheat your empty pasta pot over high heat. Add oil and once it is hot, add mushrooms and cook until they’ve begun to brown and glisten, but have not yet released their liquid. Reduce heat to medium-high, add onions, salt and pepper and saute together until the liquid the mushrooms give off is evaporated. Add Marsala and cook mixture, stirring, until it has almost or fully evaporated (depending on your preference). Add butter, stir until melted. Add flour, and stir until all has been dampened and absorbed. Add stock, a very small splash at a time, stirring the whole time with a spoon. Make sure each splash has been fully mixed into the butter/flour/mushroom mixture, scraping from the bottom of the pan and all around, before adding the next splash. Repeat until all stock has been added. Let mixture simmer together for 2 minutes, stirring frequently; the sauce will thicken. Remove pan from heat.", 
            "Assemble and bake dish: If you’re cooking in an ovensafe dish, add cooked pasta and stir until combined. (If you’re not cooking in an ovensafe dish, transfer this mixture to a 2-quart baking dish.) Stir in half the parmesan, all of the mozzarella and two tablespoons of the parsley until evenly mixed. Sprinkle the top with remaining parmesan. Bake for 25 to 30 minutes, until edges of pasta are golden brown and irresistible. Sprinkle with reserved parsley and serve hot. Reheat as needed.", 
            "A bunch of notes: "
        ], 
        "date": "2015-01-12T12:03:33+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2008/11/mustard-roasted-potatoes.jpg?w=753", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2008/11/mustard-roasted-potatoes/", 
        "title": "mustard-roasted potatoes", 
        "directions": [
            "Position 1 rack in top third of oven and 1 rack in bottom third of oven and preheat to 425°F. Spray 2 large rimmed baking sheets with nonstick spray. Whisk mustard, olive oil, butter, lemon juice, garlic, oregano, lemon peel, and salt in large bowl to blend. Add potatoes; sprinkle generously with freshly ground black pepper and toss to coat. Divide potatoes between prepared baking sheets, leaving any excess mustard mixture behind in bowl. Spread potatoes in single layer. Roast potatoes 20 minutes. Reverse baking sheets and roast until potatoes are crusty outside and tender inside, turning occasionally, about 25 minutes longer. ", 
            "Transfer potatoes to serving bowl.", 
            "Do ahead: Can be made 2 hours ahead. Let stand on baking sheets at room temperature. Rewarm potatoes in 425°F oven 10 minutes."
        ], 
        "date": "2008-11-20T23:22:33+00:00"
    }, 
    {
        "ingredient_list": [
            "3/4 to 1 pound seedless cucumber, washed and chopped into chunks", 
            "2 thin or 1 regular scallions, thinly sliced", 
            "1 large avocado, pitted and diced", 
            "2 tablespoons mayonaise", 
            "Juice of half a lime, plus more to taste", 
            "Salt and hot sauce (we used Sriracha) to taste", 
            "Chopped cilantro or flat-leaf parsley to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/04/17041084926_d38d46dae0_k.jpg?w=750", 
        "tags": [
            "Avocado", 
            "Cucumber", 
            "Dairy-Free", 
            "Gluten-Free", 
            "Photo", 
            "Picnics", 
            "Salad", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/04/obsessively-good-avocado-cucumber-salad/", 
        "title": "obsessively good avocado cucumber salad", 
        "directions": [
            "Combine cucumber, scallions and avocado in a bowl. Whisk together mayo, lime and seasonings, adjusting levels to taste. Drizzle salad with dressing and garnish with cilantro or parsley. Repeat again tomorrow. "
        ], 
        "date": "2015-04-07T12:00:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1/2 pound firm tofu", 
            "1/2 cup coarsely grated carrots", 
            "1/2 cup shredded Napa cabbage", 
            "2 tablespoons finely chopped red pepper", 
            "2 tablespoons finely chopped scallions", 
            "2 teaspoons finely minced fresh ginger", 
            "1 tablespoon chopped cilantro leaves", 
            "2 minced cloves garlic (Deb addition)", 
            "1 tablespoon soy sauce", 
            "1 tablespoon hoisin sauce", 
            "2 teaspoons toasted sesame oil (I replace 1 teaspoon with hot sesame oil — delicious)", 
            "1 egg, lightly beaten", 
            "1 teaspoon kosher salt", 
            "1/4 teaspoon freshly ground black pepper", 
            "35 to 40 small wonton wrappers", 
            "1/3 cup chicken stock or water", 
            "1/4 cup soy sauce", 
            "1 tablespoon rice vinegar", 
            "1 tablespoon dark sesame oil or 1/2 tablespoon dark, 1/2 tablespoon hot sesame oil", 
            "1 small clove garlic, minced (optional)", 
            "1 (1/2-inch-thick) slice peeled fresh ginger", 
            "1/4 cup Asian sesame paste or smooth peanut butter", 
            "3 tablespoons Asian sesame oil", 
            "1/4 cup rice vinegar (not seasoned)", 
            "1 1/2 tablespoons sugar", 
            "2 tablespoons water", 
            "1 teaspoon Asian chile paste with garlic*", 
            "1/2 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/on-obsessiveness-and-ollies1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Chinese", 
            "Dumplings", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2007/02/on-obsessiveness-and-ollies/", 
        "title": "vegetable dumplings", 
        "directions": [
            "Blend all dressing ingredients in a blender until smooth. Dressing keeps, covered tightly and chilled, 1 week. "
        ], 
        "date": "2007-02-19T21:04:34+00:00"
    }, 
    {
        "ingredient_list": [
            "1 28-ounce can whole tomatoes", 
            "1 (3 to 3 1/2 pound) boneless beef chuck roast, tied with a string", 
            "1 head garlic, separated into cloves, left unpeeled"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic1.jpg?w=750", 
        "tags": [
            "Beef", 
            "Budget", 
            "Date Night", 
            "Gluten-Free", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic/", 
        "title": "oven-braised beef with tomatoes and garlic", 
        "directions": [
            "Heat oven to 300°F (150°C). Coarsely chop tomatoes with their juice in a food processor (Gourmet’s suggestion) or go at them in their can with kitchen shears (my lazy preference) to break them up. Put roast in an ovenproof 4- to 5-quart heavy pot or a casserole dish with a lid — a tight fit is just fine, as it will shrink very soon. Pour tomatoes over roast and scatter garlic around it. Season generously with salt and pepper. Braise in middle of oven, covered, until very tender, 3 to 4 hours. Cut roast into 1/4-inch-thick slices and serve with sauce, garlic, squeezed from its peels (or you can leave others to do this) and orzo (Gourmet’s suggestion, of course not gluten-free), mashed potatoes (recipe at the end) or crusty bread. Leftovers shredded over egg noodles sound wonderful as well.", 
            "Do ahead: Like almost all braises, this is even better on the second day, which means it’s a dream of a dinner party dish. Let it cool to room temperature, then chill it in the fridge until needed. Defat the sauce before warming (it will be a cinch once solidified on top) and rewarm at 300 for 30 to 45 minutes. ", 
            "Notes:"
        ], 
        "date": "2015-02-09T11:59:10+00:00"
    }, 
    {
        "ingredient_list": [
            "3 ounces (6 tablespoons) unsalted butter", 
            "8 small-medium baking potatoes (about 4 pounds), scrubbed", 
            "16 fresh flat-leaf parsley leaves", 
            "Coarse salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/parsley-leaf-potatoes1.jpg?w=640", 
        "tags": [
            "Budget", 
            "Herbs", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/11/parsley-leaf-potatoes/", 
        "title": "parsley leaf potatoes", 
        "directions": [
            "Heat oven to 450 degrees F. Place roasting pan in oven with butter; once butter has melted, just a minute or two later, remove pan from oven. Halve each potato lengthwise. Place one parsley leaf in the center of each cut half, then sprinkle cut sides generously with salt. Arrange face-down in pan with melted butter; try not to nudge them around or the leaves will move (as mine did) off-center. Roast potatoes for 35 to 45 minutes (depending on size) until tender. There’s no need to turn the potatoes over unless they get so dark underneath (this can happen with a thinner roasting pan or oven than runs hotter) that they risk overcooking before becoming fully tender; if so, just flip the potatoes for the remaining roasting time.", 
            "Serve immediately; cut sides up."
        ], 
        "date": "2013-11-22T14:14:13+00:00"
    }, 
    {
        "ingredient_list": [
            "Brine", 
            "1 1/2 cups white vinegar", 
            "1 1/2 cups water", 
            "1/3 cup granulated sugar", 
            "1/2 teaspoon celery seed", 
            "1 tablespoon plus 2 teaspoons kosher salt* plus more to taste  ", 
            "Salad", 
            "1 small head (2 pounds) green cabbage", 
            "1 red bell pepper", 
            "1 carrot (I used only 1/2 my very thick one)", 
            "1 kirby cucumber"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/pickled-cabbage-salad1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Cabbage", 
            "Gluten-Free", 
            "Photo", 
            "Pickled", 
            "Salad", 
            "Side Dish", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/11/pickled-cabbage-salad/", 
        "title": "pickled cabbage salad", 
        "directions": [
            "Mix brine ingredients in the bottom of a medium bowl and set aside. ", 
            "Prepare your vegetables: Trim and core cabbage and slice thinly with a knife, food processor slicing blade or adjustable-blade slicer. Place in a large bowl. Core, seed and thinly slice red pepper; peel and thinly slice or julienne carrot; thinly slice cucumber (I quartered mine first). Add vegetables to cabbage bowl.", 
            "By the time you’re done preparing your vegetables, the sugar and salt should in the pickling mixture should have dissolved. If not, whisk a few times until they do. Taste and adjust if you’d like it a little saltier — I added 1 more teaspoon of kosher salt in the end. ", 
            "Pour pickling brine over vegetables and cover bowl with a lid or plastic wrap. Refrigerate for 1 hour or up to 1 week. Salad becomes more pickled as it rests. Eat with everything. ", 
            "* Not all salts are weighted equally: Read more here. I used Morton brand, which for 1 tablespoon plus 2 teaspoons clocks in at 24 grams. If using table or fine sea salt, use only 4 teaspoons. "
        ], 
        "date": "2014-11-10T11:46:07+00:00"
    }, 
    {
        "ingredient_list": [
            "Pickling mixture", 
            "1 cup distilled white vinegar", 
            "4 tablespoons sugar", 
            "2 tablespoons Kosher salt", 
            "2 tablespoons yellow mustard seeds", 
            "1 cup cold water", 
            "Slaw mixture", 
            "4 to 5 cups mixed slivered or julienned* firm, raw vegetables (see above for vegetable suggestions, below for slicing tips)", 
            "Optional: Few slivers of jalapeno"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/06/pickled-vegetable-sandwich-slaw.jpg?w=750", 
        "tags": [
            "Photo", 
            "Pickled", 
            "Picnics", 
            "Salad", 
            "Sandwich", 
            "Side Dish", 
            "Summer", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/06/pickled-vegetable-sandwich-slaw/", 
        "title": "pickled vegetable sandwich slaw", 
        "directions": [
            "Heat vinegar, sugar, salt and mustard seeds to a simmer in a small, non-reactive pot over moderate heat, stirring only until sugar and salt dissolve. Stir in water, which should bring the mixture’s temperature down significantly. Let cool to lukewarm. ", 
            "Divide vegetables between jars. (I used two 3/4 liter jars.) Pour vinegar mixture over vegetables and refrigerate until needed. You’ll find the vegetables to be lightly pickled within an hour, and deliciously pickled within a day. They will get slightly more pickled as they sit, but the change shouldn’t be too dramatic from the 24 hour level.", 
            "Eat with/on sandwiches, aside grilled food and pack it along for picnics — it goes with almost anything. Then make more, because this stuff is habit-forming.", 
            "Do ahead: Mine have kept in the fridge for a month without any change in taste or appearance. Updated to add (thanks, Erika!) that you’ll want to make sure that your vegetables are submerged in the brine for them to keep this long.", 
            "* I used a mix of a sharp knife, a simple mandoline (that includes julienne blades) and a julienne peeler (the Kuhn one), which I was embarrassed to admit I bought last year until I realized how much easier it makes getting juliennes from long, thin vegetables (carrots, cucumbers, parsnips and zucchini). Don’t fret if you don’t have a fancy peeler or mandoline; you can cut thin strips with your knife, then slice them into skinny matchsticks quite easily."
        ], 
        "date": "2013-06-27T11:28:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds (680 grams) baby potatoes (I used a mix of red and yellow)", 
            "2 heaped cups (8 ounces or 225 grams) coarsely grated sharp cheddar cheese, ideally a mix of yellow and white", 
            "1/2 cup (2.75 ounces) finely chopped drained pimentos or roasted red peppers (from 1 4-ounce jar of pimentos)", 
            "1/4 cup (50 grams) mayonnaise", 
            "1 to 2 scallions, finely minced", 
            "1/4 teaspoon celery salt", 
            "Cayenne or hot sauce, to taste", 
            "Salt and freshly ground pepper", 
            "Smoked hot or sweet paprika, more cayenne, chipotle powder and/or minced chives to garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/12/pimento-cheese-potato-bites.jpg?w=750", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/12/pimento-cheese-potato-bites/", 
        "title": "pimento cheese potato bites", 
        "directions": [
            "Put potatoes in a large pot, cover them with two inches of water, set them over high heat and set your time — as soon as you turn on the flame — for 25 minutes and bring to a boil. When the timer rings, the potatoes are either done or need up to 5 minutes more. If a skewer goes in them easily, they’re done. Drain and let cool until you can pick them up. Or, you can chill them for up to 2 days, until needed.\nMeanwhile, make the pimento cheese by mixing the cheddar(s), pimentos, mayo, scallions, celery salt and cayenne or hot sauce together until evenly combined. Season to taste with salt and freshly ground black pepper. Either use this right away or keep it chilled for a week, until needed.\nCover a large baking sheet with foil and lightly coat foil with nonstick spray. Heat oven to 425 degrees.\nWhen potatoes are cool enough to handle, halve lengthwise and scoop out all but the last 1/4-inch thickness of skin and potato (essentially, you want to leave a shell inside for stability). A melon baller makes easy work of this. Arrange potatoes on prepared baking sheet. Season cavities with salt and pepper. Mash the potato centers in a bowl until smooth and mix with half (3/4 cup plus 1 tablespoon) of prepared pimento cheese. Season with more salt and pepper to taste. Use a small spoon, butter knife or small offset spatula to press/pack filling back into emptied potatoes, smoothing the tops. Nestle them in the pan tightly to discourage them from toppling and spilling their contents.\nBake 15 to 20 minutes, until melty and sizzling, then run under broiler until lightly browned on top. Let cool 5 to 10 minutes before serving, garnishing with paprika and/or chives when you do.\n"
        ], 
        "date": "2016-12-29T12:57:09+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large or 2 small yellow onions", 
            "3 pounds or about 5 large baking — Russet or Idaho — potatoes, peeled", 
            "1/3 cup potato starch*", 
            "2 teaspoons kosher salt", 
            "Lots of freshly ground black pepper", 
            "3 large eggs", 
            "5 tablespoons olive oil, schmaltz or another oil of your choice"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/23422902976_b1b17d03a6_k.jpg?w=750", 
        "tags": [
            "Breakfast", 
            "Gluten-Free", 
            "Hanukah", 
            "Jewish", 
            "Onions", 
            "Passover", 
            "Photo", 
            "Potatoes", 
            "Put An Egg On It", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2015/12/potato-kugel/", 
        "title": "potato kugel", 
        "directions": [
            "Heat oven to 350°F.", 
            "By hand: Chop onions very finely and coarsely grate potatoes.", 
            "With a food processor: Blend onions in food processor with regular blade until finely ground. Switch to grating blade and grate potatoes — I like to do this one their sides, for the longest strands.", 
            "Both methods: Place onions and potatoes in a large bowl. Sprinkle salt, pepper and starch evenly over potatoes and toss together with two forks or, as I do it, your very clean hands, evenly coating strands. Break eggs right on top and again use forks or your fingers to work them into the strands, evenly coating the mixture. ", 
            "Heat a 1/4 cup oil or fat in a 10-inch cast-iron skillet** over high heat until very hot. Pour potato-egg mixture into pan carefully (it’s going to splatter) and spread evenly in pan. I like to twist and tousle the top strands a little for a pretty final texture on top. Drizzle with last tablespoon of oil. Bake in heated oven for 75 to 80 minutes, until browned on top and tender in the middle. If top browns too quickly, before center is baked, cover with foil for all but the last two minutes of baking time, though this has never been necessary in my oven.", 
            "Serve in squares, either right from the skillet or unmolded onto a platter. Kugel reheats exceptionally well in a warm oven. It keeps in the fridge for up to 4 days, and much longer (months, even) in the freezer. I like to defrost it in the fridge before rewarming it in an oven. ", 
            "* Cornstarch works too. As does flour. Matzo meal is traditional. I like potato starch because it’s the least distracting and lightest. I buy mine from Bob’s Red Mill; usually in a section with other BRM products at just about any store these days (hooray).", 
            "** Without a cast-iron — Use a casserole baking dish. Just heat the oil first so it’s hot when the potato mixture lands in it. (You can do this in the oven, but it will take a good 5 minutes to get very hot. Might as well do it in 60 seconds on the stove.)"
        ], 
        "date": "2015-12-01T12:05:07+00:00"
    }, 
    {
        "ingredient_list": [
            "Rolls", 
            "3/4 cup plus 2 tablespoons milk", 
            "1 1/2 tablespoons granulated sugar", 
            "1 1/4 teaspoons (half a 1/4-ounce or 7-gram packet) active dry yeast", 
            "3 tablespoons unsalted butter, melted, plus extra to coat bowl", 
            "2 cups flour, either all-purpose or bread flour, or a mix thereof, plus extra for dusting", 
            "1 teaspoon fine sea or table salt", 
            "To finish", 
            "1/2 cup water", 
            "1 1/2 teaspoons baking soda or food-grade lye (see Notes below)", 
            "1 egg, beaten with 1 teaspoon water", 
            "Pretzel salt, coarse salt or sesame seeds"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/pretzel-parker-house-rolls1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Bread", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2014/11/pretzel-parker-house-rolls/", 
        "title": "pretzel parker house rolls", 
        "directions": [
            "Make dough: Warm milk and sugar together until they’re about 105 to 110°F (41 to 44°C) in the bottom of a large mixing bowl. If you don’t have a thermometer, the correct temperature is when you can dip your finger into the liquid without noticing any temperature change (i.e. not warmer or cooler than your finger). Add yeast to milk-sugar mixture and let stand for 5 to 7 minutes. It should dissolve and become slightly foamy. ", 
            "Stir in butter, then 3/4 of flour, the salt, then remaining flour. Using spoon (for manual mixing) or dough hook (of a stand mixer), mix the dough until it forms a slightly sticky dough that balls together. If making by hand, turn out onto a floured counter and knead until smooth and elastic, about 10 minutes. If using a machine, let the dough hook do the work, running it for 5 minutes on low. If, at the end of the kneading process, the dough still feels quite sticky (a little sticky is good; more tips here), add 1 more tablespoon flour.", 
            "First rise: With kneaded dough on counter, butter or oil your mixing bowl. Return dough to bowl, cover with plastic wrap and place in a draft-free warmish spot for 1 hour, or until doubled in bulk.", 
            "Second rise: Butter an 8×8-inch square or equivalent size baking pan (such as a 9-inch round cake pan or deep-dish pie plate). Flour your counter and let dough fall out onto it. I like to take advantage of the round shape left by the bowl to divide my dough into even-enough wedges, like slices of a pie. Divide into 16 pieces. Form each into a round. Arrange seam side-down in prepared pan, with an even amount of space between rolls. Cover loosely with plastic wrap and let rise for another hour. About 10 minutes before the hour is up, begin the next step to heat the oven and prep pretzel wash.", 
            "Pretzel it! Heat oven to 375°F (190°C). If using the baking soda option, bring your water to a boil and slowly stir in baking soda — it will foam up. If using the food-grade lye option, do not heat your water, just stir the lye into the water in a sink, wearing gloves (see more precautions in Notes below). ", 
            "Thoroughly brush tops and creases between rolls (as best as your brush can get in) with the lye or soda pretzel wash. Rinse brush and beat your egg with 1 teaspoon water. Brush the rolls a second time, this time with the egg wash. Sprinkle rolls with either sesame seeds or coarse salt. Use a sharp paring knife to make +-sign slashes in the top of each roll; you want to cut at least 1/2-inch down (I always make my cuts too shallow and they get lost when baked). ", 
            "Bake: Bake rolls for 20 to 25 minutes, until a lovely brown on top. Let cool in pan on rack. Salt-topped rolls are best on the first day. Sesame-topped rolls keep better, and can easily be frozen and stashed for future bread emergencies urgencies.", 
            "Notes:"
        ], 
        "date": "2014-11-13T11:46:18+00:00"
    }, 
    {
        "ingredient_list": [
            "2 to 3 tablespoons olive oil", 
            "Coarse or Kosher salt", 
            "6 medium-to-large (mine were 3 inches across, averaged 8 1/4 ounces in weight) tomatoes", 
            "Red pepper flakes, to taste", 
            "1/4 medium or 1/2 small onion, finely chopped", 
            "1 garlic clove, minced", 
            "9 tablespoons arborio or another short-grained starchy rice", 
            "Few tablespoons chopped parsley, oregano or slivered basil (or mix thereof)", 
            "Handful breadcrumbs, if using (unless using gluten-free breadcrumbs, this will of course negate the dish’s gluten-free status)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/08/rice-stuffed-tomatoes.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Gluten-Free", 
            "Grain/Rice", 
            "Italian", 
            "Photo", 
            "Summer", 
            "Tomatoes", 
            "Vegan", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2013/08/rice-stuffed-tomatoes/", 
        "title": "rice-stuffed tomatoes", 
        "directions": [
            "Heat oven to 350 degrees. Lightly coat an ovenproof baking dish with olive oil. ", 
            "Prepare tomatoes: Cut the tops off the tomatoes and scoop out tomato juices, seeds and flesh into a non-reactive (i.e. just about anything but aluminum) bowl. I like to use a grapefruit knife to make the first cuts, then a spoon to remove the rest, but you can use anything you have around, being careful not to pierce the bottom of the tomatoes. Salt the cavities of the tomatoes and turn them upside down on a plate to drain.", 
            "Prepare reserve: Run scooped-out tomato flesh and juices through a food mill or pulse in a blender until coarsely pureed. Heat a large skillet over medium heat, then add 2 tablespoons olive oil, heating it too. Once hot, add onion, garlic and red pepper flakes, cooking them together for 2 minutes, or until onion begins to soften. Add rice and cook them together for about 3 minutes, or until rice toasts a little. Add tomato puree and bring to a simmer, then reduce heat to medium-low. Season with 3/4 teaspoon salt, then cover skillet with a lid, and let simmer for 10 to 15 minutes, stirring occasionally, until rice is par-cooked. Adjust seasoning if needed.", 
            "[If using the potatoes, as mentioned in the Notes up top, prepare them while the rice simmers.]", 
            "Reassemble tomatoes: Stir fresh herbs into tomato-rice mixture. Arrange tomatoes right-side-up in baking pan then spoon mixture into tomatoes, filling them just 7/8 of the way to leave room for the rice to finish expanding. Coat with breadcrumbs that you can drizzle lightly with olive oil, if using, or you can replace the tomato lid on each (though, do not spend 10 minutes trying to match them back up, as I did last summer. It’s pointless.)", 
            "Bake: Uncovered for 30 minutes, until tomato walls are soft and the rice inside has finished cooking. Serve hot. Repeat again tomorrow."
        ], 
        "date": "2013-08-19T12:05:15+00:00"
    }, 
    {
        "ingredient_list": [
            "2 tablespoons (30 ml) olive oil, divided", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "1 large or 2 small heads of cauliflower (about 2 1/4 to 2 3/4 pounds)", 
            "2 tablespoons (30 grams) unsalted butter", 
            "1/4 cup (30 grams) hulled pumpkin seeds (sold as pepitas) (see note above)", 
            "1/2 teaspoon crushed red pepper flakes, or less to taste", 
            "Juice of half a lime (about 1 tablespoon)", 
            "Handful chopped fresh cilantro, parsley or chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/cauliflower-with-pumpkin-seeds-brown-butter-and-lime.jpg?w=750", 
        "tags": [
            "Cauliflower", 
            "Fall", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2016/11/roasted-cauliflower-with-pumpkin-seeds-brown-butter-and-lime/", 
        "title": "roasted cauliflower with pumpkin seeds, brown butter and lime", 
        "directions": [
            "Heat oven to 450°F. Coat a large rimmed baking sheet with just over 1 tablespoon of the olive oil. Sprinkle the sheet with salt and pepper. Trim cauliflower and cut into 1/2-inch slices. Arrange in a single layer on baking sheet, then drizzle with remaining scant 1 tablespoon olive oil and sprinkle with more salt and pepper. Roast for 15 to 20 minutes, until underside is deeply browned. Carefully flip pieces and roast until dark brown and crisp on second side, about 15 to 20 minutes longer.\nWhile cauliflower roasts, in a small skillet over medium heat, melt butter, then reduce heat to medium-low and add pumpkin seeds. Stirring the whole time, cook until butter becomes light brown and smells toasty, about 4 to 6 minutes. Let cool for 10 minutes, then add lime juice and season with salt, black pepper and red pepper flakes to taste.\nArrange cauliflower on a serving platter and drizzle with dressing. Serve topped with herbs."
        ], 
        "date": "2016-11-01T11:24:09+00:00"
    }, 
    {
        "ingredient_list": [
            "10 medium red and yellow onions (4 lb)", 
            "1 lb sliced bacon, cut crosswise into 1-inch-wide pieces", 
            "3 celery ribs, cut crosswise into 1/2-inch-thick slices", 
            "1 teaspoon salt", 
            "1 teaspoon black pepper", 
            "3 garlic cloves, minced", 
            "15 oz baby spinach, trimmed and coarsely chopped (14 cups)", 
            "1 (9-inch) round loaf country-style bread (1 1/4 lb), cut into 1/2-inch cubes (10 cups), lightly toasted", 
            "2 cups salted roasted cashews (10 oz), coarsely chopped", 
            "1 stick (1/2cup) unsalted butter, melted", 
            "1 1/4 cups turkey giblet stock"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-stuffed-onions1.jpg?w=500", 
        "tags": [
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2007/11/roasted-stuffed-onions/", 
        "title": "roasted stuffed onions", 
        "directions": [
            "Make onion shells: Cut a 1/2-inch-thick slice from tops of onions, discarding tops, and trim just enough from bottoms for onions to stand upright. Scoop out all but outer 2 or 3 layers from each using a small ice cream scoop or spoon (don’t worry if you make a hole in the bottom), reserving scooped-out onion and onion shells separately. ", 
            "Make stuffing: Coarsely chop enough scooped-out onion to measure 3 cups. ", 
            "Cook bacon in 2 batches in a 12-inch heavy skillet over moderate heat, stirring, until crisp, about 10 minutes, then transfer with a slotted spoon to paper towels to drain, reserving about 1/3 cup fat in skillet. ", 
            "Add chopped onion, celery, salt, and pepper to skillet and sautÃƒÂ© over moderately high heat, stirring, until vegetables are softened, about 5 minutes. Add garlic and sautÃƒÂ©, stirring, 1 minute. Transfer mixture to a large bowl and stir in spinach, bread, cashews, butter, 1 cup stock, and bacon, then cool completely. ", 
            "Roast onions: Preheat oven to 425Â°F. Arrange onion shells, open sides up, in a 13- by 9- by 2-inch baking pan, then add 1/2cup water and cover pan tightly with foil. Roast onions in middle of oven until tender but not falling apart, 25 to 30 minutes. ", 
            "Stuff and bake onions: Reduce oven temperature to 350Â°F. Transfer shells to a work surface and pour off water in pan. Fill shells with stuffing, mounding it, and return to pan. Reserve 5 to 7 cups stuffing for turkey cavity, then put remaining stuffing in a buttered shallow 3 1/2-quart baking dish and drizzle with remaining 1/4 cup stock. ", 
            "Bake stuffed onions and stuffing in dish in middle of oven, uncovered, until heated through, about 25 minutes. "
        ], 
        "date": "2007-11-05T00:43:26+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound cipollini onions", 
            "1 pound small Roma or large cherry tomatoes", 
            "1/4 cup olive oil", 
            "Coarse salt", 
            "4 slices of country or ciabatta bread, one-inch thick", 
            "1 15-ounce can of white beans, drained and rinsed or 1 1/2 cups cooked beans of your choice", 
            "Garlic clove (optional)", 
            "Few fresh basil leaves, slivered"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/roasted-tomatoes-and-cipollini1.jpg?w=500", 
        "tags": [
            "Herbs", 
            "Onions", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/09/roasted-tomatoes-and-cipollini/", 
        "title": "roasted tomatoes and cipollini", 
        "directions": [
            "Preheat oven to 375°F. Boil a small pot of water and blanche the cipollini for 10 seconds, then plunging them into cold water. Use a paring knife to make a small slit in each, and slide them out of their skins and outer layer.", 
            "Spread peeled onions and tomatoes in a roasting pan. Drizzle with olive oil and a few good pinches of coarse salt. Toss everything together until well-coated and roast in preheated oven for about 45 minutes, reaching in every 15 minutes with a spatula to roll the tomatoes and onions around to ensure all sides get blistered.", 
            "Just before you take the tomatoes and onions out, place your bread slices on the oven rack (or a tray, if you’re more refined than us) and let them toast lightly. You can rub the toasts with a halved garlic clove, if you like, while still hot. Use tongs to arrange toasts in one layer on a serving platter. Dump the white beans over the bread, and using a pot holder, scrape the entire contents of the tomato-and-onion roasting pan, still hot, over the white beans. Do not skimp on the juices that have collected, all of them — don’t leave any in the pan. They could make a religious person out of you.", 
            "Sprinkle the dish with the basil and eat at once. "
        ], 
        "date": "2009-09-09T12:02:01+00:00"
    }, 
    {
        "ingredient_list": [
            "Romesco Sauce", 
            "5 ancho chiles*", 
            "2 tablespoons raw almonds", 
            "2 tablespoons blanched hazelnuts (or, you can rub their skins off once they are toasted and cooled)", 
            "1 1/4 cups extra-virgin olive oil", 
            "1 slice country bread, about 1-inch thick", 
            "1/3 cup canned San Marzano tomatoes (I bought whole tomatoes, not sure why; I’d use purée next time)", 
            "1 clove garlic, chopped", 
            "1 tablespoon chopped flat-leaf parsley", 
            "1/2 lemon, for juicing", 
            "A splash of sherry vinegar (can’t find it? Use a mild wine or balsamic vinegar instead)", 
            "Kosher salt", 
            "Potatoes", 
            "1 1/2 pounds Yukon Gold potatoes (full size or minis work)", 
            "1/4 cup extra virgin olive oil", 
            "4 to 5 cloves garlic, unpeeled", 
            "2 bay leaves", 
            "6 springs thyme, plus 2 teaspoons thyme leaves (I left this out, accidentally; it was fine without it)", 
            "1 cup Romesco sauce (from above)", 
            "2 tablespoons chopped flat-leaf parsley", 
            "Kosher salt and freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/romesco-potatoes1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Spanish", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/03/romesco-potatoes/", 
        "title": "romesco potatoes", 
        "directions": [
            "Make the sauce: Preheat the oven to 375°F. Remove and discard the seeds and stems from the chiles, then soak them in warm water for 15 minutes to soften. Strain the chiles, and pat dry with paper towels. Meanwhile, spread the nuts on a baking sheet and toast for 8 to 10 minutes, until they smell nutty and are golden brown.", 
            "Heat a large sauté pan over high heat for 2 minutes. Add 2 tablespoon olive oil, wait a moment (for it to heat) and fry the slice of bread on both sides until golden brown. Remove the bread from the pan and cool. Cut it into 1-inch cubes and set aside.", 
            "Return the pan to the stove over high heat. Add 2 tablespoon olive oil and the chiles and sauté for a minute or two. Add the tomatoes. Season with 1/2 teaspoon salt and cook for 2 to 3 minutes, stirring often until the tomato juices have evaporated.  Turn off the heat and leave the mixture in the pan. ", 
            "In a food processor, pulse together the toasted nuts, garlic and fried bread until the bread and nuts are coarsely ground. Add the chile-tomato mixture and process for 1 minute more. With the machine running, slowly pour in the remaining 1 cup of olive oil and process until you have a smooth purée. Don’t worry, the romesco will “break” (separate into solids and oil); this is normal. Add the parsley, season to taste with lemon juice, sherry vinegar and more salt, if you feel it needs it. ", 
            "Make the potatoes: Place the potatoes in a roasting pan (I used my 12-inch cast iron skillet, which turned out to be a brilliant idea as I could transfer it to the stove and continue cooking there — highly recommended if you have one) and toss well with 2 tablespoons olive oil, garlic cloves, bay leaves, thyme sprigs and a heaping teaspoon of salt. Cover tightly with aluminum foil and roast the potatoes until tender when pierced (this took 30 minutes for my tiny ones, larger ones may need 50). Discard the bay and thyme and squeeze the garlic out of its skin and set aside.", 
            "Either transfer potatoes to a large sauté pan or transfer cast iron skillet to stove-top and heat on high for 2 minutes. Pour in the remaining 2 tablespoons oil (you can get away with 1 tablespoon if you are using the same cast-iron you roasted the potatoes in and it is well seasoned) turn the heat to medium-high and wait 1 minute more. Add the potatoes and smash them with your spatula or a fork until a little broken up. Season with thyme leaves, salt and pepper and sauté them for 6 to 8 minutes until they are crispy on one side. (If they are stuck to the pan, don’t try to move them, they will eventually release themselves). After they’ve browned nicely on the first side, turn them until they color on all sides. Spoon the romesco sauce and reserved garlic over the potatoes and stir.  Toss in the parsley. Adjust seasoning if necessary.", 
            "Do ahead: Sauce can be made up to 2 weeks in advance and kept in the fridge. Use the extra on sandwiches, with cheese, eggs, grilled fish and roasted meats. One the dish is assembled, if you’re not ready to serve it yet, turn off the heat and leave the potatoes in the pan; just before serving reheat for a few minutes and add the parsley at the last minute.", 
            "* Guys, I’m chile clueless. It’s pathetic. Kitchen Market — stocking everything, knowing all — once helped me hide this fact from the public, but in their absence, left to fend for myself, I was only able to find something called New Mexico Red Chiles and you don’t want to know how long (very) I spent trying to figure out whether they were hotter or less hot or bigger or smaller than the chiles I was supposed to use. I ended up using 3 instead of 5, and regretting it as the sauce could have had 5 without being more than just moderately hot. "
        ], 
        "date": "2010-03-22T11:00:12+00:00"
    }, 
    {
        "ingredient_list": [
            "Olive oil", 
            "1 large onion, sliced (1 1/2 cups)", 
            "2 cups (1/4-inch-sliced) fennel, top and core, if thick, removed", 
            "3 cloves garlic, minced (1 tablespoon)", 
            "1 pound sweet potatoes, peeled and sliced 1/4-inch thick", 
            "1 pound celery root, peeled and sliced 1/4-inch thick", 
            "1 pound yukon gold, peeled and sliced 1/4-inch thick", 
            "1 cup heavy cream (see Note up top)", 
            "2 cups chicken or vegetable stock or brother", 
            "2 cups grated gruyere cheese (6 ounces with rind)", 
            "2 teaspoons minced fresh thyme leaves", 
            "Kosher salt and freshly ground black pepper", 
            "2 1/2 cups coarse fresh breadcrumbs or panko (what I used)", 
            "2 to 3 tablespoons melted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/11/root-vegetable-gratin.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Fennel", 
            "Freezer Friendly", 
            "Onions", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/11/root-vegetable-gratin/", 
        "title": "root vegetable gratin", 
        "directions": [
            "Heat your oven to 350°F. Butter a 13×9-inch deep baking dish.\nHeat 2 tablespoons olive oil in a large deep (ideally 12-inch) saute pan over medium heat and add the onions and fennel. Cooking, tossing occasionally, until lightly browned and tender, about 10 minutes. Add the garlic and cook for one minute more.\nMeanwhile, in the largest bowl you own, combine the onion mixture with remaining vegetables, cream, stock, cheese, thyme, 1 tablespoon kosher salt and 1 1/2 teaspoons black pepper. Pour mixture into prepared dish and spread until even. Mix breadcrumbs and butter until evenly coated and distribute evenly over top of dish.\nBake 1 1/2 hours uncovered, or until vegetables are very tender when tested with a small knife and the top is browned and bubbly. Allow to set for 15 minutes at room temperature and serve hot."
        ], 
        "date": "2016-11-10T13:09:08+00:00"
    }, 
    {
        "ingredient_list": [
            "1 tablespoon butter", 
            "1 tablespoon olive oil", 
            "1/2 cup thinly sliced shallots", 
            "12 ounces sugar snap peas, trimmed, strings removed", 
            "2 cups thinly sliced radishes (about 1 large bunch)", 
            "1/4 cup orange juice", 
            "1 teaspoon dill seeds", 
            "1 tablespoon chopped fresh dill"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sauteed-radishes-and-sugar-snaps-with-dill1.jpg?w=500", 
        "tags": [
            "Peas", 
            "Photo", 
            "Radishes", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2008/07/sauteed-radishes-and-sugar-snaps-with-dill/", 
        "title": "sauteed radishes and sugar snaps with dill", 
        "directions": [
            "Melt butter with oil in large nonstick skillet over medium heat. Add shallots and sauté until golden, about 5 minutes. Add sugar snap peas, cook for one to two minutes, and radishes sauteing until crisp-tender, about 3 to 4 minutes more. Add orange juice and dill seeds; stir 1 minute. Season with salt and pepper. Stir in chopped dill. Transfer to bowl; serve."
        ], 
        "date": "2008-07-21T09:06:01+00:00"
    }, 
    {
        "ingredient_list": [
            "2/3 cup water", 
            "1 tablespoon butter", 
            "1/2 teaspoon salt", 
            "1/2 cup semolina", 
            "1 tablespoon Parmesan cheese", 
            "1 egg, lightly beaten", 
            "1 tablespoon chopped parsley or chives (optional)", 
            "1 carrot, peeled, cut into short, fat matchsticks", 
            "1 parsnip, peeled, cut the same as the carrot", 
            "Few tablespoons snipped chives"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/semolina-dumpling-soup1.jpg?w=500", 
        "tags": [
            "Dumplings", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2008/05/semolina-dumpling-soup/", 
        "title": "semolina dumpling soup", 
        "directions": [
            "Once your stock is ready, add the carrots and parnsips and simmer them until they’re almost cooked, about five minutes. You can make the dumplings while you wait. Once everything is cooked, garnish (or forget to, in our case) and serve quickly."
        ], 
        "date": "2008-05-21T15:49:19+00:00"
    }, 
    {
        "ingredient_list": [
            "3 tablespoons butter, cut into pieces, plus an additional pat for buttering gratin dish", 
            "4 large yellow potatoes* (about 1 1/2 pounds), peeled", 
            "Salt and freshly ground black pepper", 
            "1 cup milk, half-and-half or cream (if using something richer than milk, you can skip the butter)", 
            "2 ounces cheese, grated or crumbled (Parmesan or Gruyere are the classics, but that doesn’t mean that goat cheese, blue cheese or any of your favorites won’t work as well) [optional]"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/simple-potato-gratin1.jpg?w=500", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/04/simple-potato-gratin/", 
        "title": "simple potato gratin", 
        "directions": [
            "Preheat the oven to 350°F and grease a 9- by 12-inch gratin dish with the pat of butter. Slice the potatoes as thinly as you can (a mandoline works great for this) and arrange them in a layer, overlapping the edges slightly like shingles. Sprinkle the potatoes with salt and freshly ground pepper and don’t be stingy — this is where the bulk of your flavor comes from and a third of the cheese before before repeating this process with your remaining potato slices. (If you are using a sauteed vegetable filling, this is where you’d want to add half of it.) Depending on how thinly sliced your potatoes are, you should end up with approximately three layers, with a third of the cheese between each layer. Reserve the last third of your cheese for later.", 
            "Carefully pour the milk over the potatoes. It should come up to the bottom of the top layer of potatoes; add more if this was not enough. Dot the top of the gratin with the three tablespoons of butter and bake it for about an hour. Halfway through the baking time, take the gratin dish out of the oven and gental press the potatoes flat with a spatula to keep the top moist. Sprinkle the remaining cheese on top of the gratin for the last 15 minutes of baking. The gratin is done when the potatoes are soft and the top is golden brown.", 
            "More gratin ideas: Use duck fat instead of butter. Swap celery root, parsnips or turnip slices for half the potatoes. Add chopped herbs such as parsley, thyme, chives or chervil between the layers. Sauté mushrooms, sorrel, spinach or leeks, with or without a finely-chopped shallot, and layer them between the potato slices.", 
            "* Yukon Golds and other waxy, yellow-fleshed potatoes work best in gratins, keeping their texture without getting floury and falling apart as Russets do."
        ], 
        "date": "2009-04-13T17:52:30+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound skirt steak, trimmed of excess fat if necessary, halved crosswise, at room temperature", 
            "1 to 2 tablespoons olive oil", 
            "1 pint (2 cups) cherry tomatoes, halved", 
            "1/2 cup (about 4 ounces) crumbled blue cheese", 
            "1/2 pound baby arugula", 
            "Vinaigrette (below)", 
            "3 tablespoons minced chives, 2 thinly sliced scallions or 3 tablespoons finely chopped red onion, for garnish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/09/skirt-steak-salad-with-blue-cheese.jpg?w=749", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Salad", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/09/skirt-steak-salad-with-arugula-and-blue-cheese/", 
        "title": "skirt steak salad with blue cheese", 
        "directions": [
            "Whisk ingredients. Season with salt and pepper and adjust ingredients to taste (usually more Dijon and vinegar for me)."
        ], 
        "date": "2010-09-17T13:41:24+00:00"
    }, 
    {
        "ingredient_list": [
            "24 ladyfingers (savioardi) cookies (storebought or from recipe below)", 
            "3 large eggs, separated", 
            "1/3 cup (65 grams) plus 1 tablespoon (13 grams) granulated sugar, divided", 
            "1 8.8-ounce (250 ml) package mascarpone", 
            "1/3 cup (80 ml) sweet or dry marsala", 
            "1 cup (235 ml) strong, warm espresso coffee", 
            "A couple tablespoons of your favorite cocoa powder, for sifting over"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2017/02/small-batch-tiramisu.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Italian", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2017/02/small-batch-tiramisu/", 
        "title": "small batch tiramisu", 
        "directions": [
            "In a medium bowl, beat egg whites until stiff.", 
            "In a larger bowl, using same beaters, beat egg yolks and 1/3 cup sugar until thick and pale yellow, 3 to 4 minutes. Beat in mascarpone cheese until combined, and continue beating another minute for extra fluff. Beat in marsala until smooth. Gently fold in egg whites until combined, trying not to deflate the mixture. It will be a loose, soft, creamy custard.", 
            "In a small bowl wide enough to dip cookies into, combine the espresso and 1 tablespoon sugar. Set aside.\nTo assemble small cups: Dip first cookie in espresso mixture until almost fully saturated but not falling apart. Break in half and place the first half in the bottom of your cup. Spoon 1 generous (I use a measuring spoon, but heaped a little) tablespoon cream over it. Repeat with second half of first biscuit and another spoonful of cream. Dust with cocoa powder. Dip second cookie in coffee and break in half. Place side-by-side over cocoa then top with 2 generous tablespoons cream mixture, which should take you nearly to the top of the cup. Dust with more cocoa. Repeat with remaining cups.\nTo assemble large cups: Dip first cookie in espresso mixture until almost fully saturated but not falling apart. Break in half and place side-by-side in the bottom of your larger cup. Spoon 2 generous tablespoons (I use a measuring spoon, but heaped a little) cream over and dust with cocoa powder. Dip two biscuits in espresso mixture and break in half. Place 3 of the halves on top of the cocoa powder, cover with another 2 generous tablespoons of cream and cocoa powder. Dip a 4th biscuit in the espresso mixture, break it in half, and place these two halves plus the leftover half from the previous layer on top of the cocoa. Dollop more cream over and repeat with remaining cups.\nIf you can bear it, let cups chill in fridge overnight to set. Before eating, you can dust them with fresh cocoa powder for a prettier look.", 
            ""
        ], 
        "date": "2017-02-13T13:02:17+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups (250 grams) all-purpose flour", 
            "7 large eggs", 
            "1/4 cup (59 ml) milk"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaetzle1.jpg?w=500", 
        "tags": [
            "Pasta", 
            "Photo", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2011/03/spaetzle/", 
        "title": "spaetzle", 
        "directions": [
            "Combine the flour, eggs and milk in a large bowl. Cover with plastic wrap and refrigerate for 1 hour, or overnight.*", 
            "Prepare an ice bath. Bring a large pot of well salted water to boil. If you’ve got a spaetzle maker, use it. Otherwise, do not fret! Set a large colander with holes anywhere from 1/4 to 1/2-inch wide over the pot. Put on two potholders because you probably already know that steam is hot; I apparently did not. Pour 1/4 of the batter into the colander and press it through the holes with a flexible spatula. Boil for 2 to 3 minutes then use a slotted spoon to fish spaetzle out and drop it in the ice bath. Continue with remaining batter in 3 batches. I found it was important to use only a little batter at a time (and even less if your pot is smaller) because if you push too much batter in at a time, it becomes one freakish megaspaetzle as opposed to hundreds of tiny twisty ones. ", 
            "When you’re done with the batter, drain the spaetzle well and toss it with a small amount of olive oil to keep it from sticking. You can use it right away, or keep it in the fridge for a day until needed.", 
            "* The other spaetzle recipe I auditioned did not call for the resting time and worked just fine. I didn’t test this version without resting it in the fridge first for an hour, but suspect that you could get away with it if you were pinched for time. That said, the batter was really lovely — smoother, stretchier — after an hour, so if you can use that hour to prepare a salad or other parts of your meal, you should.", 
            "Pan-Browned Spaetzle with Shallots and Herbs", 
            "Heat a large skillet over medium-high. Heat 1 tablespoon unsalted butter. Once it is fully melted and beginning to turn golden add a couple cups of drained, cooled spaetzle and let it heat for a minute in the pan before starting to saute it about. Season with salt and freshly ground pepper and continue to cook it until each piece has a couple toasty brown edges. Add 1 tablespoon minced shallot and cook for one minute more. Adjust seasonings to taste and, off the heat, toss with 1 tablespoon minced herbs (I used parsley and dill but others, like tarragon or chives, would work well.) Eat immediately."
        ], 
        "date": "2011-03-30T10:15:12+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup olive oil", 
            "1 pound dried spaghetti", 
            "2 tablespoons butter", 
            "4 ounces Pecorino Romano cheese, finely grated", 
            "1 1/2 teaspoon finely ground black pepper", 
            "Salt (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaghetti-cacio-e-pepe1.jpg?w=500", 
        "tags": [
            "Date Night", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Quick", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/02/spaghetti-cacio-e-pepe/", 
        "title": "spaghetti with cheese + black pepper", 
        "directions": [
            "Cook spaghetti in well-salted water to your al dente tastes in a large, wide-bottomed pot. (You’ll have fewer dishes to wash if you use this pot to assemble the dish as well.) Drain spaghetti, reserving 1 1/2 cups of pasta cooking water.", 
            "Dry out your pot, then heat the olive oil over high heat until almost smoking. Add drained spaghetti and 1 cup of reserved pasta water and jump back, this will splatter mightily, also known as “I made this three times, and never once learned my lesson. Do as I say, not as I do.”", 
            "Add butter, 3 ounces cheese and ground pepper and toss together with tongs. Taste, adding more pasta water, cheese, pepper or salt (which should not be neccessary, as Romano is very salty) to taste.", 
            "Serve immediately, sprinkling with reserved cheese and an extra grind or two of black pepper."
        ], 
        "date": "2010-02-12T11:09:01+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound spaghetti or linguine", 
            "Salt", 
            "3 lemons", 
            "1/4 cup extra virgin olive oil , plus additional for serving", 
            "1/4 cup heavy cream", 
            "1 ounce finely grated Parmesan cheese (about 1/2 cup), plus additional for serving", 
            "Ground black pepper", 
            "Small handful fresh basil or arugula (what I used, deliciously, in a pinch) leaves, shredded"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spaghetti-with-lemon-and-olive-oil-al-limone1.jpg?w=500", 
        "tags": [
            "Citrus", 
            "Date Night", 
            "Italian", 
            "Lemon", 
            "Pasta", 
            "Photo", 
            "Travel", 
            "Vegetarian", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2011/02/spaghetti-with-lemon-and-olive-oil-al-limone/", 
        "title": "spaghetti with lemon and olive oil", 
        "directions": [
            "Cook linguine or spaghetti in well-salted water to your al dente tastes in a large, wide-bottomed pot. (You’ll have fewer dishes to wash if you use this pot to assemble the dish as well.) ", 
            "While pasta is cooking, zest lemons until you have a little shy of a tablespoon of zest. Juice lemons — you’ll have anywhere from 1/3 to 1/2 cup lemon juice.  ", 
            "Drain pasta, reserving 1 1/2 cups of pasta cooking water. Dry out your pot, then boil the olive oil, cream, zest and 1 cup of the reserved pasta water together for two minutes over high heat.  Return pasta to pot and stir until coated. Add the cheese and 1/4 cup lemon juice and toss, toss, toss everything together. Add more pasta water, 1/4 cup at a time, if you’d like your dish a little looser. Quickly taste a strand of pasta and see if you want to add the remaining lemon juice (we did). Stir in basil or arugula and season generously with salt and pepper. ", 
            "Serve immediately, drizzling individual portions with a bit of extra olive oil and sprinkling with extra Parmesan cheese."
        ], 
        "date": "2011-02-24T12:00:55+00:00"
    }, 
    {
        "ingredient_list": [
            "Potstickers", 
            "3 to 3 1/4 cups chopped spring vegetables (such as asparagus, favas, peas, lima beans or more) (I used 2 1/4 cups chopped asparagus from 12 ounces stalks plus 1 cup cooked favas from about 1 pound fresh in their pods)", 
            "1 tablespoon neutral cooking oil, such as safflower, canola or peanut", 
            "3/4 cup thinly sliced scallions (from about 3/4 of a bundle, about 3 ounces)", 
            "1 tablespoon minced ginger", 
            "1 clove garlic, peeled minced (if using garlic chives, omit)", 
            "1 cup (about 6 ounces) firm tofu, chopped small (see Note up top for alternative)", 
            "1/2 cup garlic or regular chives", 
            "1 teaspoon toasted sesame oil", 
            "1/4 teaspoon kosher salt, or more to taste", 
            "To assemble", 
            "1 tablespoon cornstarch", 
            "1/2 cup water", 
            "50 round dumpling wrappers (most packages contain 50)", 
            "Scallion dipping sauce", 
            "2 to 3 scallions (or, remainder of bundle used for potstickers), thinly sliced (use some in sauce, some for garnish)", 
            "1/4 cup rice vinegar", 
            "1/4 cup soy sauce", 
            "1 tablespoon regular or spicy toasted sesame oil ", 
            "To cook", 
            "1 to 2 tablespoons neutral cooking oil", 
            "1/4 to 1/2 cup water"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/spring-vegetables-potstickers.jpg?w=750", 
        "tags": [
            "Asparagus", 
            "Dumplings", 
            "Peas", 
            "Photo", 
            "Spring", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2013/05/spring-vegetable-potstickers/", 
        "title": "spring vegetable potstickers", 
        "directions": [
            "Prepare vegetables: If using asparagus, cut off tough ends and sliced stalks into 1/2-inch segments. If using fava, remove them from their pods. Boil favas for 3 minutes, then drain, and press them out of their opaque skins (if difficult, first make a small slit on one end with a paring knife). To prepare peas, simply remove them from their pods. To prepare lima beans, remove them from their pods and simmer them for about 5 minutes to soften.  ", 
            "Make filling: Heat a wok or large saute pan over medium heat. Add a tablespoon of oil and heat, then add scallions, ginger and garlic, if using. Cook for one minute, then add vegetables in the order of the time they need to cook until crisp-tender. Asparagus will need about 4 minutes, peas about 2 to 3, and favas and limas will already be tender, so just a minute to warm them. Add tofu and chives and cook just until chives wilt, about 1 minute more. Season with salt and transfer to a fine-mesh colander, to drain off any excess liquid. Let cool in colander for 15 minutes. ", 
            "If mixture is still on the chunky side, either chop it finely on a cutting board or pulse it a few times in a food processor. You don’t want to puree it; bits of vegetable should still be recognizable, but it will be easier to mound in dumplings if chopped well. Adjust seasonings if needed and mix with sesame oil.", 
            "Assemble potstickers: Line two baking sheets with parchment paper or very lightly oil them. Mix cornstarch and water in a small bowl; this will act as your “glue.” Most dumpling wrappers come dusted with a little starch, so you’ll be okay if you want to skip the cornstarch, but I always feel safer having a little extra as an insurance plan.", 
            "Remove first wrapper from package and put it on a plate; place a damp towel or piece of plastic wrap over the unused ones to keep them from drying out. Brush wrapper with cornstarch-water mixture. Mound 1 to 2 teaspoons filling in the center. Fold the wrapper in half over the filling, sealing the center edge shut. Make a few small pleats down each sides to seal in the rest of the filling, while trying to press out as much air as possible (a process that looks difficult but is so easy, I think you’ll find it intuitive — use the photos in the post as guidance). Rest the dumpling, pleats up, on prepared tray and repeat with remaining wrappers and filling. When you’re all done, look over your potstickers; use the cornstarch mixture and pinching to seal any open sides or loosened pleats.", 
            "You can now freeze the dumplings on their trays, then transfer them to a freezer bag once they will no longer stick together, or cook them right away.", 
            "Make dipping sauce: Mix ingredients and adjust levels to taste. For a sweeter sauce, add a 1/2 teaspoon honey or brown sugar.", 
            "Cook potstickers: Heat a large skillet (I really like to use a nonstick here) over medium-high heat. Once hot, add the oil and heat this too. Once the oil is hot, arrange potstickers in a single layer and cook until browned at the bottom. This will take about 1 minute for fresh ones and up to 5 minutes for frozen ones. Add water; it will hiss and sputter, so move quickly. You’ll want the smaller amount of water for a smaller batch and the larger if you’re cooking more. Put a lid on the pot and cook dumplings for 2 to 3 minutes more (plus an additional minute if your dumplings were frozen to begin with). Remove lid and simmer until any remaining water has cooked off. ", 
            "Transfer to serving plate; garnish with scallion greens. Serve with dipping sauce."
        ], 
        "date": "2013-05-01T11:21:44+00:00"
    }, 
    {
        "ingredient_list": [
            "1 (12-ounce) 1-inch thick New York strip boneless beef top loin steak", 
            "Kosher salt", 
            "Freshly ground black pepper", 
            "Olive oil", 
            "2 yellow onions, sliced in rings", 
            "1/2 teaspoon fresh thyme leaves", 
            "Mustard Mayo, recipe follows", 
            "2 mini focaccia buns, sliced in 1/2 (we used a small ciabatta)", 
            "1/2 cup baby arugula", 
            "1/3 cup good mayonnaise", 
            "2 tablespoons Dijon mustard", 
            "1 tablespoon whole-grain mustard", 
            "2 tablespoons sour cream", 
            "1/8 teaspoon kosher salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/steak-sandwiches1.jpg?w=500", 
        "tags": [
            "Date Night", 
            "Meat", 
            "Photo", 
            "Picnics", 
            "Sandwich"
        ], 
        "url": "https://smittenkitchen.com/2009/02/steak-sandwiches/", 
        "title": "steak sandwiches", 
        "directions": [
            "Whisk the ingredients together in a small bowl. Serve at room temperature."
        ], 
        "date": "2009-02-28T17:00:14+00:00"
    }, 
    {
        "ingredient_list": [
            "Gratin", 
            "2 pounds summer squash", 
            "Salt", 
            "1 1/2 cup fresh breadcrumbs", 
            "3 tablespoons unsalted butter", 
            "3/4 cup thinly sliced shallots (from 4 to 5 medium)", 
            "1 cup grated gruyere cheese", 
            "1/4 cup salsa verde (below)", 
            "Freshly ground black pepper", 
            "Salsa verde", 
            "1 tablespoon thyme leaves", 
            "1 teaspoon marjoram or oregano leaves (or half, if dried)", 
            "1/4 cup coarsely chopped mint leaves", 
            "1 cup coarsely chopped flat-leaf parsley", 
            "2 small cloves garlic", 
            "1 salt-packed anchovy, rinsed and bones removed", 
            "1 tablespoon capers, drained (and rinsed, too, if salt-packed)", 
            "1/2 cup olive oil", 
            "1/2 lemon, or more to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/11/summer-squash-gratin-with-salsa-verde1.jpg?w=640", 
        "tags": [
            "Casserole", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Summer Squash", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2014/07/summer-squash-gratin-with-salsa-verde/", 
        "title": "summer squash gratin with salsa verde", 
        "directions": [
            "Heat your oven to 400°F. Cut the squash into thin (1/8-inch thick) coins. Toss with 1 teaspoon kosher salt and set aside for at least 10 minutes. Drain zucchini in a colander, and if you have time, spread them on a towel for a few minutes to further wick away moisture before placing it in a large mixing bowl.", 
            "Meanwhile, place breadcrumbs in a small bowl. In a small skillet or saucepan, melt butter and keep cooking it over medium heat until it browns and smells nutty. Carefully pour (in a small drizzle at first) over breadcrumbs and be sure to scrape out any brown bits from the pot. Toss crumbs to evenly coat.", 
            "Make the salsa verde by blending the herbs in a food processor or blender with garlic, anchovy and capers until it forms a paste, scraping down as needed. With the machine running, stream in the olive oil in a drizzle. Season with salt and black pepper. Add lemon juice to taste.", 
            "Add shallots, gruyere, half the breadcrumbs, 1/4 cup salsa verde (about half; you can use the rest to dress eggs or any roasted meat) and some freshly ground black pepper to the bowl with the summer squash and toss. Transfer to a 9×9-inch (or equivalent; I used a 9-inch round cast-iron skillet) baking dish. Scatter remaining breadcrumbs over the top and bake 35 to 40 minutes, until the squash is tender and the crumbs are crisp."
        ], 
        "date": "2014-07-22T12:23:55+00:00"
    }, 
    {
        "ingredient_list": [
            "1 ounce dried mushrooms (porcini, morels, or shitakes)", 
            "1/2 cup olive oil", 
            "2 sprigs of rosemary", 
            "4 sprigs of sage", 
            "1 large yellow onion, peeled and thinly sliced", 
            "3 garlic cloves, peeled and thinly sliced", 
            "1 1/2 teaspoons salt", 
            "1/4 tsp freshly ground white pepper", 
            "1 pound white button mushrooms, cleaned and thinly sliced", 
            "1 pound shitake mushrooms stemmed, cleaned and thinly sliced", 
            "6 cups chicken stock or water", 
            "1 cup heavy cream", 
            "2 tablespoons unsalted butter"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/01/balthazars-cream-of-mushroom-soup.jpg?w=750", 
        "tags": [
            "Date Night", 
            "Gluten-Free", 
            "Mushrooms", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2007/01/superlatively-souper/", 
        "title": "balthazar’s cream of mushroom soup", 
        "directions": [
            "1.\tSoak the dry mushrooms in 1 cup of warm water for 20 to 30 minutes, until plump.", 
            "2.\tStrain the soaking liquid through a coffee filter to remove grit and reserve, along with the reconstituted mushrooms, until needed.", 
            "3.\tHeat the olive oil in a large pot over a medium flame. Bundle the rosemary and sage together and tie with kitchen twine.  When the oil is hot, add the herb bundle and sizzle for a few minutes on both sides to infuse the oil.", 
            "4.\tAdd the onion, garlic, salt and pepper and cook for 5 minutes, until the onion is soft and translucent but not brown.", 
            "5.\tTurn the flame to high and add the white mushrooms and shitakes.", 
            "6.\tCook for 10 minutes, during which the mushrooms will give off their liquid (which should evaporate quickly due to the high heat) and deflate significantly. Stir occasionally.", 
            "7.\tAdd the chicken stock and the dried mushrooms along with the soaking water.", 
            "8.\tSimmer for 30 minutes. Remove the herbs, then add the cream and butter. Working in batches, puree the soup in a blender until smooth. Return to the pot and keep at a very low simmer until ready to serve.", 
            "Deb adjustments: I used far less olive oil, replaced some of the chicken stock with beef, as I had it on hand and love mixing that flavor with mushrooms; half as much cream, preferring a more potent soup and thyme instead of rosemary, also due to personal preference."
        ], 
        "date": "2007-01-04T14:38:10+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup cornmeal", 
            "2 3/4 cups whole milk", 
            "4 tablespoons unsalted butter, plus additional for greasing dish", 
            "2 cups corn kernels (from 3 to 4 ears of corn, or frozen, if defrosted and well drained)", 
            "1 teaspoon sugar", 
            "1 teaspoon salt", 
            "1/8 teaspoon cayenne", 
            "3 large eggs, separated", 
            "1/4 teaspoon cream of tartar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/11/sweet-corn-spoonbread.jpg?w=750", 
        "tags": [
            "Corn", 
            "Gluten-Free", 
            "Photo", 
            "Side Dish", 
            "Thanksgiving"
        ], 
        "url": "https://smittenkitchen.com/2010/11/sweet-corn-spoonbread/", 
        "title": "sweet corn spoonbread", 
        "directions": [
            "Preheat oven to 400°F (see Note above if this seems too early). Very generously grease a 1 1/2 quart soufflé dish or an 8-inch square baking dish. Whisk cornmeal and 3/4 cup of milk in a small bowl until combined and set aside.", 
            "Melt butter in a Dutch oven or large, heavy pot over medium-high heat. Cook corn until beginning to brown, which can take as little as 3 minutes with fresh corn but with defrosted frozen corn, took me closer to 10 minutes. Stir in sugar, salt, cayenne and remaining 2 cups milk and bring to a boil. Remove from heat, cover, and let mixture steep for 15 minutes.", 
            "If you’ve got an immersion blender, please use it to save time. Otherwise, transfer mixture to a blender or food processor and puree until smooth. Back in the pot (or still, if it had never left) bring it back to a boil, reduce heat to low and add the cornmeal-milk mixture, whisking constantly until thickened, about 2 to 3 minutes. If you want to do fewer dishes and don’t mind if it takes longer to cool, you can leave it in the pot. Otherwise, transfer to a large bowl and return mixture to room temperature, about 20 minutes.", 
            "Once cool, whisk in egg yolks. Beat egg whites and cream of tartar in a medium bowl until stiff peaks form and fold it in to the corn mixture, one-third at a time. Pour batter into prepared baking dish and baked until spoonbread is golden brown and has risen above rim of dish, about 45 minutes. Serve immediately."
        ], 
        "date": "2010-11-24T10:46:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds sweet potato, scrubbed, unpeeled, in 3/4- to 1-inch coins", 
            "4 tablespoons olive oil, divided", 
            "1/4 cup toasted and cooled pecan halves", 
            "2 tiny or 1 small shallot", 
            "2 stalks celery", 
            "2 tablespoons flat-leaf parsley", 
            "1 tablespoon dried cranberries or cherries (optional)", 
            "2 ounces firmish goat cheese", 
            "Salt and freshly ground black pepper", 
            "2 teaspoons red wine vinegar", 
            "1/2 teaspoon smooth Dijon mustard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/11/sweet-potatoes-with-pecans-and-goat-cheese.jpg?w=749", 
        "tags": [
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Side Dish", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2010/11/sweet-potatoes-with-pecans-and-goat-cheese/", 
        "title": "sweet potatoes with pecans and goat cheese", 
        "directions": [
            "Preheat oven to 450 degrees. Coat a large baking sheet generously with olive oil, about 1 to 2 tablespoons. Lay sweet potatoes in one layer on the oiled sheet. Sprinkle with salt and freshly ground black pepper. Roast, without disturbing, for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release from the pan with no effort. If they’re not, let it cook longer. Sprinkle them with additional salt and freshly ground black pepper and return the pan to the oven for another 10 minutes or so, until the undersides match the tops.", 
            "Meanwhile, prepare your salad. Chop your pecans well, mince your shallot, chop your celery and parsley, mince cranberries if using them. Crumble your goat cheese. If you, like me, got too soft of a goat cheese for mixing, set it aside and sprinkle it on top. If it’s firmer, stir it into the mixture. In a small dish, whisk together 2 tablespoons olive oil, 2 teaspoons red wine vinegar and 1/2 teaspoon dijon. Pour half over salad.", 
            "When the sweet potatoes are done, set a couple coins aside just in case the baby isn’t into the toppings. Lay the rest on a serving platter. Scoop a spoonful of the salsa over each round. Pour remaining salad dressing over top, to taste. Eat immediately."
        ], 
        "date": "2010-11-15T16:43:05+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 cup (1/2 stick or 2 ounces) butter", 
            "1 small onion, finely chopped", 
            "3 pounds Swiss chard, leaves and stems separated and both cut into 1-inch pieces", 
            "Pinch of freshly grated nutmeg", 
            "2 cups heavy cream or whole milk", 
            "2 garlic cloves, minced", 
            "2 tablespoons flour", 
            "2 pounds medium red-skinned sweet potatoes (yams), peeled and cut into 1/8-inch thick rounds", 
            "1 tablespoon minced fresh Italian parsley", 
            "1 tablespoon minced fresh thyme", 
            "Fine sea salt", 
            "Freshly ground black pepper", 
            "1 1/4 cups (about 5 ounces) coarsely grated Gruyére cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/11/swiss-chard-and-sweet-potato-gratin.jpg?w=753", 
        "tags": [
            "Casserole", 
            "Fall", 
            "Freezer Friendly", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Swiss Chard", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2009/11/swiss-chard-and-sweet-potato-gratin/", 
        "title": "swiss chard and sweet potato gratin", 
        "directions": [
            "Prep greens: Cook onion in 2 tablespoons butter in a wide 8-quart heavy pot over moderately low heat, stirring, until softened. Add chard stems, pinch of nutmeg, and salt and pepper to taste and cook, stirring, until vegetables are tender but not browned, about 8 minutes. Increase heat to moderately high and add chard leaves by large handfuls, stirring, until all greens are wilted. Season with salt and pepper then transfer greens to a colander to drain well and press out liquid with back of a large spoon.", 
            "Make sauce: Combine cream or milk and garlic in small saucepan; bring to simmer; keep warm. Melt two tablespoons butter in a medium heavy saucepan over moderate heat and stir in flour. Cook roux, whisking, one minute, then slowly whisk in warm cream/milk and boil, whisking, one minute. Season sauce with salt and pepper.", 
            "Assemble gratin: Preheat oven to 400°F. Butter deep 9×13 baking dish. Spread half of sweet potatoes in the prepared baking dish. Sprinkle with salt, pepper, a quarter of the herbs and a 1/4 cup of the cheese. Distribute half of the greens mixture over the cheese, then sprinkle salt, pepper, a quarter of the herbs and 1/4 cup of the cheese over it. Pour half of bechamel sauce over the first two layers then continue with the remaining sweet potatoes, more salt, pepper, herbs and cheese and then the remaining greens, salt, pepper and herbs. Pour the remaining sauce over the top of the gratin, pressing the vegetables slightly to ensure that they are as submerged as possible. Sprinkle with the last 1/4 cup of cheese.", 
            "Bake gratin for about 1 hour until golden and bubbly, and most of the liquid is absorbed. Let stand 10 minutes before serving. ", 
            "Do ahead: You can make the entire gratin but not bake it up to a day in advance and keep it in the fridge. You can also make and bake the gratin and reheat it. Gratins reheat well, but they take almost as much time to gently heat through as they do to bake in the first place, especially deep ones like this. As for reheating, already baked and frozen, I will find out very soon! But I am near-positive it will be fine."
        ], 
        "date": "2009-11-12T17:08:23+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds fresh spinach", 
            "3 1/2 to 4 1/2 tablespoons unsalted butter", 
            "Salt and pepper", 
            "1 1/2 tablespoons flour", 
            "1 cup stock (your choice; Julia recommends beef) or cream (I used stock; it doesn’t *need* cream)", 
            "3/4 cup grated Swiss cheese", 
            "2 tablespoons fine, dry breadcrumbs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/03/best-baked-spinach.jpg?w=751", 
        "tags": [
            "French", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Spinach", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/03/the-best-baked-spinach/", 
        "title": "the best baked spinach", 
        "directions": [
            "Stem and wash your spinach (see Tips below) well but no need to spin or pat it dry. Place spinach in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 2 to 4 minutes for baby spinach and 4 to 6 minutes for regular spinach. Transfer to a colander, immediately fill pot with cold water, transfer it back to the pot of cold water to shock it (stop the cooking) and drain again. Squeeze a small amount of the spinach at a time in your hands to extract as much water as possible. Chop the spinach coarsely. You should have about 3 cups of chopped spinach, or about 1 cup per pound.", 
            "Wipe out pot then melt 2 tablespoons butter over moderately high heat and stir in the spinach. Cook for 2 to 3 minutes or until all of the moisture from the spinach has boiled off — you’ll know you’re done when the spinach begins to stick to the pan.", 
            "Lower the heat and sprinkle with flour and stir for 2 minutes to cook the flour. Add 2/3 of your stock or cream, a tiny bit at a time, scraping up any stuck spinach as you do. Once the liquid is added, simmer for another minute or two, stirring frequently to prevent sticking. If you’re feeling especially indulgent, stir in one more tablespoon of butter. If needed, add all or part of remaining liquid. Season with salt (I found 1/2 teaspoon table salt about right) and pepper.  ", 
            "Preheat oven to 375 degrees. Lightly butter a shallow 1-quart baking dish. Stir 1/2 cup cheese into the spinach and pour it into the baking dish. Mix the remaining cheese with breadcrumbs and sprinkle on spinach. Melt 1 1/2 tablespoons remaining butter and pour it over the top. Bake until heated through and slightly brown on the top, about 30 minutes.", 
            "Serve with steaks, chops, veal, chicken, broiled fish or, if you’re us, eggs, glorious eggs.", 
            "Do ahead: Spinach can be blanched and chopped several hours or a day in advance. Cover and refrigerate until needed. Gratin can be fully assembled and 30 minutes before needed, placed in a preheated 375 degree oven to bake, then served.", 
            "To stem spinach, as per Julia: If spinach is young and tender, remove the stems at the base of the leaf. If more mature, fold the leaf vertically with its underside up, grasp the leaf in one hand and the stem in the other and and rip it off toward the tip of the leaf, removing the stem and the tough tendrils. Discard any wilted or yellow leaves.", 
            "How I wash greens: Fill a large bowl or basin with cold water. Drop in the spinach and swish it around a few times so it deposits any sand and grit before lifting it out of the bowl (leaving any grit/dirt at the bottom of the bowl and not dragging the clean leaves through it) and drop it in a colander. No need to dry it for this recipe, but in others, I either spread it out on towels or run it through a salad spinner."
        ], 
        "date": "2011-03-08T19:45:59+00:00"
    }, 
    {
        "ingredient_list": [
            "28 ounces (800 grams) whole peeled tomatoes from a can (San Marzano, if you can find them)*", 
            "5 tablespoons (70 grams) unsalted butter", 
            "1 medium-sized yellow onion, peeled and halved", 
            "Salt to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2010/01/tomato-sauce-with-butter-and-onion.jpg?w=753", 
        "tags": [
            "Budget", 
            "Date Night", 
            "Italian", 
            "Pasta", 
            "Photo", 
            "Savory Sauces and Condiments", 
            "Tomatoes", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2010/01/tomato-sauce-with-butter-and-onions/", 
        "title": "tomato sauce with onion and butter", 
        "directions": [
            "Put the tomatoes, onion and butter in a heavy saucepan (it fit just right in a 3-quart) over medium heat. Bring the sauce to a simmer then lower the heat to keep the sauce at a slow, steady simmer for about 45 minutes, or until droplets of fat float free of the tomatoes. Stir occasionally, crushing the tomatoes against the side of the pot with a wooden spoon. Remove from heat, discard the onion, add salt to taste (you might find, as I did, that your tomatoes came salted and that you didn’t need to add more) and keep warm while you prepare your pasta.", 
            "Serve with spaghetti, with or without grated parmesan cheese to pass.", 
            "* I liked this enough to make us more the next day, but I only had a can of tomato puree. It also worked well, despite having slightly less texture. You will need a little less simmering time as the tomatoes are already broken down."
        ], 
        "date": "2010-01-17T13:36:23+00:00"
    }, 
    {
        "ingredient_list": [
            "3 russet potatoes (mine were 9 to 10 ounces each)", 
            "1 bundle lacinato kale (aka dinosaur, tuscan or black kale), swiss chard or spinach (10 ounces)", 
            "Coarse salt", 
            "1 tablespoon olive oil", 
            "1 tablespoon butter", 
            "1 large leek", 
            "1 cup coarsely grated cheddar, gruyere or comté, 2/3 cup finely grated parmesan or pecorino, or 1/2 to 2/3 cup cream cheese or goat cheese, softened", 
            "3/4 cup sour cream", 
            "Freshly ground black pepper or red pepper flakes to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/twice-baked-potatoes-with-kale1.jpg?w=640", 
        "tags": [
            "Budget", 
            "Gluten-Free", 
            "Kale", 
            "Photo", 
            "Potatoes", 
            "Side Dish", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2014/12/twice-baked-potatoes-with-kale/", 
        "title": "twice-baked potatoes with kale", 
        "directions": [
            "Heat oven to 400°F (205°C).", 
            "Cook potatoes the first time: Gently scrub potatoes but do not peel. Pierce all over with a fork so that steam escapes [raise your hand if you’ve forgotten to do this and had the pleasure of jumping three inches off the sofa due to an oven ka-pow!] Bake 1 hour to 1 hour 15 minutes or until potatoes are tender when pierced in center with a skewer. Leave oven on.", 
            "Alternatively, you could microwave fork-pierced potatoes for 10, turning them over halfway through to ensure even cooking. You could also boil the whole potato for 15 minutes.", 
            "While potatoes cook, prepare your filling: Tear kale, chard or spinach leaves from stems (you can save the stems for another use, such as a vegetable stock or juicing) and plunge leaves in cold water to remove any residual dirt or grit. No need to dry them when you’re done. Tear leaves into large chunks. Heat a skillet over medium-high and add greens and a pinch of salt. Cook them in the pan with just the water clinging to the leaves until they wilt and collapse. Transfer to a colander and when cool enough to handle, wring out any extra moisture in small fistfuls. On a cutting board, finely chop greens. You should have about a cup of wrung-out, well-chopped greens; don’t worry if you have a little more or less.", 
            "Trim leek down to just yellow and pale green part. Halve lengthwise — if it’s gritty inside, plunge it in cold water to remove grit, then pat dry. Cut leek halves lengthwise again, so that they’re in quarter-stalks, and thinly slice.  ", 
            "Heat a large skillet over medium heat; add butter and oil. Once both are warm, add leek and reduce heat to medium-low. Cook until mostly tender and sweet, about 10 to 15 minutes, stirring occasionally. Try to avoid letting it brown. Add chopped greens back to skillet and warm with leeks, 1 minute. Transfer mixture to a bowl.", 
            "Prepare potatoes: When potatoes are cool enough to handle, halve lengthwise and scoop out all but the last 1/4-inch thickness of skin and potato (essentially, you want to leave a shell inside for stability) and add potato filling to bowl with leeks and greens. Arrange the potato shells on a baking sheet. Mash potatoes, leeks and greens together until smooth. Stir in the sour cream, 3/4 of cheese and more salt and pepper than you think you’ll need. Heap filling in prepared potato skins. Sprinkle with remaining 1/4 of cheese. ", 
            "Bake potatoes a second time: For 20 to 30 minutes, until bronzed and crisp on top. "
        ], 
        "date": "2014-12-01T12:07:44+00:00"
    }, 
    {
        "ingredient_list": [
            "2 large shallots, 1 halved, 1 finely diced,", 
            "4 sprigs of thyme", 
            "1 small bay leaf", 
            "1 cup dry small green lentils (see Note up top for varieties)", 
            "1 small bay leaf", 
            "Salt and pepper", 
            "1 pound fingerling potatoes", 
            "2 tablespoons red wine vinegar", 
            "1 to 2 garlic cloves, minced or smashed to a paste (I use less)", 
            "1 tablespoon smooth Dijon mustard", 
            "1/4 cup of your favorite olive oil", 
            "2 teaspoons capers, rinsed if salted, drained if brined, and roughly chopped", 
            "2 tablespoons cornichons or other sour gherkins, roughly chopped", 
            "1 to 2 scallions, thinly sliced", 
            "1/2 cup chopped flat leaf parsley"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/01/warm-lentil-and-potato-salad.jpg?w=750", 
        "tags": [
            "Beans", 
            "Lunch", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Side Dish", 
            "Vegan", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2014/01/warm-lentil-and-potato-salad/", 
        "title": "warm lentil and potato salad", 
        "directions": [
            "Cook lentils: Pick over and rinse lentils. Place them in a small/medium saucepan with the halved shallot, thyme branches, bay leaf, some salt and 4 cups of water. Simmer the lentils over medium heat for 25 to 30 minutes, until firm-tender. Drain (discarding shallot, thyme and bay leaf) and keep warm.", 
            "Meanwhile, cook potatoes: In a separate saucepan, cover potatoes with 1 to 2 inches cold water. Set timer for 15 minutes, then bring potatoes to a simmer. When the timer rings, they should be easily pierced with a toothpick or knife. Drain and keep warm. ", 
            "Make the dressing: Place the chopped shallot and red wine vinegar in the bottom of a small bowl and let sit for 5 minutes. Whisk in minced garlic, dijon, a pinch of salt, a few grinds of black pepper and olive oil. Stir in chopped capers, cornichon and scallions. ", 
            "Assemble salad: Slice potatoes into 1/2-inch segments and place in serving bowl. Add lentils, dressing and all but 1 tablespoon parsley and combine. Adjust seasoning with additional salt and pepper if needed. Scatter salad with remaining parsley. ", 
            "Serve alone, with a soft-cooked egg on top, or as a side to a larger roast, chop or sausages. Reheat as needed. If you plan to make this at the outset of several meals and would like to eat it warm, I’d keep the dressing separate, warming only the lentils and potatoes and stirring in the cold dressing to taste.", 
            "Keeps in fridge for up to 5 days."
        ], 
        "date": "2014-01-21T12:32:43+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound very large (16 to 20 per pound) shrimp, peeled, de-veined, and rinsed, shells reserved", 
            "1 teaspoon salt", 
            "1 cup dry white wine", 
            "4 peppercorns", 
            "5 coriander seeds", 
            "1/2 bay leaf", 
            "5 sprigs fresh parsley", 
            "1 sprig fresh tarragon", 
            "1teaspoon juice from 1 small lemon", 
            "1 cup ketchup", 
            "2 1/2 teaspoons prepared horseradish (I believed we used slightly more)", 
            "1/4 teaspoon salt", 
            "1/4 teaspoon ground black pepper", 
            "1 teaspoon ancho or other mild chili powder", 
            "Pinch cayenne pepper", 
            "1 tablespoon juice from 1 small lemon", 
            "3 tablespoons good olive oil", 
            "1 small French bread or boule, cut into 1-inch cubes (6 cups)", 
            "1 teaspoon kosher salt", 
            "2 large ripe tomatoes, cut into 1-inch cubes", 
            "1 hothouse cucumber, unpeeled, seeded, and sliced 1/2 inch thick", 
            "1 red bell pepper, seeded and cut into 1-inch cubes", 
            "1 yellow bell pepper, seeded and cut into 1-inch cubes", 
            "1/2 red onion, cut in half and thinly sliced", 
            "20 large basil leaves, coarsely chopped", 
            "3 tablespoons capers, drained", 
            "1 lemon", 
            "4 small\tartichokes", 
            "2/3 cup\theavy cream", 
            "1 teaspoon garlic, finely chopped (about 1 medium clove)", 
            "1 teaspoon kosher salt", 
            "1/2 teaspoon ground white pepper", 
            "2 tablespoons olive oil", 
            "6 medium Yukon Gold potatoes", 
            "4 ounces Asiago cheese, grated (I used cave-aged Gruyere, because it’s my favorite)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/when-the-stars-make-you-drool1.jpg?w=500", 
        "tags": [
            "Appetizers + Party Snacks", 
            "Artichokes", 
            "Photo", 
            "Potatoes", 
            "Salad", 
            "Seafood", 
            "Side Dish"
        ], 
        "url": "https://smittenkitchen.com/2006/11/when-the-stars-make-you-drool/", 
        "title": "shrimp cocktail + artichoke-potato gratin", 
        "directions": [
            "1.\tBring reserved shells, 3 cups water and salt to boil in medium saucepan over medium-high head; reduced heat to low; cover, and simmer until fragrant, about 20 minutes. Strain stock through sieve, pressing on shells to extract all liquid.", 
            "2.\tBring stock and remaining ingredients except shrimp to boil in 3- or 4-quart saucepan over high heat; boil 2 minutes. Turn off heat and stir in shrimp; cover and let stand until firm and pink, 8 to 10 minutes. Drain shrimp, reserving stock for another use. Plunge shrimp into ice water to stop coking, then draining again. Serve shrimp chilled with cocktail sauce.", 
            "1. Heat the oil in a large saute pan. Add the bread and salt; cook over low to medium heat, tossing frequently, for 10 minutes, or until nicely browned. Add more oil as needed.", 
            "2. For the vinaigrette, whisk together the ingredients.", 
            "3. In a large bowl, mix the tomatoes, cucumber, red pepper, yellow pepper, red onion, basil, and capers. Add the bread cubes and toss with the vinaigrette. Season liberally with salt and pepper.", 
            "4. Serve immediately, or allow the salad to sit for about half an hour for the flavors to blend."
        ], 
        "date": "2006-11-06T17:25:43+00:00"
    }, 
    {
        "ingredient_list": [
            "2 ounces (4 tablespoons) vodka", 
            "1 1/2 ounces (3 tablespoons) coffee liqueur (such as kahlua or tia maria)", 
            "1 1/2 ounces (3 tablespoons) half-and-half or 1 ounce (2 tablespoons) milk plus 1/2 ounce (1 tablespoon) heavy cream"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/02/white-russian1.jpg?w=640", 
        "tags": [
            "Date Night", 
            "Drinks", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/02/white-russian/", 
        "title": "white russian", 
        "directions": [
            "Fill a short — or rocks — glass with ice. Add vodka and coffee liqueur. Finish with the cream. For the layered effect, pour the cream in a very slow drizzle off the back of a spoon held over — but not touching — the surface of the drink. To swirl it prettily, insert a stirrer along the inner wall of the glass only as a deep as the cream and move it around in a slow circle."
        ], 
        "date": "2016-02-19T12:01:37+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2013/09/zucchini-parmesan-crisps.jpg?w=750", 
        "tags": [
            "Photo", 
            "Side Dish", 
            "Snack", 
            "Summer", 
            "Summer Squash", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2013/09/zucchini-parmesan-crisps/", 
        "title": "zucchini parmesan crisps", 
        "directions": [
            "Heat oven to 450 degrees. Coat two baking sheets lightly with cooking spray or thinly with olive oil. Slice zucchini into slightly-less-than 1/4-inch thick rounds; if they feel especially wet, spread them on a towel while you prepare the other ingredients. In a small bowl, lightly beat first egg white with 1 teaspoon water to loosen it. Combine cheese, crumbs, salt and pepper in a separate bowl. Dip each zucchini coin in egg white, letting excess run off before gently dipping them in parmesan mixture. Arrange in single layer on baking sheets. If additional egg white is needed, prepare it the same way, with 1 teaspoon of water. If additional crumb mixture is needed, make a few spoonfuls at a time, matching the volume of crumbs and cheese. ", 
            "Bake zucchini rounds until browned and crisp, about 25 to 30 minutes, flipping each over halfway through. Please keep an eye on them; they may need to be moved around on the tray so the ones at the edges don’t bake more quickly than the ones in the center. Take them out only when they’re golden all over and let them cool on the tray on a cooling rack or a plate. ", 
            "Keep at room temperature until needed. Crisps are best on the first day. "
        ], 
        "date": "2013-09-03T11:45:21+00:00"
    }, 
    {
        "ingredient_list": [
            "Butter for dish", 
            "2 1/2 pounds (about 1 1/8 kg) zucchini", 
            "2 1/2 teaspoons kosher salt (I use Diamond brand, use 1 1/2 of other brands)", 
            "1/2 cup (90 grams) plain, uncooked white rice", 
            "1 medium onion, minced (about 1 cup)", 
            "5 tablespoons (75 ml) olive oil, divided", 
            "2 large cloves garlic, mashed or finely minced", 
            "2 tablespoons (15 grams) all-purpose flour (optional)", 
            "1/2 cup milk, as needed, although water or broth of your choice would work just fine [1/2 cup needed for streamlined directions, less for original]", 
            "2/3 cup (55 grams) grated Parmesan cheese, divided", 
            "Salt and pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/09/zucchini-rice-and-cheese-gratin1.jpg?w=750", 
        "tags": [
            "Budget", 
            "Casserole", 
            "Freezer Friendly", 
            "Grain/Rice", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Summer", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2015/09/zucchini-rice-cheese-gratin/", 
        "title": "zucchini rice and cheese gratin", 
        "directions": [
            "\nNew, simplified directions:", 
            "Heat oven to 325 degrees F. Oil or butter a 2-quart baking dish, or 2 smaller 1-quart dishes (as I did, with the intention of freezing one).", 
            "Prepare zucchini: Wash zucchini and trim ends. Halve lengthwise, and if seeds are particularly large, core them out. Coarsely grate and place in a large bowl.", 
            "Prepare remaining ingredients: In a large frying pan, cook the onions slowly in 3 tablespoons oil for 8 to 10 minutes until tender and translucent. Raise heat slightly and stir several minutes until very lightly browned. Stir in garlic and cook another minute. Add uncooked rice and sauté for another two minutes. Season generously with salt and pepper.\nAssemble gratin: Transfer to bowl with zucchini and stir together with 1/2 cup liquid of your choice and all but 2 tablespoons cheese. Taste and adjust seasoning if needed. Transfer to prepared baking dish.", 
            "Bake gratin: Cover tightly with foil and bake for 50 to 60 minutes, until rice within is cooked but not mush. Increase oven temperature to 450 degrees. Remove foil, drizzle top with remaining olive oil (or dot with butter), sprinkle on remaining cheese and bake uncovered until browned and crisp on top, about another 10 to 15 minutes. For extra color, you can run it under the broiler for one minute at the end.\nDirections as originally published here:", 
            "Prepare zucchini: Wash zucchini and trim ends. Halve lengthwise, and if seeds are particularly large, core them out. Coarsely grate and place in a colander set over a bowl. Toss with kosher salt. Let drain for 5 minutes, says Julia Child, but more like 20 or, if you’ve got the time, up to 30 minutes.", 
            "Save drained liquid and squeeze a handful of the zucchini and taste. If it’s very salty, rinse and drain it again (not saving liquid this time). Squeeze all of the zucchini in handfuls, gently, collecting any juices in the bowl of drained liquid. Blot dry on paper towels.", 
            "Prepare rice: Boil for exactly 5 minutes in salted water. Drain and set aside. [In comments I’ve read about this recipe online, many people say that they skip this step and it all works out in the oven. But I didn’t this time.]\nPrepare remaining ingredients: In a large frying pan, cook the onions slowly in 3 tablespoons oil for 8 to 10 minutes until tender and translucent. Raise heat slightly and stir several minutes until very lightly browned. Stir in the grated and dried zucchini and garlic; season with salt and pepper. Toss and turn for 5 to 6 minutes until the zucchini is almost tender.  Sprinkle in the flour, stir over moderate heat for 2 minutes, and remove from heat.\nAssemble dish: Measure the drained liquid from the zucchini. If you have less than 2 1/2 cups, add milk to bring the level up to it. (I became sidetracked and mine drained for an hour; I ended up with the full 2 1/2 cups and needed no milk.)\nStir into zucchini-onion mixture, return pan to stove over medium-high heat and bring to a simmer, stirring. Remove from heat again, stir in par-cooked rice and all but 2 tablespoons cheese. Taste and adjust seasoning if needed.", 
            "Turn into a 2-quart baking dish, or 2 smaller 1-quart dishes (as I did, with the intention of freezing one). Sprinkle with reserved cheese and remaining olive oil, although I apparently used butter instead, because: butter\nYou can cook it right away, or let it sit until 30 minutes before you want to serve it.", 
            "30 minutes before serving: Heat oven to 425 degrees. Bake in upper third of oven until bubbling and browned on top, about 25 to 30 minutes. (If yours begins to brown too quickly, you can cover it with foil until the last 5 minutes.) The rice should absorb all the liquid. Serve immediately.", 
            ""
        ], 
        "date": "2015-09-16T12:05:37+00:00"
    }, 
    {
        "ingredient_list": [
            "1/3 cup uncooked white rice, long-grain is suggested but use whatever you prefer", 
            "5 tablespoons olive oil", 
            "1 1/2 pounds zucchini (about 3 medium), sliced 1/4-inch thick", 
            "1/2 pound plum tomatoes, sliced 1/4-inch thick", 
            "Table salt and freshly ground black pepper", 
            "1 medium onion, halved lengthwise and thinly sliced", 
            "3 garlic cloves, minced", 
            "2 large eggs, lightly beaten", 
            "1 teaspoon chopped fresh thyme leaves", 
            "1/2 cup grated Parmesan, divided"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/07/zucchini-tomato-and-rice-gratin.jpg?w=750", 
        "tags": [
            "Casserole", 
            "Gluten-Free", 
            "Grain/Rice", 
            "Photo", 
            "Side Dish", 
            "Summer", 
            "Tomatoes", 
            "Vegetarian", 
            "Zucchini"
        ], 
        "url": "https://smittenkitchen.com/2012/07/zucchini-tomato-and-rice-gratin/", 
        "title": "zucchini, tomato and rice gratin", 
        "directions": [
            "Preheat oven to 450°F. Cook the rice according to your favorite method. The package directions work in some cases, but check my notes above about adjustments I find I have to make. If you cook the rice in a large, wide-ish covered skillet, it might cook even faster but you’ll have the chance to use it again (and save on dirty dishes) when you need to cook the onions in a bit.", 
            "While rice cooks, coat two large (or, if you have the same pitifully small oven as I do, three smaller) baking sheets each with a tablespoon of a of olive oil (a bit less for smaller pans). Spread zucchini and tomato slices on the baking sheets in as close to a single layer as you can. Sprinkle with 1/2 teaspoon salt and a few grinds of black pepper. Roast tomatoes for 10 minutes and zucchini for 20. Flip zucchini halfway through; it’s not worth the messy effort for the tomatoes. Leave oven on.", 
            "Heat large, heavy skillet (such as the one you used to cook your rice) over medium heat. Once hot, add 2 tablespoons olive oil, heat oil, then add onions, garlic and 1/4 teaspoon salt to pan. Cover and reduce heat to low, cooking onion until limp and tender, about 15 to 20 minutes. Stir occasionally.", 
            "Combine onion mixture, rice, eggs, thyme, half of your grated cheese and a half-tablespoon of olive oil in a bowl. Add a good amount of freshly ground black pepper. Use the remaining half-tablespoon of olive oil to coat a shallow 2-quart baking dish. Spread half of rice mixture in bottom of dish. Arrange half of roasted zucchini on top. Spread remaining rice mixture over it and please don’t worry about being neat about this; dinner will be “rustic” tonight! Arrange remaining zucchini on top, then tomato slices. Sprinkle with remaining grated cheese and bake until set and golden brown, about 20 minutes. Each oven varies, but I find mine does the very best browning when the dish is on a rack near the top of the oven."
        ], 
        "date": "2012-07-31T17:55:18+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/zuni-cafe-roast-chicken-bread-salad1.jpg?w=500", 
        "tags": [
            "Chicken", 
            "Date Night", 
            "Photo", 
            "Salad"
        ], 
        "url": "https://smittenkitchen.com/2008/12/zuni-cafe-roast-chicken-bread-salad/", 
        "title": "zuni cafe’s roasted chicken + bread salad", 
        "directions": [
            "Preheat the broiler. Carve off all of the bottom and most of the top and side crusts from your bread (you can reserve these to use as croutons for soup or another salad). Tear bread into irregular 2- to 3-inch chunks, wads, bite-sized bits and fat crumbs. You should get about 4 cups.", 
            "Toss them with just a tablespoon or two of olive oil, lightly coating them, and broil them very briefly, just to lightly color the edges. If you’d like to toast the pine nuts (recommended) you can put them on your broiler tray as well, but watch them very carefully — they cook quickly!", 
            "Combine about 1/4 cup of the olive oil with the Champagne or white wine vinegar and salt and pepper to taste. Toss about 1/4 cup of this tart vinaigrette with the torn bread in a wide salad bowl; the bread will be unevenly dressed. Taste one of the more saturated pieces. If it is bland, add a little salt and pepper and toss again.", 
            "Heat a spoonful of the olive oil in a small skillet, add the garlic and scallions, and cook over medium-low heat, stirring constantly, until softened. Don’t let them color. Scrape into the bread and fold to combine. Drain the plumped currants and fold them in, along with the pine nuts, if they were not already mixed with the bread scraps from the broiling step. Dribble the chicken stock or lightly salted water over the salad and fold again.", 
            "Taste a few pieces of bread — a fairly saturated one and a dryish one. If it is bland, add salt, pepper, and/or a few drops of vinegar, then toss well.", 
            "If you’re going to serve the salad under the roast chicken (recipe above), you can pile the bread salad on the serving dish you want to use and tent it with foil. If you want to serve it separately, do the same, but in a 1-quart shallow baking dish. Hang onto the bowl you mixed it in — you’ll use it again.", 
            "Place the salad in the oven after you flip the chicken the final time, for about 5 to 10 minutes.", 
            "Tip the bread salad back into the salad bowl. It will be steamy-hot, a mixture of soft, moist wads, crispy-on-the-outside-but-moist-in-the-middle-wads, and a few downright crispy ones. Drizzle and toss with a spoonful of the pan juices. Add the greens, a drizzle of vinaigrette, and fold well. Taste again."
        ], 
        "date": "2008-12-10T14:30:48+00:00"
    }
]