{
  "date": "2011-03-08T19:45:59+00:00",
  "directions": [
    "Stem and wash your spinach (see Tips below) well but no need to spin or pat it dry. Place spinach in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 2 to 4 minutes for baby spinach and 4 to 6 minutes for regular spinach. Transfer to a colander, immediately fill pot with cold water, transfer it back to the pot of cold water to shock it (stop the cooking) and drain again. Squeeze a small amount of the spinach at a time in your hands to extract as much water as possible. Chop the spinach coarsely. You should have about 3 cups of chopped spinach, or about 1 cup per pound.",
    "Wipe out pot then melt 2 tablespoons butter over moderately high heat and stir in the spinach. Cook for 2 to 3 minutes or until all of the moisture from the spinach has boiled off — you’ll know you’re done when the spinach begins to stick to the pan.",
    "Lower the heat and sprinkle with flour and stir for 2 minutes to cook the flour. Add 2/3 of your stock or cream, a tiny bit at a time, scraping up any stuck spinach as you do. Once the liquid is added, simmer for another minute or two, stirring frequently to prevent sticking. If you’re feeling especially indulgent, stir in one more tablespoon of butter. If needed, add all or part of remaining liquid. Season with salt (I found 1/2 teaspoon table salt about right) and pepper.  ",
    "Preheat oven to 375 degrees. Lightly butter a shallow 1-quart baking dish. Stir 1/2 cup cheese into the spinach and pour it into the baking dish. Mix the remaining cheese with breadcrumbs and sprinkle on spinach. Melt 1 1/2 tablespoons remaining butter and pour it over the top. Bake until heated through and slightly brown on the top, about 30 minutes.",
    "Serve with steaks, chops, veal, chicken, broiled fish or, if you’re us, eggs, glorious eggs.",
    "Do ahead: Spinach can be blanched and chopped several hours or a day in advance. Cover and refrigerate until needed. Gratin can be fully assembled and 30 minutes before needed, placed in a preheated 375 degree oven to bake, then served.",
    "To stem spinach, as per Julia: If spinach is young and tender, remove the stems at the base of the leaf. If more mature, fold the leaf vertically with its underside up, grasp the leaf in one hand and the stem in the other and and rip it off toward the tip of the leaf, removing the stem and the tough tendrils. Discard any wilted or yellow leaves.",
    "How I wash greens: Fill a large bowl or basin with cold water. Drop in the spinach and swish it around a few times so it deposits any sand and grit before lifting it out of the bowl (leaving any grit/dirt at the bottom of the bowl and not dragging the clean leaves through it) and drop it in a colander. No need to dry it for this recipe, but in others, I either spread it out on towels or run it through a salad spinner."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/03/best-baked-spinach.jpg?w=751",
  "ingredient_list": [
    "3 pounds fresh spinach",
    "3 1/2 to 4 1/2 tablespoons unsalted butter",
    "Salt and pepper",
    "1 1/2 tablespoons flour",
    "1 cup stock (your choice; Julia recommends beef) or cream (I used stock; it doesn’t *need* cream)",
    "3/4 cup grated Swiss cheese",
    "2 tablespoons fine, dry breadcrumbs"
  ],
  "tags": [
    "French",
    "Photo",
    "Put An Egg On It",
    "Side Dish",
    "Spinach",
    "Thanksgiving",
    "Vegetarian"
  ],
  "title": "the best baked spinach",
  "url": "https://smittenkitchen.com/2011/03/the-best-baked-spinach/"
}