{
  "date": "2007-10-04T08:44:20+00:00",
  "directions": [
    "Marinate chicken: Mince and mash garlic to a paste with 2 teaspoons salt, then transfer to a large bowl.  Stir in vinegar and oregano. ",
    "Remove skin and excess fat from chicken, then toss chicken with marinade until coated and marinate, covered and chilled, at least 1 hour.",
    "Cook chicken and rice: – Cook chorizo in olive oil in a 6- to 7-quart heavy pot (12 inches wide) over medium-high heat, stirring, until some fat is rendered, 2 to 3 minutes.  Add onions, bell pepper, and garlic and cook, stirring until softened, about 5 minutes. ",
    "Add cumin, oregano, paprika, 1 1/4 teaspoons salt, and bay leaves and cook, stirring, 1 minute.",
    "Add chicken with marinade to chorizo mixture and cook, uncovered, over medium heat, stirring frequently, 10 minutes. ",
    "Stir in tomatoes, beer, broth, and rice and bring to a boil, making sure rice is submerged. [Deb note: I actually had a really hard time keeping the rice underneath the chicken so that it would cook evenly. I’d suggest that you use tongs to temporarily remove the chicken from the pot, mix the rice in with the other ingredients in the pot, and then replace the chicken, pressing it into the broth a bit before going onto the next step. I will definitely do this next time.]",
    "Reduce heat to medium-low, then cover mixture directly with a round of parchment or wax paper and cover pot with a tight fitting lid.  Cook, stirring once or twice, until rice is tender, 20 to 30 minutes. ",
    "Remove from heat and let stand, covered, 5 minutes.  Discard parchment paper and bay leaves, then scatter pimiento strips over rice.",
    "Do ahead: Chicken can be marinated up to 2 hours in advance."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2007/10/arroz-con-pollo.jpg?w=749",
  "ingredient_list": [],
  "tags": [
    "Budget",
    "Photo",
    "Spanish"
  ],
  "title": "arroz con pollo",
  "url": "https://smittenkitchen.com/2007/10/arroz-con-pollo/"
}