{
  "date": "2007-10-05T09:21:02+00:00",
  "directions": [
    "2.\tArrange the bread cubes in a single layer on a large rimmed baking sheet and bake until they are just beginning to turn golden, 8 to 10 minutes, stirring once. Lead the bread cubes cool.",
    "3.\tPlace the garlic, salt, and cumin in a mortar and, using a pestle, mash them into a paste. Add the vinegar and olive oil and whisk to mix. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/gazpacho-and-lentil-chorizo-salads1.jpg?w=500",
  "ingredient_list": [
    "2 1/2 cups cubed day-old dense country bread (1-inch cubes)",
    "2 medium-size garlic cloves, chopped",
    "1 large pinch of coarse salt (Kosher or sea)",
    "1 small pinch of cumin seeds",
    "3 tablespoons sherry vinegar, preferably aged, or best-quality red wine vinegar, or more to taste",
    "1/3 cup fragrant extra-virgin olive oil",
    "1 2/3 pounds very ripe but firm tomatoes, cut into 3/4-inch cubes",
    "2 small Kirby (pickling) cucumbers, cored, seeded and diced",
    "1/2 cup finely chopped white onion",
    "1/2 cup seedless green grapes, cut in half",
    "About 1/2 cup slivered fresh mint or basil (optional)",
    "1 small onion",
    "3 medium-size garlic cloves, peeled",
    "3 fresh flat-leaf parsley sprigs, plus 1/4 cup chopped parsley",
    "1 bay leaf",
    "1 cup green or brown lentils (see Note)",
    "Extra-virgin olive oil",
    "1/2 pound sweet Spanish-style chorizo sausage, diced medium-fine",
    "2 ounces thinly sliced serrano ham or proscuitto",
    "2 tablespoon sherry vinegar, preferably aged (we, of course, used more)",
    "1 tablespoon best-quality red wine vinegar",
    "1 tablespoon chicken stock or broth, or water",
    "1 teaspoon honey",
    "Coarse salt (kosher or sea) and freshly ground black pepper",
    "3 medium-size firm tomatoes, peeled, seeded and chopped",
    "1/4 cup finely slices scallions, both white and green parts"
  ],
  "tags": [
    "Beans",
    "Photo",
    "Picnics",
    "Salad",
    "Spanish"
  ],
  "title": "gazpacho salad",
  "url": "https://smittenkitchen.com/2007/10/gazpacho-and-lentil-chorizo-salads/"
}