{
  "date": "2009-08-10T11:45:34+00:00",
  "directions": [
    "In a large bowl, combine the lobster meat, celery, mayonnaise, lemon and salt and pepper and mix thoroughly. Adjust seasonings to taste.",
    "Do ahead: Cover the mixture and store it in the refrigerator until ready to serve. It will last for up to two days.",
    "How they prepare the buns at the restaurant: In a small sauté pan over low to medium heat, melt two teaspoons of butter. Place the hot dog buns on their sides in the butter. Flip the buns a couple of times so that both sides soak up an equal amount of butter and brown evenly. Remove the buns from the pan and place them on a large plate. Fill the toasted buns with lobster salad.",
    "How we prepared our miniature rolls: On large roasting pans, we split each of our rolls and lightly toasted them, open side up, before quickly slathering both sides with butter and filling each with a generous tablespoon of lobster salad.",
    "Sprinkle your rolls with chives and serve with a salad, slaw or shoestring fries.",
    "* We bought our lobster meat, cooked that morning and shelled, from The Lobster Place, for those of you who were going to ask. However, not all markets are as trustworthy when it comes to lobster meat that they label “fresh” — it is often overcooked and not as recently-rendered as they promise. If you’re up for it, cooking and cracking your own will ensure freshness while reducing your grocery tab. About 20 percent of the weight of a lobster is its meat, so you would need, for example, five one-pound lobsters to get one pound of meat. Don’t panic — as I did — when you see how tiny the mass of two pounds of lobster meat might look. Once diced, our salad nearly filled a six-cup bowl."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/lobster-rolls1.jpg?w=500",
  "ingredient_list": [
    "2 pounds cooked lobster meat*, chopped roughly into 1/2 and 3/4-inch pieces",
    "1 small celery rib, finely chopped",
    "1/4 cup mayonnaise (Charles insists on Hellman’s; I didn’t argue)",
    "Squeeze or two of lemon juice",
    "Pinch of kosher salt and freshly ground black pepper",
    "2 top-loading hot dog buns or 64 miniature burger buns (described above) or small dinner rolls",
    "Unsalted butter",
    "Snipped fresh chives for garnish (though we mixed ours right into the salad, for convenience)"
  ],
  "tags": [
    "Photo",
    "Salad",
    "Seafood"
  ],
  "title": "lobster rolls",
  "url": "https://smittenkitchen.com/2009/08/lobster-rolls/"
}