{
  "date": "2011-02-04T13:40:16+00:00",
  "directions": [
    "Make the meatballs: Split your rolls almost the whole way through, leaving one side attached. Scoop out some of the roll to create a channel for the meatballs to rest in. Grind the bread you pulled out in a food processor or tear it into minuscule bits. You will need 1 1/3 cups or 2 3/4 ounces of fresh breadcrumbs for the meatballs. If you’re not making subs, you can get this same amount of breadcrumbs from 2 to 3 sandwich bread slices. Set rolls aside until later.",
    "Place the fresh breadcrumbs in a large bowl with 3/4 cup warm water and all of the meatball ingredients except for the olive oil and tomato sauce. Combine with a fork, breaking up clumps of meat until the ingredients are evenly distributed. Form mixture into 2-inch meatballs are arrange on a tray. I find wet hands make it easier to form meatballs without them sticking too much.",
    "Heat a generous slick of oil (few tablespoons) in a large saute pan with a lid. Brown meatballs in batches, being careful not to crowd the pan or nudge them before they are nicely browned or they will stick and you’ll leave delicious meatball bits in the pan. These meatballs are soft, so use a gentle hand. Transfer meatballs to a paper towel-lined tray and continue until they are all browned.",
    "Discard the oil and heat your tomato sauce in the pan. Add the meatballs, cover the pan and simmer them on the lowest heat possible for 25 to 30 minutes, until the meatballs are cooked through.",
    "Caramelize onions: While the meatballs are simmering, you can cook the onions. Heat the olive oil and butter in a heavy large skillet over medium-low heat. Add onion, sprinkle with salt and a little pepper and cook until they’re tender, sweet, and a deep golden brown, stirring occasionally. This takes me about 30 minutes.",
    "Assemble subs: Arrange meatballs with sauce in the hollowed-out roll(s). Drape caramelized onions over the top and sprinkle with shredded cheese. Place subs under a broiler or in an oven at top heat to melt the cheese."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/02/meatball-sub-with-caramelized-onions.jpg?w=750",
  "ingredient_list": [
    "Meatballs",
    "The baguettes or seeded sandwich rolls you’ll use for your sandwiches (see Note above for how to estimate)",
    "2 pounds ground meat of your choice (I used pork but have in the past used beef, veal, chicken, turkey or a blend thereof)",
    "2 tablespoons chopped parsley",
    "1/3 cup finely grated Parmesan or Romano cheese",
    "3/4 teaspoon salt",
    "Pinch of red pepper flakes",
    "2 small garlic cloves, minced",
    "1 teaspoon onion powder",
    "1 teaspoon Worcestershire sauce",
    "1 large egg",
    "Olive oil",
    "4 cups prepared tomato sauce (plus extra if you like a lot of extra sauce)",
    "Caramelized onions",
    "2 large yellow onions, thinly sliced",
    "1 tablespoon butter",
    "1 tablespoon olive oil",
    "Salt",
    "Assembly",
    "2 cups coarsely shredded Gruyère"
  ],
  "tags": [
    "Meat",
    "Onions",
    "Photo",
    "Sandwich"
  ],
  "title": "meatball subs with caramelized onions",
  "url": "https://smittenkitchen.com/2011/02/meatball-sub-with-caramelized-onions/"
}