{
  "date": "2013-04-22T12:02:28+00:00",
  "directions": [
    "Trim hairy ends off ramp bulbs. Separate ramp bulbs/stems from darker leafy ends. Thinly slice the stem ends; cut the leafier ends into 1/2-inch thick ribbons. ",
    "Heat large skillet over medium heat. Once hot, add 1 tablespoon olive oil. Once the oil is hot, add a pinch of red pepper flakes if using, and the sliced bulbs and saute until translucent but still a little crunchy/sharp, about 4 to 5 minutes. Add ramp leaves and cook until just wilted, barely 1 minute. Season with salt and set aside.",
    "Heat your oven to its hottest temperature. Coat a baking sheet or pizza pan lightly with cornmeal (so that dough doesn’t stick). Stretch pizza dough into a very thin 11 to 12-inch round or large rectangle with your fingers. Don’t worry if it’s uneven or misshapen. ",
    "If using whole canned tomatoes, either chop or puree them until you have your desired sauce consistency. In a small bowl, mix them with garlic, salt and red pepper flakes if using. Taste for seasoning. You can add a drop or two of vinegar for extra brightness or a pinch of sugar if it tastes like it needs it. Spread this mixed tomato puree thinly over your dough almost to the edges. You might not need a full 1/2 cup; I tend to use 1/4 to 1/3 cup.",
    "If using mozzarella, spread thin slices over tomatoes. Scatter sauteed ramps over pizza. Season with additional salt and pepper (or pepper flakes) and drizzle with remaining tablespoon of olive oil. Bake in heated oven for 10 to 12 minutes (keeping an eye on it if this is your first time baking pizza in a very hot oven), until crust is golden all around and mozzarella (if using) has some charred spots. Remove pizza from oven, scatter it immediately with pecorino romano cheese and serve in slices.",
    "But I can’t get ramps! Leeks seem like the obvious choice, and they’d be delicious, but they’re much heavier than their wild counterpart, and take much longer to cook. Spring onions would be a nicer replacement. So could a mixture of scallions and a handful of spinach. Mainly, you’re looking for something small and onion-y to saute until translucent, but retain some sharpness, and a green to lightly wilt. I think that whatever you choose will be delicious."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/04/ramp-pizza.jpg?w=750",
  "ingredient_list": [
    "4 ounce, about half a bundle, ramps (see footnote for other suggestions)",
    "2 tablespoons olive oil",
    "Red pepper flakes (optional)",
    "Salt",
    "Cornmeal",
    "1 12-ounce pizza dough, ready to use (I default to my Rushed Pizza Dough in the book or this Really Simple one these days)",
    "1/3 to 1/2 cup canned tomato puree or whole canned tomatoes",
    "1 tiny garlic clove, minced",
    "Pinch of sugar or drops of red wine vinegar (if needed)",
    "3 to 4 ounces mozzarella, sliced into paper-thin rounds (optional)",
    "1/4 cup pecorino romano cheese, finely grated"
  ],
  "tags": [
    "Photo",
    "Pizza",
    "Ramps",
    "Spring",
    "Vegetarian"
  ],
  "title": "ramp pizza",
  "url": "https://smittenkitchen.com/2013/04/ramp-pizza/"
}