{
  "date": "2009-01-22T10:32:37+00:00",
  "directions": [
    "Preheat the oven to 350°F. Butter a 9-inch springform pan and dust with breadcrumbs (I cheated and used flour), set aside.",
    "Sift the flour, baking powder and salt together, set aside.",
    "Using a mixer fitted with the whisk attachment, whip the eggs on high speed until pale and very thick. (In a professional Kitchen Aid, it takes at least five minutes; on a home machine, it will take nine minutes to get sufficient volume)",
    "While the eggs are whipping, brown the butter. Melt the butter in a medium saucepan (because it will foam a lot) and cook it until the butter browns and smells nutty (about 6 to 8 minutes). It helps to frequently scrape the solids off the bottom of the pan in the last couple minutes to ensure even browning. Remove from the flame but keep in a warm spot.",
    "Add the sugar to the eggs and whip a few minutes more.",
    "Just as the egg-sugar mixture is starting to lose volume, turn the mixture down to stir, and add the flour mixture and brown butter. Add one third of the flour mixture, then half of the butter, a third of the flour, the remaining butter, and the rest of flour. Whisk until just barely combined — no more than a minute from when the flour is first added — and then use a spatula to gently fold the batter until the ingredients are combined. It is very important not to over-whisk or fold the batter or it will lose volume.",
    "Pour into prepared pan. Sprinkle the pear and chocolate chunks over the top, and bake until the cake is golden brown and springs back to the touch, about 40 to 50 minutes [updated, thanks for your responses], or a tester comes out clean.",
    "We served it with barely whipped whipped cream with a drop of almond extract in it, but I believe Anna serves it with buttermilk ice cream at the restaurant, which is, the best thing in the entire world, something I have the recipe for and promise to tell you about soon. (I’m just scared to make it because I ate the entire pint she gave me last time by myself. In three days.)",
    "Update 1/27/09: I’ve added more baking suggestions in the comments: in short, please, don’t take your cake out before it is done. Doneness is much more important than baking times. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/bittersweet-chocolate-and-pear-cake1.jpg?w=500",
  "ingredient_list": [
    "1 cup all-purpose flour",
    "1 tablespoon baking powder",
    "1/4 teaspoon salt",
    "3 eggs, at room-temperature",
    "4 ounces (1 stick) unsalted butter",
    "3/4 cup sugar",
    "3 pears, peeled, in a small dice (I used anjou, but would recommend a softer variety, like a bosc or any other of your favorites)",
    "3/4 cup bittersweet chocolate chunks"
  ],
  "tags": [
    "Brown Butter",
    "Cake",
    "Chocolate",
    "Everyday Cakes",
    "Fall",
    "Fruit",
    "Italian",
    "Pear",
    "Photo"
  ],
  "title": "bittersweet chocolate and pear cake",
  "url": "https://smittenkitchen.com/2009/01/bittersweet-chocolate-and-pear-cake/"
}