{
  "date": "2012-05-16T14:26:55+00:00",
  "directions": [
    "Preheat your oven to 350°F (180°C). Butter a 9-inch cake pan and line the bottom with a circle of parchment paper. Melt the butter and chocolate together in a double-boiler (a heatproof bowl resting on a pot of lightly simmering water) or in short bursts in the microwave, stirring frequently. Set aside.",
    "In the bowl of a stand mix, beat the eggs and sugar with salt until light and pale and doubled in volume. This will take anywhere from 5 to even 9 minutes and I encourage you not to skimp on this because this thickened plume of eggs is an important part of this cake’s dreamy crumb. Plus, the mixer is doing all of the work for you, isn’t it? ",
    "Gently fold in the vanilla and melted chocolate mixture. Sprinkle the buckwheat and almond flours over the batter and fold gently to combine. Pour into prepared pan and bake for… well, mine was done in 20, but Bea suggests 30, which means that the truth is somewhere in-between. A tester inserted into the center of the cake should come out dry. ",
    "Let cool for five minutes on a rack then invert onto the rack, remove the parchment paper, and return upright on a serving plate. Serve in wedges, dusted with powdered sugar, dolloped with lightly whipped cream and/or scattered with berries. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chocolate-buckwheat-cake1.jpg?w=500",
  "ingredient_list": [
    "7 tablespoons (100 grams or 3 1/2 ounces) unsalted butter, plus extra for buttering pan",
    "3 1/2 ounces (100 grams) bittersweet dark chocolate (70 to 72 percent is ideal)",
    "4 large eggs at room temperature",
    "1/2 cup (100 grams or 3 1/2 ounces) granulated or blond cane sugar",
    "A good pinch of sea salt",
    "1 teaspoon pure vanilla extract",
    "1/4 cup (35 grams or 1 1/4 ounces) buckwheat flour",
    "1/4 cup (30 grams or 1 ounce) almond meal",
    "Confectioners’ sugar, lightly whipped cream and/or berries to serve (optional)"
  ],
  "tags": [
    "Cake",
    "Chocolate",
    "Gluten-Free",
    "Photo"
  ],
  "title": "chocolate buckwheat cake",
  "url": "https://smittenkitchen.com/2012/05/chocolate-buckwheat-cake/"
}