{
  "date": "2014-02-06T11:53:01+00:00",
  "directions": [
    "Place the nuts, flour, baking powder and salt in the bowl of a food processor fitted with the blade attachment and pulse until the nuts are finely ground, as powdery as you can get them without letting them turn to a paste. (You can tell when it’s beginning to turn to a paste and you should immediately stop when a ring of moist crumbs adheres to base edges of the bowl and doesn’t get picked up when you run the machine.) ",
    "Place butter and both sugars in a large bowl and use an electric mixer to beat it until light and creamy, about 2 to 3 minutes. Scrape down the sides of the bowl, add yolks and vanilla, then beat until incorporated, about another 30 seconds. Sprinkle ground hazelnuts and other dry ingredients over butter mixture and mix until just incorporated. Divide dough in half and wrap each in plastic wrap. Chill dough packets in the fridge for at least 1 hour and up to 2 days.",
    "Heat oven to 350°F. Line two baking sheets with parchment paper or silicone baking mats. Roll out the first dough packet until between 1/8 and 1/4-inch thick. Use a 2-inch cutter of your choice to cut out rounds of dough. Use a smaller cookie cutter (a 3/4-inch is ideal) to remove the centers of half of the cookies, creating ring shapes that will later form the lids. If the dough becomes too soft as you’re using it, just slip it into the freezer for a few minutes so that it firms up again.",
    "Bake cookies until golden at edges, rotating trays as needed, about 8 to 9 minutes. Cool on baking sheets for 5 minutes before transferring to a wire rack to finish cooling. Repeat with remaining dough; you can re-chill and re-roll cookie scraps.",
    "If powdering the linzer lids, arrange the ring-shaped cookies (the ones you removed the centers of) on a baking rack with a tray or paper underneath to catch the mess. Sprinkle with powdered sugar. ",
    "Spread each of the cookie bases with about 1 teaspoon chocolate-hazelnut spread. Fit a ring-shaped lid on each. Cookies will keep at room temperature in an airtight container for several days, or so I’ve heard.",
    "To toast your hazelnuts: Hazelnuts can be toasted on a baking sheet in the oven at 350°F for 10 minutes, but don’t take them out just yet. I like to toast them until they’re all the color of milky coffee under their loose skins, and roll them around on the tray every few minutes to make sure they’re toasting evenly. This can take an extra 1, 2, or even 5 minutes, and you should check on them frequently, so don’t go far from the oven after the 10 minute mark. Well-toasted hazelnuts don’t just taste better, with a deeper nutty flavor, but their skins come off more easily. (I even toast already-toasted hazelnuts from Trader Joe’s, as they’re never as golden as I want them.) There are two methods to skin hazelnuts, everyone else’s (rub them with a towel while they’re warm, getting off all the skins that you can) and mine (let them cool until you can hold them, and roll them around, a fistful at a time, in your dry hands, letting the skins fall back on the baking sheet; I do it this way because the towel method always leaves me with hazelnut flakes all over my kitchen when I go to shake it out/bring it to the hamper). Both work. "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/12344452563_694b210772_k.jpg?w=750",
  "ingredient_list": [
    "1 cup (140 grams) toasted hazelnuts (see directions below)",
    "2 cups (250 grams) all-purpose flour",
    "3/4 teaspoon baking powder",
    "1/2 teaspoon table salt",
    "2 sticks (1 cup or 225 grams) unsalted butter, at room temperature",
    "3/4 cup (145 grams) packed light or dark brown sugar",
    "1/2 cup (100 grams) granulated sugar",
    "2 large egg yolks, at room temperature",
    "1 teaspoon (5 ml) vanilla extract",
    "1/2 cup (150 grams) chocolate-hazelnut spread, such as Nutella"
  ],
  "tags": [
    "Chocolate",
    "Cookie",
    "Photo"
  ],
  "title": "chocolate hazelnut linzer hearts",
  "url": "https://smittenkitchen.com/2014/02/chocolate-hazelnut-linzer-hearts/"
}