{
  "date": "2008-11-29T23:56:21+00:00",
  "directions": [
    "Bake chocolate tart until filling puffs slightly at edges and center is softly set, about 30 minutes. Transfer to rack. Cool tart in pan 20 minutes. Gently remove tart pan sides and cool tart completely.",
    "Cut tart into thin wedges and serve with softly whipped cream. I’d keep it unsweetened, but that’s just personal taste.",
    "Do ahead: Chocolate tart can be made 1 day ahead. Cover tart and refrigerate. Bring to room temperature before serving."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2008/11/dark-chocolate-tart-with-gingersnap-crust.jpg?w=753",
  "ingredient_list": [
    "Crust:",
    "8 ounces gingersnap cookies (about 32 cookies), coarsely broken",
    "1/4 cup (1/2 stick) salted butter, melted",
    "Filling:",
    "12 ounces bittersweet chocolate, finely chopped",
    "1 cup heavy whipping cream",
    "2 large egg yolks",
    "1 large egg",
    "1/4 cup sugar",
    "1 tablespoon all purpose flour",
    "1/8 teaspoon freshly ground black pepper",
    "Pinch of salt",
    "1/4 teaspoon cinnamon",
    "For crust:",
    "Preheat oven to 325°F. Finely grind gingersnap cookies in processor (yielding 1 1/2 to 1 2/3 cups). Add melted butter and process until moistened. Press crumb mixture firmly onto bottom and up sides of 9-inch-diameter tart pan with removable bottom. Place pan on rimmed baking sheet.",
    "For filling:",
    "Combine finely chopped bittersweet chocolate and heavy whipping cream in heavy medium saucepan. Whisk over low heat until chocolate is melted and smooth. Remove saucepan from heat. Whisk egg yolks, egg, sugar, flour, ground black pepper, salt and cinnamon in medium bowl to blend. Very gradually whisk chocolate mixture into egg mixture until smooth and blended. Pour chocolate filling into crust."
  ],
  "tags": [
    "Chocolate",
    "Photo",
    "Tarts/Pies"
  ],
  "title": "dark chocolate tart with gingersnap crust",
  "url": "https://smittenkitchen.com/2008/11/dark-chocolate-tart-with-gingersnap-crust/"
}