{
  "date": "2011-06-02T13:26:35+00:00",
  "directions": [
    "In the bottom of a medium saucepan over very low heat, gently melt the chocolate chips, stirring constantly until smooth. Stir in sugar, cornstarch, cocoa powder, milk and salt and raise heat to medium. Cook mixture, stirring frequently until it thickens, anywhere between 5 minutes (for me) and 10 (suggested in the book). Remove from heat, add vanilla and butter and stir until combined.",
    "Set aside to cool slightly then pour into popsicle molds. Freeze 30 minutes, then insert popsicle sticks. Freeze the rest of the way before serving.",
    "* I’ll jump ahead of the question someone usually asks and tell you that I bought popsicle molds intended for feeding babies. I liked that they were tiny as I was pretty sure my one year-old doesn’t need to be eating an adult-sized popsicle this summer. Nor do I need to be washing it out of his clothes. :) The popsicle maker works just fine, but because it’s in one piece, it’s best to unmold them all together (dipping the base in warm water). From there, you can spread them out on a tray in the freezer until they firm up again, then store them in a freezer bag for the long term. I didn’t use the sticks they provide; I remember from my own childhood that they get all chewed up and easily lost when you are sent outside with your drippy sticky treat. I instead bought disposable popsicle sticks, though I’m sure they’re even cheaper from a crafts store."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/06/fudge-popsicles.jpg?w=750",
  "ingredient_list": [
    "2 tablespoons (21 grams or 3/4 ounce) semisweet chocolate chips or chopped semisweet chocolate",
    "1/3 cup (67 grams or 2 1/3 ounce) sugar",
    "1 tablespoon (7 grams or 1/4 ounce) cornstarch",
    "1 1/2 tablespoons (8 grams or 1/4 ounce) unsweetened cocoa powder",
    "1 1/4 cups (300 ml) whole milk",
    "Pinch of salt",
    "1/2 teaspoon (3 ml) vanilla extract",
    "1/2 tablespoon (7 grams or 1/4 ounce) unsalted butter"
  ],
  "tags": [
    "Chocolate",
    "Photo",
    "Popsicles",
    "Summer"
  ],
  "title": "fudge popsicles",
  "url": "https://smittenkitchen.com/2011/06/fudge-popsicles/"
}