{
  "date": "2011-04-20T07:10:47+00:00",
  "directions": [
    "Preheat oven to 350°F. Butter or oil a 10-by-15-inch shallow baking or jellyroll pan. Line the bottom lengthwise with a piece of waxed or parchment paper that extends up the short sides one inch.",
    "Melt chocolate with water or coffee in a small saucepan over very low heat until it is 75 percent melted. Remove from heat and stir until the remaining chocolate is smooth. Set aside to cool slightly.",
    "Beat egg yolks with an electric mixer until pale and creamy. Add sugar gradually, and continue to beat until yolks are pale and ribbony. Gently stir the chocolate into the yolk mixture.",
    "In a clean bowl with clean beaters, beat egg whites with salt until they hold stiff peaks. Stir 1/4 of egg white mixture into the chocolate-yolk mixture to lighten it. Fold the remaining whites into the cake batter in three additions. Pour batter into prepared pan and smooth top. Bake in preheated oven for 15 minutes, or until cake layer feels dry (but very soft) to the touch and a toothpick inserted into the center comes out clean. It will still seem a little underbaked.",
    "Transfer to a cooling rack and cover the top with a light damp towel or two layers of damp paper towels for 10 minutes. Gently remove towels; don’t fuss if they have a bit of cake stuck to them. Run a knife around the edges of the cake. Sift one tablespoon cocoa over the top of the cake and cover the cake with a thin tea or flour sack towel [Updated, see Note above] that is a little longer than the pan. Place the back of a baking sheet or a large flat tray over the towel and invert the cake and paper onto it. Gently peel back the parchment or waxed paper that lined the pan. Sift the remaining tablespoon of cocoa powder over the top of the cake (that was, one minute ago, the underside). Using the towel underneath to help lift and roll the cake, roll the cake from short end to short end with the towel inside. Let cool completely, encased in its towel.",
    "Once cool, beat heavy cream with powdered sugar and vanilla until it holds stiff peaks. Get your serving plate ready and place it near your cake roll. Gently unroll chocolate cake and remove tea towel. [Try to get the tea towel to the hamper without touching anything, as it is saturated with smudgy cocoa and trust me, can mess up a white kitchen fast.] Spread whipped cream filling evenly over cake. Gently use waxed or parchment paper once again to reroll cake. Place on serving platter, seam side down.",
    "If you’re fancier than us, you can now garnish it with shaved white or dark chocolate or even a drizzle of each, melted; raspberries are pretty too. Serve immediately in 1-inch thick slices or refrigerate until needed. This cake is best to serve on the first day it is made. It’s still delicious after that, but the whipped cream filling does begin to deflate a little into the cake spiral. ",
    "About this cake’s origin/name: When I first wrote about this cake in 2007, I was unable to find the original New York Times article my mother had clipped the recipe from but after finding an almost exact match of my mother’s recipe in a 2001 Gourmet, attributed the name and cake to it. Now that The New York Times online archives are in better order, I was able to find the actual article my mother read on a June day the year before I was born promising that you couldn’t go wrong if you made this heavenly chocolate dessert on Father’s Day. In this version, there are a bunch of minor changes, such as using coffee instead of water with the chocolate, vanilla extract in stead of Grand Marnier, and much less of it, more whipped cream filling (which I find unnecessary) but less sweetener in it (which I preferred) and the option to roll the cake from the short end, which my family always does. I prefer most of these original nuances, as that’s the way my mother always made it, but give some hybrid suggestions above. Neither recipe origin recommends pre-rolling the cake with a towel, but I picked that tip up from various food blogs and find it essential in virtually eliminating cake cracks.",
    "Note: There’s a four-layered version of this cake in the archives.  "
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2011/04/heavenly-chocolate-cake-roll.jpg?w=750",
  "ingredient_list": [
    "Cake layer:",
    "6 ounces semisweet bittersweet chocolate, chopped or 1 cup semi- or bittersweet chocolate chips",
    "3 tablespoons water or strong coffee",
    "6 large eggs, at room temperature, separated",
    "2/3 cup sugar",
    "1/4 teaspoon table salt",
    "2 tablespoons unsweetened cocoa powder, divided",
    "Filling:",
    "1 cup heavy or whipping cream",
    "2 to 3 tablespoons powdered sugar (use more if you prefer a sweeter filling)",
    "1/2 teaspoon vanilla extract or 1 to 2 tablespoons liqueur of your choice, such as Grand Marnier"
  ],
  "tags": [
    "Cake",
    "Chocolate",
    "Gluten-Free",
    "Passover",
    "Photo"
  ],
  "title": "heavenly chocolate cake roll",
  "url": "https://smittenkitchen.com/2011/04/heavenly-chocolate-cake-roll/"
}