{
  "date": "2008-11-04T17:42:56+00:00",
  "directions": [
    "1. Sift flours, baking soda, baking powder and salt into a bowl. Set aside.",
    "2. Using a mixer fitted with paddle attachment, cream butter and sugars together until very light, about 5 minutes. Add eggs, one at a time, mixing well after each addition. Stir in the vanilla. Reduce speed to low, add dry ingredients and mix until just combined, 5 to 10 seconds. Drop chocolate pieces in and try to incorporate them without breaking them. Press plastic wrap against dough and refrigerate for 24 to 36 hours. [Dough may be used in batches, and can be refrigerated for up to 72 hours.]",
    "3. When ready to bake, preheat oven to 350 degrees. Line a baking sheet with parchment paper or a nonstick baking mat. Set aside.",
    "4. Scoop 6 3 1/2-ounce mounds of dough (the size of generous golf balls) onto baking sheet, making sure to turn horizontally any chocolate pieces that are poking up; it will make for a more attractive cookie. Sprinkle lightly with sea salt and bake until golden brown but still soft, 18 to 20 minutes. Transfer sheet to a wire rack for 10 minutes, then slip cookies onto another rack to cool a bit more. Repeat with remaining dough, or reserve dough, refrigerated, for baking remaining batches the next day. Eat warm, with a big napkin.",
    "* I found Valrhona’s fèves or oval-shaped chocolate pieces, at Whole Foods in half pounds. Baking discs can be found from a number of brands, from Jacques Torres to E. Guittard (Fresh Direct used to sell these by the quarter pound, but now just in one pound boxes, but still at a very reasonable price) to Ghiradelli. Can’t find them? Use the largest chocolate chips you can find. Ghiradelli sells some slighly larger ones in the brown bag (as opposed to the standard-sized chips in the gold bag) though I may have mixed the two varieties up. It wouldn’t be the first time."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/leites-connusmate-chocolate-chip-cookie1.jpg?w=500",
  "ingredient_list": [
    "2 cups minus 2 tablespoons",
    "(8 1/2 ounces) cake flour",
    "1 2/3 cups (8 1/2 ounces) bread flour",
    "1 1/4 teaspoons baking soda",
    "1 1/2 teaspoons baking powder",
    "1 1/2 teaspoons coarse salt",
    "2 1/2 sticks (1 1/4 cups) unsalted butter",
    "1 1/4 cups (10 ounces) light brown sugar",
    "1 cup plus 2 tablespoons (8 ounces) granulated sugar",
    "2 large eggs",
    "2 teaspoons natural vanilla extract",
    "1 1/4 pounds bittersweet chocolate disks or fèves, at least 60 percent cacao content",
    "Sea salt"
  ],
  "tags": [
    "Chocolate",
    "Cookie",
    "Photo"
  ],
  "title": "leite’s consummate chocolate chip cookie",
  "url": "https://smittenkitchen.com/2008/11/leites-connusmate-chocolate-chip-cookie/"
}