{
  "date": "2014-01-16T12:28:22+00:00",
  "directions": [
    "Heat oven to 425°F. Butter a standard 12-cup muffin tin or line it with papers.*",
    "Peel (if you so desire, can be skipped) pears, then halve and core them. Grate pears on the large holes of a boxed grater into a large bowl. You should have about 1 cup grated (although I ended up with 1 1/2, opting to meet the recipe halfway and used 1 1/4 cups). Stir in melted butter, sugar, buttermilk, eggs and vanilla until combined.",
    "In a separate bowl, stir together the oats, flours, baking soda, baking powder, spices, salt, all but 1/2 cup coarsely chopped hazelnuts, and chocolate chunks, if you’re feeling extra indulgent. Gently fold this dry ingredient mixture into the wet batter until just combined; do not overmix.",
    "Fill muffin cups almost up to the top and sprinkle with the reserved 1/2 cup hazelnuts. Place muffins in oven and immediately reduce the heat to 375°F. Bake for 20 to 25 minutes, or until the tops are golden brown and a toothpick inserted into the center of muffins comes out batter-free.  ",
    "Cool muffins in pans for 10 minutes, then transfer to a cooling rack. Muffins will keep for 2 days at room temperature in an airtight container.",
    "* Unsolicited plug: Just bought these for the first time, which were wonderful at keeping the muffins from sticking to the paper."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2014/01/pear-and-hazelnut-muffins.jpg?w=750",
  "ingredient_list": [
    "2 small-medium firm pears",
    "6 tablespoons (85 grams) unsalted butter, melted and cooled slightly (plus more for cups)",
    "2/3 cup (125 grams) natural cane sugar, such as Turbinado, light brown or granulated sugar",
    "1 cup (240 ml) buttermilk",
    "2 large eggs, lightly beaten",
    "1 to 1 1/2 teaspoons vanilla extract",
    "3/4 cup (75 grams) rolled oats",
    "1 cup (125 grams) all-purpose flour",
    "1/2 cup (60 grams) whole wheat flour",
    "3/4 teaspoon baking soda",
    "2 teaspoons baking powder",
    "1/2 teaspoon ground cardamom, which I replaced with 1/4 teaspoon cinnamon",
    "1/2 teaspoon ground nutmeg, which I replaced with 1/4 teaspoon freshly grated",
    "3/4 teaspoon kosher salt",
    "1 cup (120 grams) toasted hazelnuts, coarsely chopped",
    "1/2 cup (85 grams) bittersweet chocolate chunks (optional)"
  ],
  "tags": [
    "Breakfast",
    "Chocolate",
    "Muffin/Quick Bread",
    "Pear",
    "Photo"
  ],
  "title": "pear and hazelnut muffins",
  "url": "https://smittenkitchen.com/2014/01/pear-and-hazelnut-muffins/"
}