{
  "date": "2009-05-01T11:29:38+00:00",
  "directions": [
    "Make the dough: Mix the milk, vegetable oil and 1/2 cup sugar in a large pot, and heat it until just before it boils. Turn off the heat, remove the pot from the burner, and let it cool for 45 minutes to one hour. When the mixture is lukewarm, sprinkle in the yeast and let it sit for a minute or two before adding the four cups of flour. Stir the mixture together, cover the pot and let it sit for at least an hour. After an hour the dough should be a giant, puffy but still pretty wet. Add another 1/2 cup of flour, the baking powder, baking soda and salt and stir the mixture together. Either use it right away, or cover the dough and put it in the fridge until you’re ready to use it — overnight or up to a day or two. If it starts to overflow in the pot, press it down.",
    "Roll out the dough: Generously flour a large counter — the dough is very wet and sticky. Dump half the dough onto it, flour your rolling pin well, and roll the dough into a large rectangle about 24 inches wide and as thin as you get it in the other direction (ours ended up about 12 inches deep).",
    "Fill the rolls: Generously spray two 12-cup muffin tins with a cooking spray, or butter them well. Go ahead and spray the flat part too, so if your jam bubbles out of the buns, it will be easier to scrub off. (This is what years of a dishwasher-less experience will teach you!)",
    "Stir together the 1/3 cup sugar, brown sugar and cinnamon and set it aside. Spread one half of your jam evenly over the dough, leaving a 1/2-inch margin at the wider ends. (If your jam is cold from the fridge, you can heat it slightly in a small saucepan or in the microwave, not until bubbling hot but until warm enough to easily spread.)",
    "Drizzle three tablespoons melted butter over the jam layer. (Although it would be intuitive to do it in the other order, I was concerned that the jam wouldn’t spread well over the slick melted butter. Plus, I wanted the melted butter to mingle with the cinnamon sugar, as it would in a traditional cinnamon roll. Drooling yet?)",
    "Sprinkle the jam and butter layer with 1/4 cup of the cinnamon-sugar mixture, then half of the nuts, half the chocolate and half the dried fruit.",
    "Starting with the wider side of the rectangle (the one that should be 24 inches), begin to tightly roll the dough, incorporating the filling. Once it is fully rolled up, cut it into two-inch segments with a sharp knife (a serrated knife works great here). Place one in each muffin cup. Sprinkle the tops of the rolls with a tablespoon of the cinnamon-sugar mixture and set the tin aside to puff some more, about 20 to 30 minutes. (You could loosely cover it with plastic wrap, but we didn’t bother.)",
    "Repeat this process with the other half of the dough, and the remaining filling ingredients.",
    "Preheat your oven to 350°F.",
    "Bake the rolls: Bake your rolls for 15 to 20 minutes, until they’re golden at the edges and the filling looks bubbly. (I was using a convection oven at the Lodge, which is nothing like my oven at home so your baking time may vary. Look for a nice color and that bubbling filling before you take them out.)",
    "Let the rolls mostly cool on a rack.",
    "Make the glaze: Beat the butter, cream cheese, powdered sugar and vanilla together in a bowl with an electric mixture until fluffy. From here, you can either spread this frosting on your lukewarm buns, or thin it with milk until it is more of a drizzling consistency. Eat one at once."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/ranch-rugelach1.jpg?w=500",
  "ingredient_list": [
    "Dough",
    "2 cups whole milk",
    "1/2 cup vegetable oil (I haven’t tried this with melted butter instead, but if you do, let us know how it goes)",
    "1/2 cup sugar",
    "1 package (2 1/4 teaspoons) active dry yeast",
    "4 1/2 cups all-purpose flour plus plenty of extra for flouring the surface",
    "1/2 heaping (slightly more) teaspoon baking powder",
    "1/2 scant (slightly less) teaspoon baking soda",
    "1/2 teaspoon salt",
    "Filling",
    "1/3 cup sugar",
    "1/3 cup light or dark brown sugar",
    "2 teaspoons cinnamon",
    "1 cup jelly or jam (raspberry and/or apricot are traditional, but anything you like will work), divided",
    "6 tablespoons salted butter melted (or unsalted, with a pinch of salt in it), divided",
    "1 cup finely chopped walnuts or pecans (although there’s no reason you can’t use any other nut you prefer), divided",
    "2/3 cup finely chopped semisweet chocolate or miniature chocolate chips, divided (optional, but use slightly more dried fruit if you’re omitting this)",
    "2/3 cup dried currants or chopped dark raisins, divided",
    "Glaze",
    "3 tablespoons butter, softened",
    "3 ounces cream cheese, at room temperature",
    "3/4 cup powdered sugar",
    "1/2 teaspoon vanilla extract",
    "1/4 cup milk, approximately"
  ],
  "tags": [
    "Breakfast",
    "Brunch",
    "Chocolate",
    "Photo"
  ],
  "title": "ranch rugelach",
  "url": "https://smittenkitchen.com/2009/05/ranch-rugelach/"
}