{
  "date": "2008-06-02T12:25:14+00:00",
  "directions": [
    "Special equipment: a candy thermometer",
    "Make graham cracker crust: Put oven rack in middle position and preheat oven to 350°F. Lightly butter pie 9- to 9 1/2-inch pie plate. Stir together all ingredients in a bowl and press evenly on bottom and up side of pie plate. Bake until crisp, 12 to 15 minutes, then cool on a rack to room temperature, about 45 minutes.",
    "Make chocolate cream filling: Put oven rack in middle position and preheat oven to 350°F. Put chocolate in a large bowl. Bring cream just to a boil in a 1- to 1 1/2-quart heavy saucepan, then pour hot cream over chocolate. Let stand 1 minute, then gently whisk until chocolate is melted and mixture is smooth. Gently whisk in egg and a pinch of salt until combined and pour into graham cracker crumb crust (crust will be about half full).",
    "Cover edge of pie with a pie shield or foil and bake until filling is softly set and trembles slightly in center when gently shaken, about 25 minutes. Cool pie to room temperature on a rack (filling will firm as it cools), about 1 hour.",
    "Make marshmallow topping: Sprinkle gelatin over 1/4 cup cold water in a large deep heatproof bowl and let stand until softened, about 1 minute.",
    "Stir together sugar, corn syrup, a pinch of salt, and remaining 1/4 cup water in cleaned 1- to 1 1/4-quart heavy saucepan. Bring to a boil over moderate heat, stirring until sugar is dissolved, then boil until thermometer registers 260°F, about 6 minutes.",
    "Begin beating water and gelatin mixture with an electric mixer at medium speed, then carefully pour in hot syrup in a slow stream, beating (avoid beaters and side of bowl). When all of syrup is added, increase speed to high and continue beating until mixture is tripled in volume and very thick, about 5 minutes. Add vanilla and beat until combined, then immediately spoon topping onto center of pie filling; it will slowly spread to cover top of pie. Chill, uncovered, 1 hour, then cover loosely with lightly oiled plastic wrap (oiled side down) and chill 3 hours more.",
    "Brown topping: Preheat broiler. Transfer pie to a baking sheet. Cover edge of pie with pie shield or foil and broil 3 to 4 inches from heat, rotating pie as necessary, until marshmallow topping is golden brown, about 3 minutes. Cool pie on a rack 10 minutes. Slice pie with a large heavy knife dipped in hot water and then dried with a towel before cutting each slice.",
    "[Alternately: I browned the topping with a creme brulee torch. It took some time and didn’t get as brown as I think it would have under the broiler (the pie was still cold, and hard to heat up with a small flame) but it does work in a pinch, or when you’re away from the oven.]",
    "Note: Pie (before browning topping) can be chilled up to 1 day."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/smore-pie1.jpg?w=500",
  "ingredient_list": [
    "For crust",
    "5 tablespoons salted or unsalted butter, melted, plus additional for greasing",
    "1 1/2 cups cookie crumbs (10 graham crackers or 24 small gingersnaps; about 6 oz, pulsed in a food processor until finely ground)",
    "2 tablespoons sugar",
    "1/8 teaspoon salt (omitted if you use salted butter)",
    "For chocolate cream filling",
    "7 oz fine-quality bittersweet chocolate (not more than 70% cacao; not unsweetened), finely chopped",
    "1 cup heavy cream",
    "1 large egg, at room temperature for 30 minutes",
    "For marshmallow topping",
    "1 teaspoon unflavored gelatin (from a 1/4-oz package)",
    "1/2 cup cold water",
    "3/4 cup sugar",
    "1/4 cup light corn syrup",
    "1/2 teaspoon vanilla",
    "Vegetable oil for greasing"
  ],
  "tags": [
    "Chocolate",
    "Photo",
    "Tarts/Pies"
  ],
  "title": "s’more pie",
  "url": "https://smittenkitchen.com/2008/06/smore-pie/"
}