{
  "date": "2016-06-03T11:34:27+00:00",
  "directions": [
    "\nWith a hand or stand mixer, cream the butter and sugars together until light, fluffy and then some, about 3 to 4 minutes. Add eggs, one at a time, and mix to combine. Add vanilla, mix, then scrape down bowl. Sprinkle baking soda, baking powder and salt over dough and mix it until fully combined. Add flour all at once and mix it in short bursts until it almost completely disappears, but no longer. You don’t want to overmix it. Add chocolate pieces in and try to incorporate them without breaking them. Cover bowl with plastic wrap and chill in fridge for a minimum of 24 hours and up to 72 hours, although I have totally had it in there up to 5 days are we’re all just fine.\nHeat oven to 350 degrees and line a couple large baking sheets with parchment paper or nonstick baking mats. Form dough into 3 1/2-ounce (100 gram) balls, which will seem completely absurd (they’re larger than golf balls, closer to skeeballs) but don’t fight it. If any chocolate pieces are right across the tops or sides of the balls of dough, try to bury them back in it. I find pockets of chocolate superior to exposed puddles of them. Arrange balls of dough very far apart on sheets (these cookies will be up to 5 inches wide once baked) and sprinkle the tops of each with a few flecks of sea salt.\nBake cookies for 12 to 17 minutes, until golden all over. This is a large range because I find that they range in how much they spread thus checking in at the early on on your first batch is safest.",
    "Cool cookies on trays for 10 minutes, then transfer them to racks."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2016/06/the-consummate-chocolate-chip-cookie-revisited1.jpg?w=750",
  "ingredient_list": [
    "1 1/4 cups (10 ounces, 280 grams or 2 1/2 sticks) unsalted butter, at room temperature",
    "1 1/4 cups (240 grams) light brown sugar",
    "1 cup plus 2 tablespoons (225 grams) granulated sugar",
    "2 large eggs",
    "2 teaspoons (10 ml) vanilla extract",
    "1 1/4 teaspoons baking soda",
    "1 1/2 teaspoons baking powder",
    "1 1/2 teaspoons coarse or kosher salt",
    "3 1/2 cups plus 2 teaspoons (yes, really) (445 grams) all-purpose flour",
    "1 1/4 pounds (565 grams) bittersweet chocolate disks or fèves, at least 60%",
    "Sea salt"
  ],
  "tags": [
    "Chocolate",
    "Cookie",
    "Photo"
  ],
  "title": "the consummate chocolate chip cookie, revisited",
  "url": "https://smittenkitchen.com/2016/06/the-consummate-chocolate-chip-cookie-revisited/"
}