{
  "date": "2013-05-29T10:56:52+00:00",
  "directions": [
    "Cook the potatoes: Place the potatoes in a large pot and cover with an inch or two over water. Add 1 tablespoon salt and bring to a boil. Lower the heat and simmer for 15 to 25 minutes, depending on the size of the potatoes, until just tender. (A bamboo skewer is ideal to test them.) Drain in a colander, and let potatoes cool for 5 minutes. Cut potatoes into quarters or halves (or fingerlings into 1/2- to 1-inch segments) and place them in a large bowl.",
    "Make the vinaigrette: Whisk together the vinegar, mustard, garlic, egg yolk, 1 teaspoon salt, and many grinds of black pepper (Ina recommends you use a full teaspoon of pepper). Whisking constantly and vigorously, pour the oil in in a thin drizzle, ideally making an emulsion. Stir in the wine (if using) and capers. ",
    "Assemble the salad: While the potatoes are still very warm, pour half the vinaigrette on the potatoes and toss them gently, allowing them to soak up the vinaigrette. Stir in the scallions, celery, red onion, lobster, and add enough vinaigrette to moisten. Reserve any remaining vinaigrette for later. Add the zest and juice of the lemon, the tarragon or parsley, and more salt and pepper to taste (Ina calls for another 2 teaspoons salt and 1 teaspoon pepper, but this felt like overkill). Cover with plastic wrap and refrigerate for at least an hour to allow flavors to blend. Taste for seasonings and add more vinaigrette, if necessary. ",
    "Serve: This salad is especially good served closer to room temperature. Don’t forget to share."
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2013/05/lobster-and-potato-salad.jpg?w=750",
  "ingredient_list": [
    "1 1/2 pounds unpeeled small Yukon gold (Ina’s suggestion) or fingerling (what I used) potatoes",
    "Coarse, kosher or sea salt",
    "3 tablespoons Champagne or white wine vinegar",
    "1/2 teaspoon Dijon mustard",
    "1/2 teaspoon minced or pressed garlic",
    "1 large or extra-large egg yolk, ideally at room temperature",
    "Freshly ground black pepper",
    "1/2 cup olive oil",
    "1/4 cup dry white wine (you can skip this, or use less, with little harm; I used 1 tablespoon vermouth instead)",
    "3 tablespoons drained capers (I imagine minced cornichons would be a good alternative)",
    "6 scallions, thinly sliced (yielding about 1 cup)",
    "2 medium stalks celery, diced small (about 1/4 inch) (yielding about 1/2 cup)",
    "1/2 cup finely diced red onion",
    "1 1/2 pounds cooked lobster meat, cooked and cooled, in a 1-inch dice (from about 7 to 8 pounds fresh lobster; see post above for better budgeted suggestions)",
    "1 lemon",
    "3 tablespoons coarsely chopped fresh tarragon (Ina’s suggestion) or flat-leaf parsley (what we used)"
  ],
  "tags": [
    "Photo",
    "Picnics",
    "Potatoes",
    "Salad",
    "Seafood",
    "Summer"
  ],
  "title": "lobster and potato salad",
  "url": "https://smittenkitchen.com/2013/05/lobster-and-potato-salad/"
}