[
    {
        "ingredient_list": [
            "3/4 cup (95 grams) all-purpose flour", 
            "1/2 teaspoon double-acting baking powder", 
            "2 large eggs, at room temperature", 
            "1/2 cup (100 grams) sugar", 
            "Grated zest of 1 lemon", 
            "2 teaspoons vanilla extract", 
            "5 tablespoons (2 1/2 ounces; 70 grams) unsalted butter, melted and cooled"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/460-words-and-no-mention-of-proust-oh-wait1.jpg?w=500", 
        "tags": [
            "Cake", 
            "French", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2007/07/460-words-and-no-mention-of-proust-oh-wait/", 
        "title": "classic madeleines", 
        "directions": [
            "Sift together the flour and baking powder and keep close at hand. Working in a mixer fit with the whisk attachment, beat the eggs and sugar together on medium-high speed until they thicken and lighten in color, 2 to 4 minutes. Beat in the lemon zest and vanilla. Switch to a large rubber spatula and gently fold in the dry ingredients, followed by the melted butter. Cover the batter with plastic wrap, pressing the wrap against the surface to create an airtight seal, and chill for at least 3 hours, perhaps longer–chilling helps the batter develop its characteristic crown, known as the hump or the bump. (The batter can be kept tightly covered in the refrigerator for up to 2 days.)", 
            "Center a rack in the oven and preheat the oven to 400 degrees F (200 degrees C). If your Madeleine pan is not nonstick, generously butter it, dust the insides with flour and tap out the excess. If the pan is nonstick, you still might want to give it an insurance coating of butter and flour. If it is silicone, do nothing. No matter what kind of pan you have, place it on a baking sheet for easy transportability. ", 
            "Divide the batter among the molds, filling them almost to the top. Don’t worry about smoothing the batter, it will even out as it bakes. ", 
            "Bake large madeleines for 11 to 13 minutes, small ones for 8 to 10 minutes, or until the cookies are puffed and golden and spring back when touched. Pull the pan from the oven and remove the cookies by either rapping the pan against the counter (the madeleines should drop out) or gently running a butter knife around the edges of the cookies. Allow the madeleines to cool on a cooling rack. They can be served ever so slightly warm or at room temperature. "
        ], 
        "date": "2007-07-01T13:21:57+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/anything-but-clementine-clafoutis1.jpg?w=500", 
        "tags": [
            "Disasters", 
            "French", 
            "Fruit", 
            "Orange", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2008/01/anything-but-clementine-clafoutis/", 
        "title": "anything-but-clementine clafoutis", 
        "directions": [
            "1. Heat oven to 350 degrees. Prepare a gratin dish, about 9 by 5 by 2 inches, or a 10-inch round deep pie plate or porcelain dish, by smearing it with butter, just a teaspoon or so. Dust it with flour, rotating pan so flour sticks to all the butter; invert dish to get rid of excess.", 
            "2. In a large bowl, whisk eggs until frothy. Add 1/2 cup flour, and whisk until smooth. Add granulated sugar and salt and whisk until combined. Add cream and milk and whisk until smooth.", 
            "3. Layer fruit over bottom of the dish. Pour batter over fruit to as close to top of dish as you dare; you may have a little leftover batter, depending on size of your dish. Bake for about 40 minutes, or until clafoutis is nicely browned on top and a knife inserted into it comes out clean. Sift some powdered sugar over it and serve warm or at room temperature. Clafoutis does not keep (not sure I agree with this); serve within a couple of hours of making it."
        ], 
        "date": "2008-01-22T14:15:22+00:00"
    }, 
    {
        "ingredient_list": [
            "6 medium apples (I had the most success with Golden Delicious and Granny Smiths)", 
            "Juice of half a lemon", 
            "6 tablespoons (3 ounces or 85 grams) butter", 
            "1 1/3 cup (266 grams) sugar, divided", 
            "Puffed pastry, chilled", 
            "A 9-inch ovenproof skillet, heavy enough that you fear dropping it on your toes"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apple-tarte-tatin-anew1.jpg?w=500", 
        "tags": [
            "Apple", 
            "French", 
            "Photo", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2011/04/apple-tarte-tatin-anew/", 
        "title": "apple tarte tatin, anew", 
        "directions": [
            "Peel apples, halve and core apples. Once cored, cut lengthwise into quarters (i.e. four pieces per apple) and cut a bevel along their inner edge, which will help their curved exteriors stay on top as they rest on this edge. (You can see this beveled edge here.) Toss apple chunks with the lemon juice and 1/3 cup of the sugar. Set aside for 15 minutes; this will help release the apple’s juices, too much of them and the caramel doesn’t thicken enough to cling merrily to the cooked apples.", 
            "Melt butter in your skillet over medium heat. Sprinkle in remaining 1 cup sugar and whisk it over the heat until it becomes the palest of caramels. Off the heat, add the apples to the skillet, arranging them rounded sides down in one layer. Lay any additional apple wedges rounded sides down in a second layer, starting from the center.", 
            "Return the pan to the stove and cook in the caramel for another 20 to 25 minutes over moderately high heat. With a spoon, regularly press down on the apples and baste them caramel juices from the pan. If it seems that your apples in the center are cooking faster, swap them with ones that are cooking more slowly, and rotate apples that are cooking unevenly 180 degrees. The apples will shrink a bit and by the end of the cooking time, your second layer of apples might end up slipping into the first — this is fine.", 
            "Preheat oven to 400. Roll out your puffed pastry to a 9-inch circle and trim if needed. Cut four vents in pastry. Remove skillet from heat again, and arrange pastry round over apples. Tuck it in around the apples for nicer edges later.  Bake until the pastry is puffed and golden brown, about 20 minutes.", 
            "Once baked, use potholders to place a plate or serving dish (larger in diameter than the pan, learn from my messes!) over the pasty and with a deep breath and a quick prayer, if you’re into that kind of thing, unmold the pastry and apples at once onto the plate. If any apples stubbornly remain behind in the pan, nudge them out with a spatula.", 
            "Serve with a dollop of whipped crème fraîche, or lightly sweetened whipped cream and eat immediately.", 
            "* My favorite, by miles, though not exactly budget-minded, is from Dufour. It tastes like something straight out of a Paris pastry shop. "
        ], 
        "date": "2011-04-05T16:32:29+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/cabbage-and-sausage-casserole1.jpg?w=640", 
        "tags": [
            "Cabbage", 
            "Casserole", 
            "French", 
            "Meat", 
            "Photo", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2016/01/cabbage-and-sausage-casserole/", 
        "title": "cabbage and sausage casserole", 
        "directions": [
            "Heat oven to 300 degrees. Bring a large pot of salted water to a boil and butter a 9-by-13-by-2-inch baking dish. If using sausages, remove casings and discard them.", 
            "Place cabbage in boiling water, cover, and let water come back to the boil. Uncover and boil for 3 minutes. Drain cabbage in a colander and run cold water over it to stop cooking. Drain well. ", 
            "Put about 1/3 of the cabbage in buttered dish and cover with 1/2 the meat. Sprinkle with salt and pepper and dot with butter. Repeat, ending with a final layer of cabbage, and dot top with butter.", 
            "Cover dish tightly with a layer of parchment paper (commenters who skipped the parchment said that their vegetables discolored against the foil), then top with a lid or a layer of aluminum foil. Cook for about 2 1/2 hours, until cabbage is soft and sweet, and top is lightly browned. After 2 hours, uncover the dish; if there is a lot of liquid in the bottom, leave uncovered for the rest of the cooking time. If not, re-cover and finish cooking. In our case, there was not a lot of liquid but I hoped to get a little color on the top so left it uncovered for the remaining time."
        ], 
        "date": "2016-01-19T12:03:35+00:00"
    }, 
    {
        "ingredient_list": [
            "3 large eggs", 
            "1/2 cup (100 grams) sugar", 
            "6 tablespoons (85 grams) unsalted butter, melted and cooled slightly, plus more to butter dish", 
            "1 cup (130 grams)  all-purpose flour", 
            "A couple pinches of salt", 
            "1 cup (235 ml) milk", 
            "1/2 teaspoon almond extract", 
            "2 teaspoons brandy or rum (optional)", 
            "2 generous (245 grams) cups sweet cherries, pitted if you wish"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2007/07/cherry-clafoutis.jpg?w=750", 
        "tags": [
            "Cherries", 
            "French", 
            "Fruit", 
            "Photo", 
            "Summer"
        ], 
        "url": "https://smittenkitchen.com/2007/07/cherry-clafoutis/", 
        "title": "cherry clafoutis", 
        "directions": [
            "Heat oven to 400F. Beat the sugar and eggs together with a whisk until they lighter in color. Gradually add butter, beating to incorporate. Add the flour and salt all at once and whisk until the batter is a homogeneous mixture. Next slowly pour in the milk a little at a time. Add the extract, and brandy or rum if you are using it, mixing well. The batter should be very smooth and shiny.\nPlace the cherries in a buttered glass or earthenware baking dish, cake pan (9 or 10 inches in diameter) or skillet that can go in the oven. (I use a 9-inch cake pan.) Pour the batter over the fruit. Bake 25 to 30 minutes, until slightly browned and almost completely set in the middle. Let sit at least 15 minutes before serving in wedges. I like it dusted with powdered sugar.", 
            ""
        ], 
        "date": "2007-07-20T12:37:46+00:00"
    }, 
    {
        "ingredient_list": [
            "1/4 pound salt pork, pancetta or bacon, diced", 
            "1 large onion, finely diced", 
            "3 shallots, chopped", 
            "4 tablespoons butter, as needed", 
            "2 pounds beef chuck, in 1-inch cubes", 
            "2 tablespoons flour", 
            "Salt and freshly ground black pepper", 
            "1/2 cup Cognac (see Note)", 
            "2 cups unsalted beef stock", 
            "1/2 cup smooth Dijon mustard", 
            "4 tablespoons coarse Dijon or Pommery mustard (see Note)", 
            "4 medium carrots, peeled and cut into half-moon slices", 
            "1/2 pound mushrooms, stemmed, cleaned and quartered", 
            "1/4 cup red wine (see Note)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/02/dijon-and-cognac-beef-stew.jpg?w=750", 
        "tags": [
            "Beef", 
            "Date Night", 
            "French", 
            "Photo", 
            "Stew", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2014/02/dijon-and-cognac-beef-stew/", 
        "title": "dijon and cognac beef stew", 
        "directions": [
            "Place salt pork in a Dutch oven or a large heavy kettle over low heat, and cook until fat is rendered. Remove solid pieces with a slotted spoon, and save for another use, like your salad, vegetables or, uh, snacking. Raise heat to medium-low, and add onion and shallots. Cook until softened but not browned, about 10 to 15 minutes. Use a slotted spoon to transfer to a large bowl.", 
            "If necessary, add 2 tablespoons butter to the pan to augment fat. Dust beef cubes with flour, and season lightly with salt and more generously with pepper. Shake off excess flour, and place half the cubes in the pan. Cook over medium-high heat until well browned, almost crusty, on all sides, then transfer to a bowl with onions. Repeat with remaining beef.", 
            "Add Cognac to the empty pan, and cook, stirring, until the bottom is deglazed and any crusted-on bits come loose. Add stock, smooth Dijon mustard and 1 tablespoon coarse or Pommery mustard. Whisk to blend, then return meat and onion mixture to pan. Lower heat, cover pan partway, and simmer gently until meat is very tender, about 1 1/4 hours.", 
            "Add carrots, and continue simmering for 40 minutes, or until slices are tender. As they cook, heat 2 tablespoons butter in medium skillet over medium-high heat, and sauté mushrooms until browned and tender. Stir mushrooms into stew along with remaining mustard and red wine. Simmer 5 minutes, then taste, and adjust seasoning. Serve hot."
        ], 
        "date": "2014-02-24T12:16:34+00:00"
    }, 
    {
        "ingredient_list": [
            "Filling", 
            "1/2 cup sundried tomatoes in oil, drained", 
            "1/3 cup pitted kalamata olives", 
            "1 teaspoon dried oregano or 2 teaspoons chopped fresh oregano leaves; thyme and rosemary would work too", 
            "1 large garlic clove, peeled", 
            "1 tablespoon olive oil or reserved oil from tomatoes, plus more to loosen if needed", 
            "Salt and freshly ground black pepper or red pepper flakes to taste", 
            "Assembly", 
            "2 packages puffed pastry (leave in fridge overnight to thaw)", 
            "1 egg yolk beaten with 1 teaspoon water (for egg wash)", 
            "1 tablespoon sesame or poppy seeds to sprinkle (optional)", 
            "Dip", 
            "6 ounces feta, crumbled", 
            "2 ounces cream cheese, cold is fine", 
            "1/3 cup olive oil", 
            "2 tablespoons lemon juice", 
            "Coarse or kosher salt, to taste (changed from 1/2 teaspoon, which could be overkill if your feta is very salty)", 
            "Freshly ground black pepper"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/12/feta-tapenade-tarte-soleil1.jpg?w=640", 
        "tags": [
            "Appetizers + Party Snacks", 
            "French", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2015/12/feta-tapenade-tarte-soleil/", 
        "title": "feta tapenade tarte soleil", 
        "directions": [
            "Make the filling: Blend ingredients in a food processor until finely chopped and spreadable. Mixture will be thick. You can thin it with more olive oil if needed, but no need to make this thin like a sauce. Adjust seasonings to taste. Set aside.", 
            "Heat oven to 350 degrees. ", 
            "Assemble the tart: Roll first package puffed pastry flat on a large piece of parchment paper or reusable baking mat into a 12-inch circle; use a 12-inch round plate or bowl to mark the size for a clean cut. Repeat with second dough, setting one aside in the fridge until needed. ", 
            "Place first round on a parchment- or nonstick mat-lined baking sheet. Spread with filling to all but 1-inch from edge. Dab edges with water and place second round on top. Set a small glass upside down in the middle. Being careful not to cut through parchment paper or baking mat, cut away from glass (i.e. not through center) in quarters, or at the 3-, 6-, 9- and 12 o’clock marks. Cut through each quarter again, making 8 strips, and again, making 16 strips, and one last time so that you have 32  “rays” of pastry emanating from the center. If at any point in the cutting the pastry feels annoyingly soft and hard to cut, just pop the tray in the freezer for a few minutes to firm it back up.", 
            "Remove glass. Place finger near center of each ray (where it is most likely to break off prematurely) and gently twist each strand a few times. Beat egg yolk with 1 teaspoon water; brush it over pastry and sprinkle with seeds, if desired. ", 
            "Bake for 30 to 35 minutes, until golden brown all over. ", 
            "Meanwhile, make whipped feta dip: Blend all filling ingredients in a blender or food processor until smooth. Adjust seasonings to taste. Place in bowl for dipping.", 
            "Remove tart from oven, let cool on baking sheet for 10 minutes then transfer to a serving platter. Tear off rays of sun, dip in whipped feta; repeat as needed."
        ], 
        "date": "2015-12-29T12:01:15+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds (680 grams or 24 ounces or about 5 cups) thinly sliced yellow onions", 
            "3 tablespoons (42 grams or 1 1/2 ounces) unsalted butter", 
            "1 tablespoon (15 ml) olive oil", 
            "1 teaspoon (5 grams) table salt, plus additional to taste", 
            "1/4 teaspoon (1 gram) granulated sugar (helps the onions to brown)", 
            "3 tablespoons (24 grams or 7/8 ounce) all-purpose flour", 
            "2 quarts (8 cups or 1.9 liters) beef or other brown stock*", 
            "1/2 cup (118 ml) dry white wine or dry white vermouth", 
            "Freshly ground black pepper", 
            "3 tablespoons (45 ml) cognac or brandy (optional)", 
            "To finish [Gratinée] (Optional)", 
            "1 tablespoon grated raw onion", 
            "1 to 2 cups (to taste) grated Swiss (I often use Gruyere) or a mixture of Swiss and Parmesan cheese", 
            "1 tablespoon butter, melted", 
            "12 to 16 1-inch thick rounds French bread, toasted until hard"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/04/french-onion-soup.jpg?w=750", 
        "tags": [
            "Budget", 
            "French", 
            "Onions", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2011/04/french-onion-soup/", 
        "title": "french onion soup", 
        "directions": [
            "Melt the butter and oil together in the bottom of a 4- to 5-quart saucepan or Dutch oven over moderately low heat. Add the onions, toss to coat them in oil and cover the pot. Reduce the heat to real low and let them slowly steep for 15 minutes. They don’t need your attention; you can even go check your email.", 
            "After 15 minutes, uncover the pot, raise the heat slightly and stir in the salt and sugar. Cook onions, stirring frequently, for 30 to 40 minutes until they have turned an even, deep golden brown. Don’t skimp on this step, as it will build the complex and intense flavor base that will carry the rest of the soup. Plus, from here on out, it will be a cinch.", 
            "After the onions are fully caramelized, sprinkle them with flour and cook, stirring, for 3 minutes. Add the wine in full, then stock, a little at a time, stirring between additions. Season to taste with salt and pepper. Bring to a simmer and simmer partially covered for 30 to 40 more minutes, skimming if needed. Correct seasonings if needed but go easy on the salt as the cheese will add a bit more saltiness and I often accidentally overdo it. Stir in the cognac, if using. I think you should.", 
            "Set aside until needed. I find that homemade onion soup is so deeply fragrant and flavor-rich that it can stand alone, but that doesn’t mean we don’t enjoy the graitinéed top once in a while. Here’s how to pull it off:", 
            "Preheat oven to 325. Arrange six ovenproof soup bowls or crocks on a large, foil-lined baking sheet. Bring the soup back to a boil and divide among six bowls. To each bowl, add 1/2 teaspoon grated raw onion and a tablespoon of grated cheese. Stir to combine. Dab your croutons with a tiny bit of butter and float a few on top of your soup bowls, attempting to cover it. Mound grated cheese on top of it; how much you use will be up to you. [Julia Child, in another era, felt that 1/2 cup of grated cheese could be divided among 6 bowls. I can assure you that if you’d like your gooey bubbling cheese lid to be anything like what you get at your local French restaurant, you are looking to use more, such as a generous 1/4 cup.]", 
            "Bake soups on tray for 20 minutes, then preheat broiler. Finish for a minute or two under the broiler to brown the top lightly. Grab pot holders, and serve immediately.", 
            "*  Porcini or mushroom stock are a robust vegetarian substitution."
        ], 
        "date": "2011-04-09T11:48:38+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "2 cups (250 grams) all-purpose flour", 
            "1/4 teaspoon table salt", 
            "1/2 cup (1 stick, 4 ounces or 113 grams) chilled butter, in cubes", 
            "3 tablespoons cold water", 
            "Filling", 
            "1 1/2 pounds yellow onions (about 4 medium), halved and thinly sliced", 
            "1 tablespoons butter", 
            "1 tablespoon olive oil", 
            "Scant 1/2 teaspoon table salt", 
            "Pinch of sugar", 
            "1 cup low-sodium beef, veal or mushroom stock/broth", 
            "2 teaspoons cognac, brandy or vermouth (optional)", 
            "Freshly ground black pepper", 
            "1/2 cup (about 2 ounces or 60 grams) grated Gruyere, Comte or Swiss cheese", 
            "1 large egg", 
            "1/2 cup heavy cream (half-and-half and milk work too, but cream tastes best)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/french-onion-tart-uk-cookbook-release1.jpg?w=500", 
        "tags": [
            "Announcements", 
            "Budget", 
            "French", 
            "Onions", 
            "Photo", 
            "Tarts/Quiche", 
            "Winter"
        ], 
        "url": "https://smittenkitchen.com/2013/03/french-onion-tart-uk-cookbook-release/", 
        "title": "french onion tart + uk cookbook release", 
        "directions": [
            "Make crust: Mix flour and salt together in a large bowl or the work bowl of a food processor. Add butter; either rub the butter bits into the flour with your fingertips, with a pastry blender or (in the food processor option) by pulsing the machine on in short bursts until the mixture resembles breadcrumbs. Sprinkle in cold water and mix it with a spoon, a few more cuts with a handheld pastry blender, or by pulsing the machine a couple more times. The mixture should form large clumps. Knead it gently into a ball; it will be on the firm side but should be easy to roll. ", 
            "Lightly butter a 9-inch round tart pan with a removable base. Don’t have one? Try a standard pie dish or even a 9-inch cake pan. The second two options will be hard/impossible to unmold later, but there’s no harm in serving the tart from its baking pan.", 
            "Roll your dough out between two pieces of plastic wrap until it is about 11 inches in diameter. Peel the top plastic layer off and reverse the dough into the prepared tart pan, lifting the sides to drape (rather than pressing/stretching the dough) the dough into the corners. Press the dough the rest of the way in and up the sides. Trim edges, which you can leave ever-so-slightly extended above the edge of the tart pan, to give you some security against shrinkage. Chill for 15 minutes in your freezer. ", 
            "If par-baking the crust (see notes up top for pros/cons): Heat oven to 400 degrees. Lightly butter a piece of foil and press it tightly into your firm-from-the-freezer tart shell. Fill tart shell with pie weights, dried beans or rice or pennies and blind bake for 12 to 14 minutes. Remove from oven, carefully remove foil and weights, and return to oven for another 5 to 7 minutes, until lightly golden at edges. Set aside until needed.", 
            "Make filling: Melt the butter and olive oil together in a large skillet over medium heat. Add the onions to the pan, toss them gently with the butter and oil, reduce the heat to medium-low, and cover the pan. Cook the onions for 15 minutes, then remove the lid, stir in the salt and sugar and saute without the lid for about 10 to 15 minutes, until the onions are fully caramelized and have taken on a deep golden color. Pour in cognac, if using it, and the stock, then turn the heat all the way up and scrape up any brown bits stuck to the pan. Simmer the mixture until the broth nearly completely disappears (wetter onions will make for a wetter quiche), about 5 to 10 minutes. Adjust the salt, if needed, and season with freshly ground black pepper. [Updated to add.] Let cool until warm. You can hasten this process by spreading the onions out on a plate in the fridge, or even faster, in the freezer.", 
            "In a mediu bowl, beat the egg and cream together. [Update] Gently stir the lukewarm onions into the custard.", 
            "Heat oven to 400 degrees.", 
            "Assemble and bake tart: Fill prepared tart shell with onion-egg mixture. Ideally, this will bring your filling level to 1/4-inch from the top, however, variances in shells, pans, pan sizes and even onion volume might lead you to have a lower fill line. You can beat another egg with cream together and pour it in until it reaches that 1/4-inch-from-top line if you wish. Sprinkle cheese over custard and bake 25 to 30 minutes, or until a sharp knife inserted into the filling and turned slightly releases no wet egg mixture. Serve hot or warm, with a big green salad."
        ], 
        "date": "2013-03-04T11:34:28+00:00"
    }, 
    {
        "ingredient_list": [
            "1 pound mix leftover cheese, harder cheeses grated, softer ones cut into chunks", 
            "A couple pats of butter, if using mostly firm cheese varieties", 
            "1 small clove garlic, minced, or more to taste", 
            "1/2 to 1 cup leftover white wine", 
            "1 to 2 tablespoons finely chopped fresh herbs, such as parsley, thyme, rosemary or chives", 
            "Salt and freshly ground black pepper to taste"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2012/12/fromage-fort.jpg?w=751", 
        "tags": [
            "Appetizers + Party Snacks", 
            "French", 
            "Photo", 
            "Quick", 
            "Snack"
        ], 
        "url": "https://smittenkitchen.com/2012/12/fromage-fort/", 
        "title": "fromage fort", 
        "directions": [
            "Blend cheese, butter (if using) and garlic in food processer until combined. Drizzle in wine with the motor running until you get your desired consistency — some like it completely smooth, others prefer chunks. Add herbs, pulsing the machine until just combined. Season to taste with salt and pepper.", 
            "Fromage fort can be used right away, or kept in the fridge until needed. In the fridge, it will thicken and age a little; the flavors will mingle and deepen."
        ], 
        "date": "2012-12-28T11:32:40+00:00"
    }, 
    {
        "ingredient_list": [
            "1 large baking potato (1 pound), peeled", 
            "1 small onion (4 ounces), peeled", 
            "1/4 cup all-purpose flour", 
            "1 tablespoon matzo meal", 
            "1 large egg, lightly beaten", 
            "1 1/2 teaspoons salt (update: found later on we preferred only one teaspoon salt)", 
            "1/2 teaspoon freshly ground pepper", 
            "Peanut oil, for frying ", 
            "For short ribs", 
            "4 (8-oz) pieces bone-in beef short ribs", 
            "1 tablespoon vegetable oil", 
            "3/4 teaspoon fine sea salt", 
            "1/2 teaspoon black pepper", 
            "4 medium carrots, finely chopped", 
            "1 medium onion, finely chopped", 
            "2 garlic cloves, finely chopped", 
            "1 (14-oz) can whole San Marzano tomatoes in juice, puréed", 
            "in a blender with juice", 
            "1 1/2 cups dry red wine", 
            "4 cups brown veal stock or 1/2 cup Demi-Glace Gold concentrate (concentrate requires a dilution ratio of 1:8; 1/2 cup concentrate to 4 cups water)*", 
            "2 sprigs fresh thyme", 
            "1 Turkish or 1/2 California bay leaf", 
            "1 tablespoon Banyuls vinegar or red-wine vinegar", 
            "1 tablespoon balsamic vinegar", 
            "For vegetables", 
            "20 pearl onions (5 oz)", 
            "1 1/2 tablespoons unsalted butter", 
            "1 tablespoon Banyuls vinegar or red-wine vinegar", 
            "2 cups chicken stock or reduced-sodium chicken broth (16", 
            "fl oz)", 
            "4 medium carrots, cut diagonally into 1 1/2-inch pieces", 
            "3 thick bacon slices (preferably applewood-smoked; 1/4 lb total), cut crosswise into 1/4-inch pieces**", 
            "8 medium fresh white mushrooms, trimmed and quartered lengthwise ", 
            "Braise short ribs: ", 
            "Put oven rack in lower third of oven and preheat oven to 250»F.", 
            "Cook vegetables while beef braises: ", 
            "Blanch pearl onions in a wide 2- to 3-quart heavy saucepan of boiling water 1 minute, then drain in a sieve. When just cool enough to handle, peel onions with a paring knife, trimming root end just enough to leave onions intact.", 
            "Assemble dish: ", 
            "Transfer a short rib to each of 4 soup plates and keep warm in oven. Pour sauce through a medium-mesh sieve into a large bowl, pressing on and then discarding solids, then skim fat from sauce. Boil sauce, if necessary, until thickened and reduced to about 3 cups. Season with salt and pepper. Add about 2 cups sauce to vegetables (reserve remaining sauce for another use), then spoon mixture around short ribs."
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/gutted-and-glutted1.jpg?w=500", 
        "tags": [
            "Freezer Friendly", 
            "French", 
            "Meat", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/12/gutted-and-glutted/", 
        "title": "short ribs bourguignon", 
        "directions": [], 
        "date": "2006-12-17T22:20:41+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/magnificence-au-vin1.jpg?w=500", 
        "tags": [
            "French", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2006/12/magnificence-au-vin/", 
        "title": "coq au vin", 
        "directions": [
            "1.\tRemove the rind of and cut the bacon into lardons (rectangles 1/4-inch across and 1 inch long). Simmer for 10 minutes in 2 quarts of water. Rinse in cold water. Dry. [Deb note: As noted, I’d totally skip this step next time.]", 
            "2.\tSauté the bacon slowly in hot butter until it is very lightly browned. Remove to a side dish.", 
            "3.\tDry the chicken thoroughly. Brown it in the hot fat in the casserole.", 
            "4.\tSeason the chicken. Return the bacon to the casserole with the chicken. Cover and cook slowly for 10 minutes, turning the chicken once.", 
            "5.\tUncover, and pour in the cognac. Averting your face, ignite the cognac with a lighted match. Shake the casserole back and forth for several seconds until the flames subside.", 
            "6.\tPour the wine into the casserole. Add just enough stock or bouillon to cover the chicken. Stir in the tomato paste, garlic and herbs. Bring to the simmer. Cover and simmer slowly for 25 to 30 minutes, or until the chicken is tender and its juices run a clear yellow when the meat is pricked with a fork. Remove the chicken to a side dish.", 
            "7.\tWhile the chicken is cooking, prepare the onions and mushrooms (recipe follows).", 
            "8.\tSimmer the chicken cooking liquid in the casserole for a minute or two, skimming off the fat. Then raise the heat and boil rapidly, reducing the liquid to about 2 1/4 cups. Correct seasoning. Remove from heat and discard bay leaf.", 
            "9.\tBlend the butter and flour together into a smooth paste (buerre manie). Beat the paste into the hot liquid with a wire whip. Bring to the simmer, stirring, and simmer for a minute or two. The sauce should be thick enough to coat a spoon lightly.", 
            "10.\tArrange the chicken in the casserole, place the mushrooms and onions around it and baste with the sauce. If this dish is not to be served immediately, film the top of the sauce with stock or dot with small pieces of butter. Set aside uncovered. It can now wait indefinitely.", 
            "11.\tShortly before serving, bring to the simmer, basting the chicken with the sauce. Cover and simmer slowly for 4 to 5 minutes, until the chicken is hot enough.", 
            "12.\tSever from the casserole, or arrange on a hot platter. Decorate with spring for parsley."
        ], 
        "date": "2006-12-28T17:35:19+00:00"
    }, 
    {
        "ingredient_list": [
            "Crust", 
            "1 stick plus two tablespoons cold salted butter (5 ounces), cut into cubes and chilled in freezer", 
            "1 tablespoon sugar (optional)", 
            "1 1/2 cup flour", 
            "3 to 6 tablespoons ice water", 
            "Filling", 
            "7 medium apples (I’ve had good results with Granny Smith, Gala, McIntosh…use your favorite, but make sure they are very firm, fresh and flavorful.)", 
            "1 stick (4 ounces) salted butter", 
            "1 cup sugar"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mollys-apple-tarte-tatin1.jpg?w=500", 
        "tags": [
            "Apple", 
            "Fall", 
            "French", 
            "Fruit", 
            "Guest Post", 
            "Photo", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/10/mollys-apple-tarte-tatin/", 
        "title": "molly’s apple tarte tatin", 
        "directions": [
            "Prepare Crust: I always use the food processor for this. Pre-mix the flour and sugar in the food processor container, and cube the butter on a plate. Then put the dry ingredients and the butter in the freezer for a while. This will get everything, including the blade and container, nice and chilled. The colder everything is, the flakier and more tender your crust will be. Prepare about 1/3 cup ice water and refrigerate.", 
            "After you’ve chilled everything for at least 20 minutes, add the cubes of butter to dry ingredients and pulse until the largest pieces of butter are no bigger than tiny peas.", 
            "Add the ice water a little at a time, processing just until the dough starts to come together into a mass. (it won’t quite be a “ball,” and it won‘t look smooth–you don’t want to overprocess it!) Turn out onto well-floured surface and pat together into a ball. Don’t handle the dough too much, or the warmth of your hands will start to melt the butter. Flour the top of the dough and use rolling pin to quickly press and roll the dough out into a 10 to 11-inch circle. Keep turning the dough as you do this to make sure it doesn’t stick to the rolling surface. Throw more flour underneath the dough if necessary. Check the crust to make sure it’s just big enough to cover the top of your tarte tatin pan. Move the crust onto a piece of parchment paper or onto a floured rimless baking sheet, cover with plastic wrap and refrigerate.", 
            "Prepare filling: Preheat oven to 375° F.", 
            "Peel, core and quarter the apples. Don’t cut them into smaller pieces than quarters–the quarters shrink considerably during cooking. You can squeeze a bit of lemon on them, but it’s not necessary.", 
            "Over low heat in a heavy, ovenproof skillet measuring 7 to 8 inches across the bottom and 10 to 11 inches across the top, melt the stick of butter. Remove from heat, add the sugar and stir until blended.", 
            "Shake/tap the pan so the butter-sugar mixture distributes evenly across the bottom. Arrange apple quarters in pan, first making a circle inside the edge of the pan. Place them on their sides and overlap them so you can fit as many as possible. Then fill the center of the pan; you may have some apple left over. Keep at least one extra apple quarter on hand–when you turn the apples over, they may have shrunk to the extent that you’ll need to cheat and fill in the space with an extra piece. This one piece won’t get quite as caramelized as the other pieces, but don’t worry–it will still cook through and no one will notice.", 
            "Return your pan to the stovetop on high heat. Let boil for 10 to 12 minutes or until the juices in the pan turn from golden in color to dark amber. Remove from heat. With the tip of a sharp knife, turn apple slices over, keeping them in their original places. If necessary, add an extra slice of apple to keep your arrangement intact. Return to the stovetop on high heat once more. Let cook another 5 minutes and then remove from heat.", 
            "Place the crust on top of the apples and brush off excess flour. Tuck edges under slightly, along the inside of the pan, being careful not to burn fingers. You can use your knife.", 
            "Bake in oven until the top of the crust is golden-brown in color, about 25-35 minutes. Remove from oven and allow to cool on a rack about 30 minutes.", 
            "Run a sharp knife along the inside edge of the pan. Place a plate or other serving dish on top of the pan and quickly flip over the whole shebang so the Tarte Tatin drops down onto the plate. The pan will still be hot, so use potholders and be careful! Don’t burn yourself or drop stuff! If you are feeble and clumsy, get someone stronger and more coordinated than you to do this. Peek under the edge of the pan to see if the Tarte came out. You may need to bop the bottom of the pan with your potholder-encased fist for this to happen. If there are any pieces of apple left behind in the pan or otherwise out of place, carefully put them back where they are supposed to be. Voila! A beautiful TREAT!", 
            "This keeps well for about a day at room temperature; if you have to refrigerate it, warm it up slightly before serving for optimum enjoyment."
        ], 
        "date": "2008-10-13T12:00:00+00:00"
    }, 
    {
        "ingredient_list": [
            "2 cups light, dry white win or 1 cup dry white vermouth", 
            "An 8- to 10-quart enameled kettle with cover, though I’ve made this in many other pots successfully", 
            "1/2 cup minced shallots, or green onions, or very finely minced onions", 
            "8 parsley sprigs", 
            "1/2 bay leaf", 
            "1/4 teaspoon thyme", 
            "1/8 teaspoon pepper", 
            "6 tablespoons butter", 
            "6 quarts scrubbed, soaked mussels", 
            "1/2 cup roughly chopped parsley ", 
            "6 russet potatoes", 
            "1/4 cup extra-virgin olive oil*", 
            "Salt and freshly ground black pepper "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2006/08/moules-frites.jpg?w=750", 
        "tags": [
            "French", 
            "Gluten-Free", 
            "Photo", 
            "Seafood"
        ], 
        "url": "https://smittenkitchen.com/2006/08/moules-frites/", 
        "title": "moules à la marinière", 
        "directions": [
            "Preheat the oven to 400 degrees F. Peel potatoes (if peeled fries are your thing, skip it if you couldn’t care) and cut into half-inch thick slices (lengthwise) cut again into 1/2-inch thick fries. Place the potatoes into a pot with cold water and 1 tablespoon of salt. Bring up to a gentle boil and simmer until a paring knife tip goes through easily, cooked about 3/4 of the way through. ", 
            "Drain carefully and put potatoes a bowl. Add olive oil, 1 tablespoon salt, 1/2 teaspoon black pepper. Toss well and lay out in 1 layer on baking sheet. Bake until light brown. ", 
            "* I used less this time, oiling the baking sheet first to limit sticking. He suggests you use a non-stick baking sheet if you have one. (I don’t.)"
        ], 
        "date": "2006-08-26T11:10:53+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup sugar", 
            "3 ounces (6 tablespoons) salted butter, the better you can get, the better it will taste", 
            "1/2 cup plus two tablespoons heavy cream, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/paris-a-deep-dark-salted-butter-caramel-sauce1.jpg?w=500", 
        "tags": [
            "French", 
            "Photo", 
            "Travel"
        ], 
        "url": "https://smittenkitchen.com/2008/10/paris-a-deep-dark-salted-butter-caramel-sauce/", 
        "title": "paris + a deep, dark salted butter caramel sauce", 
        "directions": [
            "Melt the sugar over medium to moderately high heat in a larger pot than you think you’ll need–at least two or three quarts, whisking or stirring the sugar as it melts to ensure it heats evenly. Cook the liquefied sugar to a nice, dark copper color. Add the butter all at once and stir it in, before turning off the stove and pour in the heavy cream (The sauce will foam up quite a bit when you add it; this is why you want the larger pot.), whisking it until you get a smooth sauce. ", 
            "You use it right away or pour it into a jar and store it in the fridge for up to two weeks. When you take it out, it will likely have thickened a bit but 60 seconds in the microwave brings it right back to pouring consistency.", 
            "Serve over everything."
        ], 
        "date": "2008-10-21T16:39:54+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 pounds or about 5 cups of thinly sliced yellow onions (Deb note: I find even 6-7 cups is never too much)", 
            "3 tablespoons butter", 
            "1 tablespoon oil", 
            "A heavy-bottomed 4-quart covered saucepan", 
            "1 teaspoon salt", 
            "1/4 teaspoon sugar (helps the onions to brown)", 
            "3 tablespoons flour", 
            "2 quarts boiling brown stock, canned beef bouillon, or 1 quart of boiling water and 1 quart of stock or bouillon", 
            "1/2 cup dry white wine or dry white vermouth", 
            "Salt and pepper to taste", 
            "3 tablespoons cognac", 
            "Rounds of hard-toasted French bread (see following recipe)", 
            "1 to 2 cups grated Swiss or Parmesan cheese (Deb note: I always use cave-aged gruyere)", 
            "1 1/2 tablespoons Champagne vinegar", 
            "1 teaspoon Dijon mustard", 
            "1 very small clove minced fresh garlic or 1 tablespoon minced shallot", 
            "1 egg yolk, at room temperature (Just omit it if it freaks you out)", 
            "1/4 teaspoon salt", 
            "1/8 teaspoon black pepper", 
            "1/4 cup good olive oil "
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/paris-instead1.jpg?w=500", 
        "tags": [
            "French", 
            "Photo", 
            "Soup"
        ], 
        "url": "https://smittenkitchen.com/2006/12/paris-instead/", 
        "title": "onion soup", 
        "directions": [
            "Salad greens or mesclun mix for 2 to 4 people", 
            "Whisk everything together. The Dijon and egg yolk act as emulsifiers so you don’t need to do that slow drizzle thing to convince them to merge.", 
            "Note: If you’re worried about raw egg, just omit it."
        ], 
        "date": "2006-12-12T09:32:09+00:00"
    }, 
    {
        "ingredient_list": [
            "1 1/2 cups (190 grams) all-purpose flour", 
            "1/2 cup (60 grams) confectioner’s sugar", 
            "1/4 teaspoon (1 to 2 grams) table salt", 
            "1 stick plus 1 tablespoon (9 tablespoons, 4 1/2 ounces or 130 grams) very cold (or frozen) unsalted butter, cut into small pieces", 
            "1 large egg yolk", 
            "Pears", 
            "4 cups (950 ml) water", 
            "1 1/4 cups (225 grams) sugar", 
            "1 1/2 tablespoons (20 ml) fresh lemon juice", 
            "3 medium-size firm but ripe Bosc pears, peeled (each about 7 ounces or 200 grams)", 
            "Almond Filling", 
            "2/3 cup (75 grams) blanched slivered almonds", 
            "1 tablespoon (10 grams) all purpose flour", 
            "7 tablespoons (90 grams) sugar", 
            "6 tablespoons (3 ounces or 85 grams) unsalted butter, room temperature", 
            "1 large egg", 
            "1/2 teaspoon almond extract or 2 teaspoons (10 ml) brandy (optional)"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pear-and-almond-tart1.jpg?w=500", 
        "tags": [
            "Fall", 
            "French", 
            "Fruit", 
            "Pear", 
            "Photo", 
            "Tarts/Pies"
        ], 
        "url": "https://smittenkitchen.com/2008/02/pear-and-almond-tart/", 
        "title": "pear and almond tart", 
        "directions": [
            "1 sweet tart shell, baked (recipe above) ", 
            "Powdered sugar (optional)", 
            "For pears: Bring 4 cups water, sugar, and lemon juice to boil in large saucepan over medium-high heat, stirring until sugar dissolves. Add pears. Reduce heat to medium and simmer until pears are very tender, turning occasionally, about 20 minutes. Cool pears in syrup. (Can be made 2 days ahead. Cover and refrigerate.)", 
            "For almond filling: Finely grind almonds and flour in processor. Mix in 7 tablespoons sugar, then butter and flavorings (if using). Blend until smooth. Mix in egg. Transfer filling to medium bowl. Cover and chill at least 3 hours. (Can be made 2 days ahead. Keep chilled.)", 
            "Position rack in center of oven and preheat to 350°F. Spread almond filling evenly in baked tart crust. Stem pears and cut each in half lengthwise; scoop out cores. Cut each half crosswise into thin slices. Gently press each pear half to fan slices but keep slices tightly overlapped. Slide spatula under pears and arrange atop filling like spokes of wheel with narrow ends in center.", 
            "Bake tart until golden and tester inserted into center of filling comes out clean, about 55 minutes. Cool tart in pan on rack. Push pan bottom up, releasing tart from pan. (Can be made 8 hours ahead. Let stand at room temperature.) Cut tart into wedges; sprinkle with powdered sugar, if desired, and serve.", 
            "See also: A summer version — Plum-Almond Tart"
        ], 
        "date": "2008-02-20T15:01:17+00:00"
    }, 
    {
        "ingredient_list": [
            "1 3/4 cups diced leeks, white and light green only (from about 2 large leeks, although I think you can get away with one super-big leek)", 
            "3/4 cup diced onion", 
            "2 1/2 teaspoons olive oil (I needed a tad more)", 
            "1 1/4 cups flour", 
            "1 tablespoon plus 2 teaspoons cornstarch", 
            "Salt", 
            "6 tablespoons butter, diced", 
            "4 eggs, divided", 
            "1/2 cup plus 1 tablespoon heavy cream", 
            "1 cup plus 2 tablespoons sour cream", 
            "Pinch nutmeg", 
            "Pinch pepper", 
            "1 1/2 cups diced ham (1/4 -inch dice; I used about 1/2 pound)", 
            "3/4 cup grated Swiss cheese"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2009/10/quiche-lorraine.jpg?w=753", 
        "tags": [
            "Easter", 
            "French", 
            "Leeks", 
            "Meat", 
            "Photo", 
            "Picnics", 
            "Tarts/Quiche"
        ], 
        "url": "https://smittenkitchen.com/2009/10/quiche-lorraine/", 
        "title": "quiche lorraine", 
        "directions": [
            "1. Heat a large sauté pan over low heat. Sauté the leeks and onions in the olive oil 30 to 40 minutes until caramelized, occasionally stirring. Remove from heat and cool.", 
            "2. Meanwhile, in a large bowl, combine the flour, cornstarch and one-fourth teaspoon salt. Cut the butter in with a pastry blender, fork or two knives until it is in very tiny bits. Add one egg (a fork works great for this) and mix it until a dough forms. (Dough can also be made in a food processor, or in theory, and as the original recipe suggests, in a stand mixer.)", 
            "3. On a lightly floured surface, roll the dough out to a 12-inch circle. Place the dough in a 9-inch pie plate (I used an 8-inch deep tart pan, though ended up with extra filling) and press to remove any air bubbles. Crimp the edges, and refrigerate for 30 minutes.", 
            "4. While the quiche shell chills, mix the heavy cream and sour cream in a medium bowl. Whisk in the remaining three eggs. Add a pinch each nutmeg, salt and pepper and combine to form a batter. Preheat the oven to 350 degrees.", 
            "5. Remove the quiche shell from the refrigerator and spread the leek and onion mixture evenly over the base. Sprinkle the ham and then the cheese over the leeks and onions. Pour in the batter and place the quiche in the oven.", 
            "6. Bake until puffed and golden, about 25 to 30 minutes (a deeper pan, such as the one I used, will require extra baking time). Remove from the oven and cool slightly on a rack. Serve warm or at room temperature."
        ], 
        "date": "2009-10-07T11:32:31+00:00"
    }, 
    {
        "ingredient_list": [
            "8 ounces bittersweet chocolate (no more than 60% cacao), chopped", 
            "3/4 stick (3 ounces) unsalted butter, cut into 6 pieces", 
            "3 large eggs, separated", 
            "1 tablespoon Cognac or other brandy (or swap with a liqueur of your choice)", 
            "1 cup very cold heavy or whipping cream", 
            "1/8 teaspoon salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/02/old-school-chocolate-mousse1.jpg?w=640", 
        "tags": [
            "Chocolate", 
            "French", 
            "Photo", 
            "Pudding"
        ], 
        "url": "https://smittenkitchen.com/2009/10/silky-decadent-old-school-chocolate-mousse/", 
        "title": "silky, decadent old-school chocolate mousse", 
        "directions": [
            "Get out one large heatproof, two medium and one small mixing bowl and dust off your electric hand mixer.", 
            "Set the large bowl over a saucepan of barely simmering water and melt the chocolate and butter in it, gently stirring it until smooth. Remove from heat. Alternately, you can melt them in your microwave, stirring thoroughly at 30 seconds and every 15 seconds thereafter until the mixture is smooth.", 
            "In the small bowl, beat yolks with your electric mixer until thick enough to form a ribbon that takes a few seconds to dissolve — this will take about two to four minutes to achieve. Whisk yolks into chocolate mixture along with Cognac, then cool to warm.", 
            "In one of the medium bowls, beat the cream with cleaned beaters until it just holds stiff peaks.", 
            "In the other medium bowl, beat the egg whites and salt with cleaned beaters until they just hold soft peaks.", 
            "Fold the whipped cream and beaten whites into the chocolate mixture, gently but thoroughly. Transfer to 8 (4 ounce) ramekins or one large serving bowl, or go restaurant-style, serving it in stemmed glasses with white or dark chocolate shavings on top.", 
            "Do ahead: Mousse can be chilled, its surface covered with parchment paper, up to 2 days, though I’ve never heard of it lasting that long with hungry people named Deb around. Let stand at room temperature at least 30 minutes before serving."
        ], 
        "date": "2009-10-26T11:52:59+00:00"
    }, 
    {
        "ingredient_list": [
            "1 cup (250 ml) water", 
            "1/2 teaspoon salt", 
            "1 tablespoon sugar", 
            "6 tablespoons (90 grams) unsalted butter, cut into small chunks", 
            "1 cup (135 gram) flour", 
            "4 large eggs, at room temperature"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sugar-puffs1.jpg?w=500", 
        "tags": [
            "Cookie", 
            "French", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2009/01/sugar-puffs/", 
        "title": "sugar puffs", 
        "directions": [
            "Glaze: 1 egg yolk whisked with 1 teaspoon milk", 
            "Toppings: Pearl sugar [see places to buy them at the end] and/or miniature chocolate chips", 
            "Preheat the oven to 425°F (220°C). Line a cookie sheet with a reusable nonstick baking mat or parchment paper.", 
            "Heat the water, salt, sugar, and butter in a meduim saucepan, stirring, until the butter is melted. Remove the pot from the heat heat and dump all the flour in at once. Mix vigorously with a wooden spoon until the mixture forms a smooth ball and pulls away from the sides of the pan.", 
            "Let the dough cool for five minutes, then briskly beat in the eggs, one at a time, until the dough is smooth and shiny. [At this point you can cover the pot and chill it in the fridge for up to a day.]", 
            "Using two spoons, a piping bag fitted with a wide tip, a zip-lock bag with a one-inch corner cut off or a spring-loaded large cookie scoop, pipe or scoop the dough into walnut-sized mounds spaced evenly on the baking sheet.", 
            "(If you find your dough to be a bit thin at this point, as you can see mine was in the photos, do not fret. They still puff just fine. And if they don’t, David says he sees bakeries all over Paris selling flat ones, so perhaps you’re just being trendy!)", 
            "Brush the top of each mound with some of the egg glaze then press coarse sugar crystals or miniature chocolate chips over the top and sides of each mound. You want to be generous because the puffs will expand a lot, and you’ll want that area to be covered.", 
            "Bake the cream puffs for 20 to 35 minutes, or until puffed and well-bronzed. (Yes, this is a rather long range in baking time but I know that in choux recipes especially, baking times can greatly vary depending on the heat of an oven and how fast it browns the top of items. Watch for that nicely bronzed color rather than a precise cooking time.)", 
            "Do ahead: Sugar puffs are best the day that they’re made. I find if they’re stored overnight in an airtight container, they get damp on top and the sugar and chips will slide off, though you can easily re-crisp them in the oven If you can deal with them being a bit dryer on day two you can leave them out unwrapped. Chouquettes can also be frozen in a freezer bag for up to a month, and re-crisped in the oven once defrosted.In addition, you can store the unpiped/scooped dough in the fridge for up to a day.", 
            "Places to buy sucre perlé or coarse white sugar: The Baker’s Catalogue, L’Epicerie, Ikea (!), Amazon and if you’re in New York City, the Cake and Baking Supply store on 22nd Street.", 
            "I bought mine at G. Detou in Paris in October, tra-la-la, along with a vial of the fattest vanilla beans ever, more Dijon mustard than normal people would go through in a decade yet regrettably not the 3-kilo super low-priced box of Valrhona cocoa, because I had no room left in my suitcase. And yes, I am still kicking myself."
        ], 
        "date": "2009-01-17T12:19:42+00:00"
    }, 
    {
        "ingredient_list": [], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2016/01/swiss-chard-pancakes-farcous1.jpg?w=640", 
        "tags": [
            "Freezer Friendly", 
            "French", 
            "Pancakes", 
            "Photo", 
            "Swiss Chard", 
            "Vegetarian", 
            "Weeknight Favorite"
        ], 
        "url": "https://smittenkitchen.com/2016/01/swiss-chard-pancakes/", 
        "title": "swiss chard pancakes", 
        "directions": [
            "To serve: Plain, thick yogurt mixed with a little lemon zest, lemon juice and salt, to taste", 
            "If you’d like to keep your finished pancakes warm while you cook them: Heat oven to 250 degrees F and line a baking sheet with foil. ", 
            "Make the batter: Put everything except the Swiss chard and oil in a blender or food processor and whirl until the batter is smooth. Scrape down sides. Add chard leaves and pulse machine until they’re chopped to your desired consistency. ", 
            "Cook the pancakes: Heat a large skillet over medium-high heat and pour in a good puddle (1/4-inch deep) of oil. Once oil is hot enough that a droplet of batter hisses and sputters, spoon about 3 tablespoons batter in per pancake. It will spread quickly. Cook until browned underneath and (the edges will scallop, adorably), then flip, cooking on the other side until browned again. Transfer to a paper towel-lined plate, and then, if you’d like to keep them warm, to the foil-lined tray in the oven. ", 
            "Repeat with remaining batter. Serve with lemony yogurt or another sauce of your choice. ", 
            "Do ahead: Unused batter keeps in fridge for 3 days. Finished pancakes keep in fridge for a couple days, and will freeze much longer. Separate pancakes with pieces of waxed or parchment paper so they don’t glue together."
        ], 
        "date": "2016-01-11T12:02:29+00:00"
    }, 
    {
        "ingredient_list": [
            "3 pounds fresh spinach", 
            "3 1/2 to 4 1/2 tablespoons unsalted butter", 
            "Salt and pepper", 
            "1 1/2 tablespoons flour", 
            "1 cup stock (your choice; Julia recommends beef) or cream (I used stock; it doesn’t *need* cream)", 
            "3/4 cup grated Swiss cheese", 
            "2 tablespoons fine, dry breadcrumbs"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2011/03/best-baked-spinach.jpg?w=751", 
        "tags": [
            "French", 
            "Photo", 
            "Put An Egg On It", 
            "Side Dish", 
            "Spinach", 
            "Thanksgiving", 
            "Vegetarian"
        ], 
        "url": "https://smittenkitchen.com/2011/03/the-best-baked-spinach/", 
        "title": "the best baked spinach", 
        "directions": [
            "Stem and wash your spinach (see Tips below) well but no need to spin or pat it dry. Place spinach in a large pot over high heat. Cook, covered, with just the water clinging to leaves, stirring occasionally, until wilted, about 2 to 4 minutes for baby spinach and 4 to 6 minutes for regular spinach. Transfer to a colander, immediately fill pot with cold water, transfer it back to the pot of cold water to shock it (stop the cooking) and drain again. Squeeze a small amount of the spinach at a time in your hands to extract as much water as possible. Chop the spinach coarsely. You should have about 3 cups of chopped spinach, or about 1 cup per pound.", 
            "Wipe out pot then melt 2 tablespoons butter over moderately high heat and stir in the spinach. Cook for 2 to 3 minutes or until all of the moisture from the spinach has boiled off — you’ll know you’re done when the spinach begins to stick to the pan.", 
            "Lower the heat and sprinkle with flour and stir for 2 minutes to cook the flour. Add 2/3 of your stock or cream, a tiny bit at a time, scraping up any stuck spinach as you do. Once the liquid is added, simmer for another minute or two, stirring frequently to prevent sticking. If you’re feeling especially indulgent, stir in one more tablespoon of butter. If needed, add all or part of remaining liquid. Season with salt (I found 1/2 teaspoon table salt about right) and pepper.  ", 
            "Preheat oven to 375 degrees. Lightly butter a shallow 1-quart baking dish. Stir 1/2 cup cheese into the spinach and pour it into the baking dish. Mix the remaining cheese with breadcrumbs and sprinkle on spinach. Melt 1 1/2 tablespoons remaining butter and pour it over the top. Bake until heated through and slightly brown on the top, about 30 minutes.", 
            "Serve with steaks, chops, veal, chicken, broiled fish or, if you’re us, eggs, glorious eggs.", 
            "Do ahead: Spinach can be blanched and chopped several hours or a day in advance. Cover and refrigerate until needed. Gratin can be fully assembled and 30 minutes before needed, placed in a preheated 375 degree oven to bake, then served.", 
            "To stem spinach, as per Julia: If spinach is young and tender, remove the stems at the base of the leaf. If more mature, fold the leaf vertically with its underside up, grasp the leaf in one hand and the stem in the other and and rip it off toward the tip of the leaf, removing the stem and the tough tendrils. Discard any wilted or yellow leaves.", 
            "How I wash greens: Fill a large bowl or basin with cold water. Drop in the spinach and swish it around a few times so it deposits any sand and grit before lifting it out of the bowl (leaving any grit/dirt at the bottom of the bowl and not dragging the clean leaves through it) and drop it in a colander. No need to dry it for this recipe, but in others, I either spread it out on towels or run it through a salad spinner."
        ], 
        "date": "2011-03-08T19:45:59+00:00"
    }, 
    {
        "ingredient_list": [
            "9 tablespoons (125 grams) unsalted butter", 
            "7 ounces (200 grams) bittersweet (70/72 percent) chocolate, chopped", 
            "3 tablespoons water", 
            "3/4 teaspoon baking powder", 
            "1/3 cup (40 grams) all-purpose flour", 
            "1/3 cup (about 30 grams) dark cocoa powder, sifted if lumpy (Dutched or natural will work here; I use Dutched)", 
            "4 large eggs, separated", 
            "1 cup (200 grams) granulated sugar", 
            "1/2 teaspoon vanilla extract (optional)", 
            "Two pinches sea salt"
        ], 
        "img": "https://smittenkitchendotcom.files.wordpress.com/2014/12/valeries-french-chocolate-cake1.jpg?w=640", 
        "tags": [
            "Cake", 
            "Chocolate", 
            "French", 
            "Photo"
        ], 
        "url": "https://smittenkitchen.com/2014/06/valeries-french-chocolate-cake/", 
        "title": "valerie’s french chocolate cake", 
        "directions": [
            "Heat oven to 350 degrees. Butter a 9-inch round cake pan. Line the bottom of the baking pan with a round of parchment paper.  ", 
            "Melt butter in a large saucepan, 3 quarts is a good size. Once melted, remove from heat and stir in chocolate until melted. Once melted, stir in 2 tablespoons water, then baking powder, flour and cocoa until just combined.", 
            "In a medium bowl, whisk egg yolks with sugar, 1 tablespoon water and vanilla, if using, until pale and no longer lumpy. Stir into chocolate mixture until just combined.", 
            "In a larger, very clean bowl, beat egg whites and salt until stiff. Gently fold into chocolate mixture until most of the white streaks disappear. Be careful not to deflated cake.", 
            "Bake for 25 to 30 minutes, until a toothpick inserted into the center of the cake comes out batter-free. Remove from oven and rest on rack for 5 minutes. Run knife along outside cake to make sure it isn’t sticking anywhere, then invert onto another rack, then back onto a cake plate. Eat warm or cold.", 
            "Cake keeps for several days at room temperature, lightly wrapped. ", 
            "To make a layer cake, as pictured: Several hours and up to a full day before you will fill the cake, make chocolate whipped cream. I used Alice Medrich’s recipe as a base. Heat 1 cup heavy or whipping cream to a simmer in a saucepan. Remove from heat, whisk in 6 ounces chopped semisweet chocolate until fully melted and smooth. Stir in a second cup of cold heavy or whipping cream. Cover dish with plastic and let chill in the fridge for at least four hours and preferably overnight, or up to 24 hours. ", 
            "To make the layer cake, make twice the recipe above, but divide it into 3 9-inch cake pans. Each layer will bake for approximately 15 to 20 minutes. Let cool completely. I find popping cake layers into the freezer for 20 to 30 minutes stiffens them enough that they are easily lifted and stacked and highly recommend it.", 
            "Using electric beaters, whip fully chilled chocolate cream into whipped cream. It will whip very quickly; don’t let it overwhip (it will become rough-looking). If it does, a splash of still-liquid heavy cream whisked in will loosen the mixture a bit again. Set a spoonful of the chocolate whipped cream aside if you’d like to write on the top of the cake. Spread half of the chocolate whipped cream on the first cake layer, then top with the second. Spread second half of chocolate whipped cream on second cake layer, then top with the third. If writing on the cake, place chocolate whipped cream set aside in a sandwich bag with the corner snipped off, or in a piping bag with a small round tip and scribble away. ", 
            "Keep cake in fridge until needed.  "
        ], 
        "date": "2014-06-16T12:19:13+00:00"
    }
]