{
  "date": "2008-02-20T15:01:17+00:00",
  "directions": [
    "1 sweet tart shell, baked (recipe above) ",
    "Powdered sugar (optional)",
    "For pears: Bring 4 cups water, sugar, and lemon juice to boil in large saucepan over medium-high heat, stirring until sugar dissolves. Add pears. Reduce heat to medium and simmer until pears are very tender, turning occasionally, about 20 minutes. Cool pears in syrup. (Can be made 2 days ahead. Cover and refrigerate.)",
    "For almond filling: Finely grind almonds and flour in processor. Mix in 7 tablespoons sugar, then butter and flavorings (if using). Blend until smooth. Mix in egg. Transfer filling to medium bowl. Cover and chill at least 3 hours. (Can be made 2 days ahead. Keep chilled.)",
    "Position rack in center of oven and preheat to 350°F. Spread almond filling evenly in baked tart crust. Stem pears and cut each in half lengthwise; scoop out cores. Cut each half crosswise into thin slices. Gently press each pear half to fan slices but keep slices tightly overlapped. Slide spatula under pears and arrange atop filling like spokes of wheel with narrow ends in center.",
    "Bake tart until golden and tester inserted into center of filling comes out clean, about 55 minutes. Cool tart in pan on rack. Push pan bottom up, releasing tart from pan. (Can be made 8 hours ahead. Let stand at room temperature.) Cut tart into wedges; sprinkle with powdered sugar, if desired, and serve.",
    "See also: A summer version — Plum-Almond Tart"
  ],
  "img": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pear-and-almond-tart1.jpg?w=500",
  "ingredient_list": [
    "1 1/2 cups (190 grams) all-purpose flour",
    "1/2 cup (60 grams) confectioner’s sugar",
    "1/4 teaspoon (1 to 2 grams) table salt",
    "1 stick plus 1 tablespoon (9 tablespoons, 4 1/2 ounces or 130 grams) very cold (or frozen) unsalted butter, cut into small pieces",
    "1 large egg yolk",
    "Pears",
    "4 cups (950 ml) water",
    "1 1/4 cups (225 grams) sugar",
    "1 1/2 tablespoons (20 ml) fresh lemon juice",
    "3 medium-size firm but ripe Bosc pears, peeled (each about 7 ounces or 200 grams)",
    "Almond Filling",
    "2/3 cup (75 grams) blanched slivered almonds",
    "1 tablespoon (10 grams) all purpose flour",
    "7 tablespoons (90 grams) sugar",
    "6 tablespoons (3 ounces or 85 grams) unsalted butter, room temperature",
    "1 large egg",
    "1/2 teaspoon almond extract or 2 teaspoons (10 ml) brandy (optional)"
  ],
  "tags": [
    "Fall",
    "French",
    "Fruit",
    "Pear",
    "Photo",
    "Tarts/Pies"
  ],
  "title": "pear and almond tart",
  "url": "https://smittenkitchen.com/2008/02/pear-and-almond-tart/"
}